{
  "title": "The Anvil Stone",
  "description": "In fifth-century Britain, only a few souls believed Merlin the Enchanter’s prophecy, that the “once and future king” called Arthur would one day rescue them from fierce and deadly Saxons. In a world where “king” simply meant “warlord,” many would there even be a Britain left for Arthur to rule once he was born and old enough to wield a sword of his own? One man refused to let that dream fade into nightmarish despair… “Freedom is all that matters.” So says spy and master of disguise Marcus ap Iorwerth of his greatest dream. For years, he has courageously struggled to unite Britain’s feuding internal factions and derail the ever-encroaching Saxon threat that has made his homeland a deadly place. So when a mysterious stranger delivers a gruesome, bloodstained effigy fashioned to look like him, Marcus immediately knows it’s both a warning and a challenge. He and his wife Claerwen—whose gift of second sight makes her a target as well—run headlong into the daunting fray. Rival factions are instigating war both among themselves and with the Saxons, and while Marcus sets out to quash their treachery, Claerwen discovers another crisis. Those same factions have mounted a desperate search for one of Britain’s most cherished symbols—a magnificent sword of the ancient high kings that has been lost for decades. She knows the sword must be found; it is part of Britain’s future and will pass to a great king called Arthur who has been prophesied to come. With battle about to erupt all around, Marcus learns the stranger, an assassin bent on killing him, may be one of the last sources that could lead him and Claerwen to the sacred sword. The Anvil Stone brings the volatile tribal nature of Dark Age Britain to life and deftly interweaves it with its mystical Celtic roots and the promise of hope found in the Arthurian legend. A stunning display of the storyteller’s craft, this book is the third in the spectacular four-part Macsen’s Treasure series that began with Into the Path of Gods and In the Shadow of Dragons.",
  "genres": [
    "Fiction",
    "Historical Fiction"
  ],
  "author": "Kathleen Cunningham Guler",
  "average_rating": "3.36",
  "url": "https://www.goodreads.com/book/show/983610.The_Anvil_Stone"
}