{
  "title": "Chef Paul Prudhomme's Louisiana Tastes: Exciting Flavors from the State that Cooks",
  "description": "The master of Louisiana cuisine invites everyone to taste the new flavors of Louisiana cooking Chef Paul Prudhomme put Louisiana cooking on the map. Fifteen years have passed since the publication of his groundbreaking Chef Paul Prudhomme's Louisiana Kitchen. Now Chef Paul returns to his culinary roots to show us how Louisiana cooking has evolved.Today, the culinary influences of Asia, Latin America, the Middle East, and many other cuisines are being integrated into \"traditional\" Louisiana cooking. Chef Paul explores how Louisiana cooks have incorporated such newly available ingredients as lemongrass, fresh tamarind, and papaya into their dishes. As Chef Paul says, any Louisiana cook worth his or her salt will work with what's available -- familiar or not -- and turn it into something delicious. Andouille Spicy Rice gets its zing! from chipotle and pasilla chile peppers, and Roasted Lamb with Fire-Roasted Pepper Sauce is flavored with jalapeno peppers and fennel. Classic jambalaya, etouffee, and gumbo are reinvented with such far-flung ingredients as star anise, cilantro, yuca, plantain, and mango.Chef Paul Prudhomme's Louisiana Kitchen is an exciting exploration of the new flavors that have made Louisiana cooking even better.Chef Paul Prudhomme put Louisiana cooking on the map. Fifteen years have passed since the publication of his groundbreaking Chef Paul Prudhomme's Louisiana Kitchen. Now Chef Paul returns to his culinary roots to show us how Louisiana cooking has evolved. Today, the culinary influences of Asia, Latin America, the Middle East, and many other cuisines are being integrated into \"traditional\" Louisiana cooking. Chef Paul explores how Louisiana cooks have incorporated such newly available ingredients as lemongrass, fresh tamarind, and papaya into their dishes. As Chef Paul says, any Louisiana cook worth his or her salt will work with what's available -- familiar or not -- and turn it into something delicious. Andouille Spicy Rice gets its zing! from chipotle and pasilla chile peppers, and Roasted Lamb with Fire-Roasted Pepper Sauce is flavored with jalapeno peppers and fennel. Classic jambalaya, etouffee, and gumbo are reinvented with such far-flung ingredients as star anise, cilantro, yuca, plantain, and mango. Chef Paul Prudhomme's Louisiana Kitchen. is an exciting exploration of the new flavors that have made Louisiana cooking even better.Chef Paul Prudhomme put Louisiana cooking on the map. Fifteen years have passed since the publication of his groundbreaking Chef Paul Prudhomme's Louisiana Kitchen. Now Chef Paul returns to his culinary roots to show us how Louisiana cooking has evolved. Today, the culinary influences of Asia, Latin America, the Middle East, and many other cuisines are being integrated into \"traditional\" Louisiana cooking. Chef Paul explores how Louisiana cooks have incorporated such newly available ingredients as lemongrass, fresh tamarind, and papaya into their dishes. As Chef Paul says, any Louisiana cook worth his or her salt will work with what's available--familiar or not--and turn it into something delicious. Andouille Spicy Rice gets its zing! from chipotle and pasilla chile peppers, and Roasted Lamb with Fire-Roasted Pepper Sauce is flavored with jalapeno peppers and fennel. Classic jambalaya, etouffee, and gumbo are reinvented with such far-flung ingredients as star anise, cilantro, yuca, plantain, and mango. Chef Paul Prudhomme's Louisiana Kitchen. is an exciting exploration of the new flavors that have made Louisiana cooking even better.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction"
  ],
  "author": "Paul Prudhomme",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/983626.Chef_Paul_Prudhomme_s_Louisiana_Tastes"
}