{
  "title": "What are You Doing Here?: A Black Woman's Life and Liberation in Heavy Metal",
  "description": "What Are You Doing Here? investigates how black women musicians and fans navigate the metal, hardcore, and punk music genres that are regularly thought of as inclusive spaces and centered on a community spirit, but fail to block out the race and gender issues that exist in the outside world.“The first time I heard rock music it was really exciting. I felt that this new music and vibe was really me. I remember going to bed and having dreams that I was performing this music and visualizing myself on stage, way before it actually happened… What always appealed to me about rock music is the feeling of freedom, that I could finally be who I wanted to be and sing the music that I felt in my heart. Some black people that I met in the music industry felt that we could be stronger and better empowered if we all stayed within in the same box, but I had always relished the fact that I never belonged to any cliques, or any scenes…”—Skin, Skunk Anansie“I wanted to find other black women like me: metal, hardcore, and punk fans and musicians that were rabid about the music and culture and adamant about asserting their rightful place as black women within those scenes. I wanted to find other women who put aside the cultural baggage that dictates that we must listen to certain musical styles, and simply enjoy the music that influenced us, not just as black women, but as individuals who grew up in an era when, thanks to technology, a large variety of music is accessible and available to everyone. I found many black women and have shared their stories, but I also realize there is still a lot of work to be done.”—Laina DawesCONTENTS:“Who Put That Shaven-Headed Black Woman on the Stage?” Foreword by SkinIntroduction, by Laina DawesI. Canadian SteelII. Metal Can Save Your Life (or at Least Your Sanity)III. I’m Here Because We Started It!IV. So You Think You’re White?V. “The Only One” SyndromeVI. Too Black, Too Metal, and All WomanVII. The Lingering Stench of Racism in MetalVIII. Remove the Barricades and Stagedive!EpilogueAppendix: “What Are You Doing Here?”—The Survey",
  "genres": [
    "Music",
    "Nonfiction",
    "Memoir",
    "Feminism",
    "Biography",
    "Race",
    "African American"
  ],
  "author": "Laina Dawes",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/13238271-what-are-you-doing-here"
}