{
  "title": "The American West",
  "description": "Renowned storyteller Dee Brown, author of the bestselling Bury My Heart at Wounded Knee , recreates the struggles of Native Americans, settlers, and ranchers in this stunning volume that illuminates the history of the old West that’s filled with maps and vintage photographs.Beginning with the demise of the Native Americans of the Plains, Brown depicts the onrush of the burgeoning cattle trade and the waves of immigrants who ultimately “settled” the land. In the retelling of this oft-told saga, Brown has demonstrated once again his abilities as a master storyteller and an entertaining popular historian.By turns heroic, tragic, and even humorous, The American West brings to life American tragedy and triumph in the years from 1840 to the turn of the century, and a roster of characters both great and Red Cloud, Sitting Bull, Geronimo, Dull Knife, Crazy Horse, Captain Jack, John H. Tunstall, Billy the Kid, Pat Garrett, Wyatt Earp, the Hole-in-the-Wall Gang, Wild Bill Hickok, Charles Goodnight, Oliver Loving, Buffalo Bill, and many others.The American West is about cattle and the railroads; it is about settlers who came to claim a land not originally their own and how they slowly imposed law and order on these wild and untamed places; and it is about the wanton destruction of the Native American way of life. This is epic history at its best and popular history at its most readable.This new work is culled from Dee Brown’s highly acclaimed writings, which instantly established him as one of America’s foremost Western authorities. Fully revised, rewritten, and edited into one seamless account of America’s most famous frontier, this epic narrative, along with the introduction and a chronological table of events, etches an unforgettable and poignant portrait. The American West is at once a tribute to the West and a majestic new peak for a writer whose long and successful career has been synonymous with excellence in frontier history.",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Westerns",
    "The United States Of America",
    "Native American",
    "Historical"
  ],
  "author": "Dee Brown",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/984970.The_American_West"
}