{
  "title": "Four Years from Home",
  "description": "Tom Ryan -- firstborn of five children in a large, Irish Catholic family, smart and acerbic, a cheat and a bully -- calls himself the future king of the Ryans. There are other opinions. His mother calls him a holy terror. Mrs. Ioli calls the police on him. His father says that had Trouble been a saint, that would have been Tom's middle name. But his parents, neighbors, peers, and siblings all must bow down before him or suffer the consequences. Just ask the Christmas turkey leftovers he buried in the side yard.Harry, the youngest Ryan, was the shining star of the family. Bright, sensitive, and caring, he was protected by parental radar, called by God and Grandma Ryan to the priesthood, and was in Tom's eyes, a brown-nosing little punk who had become a threat to his kingdom and the primary target of his search and destroy missions.Then Harry changed. He abandoned his vocation and quit the church, and when he left for college, he left for good. He never called. He rarely wrote. His picture disappeared from the mantle. It was as if he had ceased to exist and his shining star had been but a passing comet. The enemy had retreated and Tom's war was over.\"Four Years from Home\" begins on Christmas 1972 during Harry's senior year at college. The Ryan family has gathered without Harry for another bittersweet holiday celebration. When an unexpected and unwelcome gift arrives, the family demands answers and Tom Ryan, bully cum laude, must make a reluctant journey of discovery and self-discovery into a mystery that can only end in tragedy.Written by the son of Irish Catholic immigrants, \"Four Years from Home\" redefines brotherly love in the darkly humorous and often poignant actions of its principal skeptic, Tom Ryan.BONUS MATERIAL in eBook Included is the beginning chapter of the highly acclaimed novel, \"Confessions,\" by Ryne Douglas Pearson. A powerfully-written mystery that transcends its genre, please enjoy this sample made possible by arrangement with the author.",
  "genres": [
    "Fiction",
    "Mystery",
    "Contemporary",
    "Thriller",
    "Amazon"
  ],
  "author": "Larry Enright",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/9845530-four-years-from-home"
}