{
  "title": "Stonewall's Gold: A Novel of the Civil War",
  "description": "Winner of the Civil War Society's Seal of ApprovalWinner of the Michael Shaara Award for Civil War FictionStonewall's Gold is an adventure story for readers of all ages in the classic tradition of Treasure Island and The Red Badge of Courage . Combining a fascinating and gripping narrative with a portrait of life in the Civil War-era South, it is also the moving story of a boy on the edge of manhood, taking on difficult challenges that force him to confront the world for the first time.The year of 1864 is a difficult time to be living in the Appalachian Mountains of Virginia. The Civil War is drawing to a close and, under the orders of General Sheridan, Union troops have laid waste to the countryside. Against this bleak backdrop, Jamie Lockhart's mother takes on a boarder to help her eke out a living until her husband returns from the war.Soon, someone begins desecrating local soldier's graves, and Jamie, an intrepid fifteen-year-old, discovers that their boarder is the culprit. Confronted, the boarder assaults Jamie's mother; defending her, Jamie kills him. In his personal effects Jamie discovers the item he was looking for in the graveyard, a cryptic map to Stonewall's gold. Thus begins Jamie's quest.Along the way, Jamie is faced with the best and the worst in human nature, and meets a young girl and falls in love for the first time. He becomes privy to the hidden politics behind the war when he stumbles upon escaped slaves on the Underground Railroad, and he is also forced to confront the ugly realities of war and the absurdity of the lost cause in the final days of the conflict.A ripping adventure yarn, a moving coming-of-age tale, and a fascinating portrait of the difficulty of life in the Appalachians at the end of the Civil War, Stonewall's Gold is a compelling novel that is certain to appeal to teacher and student alike.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Mystery",
    "Civil War",
    "American Civil War",
    "Historical"
  ],
  "author": "Robert J. Mrazek",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/98478.Stonewall_s_Gold"
}