{
  "title": "The Money Class: Learn to Create Your New American Dream",
  "description": "What does it take to create your New American Dream?Suze Orman, the woman millions of Americans have turned to for financial advice, says it’s time for a serious reconsideration of the American Dream—what promise it still holds, what aspects are in need of revision, and how it must be refashioned to fit our lives so that we can once again have faith that our hard work will pay off and that a secure and hopeful future is within our reach. In nine electrifying chapters, Orman delivers a master class on personal finance for this pivotal moment in time. She addresses every aspect of the American Dream—home, family, career, retirement. She teaches us that in order to create lasting security we must learn to stand in our truth. We must recognize, embrace, and be honest about what is real for us today and allow that understanding to inform the choices we make.  The New American Dream is not the things we accumulate, says Orman, but the confidence that comes from knowing that which we’ve worked so hard for cannot be taken away from us. In The Money Class , Orman teaches us how to take control over our present—right here, right now—in order to build the future of our dreams. Whether navigating the complicated mix of money and family, offering the most comprehensive retirement resource available today, or delivering a bracing dose of reality when it comes to recalibrating our expectations and our goals, Orman educates us with her signature no-nonsense approach and laser-like clarity. She empowers us to live a life of integrity and honesty that will create an enduring legacy for future generations—a New American Dream that lies in truth, security, financial freedom, and peace of mind.",
  "genres": [
    "Nonfiction",
    "Finance",
    "Personal Finance",
    "Money",
    "Business",
    "Self Help",
    "Audiobook"
  ],
  "author": "Suze Orman",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/9845875-the-money-class"
}