{
  "title": "The Dark Side of Light: A Medieval Time Travel Fantasy",
  "description": "Shallee, a PhD social activist in the twenty-first century, has disrupted the harmful social programming instigated by Raymond Mackelvie, a powerful business magnate who has been controlling the masses for decades. Hence, Mackelvie sets out to destroy her. Interestingly, her circumstance parallels a ninth-century past life that has always haunted her. In that life, her royal family, trying to unite Denmark, was overthrown and slaughtered by the Curonian, Droghan. Tumbling through time, Shallee finds herself in that past, two years after she died. She meets up with the warrior, Shokane, who once loved her. Together they plot to restore Denmark, fighting for heart on a perilous adventure into the dark side of light. Black magic abounds and mythical beings arise in this riveting suspense where multi-dimensional realities bleed together to reshape a fate that hinges on a romance transcendent of time and space. I charge toward him, my boots plowing through the snow, kicking up ice crystals. Power gathers in his gold eyes, and I feel the lion in him return. He cries urgently, “Shallee!” I fly against his chest with an iron clad embrace, and his arms snap around me. His heartbeat thunders in my ears, and his heavy breathing pumps his diaphragm against my stomach. He rocks me slightly side to side. Tears stream down my face. His body feels cold, but his heart is burning bright. Mine too. Whatever Loki had of me, I had taken back. Shokane was back too, and now we anchored each other. I feel him again, the way he used to be, strong in resolve, emanating from a place of power deep within himself. And that is what I have loved him for, his individuality. Seeing him sucked into a role, seeing me sucked into a role―just plain sucked. He says in my ear, “We have been magicked Shallee, grotesquely―magicked.”",
  "genres": [],
  "author": "Susan D. Kalior",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/9847758-the-dark-side-of-light"
}