{
  "title": "Joan Mitchell: Lady Painter",
  "description": "“Gee, Joan, if only you were French and male and dead.” —New York art dealer to Joan Mitchell, the 1950sShe was a steel heiress from the Midwest—Chicago and Lake Forest (her grandfather built Chicago’s bridges and worked for Andrew Carnegie). She was a daughter of the American Revolution—Anglo-Saxon, Republican, Episcopalian.She was tough, disciplined, courageous, dazzling, and went up against the masculine art world at its most entrenched, made her way in it, and disproved their notion that women couldn’t paint.Joan Mitchell is the first full-scale biography of the abstract expressionist painter who came of age in the 1950s, ’60s, and ’70s; a portrait of an outrageous artist and her struggling artist world, painters making their way in the second part of America’s twentieth century.As a young girl she was a champion figure skater, and though she lacked balance and coordination, accomplished one athletic triumph after another, until giving up competitive skating to become a painter.Mitchell saw people and things in color; color and emotion were the same to her. She said, “I use the past to make my pic[tures] and I want all of it and even you and me in candlelight on the train and every ‘lover’ I’ve ever had—every friend—nothing closed out. It’s all part of me and I want to confront it and sleep with it—the dreams—and paint it.”Her work had an unerring sense of formal rectitude, daring, and discipline, as well as delicacy, grace, and awkwardness.Mitchell exuded a young, smoky, tough glamour and was thought of as “sexy as hell.”Albers writes about how Mitchell married her girlhood pal, Barnet Rosset, Jr.—scion of a financier who was head of Chicago’s Metropolitan Trust and partner of Jimmy Roosevelt. Rosset went on to buy Grove Press in 1951, at Mitchell’s urging, and to publish Henry Miller, Samuel Beckett, Jean Genet, Jack Kerouac, Allen Ginsberg, et al., making Grove into the great avant-garde publishing house of its time.Mitchell’s life was messy and in New York and East Hampton carousing with de Kooning, Frank O’Hara, James Schuyler, Jane Freilicher, Franz Kline, Helen Frankenthaler, and others; going to clambakes, cocktail parties, softball games—and living an entirely different existence in Paris and Vétheuil.Mitchell’s inner life embraced a world beyond her own craft, especially literature . . . her compositions were informed by imagined landscapes or feelings about places.In Joan Mitchell , Patricia Albers brilliantly reconstructs the painter’s large and impassioned her growing prominence as an artist; her marriage and affairs; her friendships with poets and painters; her extraordinary work.Joan Mitchell re-creates the times, the people, and her worlds from the 1920s through the 1990s and brings it all spectacularly to life.",
  "genres": [
    "Art",
    "Biography",
    "Nonfiction",
    "Art History",
    "History",
    "Memoir",
    "Biography Memoir"
  ],
  "author": "Patricia Albers",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/9848541-joan-mitchell"
}