{
  "title": "Seribu Kunang-Kunang di Manhattan",
  "description": "INILAH New York, dan Umar Kyam bercerita dari dalamnya. New York adalah satu raksasa pemakan manusia. Raksasa ini entah karena kena penyakit apa, tidak pernah merasa kenyang biar dia sudah makan berapa ribu manusia. Karena itu mulutnya terus saja menganga tidak sempat menutup. Segala manusia, putih hitam, kuning, coklat, besar, kecil, ditelannya tanpa pilih-pilih lagi”. Umar Kayan mengutip perubahan itu dalam cerita Istriku, Madame Schlitz, dan Sang Raksasa, cerita kedua dan yang terpanjang dalam kumpulan ini. Secara tipikal, dia tidak menyatakan adakah dia setuju atau tidak dengan karikatur tentang New York tersebut. Namun 6 buah cerita pendek yang ditulisnya selama ia hidup di kota itu semuanya dengan latar Manhatan (sebuah “belantara”, katanya) menampilkan kota jutaan itu sebagai dunia yang menarik, tapi murung. “Aku melihat ke luar jendela. Ribuan pencakar langit kelihatan seperti gunduk-gunduk bukit yang hitam, kaku dan garang.”Begitulah, New York sebuah paradoks. Jutaan manusia hidup di dalamnya, tapi ia nampaknya lengang. Di apartemennya sang isteri Indonesia kesepian, juga seorang wanita ganjil yang memasang namanya sebagai Madame seorang wanita entah dari mana, tinggal hanya bersama seekor anjing yang dilatihnya menyanyi, sembari ia sendiri belajar yoga dan kepada tamunya menceritakan biografinya yang mungkin tidak betul — untuk kemudian menghilang tanpa bekas.Atau Jane dan Marno. Si wanita berpisah dari suaminya dan si pria berpisah dari isteri dan tanah airnya. Mereka berpacaran. Kemudian rutin dan bosan. Si wanita mengulang-ulang cerita yang lapuk untuk mengisi kehampaan bicara, tapi si pria terkenang akan hal isterinya, bunyi cengkerik dan “ratusan kunang-kunang yang suka bertabur malam-malam di sawah embahnya di desa”. Keduanya berpisah. Dan lihatlah si Sybil : gadis 15 tahun yang tersia-sia (ibunya yang miskin lebih banyak menghabiskan waktunya di tempat tidur bersama majikannya), tiba-tiba saja menemukan semacam penglepasan diri dalam suatu tindakan tanpa rencana, ia membunuh si Susan, 6 tahun, yang seharusnya dijaganya.Lebih merasa tersiksa lagi kakek Charlie Si kakek menjalani hari-hari tuanya di Central Park, main karousel setiap hari seperti anak-anak membayangkan dan sebagai tokoh legendaris ketua suku Indian Chief Sitting Bull, untuk kemudian menemui “pacarnya”, nenek Martha, dengan siapa ia menaburkan makanan untuk burung-burung seraya mengeluarkan perlakuan buruk anak dan menantu mereka masing-masing Chief Sittilg Bull bisa merupakan ilustrasi yang baik buat studi Simone de Bouvoire tentang nasib orang-orang lanjut usia di masyarakat industri oknum yang tak lagi berguna, seperti sepah, yang mencari harga dirinya dalam hal-hal yang kacau oleh ketinggalan zaman",
  "genres": [
    "Indonesian Literature",
    "Fiction",
    "Short Stories",
    "Novels",
    "Literature"
  ],
  "author": "Umar Kayam",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/984821.Seribu_Kunang_Kunang_di_Manhattan"
}