{
  "title": "Stonewall Kitchen Favorites: Delicious Recipes to Share with Family and Friends Every Day",
  "description": "Remember your favorite meal when you were a kid? Maybe it was a hearty helping of Mom’s fabulous meatloaf, a side of creamy mashed potatoes, and a slice of chocolate layer cake for dessert. Maybe that’s still your favorite dinner, only now you use a mixture of ground meats and a handful of chopped herbs for the meatloaf, stir roasted garlic into the potatoes, and tuck fresh raspberries into individual molten-centered chocolate cakes—just like the owners of Stonewall Kitchen. When it comes to re-invigorating classic flavors, nobody does it better than Stonewall Kitchen, whose condiments, preserves, and dressings have tickled the taste buds of millions across the country for more than fifteen years. Now, in their follow-up to the IACP Award–nominated Stonewall Kitchen Harvest, Jonathan King, Jim Stott, and Kathy Gunst share their all-time favorite recipes for America’s favorite dishes.Here is the food we crave, updated for today’s tastes with ingredients such as fresh herbs, citrus zest, fresh ginger, and spices. A swirl of basil puree enlivens Spaghetti Carbonara, adding yet another dimension of flavor to this celebrated dish. New Eggs Benedict trade their heavy, complicated hollandaise sauce and Canadian bacon for a light, quick chive-lemon butter, smoked salmon, and baby spinach. New England Five Onion Soup with Cheddar Croûtes puts a decidedly American spin on France’s most famous soup. Given Stonewall’s passion for condiments, naturally the sauces and salsas are spectacular, with everything from Winter Parsley Pesto to Orange-Miso Dipping Sauce. To keep these dishes fresh for years to come, nearly every recipe includes up to a dozen “favorite variations.” With chapters including Breakfast; Soups and Chowders; Salads; Sandwiches; Seafood; Pasta, Potatoes, and Bread; Poultry and Meat; Vegetables; Sauces and Salsas; and Dessert and tips on everything from eggs to bacon to cheese to chocolate liberally scattered throughout the book, Stonewall Kitchen Favorites celebrates and rejuvenates the time-honored American cuisine we all love.Complete with 125 irresistible recipes, 150 stunning full-color photographs, and a foreword by Ina Garten, author of the bestselling Barefoot Contessa cookbook series, here is a new, tempting look at America’s most cherished dishes—the food you’ll want to eat night after night. Stonewall Kitchen Favorites helps families create new memories of favorite meals at the table.From the Hardcover edition.",
  "genres": [
    "Cookbooks"
  ],
  "author": "Jonathan King",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/98474.Stonewall_Kitchen_Favorites"
}