{
  "title": "Che Guevara: A Revolutionary Life: A Revolutionary Life",
  "description": "The cover of Jon Lee Anderson's biography Che Guevara: A Revolutionary Life features a familiar image of the mythic revolutionary. Banners and newspapers across the island of Cuba are trumpeting 1997 as \"the year of the 30th anniversary of the death in combat of the heroic guerrilla and his comrades.\" And while his popularity continues to swell, Che's name and face are increasing sales. Five new biographies, six new films, posters, T-shirts, key chains, and Fischer's Revolution Skis all flaunt his image. But the depth and volume of Jon Lee Anderson's biography redeem the diminishing effects of such widespread commercialization. Anderson digs well beneath the iconography to reveal Ernesto \"Che\" Guevara, the man and his immortal revolutionary spirit.The paradigm of revolutionary appearance and behavior, Che Guevara has become better known as an icon of revolution and a champion of the oppressed than for his political activities. Anderson had unprecedented access to Che's personal archives, Cuban government files formerly sealed to outsiders, and information from the former Soviet Union; he also conducted interviews with scores of Che's closest friends. His book invites readers to explore the character of a man whose \"unshakable faith in his beliefs was made more powerful by his unusual combination of romantic passion and a coldly analytical mind.\"Anderson's careful research takes readers from Che's Argentinean upbringing through his medical school training, from the evolution of his revolutionary fervor and his relationship with Fidel Castro to his execution at age 39 in Bolivia, providing an effortless rendition of a man who would spawn legends.",
  "genres": [
    "Biography",
    "History",
    "Nonfiction",
    "Politics",
    "Biography Memoir",
    "War",
    "Audiobook"
  ],
  "author": "Jon Lee Anderson",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/9849364-che-guevara"
}