{
  "title": "Hitler Was a British Agent",
  "description": "This is the most comprehensive and honest Hitler Biography, offering a whole new and unique look at all the old chestnuts surrounding Adolf Hitler's rise to power. The author uses the personal assistance of a Spymaster in marshalling much new material surrounding Hitler's origins, his sexuality, and his British Training, long hidden by a conspiracy of British and American political leaders. He takes an in depth look at the British Royal Family and finds them wanting, full of spies, perverts, and morons, with the morons being the least dangerous.He delves into the James Bond myths and finds the true James Bond was a lot younger and more homicidal than anyone had previously thought. He interview James Bond III on one of the last 'hits' on Adolf Hitler, well after his official death.He also provides a new take on the mystery surrounding Rudolph Hess. An amazing thought-provoking study from the already detail history of Hess. State secrets abound on nearly every page.Greg I interviewed the KGB in Moscow in December 1989 at a point when they were open, due to lack of pay. At the time you could buy information for the price of a meal. This led to some psychological information being supplied which led to international contacts and meeting with a Spymaster. The Spymaster and other intelligence operatives have been briefing me for the past three years resulting in ten books. This is book five of ten (and just to confuse you) there are four books in this immediate series.Hitler was a British Agent covers Hitler's incestuous parentage, his training in Britain, his sex with men, his bizarre sexual habits with women, including fake suicides and murders made to look like suicides. It delves into Hitler's psychiatric condition and how, during his missing year, he was manipulated by 'deconstruction' to perform as a British Agent, that is, an agent for the British war machine.The book covers Hess and doppelgänger Hess' simultaneous flight to Britain, Anthony Blunt's conception by a royal, Wallis Simpson's sexual practises with King Edward VIII and how she leaked British secrets to Hitler.Hitler was a British Agent covers Operation JAMES BOND to remove Martin Bormann out of Berlin and exposes for the first time Operation WINNIE THE POOH to remove Hitler out of Berlin. It reveals that the origins of the Cold War were in the hunt for the missing Hitler from 1 May 1945 and this became the excuse for surveillance in virtually every country in the world. Hitler was a British Agent leaves an air that everything that happens now, happens because of 1945.In the 18 chapters it covers the masterful deceptions of war, the creation of war, the training of top level double agents, the repeated faking of their deaths and their escapes, making this book something of an illusion-buster with applications to the analysis of war now and formulas for the time in between wars. The book explains how the 'real' history applies to the 'real' present.Many intelligence officers were interviewed in writing this book and they have given the low-down on what really happened in the many wars from 1936. In some cases, they, or their fathers, were the main players in the vignettes. These personal histories date back to the Spanish Civil War with George Orwell and redefine the origins of Animal Farm.",
  "genres": [
    "History",
    "Conspiracy Theories"
  ],
  "author": "Greg Hallett",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/985381.Hitler_Was_a_British_Agent"
}