{
  "title": "You Can If You Think You Can",
  "description": "Norman Vincent Peale, the author of the international bestseller The Power of Positive Thinking —which has had an unprecedented influence on millions of people throughout the world—shares his inspirational classic that shows you how to develop the vital knowledge of inner power to carry you over every obstacle.When you have a problem—no matter how baffling, difficult, or discouraging it may be, there is one basic principle to remember and apply, according to Dr. Peale: persistence through perception.He shows how you too, can make the impossible possible by learning how to:—Motivate yourself—Believe in yourself and have confidence—Forget your fears—Make miracles happen—Avoid thoughts of failure—Draw on the resources in your mind—Ease up and have a sense of humor—Get on top of things and stay thereThese dramatic, heartwarming stories in You Can If You Think You Can show how men and women—of all ages and all walks of life—transformed their lives and careers by following Dr. Peale’s philosophy of positive thinking.Don’t miss his other timeless, bestselling classics:The Power of Positive Thinking : The greatest inspirational bestseller of the century offers confidence without fear, and a life of enrichment and luminous vitality.Inspiring Messages for Daily Living: Realistic, practical answers to the hundreds of challenges we face from day to day—ordinary problems encountered during personal difficulties, in family relationships, on the job, and in dealing with those around us.The Art of Real Happiness (written with Smiley Blanton, M.D.): An unusual blend of age-old truths and modern psychiatric techniques. Peale and Blanton identify—and show how to overcome—essential problems and conflicts that so often plague us and frustrate our chances for happiness.",
  "genres": [
    "Self Help",
    "Nonfiction",
    "Personal Development",
    "Psychology",
    "Business",
    "Inspirational",
    "Spirituality"
  ],
  "author": "Norman Vincent Peale",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/985881.You_Can_If_You_Think_You_Can"
}