{
  "title": "The Pocketbook of Prompts: 52 Ideas for a Story",
  "description": "Ideas for stories are everywhere. They’re in archaeological digs, scientific hoaxes, fairy tales, peculiar laws, the lonely hearts, identity theft, and football matches. They’re hidden in snapshots of other lives, and in images glimpsed only for a moment. They’re in your own lust, envy, rage, love, a desire for life everlasting. Grand contemplations, monumental events, and the moments that go almost unnoticed all offer up sparks to your creativity. This collection brings together the absurd, the illustrious, and the ordinary. It challenges you to invent and to look at language for the remarkable tool that it is. Relearn it as something that provides you with the ability to create anything in this or any other world, and take concepts with which you thought you were familiar and make of them something new – something fresh, unexpected, unique, and your own. What The Writers Inside you will find a year’s worth of writing prompts for a lifetime of stories. The short are as thought provoking as the long. Within each exercise, there are lessons to be learned and tales to be told. All are different, all inspiring, all a testament to Kate Gould’s expertise—and all good reasons why you need to get this book! Kate St. Vincent Vogl, two-time finalist of Lorian Hemingway Short Story Competition and author of Lost & A Memoir of Mothers As a stand-in for the errant muse, calisthenics for the creative mind, or curriculum aid to a writers’ workshop, the prompts herein will benefit the aspiring writer; most especially those aspiring to make a profession of this thing we do. Marc Phillips, author of The Legend of Sander Grant Kate Gould’s book of prompts is a godsend! If you’re blocked, she’ll unlock your mind; if you’re madly working, she’ll offer a nuanced angle you might have overlooked. Bookmark this site - it’s invaluable for any writer needing a bit of fuel injection. Elisabeth Hyde, author of In The Heart Of The Canyon and The Abortionist's Daughter",
  "genres": [
    "Writing"
  ],
  "author": "Kate Gould",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/9857575-the-pocketbook-of-prompts"
}