{
  "title": "The Empire Trilogy: Troubles / The Siege of Krishnapur / The Singapore Grip",
  "description": "The Empire Trilogy - consisting of the Lost Booker Prize-winning Troubles, the Booker Prize-winning The Siege of Krishnapur and The Singapore Grip - is Farrell's re-examination of the legacy, and limits, of British imperial rule. The three volumes, connected by theme rather than character, and above all by their shared wit, brio, and daring, range in setting from the India of the Great Mutiny of 1857, to Ireland immediately after the Great War, to the besieged Singapore of World War II. Together the books constitute not only a spectacular entertainment but also an ambitious refashioning of the traditional historical novel to meet the tragic realities of the modern world. The Siege of Krishnapur - India, 1857 - the year of the Great Mutiny, when Muslim soldiers turned in bloody rebellion on their British overlords. This time of convulsion is the subject of J. G. Farrell's The Siege of Krishnapur, widely considered one of the finest British novels of the last fifty years.Farrell's story is set in an isolated Victorian outpost on the subcontinent. Rumors of strife filter in from afar, and yet the members of the colonial community remain confident of their military and, above all, moral superiority. But when they find themselves under actual siege, the true character of their dominion - at once brutal, blundering, and wistful - is soon revealed. Troubles - 1919: After surviving the Great War, Major Brendan Archer makes his way to Ireland, hoping to discover whether he is indeed betrothed to Angela Spencer, whose Anglo-Irish family owns the once-aptly-named Majestic Hotel in Kilnalough. But his fiancée is strangely altered and her family's fortunes have suffered a spectacular decline. The hotel's hundreds of rooms are disintegrating on a grand scale; its few remaining guests thrive on rumors and games of whist; herds of cats have taken over the Imperial Bar and the upper stories; bamboo shoots threaten the foundations; and piglets frolic in the squash court. Meanwhile, the Major is captivated by the beautiful and bitter Sarah Devlin. As housekeeping disasters force him from room to room, outside the order of the British Empire also totters: there is unrest in the East, and in Ireland itself the mounting violence of \"the troubles.\" · The Singapore Grip - Singapore, 1939: life on the eve of World War II just isn't what it used to be for Walter Blackett, head of British Singapore's oldest and most powerful firm. No matter how forcefully the police break one strike, the natives go on strike somewhere else. His daughter keeps entangling herself with the most unsuitable beaus, while her intended match, the son of Blackett's partner, is an idealistic sympathizer with the League of Nations and a vegetarian. Business may be booming - what with the war in Europe, the Allies are desperate for rubber and helpless to resist Blackett's price-fixing and market manipulation - but something is wrong. No one suspects that the world of the British Empire, of fixed boundaries between classes and nations, is about to come to a terrible end.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Historical",
    "India",
    "Literature",
    "Ireland"
  ],
  "author": "J.G. Farrell",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/9858529-the-empire-trilogy"
}