{
  "title": "Song Ba To",
  "description": "Song Ba To is a war novel set in Vietnam.Larry Solie, who served with me in the 6/11 Artillery in Vietnam says about the \"I loved the book. Grabbed you by the throat and didn't let go! Vivid imagery, yet dark in content, seems no one escaped unscathed. Talk about flashback time!\" JC Who served in Bravo 4/3 (the infantry company I was attached to as artillery forward observer, and which served as the model for Bravo Company in the novel) had this to \"I just finished your book and I'm still stunned like I was too close to a grenade. I'm still living it instead of analyzing it but I had to tell you what powerful stuff you've got here. You've got the most lyrical voice I've read in quite a while.\"Reviewer, Amazon Breakthrough Novel I was overwhelmed by the realities of the Vietnam war. The description was so very vivid and the characters were all very much alive in my mind. The writing is excellent and the action is fast-paced. This book will evoke all kinds of emotion from in my dreams of Vietnam and the war, I see Captain Jack again. The sky is black construction paper shot through with the pinholes of stars. The hills are soft and velvet green. We dig in on a hilltop beneath a spongy jungle canopy. The voices of the enemy are on the radio again “die die yup d’lie” fast and indecipherable. A star bursts soundlessly above us in the trees. But the me in the dream is the me of today, decades after and the terror comes I don’t know the codes; I don’t know the call signs or the radio frequencies. The half-man crawls up the hillside toward us again. Captain Jack fires the flare and I pick up my rifle and begin to squeeze the trigger. The hills are green and velvet and beyond them is an abyss. It is a hole through the Earth that you can fall through into the stars. I fire at the Dinks who swarm from the hole, but the rifle in my hand is part of the fabric of my dream and when I squeeze the trigger, nothing happens. You might say we weren’t true soldiers in the depopulated valley of the Sông Ba Tơ. Bravo Company seemed to me more like a guerilla band among those broken plantation walls, shattered tiles, tattered banana trees and shaggy, untended palms. From one month to the next we never saw a single Vietnamese in any of the ruined villes. Out there, we never tickled smiling babies or gave C-ration chocolate to little Dink kids. We never bought warm six packs of coke from girls in coolie hats and black pajamas along the roads of our march. The topographic combat map I carried and brought back to the World with me showed 28 villages prospering in the shadow of Núi Suôi Loa. We would come upon these village sites now and again, abandoned and ruined, no more left than the shrapnel-pocked wall of a roadside shrine, the concrete rail of a bridge on the 515 Highway, the old graves in the elephant grass.The bones of the skull are delicate ridges and spirals, a lace tracery of white against the blue-grey cast of scalp and cheek. The flesh peels back from the bones as bloodlessly as if it were a diagram in a medical text. The Vietnamese soldier is a boy, the death mask of his face surprised. Whatever agent of death had opened his skull had done so cleanly, surgically. The boy’s body lies face up at the turn of the defile among a littered field of other dead. His dull eyes are open, his right hand clutches the wooden handle of a Chi-Com grenade.On the remote mountain top west of Ben Het in another of my dreams the trees ascend in a triple canopy of gray-green foliage to the night sky. Dim yellow fires flicker from their trunks in open smiles. The trail down that murderous ridge is wide as a highway.",
  "genres": [],
  "author": "Drew Mendelson",
  "average_rating": "4.86",
  "url": "https://www.goodreads.com/book/show/9854577-song-ba-to"
}