{
  "title": "The Civil War Trilogy with American Homer: Reflections on Shelby Foote",
  "description": "Selected by the Modern Library as one of the 100 best nonfiction books of all timeOn the occasion of the 150th anniversary of the Civil War, the Modern Library publishes Shelby Foote’s three-volume masterpiece in a new boxed set including three hardcovers and a new trade paperback, American Reflections on Shelby Foote and His Classic Civil A Narrative, edited by and with an introduction from Pulitzer Prize winner Jon Meacham and including essays by Michael Beschloss, Ken Burns, Annette Gordon-Reed, and others.Random House publisher Bennett Cerf commissioned southern novelist Shelby Foote to write a short, one-volume history of the American Civil War. Thirty years and a million and a half words later—every word having been written out longhand with nib pens dipped into ink—Foote published the third and final volume of what has become the classic narrative of that epic war.As he approached the end of the final volume, Foote recounted this scene in a letter to his friend, the novelist Walker “I killed Lincoln last week—Saturday, at noon. While I was doing it (he had his chest arched up, holding his last breath to let it out) some halfassed doctor came to the door with vols I and II under his arm, wanting me to autograph them for his son for Xmas. I was in such a state of shock, I not only let him in; I even signed the goddam books, a thing I seldom do. Then I turned back and killed him and had Stanton say, ‘Now he belongs to the ages.’ A strange feeling, though. I have another 70-odd pages to go, and I have a fear they’ll be like Hamlet with Hamlet left out. Christ, what a man. It’s been a great thing getting to know him as he was, rather than as he has come to be—a sort of TV image of himself, with a ghost alongside.”When Percy read the final book, he wrote to “It’s a noble work. I’m still staggered by the size of the achievement. . . . It is The Iliad .”A selection of these letters, along with essays by Jon Meacham, Michael Beschloss, Ken Burns, Annette Gordon-Reed, Michael Eric Dyson, Julia Reed, Robert Loomis, Donald Graham, John M. McCardell, Jr., and Jay Tolson, are included in American Homer, the bonus paperback book available only in the Modern Library boxed set of The Civil War.Shelby Foote’s tremendous, sweeping narrative of the most fascinating conflict in our history—a war that lasted four long, bitter years, an experience more profound and meaningful than any other the American people have ever lived through—begins with Jefferson Davis’s resignation from the United States Senate and Abraham Lincoln’s departure from Springfield for the national capital. It is these two leaders, whose lives continually touch on the great chain of events throughout the story, who are only the first of scores of exciting personalities that in effect make The Civil War a multiple biography set against the crisis of an age.Four years later, Lincoln’s second inaugural sets the seal, invoking “charity for all” on the Eve of Five Forks and the Grant-Lee race for Appomattox. Here is the dust and stench of war, a sort of Twilight of the Gods. The epilogue is Lincoln in his grave, and Davis in his postwar existence—“Lucifer in Starlight.” So ends a unique achievement—already recognized as one of the finest histories ever fashioned by an American—a narrative that re-creates on a vast and brilliant canvas the events and personalities of an American the Civil War.",
  "genres": [
    "History",
    "Civil War",
    "Nonfiction",
    "American History",
    "War",
    "American Civil War",
    "Military History"
  ],
  "author": "Shelby Foote",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/9860544-the-civil-war-trilogy-with-american-homer"
}