{
  "title": "ألس في بلاد الواق واق! رواية ليست للصغار",
  "description": "رواية من أدب الخيال، حيث تقع \"ألس\" في بلاد الواق واق، لا بلاد العجائب. الواق واق، تلك المنسوجة في وعينا ولاوعينا بعناية، لأنها رمز اللامعقول، والمخفي، والمجنون. لأنها المكان الذي لا إحداثيات معروفة له، ورغم ذلك فرض نفسه على أحاديثنا. وهي حتما ليست واق واق «ابن طفيل»، ولا «ابن خُرداذبة»، ولا حتى «الإدريسي». إنها الواق واق-الرمز الذي في خواطرنا وضمائرنا. الواق واق التي نقصد حين نريد أن نسخط أو نسخر. هنالك سقطت \"ألس\"، وهناك إسقاطات كثيرة على الواقع العربي تزخر بها الرواية.في عام 1865 كتب «تشارلز دودسن» (الكاتب الإنگليزي المعروف باسم «لويس كارول») روايتَه الشهيرة «مغامرات ألس في بلاد العجائب»، ثم أتبعها في عام 1871بكتاب «عبر المرآة، وماذا وجدت ألس هناك». شكّل هذان العملان الممتعان دعامة هامة لأدب السخافة. وليس المقصود سخافة العمل الأدبي أو تفاهته، بل أنّ التركيز الأساسي في هذا النوع من الأدب ينصب على اللعب بالكلمات بطريقة معاكسة للسائد، والعبث بالعمليات المنطقية وتحطيم الافتراضات. ورغم أن الكتابين كانا موجهين إلى الأطفال، إلا أنهما راقا للكبار أيضا.«أَلِس في بلاد الواق واق» تستعير الجو العام لكتابيّ «لويس كارول»، إذ شكلا بروازا فضفاضا يصف ويشف بنيتُ داخله عالما يحلق فيه القارئ بجناحين من السخرية والترميز. النص فيه إسقاطات على الواقع العربي، واستعارات من التراث العربي والأساطير. إنه عالم «ألس» المجنون بالإضافة إلى قسط وافر من الخيال المقرون بمتعة التأويل، والكثير الكثير من العربية. إنها «ألس»، برداء عربي مبين!صحيح أن هناك تقاطعا مع بعض ملامح كتابي «كارول»، وصحيح أن بضع شخصيات تكررت بأسماء وأدوار مختلفة (مثلا الهدهد ذو العمامة في مقابل الأرنب، وجُمجُم في مقابل Humpty Dumpty)، لكن ثمة شخصيات أصيلة في هذا النص مثل السمكة الملاّحة، وأرنبة الساق، وبطة الأنف، والسلنطع، ونهوم، ورغور، وياس مَيْنة، وقرد البرج، وسمسم، ومَرجانة. فضلا عن معظم الشخصيات في محكمة الواق واق.كما أن تفاصيل الأحداث مغايرة جدا وأحيانا معاكسة. ففي نص «لويس كارول» نجد الدوقة غير المهتمة بطفلها الخنزير، والطاهية ذات المزاج الحاد المغرمة بإغراق الحساء بالفلفل. وفي هذا النص يقابل ذلك «متصرفة الشؤون الفلفلية» ومساعدتها «بهّارة» اللتين تأخذان الغرام بالفلفل إلى منحنى أبعد حينما يكون هوسهما هو رش الفلفل على أي نزاع، وحين تكون حرفتهما صناعة العار والدمار؛ ففي «دار البهار» تُشعل أعتى النزاعات، وتوضع مقادير أنكى الحروب.وفي المحاكمة، نجد أن «ألس» مجرد شاهدة مشاكسة في نص «لويس كارول»، حيث تنتهي الرواية في هذا الفصل. بينما «ألس» في هذا الكتاب متهمة بالهجرة غير الشرعية لبلاد الواق واق. وفي فصل «محكمة الواق واق» يتكاثف النص في أقصى درجاته ليمهد بعد ذلك للفصول الختامية.http://www.neelwafurat.com/itempage.a...",
  "genres": [
    "Novels",
    "Literature",
    "Fiction",
    "Fantasy"
  ],
  "author": "حياة الياقوت",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/10355303"
}