{
  "title": "What's Behind Your Belly Button? A Psychological Perspective of the Intelligence of Human Nature and Gut Instinct",
  "description": "\"What’s Behind Your Belly Button? A Psychological Perspective of the Intelligence of Human Nature and Gut Instinct\" by Martha Char Love and Robert W. Sterling explains what your gut feelings are actually capable of telling you about your inner instinctive needs, how to listen to the voice of your gut, and how to use both of your brains—head and gut—to work together for your optimal health and well-being. Although numerous books and articles have recently talked about the gut instincts as valuable in giving us useful hunches in the decision-making process, \"What’s Behind Your Belly Button?\" goes much further and explains how gut feelings not only have a psychological intelligence of their own, but are also understandably rational in their functioning. The authors explore how gut feelings are like a gas gauge in our guts indicating through an emotional feeling of emptiness or fullness how well the two instinctive human needs for acceptance (attention from others) and of control of one’s own responses (freedom) in our lives are being met and how our behavior attempts to keep these two instinctive needs in balance at all times. They explore how these two instinctive needs motivate nearly all our behaviors all through our lives and that the feeling memory of how well these needs are met from moment-to-moment may be accessed through somatic awareness of our gut feelings of empty and full by using the Somatic Reflection Process the authors have developed. Since Dr. Michael Gershon, M.D., published in 1999 his revolutionary medical findings that demonstrated that the gut has an intelligence of its own and called it the “Second Brain”, people have been examining their guts with growing interest in trying to understand their gut feelings. Love and Sterling answer the questions many people have about the psychology of the second brain and the ENS in a new theory of Gut Psychology, and explore how to use both your head and gut brains to work together for a healthy life. It is written in a narrative style that allows for the reader to understand the experience within themselves of having two brains and it makes thinking of the human being with these two brains become truly understandable for the first time. While the authors make this material easy to understand, the psychological explanations of gut intelligence and instincts in this book are comprehensive, well-researched, and based upon clinical studies with hundreds people by the two authors. Utilizing the research of Dr. Gershon, the work of Dr. Lise Eliot who charts the development of children from conception through the first five years of life, recent research of their own in the Psychology Department at Sonoma State University, and their vast clinical experience in career counseling and psychometry, the two authors of \"What’s Behind Your Belly Button?\" have presented an interpretation of recent medical research into a new revolutionary understanding of gut instincts and a more accurate behavioral understanding of the Self and human nature than has previously been available. This book is recommended for anyone looking for a hopeful view of humankind and a method for getting in touch with gut instincts to reduce stress, cope with fear and anxiety, deal with health issues and make efforts to stay healthy, and to increase optimal problem-solving and life-decision making abilities. It is a book that would be useful for general audience readers as a self-help book, as well as for scholars of psychology, education, neurology, medicine, and business organizational leadership interested in the well-being of healthy decision-making and the human condition. \"What’s Behind Your Belly Button?\" is now available for purchase on Amazon.com in both the USA and the UK.",
  "genres": [
    "Psychology",
    "Parenting",
    "Self Help",
    "Nonfiction",
    "Science",
    "Health",
    "Education"
  ],
  "author": "Martha Char Love",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/13239152-what-s-behind-your-belly-button-a-psychological-perspective-of-the-inte"
}