{
  "title": "Mortals",
  "description": "The greatly anticipated new novel by Norman Rush—whose first novel, Mating, won the National Book Award and was everywhere acclaimed—is his richest work yet. It is at once a political adventure, a social comedy, and a passionate triangle. It is set in the 1990s in Botswana—the African country Rush has indelibly made his own fictional territory.Mortals chronicles the misadventures of three ex-pat Americans: Ray Finch, a contract CIA agent, operating undercover as an English instructor in a private school, who is setting out on perhaps his most difficult assignment; his beautiful but slightly foolish and disaffected wife, Iris, with whom he is obsessively in love; and Davis Morel, an iconoclastic black holistic physician, who is on a personal mission to “lift the yoke of Christian belief from Africa.”The passions of these three entangle them with a local populist leader, Samuel Kerekang, whose purposes are grotesquely misconstrued by the CIA, fixated as the agency is on the astonishing collapse of world socialism and the simultaneous, paradoxical triumph of radical black nationalism in South Africa, Botswana’s neighbor. And when a small but violent insurrection erupts in the wild northern part of the country, inspired by Kerekang but stoked by the erotic and political intrigues of the American trio—the outcome is explosive and often explosively funny.Along the way, there are many pleasures. Letters from Ray’s brilliantly hostile brother and Iris’s woebegone sister provide a running commentary on contemporary life in America. Africa and Africans are powerfully evoked, and the expatriate scene is cheerfully skewered.Through lives lived ardently in an unforgiving land, Mortals examines with wit and insight the dilemmas of power, religion, rebellion, and contending versions of liberation and love. It is a study of a marriage over time, and a man’s struggle to find his way when his private and public worlds are shifting. It is Norman Rush’s most commanding work.",
  "genres": [
    "Fiction",
    "Africa",
    "Contemporary",
    "Literature",
    "Literary Fiction",
    "Novels",
    "Botswana"
  ],
  "author": "Norman Rush",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/986298.Mortals"
}