{
  "title": "Once & Future Giants: What Ice Age Extinctions Tell Us About the Fate of Earth's Largest Animals",
  "description": "Until about 13,000 years ago, North America was home to a menagerie of massive mammals. Mammoths, camels, and lions walked the ground that has become Wilshire Boulevard in Los Angeles and foraged on the marsh land now buried beneath Chicago's streets. Then, just as the first humans reached the Americas, these Ice Age giants vanished forever. In Once and Future Giants, science writer Sharon Levy digs through the evidence surrounding Pleistocene large animal (\"megafauna\") extinction events worldwide, showing that understanding this history--and our part in it--is crucial for protecting the elephants, polar bears, and other great creatures at risk today. These surviving relatives of the Ice Age beasts now face an intensified replay of that great die-off, as our species usurps the planet's last wild places while driving a warming trend more extreme than any in mammalian history. Inspired by a passion for the lost Pleistocene giants, some scientists advocate bringing elephants and cheetahs to the Great Plains as stand-ins for their extinct native brethren. By reintroducing big browsers and carnivores to North America, they argue, we could rescue some of the planet's most endangered animals while restoring healthy prairie ecosystems. Critics, including biologists enmeshed in the struggle to restore native species like the gray wolf and the bison, see the proposal as a dangerous distraction from more realistic and legitimate conservation efforts. Deftly navigating competing theories and emerging evidence, Once and Future Giants examines the extent of human influence on megafauna extinctions past and present, and explores innovative conservation efforts around the globe. The key to modern-day conservation, Levy suggests, may lie fossilized right under our feet.",
  "genres": [
    "Nonfiction",
    "Science",
    "Nature",
    "History",
    "Palaeontology",
    "Animals",
    "Natural History"
  ],
  "author": "Sharon Levy",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/9866998-once-future-giants"
}