{
  "title": "Letters from Frank: An American Terrorist's Life",
  "description": "Letters from An American Terrorist's Lifeby Ingrid Holm-GaribayLetters from An American Terrorist’s Life offers a candid and raw look into the mind of the domestic terrorist, Frank D. Alexander. While Ingrid I. Holm-Garibay sits in the Las Vegas Detention Center awaiting political asylum in the late nineties, she meets Frank, who is being detained before extradition. They begin communicating through detailed and extremely personal letters, discussing the subjects of sexuality, personal relationships, politics, family life, and even spirituality. As Frank’s past is methodically dissected, one can deconstruct his letters and gain incredibly profound perspective into the making of a modern-day terrorist. This deeply insightful collection of letters is a necessary read for every American who wants to understand terrorism at its deepest roots.About the AuthorIngrid I. Holm-Garibay, a native of Mexico, currently resides in Las Vegas, Nevada, where she is a laboratory technician. She holds a B.S. in journalism and photography and a post-graduate degree in political science from the National Polytechnic College in Mexico City, Mexico. She is active in her community and has been the co-chair of the Las Vegas EMA Ryan White Title I Planning Council as well as a volunteer for the St. Therese Center in Henderson, Nevada. Ingrid’s interests reside in the occult sciences, philosophy, arts and culture, books, museums, history, and politics. She has previously published El Pais De Los Enanos (Country of Dwarfs) and El Pais De Nunca Jamas (The Never Ever Country), which were both banned in Mexico for political reasons. Additionally, she served as the co-founder, publisher, and co-editor of Orbit Newspaper in Mexico City, Mexico.(2010, paperback, 320 pages).",
  "genres": [],
  "author": "Ingrid Holm-Garibay",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/9860687-letters-from-frank"
}