{
  "title": "Discovering Arugula",
  "description": "Liz Gardner is ripe for Mr. Right. She has lived an admittedly reckless and debauched life, all the while questioning, \"Why does everything happen to me?\" Enlightenment finally kicks in and Liz's forward path leads her directly to her soul mate. Unfortunately, she soon learns that real life doesn't mimic fairy tales or chick flicks. Even though she feels healthy and balanced, her destructive patterns have their teeth deeply embedded into her ankles like a persistent rabid Chihuahua she can't shake off. Fears of old habits, pining ex-lovers, the discovery of an ill-fated dark family secret and even murder threaten to sabotage the happily ever after she's worked so hard for. How do you handle all the crap after Happily Ever. Liz Gardner is ripe for Mr. Right. She has lived an admittedly reckless and debauched life, all the while wondering, \"Why does everything happen to me?\" Enlightenment finally kicks in and Liz's forward path leads her directly to her soul mate. She soon learns that real life doesn't mimic fairy tales or chick flicks. Even though she feels healthy and balanced, her destructive patterns have their teeth deeply embedded into her ankles like a persistent rabid Chihuahua she can't shake off. Fears of old habits, pining ex-lovers, the discovery of an ill-fated dark family secret and even murder threaten to sabotage the happily ever after she's worked so hard for. How do you handle all the crap after Happily Ever. In this sequel to her critically acclaimed first novel Who Got Liz Gardner, author Elizabeth Allen cleverly takes us back to the moment when Eric Alexander gets Liz. Then she proceeds to send the reader on a courtship ride with more spins, twists and corkscrew turns than the Coney Island Cyclone. By story’s end, you will be breathless, white-knuckled and lining up to go again!www.elizabeth-allen.com",
  "genres": [
    "Chick Lit"
  ],
  "author": "Elizabeth    Allen",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/9875167-discovering-arugula"
}