{
  "title": "Kingdoms of the Wall",
  "description": "It is a tremendous presence towering over the world—Kosa Saag, the Wall—a monstrous assemblage of cliffs, ravines, and mountains. At its Summit, on the highest peak of all, far above the clouds, live the gods themselves. Each year, from the village of Jespodar at the foot of the imposing Wall, twenty men and twenty women, selected and trained at arduous length, set forth on a Pilgrimage. Against overwhelming odds they will attempt to scale the Summit, meet with the gods, and gain new knowledge. A few Pilgrims will return as madmen. Most will never be seen again.For Poilar Crookleg, the Pilgrimage has been a lifelong dream. Years ago he and his childhood friend Traiben vowed that they would one day make the Pilgrimage together, converse with the gods, and return not as madmen but as teachers of wisdom. Now it is their year of selection, and the two young men set forth among the chosen forty, determined to succeed where so many before them have failed.Along the way, they must brave ghosts and ravenous Wall-hawks, traverse terrifying Kingdoms and blasted landscapes of heat and ice, and then face the greatest challenge of all…the temptation of eternal life in a paradise of pleasure. At the end, for the few who endure, lies the Summit itself, and with it the secret of the gods—a secret so strange and unsettling that it will shatter centuries of belief and change the world forever.In Kingdoms of the Wall, Robert Silverberg has crafted a masterpiece of the first order, an adventure filled with awesome mystery and disturbing revelation, a voyage to the heart of creation itself as the inhabitants of an alien world strive to learn the truth about themselves and their gods, a truth as harsh and unforgiving as the forbidding heights of Kosa Saag.",
  "genres": [
    "Science Fiction",
    "Fantasy",
    "Fiction",
    "Speculative Fiction",
    "Science Fiction Fantasy",
    "Collections",
    "Amazon"
  ],
  "author": "Robert Silverberg",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/987341.Kingdoms_of_the_Wall"
}