{
  "title": "The Ledge: An Adventure Story of Friendship and Survival on Mount Rainier",
  "description": "“My eyes travel up the frozen walls. I figure it is eighty feet up to the sunlight. The walls above me climb up at about eighty degrees, then they go dead vertical, and then, higher up, they overhang. It is as if I am looking out from the belly of a beast, its jagged white teeth interlocking above me.” In June 1992, best friends Jim Davidson and Mike Price stood triumphantly atop Washington’s Mount Rainier, celebrating what they hoped would be the first of many milestones in their lives as passionate young mountaineers. Instead, their conquest gave way to catastrophe when a cave-in plunged them deep inside a glacial crevasse—the pitch-black, ice-walled hell that every climber’s nightmares are made of.An avid adventurer from an early age, Davidson was already a seasoned climber at the time of the Rainier ascent, fully aware of the risks and hopelessly in love with the challenge. But in the blur of a harrowing free fall, he suddenly found himself challenged by nature’s grandeur at its most unforgiving. Trapped on a narrow, unstable frozen ledge, deep below daylight and high above a yawning chasm, he would desperately battle crumbling ice and snow that threatened to bury him alive, while struggling in vain to save his fatally injured companion. And finally, with little equipment, no partner, and rapidly dwindling hope, he would have to make a fateful choice—between the certainty of a slow, lonely death or the seeming impossibility of climbing for his life.At once a heart-stopping adventure story, a heartfelt memoir of friendship, and a stirring meditation on fleeting mortality and immutable nature, The Ledge chronicles one man’s transforming odyssey from the dizzying heights of elation and awe to the punishing depths of grief and hard-won wisdom. This book’s visceral, lyrical prose sings the praises of the physical world’s wonders, while searching the souls of those willing, for better or worse, to fully embrace it.",
  "genres": [
    "Nonfiction",
    "Adventure",
    "Mountaineering",
    "Memoir",
    "Travel",
    "Survival",
    "Biography"
  ],
  "author": "Jim Davidson",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/9869499-the-ledge"
}