{
  "title": "Iphigenia in Forest Hills: Anatomy of a Murder Trial",
  "description": "\"Astringent and absorbing. . . . Iphigenia in Forest Hills casts, from its first pages, a genuine spell — the kind of spell to which Ms. Malcolm’s admirers (and I am one) have become addicted.\" —Dwight Garner, New York Times \"She couldn't have done it and she must have done it.\" This is the enigma at the heart of Janet Malcolm's riveting new book about a murder trial in the insular Bukharan-Jewish community of Forest Hills, Queens, that captured national attention. The defendant, Mazoltuv Borukhova, a beautiful young physician, is accused of hiring an assassin to kill her estranged husband, Daniel Malakov, a respected orthodontist, in the presence of their four-year old child. The prosecutor calls it an act of just weeks before Malakov was killed in cold blood, he was given custody of Michelle for inexplicable reasons. It is the \"Dickensian ordeal\" of Borukhova's innocent child that drives Malcolm's inquiry. With the intellectual and emotional precision for which she is known, Malcolm looks at the trial—\"a contest between competing narratives\"—from every conceivable angle. It is the chasm between our ideals of justice and the human factors that influence every trial—from divergent lawyering abilities to the nature of jury selection, the malleability of evidence, and the disposition of the judge—that is perhaps most striking. Surely one of the most keenly observed trial books ever written, Iphigenia in Forest Hills is ultimately about character and \"reasonable doubt.\" As Jeffrey Rosen writes, it is \"as suspenseful and exciting as a detective story, with all the moral and intellectual interest of a great novel.\" \" Iphigenia in Forest Hills is another dazzling triumph from Janet Malcolm. Here, as always, Malcolm’s work inspires the best kind of disquiet in a reader—the obligation to think.\" —Jeffrey Toobin, author of The Inside the Secret World of the Supreme Court \"A remarkable achievement that ranks with Malcolm's greatest books. Her scrupulous reporting and interviews with protagonists on both sides of the trial make her own narrative as suspenseful and exciting as a detective story, with all the moral and intellectual interest of a great novel.\" —Jeffrey Rosen, author of The Supreme The Personalities and Rivalries that Defined America",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Crime",
    "Journalism",
    "Law",
    "New York",
    "History"
  ],
  "author": "Janet Malcolm",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/9873257-iphigenia-in-forest-hills"
}