{
  "title": "A Wife's Fantasy",
  "description": "BLURB When his sexy, refined and faithful wife comes home from a night out with the girls, she has a younger man in tow. Like most couples, they have fantasies, but never really intend to live them out. Not this time. There are extreme sexual situations in this book. EXCERPT “Lick me,” she commanded, “Make me nice and wet so James can fuck me.” I licked her juices greedily, but it would have been obvious to a blind man that she didn’t need the extra lubrication. All too soon, I felt her rise up slightly and tilt forward placing her forearms on either side of me. It was probably only an inch, but it was enough to move her out of range of my tongue and no doubt give James an excellent view of her dripping pussy. “Take his cock,” she ordered. No sooner had my fingers curled around his shaft than she reached back and grabbed his tie, pulling him toward her. “Put him inside me now; guide that thick cock of his into your wife’s pussy; and do it slowly. I want you to watch every inch as it penetrates me.” I did as I was told. I guided his penis into her and saw her lips open to take his impressive girth. It was too easy. Somehow it seemed to me that it should have been more difficult. Perhaps out of some biological sense of loyalty, her pussy should have balked a little at the invasion of this strange, new penis. But it didn’t. Her beautiful pussy seemed almost eager to swallow him up. Her inner lips opened of their own accord and as I helped push him slowly, deeply all the way in and watched him slide all the way out of her, a few drops of her juices ran down her outer lips. I caught them in my mouth with relish, the heady taste always stronger, richer when she was most aroused. This unmistakable sign of her pleasure strengthened my resolve. I could never deny her now. We played like this for several minutes, none of us saying a word. I guided him all the way into my wife and then let go watching him slowly pull out until the tip of his penis would reappear, glistening with her juices. But the anticipation was too much for her. She slid forward on her elbows a little further and spread her legs a little wider. Her clitoris was now resting directly on my lips and as James slowly started to enter her again, she pushed back hard, taking him deep in one quick motion. “Enough!” she spat out, “I brought you here to fuck me! Now do it!” Before I could even adjust, James responded. He pulled out and slammed back in – full force. I was immobile, mesmerized. Nothing else existed – It was all about his cock and her pussy. They seemed to have forgotten about me. Or so it seemed, until I felt her hand grip my own balls a little too firmly. “Lick me, damn it!” she hissed through clenched teeth. “I want you to lick me while he fucks me!” My tongue reached out for her clitoris. At first I circled it teasingly, giving a light caress each time she pushed back into him. Then I matched his strokes and attacked her clitoris directly. Almost instantly she called out in a powerful orgasm. James and I both hesitated, surprised by the force of her orgasm. “If you fucking stop, I’ll kill you both,” she growled, pushing down simultaneously on my tongue and his cock. I continued licking and kissing her while James slowed a bit, but kept plunging into her. My wife was hit by wave after wave of orgasm and I could see, feel, taste her come as it dripped out between his cock and her engorged lips. Her thighs began to tremor in my grip. Her legs were tiring and she compensated by letting her chest and full breasts fall more heavily on my body, but she refused to stop or pull away. She was relying on me to support her while another man fucked her.",
  "genres": [
    "Menage",
    "Erotica",
    "Novella",
    "Short Stories"
  ],
  "author": "Cesare Ancona",
  "average_rating": "3.40",
  "url": "https://www.goodreads.com/book/show/13239650-a-wife-s-fantasy"
}