{
  "title": "Exit Unicorns",
  "description": "In this sweeping and powerful epic the journey begins in the 'terrible beauty' of Northern Ireland during a time when conflict reigns and no one is spared from tragedy and sorrow, the time known as The Troubles. It is the spring of 1968 in Belfast and James Kirkpatrick has just lost his father under suspicious circumstances, Casey Riordan is released from prison after five years and Pamela O'Flaherty has crossed an ocean and a lifetime of memories to find the man she fell in love with as a little girl. All three lives are on a collision course with each other against the backdrop of the burgeoning civil rights movement and a nation on the brink of revolution. They come from disparate backgrounds-Jamie a wealthy aristocrat whose life is like an imperfect but multi-faceted jewel-brilliant, flawed and with a glitter that is designed to distract the observer. Casey, a card-carrying member of the Irish Republican Army, who must face the fact that five years away has left him a stranger, a misfit in his own neighborhood where not everyone is sympathetic to a convicted rebel. Pamela, who has come to Ireland in search of a memory and a man who may not have existed in the first place. Through it all runs the ribbon of a love story: love of country, the beginning love of two people unable to resist the pull of each other regardless of the cost to themselves and those around them, and the selfless love of one man who no longer believes himself capable of such emotion. It is an electrifying tale of a people divided by religion and politics, a tale of love and danger, of triumph and tragedy. Ultimately it is the story of that 'terrible beauty' herself-Ireland-and how nation is bound to one's identity, woven into the weft of all we become.",
  "genres": [
    "Historical Fiction",
    "Ireland",
    "Romance",
    "Fiction",
    "Irish Literature",
    "Historical",
    "Book Club"
  ],
  "author": "Cindy Brandner",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/987031.Exit_Unicorns"
}