{
  "title": "Original Sin",
  "description": "\"Smart, sassy, sexy Sally Sin is an absolute delight of a heroine whom I predict will be around delighting readers for a very long time. And her first adventure, Original Sin , is pure entertainment gold.\"--John Lescroart, author of the New York Times bestselling Dismas Hardy novelsAfter falling in love and making a quick exit from her nine-year career in the USAWMD (United States Agency for Weapons of Mass Destruction),  ex-spy Sally Sin  does her best to become Lucy Hamilton, a  stay-at-home mom  in San Francisco. No one, not even her adoring husband Will, knows about her  secret agent escapades --chasing evil masterminds through perilous jungles, escaping assassins, and playing dangerous games of cat and mouse with her old nemesis, Ian Blackford, a notorious and dashing illegal arms dealer.In her new life as Lucy Hamilton, she squeezes inside forts crafted from couch cushions by her three-year-old son Theo, makes organic applesauce, and frequents the zoo. But sometimes her well-honed spy reflexes refuse to lay low. She can't help breaking into her own house to check on the babysitter or stop herself from tossing the yoga instructor who gets on her nerves. And when Ian Blackford, who is supposed to be dead, once again starts causing trouble for the USAWMD, the agency becomes desperate to get Sally back on the job.How can Sally or Lucy or whatever her name is save the planet while at the same time keeping her own family's world from spinning out of control? Pick up your copy today and find out how  messy modern parenting really can be!Every bit as much fun as a spy-mom thriller ought to be,  Original Sin  is a fast-paced mystery with a dose of romantic tension to keep things lively. A great read for mothers and spies, and anyone who has ever dreamed of being either.",
  "genres": [
    "Mystery",
    "Fiction",
    "Chick Lit",
    "Adventure",
    "Humor",
    "Espionage",
    "Contemporary"
  ],
  "author": "Beth McMullen",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/9883055-original-sin"
}