{
  "title": "Lost Technologies of Ancient Egypt: Advanced Engineering in the Temples of the Pharaohs",
  "description": "A unique study of the engineering and tools used to create Egyptian monuments • Presents a stone-by-stone analysis of key Egyptian monuments, including the statues of Ramses II and the tunnels of the Serapeum • Reveals that highly refined tools and mega-machines were used in ancient Egypt From the pyramids in the north to the temples in the south, ancient artisans left their marks all over Egypt, unique marks that reveal craftsmanship we would be hard pressed to duplicate today. Drawing together the results of more than 30 years of research and nine field study journeys to Egypt, Christopher Dunn presents a stunning stone-by-stone analysis of key Egyptian monuments, including the statue of Ramses II at Luxor and the fallen crowns that lay at its feet. His modern-day engineering expertise provides a unique view into the sophisticated technology used to create these famous monuments in prehistoric times. Using modern digital photography, computer-aided design software, and metrology instruments, Dunn exposes the extreme precision of these monuments and the type of advanced manufacturing expertise necessary to produce them. His computer analysis of the statues of Ramses II reveals that the left and right sides of the faces are precise mirror images of each other, and his examination of the mysterious underground tunnels of the Serapeum illuminates the finest examples of precision engineering on the planet. Providing never-before-seen evidence in the form of more than 280 photographs, Dunn’s research shows that while absent from the archaeological record, highly refined tools, techniques, and even mega-machines must have been used in ancient Egypt.",
  "genres": [
    "History",
    "Nonfiction",
    "Science",
    "Egypt",
    "Alternate History",
    "Technology",
    "Architecture"
  ],
  "author": "Christopher Dunn",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/9880082-lost-technologies-of-ancient-egypt"
}