{
  "title": "Grave Injustice: The American Indian Repatriation Movement and NAGPRA",
  "description": "Grave Injustice is the powerful story of the ongoing struggle of Native Americans to repatriate the objects and remains of their ancestors that were appropriated, collected, manipulated, sold, and displayed by Europeans and Americans. Anthropologist Kathleen S. Fine-Dare focuses on the history and culture of both the impetus to collect and the movement to repatriate Native American remains. Using a straightforward historical framework and illuminating case studies, Fine-Dare first examines the changing cultural reasons for the appropriation of Native American remains. She then traces the succession of incidents, laws, and changing public and Native attitudes that have shaped the repatriation movement since the late nineteenth century. Her discussion and examples make clear that the issue is a complex one, that few clear-cut heroes or villains make up the history of the repatriation movement, and that little consensus about policy or solutions exists within or beyond academic and Native communities. The concluding chapters of this history take up the Native American Graves Protection and Repatriation Act (NAGPRA), which Fine-Dare considers as a legal and cultural document. This highly controversial federal law was the result of lobbying by American Indian and Native Hawaiian peoples to obtain federal support for the right to bring back to their communities the human remains and associated objects that are housed in federally funded institutions all over the United States. Grave Injustice is a balanced introduction to a longstanding and complicated problem that continues to mobilize and threatens to divide Native Americans and the scholars who work with and write about them.",
  "genres": [
    "Nonfiction",
    "History",
    "Reference",
    "Native American",
    "Anthropology",
    "American History",
    "Death"
  ],
  "author": "Kathleen S. Fine-Dare",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/987630.Grave_Injustice"
}