{
  "title": "The Changing Light at Sandover",
  "description": "James Merrill’s audacious and dazzling epic poem, The Changing Light at Sandover, remains as startling today as when it first emerged in separate volumes over a period of several years. Individual parts won the Pulitzer Prize and the National Book Award, and the entire poem, when it was collected into one volume in 1982, won the National Book Critics Circle Award. It is now an American classic, here in a definitive new hardcover edition that includes Voices from Sandover, Merrill’s recasting of the poem for the stage. The book carries us to the scene of Merrill’s Ouija board sessions with his partner, David Jackson—the candlelit Stonington dining room with its flame-colored walls and the famous Willowware cup they used as a pointer in their occult travels. In a shimmering interplay of verse forms, Merrill set down their extended conversations with their familiar and guide, Ephraim (a first-century Greek Jew), W. H. Auden, W. B. Yeats, Plato, a brilliant peacock named Mirabell, and other old friends who had passed to the other side. JM (whom the spirits call “scribe”) and DJ (“hand”) are also introduced to the lonely eminence God B (“God Biology”), his sister Mother Nature, and a host of angels and lesser residents of the empyrean who are variously involved in the ways of this world.The laughter, the missteps, and the schoolroom frustrations of the earthly pair’s gradual enlightenment make this otherworldly journey, finally, and utterly human one. A unique exploration of the writer’s role in a postatomic, postreligious age, Sandover has been compared to the work of Yeats, Proust, Milton, and Blake. Merrill’s tale of the joys and tragedies of man’s powers, and his message about the importance of our endangered efforts to make a good life on earth, will stand as one of the most profound experiences available to readers of poetry.",
  "genres": [
    "Poetry",
    "Fiction",
    "Classics",
    "Epic",
    "American",
    "Magic",
    "Literature"
  ],
  "author": "James Merrill",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/98946.The_Changing_Light_at_Sandover"
}