{
  "title": "Saltation",
  "description": "#12 in a breakthrough space opera series with a huge and active base of fans – this is Harry Potter’s Hogwarts Academy in a science fiction setting. A young maverick star-pilot Theo Waitley enters the pilot’s academy where she discovers the heroine inside herself as she follows her destiny as an ace starship pilot and budding leader of a powerful Liaden® clan.#12 in the Liaden® space opera series. Theo, star pilot wannabe and troubled misfit has been accepted, against all her expectations, to Anlingdin. It’s the Hogwarts of star piloting academies, and Theo has been selected to train there with the best-of-the-best. Even better – she can finally leave behind the gawky, misfit days of teenage angst her previous life so complicated before. Great Liaden star pilots are born with a bang and not a whimper–and Theo has set a course to graduate from misfit to genuine maverick.About the Liaden ® Universe “Every now and then you come across an author, or in this case, a pair, who write exactly what you want to read, the characters and personalities that make you enjoy meeting them. . . . I rarely rave on and on about stories, but I am devoted to Lee and Miller novels and stories.” —Anne McCaffrey“ These authors consistently deliver stories with a rich, textured setting, intricate plotting, and vivid, interesting characters from fully-realized cultures, both human and alien, and each book gets better.” – Elizabeth Moon“[T]he many fans of the Liad universe will welcome the latest…continuing young pilot Theo Waitley’s adventures.” – Booklist on Saltation“[A]ficionados of intelligent space opera will be thoroughly entertained. . .[T]he authors' craftsmanship is top-notch.” – Publishers Weekly on Lee and Miller’s popular Liaden® thriller, I Dare",
  "genres": [
    "Science Fiction",
    "Space Opera",
    "Fiction",
    "Fantasy",
    "Space",
    "Young Adult",
    "Adventure"
  ],
  "author": "Sharon Lee",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/9892537-saltation"
}