{
  "title": "Dayling",
  "description": "Turning eighteen is an exciting time for most girls. It means finally being considered a legal adult, having more freedom and a wild birthday party. For Haven Vigano, it means immortality, a craving for human blood and no longer being able to move around in the daytime. Haven is a Dayling, but in three weeks she will 'Cross Over' into the world of Nightlings. Most Daylings live their lives as humans for as long as they can, which means they attend school, make normal friends and indulge in all the pleasures of being mortal... Most Daylings except for Haven. She's as antisocial as they come, even in the Dayling world. To make matters worst, a friend from her past, another Dayling named Sébastien, arrives in Tallahassee with the news that an ancient group of Nightling hunters called The Holy Sect of Mântuitors are hunting down and killing her kind. Haven's father fears a Nightling is helping the Mântuitors in their quest to rid the world of immortals. Now Haven must deal with her growing attraction to Philip, a teenage boy she saved from being beaten by four other guys, plus understand Sébastien's jealousy towards her human crush, and oh yeah, help deal with the threat of the Mântuitors. Times were a lot simpler for Haven when she felt indifferent towards everything and everyone. About the Gabriel Madison Gabriel Madison started writing when he was in high school. He attended a private art University in Atlanta Georgia for Media Production where he wrote a few screenplays and made a few short movies, including a twelve-minute vampire movie he adapted from a short story called Midnight Diner. Later, he returned to writing novellas and novel length projects. His first novel, Three Seeds, was released in August. Also, he has a novella called The Green-Eyed Devil coming out as an eBook. Gabriel was once asked to describe myself; the only answer he could come up with storyteller.",
  "genres": [
    "Young Adult",
    "Vampires",
    "Paranormal",
    "Urban Fantasy",
    "Fiction",
    "Fantasy",
    "Paranormal Romance"
  ],
  "author": "Gabriel Madison",
  "average_rating": "3.38",
  "url": "https://www.goodreads.com/book/show/9900405-dayling"
}