{
  "title": "The Gentle Subversive: Rachel Carson, Silent Spring, and the Rise of the Environmental Movement",
  "description": "Rachel Carson's Silent Spring antagonized some of the most powerful interests in the nation--including the farm block and the agricultural chemical industry--and helped launch the modern environmental movement. In The Gentle Subversive , Mark Hamilton Lytle offers a compact life of Carson,illuminating the road that led to this vastly influential book.Lytle explores the evolution of Carson's ideas about nature, her love for the sea, her career as a biologist, and above all her emergence as a writer of extraordinary moral and ecological vision. We follow Carson from her childhood on a farm outside Pittsburgh, where she first developed herlove of nature (and where, at age eleven, she published her first piece in a children's magazine), to her graduate work at Johns Hopkins and her career with the Fish and Wildlife Service. Lytle describes the genesis of her first book, Under a Sea Wind , the incredible success of The Sea Around Us (aNew York Times Bestseller for over a year), and her determination to risk her fame in order to write her \"poison book\": Silent Spring . The author contends that despite Carson's demure, lady-like demeanor, she was subversive in her thinking and aggressive in her campaign against pesticides. Carsonbecame the spokeswoman for a network of conservationists, scientists, and concerned citizens who had come to fear the mounting dangers of the human assault on nature. What makes this story particularly compelling is that Carson took up this cause at the very moment when she herself faced a losingbattle against cancer.Succinct and engaging, The Gentle Subversive is a story of success, celebrity, controversy, and vindication. It will inspire anyone interested in protecting the natural world or in women's struggle to find a voice in society.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Ecology",
    "History",
    "Environment",
    "Science",
    "Nature"
  ],
  "author": "Mark H. Lytle",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/99087.The_Gentle_Subversive"
}