{
  "title": "Celtic Storms",
  "description": "Celtic Storms is a mystical phenomenon! #3 Best Book of February, 2012, GoodReads \"This is more than just a love story. It is a story that will connect the reader through time. This story has well-developed characters, an amazing plot and is well written.\" ~ S. Welker \"… it's obvious that Ms. Rhodes has spent a great deal of time and energy researching this particularly tumultuous time in the history of Ireland.\" ~ M. Bryce Celtic Storms Darina O'Malley watched the sun set in the bay from the great tower in O'Malley castle - saying a silent prayer for her cousin Kyra and hoping the message that was delivered to the MacCahan's did not spell sudden doom for her and her people. If what her Uncle Ruarc had told her was true, she was to be married to a stranger in less than five days and her world would turn upside down. The realization that her clan held secrets which could destroy them forever chilled her blood. Who was this son of a Laird she was betrothed to and how would he react when he learned the truth? Steel Series - Other Books in the Series - coming soon! Celtic Shores, Book 2 - May, 2012, GoodReads #25 Best Book of May 2012 Celtic Stars, Book 3 - August, 2012 Celtic Skies, Book 4 - October, 2012 Celtic Sun, Book 5 - December, 2012 \"Celtic Storms, Book 1 in the Celtic Steel Series, explores the captivating lives of fifteenth century Irish Celts and their quest for dominance in an ancient land full of magic, murder and mayhem.\" ***************************** DIALECT DISCLAIMER The characters represented in this work of fiction come from a time and place unlike our own. In an attempt to create as realistic as possible an atmosphere for the reader; there will be some direct emphasis on accent, dialect and pronunciation in the dialogue. What you will find are not, in fact, misspellings or instances of bad grammar on the part of the author. Rather, you will discover phonetically enriched wordings—to symbolize the language and methods of communication in the period and geographical areas represented.",
  "genres": [
    "Historical",
    "Fantasy",
    "Paranormal",
    "Medieval",
    "Ireland",
    "Fiction",
    "Historical Romance"
  ],
  "author": "Delaney Rhodes",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/13241384-celtic-storms"
}