{
  "title": "Goddess of Vengeance",
  "description": "Jackie Collins’ fierce and wildly beautiful heroine Lucky Santangelo is back with a vengeance—in a novel full of power, passion, revenge, and the raging family dynamics of the Santangelo clan—and, as always, Lucky comes out on top. Lucky runs a high profile casino and hotel complex, The Keys in Vegas. Lennie, her movie star husband, is still writing and directing successful independent movies, while Max, her stubborn and gorgeous teenage daughter is about to celebrate her 18th birthday, and her son, Bobby, owns a string of hot clubs. Lucky has everything. Family. Love. Life. And everything is exactly what billionaire businessman Armand Jordan is determined to take from her one way or the other. Born a Prince in the small but affluent Middle Eastern country of Akramshar, Armand comes to America with his American mother at an early age, and rises to become a real estate business titan. Armand regards women as nothing more than breeding mares or sexual playthings, so when his people inform him that the one property he covets more than anything, The Keys, is not for sale, he is shocked. That a mere woman would dare to turn down his offer to buy The Keys is unthinkable, and Armand vows to force Lucky’s hand whatever it takes. And so the battle for power begins . . . Meanwhile Bobby is dealing with shady Russian investors, while his girlfriend—smart and independent Denver Jones—is becoming a Deputy D.A. in the L.A. drug unit.And Max, Bobby’s seventeen year old sister, is busy embarking on a forbidden affair with a sexy young movie star. An affair they have to keep on the down-low lest Lucky finds out.The word is that “what happens in Vegas stays in Vegas” and what happens in Goddess of Vengeance will blow your mind!",
  "genres": [
    "Fiction",
    "Chick Lit",
    "Romance",
    "Drama",
    "Novels",
    "Contemporary Romance",
    "Contemporary"
  ],
  "author": "Jackie Collins",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/9909915-goddess-of-vengeance"
}