{
  "title": "Au Set, the Woman: The Story of Isis",
  "description": "Special edition coverImagine your life's purpose predetermined before you were even born? Before Au Set was born her mother had planned all she was to be. As the first-born of an ancient legacy in a land called Eshnunna, her life was all designed theologically before she was even born as the oldest daughter of a Goddess Representative of the temple for Inanna named Ninnuit. She was born to a land older than Babylon and even older than Sumer. She was the first in line to an ancient destiny older than recorded history. However, the world had something different planned. As a tribe of men came down vigorously to destroy all of the Goddess cults and all those involved, Au-Set and her family knew their numbers alone would not assure their survival. To keep their world and legacy alive her mother Ninnuit had to think fast to save them all. What she came up would not only save their family and their traditions but to line her family up in the creation of a culture that would shake the world-that of a land far to the south. Kemet was a land of a long and endless river that provided life inside a vast desert. Au-Set and her siblings were sent to create a new dynasty in hopes of preserving her family legacy. They went to a land called Kemet. In Kemet, Au-Set and her siblings would learn to fight to protect all they have ever known and cherished and to forge creatively something new and possibly more powerful than ever their heritage had been. Her siblings became as legendary as she did in the pages of history for they created what we know of Egypt and its mystery of a culture that lasted almost untouched for over three thousand years. She and her twin sister Neb-Het (Nepthys) each took half of the strange and raw land of Kemet to rule over with their brothers Set (Suti) and Au-Sar (Osiris). They had to leave their impact over a dying ancient tradition that they arrived to while still very young and afraid from all they left behind. They saw a rough world of ritual and religious cannibalism and animal worship. Together they conquered the first, built on the second, and made it their own as temple paintings depict. Their brother Tehuti (Thoth) founded writing and Au-Sar brought Kemet agriculture and them to illuminate a land untouched that would endure many millenniums after they turned to dust left many more things. They were the children of a lost culture alone in a vast wilderness striving to survive and to start something the world would never forget-Egypt.",
  "genres": [
    "Historical Fiction",
    "Egypt"
  ],
  "author": "Sharon Desruisseaux",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/9914120-au-set-the-woman"
}