{
  "title": "Karoo",
  "description": "Saul Karoo is a memorable creation. He is a successful Hollywood script doctor, a fixer of flawed films. He is fifty, overweight, a heavy drinker and chain smoker. He is at an age when things break down, but he has no health insurance. His separation from his wife, Dinah, has become another form of marriage. His relationship with his son, Billy, a college student, is one of pure avoidance. He cannot free himself from the grip of the powerful producer Jay Cromwell, who wants him to recut the last great film of the legendary director Arthur Houseman and make it more commercial. After seeing the film, Karoo considers refusing the job. But he soon becomes obsessed with Leila Miller, an unknown actress whom he has spotted in a small scene. In fact Karoo becomes convinced that she is the mother of his adopted son, Billy, and he becomes determined to track her down.Karoo finds Leila in Venice Beach (where she's one of thousands of Hollywood hopefuls), working as a waitress and haunted by the memory of the baby she gave up for adoption. Karoo falls in love with her, and in the grip of his newfound devotion uses every cheap screenwriter's trick to change Houseman's poignant masterpiece into an outrageous comedy that will make Leila a star. And, he plans to unite the long-lost mother and child at the film's premiere. But Billy, not knowing that Leila is his mother, also falls for her and she for him. The triangle ends in an auto accident, with Karoo driving, in which Billy and Leila are killed and the recut film, becomes a huge success. Devastated by the personal disaster he has helped to create, Karoo winds up being hired by Cromwell to transform a journalistic expose of his own tragic machinations into a screenplay.Steve Tesich has grounded his story in the highly recognizable world of New York in the late-eighties, a milieu of unscrupulous West Coast producers, dry cleaning, divorce and fantasies of escape. Karoo is a haunting, highly human, deliciously realistic novel of decline, fall, and rejuvenation.",
  "genres": [
    "Fiction",
    "Novels",
    "Literature",
    "Roman",
    "Contemporary",
    "Film",
    "American"
  ],
  "author": "Steve Tesich",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/991550.Karoo"
}