{
  "title": "Kindness, Clarity, and Insight",
  "description": "Kindness, Clarity, and Insight is widely considered the most readable yet substantial and wide-ranging of the Dalai Lama's works. This celebratory new edition of the very first book of teachings by the Dalai Lama in the English-speaking world coincides with the twenty-fifth anniversary of that historic first teaching series in North America. Translated into twelve languages, it is a testament to the kindness, clarity, and insight of its author. The teachings in this book comprehend and encapsulate in a crisp and concise manner all of the topics to which the Dalai Lama returns repeatedly—the core subject matter of Tibetan Buddhism. Readers of this single volume, manageable in size, will be well prepared for understanding all of the Dalai Lama's subsequent books. Broad in scope and revealing the depth of his knowledge, these teachings display the range of the Dalai Lama and his message, covering a plethora of topics, including the need for compassion, the common goals of the world's religions, karma, the four noble truths, the luminous nature of the mind, meditative concentration, selflessness, the two truths, and the fundamental innate mind of clear light that all the various schools of Tibetan Buddhism aim at manifesting. Although others in Tibet have mentioned that all orders of Tibetan Buddhism have the same basic outlook, the Dalai Lama is the first to explain in detail how this is so, his brilliant syncretic exposition being the final chapter in this book. The book's twenty chapters are deftly arranged in a developmental sequence so that readers easily understand the background needed to appreciate the more complex later topics. Taken as a whole, the teachings in this book provide an accessible map of Tibetan spiritual culture. Despite the numerous titles that have come out bearing the Dalai Lama's name since its first publication, Kindness, Clarity, and Insight is considered his heart message to the West—a foundational key to understanding his other work.",
  "genres": [
    "Buddhism",
    "Nonfiction",
    "Religion",
    "Spirituality",
    "Philosophy",
    "Asia"
  ],
  "author": "Dalai Lama XIV",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/991679.Kindness_Clarity_and_Insight"
}