{
  "title": "The Idea of America: Reflections on the Birth of the United States",
  "description": "The preeminent historian of the American Revolution explains why it remains the most significant event in our history. More than almost any other nation in the world, the United States began as an idea. For this reason, Pulitzer Prize-winning historian Gordon S. Wood believes that the American Revolution is the most important event in our history, bar none. Since American identity is so fluid and not based on any universally shared heritage, we have had to continually return to our nation's founding to understand who we are. In 'The Idea of America', Wood reflects on the birth of American nationhood and explains why the revolution remains so essential. In a series of elegant and illuminating essays, Wood explores the ideological origins of the revolution - from ancient Rome to the European Enlightenment - and the founders' attempts to forge an American democracy. As Wood reveals, while the founders hoped to create a virtuous republic of yeoman farmers and uninterested leaders, they instead gave birth to a sprawling, licentious, and materialistic popular democracy. Wood also traces the origins of American exceptionalism to this period, revealing how the revolutionary generation, despite living in a distant, sparsely populated country, believed itself to be the most enlightened people on earth. The revolution gave Americans their messianic sense of purpose-and perhaps our continued propensity to promote democracy around the world-because the founders believed their colonial rebellion had universal significance for oppressed peoples everywhere. Yet what may seem like audacity in retrospect reflected the fact that in the eighteenth century republicanism was a truly radical ideology-as radical as Marxism would be in the nineteenth-and one that indeed inspired revolutionaries the world over. Today there exists what Wood calls a terrifying gap between us and the founders, such that it requires almost an act of imagination to fully recapture their era. Because we now take our democracy for granted, it is nearly impossible for us to appreciate how deeply the founders feared their grand experiment in liberty could evolve into monarchy or dissolve into licentiousness. Gracefully written and filled with insight, 'The Idea of America' helps us to recapture the fears and hopes of the revolutionary generation and its attempts to translate those ideals into a working democracy.",
  "genres": [
    "History",
    "American History",
    "Nonfiction",
    "American Revolution",
    "Politics",
    "American",
    "Essays"
  ],
  "author": "Gordon S. Wood",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/9912249-the-idea-of-america"
}