{
  "title": "Talking To The Moon",
  "description": "After bringing us the international bestsellers The Mystic Saga, Dominion, Vestige, The Ani Maxima Files, and Saving Brooksie, Scott McElhaney returns with yet another inspiring stand-alone tale. This time he's bringing us to the 1950's. At the sight of his abusive father lying wounded in the driveway; 16 year-old Sean finds himself at his mother’s side being urged to flee. He doesn’t recall what happened, but he reluctantly obeys. Later at a friend’s house, Sean is presented with a place to hide out where no one could ever come searching for him - a safe-house within his own neighborhood, yet fifty years in the past. 1958 welcomes Sean with its trusting neighbors, rock and roll records, sturdy, fast cars without insurance or airbags, and even a spot on the high school football team. Best of all, 1958 welcomes him with a beautiful girl named Clara. Sean is captured by all that his heart could ever desire in this life. As far as he’s concerned, nothing could ever make him return to the life he abandoned… unfortunately, a decision like that may not be his alone to make. Scott McElhaney is the 2008 winner of the Christian Choice Book Award for his first novel \"Mommy's Choice\" and his international sensation The Mystic Saga has secured his place firmly in the science fiction realm. Now he is making most of his novels available to Kindle readers at the very accessible price of only 99 cents. Scott has sold more than 250,000 copies of his books to Kindle readers across the world. EDITORIAL  \"McElhaney's story telling is deft, well-paced, and with an ear for conversation\" ~ Beacon Journal Book Review \"[McElhaney] slipped in under the radar and firmly established himself as a fresh new voice in science fiction before anyone had a chance to react. By then it was too late and nearly every sci-fi fan who owned a Kindle had already discovered this unknown and was actively searching him out.\" ~Associated Content Given 5.0 out of 5 stars over 100 times on Amazon from various readers of the Mystic Saga!",
  "genres": [
    "Fantasy",
    "Time Travel",
    "Science Fiction",
    "Mystery",
    "Young Adult"
  ],
  "author": "Scott McElhaney",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/13241495-talking-to-the-moon"
}