{
  "title": "Guardian Vampire",
  "description": "After witnessing something so terrible in a nightclub that it causes her to lose her memory of it, Kendall St. John finds herself the target of ruthless killers. Her father hires a bodyguard, Logan Steele, to protect her, but everywhere they turn, the killers continue to find them. As Kendall and Logan struggle with their feelings for each other, Logan struggles to protect her from the killers…and from himself.ExcerptKendall couldn’t believe her eyes. Standing before her was the man who had rejected her at the club. His steel gray eyes were amused as they gazed into her green ones. Fury took over her good sense as she stared at him.“Daddy, no!” she said angrily. “I don’t need a bodyguard, especially this one!”Her father frowned at her. “What do you mean, especially this one? Do you two know each other?”“Our paths crossed once,” said Logan, his eyes twinkling with mischief. He was enjoying this way too much.“Daddy, I don’t need….”“That’s enough!” St. John said sharply. “This man has been recommended by the security service as the best they have. And the most expensive, I might add. He is now your personal security. Learn to live with it.”Bristling with indignation, she turned around and ran up the stairs, feeling Logan’s eyes on her back as she went. But she resisted the urge to look back. When she got to her room, she slammed the door and threw herself on her bed. Shaking with fury, she threw her pillows across the room.A few minutes later, she heard noises in the guest room next to her suite. What was going on? She put her ear against the wall that divided the two rooms and heard furniture being moved and the closet door being opened. She opened her bedroom door and tiptoed to the other room. She couldn’t believe her eyes. Logan Steele had moved some of the furniture to have quicker access to the door. He also had put a large duffel bag down on the floor and had put some of his things in the closet.Suddenly, he turned around and spotted her. He grinned and said, “I guess you’re stuck with me for awhile.”“I don’t need you,” she declared.“Judging by what happened in your room, I’m going to have to disagree with you. My job is to keep you safe, regardless of your personal feelings or mine. Get used to it.”“Good luck keeping up with me,” she said smugly.“I have lots of experience keeping up with wayward children.”“I’m not a child!” she said, anger in her voice.“That’s debatable,” he said, a smile twitching at the corners of his mouth.She turned around and flew out of the room and back into hers. She could hear his chuckle before she slammed her door. How dare he treat her like this? She would show him that she could outsmart him!",
  "genres": [
    "Paranormal Romance",
    "Vampires"
  ],
  "author": "Lauralynn Elliott",
  "average_rating": "3.31",
  "url": "https://www.goodreads.com/book/show/9912080-guardian-vampire"
}