{
  "title": "Caleb's Crossing",
  "description": "Geraldine Brooks once again takes a shard of little-known history and brings it vividly to life. In 1665, a young man from Martha’s Vineyard became the first Native American graduate of Harvard College. From the few facts that survive of this extraordinary life, Brooks creates a luminous tale of passion and belief, magic and adventure. The voice of Caleb’s Crossing belongs to Bethia Mayfield, growing up in the tiny island settlement of Great Harbor amid a small band of pioneering English Puritans. Restless and curious, Bethia slips the bounds of her rigid society to explore the island’s glistening beaches and observe its native inhabitants. At twelve, she meets Caleb, the young son of a chieftain, and the two forge a secret bond that draws each into the alien world of the other. Bethia’s minister father, who feels called to convert eh Wampanoag, awakens the wrath of the medicine men, against whose magic he must test his own faith. Caleb becomes a prize in this contest, eventually taking his place at Harvard, studying Latin and Greek alongside the sons of the colonial elite. Bethia also finds herself in Cambridge at the behest of her imperious elder brother. As she fights for a voice in a society that requires her silence, she also becomes entangled in Caleb’s struggle to navigate the shoals that divide their two cultures.What becomes of these characters – the triumphs and turmoil they endure in embracing their new destinies – is the subject of this riveting novel. Berthia proves an irresistible guide to the wilds of Martha’s Vineyard and to the intimate spaces of the human heart. [From the cover.]Total running time: approximately 12 hours.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Book Club",
    "Historical",
    "Audiobook",
    "Native American",
    "Adult"
  ],
  "author": "Geraldine Brooks",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/9909234-caleb-s-crossing"
}