{
  "title": "Milor!",
  "description": "Terrorists are creating a climate of fear on the planet Arrosa, and although no demands have been made, nor claims of credit taken for the attacks, the Prime Minister believes that the government of their neighboring planet, Selax, is solely responsible. As commander of the only Space Command base in that part of space, Captain Jenetta Carver is responsible for maintaining the peace, and the task of preventing a system-wide war falls squarely upon her shoulders. Since the dispatched diplomatic corps hasn't yet arrived at the base, she must resolve the disputes without their assistance. The people of the two planets share a common genus and ancestry, and Captain Carver manages to convince the two planetary governments to accept binding arbitration, but one party ingeniously stalls the talks for their own purposes.Meanwhile, several Milora have been discovered in the company of an arms merchant's Tsgardi henchmen. The Milori, an ugly warlike race often compared more to cockroaches then humanoid life forms, come from a home planet well outside Galactic Alliance borders. There's an old saying in Space Command that, like cockroaches, if you see one Milora, there're probably a thousand more concealed nearby. And Jenetta knows that a thousand hostile warriors in GA space can only mean serious trouble is brewing. She immediately dispatches a ship to investigate an Intelligence Section report of Milori sightings near a planet in the GA's Frontier Zone.The GSC destroyer Ottawa, following up on the lead, locates a task force of Milori warships exactly where reported, and the captain demands an explanation of their presence in GA space. The Milori respond with action rather than words, leaving little doubt about their intentions, and events begin spiraling out of control.105,200 Words - 320 Pages",
  "genres": [
    "Science Fiction",
    "Space Opera",
    "Space",
    "Military Fiction",
    "Military Science Fiction",
    "Adventure",
    "War"
  ],
  "author": "Thomas DePrima",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/9920607-milor"
}