{
  "title": "الصندوق الأسود : حكايا مثقفين سعوديين",
  "description": "فتح الصندوق الأسود للطائرات ليس بالأمر الهيِّن، فكيف بصناديق البشر؟ إنها المهمة التي اختارها لنفسه الكاتب والصحافي السعودي عبدالله المغلوث، ونشر سلسلة حواراتها تباعاً في بعض الصحف، قبل أن يجمعها ويُؤلِّف حولها كتاب \"الصندوق الأسود.. حكايات مثقفين سعوديين\"، الصادر عن دار مدارك في كانون الثاني (يناير) 2011.ويُرجع المغلوث في مقدمة كتابه قصة هذه الحوارات التي جمعته بجُملة من ألمع الكُتَّاب والإعلاميين والمثقفين السعوديين، إلى \"الفضول\" الذي اكتشف مؤخراً أنه لا يسكنه وحده، بل يقطننا أجمعين - بحسبه -، ويقول: \"استوقفني الكثير من الأصدقاء ليسألوني عن خفايا زواج بدرية البشر وناصر القصبي...، وأشبعوني نقاشاً حول الثوب القصير الذي ارتداه تركي الدخيل بعد عودته من الحج...، وتحدثوا طويلاً عن رعي سليمان الهتلان للغنم الذي استهل به اللقاء، ….\"، إلى مفارقات جمَّة حملها إلينا عبر \"الصندوق الأسود\"، غاص بنا عبره إلى عوالم بيضاء نيِّرة، هي مدارس لأجيالٍ قادمة. لم تكن الطالبة الجامعية - آنذاك - بدرية البشر تُدرك أن اتصالها بالمهندس الزراعي والممثل في بعض المسلسلات، ناصر القصبي، لتطلب منه أن يكتب لها نصاً مسرحياً لمسرحية نهاية العام الجامعي، سينتهي بسؤاله لها: \"تتزوجيني؟!\".هكذا رسمت الدكتورة الجامعية والكاتبة والروائية بدرية البشر الخيوط الأولى لزواجها بالفنان الشهير ناصر القصبي، بحسب \"الصندوق الأسود\". واعترفت للمغلوث أنها كانت في صباها تخرج لتشتري الخبز لأسرتها، متسائلة: \"لماذا كانت مهمتي أنا شراء الخبز، ولا أدري لماذا لم ترسل أمي أخي الأكبر؟ هل هو دلال وحظوة بمناسبة أنه الولد الذكر، أم أنني كنت الحائط القصير الذي تستطيع أمي قهره ليطيع أوامرها؟\".وحين سألها الكاتب عن أول قلم، أجابت البشر: \"في بيتنا لا يمنحون أقلاماً، إلا الأقلام على الطريقة المصرية، خاصة وأن والديّ لا يجيدان الكتابة، وأنا كنت الابنة الكبرى. جاءني أول قلم مع مشتريات طلبات المدرسة، لكنني منذ عثرت عليه لم أنفك عنه أبداً\".أما \"صندوق\" تركي الدخيل فكان حافلاً، من المحاولات اليافعة الجادة للولوج إلى الصحافة، وانتهاءً ببرنامجه \"إضاءات\" الذي بدت باكورة حلقاته عام 2002 عبر أثير الإذاعة التي تسمى حالياً بـ mbc بانوراما، ثم انتقل إلى \"العربية\" التلفزيونية، مستفتحاً الظهور التلفزيوني بلقاء مع وزير العمل السعودي الراحل غازي القصيبي. يقول تركي: \"جئت للمايكروفون من بلاط صاحبة الجلالة (الصحافة)، وأعتقد أني أضفت بخلفيتي الصحافية شيئاً. لو كنتُ مذيعاً فحسب لما أثرتُ نقعاً\".وكما كان للدخيل قصة نجاح، سبر أغوارها الكاتبُ في عدة فصول، كان لسليمان الهتلان قصة عشق، انتهت بانفصاله عن معشوقته التي كانت شاهدة على حجم الجهد والكفاح الذي بذله في الفترة بين 1988 1991. يقول الدكتور الهتلان عن اختفائه المفاجئ عن صفحات معشوقته صحيفة الرياض: \"حاولت ألا يحدث الانفصال لكنه حدث. أدركت بعدها أنني كنت أدفن نفسي في نفق يدفنك ولا يمكنه أن يقودك إلى نقطة ضوء\".وبسؤال كبير بحجم إبداعها، قابل الكاتب الروائية ليلى الجهني، وفي صدره: \"كيف استطاعت السعودية ليلى أن تبني هذه العلاقة الخاصة مع الحرف، وتكتب بهذه الجودة، ما القصة؟\". وجاءت الإجابات تترى، تتماوج مع دفة الحوار، بعفوية خلاقة. انهمرت ليلى: \"تراكمت لديَّ دفاتر ملأى بالخربشات، وكنتُ مقتنعة أن ليس في ما أكتبه رائحة أدب عظيم، ولم يزعجني ذلك\". وتروي: \"احتجتُ إلى ثلاثة أعوام من الكتابة فالتمزيق فالندم، قبل أن أعي أنني أمزق أوراقي فإنما هي جزء من حياتي\". سَبَح بنا المغلوث إلى \"صندوقه الأسود\"، الذي علق على اسمه الصحافي عمر المضواحي في \"تويتر\" مداعباً :\"ليته أسماه الصندوق الأبيض، مع تفهمي له\"، وانتقى لنا أصدافا عدة، بزغ لنا من خلالها أحمد الملا، وسلطان البازعي وعبده خال، وليلى الجهني، وبدرية البشر، وتركي الدخيل، وسليمان الهتلان، ومحمد العلي، ونداء أبو علي.محمد جمال، موقع قناة العربية نت، 22 مارس 2011",
  "genres": [
    "Nonfiction",
    "Biography"
  ],
  "author": "عبدالله المغلوث",
  "average_rating": "2.88",
  "url": "https://www.goodreads.com/book/show/9932158"
}