{
  "title": "The Battle of the Villa Fiorita",
  "description": "Two English children travel to Italy to rescue their wayward mother from her lover and save their family in this New York Times–bestselling novel.   The lives of the two Clavering children, Hugh and Caddie, have been abruptly upended by the bitter divorce of their parents, British Army colonel Darrell and the formerly solid, dependable Fanny. Their English country home has been abandoned in favor of a London flat, and the fate of their adored pony, Topaz, is in serious question. And it all began the day the internationally renowned movie director, Rob Quillet, came to their small village and stole Fanny’s heart.   Now Fanny is gone, whisked off to the north of Italy by her famous filmmaker lover, leaving behind the jagged pieces of her broken family. While Hugh, at fourteen, understands the ways of the adult world better than his twelve-year-old sister, he is fiercely protective of stubborn, rebellious Caddie, who refuses to accept the situation or the hollow sympathy of grown-ups. So together they decide to take drastic action.   Traveling alone across Europe, the siblings arrive at Quillet’s pastoral Italian villa overlooking Lake Garda, determined to do battle with the man responsible for the destruction of their family. There can be no peace until they are victorious—and victory will only be achieved when they bring their mother home.   A novel that masterfully blends heart, wit, poignancy, and honesty with a breathtaking evocation of the lush Northern Italian countryside, Rumer Godden’s The Battle of Villa Fiorita is another unforgettable reading experience from the New York Times–bestselling author of The River and In This House of Brede.",
  "genres": [
    "Fiction",
    "Italy",
    "Literary Fiction",
    "Classics",
    "Contemporary",
    "Historical Fiction",
    "Novels"
  ],
  "author": "Rumer Godden",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/992611.The_Battle_of_the_Villa_Fiorita"
}