{
  "title": "What She Needs",
  "description": "Taking turns was never their strong suit... Cape May, Book 3 Devon Mason and Con Walker are sexy, honorable, loving, and completely devoted. In other words, everything Tory looks for in a relationship. But what's she supposed to buy her two lovers on V Day? Chocolate? How average is that? Their little love triangle is anything but average! When Con surprises her with a weekend in Cancun, just the three of them, Tory is all over it--until she realizes Con forgot to include Devon in the package. Now their little love triangle is suffering, thanks to a couple of hard-headed men who both want to be numero uno. Con was content to let Devon take control at Christmas, but now it's his turn. A weekend in Cancun seems the perfect place for a romantic getaway--then Devon says he's planning to surprise Tory with a trip to Aruba, and Con's possessive instincts kick in. He'd always been happy to share Tory with the guy he cares for like a brother. But the deeper Con falls in love, the harder it is to keep from ripping Tory away from Devon. Sooner or later something--or someone--is going to give. This title contains lots of steamy, explicit sex. Hot, jealous men in need of a strong, intelligent woman. And a warm, loving ménage a trois relationship.Excerpt Copyright © 2011 Anne Rainey All rights reserved -- a Samhain Publishing, Ltd. publication  \"Well, that was a pleasant way to wake up,\" Tory said as she dropped onto the mattress. Every nerve ending in her body was buzzing from her glorious orgasm. Devon chuckled and kissed the top of her head before moving onto the bed and cradling her body against his. \"Just pleasant?\" Without saying a word, Con shot up and headed toward the bathroom. Had she done something wrong? He was never quiet, especially after making love. When he reappeared, Tory noticed his gaze went straight to Devon and, unless she was mistaken, Con looked pissed. What was that about? As she sat up, Tory grabbed the sheet and wrapped it around her body. \"Con?\" Con's gaze softened as he stared at the hand she used to clutch the sheet close. \"It's been over two months, baby. You can lose the sheet.\" Tory smoothed her palm over the soft, light blue cotton material and said, \"You two might've talked me into sleeping naked, but sitting around in the bright light of day in my birthday suit is never going to happen.\" \"We'll see, won't we?\" Devon asked. He moved off the bed and pulled on his pajama pants before moving to sit in the chair he'd vacated earlier. \"Yes, we will.\" Always pushing for more, that was Con and Devon, but Tory wasn't budging on this one. Con went to the dresser and opened a drawer. After retrieving a pair of black silk boxers, he slid them on and leaned against the dresser, crossing his legs at the ankles. God, the man was delicious. His close-cropped midnight black hair always tempted Tory to reach out and play. Add a thickly muscled chest and gorgeous six-pack abs to the mix and it was no wonder Tory craved the man. Yep, Con was a silver-eyed hunk, no doubt about it. \"I have something to tell you two,\" he said. \"Now's as good a time as any, I guess.\" Tory and Devon looked at each other, then back at Con. \"Shoot,\" Devon said. \"Next Monday is Valentine's Day.\" Butterflies flitted around in Tory's stomach at the reminder. Valentine's Day. Crap. She didn't have a clue what she was supposed to get Con and Devon.",
  "genres": [
    "Erotica",
    "Romance",
    "Menage",
    "Adult",
    "Short Stories",
    "Erotic Romance",
    "Contemporary Romance"
  ],
  "author": "Anne Rainey",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/9923450-what-she-needs"
}