{
  "title": "GOT HOMOPHOBIA",
  "description": "FOR IMMEDIATE RELEASEGot Homophobia by Azaan KamauFor Interviews Contact: Media Relations azaankamau@gmail.com or 424-703-3277 The author of the bestselling books In The Midst of My Blackness, STUD; Dispelling The Myths, The Memoirs of Madlyn F. Glover; A love & Romance with Ray Charles Robinson brings us Got Homophobia! Got Homophobia is one of the most profound books written about America’s youth being bullied to death, and hate as a whole. This remarkable book asks the hard questions; what is America doing about gay youth suicide, why is homophobia taught as the norm, why are SGL/ LGBT youth and people are consistently treated as second class citizens? This rare book speaks on how homophobia and heterosexism are directly connected to bullying, and how the isolation sometimes leads to dangerous behaviors and suicide. Got Homophobia is timely and innovative. This book is jaw dropping, pain filled, yet uplifting and informative. The book takes us on a vibrant journey into Azaan’s youth and the youth of her brother Dijan Bruttus. The book paints pictures of the pain and agony of bullying, and the scars it leaves behind. Got Homophobia also speaks on the five young people who were recently bullied to death. The book takes a hard look at faith based rights, HIV/AIDS, the church, and Dr. and Mrs. King support of SGL/LGBT people. The book also provides tips on bullying prevention and intervention. The book speaks about the schools responsibility to protect your child during school hours or while the child is on campus, and how do affirm your child if you think he or she is SGL/LGBT! This mind-boggling book makes a bold statement that we as a nation must fight bullying and intolerance as a whole. Azaan assures the reader that whatever your age, culture, race or religion, you will find this amazing book uplifting, reassuring, and an overall great read! What People Are Saying About Got Homophobia!\"Azaan Kamau's Got Homophobia is an extremely important and timely book in an era where youth are committing suicide in alarming numbers. This book should be required reading in every classroom, college, cultural and religious institution.\" Award-winning journalist, bestselling author and renowned activist, Ifalade Ta'Shia Asanti“Azaan’s new book Got Homophobia is profound and quintessential to our current climate of homophobia and bullying. This book is a must read for every parent and educator in the country”! Poet & Best Selling Author Salima MaSud“Azaan’s book gives voice to all of the gay people who have felt muted and silenced. It empowers those who have felt the sting of someone’s intolerance”JHS ProductionsAuthor's upcoming projects include: Stiletto, Tapestries of Faith: Black SGLBT Stories of Triumph, Family, Love & Healing, Lesbian Legal: Affirming Your Relationship One Document at a Time, 90221, and Samba Nation To arrange for book signings, press interviews, lectures or to purchase the book please contact: azaankamau@gmail.com Please Visit Azaan Kamau’s Websites at:http://azaankamau.webs.comhttp://gloverlanepress.webs.comhttp://www.blurb.com/user/store/Azaan...http://amazon.com \"ON SALE NOW\"",
  "genres": [],
  "author": "Azaan Kamau",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/9927443-got-homophobia"
}