{
  "title": "A Humble Romance and Other Stories",
  "description": "He caught hold of the girl by her slender shoulders and faced her round towards him. She turned pale, and gave a smothered scream. \"Thar! thar! don't you go to being afeard of me,\" said the peddler. \"I wouldn't hurt you for the whole world. I jest want to take a squar look at you. You're the worst-off-lookin' little cretur I ever set my eyes on.\" She looked up at him pitifully, still only half reassured. There were inflamed circles around her dilated blue eyes. \"You've been cryin', ain't you?\" The girl nodded meekly. \"Please let me go,\" she said. \"Yes, I'll let you go; but I'm a-goin' to ask you a few questions first, an' I want you to answer 'em, for I'll be hanged ef I ever see -- Ain't she good to you?\" -- indicating Mrs. King with a wave of his hand toward the door through which she had departed. \"Yes, she's good enough, I guess.\" \"Don't ever scold you, hey?\" \"I don' know; I guess so, sometimes.\" \"Did this mornin', didn't she?\" \"A little. I was kinder behind with the work.\" \"Keeps you workin' pretty stiddy, don't she?\" \"Yes; thar's consider'ble to do this time o' year.\" \"Cookin' for hired men, I s'pose, and butter an' milk?\" \"Yes.\" \"How long hev you been livin' here?\" \"She took me when I was little.\" \"Do you do anything besides work? -- go round like other gals? -- hev any good times?\" \"Sometimes.\" She said it doubtfully, as if casting about in her mind for reminiscences to prove the truth of it. * Also included in this volume are \"Two Old Lovers,\" \"A Symphony in Lavender,\" \"A Tardy Thanksgiving,\" \"A Modern Dragon,\" \"An Honest Soul,\" \"A Taste of Honey,\" \"Brakes and White Vi'lets,\" \"Robins and Hammers,\" \"On the Walpole Road,\" \"Old Lady Pingree,\" \"Cinnamon Roses,\" \"The Bar Light-house,\" \"A Lover of Flowers,\" \"A Faraway Melody,\" \"A Moral Exigency,\" \"A Mistaken Charity,\" \"Gentian,\" \"An Object of Love,\" \"A Gatherer of Simples,\" \"An Independent Thinker,\" \"In Butterfly Time,\" \"An Unwilling Guest,\" \"A Souvenir,\" \"An Old Arithmetician,\" \"A Conflict Ended,\" \"A Patient Waiter,\" \"A Conquest of Humility.\"",
  "genres": [
    "Short Stories",
    "Fiction"
  ],
  "author": "Mary E. Wilkins Freeman",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/9927173-a-humble-romance-and-other-stories"
}