{
  "title": "The Oxford Companion to Crime and Mystery Writing",
  "description": "From the penny dreadful, which challenges seekers of sensation to discover the truth in a pattern of gory details; to the twentieth-century detective novel, which offers an intricate puzzle solved through the application of the intellect; to the crime novel, which probes the psyches of the characters, the crime and mystery genre offers readers an intellectual excitement unsurpassed by other forms of fiction. Now The Oxford Companion to Crime and Mystery Writing provides scholars and fans of this genre with an authoritative yet playful compendium of knowledge about a literature known for its highly entertaining treatment of deadly serious puzzles. Editor Rosemary Herbert has brought together 666 articles--written by such authorities as Edward D. Hoch, Sara Paretsky, and the late Julian Symons--that will accompany readers in their armchair investigations. Here can be found informative biographies of great mystery writers from Edgar Allan Poe to Rex Stout to Ruth Rendell. Here, too, favorite sleuths--including Sherlock Holmes, Hercule Poirot, Sam Spade, Nero Wolfe, Adam Dalgliesh, and Kinsey Milhone--keep company with master criminals such as Professor Moriarty and Fu Manchu. Character types--from the country constable to the omniscient sleuth to the femme fatale--sleuth, think, or slink within these pages. In the great tradition of Oxford Companions, this volume features extended essays on the development of this literature, its subgenres and schools of writing. It also serves as a catalogue of the components of mystery writing, such as famous clues, authorial ingenuity, and even an entry on \"The Butler Did It.\" A strength of the volume is found in linked articles which can guide readers from, for instance, a careful definition of Murder to a delightfully quirky compendium of fictional victims in an article on The Corpse.",
  "genres": [
    "Reference",
    "Mystery",
    "Literature",
    "Books About Books"
  ],
  "author": "Rosemary Herbert",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/993011.The_Oxford_Companion_to_Crime_and_Mystery_Writing"
}