{
  "title": "Charlie and the Chocolate Factory",
  "description": "The inspiration for the major motion picture musical prequel, Wonka , starring Timothée Chalamet, Olivia Colman, Keegan-Michael Key, Rowan Atkinson, Sally Hawkins, and Hugh GrantThis stunning deluxe edition of Roald Dahl’s beloved Charlie and the Chocolate Factory • A new introduction by Lev Grossman, the #1 New York Times bestselling author of The Magicians• C over art by the award-winning cartoonist Ivan Brunetti• T he original interior art from the 1964 first edition• French flaps and deckle-edged paperTwice turned into a feature film, Charlie and the Chocolate Factory is a delectable classic about a child’s dreams and the eccentric chocolate-maker who makes them come true. When Willy Wonka’s hallowed chocolate factory holds a worldwide contest awarding tours to the lucky, five children emerge as winners, including a glutton, a gum-chewing nitwit, a spoiled brat, and a TV addict. Only Charlie Bucket, the story’s earnest hero, stands to win the exotic riches of Wonka’s empire—if he avoids the pitfalls of his fellow contestants and stays true to his heart. Ingenious and entertaining, Charlie and the Chocolate Factory is a true modern classic by one of the most beloved storytellers of our time.For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.",
  "genres": [
    "Fiction",
    "Fantasy",
    "Childrens",
    "Young Adult",
    "Middle Grade",
    "Classics",
    "Humor"
  ],
  "author": "Roald Dahl",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/9923756-charlie-and-the-chocolate-factory"
}