{
  "title": "Reading Jackie: Her Autobiography in Books",
  "description": "Jacqueline Kennedy Onassis never wrote a memoir, but she told her life story and revealed herself in intimate ways through the nearly 100 books she brought into print during the last two decades of her life as an editor at Viking and Doubleday. Based on archives and interviews with Jackie's authors, colleagues, and friends, Reading Jackie mines this significant period of her life to reveal both the serious and the mischievous woman underneath the glamorous public image.   Though Jackie had a reputation for avoiding publicity, she willingly courted controversy in her books. She was the first editor to commission a commercially-successful book telling the story of Thomas Jefferson’s relationship with his female slave.  Her publication of Gelsey Kirkland's attack on dance icon George Balanchine caused another storm. Jackie rarely spoke of her personal life, but many of her books ran parallel to, echoed, and emerged from her own experience. She was the editor behind bestsellers on the assassinations of Tsar Nicholas II and John Lennon, and in another book she paid tribute to the allure of Marilyn Monroe and Maria Callas. Her other projects take us into territory she knew well: journeys to Egypt and India, explorations of the mysteries of female beauty and media exploitation, into the minds of photographers, art historians, and the designers at Tiffany & Co.  Many Americans regarded Jackie as the paragon of grace, but few knew her as the woman sitting on her office floor laying out illustrations, or flying to California to persuade Michael Jackson to write his autobiography. Reading Jackie provides a compelling behind-the-scenes look at Jackie at work: how she commissioned books and nurtured authors, as well as how she helped to shape stories that spoke to her strongly. Jackie is remembered today for her marriages to JFK and to Aristotle Onassis, but her real legacy is the books that reveal the tastes, recollections, and passions of an independent woman.From the Hardcover edition.",
  "genres": [
    "Biography",
    "Nonfiction",
    "History",
    "Books About Books",
    "Biography Memoir",
    "Audiobook",
    "Womens"
  ],
  "author": "William Kuhn",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/9936785-reading-jackie"
}