{
  "title": "Flowers from Berlin",
  "description": "Love and betrayal, spies and patriots, murder and romance, Roosevelt versus Hitler on the eve of World War Two. \"Winds of War\" meets \"The Eye of The Needle.\"  This espionage thriller follows FBI agent William Cochrane's efforts to stop a Nazi spy from assassinating FDR. Toss in a love affair with a British Secret Service operative and you have the makings of a page-turner. It is 1939. Roosevelt is winding down his second term in the White House. The Nazis have taken Austria, and Stalin’s Red Army is systematically eliminating the Kremlin’s enemies. Europe is going to hell in a handbasket. With isolationist sentiment running high in America, and the president’s popularity at an all-time low, Hitler seizes the moment and dispatches his secret weapon: An agent named 'Siegfried' who conceals himself behind the mask of middle-class America. A chameleon who can change identities and personalities at will. A cold-blooded killer who will win the war for Germany.  A banker, linguist, and demolitions expert who has successfully infiltrated German intelligence, FBI Special Agent Thomas Cochrane is handpicked by Roosevelt for an impossible mission: To find Hitler’s spy before he carries out a plan that will remove the president from office at a critical moment in the century’s history. As Cochrane, with the help of British Intelligence agent Laura Worthington, circles closer to his elusive quarry, a spy with supporters in the highest levels of U.S. government readies the world stage for a final act of annihilation that will alter the tide of war--and the future of the free world--in unthinkable ways.  Imagine a world where your most precious inalienable rights are denied. Where individual freedom is a thing of the past. Imagine World War II without FDR ...",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Thriller",
    "World War II",
    "Mystery",
    "Espionage",
    "Historical"
  ],
  "author": "Noel Hynd",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/9936945-flowers-from-berlin"
}