{
  "title": "The Power of a Positive No: How to Say No and Still Get to Yes",
  "description": "\"William Ury brings a marvelous blend of experience, insight, integrity and warmth to his work. In this wonderful book he teaches us how to say No--with grace and effect--so that we might create an even better Yes.\" --Jim Collins, author of Good to GreatNo is perhaps the most important and certainly the most powerful word in the language. Every day we find ourselves in situations where we need to say No-to people at work, at home, and in our communities-because No is the word we must use to protect ourselves and to stand up for everything and everyone that matters to us.But as we all know, the wrong No can also destroy what we most value by alienating and angering people. That's why saying No the right way is crucial. The secret to saying No without destroying relationships lies in the art of the Positive No, a proven technique that anyone can learn.This indispensable book gives you a simple three-step method for saying a Positive No. It will show you how to assert and defend your key interests; how to make your No firm and strong; how to resist the other side's aggression and manipulation; and how to do all this while still getting to Yes. In the end, the Positive No will help you get not just to any Yes but to the right Yes, the one that truly serves your interests.Based on William Ury's celebrated Harvard University course for managers and professionals, The Power of a Positive No offers concrete advice and practical examples for saying No in virtually any situation. Whether you need to say No to your customer or your coworker, your employee or your CEO, your child or your spouse, you will find in this book the secret to saying No clearly, respectfully, and effectively.In today's world of high stress and limitless choices, the pressure to give in and say Yes grows greater every day, producing overload and overwork, expanding e-mail and eroding ethics. Never has No been more needed. A Positive No has the power to profoundly transform our lives by enabling us to say Yes to what counts-our own needs, values, and priorities.Understood this way, No is the new Yes. And the Positive No may be the most valuable life skill you'll ever learn.",
  "genres": [
    "Business",
    "Nonfiction",
    "Self Help",
    "Psychology",
    "Communication",
    "Leadership",
    "Personal Development"
  ],
  "author": "William Ury",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/99401.The_Power_of_a_Positive_No"
}