{
  "title": "The Pursuit of Power",
  "description": "s/t: Technology, Armed Force & Society since AD 1000In this magnificent synthesis of military, technological, and social history, William H. McNeill explores a whole millennium of human upheaval and traces the path by which we have arrived at the frightening dilemmas that now confront us. McNeill moves with equal mastery from the crossbow—banned by the Church in 1139 as too lethal for Christians to use against one another—to the nuclear missile, from the sociological consequences of drill in the seventeenth century to the emergence of the military-industrial complex in the twentieth. His central argument is that a commercial transformation of world society in the eleventh century caused military activity to respond increasingly to market forces as well as to the commands of rulers. Only in our own time, suggests McNeill, are command economies replacing the market control of large-scale human effort. The Pursuit of Power does not solve the problems of the present, but its discoveries, hypotheses, and sheer breadth of learning do offer a perspective on our current fears and, as McNeill hopes, \"a ground for wiser action.\" \"No summary can do justice to McNeill's intricate, encyclopedic treatment. . . . McNeill's erudition is stunning, as he moves easily from European to Chinese and Islamic cultures and from military and technological to socio-economic and political developments. The result is a grand synthesis of sweeping proportions and interdisciplinary character that tells us almost as much about the history of butter as the history of guns. . . . McNeill's larger accomplishment is to remind us that all humankind has a shared past and, particularly with regard to its choice of weapons and warfare, a shared stake in the future.\"—Stuart Rochester, Washington Post Book World \"Mr. McNeill's comprehensiveness and sensitivity do for the reader what Henry James said that Turgenev's conversation did for him: they suggest 'all sorts of valuable things.' This narrative of rationality applied to irrational purposes and of ingenuity cannibalizing itself is a work of clarity, which delineates mysteries. The greatest of them, to my mind, is why human beings have never learned to cherish their own species.\"—Naomi Bliven, The New Yorker",
  "genres": [
    "History",
    "Nonfiction",
    "War",
    "Military History",
    "Military Fiction",
    "World History",
    "Technology"
  ],
  "author": "William H. McNeill",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/99396.The_Pursuit_of_Power"
}