{
  "title": "When the Sleeper Wakes",
  "description": "Websters paperbacks take advantage of the fact that classics are frequently assigned readings in English courses. By using a running English-to-Korean thesaurus at the bottom of each page, this edition of When the Sleeper Wakes by H.G. Wells was edited for three audiences. The first includes Korean-speaking students enrolled in an English Language Program (ELP), an English as a Foreign Language (EFL) program, an English as a Second Language Program (ESL), or in a TOEFL or TOEIC preparation program. The second audience includes English-speaking students enrolled in bilingual education programs or Korean speakers enrolled in English-speaking schools. The third audience consists of students who are actively building their vocabularies in Korean in order to take foreign service, translation certification, Advanced Placement (AP) or similar examinations. By using the Webster's Korean Thesaurus Edition when assigned for an English course, the reader can enrich their vocabulary in anticipation of an examination in Korean or English. TOEFL, TOEIC, AP and Advanced Placement are trademarks of the Educational Testing Service which has neither reviewed nor endorsed this book. All rights reserved. Websters edition of this classic is organized to expose the reader to a maximum number of difficult and potentially ambiguous English words. Rare or idiosyncratic words and expressions are given lower priority compared to difficult, yet commonly used words. Rather than supply a single translation, many words are translated for a variety of meanings in Korean, allowing readers to better grasp the ambiguity of English, and avoid them using the notes as a pure translation crutch. Having the reader decipher awords meaning within context serves to improve vocabulary retention and understanding. Each page covers words not already highlighted on previous pages. If a difficult word",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Classics",
    "Dystopia",
    "19th Century",
    "Time Travel",
    "Fantasy"
  ],
  "author": "H.G. Wells",
  "average_rating": "3.36",
  "url": "https://www.goodreads.com/book/show/9944942-when-the-sleeper-wakes"
}