{
  "title": "Foch: Man of Orleans Vol 1",
  "description": "FOCH THE MAN OF ORLEANS By CAPTAIN B. H. LIDDELL HART With Illustrations BOSTON LITTLE, BROWN, AND COMPANY 1932 Wide World Photot MARSHAL FOCH Copyright, pj, 1932, BY B. H. LIDDBLL HART All rights reserved Published February, 1932 THE ATLANTIC MONTHLY PRESS BOOKS ARE PUBLISHED BY LITTLE, BROWN, AND COMPANY IN ASSOCIATION WITH THE ATLANTIC MONTHLY COMPANY PRINTED IN TUB UNITED STATES or AMERICA To FOUR GOOD FRIENDS E. D. S. E. G. H. F. A. P. F. B. A. FOR GOOD TURNS PREFACE THIS book does not pretend to be an official biography, al though General Weygand has generously helped me in collecting and checking facts, as well as in giving me his impressions on certain issues. The more tribute is due to him because he has not sought in any way to influence my judgment. As he has refrained from imposing any conditions in return for his aid, it is all the more just that I should make it clear that he has no responsibility for the conclusions reached in this book. I realize that these conclusions may impair the popular con ception of Marshal Fochs achievement, if not of his spirit. No one will regret such an effect more than I do. For it has been with reluctance that I have yielded my own original con ception in face of the facts laid bare by research into the history of the war. If I may appear critical, I can only say that I have kept my criticism on a tight rein while giving the facts free rein as true history requires. Such criticisms as I make are implicit in the facts, which cannot be burked. And I have purposely restrained criticism because of a feeling that the indefinable effect of Fochs spirit may have endowed his actions with more effect than the facts convey. It is my strongest hopethat the book will in no sense be regarded as an attack on or exposure of Foch. It certainly brings out his too absorbing devotion to the offensive in the theory and practice of war and the grave conse quences not only to France but to her allies. But, this ques tion apart, the book is really an analysis of the limitations which high command suffered under the conditions of the World War. The effective influence of the higher commander was thwarted by the difficulty not only of knowing the facts of the situation but of knowing them in time to take action which fitted them before they had changed. As for my criticism of the offensive doctrine, it does not viii PREFACE exceed the way Marshal Foch himself castigates that too exclusive passion for the offensive and the useless repulses and cruel losses thereby caused My supplement has merely been to trace Marshal Fochs own influence in fostering that too exclusive passion which caused such useless repulses and cruel losses not only in 1914, but later. CONTENTS PREFACE I Two NAPOLEONS II THE STAMP OF DESTINY HI THE FOUNDATIONS OF A FAITH IV THE PLAYTHINGS OF FATE V THE MISSION AND THE MOULD VI Two REVOLUTIONS VII THE LAUNCHING OF THE WAR VIII THE BLIND COLLISION IX THE MIRACLE OF THE MARNE . . . . X THE WATCHMAN OF YPRES XI DEADLOCK XII GAS XIII BLUNTING THE SWORD OF FRANCE . . . . XIV 1916 THE CREEPING SHADOW XV 1917 IN THE SHADOW XVI THE STORM BREAKS XVII THE TRIALS OF FAITH XVIII THE WORST TRIAL XIX THE TURN OF THE TIDE XX THE ROLLING BALL OR THE EBBING TIDE XXI TouT LE MONDE A LA BATAILLE . . . XXII THE TRIUMPH OF THE VOCAL WILL . . . . XXIII THE CLUTCH ON THE RHINE XXIV THE REFLEXIVE YEARS EPILOGUE BIBLIOGRAPHY INDEX vn 3 13 23 33 4 5067 75 100 122 148 170 179 207 234 263 292 313 330 340 363 39 407 4 28 448 459 465 ILLUSTRATIONS MARSHAL FOCH Frontispiece FOCHS BIRTHPLACE IN TARBES 6 THE Two FRIENDS GENERALS FOCH AND WILSON . 52 AN ALLIED CONFERENCE IN FRANCE . . . .186 FocH ON THE FIELD 278 A CONFERENCE OF THE ALLIES 346 FOCH IN THE RAILWAY COACH AT THE SIGNING OF THE ARMISTICE 402 BATTLE FLAGS BEING ACCEPTED BY FOCH FOR PRES ERVATION IN THE HOTEL DBS INVALIDES . . . 440 MAPS THE FRENCH AND GERMAN PLANS, AUGUST 1914 . 71 THE BATTLE OF MORHANGE, AUGUST 20, 1914 . ...",
  "genres": [],
  "author": "B.H. Liddell Hart",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/9948500-foch"
}