{
  "title": "The Infinite Atonement",
  "description": "\"Some things simply matter more than others,\" writes Robert L. Millet in his foreword to this landmark book. \"Even some doctrines, though interesting and fun to discuss, must take a backseat to more fundamental and foundational doctrines. It is just so with the Atonement of Jesus Christ. The Atonement is the central act of human history, the pivotal point in all time, the doctrine of doctrines.\"With The Infinite Atonement, Brother Tad R. Callister offers us what may be the most comprehensive, yet understandable, treatment of the Atonement in our day. He thoughtfully probes the infinite scope of this \"great and last sacrifice,\" describing its power and breadth and explaining how it redeems us all.Using the scriptures and the words of the prophets, Brother Callister explores the Savior's divinity and the depth of his love for mankind. He explains the blessings that flow from the Atonement, providing insight into the resurrection, repentance, and the gifts of peace, motivation, freedom, grace, and exaltation. He explains the relationship of justice and mercy and the importance of ordinances. Through discussing the effects of the fall of Adam and our individual sins, he reminds us in a powerful way of the incalculable debt of gratitude we owe Christ for his unparalleled offering.\"An attempt to master this doctrine requires an immersion of all our senses, all our feelings, and all our intellect,\" Brother Callister writes. \"Given the opportunity, the Atonement will invade each of the human passions and faculties.... The Atonement is not a doctrine that lends itself to some singular approach, like a universal formula. It must be felt, not just 'figured'; internalized, not just analyzed.... The Atonement of Jesus Christ is the most supernal, mind-expanding, passionate doctrine this world or universe will ever know.\"With clarity, testimony, and understanding, The Infinite Atonement teaches us rich and wonderful truths about this \"doctrine of doctrines,\" and elevates our spirits as we contemplate the perfect love of Him who gave all that we might receive all.",
  "genres": [
    "Religion",
    "Lds",
    "Nonfiction",
    "Church",
    "Spirituality",
    "Inspirational",
    "Christian"
  ],
  "author": "Tad R. Callister",
  "average_rating": "4.64",
  "url": "https://www.goodreads.com/book/show/9948.The_Infinite_Atonement"
}