{
  "title": "The Mystery of Tally-Ho Cottage",
  "description": "The first of twenty-eight books in Blyton's Old Thatch series, The Talking Teapot and Other Tales, was published in 1934, the same year as Brer Rabbit Retold; (note that Brer Rabbit originally featured in Uncle Remus stories by Joel Chandler Harris), her first serial story and first full-length book, Adventures of the Wishing-Chair, followed in 1937. The Enchanted Wood, the first book in the Faraway Tree series, published in 1939, is about a magic tree inspired by the Norse mythology that had fascinated Blyton as a child. According to Blyton's daughter Gillian the inspiration for the magic tree came from \"thinking up a story one day and suddenly she was walking in the enchanted wood and found the tree. In her imagination she climbed up through the branches and met Moon-Face, Silky, the Saucepan Man and the rest of the characters. She had all she needed.\" As in the Wishing-Chair series, these fantasy books typically involve children being transported into a magical world in which they meet fairies, goblins, elves, pixies and other mythological creatures. Blyton's first full-length adventure novel, The Secret Island, was published in 1938, featuring the characters of Jack, Mike, Peggy and Nora. Described by The Glasgow Herald as a \"Robinson Crusoe-style adventure on an island in an English lake\", The Secret Island was a lifelong favourite of Gillian's and spawned the Secret series. The following year Blyton released her first book in the Circus series and her initial book in the Amelia Jane series, Naughty Amelia Jane! According to Gillian the main character was based on a large handmade doll given to her by her mother on her third birthday. During the 1940s Blyton became a prolific author, her success enhanced by her \"marketing, publicity and branding that was far ahead of its time\". In 1940 Blyton published two books – Three Boys and a Circus and Children of Kidillin – under the pseudonym of Mary Pollock (middle name plus first married name), in addition to the eleven published under her own name that year. So popular were Pollock's books that one reviewer was prompted to observe that \"Enid Blyton had better look to her laurels\". But Blyton's readers were not so easily deceived and many complained about the subterfuge to her and her publisher, with the result that all six books published under the name of Mary Pollock – two in 1940 and four in 1943 – were reissued under Blyton's name. Later in 1940 Blyton published the first of her boarding school story books and the first novel in the Naughtiest Girl series, The Naughtiest Girl in the School, which followed the exploits of the mischievous schoolgirl Elizabeth Allen at the fictional Whyteleafe School. The first of her six novels in the St. Clare's series, The Twins at St. Clare's, appeared the following year, featuring the twin sisters Patricia and Isabel O'Sullivan.",
  "genres": [
    "Mystery",
    "Childrens",
    "Fiction",
    "Adventure",
    "Middle Grade",
    "Classics",
    "Young Adult"
  ],
  "author": "Enid Blyton",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/994241.The_Mystery_of_Tally_Ho_Cottage"
}