{
  "title": "Pressure Drop",
  "description": "Now acknowledged as perhaps the strongest of the new generation of thriller writers, Peter Abraham’s has found a striking new arena for action, adventure and suspense in the world of underwater diving: those mysterious caverns known as “blue holes” in the Bahamas.The only thing Nina Kitchener misses in her life is a family. She has a great PR career, a best friend, a good life, but a lot of failed relationships with men and...a biological clock that is clanging away. Resolved to listen to it, she decides to have a baby on her own by artificial insemination and, following the advice of a reputable doctor, visits the distinguished but mysterious Human Fertility Institute. Eventually, Nina gives birth to a healthy, beautiful baby boy, but before she can even name him he is kidnapped from the nursery.Helpless and alone, faced with an indifferent police bureaucracy, Nina becomes convinced that to find her baby she must discover the identity of the sperm donor. When she returns to the Institute, it has closed down. Desperate, she finds herself on the track of the wealthy family who funded it, in a world totally foreign to her, the Bahamas. There she meets the great diver, the maverick Matthias, a man unlike any she has known, with his own reasons for dredging this mystery from the deep.A story of two people from different worlds, working towards different ends, who together turn up a world of horrors in the deep, resonating in the wartime mysteries of Nazi survivors, a fatal dive that has ruined Matthias, and a strange world of Bahamian aristocrats whose stunning past can still compel the future. Coming together as strangers—believing romance to be history—they will find themselves in a profoundly satisfying and grown-up love affair.“A good thriller needs style, atmosphere and a surprising plot,” said The New York Times Book Review of Abraham’s last book, “and Hard Rain... has all of these and something extra: depth of feeling.” Powerfully novelistic, plotted with riveting suspense, Abraham’s new thriller has thrust his work up a whole new notch in craft, providing us with the ultimate story of jeopardy.",
  "genres": [
    "Mystery",
    "Thriller",
    "Fiction",
    "Suspense",
    "Crime",
    "Mystery Thriller",
    "American"
  ],
  "author": "Peter Abrahams",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/994627.Pressure_Drop"
}