{
  "title": "Fur, Fortune, and Empire: The Epic History of the Fur Trade in America",
  "description": "From the best-selling author of Leviathan comes this sweeping narrative of one of America's most historically rich industries.\nAs Henry Hudson sailed up the broad river that would one day bear his name, he grew concerned that his Dutch patrons would be disappointed in his failure to find the fabled route to the Orient. What became immediately apparent, however, from the Indians clad in deer skins and \"good furs\" was that Hudson had discovered something just as tantalizing.The news of Hudson's 1609 voyage to America ignited a fierce competition to lay claim to this uncharted continent, teeming with untapped natural resources. The result was the creation of an American fur trade, which fostered economic rivalries and fueled wars among the European powers, and later between the United States and Great Britain, as North America became a battleground for colonization and imperial aspirations. In Fur, Fortune, and Empire, best-selling author Eric Jay Dolin chronicles the rise and fall of the fur trade of old, when the rallying cry was \"get the furs while they last.\" Beavers, sea otters, and buffalos were slaughtered, used for their precious pelts that were tailored into extravagant hats, coats, and sleigh blankets. To read Fur, Fortune, and Empire then is to understand how North America was explored, exploited, and settled, while its native Indians were alternately enriched and exploited by the trade. As Dolin demonstrates, fur, both an economic elixir and an agent of destruction, became inextricably linked to many key events in American history, including the French and Indian War, the American Revolution, and the War of 1812, as well as to the relentless pull of Manifest Destiny and the opening of the West.This work provides an international cast beyond the scope of any Hollywood epic, including Thomas Morton, the rabble-rouser who infuriated the Pilgrims by trading guns with the Indians; British explorer Captain James Cook, whose discovery in the Pacific Northwest helped launch America's China trade; Thomas Jefferson who dreamed of expanding the fur trade beyond the Mississippi; America's first multimillionaire John Jacob Astor, who built a fortune on a foundation of fur; and intrepid mountain men such as Kit Carson and Jedediah Smith, who sliced their way through an awe inspiring and unforgiving landscape, leaving behind a mythic legacy still resonates today. Concluding with the virtual extinction of the buffalo in the late 1800s, Fur, Fortune, and Empire is an epic history that brings to vivid life three hundred years of the American experience, conclusively demonstrating that the fur trade played a seminal role in creating the nation we are today.",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Audiobook",
    "Economics",
    "American",
    "Business"
  ],
  "author": "Eric Jay Dolin",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/9942145-fur-fortune-and-empire"
}