{
  "title": "Taming the Golden Boys of Central High",
  "description": "Word 34k 15-year old bad girl senior Nevada Tate is transferred to her new school when on the first day of school she meets the bullies of Central High. Unfortunate for them Nevada Tate just isn't your average newbie dweeb; she's the bully's bully. Who's bullying who? And what happens when the bully falls for the victim? Growing up can be hazardous to your health. Nevada Tate wasn’t trying to be bad on purpose; it just happened that way. She was the epiphany of Nerd Central; she was a genius who lacked social skills and it didn’t help that she was always the new kid in school and that she had skipped two grade levels. Face it, being 15 years old, brand new to a school and a senior was like having “beat me” tattooed on her forehead. Zai Robinson wasn’t trying to be the most popular boy in school. As a matter of fact he didn’t even like the attention; but what could he do—rich, a natural athlete with good looks; oh yea and he had the fast car to go with it. Who else could he date except the most popular and the cutest girl in school; of course that was Jennifer Ashley Taylor; oooh what a cliché name. So why didn’t this formula work like clockwork? Maybe because it comes a time in every teenager’s life when they have to accept they must live their own life and stop worrying about trying to fit in and be what’s expected of them. So how do you negotiate growing up into being your own person while trying to balance damage control of your reputation and popularity? You do it day by day; one decision at a time until you’ve grown up. The problem when do you know you’ve grown up? Volume 3 The College Years Taming The Golden Boys of Central Volume I You watched them fight as enemies and begin to like each other as friends... Taming The Golden Boys of Central Summer of My First Time Volume II You followed along as they learned about friendship, love, jealous and betrayal... Diary of a Teen The College Life; Vol 3 Now find out if love really does conquer all. NEVADA POV One would think that after living 15 years as a virtual loner that the transition back to a loner would be a piece of cake. Gotta tell you I was surprised when I suddenly found myself lost, confused and alone on the big opened wide campus of MIT my first year. Here’s one of my fav stats about (I am so a geek); out of 16,632 freshman applications submitted; a mere 1,676 applicants were accepted. Yea, that’s some stiff competition and challenge; made me feel a little gitty that I passed the challenge especially for a 16 soon to be 17 year old. Which also brings me to the down side of being 16 years old living in the world of young adults; it gets even lonelier at the top. ZAI POV Life at Northwestern in Evanston was almost like life at Central High; except it was bigger. It was pretty much life as usual. I still couldn’t reach Nevada or hadn’t heard from her in over five weeks. On the weekends I had been driving back to our hometown, but to no avail. Daisy either was never home or she didn’t answer the door or the phone; there was no way of contacting her. Finally I had Jeda to call Rain. “What did she say?” I asked him as we sat in our dorm room. “She hasn’t heard from Nevada and she can’t reach Daisy either.” Jeda said as he sat at the desk working on a school paper. “Penelope? Does she have a number or an address?” Luis asked hopeful. Seriously we all looked at him and rolled our eyes. LUIS POV What can I say; if you’ve been to one high school party you’ve been to any college rush party.",
  "genres": [],
  "author": "Alm Hlgh",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/9946593-taming-the-golden-boys-of-central-high"
}