{
  "title": "The Lost Girls: Three Friends. Four Continents. One Unconventional Detour Around the World.",
  "description": "Jen, Holly, and Amanda are at a crossroads. They're feeling the pressure to hit certain milestones--scoring a big promotion, finding a soul mate, having 2.2 kids--before they reach their early thirties. When personal challenges force them to reevaluate their lives, they decide it's now or never to do something daring. Unable to gain perspective in fast-paced Manhattan, the three twenty-somethings quit their coveted media jobs and leave behind their friends, boyfriends, and everything familiar to travel the globe. Dubbing themselves the Lost Girls, they embark on an epic yearlong search for inspiration and direction. As they journey 60,000 miles across four continents and more than a dozen countries, Jen, Holly, and Amanda step far outside of their comfort zones, embracing every adventure and experience the world has to offer--shooting blowguns with Yagua elders in the Amazon, learning capoeira on the beaches of Brazil, volunteering with preteen girls at a school in rural Kenya, hiking with Hmong villagers in Vietnam, and driving through Australia in a psychedelic camper van. Along the way, the Lost Girls find not only themselves but also a lifelong friendship. Ultimately, theirs is a story of true sisterhood--a bond forged by sharing beds and backpacks, enduring exotic illnesses, fending off aggressive street vendors, trekking across rivers and over mountains, and standing by one another through heartaches, whirlwind romances, and everything in the world in between. This candid and compelling memoir will speak to anyone who has ever felt the desire to spread her wings and discover the world with her best friends by her side.",
  "genres": [
    "Travel",
    "Nonfiction",
    "Memoir",
    "Biography",
    "Chick Lit",
    "Adventure",
    "Book Club"
  ],
  "author": "Jennifer Baggett",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/9947309-the-lost-girls"
}