{
  "title": "Snow Crystals",
  "description": "\"Offers valuable material not only to students of crystallography but also to those of the arts.\" — The New York TimesDid you ever try to photograph a snowflake? The procedure is very tricky. The work must be done rapidly in extreme cold, for even body heat can melt a rare specimen that has been painstakingly mounted. The lighting must be just right to reveal all the nuances of design without producing heat. But the results can be rewarding, as the work of W. A. Bentley proved.For almost half a century, Bentley caught and photographed thousands of snowflakes in his workshop at Jericho, Vermont, and made available to scientists and art instructors samples of his remarkable work. In 1931, the American Meteorological Society gathered together the best of these photomicrographs, plus some slides of frost, glaze, dew on vegetation and spider webs, sleet, and soft hail, and a text by W. J. Humphreys, and had them published. That book is here reproduced, unaltered, and unabridged. Over 2,000 beautiful crystals on these pages reveal the wonder of nature's diversity in uniformity; no two are alike, yet all are based on a common hexagon.The introductory text covers the technique of photographing snow crystals, classification, the fundamentals of crystallography, and markings. There are also brief discussions of the nature and cause of ice flowers, windowpane frost, dew, rime, sleet, and graupel.The book is of great value both to students of ice forms and for textile and other designers who can use the natural designs of these snow crystals in their work. Every photograph is royalty-free; you may use up to 10 without fees, permission, or acknowledgement.\"A most unusual and very readable book.\" — Nature",
  "genres": [
    "Nonfiction",
    "Science",
    "Photography",
    "Art",
    "Nature",
    "Reference"
  ],
  "author": "Wilson A. Bentley",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/994292.Snow_Crystals"
}