{
  "title": "Outies",
  "description": "Outies is an authorized sequel to The Mote in God's Eye and The Gripping Hand by best-selling SF duo Larry Niven and Jerry Pournelle. With a fresh point of view, deep continuity, and page-turning plot twists, J.R. (Jennifer) Pournelle brings a mature generation of Moties to life for a mature generation of readers. Outies introduces new characters, adds depth to beloved old ones, creates a rich, imaginable world, and gives clear voices to aliens and outsiders.In a return to the CoDominium universe of the Second Empire of Man, Outies pauses at the fringes of human space, on an outworld that never knew fossil fuels. New Utah instead pushed crude solar technologies to the limits of everyday utility. But a planet is a big place - and it's time for the New Utahns to meet the neighbors. Blending hard science and social science, Outies explores complexities of biology, geology, and ecology at the heart of alien Motie society and evolution. While military science fiction in a sense, that sense is very much of the wars of our time. Outies plunges through the confusion, chaos, factionalism, and unpredictability of low intensity conflict with realism, but largely through civilian eyes. In a twist on traditional space opera, it introduces Asach Quinn - a wily, thoughtful, genderless, and diplomatic foil to reckless pilot Kevin Renner. Leaving the aristocratic manors of Sparta, Quinn burrows deep inside the heads of members of the Church of Him - who believe that the red dwarf visible twinkling through the Coal Sack Nebula is literally the Eye of God. Pournelle - an ex-Army intelligence officer turned anthropologist - provides New Utah and its characters with a rich sense of place and deep motivations; hints at what may become, over the next millenium, of Mormons, moties, and Earth islanders displaced by sea level rise - and even masters some Tok Pisin along the way.At nearly 110,000 words (about 400 print pages), the book is packed with additional material designed to allow the reader to explore New Utah in as much depth as desired. For those new to (or needing a refresher on) the Mote series, a detailed chronology lists key events over the five centuries preceding Outies. The cast of characters is organized by role and location, providing hints of relationships that unwind over the course of the novel. A map lays out the continental-scale environs in which the story is set. An appendix provides a guide to acronyms, details of religious history and organization, an explanation of alien accounting systems, and evolutionary biology. There is even an original musical score, composed by music theorist J. Daniel Jenkins.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Science Fiction Fantasy",
    "Aliens",
    "Audiobook"
  ],
  "author": "Jennifer R. Pournelle",
  "average_rating": "3.47",
  "url": "https://www.goodreads.com/book/show/9942308-outies"
}