{
  "title": "A Snowflake in My Hand",
  "description": "A miracle of a book--a joyous celebration of the unspoken but deeply felt bond between animals and people and, in Roger Caras's words, \"a celebration of life in the face of death\".Each day holds the promise of a few new faces, a hundred possibilities, and perhaps one miracle. In a book that reflects her years of work at New York City’s famous Animal Medical Center, Samantha Mooney creates a miracle of her own—the unforgettable story of dedicated professionals who, faced with sometimes incurable illness among the animals they care for, nevertheless find companionships and laughter in that caring. But above all, this is a story of Clancy, a tiger-suited Irish rogue who refuses to be caged; gentle Oliver Cromwell, who summers in Maine and makes friends with his own personal sea gull; and one tiny black cat, Fledermaus, who breaks through Samantha’s own wall of frozen grief after her father’s death and shows her the rewards, and the risks, of loving again. Praise for A Snowflake in My Hand“This book is not only for cat lovers, it is for lovers of life.” — The Washington Post “She displays an empathy with animals akin to that evident in the works of James Herriot.” — The New York Times Book Review “Heartrending for cat lovers.” — Kirkus Reviews“An affair of the heart and a celebration of life in the face of death . . . a very special story.” —Roger Caras “In telling the story of the cats she has served far beyond the call of duty, Samantha Mooney is really telling us how to face the ordeal of serious, sometimes terminal illnesses with humor, patience, and courage. . . . This large-spirited little book reaches out to us all.” —Budd Schulberg “A very compelling book that’s difficult to put down.” — The Seattle Times “Beautifully written . . . one of the outstanding books of the year. Don’t miss it.” — The Chattanooga Times “The Inside story of the most famous clinics in the world, beautifully told, with warmth and compassion.” —Cleveland Amory",
  "genres": [
    "Cats",
    "Animals",
    "Nonfiction",
    "Memoir"
  ],
  "author": "Samantha Mooney",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/994293.A_Snowflake_in_My_Hand"
}