{
  "title": "A Good Hard Look",
  "description": "Heartbreakingly beautiful and inescapably human, ordinary and extraordinary people chart their own courses in life. In the aftermath of one tragic afternoon, they are all forced to look at themselves and face up to the observation that the truth does not change according to our ability to stomach it.Crippled by lupus at twenty-five, celebrated author Flannery O'Connor was forced to leave New York City and return home to Andalusia, her family farm in Milledgeville, Georgia. Years later, as Flannery is finishing a novel and tending to her menagerie of peacocks, her mother drags her to the wedding of a family friend. Cookie Himmel embodies every facet of Southern womanhood that Flannery lacks: she is revered for her beauty and grace; she is at the helm of every ladies' organization in town; and she has returned from her time in Manhattan with a rich fiancé, Melvin Whiteson. Melvin has come to Milledgeville to begin a new chapter in his life, but it is not until he meets Flannery that he starts to take a good hard look at the choices he has made. Despite the limitations of her disease, Flannery seems to be more alive than other people, and Melvin is drawn to her like a moth to a candle flame. Melvin is not the only person in Milledgeville who starts to feel that life is passing him by. Lona Waters, the dutiful wife of a local policeman, is hired by Cookie to help create a perfect home. As Lona spends her days sewing curtains, she is given an opportunity to remember what it feels like to be truly alive, and she seizes it with both hands. Heartbreakingly beautiful and inescapably human, these ordinary and extraordinary people chart their own courses through life. In the aftermath of one tragic afternoon, they are all forced to look at themselves and face up to Flannery's observation that \"the truth does not change according to our ability to stomach it.\"",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Book Club",
    "Southern",
    "Literary Fiction",
    "Historical",
    "Contemporary"
  ],
  "author": "Ann Napolitano",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/9949524-a-good-hard-look"
}