{
  "title": "Venice Vampyr",
  "description": "Early 1800s - Venice Italy - Isabella Tenderini, a wealthy merchant's widow rescues a stranger from drowning in one of Venice's canals. And how does the man repay her selfless act? By kissing her - her, a respectable woman.Not only is Raphael di Santori grateful for his life being saved, he would also like to thank his rescuer very intimately - more intimately than decorum allows. But then, Raphael has never been one to play by the rules - as a vampire he doesn't have to. This vampire novella is sexually more explicit than my other books. So, if you're a little squeamish about things like voyeurism and other sexual taboos, it's safe to assume you won't like this one.Novella 139 pages / 31,000 words Every chapter is illustrated with a photo from Venice from the author's private collection.NookColor giveaway coming to Tina Folsom's blog on December 26, 2010. --- Raphael di Santori never thought he’d lose his life by drowning. A stake through the heart, maybe, or burnt to ash by the sun – but never drowning. Not that it wasn’t something many vampires their cells, after all, were so dense and solid that as a result their bodies were much heavier than water and therefore sank instantly.That was exactly what had happened to him. One minute he’d been wandering along the canal. Now he was enfolded in its icy cold depths. He could paddle and splash all he wanted, but his weight pulled him under the water without regard for his efforts. All his strength worked against him.There was nothing to hold onto. The canal was lined with Venetian homes without ledges or docks, without the entry doors on the water level – mainly used for deliveries – that were customary at the larger merchants’ homes. The homes that bordered this narrow, insignificant, yet deep canal in the labyrinth of Venice didn’t have this luxury. Their inhabitants entered from the streets above, streets he’d walked earlier.The noise of the carnival’s revelers drifted to him, numbed by the water in his ears. Even if he screamed, they wouldn’t hear him. They were too drunk to take any notice. It was one of the reasons he’d been prowling the streets despite the large number of people out. In a drunken crowd, there were more than a few morsels that would turn into prey, more than a few juicy necks he could feast on without being discovered.All year he’d been careful, never feeding when the streets were busy, always making sure his victims wouldn’t remember what had happened. Only during carnival, when masks were the ultimate accessory to any gown, did he gorge himself on the plentiful buffet of humans.Had he been careless this time? Had somebody seen him? Why else had he felt a hand on his back, pushing him into the canal? Merely an accident by a drunken passer-by or a deliberate act by someone who knew what he was? Had the Guardians of the Holy Waters finally caught up with him?Had the hand that he’d briefly felt on his back belonged to one of the elusive Guardians? Had one of them pushed him, knowing he’d drown? And what did it matter now? In a few minutes, he would be dead, his immortal life over. He would rot on the bottom of the canal, his body never rising to the surface even as it decomposed, the denseness of his cells and bones making sure nothing of his being would ever come to light.Raphael reflected on his long life, a life longer than any human could have wished for. He was leaving his brother Dante behind. But there was no woman who loved him and would cry a tear for him. His life was empty. With a last breath, he gave up his struggle and allowed the water to take him.***Tina Folsom has written 10 romances about hot vampires and other alpha heroes and the strong and sassy women who bring them to their knees. If not writing, you can find her reading her favorite authors (Sherrilyn Kenyon, J.R. Ward, and too many others to mention), or making her famous Tiramisu (with lots of Amaretto), or watching True Blood, or reruns of Buffy and 'Allo 'Allo.",
  "genres": [
    "Vampires",
    "Romance",
    "Paranormal",
    "Paranormal Romance",
    "Erotica",
    "Historical Romance",
    "Historical"
  ],
  "author": "Tina Folsom",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/9969890-venice-vampyr"
}