{
  "title": "My Enemy, My Beloved",
  "description": "On the day following the historic breakthrough of the American army into Aachen, Germany, sixteen-year-old Elsa Sommer drove into New Ulm, Minnesota, from her father s farm to keep a dentist appointment. A cavity had cost her a night s sleep. Elsa had been farm reared and toughened by weather and labor. Even so, throughout her youth, and by following the example of her parents, she had acquired a belief in God as strong as faith could make it. She thought often about the boys in uniform, innocents caught up in a maelstrom of horror. War news always saddened her, and for that reason it was seldom discussed at the dinner table. Many of the folks in New Ulm were of German extraction, immigrants mostly. Some had arrived in America just before Europe had been swept up in Hitler s fiendish hand. Scores of residents had relatives in Germany, and many harbored strong memories of their homeland. Some looked upon the war with a split allegiance. But although their minds still retained visions of the Fatherland, their hearts prayed for the American boys who had breached the Siegfried Line and were now fighting on German soil. The war had taken away the best of them, and hearts were heavy. Most everyone in town knew of someone in the service. As if to augment the news from Europe, work had been ongoing for some time at the abandoned CCC camp south of the city. Those who kept tabs on such things indicated that it would soon become a prisoner-of-war camp to house a contingent of Germans coming up from Algona, Iowa. Brown County was short of labor, and manpower was needed to keep the factories running at full output. Despite their Germanic ties, many in New Ulm disliked the prospect of having young enemy soldiers living in such close proximity with them. Unfortunately, they had no choice but to go along with the government decree . . .",
  "genres": [
    "Historical Fiction",
    "Fiction"
  ],
  "author": "Karl Vanghen",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/9968334-my-enemy-my-beloved"
}