{
  "title": "The Death of King Arthur",
  "description": "The Alliterative Morte Athure - the title given to a four-thousand line poem written sometime around 1400 - was part of a medieval Arthurian revival which produced such masterpieces as Sir Gawain and the Green Knight and Sir Thomas Malory's prose Morte D'Arthur.Like Sir Gawain and the Green Knight, the Alliterative Morte Arthure survives in a unique manuscript by an anonymous author, and is written in a measure which harked back to Anglo-Saxon poetic composition. Unlike Gawin, whose plot hinges around one moment of jaw-dropping magic, The Death of King Arthur deals in the cut-and-thrust of warfare and politics: the ever-topical matter of Britain's relationship with continental Europe, and of its military interests overseas.The outcome is announced in the poem's title, and from their stronghold in Carlisle, Arthur and his army embark on a campaign which takes them almost to the gates of Rome, before he is forced to turn back to deal with matters closer to home. But along the way there are as many challenges for the translator of this poetic romance as are faced by its protagonist - not least how to manage the alliterative line while doing justice to the mass of riotous life which courses through the narrative's veins: channel crossings, battle formations, naval engagements, rearguard actions and forays; but also courtly protocols, partings, swoonings, and dream sequences remarkable for their private glimpses into the mind of the once and future king.A new kind of actuality is present in The Death of King Arthur, whose chivalric code cannot gloss over the carnage and horror of war, or the flaws of a king who is as much a human being as a figurehead. Simon Armitage is already the master of this alliterative music, as his earlier version of Sir Gawain and the Green Knight (2007) so craftily showed.",
  "genres": [
    "Poetry",
    "Arthurian",
    "Classics",
    "Medieval",
    "Historical Fiction",
    "Mythology",
    "Fiction"
  ],
  "author": "Unknown",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/13245528-the-death-of-king-arthur"
}