{
  "title": "The Gardens of Kyoto",
  "description": "Exceeding the promise of her New York Times Notable Book debut, Kate Walbert brings her prizewinning \"painter's eye and poet's voice\" (The Hartford Courant) to a mesmerizing story of war, romance, and grief. I had a cousin, Randall, killed on Iwo Jima. Have I told you?So begins Kate Walbert's beautiful and heart-breaking novel about a young woman, Ellen, coming of age in the long shadow of World War II. Forty years later she relates the events of this period, beginning with the death of her favorite cousin, Randall, with whom she had shared Easter Sundays, secrets, and, perhaps, love. In an isolated, aging Maryland farmhouse that once was a stop on the Underground Railroad, Randall had grown up among ghosts: his father, Sterling, present only in body; his mother, dead at a young age; and the apparitions of a slave family. When Ellen receives a package after Randall's death, containing his diary and a book called The Gardens of Kyoto, her bond to him is cemented, and the mysteries of his short life start to unravel.The narrative moves back and forth between Randall's death in 1945 and the autumn six years later, when Ellen meets Lieutenant Henry Rock at a college football game on the eve of his departure for Korea. But it soon becomes apparent that Ellen's memory may be distorting reality, altered as it is by a mix of imagination and disappointment, and that the truth about Randall and Henry -- and others -- may be hidden. With lyrical, seductive prose, Walbert spins several parallel stories of the emotional damage done by war. Like the mysterious arrangements of the intricate sand, rock, and gravel gardens of Kyoto, they gracefully assemble into a single, rich mosaic.Based on a Pushcart and O. Henry Prize-winning story, this masterful first novel establishes Walbert as a writer of astonishing elegance and power.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Japan",
    "Book Club",
    "World War II",
    "Historical",
    "Novels"
  ],
  "author": "Kate Walbert",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/99654.The_Gardens_of_Kyoto"
}