{
  "title": "Wild Girls: Paris, Sappho, and Art: The Lives and Loves of Natalie Barney and Romaine Brooks",
  "description": "The writer Natalie Barney and the artist Romaine Brooks were rich, American, eccentric, and grandly lesbian. They met in Paris in 1915, and their relationship lasted more than fifty years despite infidelity, separation, and temperamental differences.Told by Diana Souhami, the critically acclaimed author of Mrs. Keppel and Her Daughter, Wild Girls is the story of two audacious women and the world they inhabited.Natalie Barney believed that living was \"the first of all arts.\" She published memoirs and collections of poems and aphorisms, but her passion was for seduction and love. She liked lavish displays, lots of sex, and love unbounded by rules. At her Friday afternoon salons, in the Grecian Temple of Friendship in the garden of her Paris home, \"one met lesbians.\" Lovers and friends circled the Amazon, as she was called. She aspired to make her temple the Sapphic center of the western world.Romaine Brooks's prime interests, on the other hand, were herself and her painting. She produced many self-portraits and portraits of her own and Natalie's lovers and friends. She endured an unhappy childhood and a fraught relationship with her mother. She trusted no one but Natalie.Natalie and Romaine are at the center of this \"Sapphic Idyll.\" Included, too, are their lovers and friends before and after they met: Liane de Pougy, the exquisite courtesan and lover of princes; Renee Vivien, poet of melancholy and death, who died of anorexia at age thirty-two; Dolly Wilde, niece of Oscar, who ran up huge bills and died of a drug overdose; the prima ballerina Ida Rubinstein; the writer Gabriele D'Annunzio - and many others.Natalie's salon, attended by Gertrude Stein, and Colette and Edith Sitwell, was a magnet for social introductions and cultural innovations. Drawing from letters, papers, and paintings, Diana Souhami re-creates the lives and loves of this pair of dazzling and wild women.",
  "genres": [
    "Biography",
    "Nonfiction",
    "History",
    "LGBT",
    "Queer",
    "Art",
    "Lesbian"
  ],
  "author": "Diana Souhami",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/996310.Wild_Girls"
}