{
  "title": "Easter Island",
  "description": "Join two intrepid young women as they delve into the centuries-old mysteries of Easter Island. Slowly unearthing the island's haunting past, they are forced to confront turbulent discoveries about themselves and the people they love, changing their lives forever.In this extraordinary fiction debut—rich with love and betrayal, history and intellectual passion—two remarkable narratives converge on Easter Island, one of the most remote places in the world.It is 1913. Elsa Pendleton travels from England to Easter Island with her husband, an anthropologist sent by the Royal Geographical Society to study the colossal moai statues, and her younger sister. What begins as familial duty for Elsa becomes a grand adventure; on Easter Island she discovers her true calling. But, out of contact with the outside world, she is unaware that World War I has been declared and that a German naval squadron, fleeing the British across the South Pacific, is heading toward the island she now considers home.Sixty years later, Dr. Greer Farraday, an American botanist, travels to Easter Island to research the island's ancient pollen, but more important, to put back the pieces of her life after the death of her husband.A series of brilliant revelations brings to life the parallel quests of these two intrepid young women as they delve into the centuries-old mysteries of Easter Island. Slowly unearthing the island's haunting past, they are forced to confront turbulent discoveries about themselves and the people they love, changing their lives forever.Easter Island is a tour de force of storytelling that will establish Jennifer Vanderbes as one of the most gifted writers of her generation.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Book Club",
    "Travel",
    "Historical",
    "Mystery",
    "Anthropology"
  ],
  "author": "Jennifer Vanderbes",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/99686.Easter_Island"
}