{
  "title": "Romantic Vignettes: The Anthology of Premiere Novellas",
  "description": "A collection of the first novellas ever written by popular romance novelist, Marcia Lynn McClure!The Unobtainable OneTHE CHILD WAS STRAWBERRY-SWEET AND LOVING…BUT THE MAN WAS FORBIDDEN FRUIT.Annette Jordan had accepted the unavoidable reality that she must toil as a governess to provide for herself. Thankfully, her charge was a joy—a vision of youthful beauty, owning a spirit of delight.But it was Annette’s employer, Lord Gareth Barrett, who proved to be the trial—for she soon found herself living in the all-too-cliché governess’s dream of having fallen desperately in love with the man who provided her wages.The child loved her, but could she endure watching hopelessly as the beautiful woman from a neighboring property won Lord Barrett’s affections?The General’s AmbitionSHE HAD BEEN SELECTED TO MARRYAND BEAR THE PROGENY OF THE SON…Seemingly overnight, Renee Millings found herself orphaned and married to the indescribably handsome but ever-frowning Roque Montan. His father, the General, was obsessively determined that his lineage would continue posthaste—with or without consent of his son’s new bride.But when Roque reveals the existence of a sworn oath that will obstruct his father’s ambition, will the villainous General conspire to ensure the future of his coveted progeny to be borne by Renee himself? Will Renee find the only means of escape from the odious General to be that of his late wife—death? Or will the son find no tolerance for his father’s diabolic plotting concerning the woman Roque legally terms his wife?Indebted DeliveranceSNOWBOUND AND ISOLATED, SHE HAD NO ALTERNATIVE BUT TO ENDURE THE WINTER IN THE COMPANIONSHIP OF THE BRUTAL RACE TREVELIAN…Chalyce LaSalle had been grateful to the handsome recluse, Race Trevelian, when he had delivered her from certain tragedy one frigid winter day. He was addictively attractive, powerful, and intriguing, and there was something else about him—an air of secreted internal torture. Yet as the brutal character of her emancipator began to manifest, Chalyce commenced in wondering whether the fate she now faced would be any less insufferable than the one from which he had delivered her.Still, his very essence beckoned hers. She was drawn to him, and her soul whispered that his mind needed deliverance as desperately as she had needed rescue that cold, winter’s noon.",
  "genres": [
    "Romance",
    "Clean Romance",
    "Historical Romance",
    "Historical",
    "Novella",
    "Historical Fiction",
    "Regency"
  ],
  "author": "Marcia Lynn McClure",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/9971062-romantic-vignettes"
}