{
  "title": "Aliénor d'Aquitaine",
  "description": "La chronique scandaleuse s'est emparée très tôt du personnage d'Aliénor d'Aquitaine; très tôt, puisque au XIIIe siècle déjà le facétieux Ménestrel de Reims lui attribuait des aventures avec Saladin! Les Français ne lui auraient-ils pas gardé rancune d'avoir abandonné la couronne dé France pour celle d'Angleterre ? Quoi qu'il en soit, la réputation fâcheuse qu'on lui a faite aura marqué, pour la postérité, une personnalité féminine hoirs, pair, dont l'existence aura eu pour cadre non seulement l'Occident européen de l'Aquitaine à la Saxe et à la Sicile, mais le Proche-Orient avec Antioche et Constantinople. Avec le recul de l'histoire, et à la lumière des textes de son, -temps, la personne et l'action d'Aliénor d'Aquitaine prennent un relief étonnant. A travers elles s'opère la fusion entre le Nordet le Midi, entre la poésie des troubadours et la magie des vieux -. contes celtiques ; on peut dire que, sans Aliénor, la civilisation occidentale - celle dé l'amour courtois, des romans de chevalerie, de Tristan et Iseult - n'eût pas été ce qu'elle fut. Or, cette femme lettrée s'est aussi révélée, à l'occasion; une tête politique : deux fois reine, mère de deux rois, on pourrait lui appliquer l'épithète de « grand-mère de l'Europe » - comme à telle autre reine d'Angleterre - car ses enfants et petits-enfants peuplèrent non seulement, les cours de France et d'Angleterre, mais la Sicile, la Castille et jusqu'à l'Empire germanique.Admirablement attentive à son temps, toujours prête à faire face aux situations si tragiques fussent-elles, elle se montra, au cours d'une vie particulièrement mouvementée, capable d'organiser la défense d'une forteresse, d'administrer non seulement son duché, mais tout un royaume, de prévoir l'importance qu'allait prendre, au XIIIe siècle, la bourgeoisie des villes.Les textes contemporains, si sobres soient-ils, nous laissent entrevoir la femme passionnée, la mère vigilante, la reine énergique qu'elle sut être. Au total, selon l'expression de l'un d'entre eux, « une femme incomparable ».Le livre si riche et si remarquable que lui a consacré Régine Pernoud, a été couronné par le Grand Prix littéraire de la Ville de Bordeaux et par le prix Historia.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Medieval",
    "France",
    "European History",
    "Medieval History"
  ],
  "author": "Régine Pernoud",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/997654.Ali_nor_d_Aquitaine"
}