{
  "title": "No Biking in the House Without a Helmet",
  "description": "A loving portrait of a unique twenty first-century family with nine children as it wobbles between disaster and joy: \"We so loved raising our four children by birth, we didn't want to stop. When the clock started to run down on the home team, we brought in ringers.\"When the two-time National Book Award finalist Melissa Fay Greene confided to friends that she and her husband planned to adopt a four-year-old boy from Bulgaria to add to their four children at home, the news threatened to place her, she writes, \"among the greats: the Kennedys, the McCaughey septuplets, the von Trapp family singers, and perhaps even Mrs. Feodor Vassilyev, who, according to the Guinness Book of World Records, gave birth to sixty-nine children in eighteenth-century Russia.\" Greene is best known for her books on the civil rights movement and the African HIV/AIDS pandemic. She's been praised for her \"historian's urge for accuracy,\" her \"sociologist's sense of social nuance,\" and her \"writerly passion for the beauty of language.\" But Melissa and her husband have also pursued a more private vocation: parenthood. \"We so loved raising our four children by birth, we didn't want to stop. When the clock started to run down on the home team, we brought in ringers.\" When the number of children hit nine, Greene took a break from reporting. She trained her journalist's eye upon events at home. Fisseha was riding a bike down the basement stairs; out on the porch, a squirrel was sitting on Jesse's head; vulgar posters had erupted on bedroom walls; the insult niftam (the Amharic word for \"snot\") had led to fistfights; and four non-native-English-speaking teenage boys were researching, on Mom's computer, the subject of \"saxing.\" \"At first I thought one of our trombone players was considering a change of instrument,\" writes Greene. \"Then I remembered: they can't spell.\"Using the tools of her trade, she uncovered the true subject of the \"saxing\" investigation, inspiring the chapter \"Everything You Always Wanted to Know About Sex, but Couldn't Spell.\" A celebration of parenthood; an ingathering of children, through birth and out of loss and bereavement; a relishing of moments hilarious and enlightening - No Biking in the House Without a Helmet is a loving portrait of a unique twenty first-century family as it wobbles between disaster and joy.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Adoption",
    "Parenting",
    "Book Club",
    "Biography",
    "Biography Memoir"
  ],
  "author": "Melissa Fay Greene",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/9972050-no-biking-in-the-house-without-a-helmet"
}