{
  "title": "Kill You Last",
  "description": "Nominated for 2012 Edgar Allen Poe Award by the Mystery Writers of America\"They always agreed to meet me. Of course, I told them I was bringing them money. I said it was cash and I didn't want to send it through the mail.  They might have hesitated at first about meeting me, but I never had to work very hard to convince them.  Why?. . . It was the only way they could prolong their pathetic dreams of someday becoming rich, famous models.\"Shelby's life in Soundview has always been comfortable. Her dad provides a luxurious lifestyle for his family through his photography business. He makes a ton of money taking headshots of pretty young teens who are desperate to become models. Shelbyhas always enjoyed driving around town in a red sports car, shopping with her best friend at her side. And her Mom is laidback,so it's all good.However, as reports of girls disappearing from nearby towns start to appear on the news, Shelby's seemingly perfect life begins to fall apart. The three missing girls have one thing in common--they were all clients of her dad's photography business. Secretsbegin to surface as the investigation continues. Shelby receives threatening e-mails, battles the nosy media, and tries to keep her family together. Now that her dad is implicated in the disappearances, can Shelby figure out a way to clear his name? Or is dad not as innocent as he seems?PRAISE FOR BLOOD ON MY \"[A] rare teen thriller with an actual mystery, this is as quickly paced as it is heart-wrenching.\"- Booklist \"Author recognition, teen love of mystery, and a stellar cover will...make this a well-circulating title.\" - School Library JournalPRAISE FOR WISH YOU WERE \"Hits all the right notes of a teen thriller[...] his gripping plot will keep readers turningpages late into the night\" - School Library Journal \"Carefully plotted; this suspenseful novel blends the traditional with new tech details tosuccessful end [...] will keep readers guessing right up to the satisfying conclusion.\" -Kirkus Reviews",
  "genres": [
    "Mystery",
    "Young Adult",
    "Thriller",
    "Fiction",
    "Suspense",
    "Crime",
    "Family"
  ],
  "author": "Todd Strasser",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/9975686-kill-you-last"
}