{
  "title": "Island at the End of the World: The Turbulent History of Easter Island",
  "description": "On a long stretch of green coast in the South Pacific, hundreds of enormous, impassive stone heads stand guard against the ravages of time, war, and disease that have attempted over the centuries to conquer Easter Island. Steven Roger Fischer offers the first English-language history of Easter Island in Island at the End of the World , a fascinating chronicle of adversity, triumph, and the enduring monumentality of the island's stone guards.A small canoe with Polynesians brought the first humans to Easter Island in 700 CE, and when boat travel in the South Pacific drastically decreased around 1500, the Easter Islanders were forced to adapt in order to survive their isolation. Adaptation, Fischer asserts, was a continuous thread in the life of Easter Island: the first European visitors, who viewed the awe-inspiring monolithic busts in 1722, set off hundreds of years of violent warfare, trade, and disease—from the smallpox, wars, and Great Death that decimated the island to the late nineteenth-century Catholic missionaries who tried to \"save\" it to a despotic Frenchman who declared sole claim of the island and was soon killed by the remaining 111 islanders. The rituals, leaders, and religions of the Easter Islanders evolved with all of these events, and Fischer is just as attentive to the island's cultural developments as he is to its foreign invasions.Bringing his history into the modern era, Fischer examines the colonization and annexation of Easter Island by Chile, including the Rapanui people's push for civil rights in 1964 and 1965, by which they gained full citizenship and freedom of movement on the island. As travel to and interest in the island rapidly expand, Island at the End of the World is an essential history of this mysterious site.",
  "genres": [
    "History",
    "Nonfiction"
  ],
  "author": "Steven Roger Fischer",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/99739.Island_at_the_End_of_the_World"
}