{
  "title": "Zaftan Entrepreneurs: Book 1 of the Zaftan Trilogy",
  "description": "The Zaftans are coming! These aliens are 7 foot 400 pound squid-like creatures with a nasty disposition (when they are in a good mood)Ebook ISBN:  978-1458025517 Synopsis:An alien mining ship from Zaftan 31B discovers Gundarland and orbits the planet. Initial scans show promising mining sites that could yield exotic minerals ladened with rare elements. The zaftan crew launch robotic explorers which do considerable damage to private property and enrage the native population. At the center of the explored territory, Drakin Gemseeker, a dwarf miner, and Leslie Higginbottom, the only constable in the area, are attracted to each other, but the alien incursion comes between them. The politicians in Dun Hythe, the capital, have worked a deal with a zatfan negotiator and the constable must protect the robotic explorers, much to Higginbottom's dismay. Meanwhile, MacDrakin's mining property is twice invaded by robots and he destroys both of them. The second one was armed and fired a weapon at him. MacDrakin declares war on the aliens and the robots and vows to destroy them all. With Higginbottom ordered to protect the robots and MacDrakin hunting them down, their budding romance falters and seems doomed. On the space ship, the zaftan captain, Yunta, is furious at the loss of so many expensive robots. When an extensive mineral deposit is discovered underneath the town, Yunta sees an opportunity to avenge the loss of the explorers. She orders the mineral deposit mined without regard to the town or its inhabitants. She dispatches as many crew members as possible to protect the mining machines and remaining robots.MacDrakin, in the meantime, has assembled a small army and intends to defend the town. If he can defeat the zaftans and drive them away, he hopes that will also clear the way for him to resume romancing Higginbottom.Cover art by Gary V. Tenuta.Tired of reading scifi and fantasy stories that take themselves too seriously? Zaftan Entrepreneurs is a unique First Contact story; it is part adventure and part corporate and political satire spiced with comic relief. Here, you'll find nasty, snarly aliens, fantasy creatures, humans, romance, magic, and--just like the real world--incompetent politicians and feuding bureaucracies. What more could a fantasy/scifi reader ask for?",
  "genres": [
    "Science Fiction"
  ],
  "author": "Hank Quense",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/9988421-zaftan-entrepreneurs"
}