{
  "title": "Subtractive Schooling: U.S.-Mexican Youth and the Politics of Caring",
  "description": "2001 AESA Critics' Choice Award2000 AERA Outstanding Book Award2000 Gustavus Myers Outstanding Book Awards--Honorable MentionProvides an enhanced sense of what's required to genuinely care for and educate the U.S.–Mexican youth in America.\"Valenzuela's thoughtful and thorough analysis of Latino/a students' experiences in a large urban school powerfully defines the educational challenges facing Latino immigrant and U.S.-born youth and outlines important elements for transforming their academic experiences.\"— Harvard Educational Review\"Professor Valenzuela's book suggests what has to change fundamentally for real reform to occur. This ethnography highlights teacher practices that need to be emulated and rewarded. There are models for becoming an effective teacher with Latino/a and other minority students. Overall Subtractive Schooling is a valuable text that is certain to become a standard in sociology courses in the areas of education, race and ethnicity, and Latino/a studies.\" — Contemporary Sociology\"What gives credibility to Valenzuela's powerful account is excellent ethnohistorical documentation and a profound knowledge of youth's thought processes. The selection of eloquent and vivid descriptions of the relationships between students and teachers or counselors permits the reader to internalize, from the students' perspective, the meaning of institutional neglect, hostility, and prejudice on the part of school personnel.\" — Qualitative Studies in Education\"...every government representative, whether at the local, state, or federal level, including the President of the United States, should read this book. Maybe then subtractive schooling would be seen for what it is really worth by people who have the power to 'subtract' it from American society, and to replace it with policies of bilingualism and biculturalism.\" — Bilingual Education and Bilingualism\"In focusing her attention on caring ... Valenzuela provides an important vantage point from which to consider and understand the implications of educational policies and practices designed to move youngsters into the so-called American mainstream.” — Anthropology and Education Quarterly\"...a powerful and important addition to the literature on multi-cultural secondary schooling ... Subtractive Schooling greatly increases our understanding of the intricate complexity of ethnicity and schooling practices. At the same time, it provides a model for a more authentically caring approach to ethnography as well as a more authentically caring style of teaching.\" — Bilingual Research Journal\" ...groundbreaking... — Race and Pedagogy Project",
  "genres": [
    "Education",
    "Nonfiction",
    "Teaching",
    "Sociology",
    "Grad School",
    "Race",
    "Social Justice"
  ],
  "author": "Angela Valenzuela",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/99857.Subtractive_Schooling"
}