{
  "title": "Terrene: the hidden valley",
  "description": "Within every person lies the power to change one world. Within Flora lies the hope for two.In the isolated rural valley of Terrene, where technology is grown, not manufactured, Flora Karachi paints her anguish with flowers and yearns to travel outside the mountain walls that guard her village. But in a society which values harmony and symmetry above all else, her dangerous curiosity and her indelicate scars, earned from a lifetime of inexplicable blackouts, make her an outcast with few prospects for adventure. Then the dreams come. Lucid and overpowering, they throw Flora into a fascinatingly advanced world where she lives the life of Jane Ingram, an American scientist fighting global climate change while trying to raise a child in a society where interpersonal interaction is becoming obsolete. Flora’s blackouts open a window into knowledge lost long ago and possibilities that are yet to come. To unravel these mysteries, she must travel to the enigmatic Institute, an ancient enclave hidden in the surrounding mountains, where scholars guard the secrets of Terrene.Living two lives, Flora will fight to become an Institute scholar in her own world while struggling to save the planet from humanity's neglect in Jane's. Yet all of Flora's courage combined with all of Jane's experience may not be enough to defeat the powerful forces protecting the secret which ties their two worlds together. To find salvation for both worlds, Jane and Flora must sacrifice their own dreams, conquer their fears, and discover hope for a new beginning.Hailed as a clever blend between science fiction and fantasy, Terrene explores the challenges of accelerating technology and global climate change through the stories of two remarkable women in two worlds that are not as distant as they seem.",
  "genres": [
    "Science Fiction",
    "Fantasy",
    "Speculative Fiction",
    "Dystopia",
    "Young Adult"
  ],
  "author": "Eric Liu",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/9978356-terrene"
}