{
  "title": "مسيرة الفيل",
  "description": "2022: AÑO SARAMAGOJosé Saramago narra el insólito viaje del elefante Salomón a través de la Europa del siglo XVIUna aventura épica llena de humanidad, humor y sabiduría«Siempre acabamos llegando a donde nos esperan».Libro de los ItinerariosA mediados del siglo XVI el rey Juan III ofrece a su primo, el archiduque Maximiliano de Austria, un elefante asiático. Esta novela cuenta el viaje épico de ese elefante llamado Salomón que tuvo que recorrer Europa por caprichos reales y absurdas estrategias.El viaje del elefante no es un libro histórico, es una combinación de hechos reales e inventados que nos hace sentir la realidad y la ficción como una unidad indisoluble, como algo propio de la gran literatura. Una reflexión sobre el sentido de la vida humana,con sus afanes, desvelos y ambiciones, con su irremisible final, en la que el humor y la ironía, marcas de la implacable lucidez del autor, se unen a la compasión con la que José Saramago observa las flaquezas humanas.La crítica ha  «Una deslumbrante comedia humana, llena de risas, emoción y sabiduría».Le Monde desLivres«Una obra maestra de la ironía y la empatía entre seres humanos».Los Angeles Times«Saramago vuelve comprensible una realidad huidiza, con parábolas sostenidas por la imaginación, la compasión y la ironía». Comité Nobel«Un hombre con una sensibilidad y una capacidad de ver y de entender que están muy por encima de lo que en general vemos y entendemos los comunes mortales». Héctor Abad Faciolince«Saramago es un ejemplo, un estilo dignísimo de vida y literatura, que demuestra la posibilidad de navegar a contracorriente [...]. Su palabra tiene el valor de un anticongelante, de un remedio personal contra los vendavales de cinismo que nos envuelven». Luis García Montero«Yo no sé, ni quiero saberlo, de dónde ha sacado Saramago ese diabólico tono narrativo, duro y piadoso a un tiempo, [...] que le permite contar tan cerca del corazón y a la vez tan cerca de la historia». Luis Landero«Saramago escribe novelas sobre los mitos para desmitificarlos, [...] siempre para abordar la realidad que le rodea, para tratar de los problemas actuales que son de todos, y para que todo quede claro desde el principio». Rafael Conte, Babelia«Como Günter Grass o Cees Nooteboom, Saramago aspira a enlazar con un público que desborde límites nacionales».El País",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Portugal",
    "Portuguese Literature",
    "Literature",
    "Nobel Prize",
    "Novels"
  ],
  "author": "José Saramago",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/9978184"
}