{
  "title": "Your Daughter's Bedroom: Insights for Raising Confident Women",
  "description": "Your Daughter's Healthy Identity Starts With You After psychoanalyst Joyce McFadden treated countless women who felt alone and isolated in experiences that they were unaware many other women were dealing with too, she began to ask what she could do to help them reach out to each other. The result was the launch of her Women's Realities Study in which she interviewed hundreds of women from ages 18-105, about the most private issues as she sought to understand what events in a woman's life impact her future happiness and self-confidence. What McFadden found was truly revealing― the theme that most interested them as they explored their identities was how their relationship with their mothers influenced their understanding of themselves as sexual beings throughout their lives―from the time they were little girls straight through adulthood. Drawing on over a thousand responses, Your Daughter's Bedroom offers a new and unprecedented look at the mother-daughter bond. McFadden argues that the type of womanhood mothers model for their daughters determines the young girls' comfort with their own bodies which, in turn, leads to confidence and satisfaction later in life. From the most mundane and everyday gestures―a reluctance to call body parts by their real name; an offhanded suggestion to lose weight― to how mothers introduce life altering events such as the start of puberty and sexual exploration, all of these have an impact on a girl's psyche. She found that in an attempt to protect and shield daughters, mothers withhold important information and leave girls to wrestle with their own bourgeoning sexuality and other challenges of growing up. Offering a fresh perspective on the fraught mother-daughter relationship, McFadden shows how mothers can create the right environment for their daughters to grow into self-assured women. Your Daughter's Bedroom is an essential resource for women who want to establish a more open and positive relationship with their daughters.",
  "genres": [
    "Parenting",
    "Nonfiction",
    "Feminism",
    "Self Help",
    "Womens Studies",
    "Psychology"
  ],
  "author": "Joyce T. McFadden",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/9990417-your-daughter-s-bedroom"
}