{
  "title": "The Rock Says...",
  "description": "The Rock says. . . \"Know your damn role--and shut your mouth!\" But that simple catch-phrase, embraced by the millions ñand the millions--of The Rock's fans, can't begin to capture the spirit and larger-than-life personality of the most electrifying man in sports-entertainment.\"In this action-packed, revealing and outrageously funny memoir, World Wrestling Federation Superstar The Rock recounts his life in and out of the ring with unapologetic honesty and inimitable style. From his boyhood days traveling around the world with his father (professional wrestler Rocky Johnson) to his years as a football player at the University of Miami to his meteoric rise through the ranks of the Federation, The Rock Says... chronicles in vivid detail the life story of one of sports-entertainment's most innovative and best-loved personalities.The Rock will take fans on a guided tour of big-time professional wrestling, a highly competitive business in which a handful of gifted and lucky performers dominate, and all others dream of a moment in the spotlight. He provides a breathtaking, minute-by-minute account of Wrestle Mania, the Super Bowl of pro wrestling, including an intimate backstage look at rehearsals with his opponent, Stone Cold Steve Austin. And he discusses in heartfelt detail the loss of his friend and co-worker, Owen Hart.Filled with genuinely touching stories of love and strife, hilarious anecdotes, inside accounts of an industry whose machinations have long been shrouded in secrecy and dozens of previously unpublished photographs from The Rock's personal collection, The Rock Says... is--as The Rock himself might put it--\"the coolest thing since the other side of the pillow if you smell what The Rock is cookin'.\"",
  "genres": [
    "Biography",
    "Nonfiction",
    "Sports",
    "Autobiography",
    "Memoir",
    "Biography Memoir",
    "Collections"
  ],
  "author": "The Rock",
  "average_rating": "3.46",
  "url": "https://www.goodreads.com/book/show/998013.The_Rock_Says_"
}