{
  "title": "Manhattan Affair",
  "description": "A soupcon of Greenwich Village nostalgia mixed with murder and sex, Manhattan Affair portrays a world of secrets and lies which entwine the lives of three former New England college classmates: Jared “Jed” Chase, Steve Cahill, and Morris Bergman.Jed Chase is good-looking and easy-going, and he has a secure job at the Times in advertising. He’s lived a charmed, upper middle class and anchored life; that is until he falls for Katherine Cahill, a seductive and dangerous beauty whose dark secrets threaten to destroy Jed Chase’s dreams, his career, even his life. Katherine is married to financial tycoon Steve Cahill who has secrets of his own: he and his business partner, Arthur Barrett run an underground sex tape racket and are suspected not only working for the U.S. government but also laundering money from them. Katherine seduces Jed into helping her plot her husband’s murder in order to acquire his tens of millions of dollars. Morris Bergman is the lawyer who represents both Jed Chase and Katherine Cahill after their plan backfires. It is when Katherine’s plan unravels that the story weaves its yarn and no one is who they seem. In an attempt to preserve his freedom, Jed delves into the secret world of Katherine and Steve Cahill and discovers a world of sex, espionage and lies. Helped by his buddy at the Times, Mickey Thompson, Jed begins to piece the real story behind the story one frame at a time. All while under the watchful eye of both the NYPD and the CIA; Jed struggles to discover the real truth while fighting for his life.Manhattan Affair portrays the city as many things: a proving ground, a high rolling cavalcade for the rich, or a palimpsest of memories--a historic metropolis eclipsed by modern times. As much a thriller as it is a gripping portrait of the city of yesterday, Manhattan Affair is a new fiction classic from first time writer Jack Sussek. Capturing the mystery and drama of real-life \"news noir,\" Manhattan Affair portrays a city that existed on the cusp of the digital and tech revolution, a city of mom and pop stores and corner pubs and familiar haunts. An eloquent portrait of a city and an epoch, this book is not to be missed by CIA buffs, history fans, or enthusiasts of New York City's past.In the tradition of Pete Hamill meets John Grisham, Jack Sussek has crafted an exciting first novel, rich in New York City detail and ambience, that showcases the power of human goodness and how both greed and love, in its many forms, can drive people to commit unthinkable crimes of passion. Manhattan Affair spellbinds us with the author's thoughtfully convinced nostalgia for his city.",
  "genres": [
    "New York",
    "Thriller"
  ],
  "author": "Jack Sussek",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/13246685-manhattan-affair"
}