{
  "title": "The Atomic Weight of Secrets or The Arrival of the Mysterious Men in Black",
  "description": "\"In 1903, five truly brilliant young inventors, the children of the world’s most important scientists, are taken from their lives and their parents by the mysterious men in black. They take twelve-year-old Jasper and six-year-old Lucy Modest from London, England; nine-year-old Wallace Banneker from New York, United States; twelve-year-old Noah Canto-Sagas from Toronto, Canada; and thirteen-year-old Faye Vigyanveta from New Delhi, India, depositing them all at a strange, isolated farmhouse in Dayton, Ohio, with kindly schoolteacher Miss Brett. But what mysterious invention have all the children, unbeknownst to one another, been working on? Who are the men in black? And are the men in black trying to kidnap them―or protect them? And if they're trying to protect them―from what? An amazing story about the wonders of science and the still greater wonders of friendship, The Atomic Weight of Secrets, the first book of the Young Inventors Guild trilogy is a novel readers will forever treasure.In 1903, five truly brilliant young inventors, the children of the world’s most important scientists, went about their lives and their work as they always had.But all that changed the day the men in black arrived.They arrived to take twelve-year-old Jasper Modest and his six-year-old sister, Lucy―he with his remarkable creations and she with her perfect memory―from their London, England home to a place across the ocean they'd never seen before.They arrived to take nine-year-old Wallace Banneker, last in a long line of Africa-descended scientists, from his chemistry, his father, and his New York home to a life he'd never imagined.Twelve-year-old Noah Canto-Sagas, already missing his world-famous and beloved mother, was taken from Toronto, Canada, carrying only his clothes, his violin, and his remarkable mind.And thirteen-year-old Faye Vigyanveta, the genius daughter of India’s wealthiest and most accomplished scientists, was removed by force from her life of luxury.From all across the world, they've been taken to mysterious Sole Manner Farm, and a beautiful but isolated schoolhouse in Dayton, Ohio, without a word from their parents as to why. Not even the wonderful schoolteacher they find there, Miss Brett, can explain it. She can give them love and care, but she can't give them answers.Things only get stranger from there. What is the book with no pages Jasper and Lucy find in their mother’s underwear drawer, and why do the men in black want it so badly?How is it all the children have been taught the same bizarre poem―and yet no other rhymes or stories their entire lives?And why haven't their parents tried to contact them?Whatever the reasons, to brash, impetuous Faye, the situation is They and their parents have been kidnapped by these terrible men in black, and the only way they're going to escape and rescue their parents is by completing the invention they didn't even know they were all working on―an invention that will change the world forever.But what if the men in black aren't trying to harm the children? What if they're trying to protect them?And if they're trying to protect them―from what?An amazing story about the wonders of science and the still greater wonders of friendship, The Atomic Weight of Secrets or the Arrival of the Mysterious Men in Black, the first book of the Young Inventors Guild trilogy, is a truly original novel. Young readers will forever treasure Eden Unger Bowditch’s funny, inventive, poignant, and wonderfully fun fiction debut.\"",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Young Adult",
    "Steampunk",
    "Science Fiction",
    "Adventure",
    "Fiction"
  ],
  "author": "Eden Unger Bowditch",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/9995065-the-atomic-weight-of-secrets-or-the-arrival-of-the-mysterious-men-in-bla"
}