{
  "title": "The Strategy and Tactics of Pricing: A Guide to Growing More Profitably",
  "description": "For undergraduate introduction to Market Pricing courses. A comprehensive and practical, step-by-step guide to pricing analysis and strategy development. The Strategy and Tactics of Pricing shows readers how to manage markets strategically—rather than simply calculate pricing based on product and profit—in order to improve their competitiveness and the profitability of their offers. The fifth edition contains a new chapter on price implementation and several updated examples on pricing challenges in today’s markets. NEW! Show students how proper pricing can increase profitability—New Chapter on Price Implementation. A completely new chapter on implementing pricing strategy identifies the challenges involved in embedding strategic pricing principles within an organization. This chapter also describes how managers can lead a structured change process to build a more profitable commercial organization. NEW! Offer access to pricing software—Three-Month Trial of LeveragePoint Software. This edition is now available with software for creating and communicating economic value estimations systematically—from LeveragePoint Innovations Inc. While versions of this software that enable sharing require corporate contracts for access, versions for individual student and practitioner use are available without charge for three months with the purchase of The Strategy and Tactics of Pricing . NEW! Make pricing theory relative—Updated Examples of Pricing. Helping connect pricing theory to what students are familiar with, this edition includes updated examples with more topical illustrations of current pricing challenges such • iPhone pricing• New models for pricing music• Services pricing NEW! Present the latest information—Heavily Revised Chapters.The revised chapter on Pricing Policy provides a theoretically-grounded framework to describe specific policies for managing price changes for situations such -Cost-based price increases-Price reductions in a recession-DiscountsThe chapter on Value Creation now addresses the difference between how to consider value when it is driven by tangible monetary drivers (saving money on gas) versus the more subjective psychological drivers (doing the right thing for the environment).The chapter on Value and Price Communication has been substantially revised to describe how to communicate value in a wide variety of product and customer contexts. This chapter also demonstrates how to target communications to affect specific behaviors throughout the customer’s buying process.The chapter on Price Setting has been expanded to provide a robust process for setting prices that can be widely applied to consumer and business markets.",
  "genres": [
    "Business",
    "Nonfiction",
    "Economics",
    "Buisness",
    "Management",
    "Entrepreneurship",
    "Finance"
  ],
  "author": "Thomas T. Nagle",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/99919.The_Strategy_and_Tactics_of_Pricing"
}