{
  "title": "Homosexuality and Civilization",
  "description": "How have major civilizations of the last two millennia treated people who were attracted to their own sex? In a narrative tour de force, Louis Crompton chronicles the lives and achievements of homosexual men and women alongside a darker history of persecution, as he compares the Christian West with the cultures of ancient Greece and Rome, Arab Spain, imperial China, and pre-Meiji Japan.Ancient Greek culture celebrated same-sex love in history, literature, and art, making high claims for its moral influence. By contrast, Jewish religious leaders in the sixth century B.C.E. branded male homosexuality as a capital offense and, later, blamed it for the destruction of the biblical city of Sodom. When these two traditions collided in Christian Rome during the late empire, the tragic repercussions were felt throughout Europe and the New World.Louis Crompton traces Church-inspired mutilation, torture, and burning of \"sodomites\" in sixth-century Byzantium, medieval France, Renaissance Italy, and in Spain under the Inquisition. But Protestant authorities were equally committed to the execution of homosexuals in the Netherlands, Calvin's Geneva, and Georgian England. The root cause was religious superstition, abetted by political ambition and sheer greed. Yet from this cauldron of fears and desires, homoerotic themes surfaced in the art of the Renaissance masters--Donatello, Leonardo, Michelangelo, Sodoma, Cellini, and Caravaggio--often intertwined with Christian motifs. Homosexuality also flourished in the court intrigues of Henry III of France, Queen Christina of Sweden, James I and William III of England, Queen Anne, and Frederick the Great.Anti-homosexual atrocities committed in the West contrast starkly with the more tolerant traditions of pre-modern China and Japan, as revealed in poetry, fiction, and art and in the lives of emperors, shoguns, Buddhist priests, scholars, and actors. In the samurai tradition of Japan, Crompton makes clear, the celebration of same-sex love rivaled that of ancient Greece.Sweeping in scope, elegantly crafted, and lavishly illustrated, \"Homosexuality and Civilization\" is a stunning exploration of a rich and terrible past.",
  "genres": [
    "History",
    "Nonfiction",
    "LGBT",
    "Queer",
    "Gay",
    "Sexuality",
    "Sociology"
  ],
  "author": "Louis Crompton",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/999506.Homosexuality_and_Civilization"
}