{
  "title": "The Gaggle: How the Guys You Know Will Help You Find the Love You Want",
  "description": "The Gaggle captures the zeitgeist of today's “post-dating” world, where the rules for sex, dating, and relationships have completely changed. Instead of dating, women collect a “gaggle” of men who orbit around them, occupying both romantic and platonic roles, but ultimately revealing who and what they want.Who cares if he’s just not that into you? You’ve got a gaggle.It’s easy to feel like your love life is nonexistent. You know you’re great, so why haven’t you been on a classic dinner-and-a-movie date since . . . well, forever? Because as it turns out, you are now living in a post-dating world, where the old rules for sex and relationships no longer apply. Suddenly, everything and nothing is a date. But this means that you have much more going on in your love life than you realize.Think about all the ambiguous interactions you have with from a brainstorming session with a coworker, to a drink with an old friend, to a late night Skype session with an ex who’s still in your life. Once you open your eyes, you’ll see that you’re already exploring all sorts of connections with the men in your life via these non-dates. And who are all these guys you’re non-dating?Say hello to your gaggle.The gaggle is the group of guys in your life who play different roles, fulfill different needs, and help you figure out who you are, what you want, and what kind of relationship you ultimately desire. Though no two gaggles are alike, there are ten types of men a gaggle might include, such as the Ego Booster, the Hot Sex Prospect, and the Boyfriend Prospect. Romance, excitement, self-discovery, love . . . all this will be yours, once you stop stressing about dates, labels, and expectations and start thinking of each man you know and meet as a potential guy in your gaggle.In this clever and groundbreaking debut, based on interviews with women and men across the country, Jessica Massa reveals the ways in which the potential for love is all around you. The Gaggle is the ultimate guide to figuring out what you want— and finding your match—in a world that has left traditional dating behind.",
  "genres": [
    "Nonfiction",
    "Relationships",
    "Self Help"
  ],
  "author": "Jessica Massa",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/13247456-the-gaggle"
}