{
  "title": "One-hit Willie: A Classic rock novel",
  "description": "MUSIC, MURDER, MYSTERY AND MAYHEM! Take a long, strange trip through five decades of music history with “Weekend Willie” Taylor, one of America’s most infamous one-hit wonders. But this rock ’n’ roll fantasy doesn’t end with the typical “where are they now?” tale of woe. Following his mysterious disappearance, with the police and the Las Vegas mob hot on his trail, this 20th-century Mozart assumes a new identity, recruits a new band from the elite of the 1960s San Francisco music scene and becomes an icon of the classic-rock era. When his dark secrets are finally revealed on national TV, will the Sin City crime lord he crossed finally collect the ultimate revenge? Put a quarter in the jukebox and play “One-Hit A Classic Rock Novel.” Along the way, you will experience the excitement of early 1960s Las Vegas, the uninhibited freedom of Haight-Ashbury during the Summer of Love and life on the road during the classic rock era with one of America’s favorite bands. Researched with meticulous care, author William Westhoven, an award-winning performing-arts writer, editor and columnist since 1989, weaves real, precisely dated history through the lives of his characters, whose own fictional back stories and adventures are inspired by the icons of the world of popular music. \"A wild ride through rock music history and a fun story, like 'Forrest Gump' meets 'The Fugitive' \" - Damian Fanelli, Online managing Editor, GUITAR WORLD magazine \"Westhoven weaves a mix of realistic backstage stories of a one-hit wonder rock musician who gets second and third chances with a good old-fashioned mob murder-mystery that gives an authentic look at the classic rock era and beyond. A page turner for music lovers and mystery fans both.\" - Walter O'Brien, owner of Concrete Management Inc., former manager of PANTERA, WHITE ZOMBIE, ANTHRAX and other rock bands \"A satisfying read and a very good time … Great plot twists. I can feel the eras and the place settings.\" - Lorraine Ash, author, \"Life Touches Life\"WILLIAM WESTHOVEN is an award-winning journalist, editor and newspaper columnist who has covered the performing arts since 1989. His interview subjects range from show-business legends such as Bob Hope, Dick Clark and Les Paul to dozens of Rock ’n’ Roll Hall of Fame inductees. His columns and reviews have won both state and national honors, including seven first-place awards from the New Jersey Press Association for Critical Writing. He is the author of “Eric Career of a Rock Legend” (Zinn Publishing Group/Barclay House Books, 1996). “One-Hit A Classic Rock Novel” is his first novel.For more information, visit www.onehitwillie.com or the \"One-Hit Willie\" page on Facebook.",
  "genres": [],
  "author": "William Westhoven",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/13250927-one-hit-willie"
}