{
  "title": "Torn From The Inside Out",
  "description": "Narrative MemoirDuring a cold, February thunderstorm, in the dark of night, Sara Niles fled for her life with her five children in tow, forced to disappear in order to stay alive.Torn From the Inside Out is a true story of extreme domestic violence and family dysfunction that begins with the heroic intervention of an 83 year-old uncle, when Sara Niles was a 3 1/2 year-old child, living in a perilous climate. Sara’s great-great Uncle Robert saves her, and takes her home to live on a beautiful, paradisiac farm to live with he, and his childless wife, Sara’s Aunt Molly.Set in the Rural South during a time of racial conflict, Sara begins her life racially mixed, half White and half Black, during the late 1950’s. The story fast forwards, as the wonderful life provided by Sara's aged uncle and aunt falls apart, leaving Sara vulnerable to the advances of Vietnam Veteran Thomas Niles, whom she marries when only sixteen years old. Niles is a violent and abusive man, given to sudden rages and fits of mood that were entirely foreign to Sara.True to Sara’s optimistic spirit, Sara attempts to help Thomas Niles conquer his demons, while hoping and wishing for better times, and enduring abuse, Sara eventually comes to the realization Thomas Niles is a killer, who promises to kill her and ‘every one of those children’, if she tried to leave him.Torn From the Inside Out probes the depth of human behavior to the root of existence, as it emotionally traverses the soil of our hearts and souls. Human relationships from early childhood through adulthood, color our views of selves and the world around us. Our pasts are what make us what we are. It is the pain that is experienced through earlier life that makes us wise in hindsight; illuminating the past with new light. It is through the lens of life that Sara tells her story:“In the process of my evolution, I became a victim of domestic war, an emotional casualty for a major portion of my life, entwined, entrapped and emotionally involved, until I learned how to become free. Freedom has never been easily gained and has often come at high cost throughout history, but one thing I will always know is freedom is worth every fight, and all pain.” Sara Niles from Torn From the Inside OutIn every life there is a timeless and unforgettable minute or day that will be forever etched into our mind’s memory. I have unforgettable memories that are so vivid that I see them in Technicolor, and I hear them with surround sound. Long after I am dead, I believe, I will remember. Two of those memories were the days of my escape to freedom…twice.I am the little girl who sat in the sand over fifty years ago, and this is my story.Thunder rattled the window- panes two stories high and lightning split the sky; it was as if the whole world was in turmoil that night. My nerves were keyed up as tight as piano strings, and in a sudden moment of stillness and silence it felt as though my heartbeat was amplified ten times over. He was over a hundred pounds greater than I, nearly a foot taller, and I knew he could move his muscled body into unbelievable sprints. Rain started falling in torrents, while the storm raged outside. I was not afraid of the storms of nature; it was the storm inside this night that I knew I might not survive",
  "genres": [
    "Nonfiction"
  ],
  "author": "Sara Niles",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/13252898-torn-from-the-inside-out"
}