{
  "title": "Resurrect",
  "description": "In the 1850s, a madman proclaims himself the Son of God and raises an army, taking over half of China. A century and a half later, his descendent and legions of devoted followers plan to take over more than just the Middle Kingdom. When alpine engineer and mountaineer Jason Quinn, a man with a past mired in tragedy and violence, meets archeologist Dr. Eva Rayjek after a plane crash in the high Himalaya, neither of them are expecting wave after wave of Chinese assassins intent on killing them. Pursued to America, the frozen ice of the Gulf of Finland, and the heights of Hong Kong, Quinn and Eva connect her investigations with the machinations of charismatic shipping magnate and cathedral-builder, David Hong. As a scheme to obtain a private audience with the Pope at the Vatican comes to fruition, Hong’s fanatical followers are preparing for global warfare. If Quinn fails to stop Hong’s plan, the entire Catholic Church just might crumble. RESURRECT is the first book in the Jason Quinn series. Fans of Matthew Reilly, Jeremy Robinson, James Rollins, and Clive Cussler should all enjoy this first adventure in the exploits of mountaineer Jason Quinn. PRAISE FOR \"RESURRECT by Kane Gilmour is a smart, taut thriller that takes the genre forged by Clive Cussler and makes it fresh again. The combination of history, conspiracy and explosive action makes the book impossible to put down. Highly recommended!\" —Jeremy Robinson, bestselling author of INSTINCT and THRESHOLD \"If you're a fan of thrillers, and you haven't read Kane Gilmour's Resurrect, you need your head examined. Quickly. Gilmour mixes Clive Cussler with Matthew Reilly, then adds a healthy dose of his own style. The result is a debut novel that stands with the best in the genre and leaves you ready to pound on Gilmour's door demanding the sequel.\" —Edward G. Talbot, author of 2012: THE FIFTH WORLD and NEW WORLD ORDERS “I know I’m not the first to say it, but it bears repeating. Kane Gilmour has tapped into the same creative vein that energized Clive Cussler’s earlier Dirk Pitt novels. It’s all there, from the pitch perfect character chemistry to over-the-top action. If you’ve been craving some old school Cussler, you really need to read RESURRECT.” —Sean Ellis, author of INTO THE BLACK and MAGIC MIRROR “I understand that RESURRECT is a first novel and to say it was impressive would be an understatement. A very entertaining action thriller. Well paced and hard to put down.” —E. Bard, ThrillReads and Reviews ABOUT THE Kane Gilmour has lived all over the world. He has worked as a physical therapy assistant in the U. S. Air Force, as a clerk in various retail positions, as a human trash compactor for a freight company, and as a teacher, a teacher-trainer, and a teacher of teacher-trainers. Recently, he has worked as an editor for an IT firm and as a freelance editor for thriller authors. RESURRECT is his first novel. Kane lives with his wife, son, and newborn daughter in the wilds of Central Vermont.",
  "genres": [],
  "author": "Kane Gilmour",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/13252772-resurrect"
}