{
  "title": "Vampire Journals 1-3 Collection",
  "description": "A bundle of the first 3 books in Morgan Rice’s #1 bestselling THE VAMPIRE JOURNALS series—all for an incredible price of just $6.99! Makes for a great introduction to the series, or a great gift! In TURNED (Book #1), eighteen year old Caitlin Paine finds herself uprooted from her nice suburb and forced to attend a dangerous New York City high school when her Mom moves again. The one ray of light in her new surroundings is Jonah, a new classmate who takes an instant liking to her. But before their romance can blossom, Caitlin suddenly finds herself changing. She is overcome by a superhuman strength, a sensitivity to light, a desire to feed--by feelings she does not understand. She seeks answers to what’s happening to her, and her cravings lead her to the wrong place at the wrong time. Her eyes are opened to a hidden world, right beneath her feet, thriving underground in New York City. She finds herself caught between two dangerous covens, right in the middle of a vampire war. It is at this moment that Caitlin meets Caleb, a mysterious and powerful vampire who rescues her from the dark forces. He needs her to help lead him to the legendary lost artifact. And she needs him for answers, and for protection. Together, they will need to answer one crucial who was her real father? But Caitlin finds herself caught between two men as something else arises between a forbidden love. A love between the races that will risk both of their lives, and will force them to decide whether to risk it all for each other... In LOVED (Book #2 in the Vampire Journals), Caitlin and Caleb embark together on their quest to find the one object that can stop the imminent vampire and human the lost sword. An object of vampire lore, there is grave doubt over whether it even exists. Caitlin and Caleb’s journey takes them on a whirlwind of historic locations—from the Hudson Valley, to Salem, to the heart of historic Boston—the very spot where witches were once hung on the hill of Boston Common. Why are these locations so important to the vampire race? And what do they have to do with Caitlin’s ancestry, and with who she’s becoming? They may not even make it. Caitlin and Caleb’s love for each other is blossoming. And their forbidden romance may just destroy everything they’ve set out to achieve…. ACCLAIM FOR THE VAMPIRE \"TURNED is an ideal story for young readers. Morgan Rice did a good job spinning an interesting twist on what could have been a typical vampire tale. Refreshing and unique, TURNED has the classic elements found in many Young Adult paranormal stories. Book #1 of the Vampire Journals Series focuses around one girl…one extraordinary girl!...TURNED is easy to read but extremely fast-paced....Recommended for anyone who likes to read soft paranormal romances. Rated PG.\" --The Romance Reviews “THE VAMPIRE JOURNALS series has had a great plot, and LOVED especially was the kind of book you will have trouble putting down at night. The ending was a cliffhanger that was so spectacular that you will immediately want to buy the next book, just to see what happens. As you can see, this book was a huge step up in the series and receives a solid A.” --The Dallas Examiner “BETRAYED is a great installment for this series. Morgan Rice has really come up with a winner in this series. It is fast paced, filled with action, love, suspense, and intrigue. If you haven't read her first two novels, read them and then get your hands on BETRAYED. I read these books in order, but each of these books are also designed to read individually, so even if you haven't read the first two, pick up BETRAYED.",
  "genres": [
    "Young Adult",
    "Romance",
    "Fiction",
    "Fantasy"
  ],
  "author": "Morgan Rice",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/13254263-vampire-journals-1-3-collection"
}