{
  "title": "One Crazy Summer",
  "description": "With over 175,000 books downloaded worldwide, the bestselling author of The Mystic Saga, Dominion, Saving Brooksie, and Ghosts of Ophidian now brings you a tale of three teenagers who may have just found a modern day treasure map at their summer job.  It’s the summer of 1999 and the price of gas is $1.09 per gallon, J-Lo is releasing her first album, and in the small town of Riverton, Bradley Brock is searching for 1.3 million dollars.  With the whole summer ahead of him, Bradley stumbles unwittingly into his first summer job. While it appears to be an opportunity to learn responsibility and make a few bucks in the process, it is anything but! With a manager that likes to play pranks and sports in the store, a cashier that is encouraged to harass customers, and a crazy guy who knocks holes in the walls, Brad finds himself almost alone in his sanity.  Then Brad discovers a journal that documents a fellow employee’s search for a large bag of money that was lost many years ago. With the assistance of two of his friends, he embarks on a journey to follow the trail of the money and ultimately to nab it for themselves.  The only problem – someone else is searching for the same bag of money and he’s willing to kill for it.  Scott McElhaney is the recipient of the Xulon Book Award for his first suspense novel “Mommy’s Choice.” Now he is making most of his novels available to Kindle readers at the very accessible price of only 99 cents. Scott is a veteran of the US Navy, a loyal husband of more than 18 years, and a father of two boys. He is currently employed as a finance supervisor at the Matco Tools corporate office while he maintains his \"side job\" as an author of suspense and science fiction. This book is the results of spending more than 5 years as the \"world's worst store manager\" (in his opinion) at a local business that will remain unnamed - some of the best years of Scott's life.",
  "genres": [
    "Mystery",
    "Young Adult",
    "M M Romance",
    "Fiction",
    "Christian",
    "Christian Fiction",
    "Amazon"
  ],
  "author": "Scott McElhaney",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/13254424-one-crazy-summer"
}