{
  "title": "Villimpi Pohjola",
  "description": "Nuorten aikuisten maailmaan keskittyvässä Villimpi Pohjola sarjakuvassa etsitään sielunkumppaneita yöelämästä, parannetaan maailmaa videopelien lomassa ja murehditaan tulevaisuutta kahvikupposen äärellä. Sarjakuvan ruuduissa hölmöilevät päähenkilöt tuntuvat lukijastakin etäisesti tutuilta kuin omasta kaveripiiristä. Tarinoissa käsitellään niin opiskelijaelämää, parisuhdeongelmia kuin nykyistä maailmantilaakin, tosin useasti pienellä absurdilla asenteella.Vuodesta 2003 Aamulehdessä ilmestynyt sarjakuva juhlii tänä keväänä 200. strippiään, mutta myös tuoretta albumia. 88-sivuinen värialbumi kokoaa tarinoita vuosien varrelta, mutta tarjoaa myös hitusen uuttakin tuotantoa.Villimpi Pohjola on Aamulehden lisäksi ilmestynyt Aviisissa ja Lapin Kansan Hetki-liitteessä, mutta myös kurkottanut kotimaan ulkopuolellekin. Maailmalla sarjakuva tunnetaan nimellä Northern Overexposure, ja se on ilmestynyt kiinalaisessa Comic Pie lehdessä. Kesällä 2007 ilmestyvän neljännen Flight antologian sivuilla nähdään myös tuttuja hahmoja ...And Hope for the Best nimisessä novellissa. Ulkomaisten yhteyksien vuoksi stripit ovat käännetty myös englanniksi tuoreeseen albumiin.Sarjakuvan piirtäjä/käsikirjoittaja JP Ahonen on tamperelainen kuvittaja. Hän (kuten hahmonsa) tuskailee tulevaisuuden suunnitelmien parissa, tekee liikaa töitä ja yrittää löytää aikaa graduansa varten. Ahonen on Lapin yliopiston graafisen suunnittelun koulutusohjelman kasvatteja ja myöntää Rovaniemen opiskelijaelämän tarjonneen lukuisia ideoita sarjakuviinsa.Villimpi Pohjola sarjakuvan lisäksi Ahonen tekee kuvituksia WSOY:n oppikirjoille ja Aamulehdelle, sekä monille muille asiakkaille. Vapaa-aikanaan hän pakertaa fantasiasarjakuvansa parissa, josta saadaan esimakua Ape Entertainmentin 2008 julkaisemassa Fablewood-sarjakuvakokoelmassa.Ahosen esikoisalbumi Villimpi Pohjola julkaistaan 31.3. Tampere kuplii sarjakuvafestivaaleilla.",
  "genres": [
    "Comics",
    "Finnish Literature",
    "Humor",
    "Graphic Novels"
  ],
  "author": "J.P. Ahonen",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/13255105-villimpi-pohjola"
}