{
  "title": "The New New Deal: The Hidden Story of Change in the Obama Era",
  "description": "The New, New Deal is a riveting story about change in the Obama era—and an essential handbook for voters who want the truth about the president, his record, and his enemies.In a riveting account based on new documents and interviews with more than 400 sources on both sides of the aisle, award-winning reporter Michael Grunwald reveals the vivid story behind President Obama’s $800 billion stimulus bill, one of the most important and least understood pieces of legislation in the history of the country. Grunwald’s meticulous reporting shows how the stimulus, though reviled on the right and the left, helped prevent a depression while jump-starting the president’s agenda for lasting change. As ambitious and far-reaching as FDR’s New Deal, the Recovery Act is a down payment on the nation’s economic and environmental future, the purest distillation of change in the Obama era. The stimulus has launched a transition to a clean-energy economy, doubled our renewable power, and financed unprecedented investments in energy efficiency, a smarter grid, electric cars, advanced biofuels, and green manufacturing. It is computerizing America’s pen-and-paper medical system. Its Race to the Top is the boldest education reform in U.S. history. It has put in place the biggest middle-class tax cuts in a generation, the largest research investments ever, and the most extensive infrastructure investments since Eisenhower’s interstate highway system. It includes the largest expansion of antipoverty programs since the Great Society, lifting millions of Americans above the poverty line, reducing homelessness, and modernizing unemployment insurance. Like the first New Deal, Obama’s stimulus has created legacies that last: the world’s largest wind and solar projects, a new battery industry, a fledgling high-speed rail network, and the world’s highest-speed Internet network. Michael Grunwald goes behind the scenes—sitting in on cabinet meetings, as well as recounting the secret strategy sessions where Republicans devised their resistance to Obama—to show how the stimulus was born, how it fueled a resurgence on the right, and how it is changing America. The New New Deal shatters the conventional Washington narrative and it will redefine the way Obama’s first term is perceived.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Economics",
    "History",
    "Political Science",
    "American History",
    "The United States Of America"
  ],
  "author": "Michael Grunwald",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/13259312-the-new-new-deal"
}