{
  "title": "Mick: The Wild Life and Mad Genius of Jagger",
  "description": "#1 bestselling biographer Christopher Andersen provides this no-holds-barred biography as shocking and uncompromising as Mick Jagger himself, timed to coincide with the 50th anniversary of the Rolling Stones and their world tour.“ He’s a smart little mother******,I’ll give him that. ” —KEITH RICHARDS on MICK JAGGERIS he Jumpin’ Jack Flash? A Street Fighting Man? A Man of Wealth and Taste? All this, it turns out, and far more. By any definition, Mick Jagger is a force of nature, a complete original—and undeniably one of the dominant cultural figures of our time. Swaggering, strutting, sometimes elusive, always spellbinding, he grabbed us by our collective throat a half-century ago and—unlike so many of his gifted peers—never let go.For decades, Mick has jealously guarded his many shocking secrets—until now. As the Rolling Stones mark their 50th anniversary, journalist and #1 New York Times bestselling author Christopher Andersen tears the mask from rock’s most complex and enigmatic icon in a no-holds-barred biography as impossible to ignore as Jagger himself.Based on interviews with friends, family members, fellow music legends, and industry insiders—as well as wives and legions of lovers—MICK sheds new light on a man whose very name defines an era and candidly —New details about Jagger’s jaw-dropping sexual exploits with more than four thousand women (including Madonna, Angelina Jolie, Carly Simon, Linda Ronstadt, Uma Thurman, and France’s First Lady Carla Bruni)—as well as his encounters with several of rock’s biggest male stars. Also, the day Mick’s wife Jerry Hall and Keith Richards pleaded with Jagger to seek treatment for sex addiction.—The backstage drama surrounding Mick’s knighthood, and Jagger’s little-known ties to Britain’s Royal Family, including Prince William and Kate Middleton.—What he really thinks of today’s superstars—including Lady Gaga, Britney Spears, Beyoncé, Justin Timberlake, Kanye West, and Justin Bieber.—Never-before-revealed, behind-the-scenes accounts of his often turbulent relationships—from his band-mates, ravenous groupies, and rabid fans to such intimates as Andy Warhol, John Lennon, Jackie Onassis, Bill Clinton, and others.—Cocaine, LSD, hashish, and speed—the flabbergasting truth about the extent of Jagger’s substance abuse, and how long it really went on.—A rare glimpse into Mick’s business dealings and the killer instinct that has enabled him to amass a personal fortune well in excess of $400 million.—The stormy “marriage” between Mick and Keith that nearly ran aground over Keith’s searing comments—and all the scandal, mayhem, excess, madness, and genius that went into making the Rolling Stones “the world’s greatest rock-and-roll band.”Like its subject, this book is explosive and riveting—the definitive biography of a living legend who has kept us thrilled, confounded, and astounded.THIS IS MICK.",
  "genres": [
    "Music",
    "Biography",
    "Nonfiction",
    "History",
    "Biography Memoir",
    "Autobiography"
  ],
  "author": "Christopher Andersen",
  "average_rating": "3.46",
  "url": "https://www.goodreads.com/book/show/13259718-mick"
}