{
  "title": "Murder at Camp Delta: A Staff Sergeant's Pursuit of the Truth About Guantanamo Bay",
  "description": "The revelatory eyewitness account about Guantánamo Bay—detainees murdered, a secret CIA facility for torture, and the US government cover up—by the Staff Sergeant who felt honor-bound to uncover it.Staff Sergeant Joe Hickman was a loyal member of the armed forces and a proud American patriot. For twenty years, he worked as a prison guard, a private investigator, and in the military, earning more than twenty commendations and awards. When he re-enlisted after 9/11, he served as a team leader and Sergeant of the Guard in Guantánamo Naval Base. From the moment he arrived at Camp Delta, something was amiss. The prisons were chaotic, detainees were abused, and Hickman uncovered by accident a secret facility he labeled “Camp No.” On June 9, 2006, the night Hickman was on duty, three prisoners died, supposed suicides, and Hickman knew something was seriously wrong. So began his epic search for the truth, an odyssey that would lead him to conclude that the US government was using Guantánamo not just as a prison, but as a training ground for interrogators to test advanced torture techniques.For the first time, Hickman details the inner workings of Camp Delta: the events surrounding the death of three prisoners, the orchestrated the cover-up, and the secret facility at the heart of it all. From his own eyewitness account, and a careful review of thousands of documents, he deconstructs the government’s account of what happened and proves that the military not only tortured prisoners, but lied about their deaths. By revealing Guantánamo’s true nature, Sergeant Hickman shows us why the prison has been so difficult to close. This book opens an important window onto government overreach, secrecy, and one man’s principled search for the truth. - See more at: http://books.simonandschuster.com/Mur...",
  "genres": [
    "Nonfiction",
    "True Crime",
    "Politics",
    "Military Fiction",
    "Biography",
    "History"
  ],
  "author": "Joseph Hickman",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/13259777-murder-at-camp-delta"
}