{
  "title": "In the Water They Can't See You Cry: A Memoir",
  "description": "In this candid and ultimately uplifting memoir, Olympic medalist Amanda Beard reveals the truth about coming of age in the spotlight, the demons she battled along the way, and the newfound happiness that has proved to be her greatest victory. At the tender age of fourteen, Amanda Beard walked onto the pool deck at the Atlanta Olympics carrying her teddy bear, Harold, and left with two silvers and a gold medal. She competed in three more Olympic games, winning a total of seven medals, and enjoyed a lucrative modeling career on the side. At one point, she was the most downloaded female athlete on the Internet. Yet despite her astonishing career and sex-symbol status, Amanda felt unworthy of all her success. Unaware that she was suffering from clinical depression, she hid the pain beneath a megawatt smile. With no other outlet for her feelings besides the pool, Amanda expressed her emotions through self-destructive behavior. In her late teens and twenties, she became bulimic, abused drugs and alcohol, and started cutting herself. Her low self-esteem led to toxic relationships with high-profile men in the sports world. No one, not even her own parents and friends, knew about the turmoil she was going through. Only when she met her future husband, who discovered her cutting herself, did Amanda realize she needed help. Through her renewed faith in herself; the love of her family; and finally the birth of her baby boy, Blaise, Amanda has transformed her life. In these pages, she speaks frankly about her struggles with depression, the pressures to be thin, and the unhealthy relationships she confused for love. In the Water They Can’t See You Cry is a raw, compelling story of a woman who gained the strength to live as bravely out of the water as she did in it.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Sports",
    "Biography",
    "Biography Memoir",
    "Audiobook",
    "Psychology"
  ],
  "author": "Amanda Beard",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/13259817-in-the-water-they-can-t-see-you-cry"
}