{
  "title": "Off Balance",
  "description": "In this searing and riveting New York Times bestseller, Olympic gold medalist Dominique Moceanu reveals the dark underbelly of Olympic gymnastics, the true price of success...and the shocking secret about her past and her family that she only learned years later.At fourteen years old, Dominique Moceanu was the youngest member of the 1996 US Women's Olympic Gymnastics team, the first and only American women's team to take gold at the Olympics. Her pixyish appearance and ferocious competitive drive quickly earned her the status of media darling. But behind the fame, the flawless floor routines, and the million-dollar smile, her life was a series of challenges and hardships.Off Balance vividly delineates each of the dominating characters who contributed to Moceanu's rise to the top, from her stubborn father and long-suffering mother to her mercurial coach, Bela Karolyi. Here, Moceanu finally shares the haunting stories of competition, her years of hiding injuries and pain out of fear of retribution from her coaches, and how she hit rock bottom after a public battle with her parents.But medals, murder plots, drugs, and daring escapes aside (all of which figure into Moceanu's incredible journey), the most unique aspect of her life is the family secret that Moceanu discovers, opening a new and unexpected chapter in her adult life. A mysterious letter from a stranger reveals that she has a second sister--born with a physical disability and given away at birth--who has nonetheless followed in Moceanu's footsteps in an astonishing way.A multilayered memoir that transcends the world of sports, Off Balance will touch anyone who has ever dared to dream of a better life.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Sports",
    "Biography",
    "Biography Memoir",
    "Autobiography",
    "Adult"
  ],
  "author": "Dominique Moceanu",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/13259719-off-balance"
}