{
  "title": "Gifts of the Crow: How Perception, Emotion, and Thought Allow Smart Birds to Behave Like Humans",
  "description": "Stan Coren’s groundbreaking The Intelligence of Dogs meets Bernd Heinrich’s classic Mind of the Raven in this astonishing, beautifully illustrated look at the uncanny intelligence and emotions of crows.CROWS ARE MISCHIEVOUS, playful, social, and passionate. They have brains that are huge for their body size and exhibit an avian kind of eloquence. They mate for life and associate with relatives and neighbors for years. And because they often live near people—in our gardens, parks, and cities—they are also keenly aware of our peculiarities, staying away from and even scolding anyone who threatens or harms them and quickly learning to recognize and approach those who care for and feed them, even giving them numerous, oddly touching gifts in return. With his extraordinary research on the intelligence and startling abilities of corvids—crows, ravens, and jays—scientist John Marzluff teams up with artist-naturalist Tony Angell to tell amazing stories of these brilliant birds in Gifts of the Crow. With narrative, diagrams, and gorgeous line drawings, they offer an in-depth look at these complex creatures and our shared behaviors. The ongoing connection between humans and crows—a cultural coevolution—has shaped both species for millions of years. And the characteristics of crows that allow this symbiotic relationship are language, delinquency, frolic, passion, wrath, risk-taking, and awareness—seven traits that humans find strangely familiar. Crows gather around their dead, warn of impending doom, recognize people, commit murder of other crows, lure fish and birds to their death, swill coffee, drink beer, turn on lights to stay warm, design and use tools, use cars as nutcrackers, windsurf and sled to play, and work in tandem to spray soft cheese out of a can. Their marvelous brains allow them to think, plan, and reconsider their actions. With its abundance of funny, awe-inspiring, and poignant stories, Gifts of the Crow portrays creatures who are nothing short of amazing. A testament to years of painstaking research and careful observation, this fully illustrated, riveting work is a thrilling look at one of nature’s most wondrous creatures.",
  "genres": [
    "Nonfiction",
    "Science",
    "Birds",
    "Nature",
    "Animals",
    "Biology",
    "Natural History"
  ],
  "author": "John M. Marzluff",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/13259775-gifts-of-the-crow"
}