{
  "title": "An Epidemic of Absence: A New Way of Understanding Allergies and Autoimmune Diseases",
  "description": "A brilliant, cutting-edge report on the rise of autoimmune disease—and the controversial new “worm therapy” that scientists are embracing to treat it.\n\nWhether it’s asthma, Crohn’s Disease, or food or pollen allergies, everyone knows someone who suffers from an autoimmune disorder. But why are they on the rise?     Science writer Moises Velasquez-Manoff offers a new and controversial way of thinking about autoimmune disease—one that may foster a paradigm shift in the way we think about health and hygiene.     In the early twentieth century, the dawn of improved hygiene, water treatment, vaccines, and antibiotics saved countless lives, eradicating diseases that had plagued humanity for millennia. But in the wake of this triumph, a new threat arose: The human immune system began to malfunction.     A growing body of evidence suggests that the very steps we took to cure these maladies have also eradicated organisms that once kept our bodies in balance. To combat this “epidemic of absence,” a group of scientists has begun deliberately reintroducing parasitic worms—helminthes—to calm the immune system of their hosts. This book takes a close look at the scientists at the vanguard of “worm therapy,” which has been proven to not only preempt immune malfunction, but to send a number of disorders—from Crohn’s Disease to multiple sclerosis to asthma—into remission.     Exploring the greater context of rampant immune system dysfunction in the developed world, and its implications for developing countries, Velasquez-Manoff offers an eye-opening and elegant portrait of science’s new view of the human organism.",
  "genres": [
    "Science",
    "Health",
    "Nonfiction",
    "Medicine",
    "Medical",
    "Biology",
    "Audiobook"
  ],
  "author": "Moises Velasquez-Manoff",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/13259821-an-epidemic-of-absence"
}