{
  "title": "City of the Dead",
  "description": "Fans of Ian Rankin and Lee Child will relish the latest thriller from the author of Thou Shalt Kill —the second novel in a heart-pounding series featuring hardened homicide detective Franco Patrese.Daniel Blake more than delivers on the promise of his acclaimed thriller Thou Shalt Kill, bringing back detective Franco Patrese in City of the Dead, “a blood-soaked, full-throttle descent into hell and one of the best thrillers you will read this or any other year” (Lorenzo Carcaterra).“You’re not tainted. You’re not one of them. I need you alone. . . .”The woman who contacted Franco Patrese was the ultimate New Orleans society beautiful, seductive, cunning, and, in this case, desperate. The personal assistant to the city’s most powerful man, she had to meet Patrese in secret. Fearful whispers of “sacrifices” were all Patrese could glean; she didn’t live long enough to tell him any more.Patrese had come to New Orleans, buffeted by the winds of fate, bearing a pain that cops know too well. His native Pittsburgh was still in his bones, while a disaster on a tropical island had shaken his soul. In the thick, hot, exotic world of the Crescent City he began to come alive again. But now he cannot afford to be the new guy, the guy on the outside looking in. A second body has been found, just like the Dismembered. A snake, an axe head, a mirror. And blood. A whole lot of blood.Patrese’s partner is a devout New Orleans native with a past she keeps private. By Selma Fawcett’s side, Patrese races in the footsteps of a serial killer who seems steeped in voodoo and linked to a priestess who practices her dark arts in the clear light of day—and the glare of the media. The more he learns about the victims and their connections, the more bizarre the case becomes. Then a veteran-turned-drug dealer takes him one step further, deep into a realm in which murder is only one kind of perversion.Patrese and Selma, traveling from the French Quarter to Natchez and the bayou, don’t realize they are out of time. A tide of corruption and secrecy is rising all around them. They are the tainted two good cops, targeted by a force more malevolent than any one before.",
  "genres": [
    "Crime",
    "Mystery",
    "Thriller",
    "Fiction"
  ],
  "author": "Daniel Blake",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/13259869-city-of-the-dead"
}