{
  "title": "The Amazon Legion",
  "description": "#4 in former U.S. Army Lieutenant Colonel Tom Kratman’s popular and relentlessly hard-hitting Carrera’s Legion military science fiction series. With male soldiers lured away, the planet Terra Nova raises a tough and gritty home-guard of women warriors to repel an invasion.The ruthless freedom fighter and liberator of Terra Nova, Patrick Carrera, believed he could rest with a local victory. But now Earth’s religious totalitarians intend to hold Carrera’s world as a nuclear hostage. It’s time to take the nuclear war to Earth. But those who remain must endure the brunt of Earth’s revenge attack and find a way to stand and defend. They are the old, the sick and the very young–all led by a battle-tested cadre of warrior women determined to save their planet from tyranny yet again.An amazing new chapter in former U.S. Army lieutenant-colonel Tom Kratman’s popular and relentlessly hard hitting Carrera series, a military science fiction masterpiece in the making.About Amazon “[I]nterplanetary warfare with. . .[a] visceral story of bravery and sacrifice. Series followers and fans of the military SF of John Ringo and David Webershould enjoy this SF action adventure.”– Library JournalAbout Tom Kratman’s Carrera’s Legions “Kratman's dystopia is a brisk page turner full of startling twists…[Kratman is] a professional military man…up to speed on military and geopolitical conceits.” –Best-selling author of America Alone Mark Steyn on Tom Kratman’s uncompromising military SF thriller, Califate“Kratman raises disquieting questions on what it might take to win the war on terror…realistic action sequences, strong characterizations and thoughts on the philosophy of war.” – Publishers Weekly",
  "genres": [
    "Science Fiction",
    "Military Fiction",
    "Military Science Fiction",
    "Fiction",
    "Alternate History",
    "Action"
  ],
  "author": "Tom Kratman",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/13260009-the-amazon-legion"
}