{
  "title": "I Am Jennie",
  "description": "Former porn star, reality TV personality, and blogger Jennie Ketcham presents a strikingly honest, disarming memoir about her descent into the emotionally numbing world of pornography and addiction and her path toward recovery.Drunk and high, holed up in a hotel room with a beautiful blonde she barely knew, Jennie Ketcham was thirty-six hours away from entering rehab. Her on-camera alter ego, Penny Flame, was a rising star. Her personal life, however, had been getting worse for years and finally hit an all-time low.Guys are gonna want one thing from you. To Jennie’s young ears, her father’s advice meant one You can use your sexuality to control men. Life was imploding around her parents’ divorce, their spiraling addictions, her deteriorating relationships with them. She lost her virginity at thirteen and began a game of initiating boys her age into manhood. For the fleeting moments she spent in bed with them, she got to be the center of attention.Eventually, Jennie found porn—that enticing world of immediate gratification, endless drugs, and seemingly endless money—and became Penny Flame. Divorced from her feelings, tempted into a lifestyle she couldn’t afford, financially or emotionally, she entered Sex Rehab with Dr. Drew to boost her career. But when Dr. Drew and his staff insisted she go by her real name, the once indestructible walls she had built around herself began to burn down.Two stories make up this direct and disarming that of a troubled girl desperately fleeing intimacy and herself, and that of a woman courageously breaking down emotional barriers to build a new life. Many will recognize Jennie’s confusing sex with self-worth, addiction with love, detachment with strength. Ultimately, I Am Jennie is a tale of a woman who considers herself a work in progress but who finally understands that the only person she can truly afford to be is herself.***I had never allowed myself to wonder why i ran from people, from connection, from what Dr. Drew was labeling as intimacy. I had never questioned why I habitually hurt the men I dated, or the people in my family. I had never Jennie, why are you doing this?In the past, I had simply acted, and then moved forward. If I felt like crying, I shut the emotions down. This quality made me a good porn star. But it suddenly didn’t seem like a great way to live.“It’s a wall,” I whispered.“What do you think is behind that wall?” Dr. Drew said.He looked directly in my eyes. The thought of something existing behind this impenetrable wall was horrifying, exhausting. I grabbed a Kleenex, thinking if I could make the perfect triangle, I could dab my inner eyes without disrupting the glue that held my fake eyelashes in place.“Hopefully, a caring, sensitive person who can have meaningful relationships,” I said.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "Sexuality",
    "Autobiography",
    "Sex Work",
    "Pornography"
  ],
  "author": "Jennie Ketcham",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/13260073-i-am-jennie"
}