{
  "title": "The 4 Disciplines of Execution: Achieving Your Wildly Important Goals",
  "description": "“ The 4 Disciplines of Execution is a book every leader should read.” —Clayton Christensen, Professor, Harvard Business School, and author of The Innovator’s DilemmaFor fans of Good to Great and The First 90 Days , The Four Disciplines of Execution is the foundational text for creating lasting organizational change. A #1 Wall Street Journal bestseller with more than 500,000 copies sold, The Four Disciplines of Execution will radically change your business.Do you remember the last major initiative you watched die in your organization? Did it go down with a loud crash? Or was it slowly and quietly suffocated by other competing priorities? By the time it finally disappeared, it’s likely no one even noticed. What happened?Often, the answer is that the “whirlwind” of urgent activity required to keep things running day-to-day devoured all the time and energy you needed to invest in executing your strategy for tomorrow. The 4 Disciplines of Execution can change that forever.The 4 Disciplines of Execution (4DX) is a simple, repeatable, and proven formula for executing your most important strategic priorities in the midst of the whirlwind. By following the 4 Disciplines—Focus on the Wildly Important; Act on Lead Measures; Keep a Compelling Scoreboard; Create a Cadence of Accountability—leaders can produce breakthrough results, even when executing the strategy requires a significant change in behavior from their teams.4DX is not theory. It is a proven set of practices that have been tested and refined by hundreds of organizations and thousands of teams over many years. When a company or an individual adheres to these disciplines, they achieve superb results, regardless of the goal. 4DX represents a new way to think and work that is essential to thriving in today’s competitive climate. The 4 Disciplines of Execution is one book that no business leader can afford to miss.",
  "genres": [
    "Business",
    "Leadership",
    "Nonfiction",
    "Productivity",
    "Self Help",
    "Management",
    "Personal Development"
  ],
  "author": "Chris McChesney",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/13260184-the-4-disciplines-of-execution"
}