{
  "title": "The Longest Way Home: One Man's Quest for the Courage to Settle Down",
  "description": "WITH AN IRREPRESSIBLE TASTE for adventure, candor, and a vivid sense of place, award-winning travel writer and actor Andrew McCarthy takes us on a deeply personal journey played out amid some of the world’s most evocative locales. Unable to commit to his fiancée of nearly four years—and with no clear understanding of what’s holding him back—Andrew McCarthy finds himself at a crossroads, plagued by doubts that have clung to him for a lifetime. Something in his character has kept him always at a distance, preventing him from giving himself wholeheartedly to the woman he loves and from becoming the father that he knows his children deserve. So before he loses everything he cares about, Andrew sets out to look for answers. Hobbling up the treacherous slopes of Mt. Kilimanjaro, dodging gregarious passengers aboard an Amazonian riverboat, and trudging through dense Costa Rican rain forests—Andrew takes us on exotic trips to some of the world’s most beautiful places, but his real journey is one of the spirit. On his soul-searching voyages, Andrew traces the path from his New Jersey roots, where acting saved his life—and early fame almost took it away—to his transformation into a leading travel writer. He faces the real costs of his early success and lays bare the evolving nature of his relationships with women. He explores a strained bond with his father, and how this complex dynamic shapes his own identity as a parent. Andrew charts his journey from ambivalence to confidence, from infidelity and recklessness to acceptance and a deeper understanding of the internal conflicts of his life. A gifted writer with an unsparing eye, Andrew relishes bizarre encounters with the characters whom he encounters, allowing them to challenge him in unexpected ways. He gets into peculiar, even dangerous situations that put him to the test—with mixed results. Disarmingly likable, Andrew is open, honest, and authentic on every page, and what emerges is an intimate memoir of self-discovery and an unforgettable love song to the woman who would be his wife.",
  "genres": [
    "Travel",
    "Nonfiction",
    "Memoir",
    "Biography",
    "Biography Memoir",
    "Autobiography",
    "Audiobook"
  ],
  "author": "Andrew McCarthy",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/13260188-the-longest-way-home"
}