{
  "title": "The Charge: Activating the 10 Human Drives That Make You Feel Alive",
  "description": "NEW YORK TIMES BESTSELLER. USA TODAY BESTSELLER. AMAZON BESTSELLER. #1 WALL STREET JOURNAL. #1 BARNES AND NOBLE.On a dark and steamy Caribbean night, Brendon Burchard stood bleeding atop the crumpled hood of his wrecked car. That night he learned about mortality, discovering that at the end of our lives we will all ask, “Did I live? Did I love? Did I matter?” Since that fateful night, Brendon has lived a fully charged life, and he’s helped millions of people around the globe transform their lives and feel more alive, engaged, and fulfilled. Brendon observes that the emotional energy of the world has flatlined, and he sets out to fix it. People are stressed, restless, and wanting more out of life. Despite the fact that most people have what they “need” to be happy, they rarely feel the levels of excitement, engagement, or satisfaction they deserve. So what’s the solution? In The Charge, Brendon argues that the only way to measurably improve the quality of your life is to learn how to activate the very 10 drives that make you most human. These drives are your desires for more control, competence, congruence, caring, connection, change, challenge, creative expression, contribution, and consciousness. These drives shape everything you think, feel, and do in life, so understanding and mastering them is critical to your success and happiness. Strategically activating these drives on a consistent basis is the fastest path to living a fully charged life. Harnessing our human drives is not easy; if it were, we wouldn’t see so much restlessness in the world. That’s why Brendon has devised what he calls the true “activators” of human experience—a series of powerful yet simple actions you can take to radically increase your levels of energy, engagement, and fulfillment in all areas of your life. What Brendon uncovers in The Charge will surprise and challenge you. It turns out that most of the ways we seek to meet our human drives are actually counterproductive. We all want more control, for example, but seeking to have more certainty in our daily lives or to control other people will actually decrease our levels of control (and happiness). We have a deep desire for change, too, but we often fail to make the right kinds of change that would make us feel more alive and in command of our lives. In The Charge, Brendon helps us overcome these mistakes and illuminates the path for strategically and intelligently activating our 10 human drives so that we can have the one thing we all want: more life in our lives! Brendon Burchard is the founder of High Performance Academy and author of the #1 New York Times and #1 USA Today bestselling book The Millionaire Messenger. He is also the author of Life’s Golden Ticket and one of the top motivation and high performance trainers in the world. His famous training events and videos inspire millions of people to find their charge, share their voice, and make a greater difference.",
  "genres": [
    "Self Help",
    "Personal Development",
    "Nonfiction",
    "Psychology",
    "Business",
    "Leadership",
    "Productivity"
  ],
  "author": "Brendon Burchard",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/13260177-the-charge"
}