{
  "title": "Mercury: An Intimate Biography of Freddie Mercury",
  "description": "Revealing and intimate, based on more than 100 interviews with key figures in his life, this is the definitive biography of Queen front man Freddie Mercury, one of pop music’s best-loved and most complex figures.As lead vocalist for the iconic rock band Queen, Freddie Mercury’s unmatched skills as a songwriter and flamboyant showmanship made him a superstar, and Queen a household name. But few people ever really glimpsed the man behind the glittering faÇade.      Mercury was the first major rock star to die from AIDS. Now, twenty years after his death, those closest to him are finally opening up about this pivotal figure in rock n’ roll. With unprecedented access to Mercury’s tribe, rock journalist Lesley-Ann Jones has crafted the definitive account of Mercury’s legendary life. Jones details Queen’s slow but steady rise to fame, and Mercury’s descent into dangerous, pleasure-seeking excesses. Jones doesn’t shy away from Mercury’s often colorful lifestyle—this was, after all, a man who once declared, “Darling, I’m doing everything with everyone.”     In her journey to understand Mercury, Jones traveled to London, Zanzibar, and India—talking with everyone from Freddie’s closest friends, to the sound engineer at Band Aid (who was responsible for making Queen louder than the other bands), to second cousins halfway around the world, an intimate and complicated portrait emerges. Meticulously researched, sympathetic yet not sensational, Mercury offers an unvarnished, revealing look at the extreme highs and lows of life in the fast lane.      Freddie Mercury will be the subject of a major motion picture titled Mercury, slated for 2012 production, produced by Graham King, starring Sacha Baron Cohen. This book is a key source for the film. Mercury is the most compelling, up-to-date portrait of an enigmatic entertainer who thrilled audiences around the world with a magnetism matched by few performers.",
  "genres": [
    "Biography",
    "Music",
    "Nonfiction",
    "Biography Memoir",
    "LGBT",
    "Audiobook",
    "Memoir"
  ],
  "author": "Lesley-Ann Jones",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/13260274-mercury"
}