{
  "title": "The Monster Hunters",
  "description": "Monster Hunter International, Monster Hunter Vendetta and Monster Hunter Alpha in one huge volume!  Two New York Times bestsellers in together for the first time, and the first three entries in Larry Correia’s blockbuster Monster Hunter series.Monster Hunter InternationalFive days after Owen Zastava Pitt pushed his insufferable boss out of a fourteenth story window, he woke up in the hospital with a scarred face, an unbelievable memory, and a job offer. It turns out that monsters are real. All the things from myth, legend, and B-movies are out there, waiting in the shadows. Officially secret, some of them are evil, and some are just hungry. On the other side are the people who kill monsters for a living. Monster Hunter International is the premier eradication company in the business. And now Owen is their newest recruit. It’s actually a pretty sweet gig, except for one little problem. An ancient entity known as the Cursed One has returned to settle a centuries old vendetta. Should the Cursed One succeed, it means the end of the world, and MHI is the only thing standing in his way. With the clock ticking towards Armageddon, Owen finds himself trapped between legions of undead minions, belligerent federal agents, a cryptic ghost who has taken up residence inside his head, and the cursed family of the woman he loves. Monster Hunter VendettaAccountant turned professional monster hunter Owen Zastava Pitt managed to stop the nefarious Old One’s invasion plans last year, but as a result made an enemy out of one of the most powerful beings in the universe. Now an evil death cult known as the Church of the Temporary Mortal Condition wants to capture Owen in order to gain the favor of the great Old Ones.The Condition is led by a fanatical necromancer known as the Shadow Man. The government wants to capture the Shadow Man and has assigned the enigmatic Agent Franks to be Owen’s full time bodyguard -- which is a polite way of saying that Owen is monster bait.  Fortunately, this bait is armed and very dangerous.Monster Hunter AlphaEarl Harbinger may be the leader of Monster Hunter International, but he’s also got a secret. Nearly a century ago, Earl was cursed to be werewolf. When Earl receives word that one of his oldest foes, a legendarily vicious werewolf that worked for the KGB, has mysteriously appeared in the remote woods of Michigan, he decides to take care of some unfinished business. But another force is working to bring about the creation of a whole new species of werewolf. When darkness falls, the final hunt begins, and the only thing standing in their way is a handful of locals, a lot of firepower, and Earl Harbinger’s stubborn refusal to roll over and play dead.",
  "genres": [
    "Urban Fantasy",
    "Fantasy",
    "Science Fiction",
    "Horror",
    "Fiction",
    "Paranormal",
    "Vampires"
  ],
  "author": "Larry Correia",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/13260260-the-monster-hunters"
}