{
  "title": "Die 27ste Stadt",
  "description": "Martin Probst lebt den amerikanischen Traum. Von den bescheidenen Anfängen im deutschen Viertel von St. Louis gelang dem Bauunternehmer mit Beharrlichkeit, Fleiß und Durchsetzungskraft der Aufstieg in die höchsten Kreise der Stadt im Mittelwesten der USA. Als Erbauer von \"The Arch\", dem monumentalen Wahrzeichen von St. Louis, genießt Probst höchstes Ansehen und wird von seinen Mitbürgern für seine Unbestechlichkeit, seine Integrität und seine Fairness ebenso bewundert wie für sein mustergültiges Familienleben. Erfolgreiche Typen wie Probst sind gefragt in St. Louis, denn die einst mächtige Metropole zehrt nur noch von den Träumen einer glorreichen Vergangenheit, während sie in der Gegenwart verzweifelt gegen den rasanten Niedergang und ihren zunehmenden Verfall ankämpft. Eine schlagkräftige Waffe gegen steigende Kriminalität und urbane Verwahrlosung glaubt Probst in der neuen Polizeichefin S. Jammu gefunden zu haben, auch wenn eher konservative Kreise daran zweifeln, ob die junge Inderin, ebenso gut aussehend wie ehrgeizig, die Richtige für den schwierigen Job ist. Doch selbst ihre Kritiker ahnen nichts von S. Jammus geheimen Plänen, die Macht in der Stadt an sich zu reißen -- ein Ziel, für das ihr jedes Mittel recht ist, vom Psychoterror bis zu terroristischen Anschlägen. Hemmungslos bedient sich Jammu dabei der versteckten Begierden und Schwächen ihrer Widersacher, um deren Ansehen zu schädigen und sie gegen einander auszuspielen. Für Probst, der sich trotz seines wachsenden Misstrauens nicht der unheimlichen Faszination Jammus entziehen kann, beginnt ein Albtraum, der ihn und seine Familie zu zerstören droht. Obwohl Jonathan Franzens erster Roman bereits 1988 in den USA erschien, wirkt Die 27ste Stadt irritierend aktuell und gegenwartsbezogen. Das hat einerseits sicher mit dem Thema Terrorismus zu tun, welches nicht nur Franzen bereits in den Achtzigern stark beschäftigte (man denke nur an Don DeLillos Mao II). Stärker noch beeindruckt Franzens rigorose Auseinandersetzung mit den Überfremdungsängsten der weißen amerikanischen Mittelklasse, die hier in beklemmender Form Realität annehmen. Fast schon exemplarisch führt der Autor vor, wie hinter der Fassade des schönen Scheins liberaler Normalität die ungebrochene Bereitschaft lauert, Macht und Besitz mit aller Gewalt zu erhalten. Die Angst vor den Fremden (die \"indians\" im Original sind bewusst doppelsinnig) erweist sich so als Spiegel der eigenen verdrängten Kolonialisierungsgeschichte: \"the indians are coming (back).\" Begeisterte Leser von Franzens Die Korrekturen erwartet in Die 27ste Stadt ein spannungsvoller, sehr dynamischer Roman, der im Vergleich zu seinem Nachfolger zuweilen etwas undiszipliniert und unnötig komplex erscheint, aber dennoch überzeugend Franzens schriftstellerisches Können unter Beweis stellt. --Peter Schneck",
  "genres": [
    "Fiction",
    "Novels",
    "Literary Fiction",
    "Literature",
    "Contemporary",
    "Unfinished",
    "American"
  ],
  "author": "Jonathan Franzen",
  "average_rating": "3.14",
  "url": "https://www.goodreads.com/book/show/1326076.Die_27ste_Stadt"
}