{
  "title": "Love Is Murder",
  "description": "Prepare for heart-racing suspense in this original collection by thirty of the hottest bestselling authors and new voices writing romance suspense today. Go on vacation with Allison Brennan's Lucy Kincaid, where she saves a man from drowning, only to discover he is in far greater danger on land. Meet Roxanne St. Claire's \"bullet catcher\"-bodyguard Donovan Rush-who may have met his match in the sexually charged \"Diamond Drop.\" Debut author William Simon shows us what happens when the granddaughter of the president of the United States is kidnapped. And Lee Child's pitch-perfect \"I Heard a Romantic Story\" puts a whole new spin on Love Is Murder.Bodyguards, vigilantes, stalkers, serial killers, women (and men!) in jeopardy, cops, thieves, P.I.s, killers-these all-new stories will keep you thrilled and chilled late into the night.Love Is Murder is the third Thriller anthology written exclusively by members of International Thriller Writers, Inc. Barely seven years old, ITW has a roster that reads like a who's who of thriller writing, with 1,635 members representing 28 countries worldwide and over three billion books in print. Headed by current copresidents Douglas Preston and Kathleen Antrim, its board of directors has included such notables as Lee Child, Tess Gerritsen, Steve Berry, James Rollins, M. J. Rose, Carla Neggers, Gayle Lynds, David Morrell and David Hewson. More information is available on the ITW website, www.thrillerwriters.org.SANDRA BROWNSandra Brown is the author of sixty New York Times bestselling novels. Writing professionally since 1981, she has published more than seventy novels and has upward of eighty million copies of her books in print worldwide.She holds an honorary doctorate of humane letters from Texas Christian University, and in 2008 she was named Thriller Master, the top award given by the International Thriller Writers Assoc.DIAMOND DROP by Roxanne St. ClaireCOLD MOONLIGHT by Carla NeggersPOISONED by Beverly BartonSPEECHLESS by Robert BrowneLOCKDOWN by Andrea KaneSPIDER’S TANGO by William SimonNIGHT HEAT by Laura GriffinB.A.D. MISSION by Sherrilyn KenyonDEADLY FIXATION by Dianna LoveHOT NOTE by Patricia RosemoorLAST SHOT by Jon Land & Jeff AyersGRAVE DANGER by Heather GrahamWITHOUT MERCY by Mariah StewartEVEN STEVEN by D.P. LyleDYING TO SCORE by Cindy GerardTHE NUMBER OF MAN by J.T. EllisonHARD DRIVE by Bill FloydAFTER HOURS by William BernhardtBLOOD IN, BLOOD OUT by Brenda NovakWED TO DEATH by Vicki HinzeTHE HONEYMOON by Julie KennerEXECUTION DOCK by James MacomberIN ATLANTIS by Alexandra SokoloffBREAK EVEN by Pamela CallowDIRTY DOWN LOW by Debra WebbBROKEN HALLELUJAH by Toni McGee CauseyHOLDING MERCY by Lori ArmstrongVACATION INTERRUPTED by Allison BrennanI HEARD A ROMANTIC STORY by Lee Child",
  "genres": [
    "Romance",
    "Anthologies",
    "Romantic Suspense",
    "Mystery",
    "Short Stories",
    "Suspense",
    "Fiction"
  ],
  "author": "Sandra       Brown",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/13261337-love-is-murder"
}