{
  "title": "Snakes in Suits: When Psychopaths Go to Work",
  "description": "Revised and updated with the latest scientific research and updated case studies, the business classic that offers a revealing look at psychopaths in the workplace—how to spot their destructive behavior and stop them from creating chaos in the modern corporate organization. Over the past decade, Snakes in Suits has become the definitive book on how to discover and defend yourself against psychopaths in the office. Now, Dr. Paul Babiak and Dr. Robert D. Hare return with a revised and updated edition of their essential guide. All of us at some point have—or will—come into contact with psychopathic individuals. The danger they present may not be readily apparent because of their ability to charm, deceive, and manipulate. Although not necessarily criminal, their self-serving nature frequently is destructive to the organizations that employ them. So how can we protect ourselves and our organizations in a business climate that offers the perfect conditions for psychopaths to thrive? In Snakes in Suits, Hare, an expert on the scientific study of psychopathy, and Babiak, an industrial and organizational psychologist and a leading authority on the corporate psychopath, examine the role of psychopaths in modern corporations and provide the tools employers can use to avoid and deal with them. Together, they have developed the B-Scan 360, a research tool designed specifically for business professionals. Dr. Babiak and Dr. Hare reveal the secret lives of psychopaths, explain the ways in which they manipulate and deceive, and help you to see through their games. The rapid pace of today’s corporate environment provides the perfect breeding ground for these \"snakes in suits\" and this newly revised and updated classic gives you the insight, information, and power to protect yourself and your company before it’s too late.",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Business",
    "Science",
    "Sociology",
    "Crime",
    "Philosophy"
  ],
  "author": "Paul Babiak",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/132615.Snakes_in_Suits"
}