{
  "title": "Kiss Me, Dancer",
  "description": "Alternate Cover Edition for ASIN B0066DU0NCA roller coaster of a romance between a divorced dad and a dance teacher. Dance instructor Casey Richardson takes an immediate dislike to the brash, arrogant Drew Byrne when he pulls his nine-year-old son out of her “silly” dance class. Still, she cannot help noticing his smoking hot body and bedroom eyes. A working class girl raised in the small fishing and farming community on Long Island’s rural North Fork, Casey knows all too well how easily a girl can get hurt by the notorious womanizing hunks that flourish on the South Fork in the Hamptons. Men like Drew Byrne. The last thing she needs is for him to be the only one who can save her from losing her dance academy, the dream she has worked so hard to turn into a reality.Remarrying is definitely off Drew’s list of things to do. As head of his Fortune 500 trucking company, he enjoys his wealth and has no problem keeping it a game with some of the world’s most beautiful women. So why should his son’s challenging, straight talking dance teacher get under his skin in a way no other female has? Sure, Casey Richardson has luminous brown eyes and a lean, taut body that drives him nuts, but he’s seen plenty in his day with the supermodels he is used to dating. He tells himself it is because Casey is the only one who was able to bring his shy, uncommunicative son out of his shell. But even that isn’t it. Bewildered, Drew decides he just might make use of those ridiculous psychic readings he won at North Cove’s Annual Fourth Of July Bazaar raffle. Little does he know the local psychic who donated the readings has taken off last minute for some trekking in Tibet —and Casey was swayed into substituting for her with phone readings to the anonymous winner. Add in a stint on a hit TV dance-off series, a cozy local coffee shop, a narcissistic rock star and a protective big brother to make KISS ME, DANCER a sexy, heartfelt and fun read.In addition to being part of today’s Indie author movement, Alicia and Roy Street are also traditionally published (under another penname). In 2009 they received a Daphne Du Maurier Award for Excellence in Mystery/Suspense.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Fiction",
    "Chick Lit",
    "Amazon",
    "Adult"
  ],
  "author": "Alicia Street",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/13261826-kiss-me-dancer"
}