{
  "title": "Main Street Vegan: Everything You Need to Know to Eat Healthfully and Live Compassionately in the Real World",
  "description": "Hollywood celebrities are doing it. Corporate moguls are doing it. But what about those of us living in the real world—and on a real budget? Author and holistic health practitioner Victoria Moran started eating only plants nearly thirty years ago, raised her daughter, Adair, vegan from birth, and maintains a sixty-pound weight loss. In Main Street Vegan, Moran offers a complete guide to making this dietary and lifestyle shift with an emphasis on practical “baby steps,” proving that you don’t have to have a personal chef or lifestyle coach on speed dial to experience the physical and spiritual benefits of being a vegan. This book provides practical advice and inspiration for everyone—from Main Street to Wall Street, and everywhere between. “Finally, a book that isn't preaching to the vegan choir, but to the people in the pews—and the ones who can’t fit in those pews. This is a book for the Main Street majority who aren’t vegans. Once you read this, you'll know it's possible to get healthy and enjoy doing it—even if you live in Paramus or Peoria.”—Michael Moore   “A great read for vegans and aspiring vegans.”—Russell Simmons    “Yet another divine gift from Victoria Moran. Main Street Vegan covers it all—inspiration, information, and out of this world recipes. This book is a gem.\"—Rory Freedman, co-author \nSkinny Bitch\n   “Main Street Vegan is exactly the guide you need to make changing the menu effortless. Victoria Moran covers every aspect of plant-based eating and cruelty-free living, with everything you need to make healthy changes stick.” —Neal Barnard, MD, president, Physicians Committee for Responsible Medicine, and NY Times bestselling author of 21-Day Weight Loss Kickstart   “A great book for anyone who's curious about veganism. It shows that not all vegans are weirdos like me.”—Moby",
  "genres": [
    "Vegan",
    "Nonfiction",
    "Food",
    "Health",
    "Cookbooks",
    "Nutrition",
    "Cooking"
  ],
  "author": "Victoria Moran",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/13262935-main-street-vegan"
}