{
  "title": "Terminal Monday, a Dream of New York City",
  "description": "It’s the fall of 2007, and Richard Burley is riding a losing streak. Not only is his marriage on rocky ground, but his writing career has devolved from co-writing one best seller thirteen years ago to writing freelance ad copy for brochures and radio commercials. And he has a dark secret; an under-the-table script doctoring gig he’s doing for some movie producers whose head writer is out on the picket line. The only thing keeping Richard sane is his rock opera, and even that might not be as healthy an outlet as he needs it to be, as it tells the story of a cartoonist who loses everything including his mind.Then one day, Richard runs into an ex-girlfriend who reminds him that he used to be an ambitious novellist, and introduces him to a group of fellow aspiring authors, which reawakens his desire to write fiction. However, his wife Kara becomes angry at him for associating with the woman who left him for the man who stole the rights to the book series he spawned, and, accusing him of infidelity, sends him packing.From there, Richard drifts from sofa to sofa and into the arms of one woman after another, trying desperately to reinvent himself and preserve the dwindling remains of his own self-respect, all the while fearing he is being haunted by the ghost of his not-dead, not-yet-ex-wife. He begins having real-life encounters with the characters of his various writing projects, even as the relationships with his friends are eroding. And his fear that the scab movie script project will be discovered finally comes true when he receives an email from an unhappy Edwin McKay, the author and head writer of the movie.Can Richard save his marriage, revive his writing career, avoid being blacklisted, stage his rock opera and keep his sanity, or will he lose everyone he loves and everything he has worked so hard to build for himself? And if he loses, will he be in any condition to tell the difference?",
  "genres": [],
  "author": "Lee Edward McIlmoyle",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/13264568-terminal-monday-a-dream-of-new-york-city"
}