{
  "title": "Forgive Me, Alex",
  "description": "Forgive Me, Alex by Lane DiamondEvolved Publishing presents an intimate look inside the mind of a killer, and of the man determined to end that killer, in this story of justice and vengeance, evil and redemption, fear and courage, love and loss. [DRM-Free]Forgive Me, Alex [Psychological Suspense Thriller]Two personalities, two attitudes, two goals, two methods--one darkness.Tony Hooper stands in shadow across the street, one amongst many in the crowd of curiosity-hounds gathered to watch a monster's release. Seventeen years after Mitchell Norton, the devil, terrorized Algonquin, Illinois on a spree of kidnapping, torture and murder, the authorities release the butcher from psychiatric prison.Tony longs to charge across the street to destroy Norton--no remorse--as if stepping on a cockroach. Only sheer force of will prevents his doing so.The devil walks the world again. What shall Tony do about it? Aye, what indeed.After all, this is what Tony does. It's who he is. The devil himself long ago made Tony into this hunter of monsters. What a sweet twist of fate this is, that he may still, finally, administer justice.Will FBI Special Agent Linda Monroe stop him? She owes him her life, so how can she possibly put an end to his?Two men are inexorably linked in the wake of devastation, ripped from the comfortable world they know and thrown into a dark place previously unimaginable. One is driven to evil, to seek a world where unfathomable misery and unbearable pain are the rules of the realm, where the look of death is upon all who practice the wicked craft, and it is a joyful grin, indeed. The other is driven to a gray path where he seeks merely to destroy such incomprehensible evil, to do what the law is not always able to do, to remove from the world the men who become monsters.What Others Are Saying About Forgive Me, Alex:\"Lane Diamond has succeeded in bringing to the surface the dark and horrifying mind of a psychotic serial killer while at the same time bringing forth the desperate need for humanity and justice for the victims and their families.\" - Marilou George - The Kindle Book Review\"Psychological thrillers are my kind of books! Not only do I write them, but truly enjoy reading one that makes my skin crawl, my nerves skitter with fear and my heart thump a tad louder. This incredible novel by Lane Diamond handed me ALL of that, in spades!\" - Ashley Fontainne, Author of \"Zero Balance (Eviscerating the Snake)\"\" FORGIVE ME, ALEX  is classified as a psychological suspense thriller, and  suspense  should really be bolded and italicized. There is a certain level of mastery a writer must possess in order to effectively build this kind of breathless expectation in a reader, and Diamond does just that.\" - Anne B. Chaconas\"This is a book to rival any of the great thrillers you've ever read and is a definite must read!\" -Kimberly Kinrade, Author of \"Forbidden Mind,\" \"Forbidden Fire\" and \"Forbidden Life\"\"You know you are reading a great book when you need to stop reading but keep telling yourself just one more chapter, then one more leads to half the book.",
  "genres": [
    "Thriller",
    "Mystery",
    "Suspense",
    "Mystery Thriller",
    "Crime"
  ],
  "author": "Lane Diamond",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/13264723-forgive-me-alex"
}