{
  "title": "Fiction 2000: Cyberpunk and the Future of Narrative",
  "description": "Will novels and stories be relevant in the next millennium, when the boundaries between illusion and reality, and observer and observed, may dissipate in a whirl of images, signals and data? This essay collection divines the prospects of fiction in the information age by examining cyberpunk literature. A movement less than a decade old, cyberpunk is driven by deep concerns about society, ethics, and new technology and has been defined as the literature of the first generation of science-fiction writers actually to live in a science-fiction world.These essays were first presented at the 1989 annual J. Lloyd Eaton Conference on Science Fiction and Fantasy Literature, the field's most prestigious international gathering. They address concerns common not only to cyberpunk and traditional science-fiction scholars, critics, and writers but to their counterparts outside the genre as well. Interdisciplinary in perspective, the essays consider the origins of cyberpunk, the appropriation of its conventions by the mass media, the literature's paradoxical retrogressive/iconoclastic nature, cyberpunk's affinities to and deviations from both traditional science fiction and postmodernist literature, the parameters and components of the cyberpunk canon, and the movement's future course.Some essays are theoretical, but all are grounded in works familiar to serious science-fiction readers: Neuromancer, Frontera, Deserted Cities of the Heart, Islands in the Net, Great Sky River, the Mirrorshades anthology, and others; cyberpunk TV and cinema like the Max Headroom programs, Blade Runner, and Tron; and precursory literature, including Frankenstein, Le Roman de l'avenir, Ralph I24C 41 +, and A Clockwork Orange. Useful for its views on a volatile science-fiction subgenre, Fiction 2000 is also valuable for what it tells us about the fate of mainstream literature.",
  "genres": [
    "Science Fiction",
    "Cyberpunk"
  ],
  "author": "George Edgar Slusser",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/1035979.Fiction_2000"
}