{
  "title": "Dark Return",
  "description": "Janie Grey is dedicated to hunting the undead, an inherited duty passed down from her Cherokee ancestors and generations of powerful Seekers before her. Then, there's Kai. He's like no one she's ever met - cocky, fast, skillful, infuriating and gorgeous. Not only has he become a valuable asset in her fight against the growing population of the vampire/demon hybrid known as Daychildren...She's unwittingly fallen for him. Just when Janie thinks she's learned everything there is to know about Kai's mysterious past, there's a newcomer to Baltimore. Someone who will do anything to make sure Janie loses Kai forever. Dark Return is the 2nd novel in the Seeker series. Find out what happens before the return in Dark Seeker (Seeker, #1) and Dark Beauty (Seeker, #0.5).“Get ready for a new breed of vampire slayers! Browning has created an intriguing world that promises many interesting surprises to come. A terrific start to a new urban fantasy.” —Artist Arthur, author of The Mystyx Novels\"YA fans of fresh, edgy urban fantasy are going to love Dark Seeker. Taryn Browning is a rising star. This is one author you'll want to keep your eye on as she shoots straight to the top of the charts!\" —Kari Lee Townsend, National Best Selling Author of The Samantha Granger Experiment & The Fortune Teller Mysteries\"Taryn Browning is a master writer. DARK SEEKER is thrilling and beautiful, and follows only one trend: good story-telling.\" —Brent Taylor, The Naughty Book Kitties\"Dark Seeker is an original and action-packed adventure that will leave you kicking and screaming for the next installment! With endearing characters, a breathtaking romance, fabulous world-building and a spectacular storyline, Dark Seeker will surely impress readers!\" --Shirley, Shiirleyy's Bookshelf\"Taryn Browning’s debut novel is a stunning addition to any paranormal romance lover’s library.\" --Tiffany, For Those About to Read\"This is a wicked tale! It's original and flows really well. There is great action, mystery, and Romance*yes I ment to capitalize that*. Everything works so well together. Well thought out and you don't have to make yourself believe any of it as your reading ... you just do. Get this AMAZING story NOW!\" --Heather, SupaGurl Books",
  "genres": [
    "Urban Fantasy",
    "Paranormal",
    "Young Adult",
    "Vampires"
  ],
  "author": "Taryn Browning",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/13265450-dark-return"
}