{
  "title": "The Stand In",
  "description": "Mystery set in 1957 Hollywood. If you were a studio mogul what would you do if you discovered your leading man was a serial killer? How do you protect your film? How do you protect your studio? And ... your leading lady? Louis Solomon, head of Centurion Studios, is deep in production on his very troubled wide-screen spectacular, “A Tale of Two Cities”. The picture is not even half done and is hemorrhaging money. This is largely due to the temperamental antics of the picture’s leading man, Rick DeNova. Riddled with drugs, extremely volatile, Rick has been the cause of a five-week shutdown for beating his leading lady and one-time lover, Lola Chandler, half to death. While she recovers, Louis must find the money to complete the picture and keep the truth away from the press. Unfortunately, this is precisely when Darren Cates, captain of the Ramparts Division of the LAPD, brings Louis the even more horrifying news that Rick is suspected in the strangulation murders of a series of blond starlets up in the Hollywood Hills. Luckily, Cates is being paid by Centurion to keep its stars out of trouble. But drugs and traffic violations are one thing – murder quite another. Louis must scramble to complete his picture, save his studio, and keep his leading lady alive. Enter Eddie Baines, a small-town actor from Texas, hungry for fame. Unluckily for him, he bears a striking resemblance to Mr. DeNova, which has prevented him from getting any parts. Why should the studios hire an ersatz Rick when the real one is working down the street? Even Eddie’s distinctive horseshoe-shaped cufflinks do not bring him the luck he needs. But when Rick’s photo double goes missing, Eddie is hired to replace him. Seeing the uncanny resemblance between Rick and Eddie, Solomon hatches a diabolical plan – if anyone in the press discovers that Rick might be linked to the murders Eddie will be blamed. The young Texan is the perfect foil and the perfect fall guy. But in Hollywood, as ever, nothing is as it seems.",
  "genres": [],
  "author": "Brad Geagley",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/13266174-the-stand-in"
}