{
  "title": "The Marshall Plan for Novel Writing",
  "description": "4TH EDITION – COMPLETELY REVISED & UPDATED This is the book which demystified novel writing for a massive audience, a groundbreaking international bestseller on the shelves of thousands of published authors. The Marshall Plan technique is the industry’s #1 go-to novel-writing method for anyone who wants to write a commercial novel—fast.In this unique guide, agent, editor and novelist Evan Marshall provides an easy-to-follow plan which simplifies the complex process of designing and writing successful commercial fiction. Now revised, this book includes these topics:\n\n   Choosing the perfect genre for you. \n  \n   Shaping your story idea . . . with Hollywood in mind. \n  \n   Developing strong main characters for your story. \n  \n   Word-length ranges for the most popular fiction genres and subgenres. \n  \n   NovelMaster, which takes the guesswork out of structuring your novel. \n  \n   How to interweave plots and subplots. \n  \n   How to lay out all of your novel’s scenes. \n  \n   Mastering the five fiction-writing modes. \n  \n   How to handle story research so it doesn’t slow you down. \n  \n   50 easy-to-implement fiction-writing techniques from the pros. \n  \n   A complete manuscript self-editing guide. \n  \n   How to format your manuscript for submission. \n  \n   How to approach agents and editors. \n  \n   Developing a fiction proposal, including the long and short synopsis. \n  \n   Self-publishing your novel. \n REVIEWS OF THE MARSHALL PLAN FOR NOVEL WRITING3.7 average rating, 440 ratings, 55 reviews, added by 954 people, 336 to-reads, 87% of people like it—Goodreads4.1 out of 5 stars (88 customer reviews)—Amazon“A down-to-earth approach to completing a novel.” —Boulder Planet“The Marshall Plan for Novel Writing is a master plan for aspiring novelists. Evan Marshall is brilliant.” —Bobbi Smith, New York Times bestselling author“A comprehensive manual to writing a novel for all writers—from the beginner to the more advanced looking for polishing tips. Savvy and concise.” —Bill Contardi, literary agent“Finally, a practical how-to manual for all aspiring authors, written with wit and wisdom. A delightful read!” —Maureen Walters, Vice President, Curtis Brown Literary Agency“An invaluable tool for the aspiring novelist. An upbeat, easy-to-follow guide that takes the mystery out of writing.” —Alicia Condon, Editorial Director: Fiction, Kensington Publishing“Evan Marshall has the scoop on making book—from beginning to end and everywhere in between.” —barnesandnoble.com ABOUT EVAN MARSHALL Evan Marshall is president of The Evan Marshall Agency, an independent literary agency which specializes in adult and young-adult fiction. He has held senior positions at Houghton Mifflin, Ariel Books, New American Library, Everest House and Dodd, Mead, where he acquired national and international bestsellers. The Marshall Plan For Novel Writing is now in its 4th edition. Evan is the author of 10 commercially published mysteries including Manhattan Mysteries and Jane and Winky Suburban Sleuths series, named “Miss Marple Lite” by Kirkus Reviews. His novels appeal to fans of Janet Evanovich, Lilian Jackson Braun, Agatha Christie and Alexander McCall Smith. To learn more about The Evan Marshall Agency, please visit www.evanmarshallagency.com. Visit his author page at www.evanmarshallbooks.com.",
  "genres": [
    "Writing",
    "Nonfiction",
    "Reference",
    "How To",
    "Self Help"
  ],
  "author": "Evan Marshall",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/1036000.The_Marshall_Plan_for_Novel_Writing"
}