{
  "title": "Time and Robbery",
  "description": "Time and Robbery features the protagonist of Ore's Centuries Ago and Very Fast , Vel, a gay immortal born in Paleolithic who jumps time at will. Unless Vel can help out his younger self, Vel's tribe's descendants—a big chunk of the 21st-century British population—will be eliminated from the timeline. Present-day Vel, though, has problems of his own, so he takes a chance and outs himself (and his talented teen-aged daughter Quince) to Joe Tavistock, a subcontractor on the weak end of the plausible deniability chain dangling off British intelligence, making it Joe’s problem. Joe's superiors are dubious, and Joe doesn't know who to trust. The stakes are high not just for Vel, but for everyone involved.Rebecca Ore's first book about Vel, Centuries Ago and Very Fast , was a finalist for the Philip K. Dick and the Lambda Awards. As Jeff VanderMeer wrote for Locus Online : “ Centuries Ago and Very Fast by Rebecca Ore (from the truly amazing Aqueduct Press) has a kinetic energy and hard-to-define originality that held me captivated from first word to last. Profane—scandalous?—the book wraps stories around stories, combines the surreal with the mundane and every-day.”Advance Praise“Rebecca is up to her old tricks surprising, puzzling, and delighting us at every turn; and in this sleek, lean detective tale, coolly twisting the tail of Time itself. Ore is that rarest of creatures, a writers' writer that readers also love.”—Terry Bisson, author of Fire on the Mountain and TVA BabyReviewsTime and Robbery is a daring new novel by one of the field's most capable writers. It features a gay immortal named Vel who can travel through time by sheer force of will, an ability he must use to travel back to his younger self to save his future descendents.—John DeNardo, Kirkus Book Reviews , February 29, 2012Time and Robbery shows that the wild idea behind Vel's origin and continued existence, with its mingled aspects of SF and Fae, can do more than survive through another tale. Thrown into a genuine plot, involved in both problem and solution, he loses none of his original quirky appeal.—Faren Miller, Locus Magazine , March, 2012",
  "genres": [
    "Science Fiction"
  ],
  "author": "Rebecca Ore",
  "average_rating": "3.27",
  "url": "https://www.goodreads.com/book/show/13265803-time-and-robbery"
}