{
  "title": "Blue Fire and Ice",
  "description": "An alternate cover for this ASIN can be found here.An Explanatory Apology Before You Read This BookThis is the first novel I completed. Even a month before I started writing Blue Fire and Ice it had never occurred to me write a teen or young adult novel, let alone a fantasy one. But, I had an idea and this is how it came out, and once I started writing it, the story told itself and the characters grew fully-formed from my head, like so many Athenas. I loved writing it. And it seems that adults have delighted in it as much as younger readers, which is rather a bonus.It took me about three weeks to write, pretty much day and night, and another couple to polish. Then I let the editor get hold of it, which was the most wretched thing I have ever experienced, but I survived. So did she, though I understand the convalescence was a long one.Never underestimate the stamina and stubbornness of a good editor.Originally it appeared in hardcover, with dust jacket and all the other bits of protection I could think of for something so precious, and with illustrations by a wonderful Canadian illustrator called Peter Ferguson. I love Peter's original illustrations; they are the direct descendants of the detailed, expressive, innocent illustrations of the 40s and 50s; children with open faces, unruly hair and mischievous, lively eyes. The bears are suitably big, furry and shaggy and the dogs are always bushy-tailed and bouncy. And the villains have great eyebrows.When it came to to the paperback and digital editions, though, I realised it actually wasn't the 1940s or 1950s and so decided that the book needed illustrations with a more contemporary edge. Fortunately, my book designer introduced me to the illustrator Steve Crisp, whose credentials are far too long to list here. The illustrations you see here are Steve's work. I did toy with the idea of trying to put both Steve's and Peter's at the start of the chapter but that's cheating. This is what the book is now, and that's how it will stay.It is still available in paperback, though most of the first print run has been sold and I decided it was more prudent to focus on the more ephemeral but less costly option of ebooks than to print more. But I do have to say that the real thing, with Steve's gorgeous illustration on the front and back, and a cover design by a clever and obliging book designer called Ian, does add a certain glow to your bookshelf...Anyway, what I started out to say was that for forty years I knew that Cervantes, Joyce, Faulkner, Eliot, Goethe, Stendhal, Yourcenar... well, you get the picture ... and all their cronies were making room in their celestial libraries for whatever I was going to write.Because I wrote Serious Literature.And then this popped out.So, I apologise if you wanted Something of Import and all you got was this. Though I've not given up on hearing the distant brittle sound of immortals chuckling.As for the story...This is a story about people and animals who never existed, and yet lived a long and happy life. This is a story full of magic and improbable things, and yet there are no practitioners of magic, no witches, no wizards and absolutely no warlocks. There are no pixies or elves, no ghoulies nor ghosties and certainly no more long-leggetty beasties than absolutely necessary. There are no zombies, no vampires, no werewolves and nowhere will you find a dragon - but that is only because I forgot her name and had to leave her out until I remember it.In the story you will find more heroes than you could shake a stick at, and just enough villains so that it needs more than a simple stout stick to defeat them. The heroes are much more modest and considerably more unassuming than those you meet in real life, yet they are, one and all, what every good hero needs to: indomitable - and occasionally not above a bit of tit-for-tat revenge. The villains are evil, as villains should be, though not as dangerous as they are off the page, running our world, wearing blindfolds instead of robber masks and wielding the weighing scales of coin like cudgels.There is silliness on the pages that follow, and as much nonsense as deep philosophical discourse allows. There is danger and drama, and tension, both high and low. There are oxymorons, contradictions, paradoxes, puzzles, riddles and conundrums. What there is most of, however, is a story.And it is waiting for you.Fanatsy and adventure for readers 12 to adultBlue Fire and Ice  is the first book in The Land's Tale.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Fiction"
  ],
  "author": "Alan Skinner",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/13268319-blue-fire-and-ice"
}