{
  "title": "Stranger in the Room",
  "description": "Fresh from her debut, Amanda Kyle Williams delivers a second thrilling Keye Street novel, perfect for fans of Karin Slaughter and Patricia Cornwell.\n\n\nThat bullet was meant for you.\n\n \n Summer is smoldering through Atlanta on Fourth of July weekend, as fireworks crack through the air and steam rises from the pavement on Peachtree. Private investigator and ex–FBI profiler Keye Street wants nothing more than a couple of quiet days alone with her boyfriend, Aaron—but, as usual, murder gets in the way.  \nI will find her.\n\n \n A.P.D. Lieutenant Aaron Rauser is called to the disturbing scene of the strangling death of a thirteen-year-old boy. Meanwhile, Keye must deal with not one but two of her own investigations: In the hills of Creeklaw County, there’s a curious case involving chicken feed and a crematorium, and in Atlanta, Keye’s emotionally fragile cousin Miki is convinced she is being stalked. Given Miki’s history of drug abuse and mental problems, Keye is reluctant to accept her cousin’s tale of a threatening man inside her house late one night. But as a recovering alcoholic herself, Keye can’t exactly begrudge a woman her addictions—especially since Miki drives Keye to near-relapses at every turn. And yet, Miki is family, and Keye must help her—even if it means tempting her own demons.  \nI always find her.\n\n \n All hell breaks loose when another murder—the apparent hanging of an elderly man—hits disturbingly close to home for Keye. And though the two victims have almost nothing in common, there are bizarre similarities between this case and that of Aaron’s strangled teen. Is there a single faceless predator, a calculating murderer targeting his prey at random? Only a skilled profiler like Keye Street can help the A.P.D. find him. With the threat of more deaths to come, Keye works on pure instinct alone—and soon realizes that a killer is circling ever closer to the people she loves the most.",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Suspense",
    "Crime",
    "Mystery Thriller",
    "Audiobook"
  ],
  "author": "Amanda Kyle Williams",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/13269085-stranger-in-the-room"
}