{
  "title": "Cooking with Master Chefs",
  "description": "In this companion volume to the PBS series \"Cooking with Master Chefs,\" Julia Child introduces sixteen of America's talented chefs from different parts of the country and interprets their recipes for the home cook. With the help of more than eighty color photographs we see the chefs at work in home kitchens and we learn the individual techniques that make their signature dishes so delicious -- and so workable. For -- from Charles Palmer (Aureole, New York), how to sear peppery venison steaks-- from Mary Sue Milliken and Susan Feniger (Border Grill, Santa Monica), how to make a spicy vegetarian feast-- from Emeril Lagasse (Emeril's, New Orleans), how to produce an authentic crab boil and a shrimp etoufee-- from Andre Soltner (Lutece, New York), how to cook traditional family dishes from Alsace-- from Jeremiah Tower (Stars, San Francisco), three innovative ways with chicken-- from Lidia Bastianich (Felidia, New York), the secrets of pasta and risotto-- from Patrick Clark (Hay-Adams Hotel, Washington, D.C.), new ways with fish -- fresh salmon as a roulade, grouper crusty with horseradish-- from Michel Richard (Citrus, Los Angeles), how to work with chocolate -- a mousse-filled dome, deep-fried chocolate truffles-- from Amy Ferguson-Ota (The Ritz-Carlton, Hawaii), the special flavors of island produce -- breadfruit, ti leaves, green papayas, wok-seared ono-- from Robert Del Grande (Cafe Annie, Houston), how to cook with chiles-- from Nancy Silverton (Campanile, Los Angeles), the trick of a grape starter that works magic on her crusty loaves-- from Jan Birnbaum (Campton Place, San Francisco), how to home-smoke salmon and roast sassafras-encrusted lamb-- from Jean-Louis Palladin (Jean-Louis at The Watergate, Washington, D.C.), the technique of roasting duck breasts in a fireplace-- from Alice Waters (Chez Panisse, Berkeley), celebrating the winter harvest in vegetable dishes and salads-- from Jacques Pepin (chef-at-large), making puff pastry and a freestanding souffleJulia Child writes in her Introduction that she's never known a serious cook or chef who didn't \"Every day I learn something new!\" \"That point of view,\" she says, \"turns home cooking and the pleasures of the table into a wonderful adventure.' So, appetit, and enjoy the adventures that this wonderful book provides.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Reference",
    "Food",
    "France",
    "Food and Wine",
    "Nonfiction"
  ],
  "author": "Julia Child",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/132690.Cooking_with_Master_Chefs"
}