{
  "title": "Julia and Jacques Cooking at Home: A Cookbook",
  "description": "Two legendary cooks invite us into their kitchen and show us the basics of good home cooking.Julia Child and Jacques Pépin are synonymous with good food, and in these pages they demonstrate techniques (on which they don’t always agree), discuss ingredients, improvise, balance flavors to round out a meal, and conjure up new dishes from leftovers. Center stage are carefully spelled-out recipes flanked by Julia’s and Jacques’s comments—the accumulated wisdom of two lifetimes of honing their cooking skills. Nothing is written in stone, they imply. And that is one of the most important lessons for every good cook.So sharpen your knives and join in the fun as you learn to make: • Appetizers: from traditional and instant gravlax to your own sausage in brioche and a country pâté• Soups: from New England chicken chowder and onion soup gratinée to Mediterranean seafood stew and that creamy essence of mussels, billi-bi• Eggs: omelets and “tortillas”; scrambled, poached, and coddled eggs; eggs as a liaison for sauces and as the puffing power for soufflés• Salads and Sandwiches: basic green and near-Niçoise salads; a crusty round seafood-stuffed bread, a lobster roll, and a pan bagnat• Potatoes: baked, mashed, hash-browned, scalloped, souffléd, and French-fried• Vegetables: the favorites from artichokes to tomatoes, blanched, steamed, sautéed, braised, glazed, and gratinéed• Fish: familiar varieties whole and filleted (with step-by-step instructions for preparing your own), steamed en papillote, grilled, seared, roasted, and poached, plus a classic sole meunière and the essentials of lobster cookery• Poultry: the perfect roast chicken (Julia’s way and Jacques’s way); holiday turkey, Julia’s deconstructed and Jacques’s galantine; their two novel approaches to duck• Meat: the right technique for each cut of meat (along with lessons in cutting up), from steaks and hamburger to boeuf bourguignon and roast leg of lamb • Desserts: crème caramel, profiteroles, chocolate roulade, free-form apple tart—as you make them you’ll learn all the important building blocks for handling dough, cooking custards, preparing fillings and frostings• And much, much more . . .Throughout this richly illustrated book you’ll see Julia’s and Jacques’s hands at work, and you’ll sense the pleasure the two are having cooking together, tasting, exchanging ideas, and raising a glass to savor the fruits of their labor. Again and again they demonstrate that cooking is endlessly fascinating and challenging and, while ultimately personal, it is a joy to be shared.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction",
    "Foodie",
    "Reference",
    "France"
  ],
  "author": "Julia Child",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/132691.Julia_and_Jacques_Cooking_at_Home"
}