{
  "title": "A New Orleans Christmas",
  "description": "\"...Ms. Bacio sets the pages ablaze in this sexy Christmas tale featuring two irresistible characters from her The Vampire, The Witch & The Werewolf series. There's nothing better on a cold winter's night than cozying up with the vampire and the werewolf as they come together in this sizzling story. This is my Christmas present to myself.\"--Rebecca Leigh, author of Dirty HousewivesVampires and werewolves don't mix ... or do they?Before there were three, there were two. When a vampire swoops in to save Trevor from a rogue gang's blood sport, the werewolf must fight his own inhibitions. The magic of New Orleans and the holiday season bring together these two unlikely lovers.LOOKING FOR MORE… in Fantastica? Check out these spellbinding titles from Ravenous Romance!PHOENIX BURNING by Jocelyn MichelKristy Tremaine is cursed with a four times a year, she goes up in flames and rises from the ashes in a new, smoking body. This keeps her sex life at high heat, but when she falls in love with a hot doctor with his own secrets, will he know it's her, or just another flame? Find out in this story that will have you engulfed in sizzling passion!THE SECRET, THE SHIFTER, AND THE SEX-SLAVE SHANGHAI by Melanie ThompsonAll single Mom Alexandra St. Cloud wanted was a night out on the town, and ended up on a trip around the world as a pleasure slave. An unlikely team--a shape-shifting U.S. Marshal and a vampire with a flair for flamenco--just might be able to save her, and with any luck, offer her the kind of love she's been missing.KONA WARRIOR by Courtney SheetsOn the Kona coast of Hawaii, recently heartbroken Gloria finds herself at the foot of a devastatingly handsome ancient warrior--a shark god come to land to protect her family. Will their love take a bite out of the curse that has him bound to the sea? Or will this shark warrior be forced to circle the waters of true love forever?SEX THROUGH THE ZODIAC by Neve BlackRoxanne makes a New Year's resolution she'll have no trouble get to know one man of every zodiac sign in the coming year on an astronomical level. Will the stars align with one of these 12 men? Or will Roxanne end up reading her horoscope alone?FANTASTICA ANTHOLOGY edited by Rachel KenleyAre your darkest desires not of this world? Whether your greatest fantasy gets its power through traveling through time, tying up a werewolf and making him a good dog, or seducing your professor with dark magic, this Fantastica Anthology is for you! THE VIRGIN SHIFTER by Melanie ThompsonVampire hunter and deeply sexy panther shape-shifter Jax Sequeros has a to save his partner and protect hunky Russian sex slave Michelle from the fang-toothed gang that is hunting him down. Sworn to carry on his ancient bloodline, Jax finds himself in love with someone who can't help him...Michelle!",
  "genres": [
    "Romance",
    "Vampires",
    "Paranormal",
    "M M Romance",
    "Erotica",
    "Shapeshifters"
  ],
  "author": "Louisa Bacio",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/13269772-a-new-orleans-christmas"
}