{
  "title": "Putri Hujan & Ksatria Malam",
  "description": "Saat itu musim gugur di San Fransisco, Amerika. Ia melenggang ringan melintasi Union Square. Bersemi dalam kehidupan barunya.Lalu dirinya bertemu dengan sang pangeran dari masa lampau.Memori 2 tahun yang telah membeku, kembali berpendar diantara kepulan uap panas Hot Cappucino, minuman yang tidak pernah disentuhnya sejak ia hengkang dari komunitas Bintaro Lakeside...The Lady RainSisy Iswandaryo pernah memiliki kenangan manis--dan lucu. Tapi itu dulu. Dan sekarang semua telah berubah. Satu hal yang tetap sama adalah ia masih sangat menyukai hujan!The Night WarriorDiaz Hanafiah hanya menjalani hidup normalnya, termasuk ketika dirinya bertunangan dengan Maifreya. Tapi, pertemuannya dengan Sisy mengguncang kebulatan akal sehatnya. Dan ketika tragedi berdarah menimpa dirinya, ia harus berjuang untuk hidup--dan menjadi pelindung putri hujannya. Sekali lagi.The Determined CrusaderFinist von Suttonheim bertolak dari Italia, ingin mengambil miliknya kembali: si mungil Sisy--sahabat masa kecilnya di Wina. Tapi kini ia berhadapan dengan rival yang amat mengganggu. Serangga pengganggu, baginya. Mungkin saatnya kini ia menarik pelatuk dan menegaskan siapa yang paling berkuasa.The Fallen Angel“I choose my friends for their good looks, and my enemies for their good intellects.” Begitu kata Adry Kielsten. Ia dan Diaz sudah saling kenal baik sejak keduanya masih kecil. Menurut para sepupu Hanafiah, mereka adalah satu jiwa yang terbagi dua. Namun, kini Adry tidak pernah menyangka akan bertemu Diaz lagi dalam skala ambisi dan intelegensia yang setara dengan dirinya.The Wavering ShadowSan Fransisco mungkin bisa membuat Chris Hanafiah benar-benar melupakan masa lalu yang pahit. Lagipula ia ingin membantu bisnis yang dimotori Diaz. Tetapi di sana ia malah bertemu Kayo Kilpatrick--atau Kaminari Kayo--sepupu dari rival imajinernya masa SMA, Kaminari Kei. Dan Kei tidak akan membiarkan sepupunya bersama laki-laki yang telah membiarkan Aki meninggal.",
  "genres": [
    "Romance",
    "Fiction",
    "Indonesian Literature",
    "Young Adult",
    "Novels",
    "Contemporary",
    "Fantasy"
  ],
  "author": "Sitta Karina",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/1327076.Putri_Hujan_Ksatria_Malam"
}