{
  "title": "Metamorphosis",
  "description": "H.E.R.O. - Metamorphosis kicks off the most extensive, continuous and ongoing superhero series of the last decade, if not longer! This novel is a standalone book, but it introduces the new world, the city of Metrocity, and the core heroes involved in over 1.7 million words throughout the series. It functions much like a television series or comic book series, with intertwining plots and characters throughout.H.E.R.O. - Metamorphosis follows the story of three people - Stephanie, Lance, and Rael. They find they are changed into supers, along with others in Metrocity, when a meteor shower unleashes radiation above the city. The friends discover that they become a psychic, a brick, and a mutant. They must cope with the changes to their everyday life, friends and college as they discover the new powers at their disposal. In the midst of trying to become heroes and dealing with the changes to their normal lives, a mutant villain captures many new supers in a bid to build an army for herself.The H.E.R.O. series is a new supers universe of heroes and villains. As a novel-based story forum, it allows for deeper character development than that of a comic book or graphic novel based story.At the current point in the universe, supers have existed for about twenty five years. The H.E.R.O. organization - the Homeland Extraordinary Response Organization - allows for a loosely operated environment for the heroes to operate without being vigilantes. The common super types include Psychics, Blasters, Bricks and Mutants, although some crossover occurs in unusual individuals. Psychics generally gain mental powers, such as telepathy, telekinesis, or emotional powers. Blasters have the ability to generate or control an element or waveform, such as light, electricity, or heat. Bricks are the strongmen of the world, having massive strength and bodies that can sustain immense damage. Mutants appear less human in appearance due to the addition of blades, tentacles, fins, wings, tails, and more to their bodies, and are between a brick and the others in physical strength.H.E.R.O. - Metamorphosis is a full length novel of approximately 122,000 words. Please visit the author's website for more information on characters and character images. (kevinrau.com)The current books in the H.E.R.O. series - Metamorphosis (Book 1)H.E.R.O. - New Markets (Book 2)H.E.R.O. - Rise and Fall (Book 3)H.E.R.O. - Dark Research (Book 4)H.E.R.O. - Horde (Book 5)H.E.R.O. - Paragon (Book 6)H.E.R.O. - Illustrated GuideH.E.R.O. Shorts - Gatecrasher (Book 7)H.E.R.O. Shorts - Silverlash (Book 8)H.E.R.O. - Gene Front (Book 9)H.E.R.O. - Incursion (Book 10)H.E.R.O. - Dolldrum (Book 11)H.E.R.O. - Malice (Book 12)H.E.R.O. - Dark Breach (Book 13)H.E.R.O. - Nightmonger (Book 14)H.E.R.O. - Battlefronts (Book 15)H.E.R.O. - Riftguard (Book 16)H.E.R.O. - Augments (Book 17)H.E.R.O. - Summoned (Book 18)H.E.R.O. - Bio-Organism (Book 19) - coming soon",
  "genres": [
    "Superheroes",
    "Science Fiction",
    "Action",
    "Young Adult",
    "Speculative Fiction",
    "Science Fiction Fantasy",
    "Fiction"
  ],
  "author": "Kevin Rau",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/13271678-metamorphosis"
}