{
  "title": "The Seven Spiritual Laws for Parents: Guiding Your Children to Success and Fulfillment",
  "description": "The Seven Spiritual Laws of Success was a phenomenon that touched millions of lives. Its author, Deepak Chopra, received thousands of letters from parents who expressed the desire to convey the principles they had learned to their children, along with questions about how to do so.The Seven Spiritual Laws for Parents is Dr. Chopra’s answer to those parents who wish to raise children with values that satisfy spiritual needs as well as create the experience of abundance. Exploring specific ways to practice the Seven Spiritual Laws as a family, Chopra explains how to convey these laws to children, and how to embody them in age-specific activities each day.The Seven Spiritual Laws for Parents moves us beyond a focus on private triumphs and failures to experience the spiritual nature of communion with family, to share with those closest to us the infinite riches of innocence and love.The deepest nurturing you can give your child is spiritual nurturing.There are seven simple sayings that can have a profound impact on your child’s life.• Everything is possible.• If you want to get something, give something.• When you make a choice, you change the future.• Don’t say no—go with the flow.• Every time you wish or want, you plant a seed.• Enjoy the journey.• You are here for a reason.Raised with these insights, every child can obtain the success that comes from having the most valuable skills anyone can the ability to love and have compassion, and the capacity to feel joy and spread it to others. In this essential work for every parent, Deepak Chopra reflects on his experiences as a father as well as his own spiritual journey and offers profound and practical ways for sharing these principles with your children.Also available as a Random House AudioBook",
  "genres": [
    "Parenting",
    "Nonfiction",
    "Spirituality",
    "Self Help",
    "Psychology",
    "Audiobook",
    "Childrens"
  ],
  "author": "Deepak Chopra",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/132723.The_Seven_Spiritual_Laws_for_Parents"
}