{
  "title": "The Secret Language of Eating Disorders",
  "description": "Peggy Claude-Pierre's revolutionary eating disorders program at the Montreux Counselling Centre near Victoria, BC, takes only those who are near death and have tried all other channels. Her unique treatment methods have offered new hope to sufferers and their families. After Peggy Claude-Pierre treated her own two anorexic daughters successfully, she became convinced that anorexia is a symptom of a larger problem -- that of a damaged self -- and not a disease. Heal the wounds within, and eating will begin again, naturally.Unlike any hospital or clinic in the world, Peggy Claude-Pierre's methods have cured every one of these \"patients of last resort.\" Her experience allows her to show why conventional wisdom's explanations and treatment for eating disorders have been so ineffective. Peggy brings a fresh perspective to both diagnosis and treatment -- one that finally explains its prevalence, the steps necessary to reverse it and ways to prevent the recidivism that plagues so many other treatment methods.Peggy Claude-Pierre's program has gathered admiration from many quarters for its long-term success. Because of great demand, her clinic is now forging relationships with hospitals and clinics around the world and her program is attracting media attention.Peggy has already made several \"Oprah\" appearances, most recently with an anorexic woman who had just entered her clinic. Oprah has committed to doing a follow-up program this fall to chart the woman's progress. Last year a \"2020\" show on Peggy and the clinic achieved the highest viewer response ever in the show's history. In addition, Peggy's story has become an international phenomenon, with rights sold in five countries and more auctions pending.The Secret Language of Eating Disorders promises to revolutionize the way eating disorders are viewed and treated, and perhaps will save more than a few lives along the way.As part of their therapy, Peggy has her patients illustrate their relationship with anorexia. These are examples of their art as well as excerpts from the thousands of letters Peggy receives annually.",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Self Help",
    "Mental Health",
    "Health",
    "Mental Illness",
    "Reference"
  ],
  "author": "Peggy Claude-Pierre",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/13274115-the-secret-language-of-eating-disorders"
}