{
  "title": "Frantz Fanon: A Biography",
  "description": "Born in Martinique, then as now a departement of France, Frantz Fanon (l925-61) trained as a psychiatrist in Lyons before taking up a post in colonial Algeria. He'd already experienced racism as a soldier in the Free French Army, for which he'd volunteered & in whose ranks he saw combat during France's liberation. In Algeria, he came into contact with the Front de Liberation National whose struggle for an independent Algeria was met with exceptional violence by the French Army. He identified with the FLN, becoming a marked man. Forced to flee Algeria when he resigned his post, He subsequently worked with the FLN as a propagandist & ambassador. Based on extensive original research, this is the most complete & objective biography of Fanon yet written. It sweeps away the myths that have grown up around him & reveals Fanon to be a complex figure, more interesting than the theorist of anti-colonial violence celebrated by the left in the 60s. Macey shows Fanon to have been a man formed in the context of the French Caribbean, with its history of slavery & racism, & traces his intellectual career as a political thinker & psychiatrist with great care, setting it against the background of post-war French culture. Macey has done justice for the 1st time to the extraordinary life of a complex figure, flawed in some respects but fundamentally a humanist committed to the eradication of colonialism, a man whose angry & eloquent writings remain relevant.AcknowledgementsAbbreviationsForgetting Fanon, remembering FanonNative son An tan robè Dr. Frantz Fanon 'Black skin, white masks' In Algeria's capital of madness The explosionExile 'We Algerians' The year of Africa The wretched of the earthEndgameAfterwordNotesBibliographyIndex",
  "genres": [
    "Biography",
    "History",
    "Philosophy",
    "Nonfiction",
    "Politics",
    "Africa",
    "Psychology"
  ],
  "author": "David Macey",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/1327695.Frantz_Fanon"
}