{
  "title": "The Zen of Creativity: Cultivating Your Artistic Life",
  "description": "For many of us, the return of Zen conjures up images of rock gardens and gently flowing waterfalls. We think of mindfulness and meditation, immersion in a state of being where meaning is found through simplicity. Zen lore has been absorbed by Western practitioners and pop culture alike, yet there is a specific area of this ancient tradition that hasn’t been fully explored in the West. Now, in The Zen of Creativity, American Zen master John Daido Loori presents a book that taps the principles of the Zen arts and aesthetic as a means to unlock creativity and find freedom in the various dimensions of our existence. Loori dissolves the barriers between art and spirituality, opening up the possibility of meeting life with spontaneity, grace, and peace.Zen Buddhism is steeped in the arts. In spiritual ways, calligraphy, poetry, painting, the tea ceremony, and flower arranging can point us toward our essential, boundless nature. Brilliantly interpreting the teachings of the artless arts, Loori illuminates various elements that awaken our creativity, among them still point, the center of each moment that focuses on the tranquility within; simplicity, in which the creative process is uncluttered and unlimited, like a cloudless sky; spontaneity, a way to navigate through life without preconceptions, with a freshness in which everything becomes new; mystery, a sense of trust in the unknown; creative feedback, the systematic use of an audience to receive noncritical input about our art; art koans, exercises based on paradoxical questions that can be resolved only through artistic expression. Loori shows how these elements interpenetrate and function not only in art, but in all our endeavors.Beautifully illustrated and punctuated with poems and reflections from Loori’s own spiritual journey, The Zen of Creativity presents a multilayered, bottomless source of insight into our creativity. Appealing equally to spiritual seekers, artists, and veteran Buddhist practitioners, this book is perfect for those wishing to discover new means of self-awareness and expression—and to restore equanimity and freedom amid the vicissitudes of our lives.From the Hardcover edition.",
  "genres": [
    "Art",
    "Nonfiction",
    "Buddhism",
    "Zen",
    "Spirituality",
    "Photography",
    "Philosophy"
  ],
  "author": "John Daido Loori",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/103622.The_Zen_of_Creativity"
}