{
  "title": "Vengeance: The True Story of an Israeli Counter-Terrorist Team",
  "description": "Vengeance is a true story that reads like a novel. It is the account of five ordinary Israelis, selected to vanish into \"the cold\" of espionage secrecy -- their mission to hunt down and kill the PLO terrorists responsible for the massacre of eleven Israeli athletes at the Munich Olympics in 1972.This is the account of that secret mission, as related by the leader of the group -- the first Mossad agent to come out of \"deep cover\" and tell the story of a heroic endeavor that was shrouded in silence and speculation for years. He reveals the long and dangerous operation whose success was bought at a terrible cost to the idealistic volunteer agents themselves.\"Avner\" was the leader of that team, handpicked by Golda Meir to avenge the monstrous crime of Munich. He and his young companions, cut off from any direct contact with Israel, set out systematically to find and kill the central figures of the PLO's Munich operation, tracking them down wherever they lived.The mechanics, the horror, the day-by-day suspense of what they did surpass by far anything John le Carré or Robert Ludlum could imagine, as they themselves were tracked in turn (and some killed) by PLO assassins, changing identities constantly, moving from country to country, devoting their young lives to the brutal task of vengeance.Vengeance is a profoundly human document, a real-life espionage classic that plunges the reader into the shadow world of terrorism and political murder. But it goes far beyond that, to explore firsthand the feelings of disgust and doubt that gradually came to torment each member of the Israeli team, and that in the end inexorably changed their view of the mission -- and themselves.Vengeance opens a window onto a secret world, a book that at the same time inspires and horrifies. For its subject is an act of revenge that goes to the very heart of the ancient biblical questions of good and evil.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "Terrorism",
    "Espionage",
    "Military Fiction",
    "War"
  ],
  "author": "George Jonas",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/132779.Vengeance"
}