{
  "title": "One Voice Raised: A Triumph Over Rape",
  "description": "2013 ELit Bronze Medal Winner-True Crime One Voice A Triumph Over Rape At 3:15 am on the morning of August 21, 1988, an unknown assailant climbed onto the 2nd floor balcony of my home and entered through a sliding glass door. He crept through the house and down the stairs. He entered my ground floor bedroom and hid in the shadows. When I came into my bedroom from the bathroom, he grabbed me and locked me in a bear-hug. I felt something being wound tightly around my neck and something was being stuffed into my mouth. I couldn't breathe. I never saw the face of the man who assaulted and raped me that night. I never believed he would be caught. I spent 20 years wondering who he was, how many other women he had raped and when he would strike again. If not for the dogged determination of Chief Investigator David Cordle, of Anne Arundel County, in Annapolis, Md, my case would never have been solved. With the help of a grant from the government to re-test cold case evidence and the advances of forensic science, a suspect was found and arrested in November of 2009. Beginning in 2010, after my case went to trial, Dave Cordle and I began sharing this story in the book we wrote- One Voice Raised, A Triumph Over Rape. We have been invited to speak at many conferences, schools, police departments and awareness organizations in the United States and Canada. My message is one of hope; hope for survivors and their families to believe in their strength and the goodness of others. There is no doubt that being raped changed my life. Having my case solved and finally seeing the face of my attacker in the courtroom was extremely empowering for me. Hearing the \"Guilty\" verdicts on January 13, 2010 helped me to realize I am much stronger than I give myself credit for. In our presentations, I speak about my experience as a rape victim and the years of rebuilding my life and how I found a way to make the passage from thinking of myself as a victim of rape to calling myself a survivor. Dave Cordle illuminates the process of assembling the puzzle pieces that led to the arrest and prosecution of one of his longest open cases. ------------------------------------------- Since publication of One Voice Raised, 2 more victims have been linked through DNA to serial rapist, William Joseph Trice. *May 31, 1987 in Montgomery County, Maryland. *August, 1988 in Silver Springs, Maryland \"It brings peace of mind to Trice's victims to know their attacker has been caught and convicted. The importance of entering cold-case evidence into the national data-base can not be stressed enough.\"",
  "genres": [
    "Biography Memoir"
  ],
  "author": "Jennifer A. Wheatley-Wolf",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/13280195-one-voice-raised"
}