{
  "title": "Taken",
  "description": "\"An amazing new vampire series! Don't miss it!\" --Morgan Rice, #1 Bestselling author of THE VAMPIRE JOURNALS TAKEN is book #2 of the Bestselling series THE VAMPIRE LEGENDS, following SWORN (Book #1) which has over 45 five star reviews and is available as a FREE download on Amazon! In TAKEN (Book #2 of the Vampire Legends), Rachel Wood finally learns the secret that her new boyfriend, Benji, has been he is a vampire. But Rachel refuses to believe it. Thinking he is crazy, she runs from him, and resolves to never see him again. But despite herself, Rachel can’t stop thinking of him. As he comes to her in her dreams, Rachel can’t help wondering if maybe, just maybe, it is all true. Meanwhile, Rachel is back in high school, the day after her dreaded homecoming dance, and is left to deal with the fallout of the brawl. Rob’s football friends were injured, but that doesn’t stop Rob from falling for Rachel all over again. And despite herself, she realizes that she just might still have feelings for him, too. Rachel’s social pressures build from her group of friends, and she is forced to lie to her parents, and sneak out, in order to get out of being grounded and have any social life. Her sister, Sarah, covers for her, as those two start to develop a deeper bond. But problems only escalate for Rachel, as Benji comes back into her life, bringing danger with him. She discovers his world at his ancestral home in the mysterious Lyndvia Castle on the Hudson River. But just as their romance is blossoming, Benji’s twin brother shows up with a message that just might mean the end for all of them. Rachel will have to decide just how much she wants to sacrifice to be with the love of her life. TAKEN is book #2 of the Vampire Legends series (following Book #1, SWORN), yet is also a stand alone novel. Books #3==#6 in the series are now also available.",
  "genres": [
    "Vampires",
    "Young Adult",
    "Paranormal",
    "Fantasy",
    "Romance",
    "Paranormal Romance",
    "Supernatural"
  ],
  "author": "Emma Knight",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/13281545-taken"
}