{
  "title": "The Dragoneers",
  "description": "\"This novel defies conventional classification: is it science fiction? biblical fiction? thriller? The story describes a world where flying two-headed dragons and ogres exist, characters with telepathic gifts communicate with both animals and people, a man named Noah builds an Ark in his backyard, and a six-fingered giant named Lilith wants to take over the world. While this collage may have been implausible in lesser hands, the author makes it work, artfully drawing readers into Sethopolis (the \"center of the last human-dominated nation on Earth\") and constructing an adventure with attention-grabbing plot twists. at the center of it all is 18-year old Susah, a feisty heroine with the ability to communicate telepathically. Sheltered by her father, Noah, from the evils of the world, Susah's life takes an unexpected turn when her aunt and uncle are killed by a violent street gang. Mesmerized by the soldier who rescues her and the flying dragon under his control, she decides to join the Dragoneer Corps, defenders of the Eden zone, and become a dragoneer. Lilith, aware of Susah's gifts, wants to have her killed. As Susah trains to become a skilled dragoneer, she embarks on a collision course with Lilith's army of giants and ogres as they march toward the Eden zone for the ultimate battle between good and evil...\" --------THE DRAGONEERS is a coming of age story about Susah, a talented young woman, who refuses to join her three brothers in helping her father advance the family business. She wants to do something exciting with her life. While this story could have been set in any time, the fantastical world she lives in amplifies each step nearly beyond the bounds of imagination.This adventure builds on the little we know about the antediluvian world and overlays it with a blend of technology, supernatural powers, fire-and-ice-breathing, flying dragons, giants, and martial arts to begin Susah’s adventure to discover herself. Climb aboard and hang on for the ride of your life.This 100,000 word, Genesis-based epic fantasy will attract those interested in speculative fiction, especially about the antediluvian world, and will also appeal to readers of contemporary fantasy as well as military fiction. Originally published November 29, 2011; the revised 2nd edition of August 18, 2014 is a literary renovation, bringing the book unto the mechanical presentation standards of the rest of the series. Only the 2nd edition is available for Kindle, Nook, and iBooks.",
  "genres": [
    "Fantasy",
    "Dragons",
    "Paranormal",
    "Fiction",
    "Christian Fiction",
    "Science Fiction"
  ],
  "author": "C.D. Sutherland",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/13281290-the-dragoneers"
}