{
  "title": "Voyage of the Dead Introductory First Look",
  "description": "The Zombie Apocalypse took place on Sunday, April 1 ,2012! Did you miss it? Now is your chance to catch up on the breaking news of the past few days. The Sovereign Spirit Saga is continued in the full edition of Voyage of the Dead and the sequel, Flotilla of the Dead which was released 4/1/12.Where would you want to be during the zombie apocalypse? After reading this 30,000 word (70 page) introduction to Voyage of the Dead you will probably want to be aboard the Sovereign Spirit. Welcome to their living nightmare. Author's The events in this story take place on April 1, 2012! This is your chance to read about the zombie apocalypse in REAL TIME for FREE.The full 100,000 word version of Voyage of the Dead is now available at If you are NOT downloading this version for FREE and want to read the whole book, you should probably save a buck and download the full edition for $2.99. The second book in the series, \"Flotilla of the Dead\", will be released on April 1, 2012! The voyage continues...Reviews of the full edition of Voyage of the The Kindle Book “…Without a doubt one of the better Zombie books… What I liked about the story is the ‘end of the world’ because of Zombies is not a certainty. It is not one or two people trying to stay alive. There are pockets of people with a plan to fight back and to take back the earth. The story makes enough sense that it could be possible. This is a story about people trying to stay alive, not just killing hoards of the walking dead.”Anthony Wessel reviewer at TheKindleBookReview.com and founder of DigitalBookToday.com\"This is one of those books that starts with a bang and I read waiting for the pace to slacken, except it doesn't. Too often, books of this kind start out with an action scene, and then we get chapters of backfill and descriptions of the soap opera-like travails of our characters. While Forsyth indeed fills in the characterizations, the key quality of this book is that most valuable in any kind of thriller--PACING.\" John S.Reviews of the Introductory First “A zombie lover’s wet dream! [It’s] very tense, visceral, and a joy to read.” Joey Rosenthal.“The Walking Dead meets Battlestar Gallactica! This novel has all the ingredients for an epic series of books and would be great for television too. It’s like a Star Trek of the Zombie Apocalypse...” Tom McWilliams \"Five stars! I'm not usually a zombie fan, but this is a real page turner. I can't wait to see what happens next.\" Pam Resnik",
  "genres": [
    "Horror",
    "Zombies"
  ],
  "author": "David P. Forsyth",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/13282829-voyage-of-the-dead-introductory-first-look"
}