{
  "title": "Ponder Awhile Message From The Light",
  "description": "Classically wrought in the ways of the sages, the beautifully penned Ponder Awhile shares the complexities of life as a simple and accessible dose of spirit and soul stuff. Author and poet Mohit K. Misra leaves no stone unearthed as he dons the robes of a mystic, though is plainspoken, lilting, and at times, playful with his language and words.Written as Dohas or couplets, each stanza of the fifty-one poems found in this collection chases the glow of a new dawn of world enlightenment. Straightforward, uncomplicated and wise, with titles such as \"Mother Earth,\" \"Married to the Light,\" \"Charity,\" and \"Peace,\" the author examines and dissects the frailty of life, the inevitability of death and the most tender part of the stalk and the root. These poems are necessary, irresistible and evolved. Courageous in their simple message, God and His many faces are pressed into the window box for all to see and celebrate. The poet encourages introspection, deliberation, mediation and the search for deeper meaning. His poems of praise, poems of contemplation and poems of provocation sing God's praises, His justice and His grace. Knowledge leads to understanding, which leads to peace and, finally, to love. It is what the world needs—a little of God's love, the fabric, the sheer essence; the gems of the universe unfold on these pages. And we are, as readers, better for these gifts.Editorial Reviews\"One With The Universe-Contemplative and simple, Ponder Awhile is not just a composition of some 66 poems but an experience which will leave you with your thoughts alone.\"Pune Newsline- The Indian Express\"This youngish poet has scored very well in categories of Spirituality, Philosophy and Poetry on listing of writing constantly updated on the world wide web. He has even inched passed Charles Taylor for a well known work A Secular Age. Surprisingly Kabir, Rabindranath Tagore, Gibran, Shakespare and several other literary luminaries have been left in the shade too.\"Pune Mirror\"Stimulating and mesmerizing, yet simple and pure they will leave you wanting to embrace the simple joys and truths of bare existence.\"DNA News\"We are sure that this is one poet that the city of Pune can call its very own Shakespeare!\"Eastside Plus -Times Of IndiaAward Winning Finalist \"USA Book News\" Spirituality General 2009;Top 100 Recommended Religion and Spirituality \"ebookmall\" 2009;Ranked 1 in Religious and Spiritual eBooks \"Franklin\" 2010/ 2011;\"Best Book Buys\"Ranked 1 in Poetry books 2011Top 10 Poetry, Top 10 Body, Mind and Spirit and Top 10 Philosophy- Religious Books 2011/2012 and 2013;",
  "genres": [],
  "author": "Mohit K. Misra",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/1328370.Ponder_Awhile_Message_From_The_Light"
}