{
  "title": "Free Soil, Free Labor, Free Men: The Ideology of the Republican Party Before the Civil War",
  "description": "Since its publication twenty-five years ago, Free Soil, Free Labor, Free Men has been recognized as a classic, an indispensable contribution to our understanding of the causes of the American Civil War. A key work in establishing political ideology as a major concern of modern American historians, it remains the only full-scale evaluation of the ideas of the early Republican party. Now with a new introduction, Eric Foner puts his argument into the context of contemporary scholarship, reassessing the concept of free labor in the light of the last twenty-five years of writing on such issues as work, gender, economic change, and political thought. A significant reevaluation of the causes of the Civil War, Foner's study looks beyond the North's opposition to slavery and its emphasis upon preserving the Union to determine the broader grounds of its willingness to undertake a war against the South in 1861. Its search is for those social concepts the North accepted as vital to its way of life, finding these concepts most clearly expressed in the ideology of the growing Republican party in the decade before the war's start. Through a careful analysis of the attitudes of leading factions in the party's formation (northern Whigs, former Democrats, and political abolitionists) Foner is able to show what each contributed to Republican ideology. He also shows how northern ideas of human rights--in particular a man's right to work where and how he wanted, and to accumulate property in his own name--and the goals of American society were implicit in that ideology. This was the ideology that permeated the North in the period directly before the Civil War, led to the election of Abraham Lincoln, and led, almost immediately, to the Civil War itself. At the heart of the controversy over the extension of slavery, he argues, is the issue of whether the northern or southern form of society would take root in the West, whose development would determine the nation's destiny. In his new introductory essay, Foner presents a greatly altered view of the subject. Only entrepreneurs and farmers were actually \"free men\" in the sense used in the ideology of the period. Actually, by the time the Civil War was initiated, half the workers in the North were wage-earners, not independent workers. And this did not account for women and blacks, who had little freedom in choosing what work they did. He goes onto show that even after the Civil War these guarantees for \"free soil, free labor, free men\" did not really apply for most Americans, and especially not for blacks. Demonstrating the profoundly successful fusion of value and interest within Republican ideology prior to the Civil War, Free Soil, Free Labor, Free Men remains a classic of modern American historical writing. Eloquent and influential, it shows how this ideology provided the moral consensus which allowed the North, for the first time in history, to mobilize an entire society in modern warfare.",
  "genres": [
    "History",
    "American History",
    "Nonfiction",
    "Civil War",
    "Politics",
    "American Civil War",
    "Race"
  ],
  "author": "Eric Foner",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/132914.Free_Soil_Free_Labor_Free_Men"
}