{
  "title": "Strange Attractors",
  "description": "This volume contains eleven tales from the frontier of imagination, stories that are, by turn, surreal, satirical, surprising, subversive, slapstick, sensual and spiritual. And always stimulating.ContentsInto the NightThe poet seeks the illumination and freedom found in the darkest shadow of the night. Surreal, otherworldly, lyrical, and filled with essential intimacy and nonconformity.Waiting for the LightMore fun than a garbage truck full of zombies, which it features, along with evil clowns and the end of the world, all of which beset our protagonist as he sits in a left turn lane, waiting for the traffic light to change.Walt’s Bait and CybercaféA short and quirky vignette about Trance Jorgenson’s attempt to bring the two horse yooper town of Watersmeet into the age of the internet. What happens when backwoods Yoopers meet the world wide web? Revolution, of course.The Conquest of BreadA radical tale of awakening zombies. It is a tribute to Kropotkin, told in the first person plural..JoyrideReady for laugh-out-loud adventure? Join Captain Will Power as he tries to save Bugtown from peeping toms, rabid guard dogs, evil professors, demonic toadies, an army of zombies, religious zealots and drive by shooters. The only question is: who will protect Bugtown from Captain Will Power?Jesus FreaksTake a gander at 1970s era acid casualties, and the merits of what is considered a good book.Mean and DespicableThis is the definitive history of Jim Summers, the farmer’s gunslinger. In the 1880s, tension between lumber businesses and homesteaders in Michigan’s Upper Peninsula almost rivaled the range wars further west. Jim Summers was at the heart of it.Trouble Comes to TownThe sequel to Walt’s Bait and Cybercafé. Mad bomber, Ryan Chartier comes to Watersmeet in search of a pay phone.Robin of the HoodHe steals from the rich and gives to the poor. A real trickster outlaw, Robin is. Hilariously devious.Gone GorillaA bizarre fantasy adventure. The protagonist seeks to evade the ever present Higgs Boson. You can never outrun that gone gorilla.Song of the Wandering HunterThe sequel to Into the Night. The wandering hunter evades pursuit as he comes to understand the intimate unity underlying all that exists. Will he be able to pass his discovery along before he is hunted down himself?",
  "genres": [],
  "author": "P.D.  Allen",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/13294214-strange-attractors"
}