{
  "title": "Complete Tales of da Yoopernatural",
  "description": "Tales of da Yoopernatural harkens back to the tradition of spooky stories told around the campfire late at night, combining the feel of the oral tradition with modern sensibilities. In these tales the author has created a world of myth and legend, a world which looks a lot like the one we inhabit but is just a bit skewed with the occasional portal to other dimensions, appearance of mythical creatures, spirits, ghosts and more. The stories range from the prosaically dreamlike to the disturbing, without a lot of graphic bloodshed or gratuitous violence.ContentsBlood MoonConnie Hillman follows her former lover into madness. In the ancient Huron Mountains, she encounters ghosts, cannibalistic Weendigo, and a mysterious giant while trying to rescue the man she cannot stop caring about, Phil Waverly, an anthropologist lost in his obsession to prove his own demented theories.The Buck of Mulligan PlainsHenry Kincaid enters into a mythic hunt that will bring him face to face with the Lord of the Wilderness. Meanwhile, his lover, Lilith Gordon, fears that she will lose him forever.The Secret Life of TreesThe northern woodlands are home to many strange sights. Some say the ghosts of fallen forests haunt the region, while others say it is the ghosts of the lumberjacks who felled the ancient trees. A few speak of enchantments even more mysterious than ghosts, marvels of the fallen wilderness that linger, haunting woodlands and claiming the lives of solitary hunters or backpackers. Carl Landau will soon discover the truth behind these local legends.The Giant KillerFive-year-old Rene DeClaire embarks on an adventure with fairies and a giant-killing dwarf.Afraid of the DarkDrawn on by a contrasting mixture of attraction and repulsion, will Andrew Erickson uncover what secrets lie hidden in the absolute darkness of the haunted Laughing Eagle Mine before they cost him his life, and that of his friends? Join him on his harrowing descent into a nightmare world carved out of the ancient basalt of the Keweenaw Peninsula.On IceAn enchanted, ancient sturgeon seeks to communicate with Bruce Torvalds, bridging the gap between man and nature. But is it already too late for Bruce to escape his social preconditioning? This tale demonstrates that the greatest struggle is not between man and nature, but between man and his own mindset.A Killer’s PrideOut of a misguided sense of loyalty, young Ojibwa Indian Stephen DeClaire ignores a call to follow the Red Path. He joins the army along with his friend Skip Neunan and is shipped to Iraq just in time to take part in the razing of Fallujah. Stephen finds himself the focus of a struggle between the Buffalo Maiden and the Beast of Babylon. In the fight for his soul, he learns powerful lessons about imperialism, the nature of war and civilization. Will he survive the invasion with his soul and mind intact, or will he follow his friend into the darkness?Say EEEK to da UP, eh.",
  "genres": [],
  "author": "P.D.  Allen",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/13294180-complete-tales-of-da-yoopernatural"
}