{
  "title": "The Stars at War",
  "description": "Arthur Clarke said it first: If mankind is to survive, then for all but a very brief part of our history the word \"ship\" will mean \"space ship.\" We will spread through space. We will build a colony on the moon: if we had a government of courage and imagination we would have that in time to celebrate the 500th anniversary of Columbus's voyages of discovery. As it is, it will take a bit longer; but we will go back to the Moon. We will settle other moons, and asteroids, and the planets; and we will go to the stars. Where mankind goes, government goes.It is no idle thing, then, to think about what forms of government we will take to the stars. We in this enlightened age think we know; but do we? We are, after all, no smarter than our ancestors. We know more, but that's quite a different thing - and we have forgotten much that we had best relearn before we pay dearly for what they knew and we don't.Contents:Introduction: Empire by J.E. PournelleIn Clouds of Glory by Algis BudrysThe Star Plunderer by Poul AndersonTwo Editorials & Postscripts by John W. CampbellHymn of Breaking Strain by Rudyard KiplingThe Miracle of Government by James BurnhamTo A Different Drum by Reginald BretnorThe Whirligig of Time by Vernor VingeNightmare with Angels by Stephen Vincent BenetThe Aristocrat by Chan DavisThe Sons of Martha by Rudyard KiplingMail Supremacy by Hayford PierceHerbig-Haro by Harry TurtledoveThe Fighting Philosopher by E.B. ColeThe Voodoo Sciences by J.E. PournellePax Galactica by Ralph WilliamsThe Proper Study of Mankind by J.E. PournelleFinger Trouble by Edward P. HughesYellow Rain and Space Wars by Adrian BerryThat Share of Glory by C.M. KornbluthThe Stars at War by J.E. Pournelle",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Collections",
    "Short Stories",
    "Science Fiction Fantasy"
  ],
  "author": "Jerry Pournelle",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/1329612.The_Stars_at_War"
}