{
  "title": "Finding Everett Ruess: The Life and Unsolved Disappearance of a Legendary Wilderness Explorer",
  "description": "Finding Everett Ruess by David Roberts, with a foreword by Jon Krakauer, is the definitive biography of the artist, writer, and eloquent celebrator of the wilderness whose bold solo explorations of the American West and mysterious disappearance in the Utah desert at age 20 have earned him a large and devoted cult following. More than 75 years after his vanishing, Ruess stirs the kinds of passion and speculation accorded such legendary doomed American adventurers as Into the Wild's Chris McCandless and Amelia Earhart. \"I have not tired of the wilderness; rather I enjoy its beauty and the vagrant life I lead, more keenly all the time. I prefer the saddle to the street car and the star sprinkled sky to a roof, the obscure and difficult trail, leading into the unknown, to any paved highway, and the deep peace of the wild to the discontent bred by cities.\" So Everett Ruess wrote in his last letter to his brother. And earlier, in a valedictory poem, \"Say that I starved; that I was lost and weary; That I was burned and blinded by the desert sun; Footsore, thirsty, sick with strange diseases; Lonely and wet and cold . . . but that I kept my dream!\" Wandering alone with burros and pack horses through California and the Southwest for five years in the early 1930s, on voyages lasting as long as ten months, Ruess also became friends with photographers Edward Weston and Dorothea Lange, swapped prints with Ansel Adams, took part in a Hopi ceremony, learned to speak Navajo, and was among the first \"outsiders\" to venture deeply into what was then (and to some extent still is) largely a little-known wilderness. When he vanished without a trace in November 1934, Ruess left behind thousands of pages of journals, letters, and poems, as well as more than a hundred watercolor paintings and blockprint engravings. A Ruess mystique, initiated by his parents but soon enlarged by readers and critics who, struck by his remarkable connection to the wild, likened him to a fledgling John Muir. Today, the Ruess cult has more adherents—and more passionate ones—than at any time in the seven-plus decades since his disappearance. By now, Everett Ruess is hailed as a paragon of solo exploration, while the mystery of his death remains one of the greatest riddles in the annals of American adventure. David Roberts began probing the life and death of Everett Ruess for National Geographic Adventure magazine in 1998. Finding Everett Ruess is the result of his personal journeys into the remote areas explored by Ruess, his interviews with old-timers who encountered the young vagabond and with Ruess's closest living relatives, and his deep immersion in Ruess's writings and artwork. It is an epic narrative of a driven and acutely perceptive young adventurer's expeditions into the wildernesses of landscape and self-discovery, as well as an absorbing investigation of the continuing mystery of his disappearance. In this definitive account of Ruess's extraordinary life and the enigma of his vanishing, David Roberts eloquently captures Ruess's tragic genius and ongoing fascination.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Adventure",
    "History",
    "Nature",
    "Travel",
    "Outdoors"
  ],
  "author": "David  Roberts",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/10363517-finding-everett-ruess"
}