{
  "title": "Hard-Boiled Defective Stories",
  "description": "An early classic from the author of Black Hole .Meet El Borbah, a 400-pound private eye who wears a Mexican wrestler's tights and eerie mask. Subsisting entirely on junk food and beer, El Borbah conducts his investigations with tough talk and a short temper. He smashes through doors and skulls as he stalks a perfectly realized film-noir city filled with punks, geeks, business-suited creeps and mad scientists.El Borbah features five science-fiction and true-detective In \"Robot Love,\" rebellious kids in nightclubs replace their \"parts\" with mechanical substitutes as part of a new fad, only to find that their parents have been automating themselves all along; in \"Love in Vein\" a mad visionary sperm donor plans a master race and turns \"his\" kids against their parents; \"Bone Voyage\" details the exploits of a cult called the Brotherhood of the Bone, a kind of cross between the Masons and the Mansons. The fantastic plots take up the weird fears of a scientific society, but the action is pure pulp. Charles Burns effortlessly spins yarns with gritty punchlines and pictures so perfect they must have existed in some collective memory of junk drama. And through it all crashes El Borbah, trying to make an honest buck from dishonest people.Burns is the author of Black Hole , the acknowledged masterpiece of the form that Fantagraphics serialized through the 1990s and will be collected into a massive graphic novel in 2005 by Pantheon Books. El Borbah is Burns' earliest work, created in the early 1980s, though the work remains eerily contemporary. Steeped in a \"sci-fi-noir\" aesthetic informed by Burns' steadily childhood diet of B-movies and comic books, but with a sophisticated sense of humor that is often as disturbing as it is funny, El Borbah is comics as its most entertaining.",
  "genres": [
    "Comics",
    "Graphic Novels",
    "Fiction",
    "Horror",
    "Comic Book",
    "Art",
    "Crime"
  ],
  "author": "Charles Burns",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/1330459.Hard_Boiled_Defective_Stories"
}