{
  "title": "Matrimony",
  "description": "It’s 1987, and Julian Wainwright, aspiring writer and Waspy son of New York City old money, meets beautiful, Jewish Mia Mendelsohn in the laundry room at Graymont College. So begins a relationship that spans twenty years, as it takes Julian and Mia across the country and through the depths of family tragedy, love and friendship, money and ambition, desire and tensions of faith.From the moment he was born, Julian Wainwright has lived a life of Waspy privilege. The son of a Yale-educated investment banker, he grew up in a huge apartment on Sutton Place, high above the East River, and attended a tony Manhattan private school. Yet, more than anything, he wants to get out–out from under his parents’ influence, off to Graymont College, in western Massachusetts, where he hopes to become a writer.When he arrives, in the fall of 1986, Julian meets Carter Heinz, a scholarship student from California with whom he develops a strong but ambivalent friendship. Carter’s mother, desperate to save money for his college education, used to buy him reversible clothing, figuring she was getting two items for the price of one. Now, spending time with Julian, Carter seethes with resentment. He swears he will grow up to be wealthy–wealthier, even, than Julian himself.Then, one day, flipping through the college facebook, Julian and Carter see a photo of Mia Mendelsohn. Mia from Montreal, they call her. Beautiful, Jewish, the daughter of a physics professor at McGill, Mia is – Julian and Carter agree – dreamy, urbane, stylish, refined.But Julian gets to Mia first, meeting her by chance in the college laundry room. Soon they begin a love affair that–spurred on by family tragedy–will carry them to graduation and beyond, taking them through several college towns, over the next ten years. Then Carter reappears, working for an Internet company in California, and he throws everyone’s life into turmoil: Julian’s, Mia’s, his own.Starting at the height of the Reagan era and ending in the new millennium, Matrimony is about love and friendship, about money and ambition, desire and tensions of faith. It asks what happens to a marriage when it is confronted by betrayal and the specter of mortality. What happens when people marry younger than they’d expected? Can love endure the passing of time?In its emotional honesty, its luminous prose, its generosity and wry wit, Matrimony is a beautifully detailed portrait of what it means to share a life with someone–to do it when you’re young, and to try to do it afresh on the brink of middle age.",
  "genres": [
    "Fiction",
    "Book Club",
    "Contemporary",
    "Marriage",
    "Realistic Fiction",
    "Adult",
    "Novels"
  ],
  "author": "Joshua Henkin",
  "average_rating": "3.12",
  "url": "https://www.goodreads.com/book/show/1330763.Matrimony"
}