{
  "title": "Desert Rose: The Life and Legacy of Coretta Scott King",
  "description": "Desert Rose details Coretta Scott King's upbringing in a family of proud, land-owning African Americans with a profound devotion to the ideals of social equality and the values of education, as well as her later role as her husband's most trusted confidant and advisor. Coretta Scott King—noted author, human rights activist, and wife and partner of famed Civil Rights Movement leader Martin Luther King Jr.—grew up in the rural Alabama Black Belt with her older sister, Edythe Scott Bagley. Bagley chronicles the sisters’ early education together at the Crossroads School and later at the progressive Lincoln School in Marion. She describes Coretta’s burgeoning talent for singing and her devotion to musical studies, and the sisters’ experiences matriculating at Antioch College, an all-white college far from the rural South. Bagley provides vivid insights into Coretta’s early passion for racial and economic justice, which lead to her involvement in the Peace Movement and the National Association for the Advancement of Colored People.As Coretta’s older sister, Edythe shared in almost all of Coretta’s many trials and tribulations. Desert Rose charts Coretta’s hesitance about her romance with Martin Luther King and the prospect of having to sacrifice her dream of a career in music to become a minister’s wife. Ultimately, Coretta chose to utilize her artistic gifts and singing voice for the Movement through the development and performance of Freedom Concerts. This book also charts Coretta’s own commitment and dedication, in the years that followed King’s death, to the causes of international civil rights, the antiapartheid movement, and the establishment of the King Center in Atlanta and the national King Holiday. Coretta’s devotion to activism, motherhood, and the movement led by her husband, and her courageous assumption of the legacy left in the wake of King’s untimely assassination, are wonderfully detailed in this intimate biography.",
  "genres": [
    "Biography"
  ],
  "author": "Edythe Scott Bagley",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/13309364-desert-rose"
}