{
  "title": "Blueprints of the Afterlife",
  "description": "A tour de force novel from the \"wickedly talented\" (The Boston Globe) and \"darkly funny\" author of Misconception (The New York Times Book Review).Finalist for the Philip K. Dick AwardIt is the afterlife. The end of the world is a distant, distorted memory called \"the Age of Fucked Up Shit.\" A sentient glacier has wiped out most of North America. Medical care is supplied by open-source nanotechnology, and human nervous systems can be hacked.Abby Fogg is a film archivist with a niggling feeling that her life is not really her own. She may be right. Al Skinner is a former mercenary for the Boeing Army, who's been dragging his war baggage behind him for nearly a century. Woo-jin Kan is a virtuoso dishwasher with the Restaurant and Hotel Management Olympic medals to prove it. Over them all hovers a mysterious man named Dirk Bickle, who sends all these characters to a full-scale replica of Manhattan under construction in Puget Sound. An ambitious novel that writes large the hopes and anxieties of our time--climate change, social strife, the depersonalization of the digital age--Blueprints of the Afterlife will establish Ryan Boudinot as an exceptional novelist of great daring.\"Duct-tape yourself to the front of this roller coaster and enjoy the ride.\" --The New York Times\"Challenging, messy and funny fiction for readers looking for something way beyond space operas and swordplay.\" --Kirkus Reviews\"The absurdities are cleverly crafted and highly entertaining. Imaginative [and] heartfelt.\" --Hannah Calkins, Shelf Awareness\"Ingenious . . . Frenzied, hilarious, and paranoid . . . A bracing dystopian romp through contemporary dread.\" --Publishers Weekly\"Probably the strangest post-apocalyptic novel in ages.\" --io9\"What an inspired mindfuck of a book!\" --City Paper (Baltimore)",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Dystopia",
    "Fantasy",
    "Speculative Fiction",
    "Post Apocalyptic",
    "Science Fiction Fantasy"
  ],
  "author": "Ryan Boudinot",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/13312448-blueprints-of-the-afterlife"
}