{
  "title": "Night Mischief",
  "description": "New York Times bestselling author Nina Bruhns presents one of her most beloved titles, NIGHT MISCHIEF, part of the DARK ENCHANTMENTS series, which includes both full length romance novels as well as short novellas such as this book's companion story, LORD WESTON, VAMPIRE SLAYER.  NIGHT MISCHIEF  What good could come of a bargain with the devil?  Lady Dawn Maybank takes her responsibilities to the Cadre, a secret order of demon hunters, very seriously. She never imagines that a thoughtlessly worded university lecture could conjure up her worst nightmare--a demon of vengeance. Or that this demon, Galen McManus, will propose a trade that could finally earn her the respect she's sought her entire life. But dare she accept? For in exchange for the Demon Stone, a long-lost diamond for which her father the earl has been searching his whole life, Dawn must spend five nights in the sinfully handsome demon's bed.  When bad boys go good...  But Dawn is haunted by a fatal flaw she is desperate to hide from the rest of the world. And little does she know that Galen's real objective is to weave his own brand of cosmic justice upon her. But in the end, the sinister net the arrogant demon has woven about her traps his most unsuspecting victim yet--himself. And for the most unlikely of reasons--love.  DARK ENCHANTMENTS - the series  Four hundred years ago a secret, hermetic order was created by the first Earl of St. Yve and a handful of initiates who pledged their lives to keep the world safe from evil paranormal beings. Ever since, the Cadre has been dedicated to maintaining the delicate balance between the mortal and Dark realms through research and observation of otherworldly entities. Seldom does the Cadre interfere.  But not all mortals seek peaceful understanding between the realms. In recent decades, an opposing force has been created by the British Security Service. This covert group, called P-Cell, has but one directive-- destroy paranormal creatures of all kinds.  As the two organizations fight faithfully for their separate causes, unbeknownst to either of them the dark forces of evil gather, preparing to overtake the mortal realm....",
  "genres": [
    "Paranormal Romance",
    "Paranormal",
    "Harlequin",
    "Harlequin Nocturne",
    "Romance",
    "Demons",
    "Novels"
  ],
  "author": "Nina Bruhns",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/1331535.Night_Mischief"
}