{
  "title": "The Story of Russia",
  "description": "From “the great storyteller of Russian history” (Financial Times), a brilliantly colored account of the myths that have shaped and reshaped Russia’s identity and politics from its foundingWho were the Rus, the ancient tribe from which the Russians trace their origins? Were they Baltic Slavs, hailing from within the territory that would become Russia? Or were they Vikings from Scandinavia, who came in from the outside to organize chaotic warring groups? Russians initially embraced the former theory, following a surge in nationalist sentiment, but autocrats, including Catherine the Great, came to trumpet the latter, which supported the notion that the Russian people are incapable of self-governance. Both sides were using history to create myths, narratives of national identity that could be deployed for their own political ends. The Story of Russia is about how the Russians defined themselves—and repeatedly reinvented such definitions along the way. Moving from Russia’s agrarian beginnings in the first millennium to subsequent periods of monarchy, totalitarianism, and perestroika, all the way up to Vladimir Putin and his use of myths of Russian history to bolster his regime, celebrated historian Orlando Figes examines the ideas that have guided the country’s actions: the need for autocracy to rule Russia’s vast land; the veneration of the “Holy Tsar” and the cult of the leader; the belief in an essentially Russian collectivist spirit; and the oscillation between Russia’s European and Eurasian character. With beautiful writing and alluring perspectives, The Story of Russia is as much about the myths and ideologies that have shaped Russian history—about the ways the Russians have interpreted their past—as it is about the events, institutions, social groups, and leaders that have made that history. And as modern Russia retreats from Europe, this authoritative account of Russia’s past might well elucidate its future.",
  "genres": [
    "History",
    "Nonfiction",
    "Russia",
    "Politics",
    "Russian History",
    "European History",
    "Audiobook"
  ],
  "author": "Orlando Figes",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/133150265-the-story-of-russia"
}