{
  "title": "Across a Bridge of Dreams",
  "description": "oday when the summer thrushCame to sing at Heron’s NestI crossed the Bridge of Dreams.Have decided on the title for my new book: Across a Bridge of Dreams. The ‘bridge of dreams’ is an incredibly resonant concept in Japanese culture – it’s our short human lives, a bit like the Anglo-Saxon concept of human life being like a sparrow flying out of the darkness outside into the Great Hall with its warmth and comfort and almost immediately flying out the other side. In the same way the image of the ‘floating bridge of dreams’ is an image of human life, as insubstantial as a bridge over which we pass from one state of existence to another. In Japanese culture it’s a very famous image. The Floating Bridge of Dreams is the title of the last chapter, Chapter 54, of The Tale of Genji (the world’s first novel, written by a Japanese court lady around 1000AD), though the words are never actually used in the text. To Japanese of that time the words would have immediately evoked the transience of human life.The phrase was echoed in a wonderful poem by Fujiwara Teika (1162 – 1241):On a spring nightThe floating bridge of dreamsBreaks off:Swirling round the mountaintopA cloud drifts into the open skyAnd in the sonorous opening lines of The Tale of the Heike, the great 14th century Japanese epic:The proud ones last but a little while; they vanish like a spring night’s dream.And it’s the title of a short story by Tanizaki Junichiro, The Bridge of Dreams, which begins with the lines I quoted at the beginning of this blog. Just to say ever since I came across these words and this image I’ve been haunted by them – and wanted to wrote a book evoking that frailty and sense of transience. In fact my new book is a love story, a tale of hopeless love set at the time of the Satsuma rebellion, sort of Romeo and Juliet crossed with The Last Samurai …",
  "genres": [
    "Historical Fiction",
    "Japan",
    "Fiction",
    "Romance",
    "Asian Literature",
    "Historical",
    "Adventure"
  ],
  "author": "Lesley Downer",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/13316021-across-a-bridge-of-dreams"
}