{
  "title": "Mr. Petre",
  "description": "Everything was ready for his landing. He would not be troubled with so much as a handbag. The blessed abolition of passports in 1933 as for Englishmen landing in England saved him the trouble of even that small encumbrance; and as he hated his pockets bulging with papers, he had locked all, down to the least important notes, in a little dispatch box and handed it to his steward. He had nothing on him but one of the tickets under the new system, the ordinary railway ticket for London which they exchange on board against the steamship receipt; and a good wad of £63 in English notes, with a handful of change; he had not even kept a nickel for remembrance. He could recover what he required by the time he had taken his seat in the train; and all this disembarrassment, coupled with the long vacuity of the sea voyage, gave him an odd sense of freedom.Odd... and he knew that it was odd. It was a little too complete. His mind seemed to be holding nothing but the scene before the vigorous sky, the leaping water and the green above the gray of the rocks with their white fringe of foam.He felt unnaturally careless. And when his thoughts turned to his luggage and its arrangement, to the petty incidents of that same morning, they were blurred and faded. Nor did he concern himself with their increasing faintness . . . he enjoyed relief in it. But he knew that the relief was strange.His daily life in America had been too much preoccupied, and that for a long time past. He had gone over to judge and help direct an investment in land, which had not turned out too brilliantly. He had not even been able to sell out as he wished; he was still held to it and its mortgage. He had not put things right. He had found it of no purpose to remain. He had turned back homewards—and yet he suffered an uneasy fear that in his absence things might go worse. Too much of his small fortune had been locked up in that venture, and the prospect before him, when he should reach his rooms in London, was not over bright. He was not sure that he could keep up the modest scale of living on which he had arranged his life for the last ten years before this voyage to the States. The place he had inherited in Dorsetshire, and which had been at his disposal since his mother’s death fifteen years earlier, he had let; but there were heavy charges upon it, and he could see little income in what remained of its revenue.Nevertheless, he did now feel that curious sense of lightness and of carelessness. It was not connected with the returning it seemed a new mood of a kind by itself. It came in deep successive waves, each washing out, while it lasted, all responsibility and care; and twice, as they neared the breakwater, he went through an abnormal moment or two of complete freedom, like that of a man who has just wakened from a profound sleep, and has not yet remembered the burdens and details of life.",
  "genres": [],
  "author": "Hilaire Belloc",
  "average_rating": "3.40",
  "url": "https://www.goodreads.com/book/show/13318404-mr-petre"
}