{
  "title": "The Logogryph: A Bibliography Of Imaginary Books",
  "description": "“The particular volume I’m looking for is nameless, lacking a cover, title page, or any other outward markings of identity. Over the centuries its leaves have known nothing but change. They have been removed, replaced, altered, lost. The nameless book has been bound, taken apart, and reassembled with the pieces of other dismembered volumes, until one could ask whether there is anything left of the original. Or if there ever was an original.” So begins Thomas Wharton’s book about books. What follows is a sequence of variations on the experience of reading and on the book a physical and imaginative object. One tale traces the origins of a fictional card game. Another tells of a duel between two margin scribblers. Roving across the globe and from parable to mystery, Wharton positions his reader between the covers of a book that is not. How are we to read the pieces that follow? As extraneous to the nameless book, as parts of it in its original form or perhaps as evidence that it has relocated to other existing volumes? The Logogryph takes its cues from magic realism and the techniques of cinematography. The result is a mind-bending caper through the process of reading, the relationships we establish with fictitious worlds and the possibility of worlds yet unread. Wharton indulges his reader with tales of fantastical cities where the only occupation is reading and of the plight of a protagonist suddenly dislodged from his own novel. And what becomes of the reader who reads all of this? This book is a Smyth-sewn paperback with a jacket and full sleeve. The text was typeset by Andrew Steeves in Caslon types and printed on Rolland Zephyr Laid paper. The jacket was printed letterpress. The inside features illustrations by Wesley Bates.",
  "genres": [
    "Fiction",
    "Books About Books",
    "Fantasy",
    "Literature",
    "Novels",
    "Magical Realism",
    "Canadian Literature"
  ],
  "author": "Thomas Wharton",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/1036471.The_Logogryph"
}