{
  "title": "The Mayor of Maxwell Street",
  "description": "When a rich Black debutante enlists the help of a low-level speakeasy manager to identify the head of an underground crime syndicate, the two are thrust into the dangerous world of Prohibition-era Chicago.The year is 1921, and America is burning. A fire of vice and virtue rages on every shore with Chicago at its beating heart.Twenty-year-old Nelly Sawyer is the daughter of the alleged “wealthiest Negro in America,” a Kentucky horse breeder whose wealth and prestige catapults his family to the heights of the exclusive, elite Black society. After the unexpected death of her brother—the family’s presumed heir—Nelly goes from being virtually unknown to a premier debutante overnight. But Nelly has aspirations beyond society influence and marriage. For the past year, she has worked undercover as an investigative journalist for the Chicago Defender , sharing the achievements and tribulations of everyday Black people living in the shadow of Jim Crow. Now, her latest assignment thrusts her into the den of a dangerous vice the so-called Mayor of Maxwell Street. Charming and mysterious, Jay Shorey strives to balance his connection to the Chicago underworld with his desperate yearning for the refinement and protection of high society. Born to a murdered bi-racial couple in rural Alabama, he knows firsthand what it means to be denied a chance at the American dream. When a tragic turn of fate gave Jay a rare path out, he took it without question. He washed up on Chicago’s storied shores and never looked back, until now. When Nelly’s and Jay’s paths cross, she recruits him to help expose the Mayor and bring about a lasting change in a corrupted city. Trapped between the monolith of Jim Crow, the inflexible world of the Black upper class, and the violence of Prohibition-era Chicago, Jay and Nelly work together and stoke the flames of a love worth fighting for. And yet, as with all things in America, there is a price to be paid. What risk is Nelly willing to take for a young man willing to risk it all? Debut author Avery Cunningham’s stunning novel is at once an epic love story, a riveting historical drama, and a brilliant exploration of Black society and perseverance when the ‘20s first began to roar.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Romance",
    "Mystery",
    "Historical",
    "Chick Lit",
    "Crime"
  ],
  "author": "Avery Cunningham",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/133206574-the-mayor-of-maxwell-street"
}