{
  "title": "Sons of Gods: Mahabharata",
  "description": "Alternate cover edition of ASIN B006Q7F4Q6The Mahabharata is a grand and timeless story, the oldest and longest epic in the world. It is a story as enthralling as it is moving, as wise as it is entertaining, a living fount of wisdom. It’s an epic legend that has endured the millennia. Hindu children first hear the story on their mothers’ knee, and fall in love with the characters. However, at 18 volumes the ancient story is heavy going, cumbersome, and often tedious; basically inaccessible in our modern times .Yet the quintessential story at its heart is pure gold, and timeless.Here’s a new and succinct version, accessible to those of all religions and of none. Sons of Gods is the golden essence of the epic, which has for the first time been restructured, reinvented and retold in the familiar form of a novel, perfect for a 21st-Century readership.Synopsis:The young princess Kunti, given the boon of a mantra that can summon any god, calls in her excitement the Sun-god Surya. As a result she must bear his son, given to her by touching her navel: ‘the ways of gods are less clumsy than the ways of humans.’ He advises her to put the baby in a box and let the river carry it away; he, Surya, will watch over him. He is found and raised by a low-caste couple, who name him Karna.Kunti goes on to marry Pandu and gives birth to five more sons, all sired by gods, as her husband is unable to give her children.Spurned by all because of his low caste, Karna finds a friend and ally in the avaricious and wicked prince Duryodhana. But Duryodhana's worst enemies just happen to be the five brothers, the righteous Pandava brothers, aided by the divine Krishna, the noblest warriors in the world. These are Kunti’s five glorious sons, beloved by all.Karna and Arjuna -- the middle and mightiest Pandava -- each vow to kill each other without knowing they are brothers. As tensions mount, so does their hatred for each other; until, in the cataclysmic war that will destroy the known world, they meet in the inevitable face-off on the battle-field of Kurukshetra. Karna is given an impossible choice: his true heritage is revealed to him, and as the eldest Pandava, all the world lies at his feet. He can be king over them all. Will he abandon his friend Duryodhana, the one who has raised him up from ignominy?Women are few in this book, but they are all powerful: Kunti, the Pandavas’ mother; the goddess Ganga; Amba, the princess who becomes a man in order to kill her greatest enemy; and the queen Draupadi, married to all five Pandavas.The Mahabharata: Sons of Gods is a new version of the famous epic, written for contemporary readers of both East and West; the essence of the epic brought to life in a succinct and compelling form.",
  "genres": [
    "India",
    "Mythology",
    "Religion",
    "Fiction",
    "Fantasy"
  ],
  "author": "S. Aruna",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/13322852-sons-of-gods"
}