{
  "title": "Talking 'Bout Your Mama: The Dozens, Snaps, and the Deep Roots of Rap",
  "description": "From Two Live Crew's controversial comedy to Ice Cube's gangsta styling and the battle rhymes of a streetcorner cypher, rap has always drawn on deep traditions of African American poetic word-play, In Talking 'Bout Your Mama , author Elijah Wald explores one of the most potent sources of the viciously funny, outrageously inventive insult game known as \"the dozens.\"So what is the dozens? At its simplest, it's a comic chain of \"yo' mama\" jokes. At its most complex, it's an intricate form of social interaction that reaches back to African ceremonial rituals. Wald traces the tradition of African American street rhyming and verbal combat that has ruled urbanneighborhoods since the early 1900s. Whether considered vernacular poetry, aggressive dueling, a test of street cool, or just a mess of dirty insults, the dozens is a basic building block of African-American culture. A game which could inspire raucous laughter or escalate to violence, it provided awellspring of rhymes, attitude, and raw humor that has influenced pop musicians from Jelly Roll Morton and Robert Johnson to Tupac Shakur and Jay Z.Wald goes back to the dozens' roots, looking at mother-insulting and verbal combat from Greenland to the sources of the Niger, and shows its breadth of influence in the seminal writings of Richard Wright, Langston Hughes, and Zora Neale Hurston; the comedy of Richard Pryor and George Carlin; thedark humor of the blues; the hip slang and competitive jamming of jazz; and in its ultimate evolution into the improvisatory battling of rap. From schoolyard games and rural work songs to urban novels and nightclub comedy, and pop hits from ragtime to rap, Wald uses the dozens as a lens to providenew insight into over a century of African American culture.A groundbreaking work, Talking 'Bout Your Mama is an essential book for anyone interested in African American cultural studies, history and linguistics, and the origins of rap music.",
  "genres": [
    "Music",
    "History",
    "Nonfiction",
    "Hip Hop",
    "African American"
  ],
  "author": "Elijah Wald",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/13323971-talking-bout-your-mama"
}