{
  "title": "Blood Flats",
  "description": "“Meth, murder, and the mafia---a vast tapestry of a southern gothic crime novel with a Dickensian cast of characters.”Available for the first time on Amazon Kindle.***Lee McCabe is home from Iraq, but home has changed.***Operation Iraqi Freedom veteran and recently discharged U.S. marine Lee McCabe never imagined the dangers awaiting him in Hawkins County, Kentucky. While Lee has been in the Middle East, a network of violent methamphetamine traffickers have established a foothold in the county, corrupting, intimidating, or murdering anyone who stands in their way.***Charged with murder and marked for death***Lee quickly discovers that his neighbor, Tim Fitzsimmons is a meth dealer. When Fitzsimmons and his girlfriend are killed in a drug-related hit, Lee attempts to intervene. The law and the community blame Lee for the murder. The meth traffickers target Lee for death, knowing him to be a witness to the crime.***Enemies motivated by passion, greed, and desperation ***Sheriff Steven Phelps has his own personal reasons for hating Lee: Twenty-five years ago, Lee’s now deceased mother had a youthful affair with the sheriff. The sheriff planned to marry her--until she jilted him to be with the man who became Lee’s father. Phelps is torn by his duty to justice, and his obsession with the doomed love of his adolescence.Lester Finn is a classics-quoting, self-aggrandizing local hoodlum and meth dealer. He is caught between the law and the Chicago-based mafia, which wants a greater share of the southern methamphetamine trade. From his bar, the Boar’s Head, Lester controls a sordid regional enterprise that consists of gambling, drug trafficking, and prostitution. Lester is torn by his grudging respect for Lee---and his need to see the ex-marine dead.Paulie Sarzo is a Chicago mobster, a rising star in the Coscollino crime family. He despises Kentucky, Lee McCabe, and most of all, Lester Finn. But Paulie has an important mission to accomplish in Hawkins County: If he fails to eliminate Lee, he risks the ultimate punishment for failure in la cosa nostra.***A journey toward death or redemption***Dawn Hardin is a former golden girl, honor student, and premed whose life has fallen into a downward spiral of meth addiction and prostitution. Dawn had a tumultuous relationship with Lee before he went to Iraq. Now she tries to help him wage war against the mafia, even as she struggles with her own inner demons, and a family that wants to deny her existence.The Hunter is a mysterious figure who compels Lee to go on the offensive against the forces pursuing him. But will the Hunter offer any concrete assistance, or only advice?Brett St. Croix is a journalist who offers to tell Lee’s version of events. But Lee suspects that St. Croix has a contrary, private agenda of his own.Ben Chamberlain lost his wife to a meth-related murder. Will he assist Lee; or will Ben’s desire for revenge destroy them both?***A battle in Blood Flats***Pursued from all directions, Lee embarks on a cross-country journey toward the town of Blood Flats. There he faces a showdown---in which he must pit his wits and determination against the ruthlessness and superior resources of his enemies on both sides of the law.",
  "genres": [],
  "author": "Edward Trimnell",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/13328743-blood-flats"
}