{
  "title": "Shadow Show: All-New Stories in Celebration of Ray Bradbury",
  "description": "\"What do you imagine when you hear the name\" . . . Bradbury?You might see rockets to Mars. Or bizarre circuses where otherworldly acts whirl in the center ring. Perhaps you travel to a dystopian future, where books are set ablaze . . . or to an out-of-the-way sideshow, where animated illustrations crawl across human skin. Or maybe, suddenly, you're returned to a simpler time in small-town America, where summer perfumes the air and life is almost perfect . . . \"almost.\"Ray Bradbury--peerless storyteller, poet of the impossible, and one of America's most beloved authors--is a literary giant whose remarkable career has spanned seven decades. Now twenty-six of today's most diverse and celebrated authors offer new short works in honor of the master; stories of heart, intelligence, and dark wonder from a remarkable range of creative artists.TABLE OF CONTENTSSam Weller and Mort Castle - IntroductionRay Bradbury - Second HomecomingNeil Gaiman - The Man Who Forgot Ray BradburyMargaret Atwood - HeadlifeJay Bonansinga - HeavySam Weller - The Girl In The Funeral ParlorDavid Morrell - The CompanionsThomas F. Monteleone - The ExchangeLee Martin - Cat on a Bad CouchJoe Hill - By The Silver Water Of Lake ChamplainDan Chaon - Little AmericaJohn McNally - The Phone CallJoe Meno - Young PilgrimsRobert McCammon - Children Of The Bedtime MachineRamsey Campbell - The Page Mort Castle - LightAlice Hoffman - ConjureJohn Maclay - MaxJacqueline Mitchard - Two Of A KindGary Braunbeck - Fat Man And Little BoyBonnie Jo Campbell - The TattooAudrey Niffenegger - Backwards In SevilleCharles Yu - Earth: (A Gift Shop)Julia Keller - Hayleigh's DadDave Eggers - Who Knocks?Bayo Ojikutu - Reservation 2020Kelly Link - Two HousesHarlan Ellison - Weariness",
  "genres": [
    "Short Stories",
    "Fantasy",
    "Science Fiction",
    "Fiction",
    "Horror",
    "Anthologies",
    "Audiobook"
  ],
  "author": "Sam Weller",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/13329252-shadow-show"
}