{
  "title": "A Tree for Max: A Fable",
  "description": "Grandfather Apple Tree, the King of the Trees, all the forest trees, messenger swans, and a dog cooperate to help Max get a tree to help him adjust to his new home. A story of loss and discovery, a fable of growth and change, and love of the natural world, the wonder of an apple orchard through the seasons, and introducing the idea of stewardship of the earth; shown in 64 luminous color photographs. For children, parents, teachers, and grandparents to share.Max is three and a half years old when his family moves to a new home, leaving behind his ‘forest’ — a stand of trees in their old yard. He misses his forest, and this becomes the focus of his feelings of disruption and loss related to the move. The forest sends the swans with a message to alert the King of the Trees about the problem. The King holds a conference of all the trees, and many kinds of trees compete to live with Max. Finally, Grandfather Apple Tree proposes a solution, and an apple tree is sent to be a companion to Max. For children, parents, teachers, and grandparents. Read it together with a younger child over 2-3 nights as a chapter book. Beginning and independent readers from first, second, and third grades and older do enjoy it. Or use as a picture book at any age, with or without the captions. 135 pages (120 + 15 pp. cover + front/back matter); 64 luminous color photographs.This Kindle Fire™ edition is designed to be read in landscape orientation on any mobi- and color-capable Kindle reader software or device, preferably with a diagonal size at least ~6-7\", however it may be viewed on smaller devices, smartphones, etc.Praise for A Tree for Max What a wonderful book! My second-grade students loved it. We loved the photos and the concept. It sparked up a nice conversation about nature. I would definitely share this book with future students, especially in the fall with apple picking season and new beginnings with a new school year. I forwarded it to a few of my colleagues to share with their students. Personally I loved the book, probably in a different way than my students. A Tree for Max has messages for both adults and children. —Amy Eagan, 2nd grade teacher My son Julian, 3rd grade, liked A Tree for Max a lot. Julian read it alone. Hesat down and read it from beginning to end without any stop. He said the plot was interesting and liked that there were real pictures. He also took pleasure in retelling me the story, which is very unusual! He normally does not like to tell about what he reads, but this time, explained it to me in great detail.—Pascal, Julian’s dad.It is a very well written, thoughtful book that I recommend because our children really responded to it. Our girls, Taylor (7 years, 2nd grade) and Ally (5 years) loved A Tree for Max, both the storyline and the pictures. Teddy and I read the book to the children, although our 7 year old could have read it alone.—AndreaMy granddaughter, Kyla, (8 years, grade 3) loved the book. I read it to her and next she read it to me. We have talked frequently of seasonal changes that the book brought to light. She tells me that she especially loves Grandfather Apple and the guard dog. This is a very thought provoking subject that allowed Papa to spend some quality time with his granddaughter. Kyla has shared it with several friends, and I have recommended it to her teacher.—Gerry T.My children, Michael, age 8 and Philomena, age 5, both enjoyed A Tree for Max. They enjoyed the personalities of the trees and of course, the pictures.",
  "genres": [],
  "author": "Jerry Halberstadt",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/13329889-a-tree-for-max"
}