{
  "title": "Smokin' with Myron Mixon: Recipes Made Simple, from the Winningest Man in Barbecue: A Cookbook",
  "description": "The winningest man in barbecause shares the secrets of his success. Rule number one? Keep it simple. In the world of competitive barbecue, nobody’s won more prize money, more trophies, or more adulation than Myron Mixon. And he comes by it From the time he was old enough to stoke a pit, Mixon learned the art of barbecue at his father’s side. He grew up to expand his parent’s sauce business, Jack’s Old South, and in the process became the leader of the winningest team in competitive barbecue. It’s Mixon’s combination of killer instinct and killer recipes that has led him to three world championships and more than 180 grand championships and made him the breakout star of TLC’s BBQ Pitmasters.Now, for the first time, Mixon’s stepping out from behind his rig to teach you how he does it. Rule number People always try to overthink barbecue and make it complicated. Don’t do it! Mixon will show you how you can apply his “keep it simple” mantra in your own backyard. He’ll take you to the front lines of barbecue and teach you how to turn out ’cue like a seasoned pro. You’ll learn to cook like Mixon does when he’s on the road competing and when he’s at home, with great tips on • the basics, from choosing the right wood to getting the best smoker or grill• the formulas for the marinades, rubs, injections, and sauces you’ll need• the perfect ways to cook up hog, ribs, brisket, and chicken, including Mixon’s famous Cupcake Chicken Mixon shares more than 75 of his award-winning recipes—including one for the most sinful burger you’ll ever eat—and advice that will end any anxiety over cooking times and temps and change your backyard barbecues forever. He also fills you in on how he rose to the top of the competitive barbecue universe and his secrets for succulent success. Complete with mouth-watering photos, Smokin’ with Myron Mixon will fire you up for a tasty time.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Reference",
    "Food",
    "Nonfiction"
  ],
  "author": "Myron Mixon",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/10365583-smokin-with-myron-mixon"
}