{
  "title": "Hallucinations",
  "description": "Have you ever seen something that wasn’t really there? Heard someone call your name in an empty house? Sensed someone following you and turned around to find nothing?Hallucinations don’t belong wholly to the insane. Much more commonly, they are linked to sensory deprivation, intoxication, illness, or injury. People with migraines may see shimmering arcs of light or tiny, Lilliputian figures of animals and people. People with failing eyesight, paradoxically, may become immersed in a hallucinatory visual world. Hallucinations can be brought on by a simple fever or even the act of waking or falling asleep, when people have visions ranging from luminous blobs of color to beautifully detailed faces or terrifying ogres. Those who are bereaved may receive comforting “visits” from the departed. In some conditions, hallucinations can lead to religious epiphanies or even the feeling of leaving one’s own body.Humans have always sought such life-changing visions, and for thousands of years have used hallucinogenic compounds to achieve them. As a young doctor in California in the 1960s, Oliver Sacks had both a personal and a professional interest in psychedelics. These, along with his early migraine experiences, launched a lifelong investigation into the varieties of hallucinatory experience.Here, with his usual elegance, curiosity, and compassion, Dr. Sacks weaves together stories of his patients and of his own mind-altering experiences to illuminate what hallucinations tell us about the organization and structure of our brains, how they have influenced every culture’s folklore and art, and why the potential for hallucination is present in us all, a vital part of the human condition. Permissions AcknowledgmentsGrateful acknowledgment is made to the following for permission to reprint previously published American Academy of Excerpt from “Anton’s Syndrome Accompanying Withdrawal Hallucinosis in a Blind Alcoholic” by Barbara E. Swartz and John C. M. Brust from Neurology 34 (1984). Reprinted by permission of the American Academy of Neurology as administered by Wolters Kluwer Health Medical Research.American Psychiatric Excerpt from “Weir Mitchell’s Visual Hallucinations as a Grief Reaction” by Jerome S. Schneck, M.D., from American Journal of Psychiatry (1989). Copyright © 1989 by American Journal of Psychiatry . Reprinted by permission of American Psychiatric Publishing a division of American Psychiatric Association.BMJ Publishing Group Excerpt from “Heautoscopy, Epilepsy and Suicide” by P. Brugger, R. Agosti, M. Regard, H. G. Wieser and T. Landis from Journal of Neurology, Neurosurgery and Psychiatry , July 1, 1994. Reprinted by permission of BMJ Publishing Group Ltd. as administered by the Copyright Clearance Center.Cambridge University Excerpts from Disturbances of the Mind by Douwe Draaisma, translated by Barbara Fasting. Copyright © 2006 by Douwe Draaisma. Reprinted by permission of Cambridge University Press.Canadian Psychological Excerpt from “Effects of Decreased Variation of the Sensory Environment” by W. H. Bexton, W. Heron and T. H. Scott from Canadian Psychology (1954). Copyright © 1954 by Canadian Psychological Association. Excerpt from “Perceptual Changes after Prolonged Sensory Isolation (Darkness and Silence)” by John P. Zubek, Dolores Pushkar, Wilma Sansom and J. Gowing from Canadian Psychology (1961). Copyright © 1961 by Canadian Psychological Association. Reprinted by permission of Canadian Psychological Association. Elsevier Excerpt from “ From Cappadocia to Queen Square” in Background to Migraine , edited by Robert Smith ( William Heinemann, 1967). Reprinted by permission of Elsevier Limited.The New York Times : Excerpts from “Lifting, Lights, and Little People” by Siri Hustvedt from The New York Times Blog , February 17, 2008. Reprinted by permission of The New York Times as administered by PARS International Corp.Oxford University Excerpt from “Dostoiewski’s Epilepsy” by T. Alajouanine from Brain , June 1, 1963. Reprinted by permission of Oxford University Press as administered by Copyright Clearance Center.Royal College of Excerpt from “Sudden Religious Conversion in Temporal Lobe Epilepsy” by Kenneth Dewhurst and A. W. Beard from British Journal of Psychiatry 117 (1970). Reprinted by permission of the Royal College of Psychiatrists.Scientific Excerpt from “Abducted!” by Michael Shermer from Scientifi c American 292 (2005). Copyright © 2005 by Scientifi c American, Inc. All rights reserved. Reprinted by permission of Scientific American .Vintage Excerpts from Speak, Memory by Vladimir Nabokov, copyright © 1947, 1948, 1949, 1950, 1951, 1967, copyright renewed 1994 by the Estate of Vladimir Nabokov. Used by permission of Vintage Books, a division of Random House, Inc.",
  "genres": [
    "Nonfiction",
    "Science",
    "Psychology",
    "Neuroscience",
    "Medicine",
    "Medical",
    "Audiobook"
  ],
  "author": "Oliver Sacks",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/13330764-hallucinations"
}