{
  "title": "Love Saves the Day",
  "description": "From the author of the New York Times bestselling memoir Homer’s Odyssey comes a tender, joyful, utterly unforgettable novel, primarily told through the eyes of the most observant member of any human the cat.Humans best understand the truth of things if they come at it indirectly. Like how sometimes the best way to catch a mouse that’s right in front of you is to back up before you pounce.So notes Prudence, the irresistible brown tabby at the center of Gwen Cooper’s tender, joyful, utterly unforgettable novel, which is mostly told through the eyes of this curious (and occasionally cranky) feline.When five-week-old Prudence meets a woman named Sarah in a deserted construction site on Manhattan’s Lower East Side, she knows she’s found the human she was meant to adopt. For three years their lives are filled with laughter, tuna, catnaps, music, and the unchanging routines Prudence craves. Then one day Sarah doesn’t come home. From Prudence’s perch on the windowsill she sees Laura, the daughter who hardly ever comes to visit Sarah, arrive with her new husband. They’re carrying boxes. Before they even get to the front door, Prudence realizes that her life has changed forever.Suddenly Prudence finds herself living in a strange apartment with humans she barely knows. It could take years to train them in the feline courtesies and customs (for example, a cat should always be fed before the humans, and at the same exact time every day) that Sarah understood so well. Prudence clings to the hope that Sarah will come back for her while Laura, a rising young corporate attorney, tries to push away memories of her mother and the tumultuous childhood spent in her mother’s dusty downtown record store. But the secret joys, past hurts, and life-changing moments that make every mother-daughter relationship special will come to the surface. With Prudence’s help Laura will learn that the past, like a mother’s love, never dies.Poignant, insightful, and laugh-out-loud funny, Love Saves the Day is a story of hope, healing, and how the love of an animal can make all of us better humans. It’s the story of a mother and daughter divided by the turmoil of bohemian New York, and the opinionated, irrepressible feline who will become the bridge between them. It’s a novel for anyone who’s ever lost a loved one, wondered what their cat was really thinking, or fallen asleep with a purring feline nestled in their arms. Prudence, a cat like no other, is sure to steal your heart.Praise for Love Saves the Day “Prudence [is a] sassy but sensitive feline heroine.”— Time“Unforgettably moving . . . a hard one to put down.”— Modern Cat “If you are the Most Important Person to a cat, you will hold them much tighter by the book’s end. If you don’t have a cat, Prudence will have surreptitiously lured you into the danger Falling in love with a cat because they need family, too.”— The Vancouver Sun “Cooper brings readers a fictional tale that cat lovers will treasure. . . . This book will make most readers laugh and cry, and probably lead them to wonder more often what, exactly, their pet is thinking.”—Fredericksburg Free Lance–Star “The interspersed viewpoints . . . enrich Cooper’s sensitively told novel that unravels a story (based on actual events) about a century-old tenement building—and the inhabitants therein. That story ultimately serves as the basis to understanding the emotional subtexts of these authentic, well-drawn characters.”—Shelf Awareness",
  "genres": [
    "Fiction",
    "Animals",
    "Cats",
    "Contemporary",
    "Book Club",
    "Family",
    "Adult Fiction"
  ],
  "author": "Gwen Cooper",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/13330700-love-saves-the-day"
}