{
  "title": "Top Screwups Doctors Make and How to Avoid Them",
  "description": "A primary care doctor is skeptical of his patient’s concerns. A hospital nurse or intern is unaware of a drug’s potential side effects. A physician makes the most “common” diagnosis while overlooking the signs of a rarer and more serious illness, and the patient doesn’t see the necessary specialist until it’s too late.  A pharmacist dispenses the wrong drug and a patient dies as a result. Sadly, these kinds of mistakes happen all the time. Each year, 6.1 million Americans are harmed by diagnostic mistakes, drug disasters, and medical treatments. A decade ago, the Institute of Medicine estimated that up to 98,000 people died in hospitals each year from preventable medical errors. And new research from the University of Utah, HealthGrades of Denver, and elsewhere suggests the toll is much higher.Patient advocates and bestselling authors Joe and Teresa Graedon came face-to-face with the tragic consequences of doctors’ screwups when Joe’s mother died in Duke Hospital—one of the best in the world—due to a disastrous series of entirely preventable errors. In Top Screwups Doctors Make and How to Avoid Them, the Graedons expose the most common medical mistakes, from doctor’s offices and hospitals to the pharmacy counters and nursing homes. Patients across the country shared their riveting horror stories, and doctors recounted the disastrous—and sometimes deadly—consequences of their colleagues’ oversights and errors. While many patients feel vulnerable and dependent on their health care providers, this book is a startling wake-up call to how wrong doctors can be.The good news is that we can protect ourselves, and our loved ones, by being educated and vigilant medical consumers. The Graedons give patients the specific, practical steps they need to take to ensure their the questions to ask a specialist before getting a final diagnosis, tips for promoting good communication with your doctor, presurgery checklists, how to avoid deadly drug interactions, and much more.           Whether you’re sick or healthy, young or old, a parent of a young child, or caring for an elderly loved one, Top Screwups Doctors Make and How to Avoid Them is an eye-opening look at the medical mistakes that can truly affect any of us—and an empowering guide that explains what we can do about it.",
  "genres": [
    "Nonfiction",
    "Health",
    "Medicine"
  ],
  "author": "Joe Graedon",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/13330928-top-screwups-doctors-make-and-how-to-avoid-them"
}