{
  "title": "The Big Book of Ghost Stories",
  "description": "It’s time for cozy sweaters and chilling ghost stories! Celebrate the spooky season with this 53-hour compilation that spans over 100 years and features beloved authors like H. P. Lovecraft, Edith Wharton, Joyce Carol Oates, and Donald E. Westlake. “There’s enough in this volume to please both dilettantes and devotees among ghost story readers” (Publishers Weekly).The ghost story is perhaps the oldest of all the supernatural literary genres and has captured the imagination of almost every writer to put pen to the page. Here, Edgar Award–winning editor Otto Penzler has followed his keen sense of the supernatural to collect the most chilling and uncanny tales in the canon. These spectral stories span more than a hundred years, from modern-day horrors by Joyce Carol Oates, Chet Williamson, and Andrew Klavan, to pulp yarns from August Derleth, Greye La Spina, and M. L. Humphreys, to the atmospheric Victorian tales of Rudyard Kipling, Edith Wharton, and H. P. Lovecraft, not to mention modern works by the likes of Donald E. Westlake and Isaac Asimov that are already classics. Some of these stories have haunted the canon for a century, while others are making their first ghoulish appearance in book form. Whether you prefer possessive poltergeists, awful apparitions, or friendly phantoms, these stories are guaranteed to thrill you, tingle the spine, or tickle the funny bone, and keep you listening with fearful delight. Including such classics as “The Monkey's Paw” and “The Open Window” and also featuring haunted mansions, midnight frights, lovers from beyond the grave, rapping, tapping, wailing shades, and ghosts, ghouls, and specters galore!Table of ContentsBUT I’M NOT DEAD YETConrad Aiken: Mr. ArcularisWilliam Fryer Harvey AKA {author:W.F. Harvey]: August Heat I’LL LOVE YOU—FOREVER (OR MAYBE NOT)Ellen Glasgow: The Shadowy ThirdEllen Glasgow: The PastDavid Morrell: But At My Back I Always HearO. Henry: The Furnished RoomPaul Ernst: Death’s Warm FiresideAndrew Klavan: The Advent ReunionR. Murray Gilchrist: The ReturnRudyard Kipling: The Phantom RickshawAmbrose Bierce: The Moonlit RoadLafcadio Hearn: The Story of Ming-YLafcadio Hearn: Yuki-Onna THIS OLD HOUSEAmyas Northcote: Brickett BottomE.F. Benson: How Fear Departed from the Long GalleryG.G. Pendarves: Thing of DarknessEdward Lucas White: The House of the NightmareHector Bolitho: The House on Half Moon StreetDick Donovan: A Night of HorrorVincent O’sullivan: The Burned House KIDS WILL BE KIDSRosemary Timperley: HarryMichael Reaves: Make-BelieveA.M. Burrage: PlaymatesRamsey Campbell: Just Behind YouA.E. Coppard: Adam And Eve and Pinch MeSteve Friedman: The Lost Boy of the Ozarks THERE’S SOMETHING FUNNY AROUND HEREMark Twain: A Ghost’s StoryDonald E. Westlake: In At The DeathNathaniel Hawthorne: The Ghost of Dr. HarrisIngulphus: The Everlasting ClubIsaac Asimov and James Maccreigh: Legal RitesAlbert E. Cowdrey: Death Must DieFrank Stockton: The Transferred GhostOscar Wilde: The Canterville Ghost A NEGATIVE TRAIN OF THOUGHTAugust Derleth: Pacific 421Robert Weinberg: The Midnight El STOP—YOU’RE SCARING MEFrederick Cowles: Punch and JudyHenry S. Whitehead: The FireplaceH.F. Arnold: The Night Wire 400Fritz Leiber: Smoke Ghost 406Wyatt Blassingame: Song of the Dead I MUST BE DREAMINGWilkie Collins: The Dream Woman 437Washington Irving: The Adventure of the German Student A SÉANCE, YOU SAY?Joseph Shearing: They Found My GraveEdgar Jepson: Mrs. Morrel’s Last SéanceJoyce Carol Oates: Night-Side CLASSICSM.R. James: “Oh, Whistle and I’ll Come To You My Lad”W.W. Jacobs: The Monkey’s PawW.W. Jacobs: The Toll-HouseEdith Wharton: AfterwardWilla Cather: ConsequencesCynthia Asquith: The FollowerCynthia Asquith: The Corner ShopH.P. Lovecraft: The Terrible Old ManErckmann-Chatrian: The Murderer’s ViolinSaki: The Open WindowSaki: LauraFitz-James O’Brien: What Was It?Alexander Woollcott: Full Fathom FiveH.R. Wakefield: He Cometh and He Passeth ByPerceval Landon: Thurnley Abbey THE FEMALE OF THE SPECIESAlgernon Blackwood: The Woman’s Ghost StoryVictor Rousseau Emanuel: The Angel of the MarneOlivia Howard Dunbar: The Shell of SenseMarjorie Bowen: The Avenging of Ann Leete BEATEN TO A PULPGreye La Spina: The Dead-WagonUrann Thayer: A Soul with Two BodiesArthur J. Burks: The Ghosts of Steamboat CouleeThorp Mcclusky: The Considerate HostsCyril Mand: The Fifth CandleAugust Derleth and Mark Schorer: The Return of Andrew BentleyM.L. Humphreys: The Floor AboveManly Wade Wellman: School for the UnspeakableA.V. Milyer: Mordecai’s PipeJulius Long: He Walked by DayDale Clark: Behind the Screen MODERN MASTERSM. Rickert: Journey into the KingdomH.R.F. Keating: Mr. SaulChet Williamson: Coventry Carol",
  "genres": [
    "Horror",
    "Short Stories",
    "Fiction",
    "Anthologies",
    "Ghost Stories",
    "Ghosts",
    "Halloween"
  ],
  "author": "Otto Penzler",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/13330932-the-big-book-of-ghost-stories"
}