{
  "title": "The Boys of '67: Charlie Company's War in Vietnam",
  "description": "When the 160 men of Charlie Company (4th Battalion/47th Infantry/9th ID) were drafted by the US Army in May 1966, they were part of the wave of conscription that would swell the American military to 80,000 combat troops in theater by the height of the war in 1968. In the spring of 1966, the war was still popular and the draftees of Charlie Company saw their service as a rite of passage. But by December 1967, when the company rotated home, only 30 men were not casualties-and they were among the first vets of the war to be spit on and harassed by war protestors as they arrived back the U.S.In his new book, The Boys of '67, Andy Wiest, the award-winning author of Vietnam's Forgotten Army and The Vietnam War 1956-1975, examines the experiences of a company from the only division in the Vietnam era to train and deploy together in similar fashion to WWII's famous 101st Airborne Division.Wiest interviewed more than 50 officers and enlisted men who served with Charlie Company, including the surviving platoon leaders and both of the company's commanders. (One of the platoon leaders, Lt Jack Benedick, lost both of his legs, but went on to become a champion skier.) In addition, he interviewed 15 family members of Charlie Company veterans, including wives, children, parents, and siblings. Wiest also had access to personal papers, collections of letters, a diary, an abundance of newspaper clippings, training notebooks, field manuals, condolence letters, and photographs from before, during, and after the conflict.As Wiest shows, the fighting that Charlie Company saw in 1967 was nearly as bloody as many of the better publicized battles, including the infamous 'Ia Drang' and 'Hamburger Hill.' As a result, many of the surviving members of Charlie Company came home with what the military now recognizes as Post Traumatic Stress Disorder-a diagnosis that was not recognized until the late 1970s and was not widely treated until the 1980s. Only recently, after more than 40 years, have many members of Charlie Company achieved any real and sustained relief from their suffering.",
  "genres": [
    "History",
    "Nonfiction",
    "War",
    "Military Fiction",
    "Military History",
    "Biography",
    "American History"
  ],
  "author": "Andrew Wiest",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/13331064-the-boys-of-67"
}