{
  "title": "Who Stole the American Dream?",
  "description": "Pulitzer Prize winner Hedrick Smith’s new book is an extraordinary achievement, an eye-opening account of how, over the past four decades, the American Dream has been dismantled and we became two Americas. In his bestselling The Russians, Smith took millions of readers inside the Soviet Union. In The Power Game, he took us inside Washington’s corridors of power. Now Smith takes us across America to show how seismic changes, sparked by a sequence of landmark political and economic decisions, have transformed America. As only a veteran reporter can, Smith fits the puzzle together, starting with Lewis Powell’s provocative memo that triggered a political rebellion that dramatically altered the landscape of power from then until today. This is a book full of surprises and revelations—the accidental beginnings of the 401(k) plan, with disastrous economic consequences for many; the major policy changes that began under Jimmy Carter; how the New Economy disrupted America’s engine of shared prosperity, the “virtuous circle” of growth, and how America lost the title of “Land of Opportunity.” Smith documents the transfer of $6 trillion in middle-class wealth from homeowners to banks even before the housing boom went bust, and how the U.S. policy tilt favoring the rich is stunting America’s economic growth. This book is essential reading for all of us who want to understand America today, or why average Americans are struggling to keep afloat. Smith reveals how pivotal laws and policies were altered while the public wasn’t looking, how Congress often ignores public opinion, why moderate politicians got shoved to the sidelines, and how Wall Street often wins politically by hiring over 1,400 former government officials as lobbyists. Smith talks to a wide range of people, telling the stories of Americans high and low. From political leaders such as Bill Clinton, Newt Gingrich, and Martin Luther King, Jr., to CEOs such as Al Dunlap, Bob Galvin, and Andy Grove, to heartland Middle Americans such as airline mechanic Pat O’Neill, software systems manager Kristine Serrano, small businessman John Terboss, and subcontractor Eliseo Guardado, Smith puts a human face on how middle-class America and the American Dream have been undermined. This magnificent work of history and reportage is filled with the penetrating insights, provocative discoveries, and the great empathy of a master journalist. Finally, Smith offers ideas for restoring America’s great promise and reclaiming the American Dream.Praise for Who Stole the American Dream? “[A] sweeping, authoritative examination of the last four decades of the American economic experience.” —The Huffington Post “Some fine work has been done in explaining the mess we’re in. . . . But no book goes to the headwaters with the precision, detail and accessibility of Smith.” —The Seattle Times “Sweeping in scope . . . [Smith] posits some steps that could alleviate the problems of the United States.” —USA Today “Brilliant . . . [a] remarkably comprehensive and coherent analysis of and prescriptions for America’s contemporary economic malaise.” — Kirkus Reviews (starred review) “Smith enlivens his narrative with portraits of the people caught up in events, humanizing complex subjects often rendered sterile in economic analysis. . . . The human face of the story is inseparable from the history.” —Reuters",
  "genres": [
    "Politics",
    "Nonfiction",
    "Economics",
    "History",
    "American History",
    "Audiobook",
    "Sociology"
  ],
  "author": "Hedrick Smith",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/13331153-who-stole-the-american-dream"
}