{
  "title": "Shadow Woman",
  "description": "NEW YORK TIMES BESTSELLERFrom Linda Howard comes a thrilling and sensual new novel of romance, suspense, intrigue . . . and memories that can kill. SHADOW WOMAN  Lizette Henry wakes up one morning and makes a terrifying discovery: She doesn’t recognize the face she sees in the mirror. She remembers what she looks like, but her reflection is someone else’s. To add to the shock, two years seem to have disappeared from her life. Someone has gone to great and inexplicable lengths to keep those missing years hidden forever. But the past always finds a way to return.   Strange memories soon begin to surface and, along with them, some unusual skills and talents that Lizette hasn’t a clue about acquiring. Sensing that she’s being monitored, Lizette suddenly knows how to search for bugs in her house and tracking devices in her car. What’s more, she can elude surveillance—like a trained agent.   Enter a mysterious and seductive stranger named Xavier, who claims he wants to help—but who triggers disturbing images of an unspeakable crime of which Lizette may or may not be the perpetrator. With memories returning, she suddenly becomes a target of anonymous assassins. On the run with nowhere to hide, Lizette has no choice but to rely on Xavier, a strong and magnetic man she doesn’t trust, with a powerful attraction she cannot resist. As murky waters become clear, Lizette confronts a conspiracy that is treacherous and far-reaching and a truth that, once revealed, may silence her and Xavier once and for all.BONUS: This edition includes an excerpt from Linda Howard's Running Wild.Praise for Shadow Woman  “Dazzling . . . From the opening line, [Shadow Woman] will grab readers and take them on an exhilarating and terrifying adventure!”—RT Book Reviews   “Fast-paced, intricately detailed romantic suspense . . . Readers won’t want to put it down until the extraordinary conclusion. . . . Highly recommended.”—Fresh Fiction   “An intriguing plot and captivating characters [with] lots of drama, tension, intrigue and suspense.”—The Star-Ledger",
  "genres": [
    "Romance",
    "Romantic Suspense",
    "Suspense",
    "Mystery",
    "Contemporary",
    "Fiction",
    "Thriller"
  ],
  "author": "Linda Howard",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/13331181-shadow-woman"
}