{
  "title": "Lazarus Cane",
  "description": "Scott Cane is a tough, slightly emotionally scarred, cold blooded killer. Oh, and he is also a shape-shifter. Over sixty years ago, he was part of an experiment that gave him the ability to morph into anyone whose DNA he sampled.As a military man with a strong sense of justice, Scott Cane began using his ability to stalk serial killers. If a serial killer was stalking cute blonds on bike paths, Scott Cane would become a cute blond and wander bike paths until the killer caught him – at which point he tortures and kills the killer.Being a shape-shifting vigilante is not all its cracked up to be. Scott Cane has to live somewhere and as someone, so why not live as the serial killers he takes out? At least until the authorities get on to him. The only problem, the visions and desires of his host slowly corrode his mind. He has to restrain them, bury them deep and often take medication to suppress them.One more problem… there are agents tracking him down. An elite organization called the Scientific Investigation Agency (SIA) has Cane on their priority list. The SIA is charged with policing all government money given to scientific research. Scott Cane though was their creation… and they want him back.Enter Agent John Hanson. As a former cop in his mid forties, Hanson is driven, methodical, and likes to work alone. The SIA has been content allowing Agent Hanson to track Cane from life to life and cover up the victims he leaves in his wake, but not for long. The agency wants results and decides the best way to get them is to assign a new agent to help.Cynthia Gates is a profiler by trade. She works freelance helping local police departments find killers and working with prosecutors to pick juries. She is the best at what she does. But can she profile a man that cane be anyone?Lazarus Cane is a nonstop cat and mouse hunt. Cane hunting a killer, agents hunting Cane, and in the middle a torrent love affair between Cynthia Gates and who she thinks is a young heiress.Set among the creepy live oaks of South Carolina’s lowcountry, a killer is loose and no one knows who is really hunting who.",
  "genres": [
    "Fiction",
    "Thriller",
    "Shapeshifters"
  ],
  "author": "Jeremy Kline",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/13331523-lazarus-cane"
}