{
  "title": "Jim Knighthorse Series: All Three Books",
  "description": "Boxed set of four #1 bestselling mystery novels featuring private investigator, Jim Knighthorse, HORSE (Book 1)When high school student Derrick Booker, the only black student at a posh Orange County high school, is accused of killing his white girlfriend, ex-college football hero and detective Jim Knighthorse is hired to dig a little deeper into the murder. It doesn't take long for Knighthorse to realize that not all is as it seems at tranquil Huntington High, from a band director who preys on the innocent to a vice-principal with a secret agenda of her own. Not to mention someone's hired a professional killer to keep Knighthorse permanently off the case. As the investigation continues, Knighthorse's personal life is shattered by the discovery of new evidence relating to his mother's unsolved murder, a murder dating back twenty years. Reeling from the discovery, a determined Jim Knighthorse sets out to bring two killers to justice.THE MUMMY CASE (Book 2)Private investigator Jim Knighthorse takes on a very, very cold case. When historian Willie Clarke dies of mysteriously of dehydration in the California deserts, ex-football hero Jim Knighthorse is hired to dig a little deeper—and discovers a shocking connection to one of the West's oldest mysteries. Over a hundred years ago, an unnamed cowboy was murdered in the California desert and, due to freak weather conditions, would become mummified within twenty-four hours. Now known to the world as Sylvester the Mummy and displayed in a creepy curiosity shop, Sylvester and historian Willie Clarke will be forever linked in mystery. That is, unless private investigator Jim Knighthorse can survive long enough to untangle one of the West's greatest unsolved murders.HAIL MARY (Book 3)In this third book of the series, private investigator Jim Knighthorse finds himself on the trail of his mother's killer, a cold case spanning two decades. While on the hunt, he takes on a brutal case that takes him into shark-infested waters and deep into the heart of Mexico. All the while, Knighthorse comes closer and closer to finding his mother's killer... and there's going to be hell to pay.CLEAN SLATE (Book 4)Private investigator Jim Knighthorse is hired to find out if Freddie Calgary, a popular movie and TV star, really did overdose and die two years ago, or, amazingly, if he faked his death and is in hiding. As always, Jim is up to the task...and in need of money. His surreal investigation soon turns into one big road trip as he follows the clues from Los Angeles to Sedona and finally to San Antonio. There, Jim Knighthorse is about to discover that not only can miracles happen, but the world is a far darker and creepier place than even he ever imagined.EASY RIDER (Novella)When Knighthorse discovers a female burglar sleeping in his office, he officially knows his day is off on the wrong foot. Camry is a woman who knows too much. On the run, she asks for Knighthorse’s protection from her biker ex-boyfriend, Steel Eye, whom she says has murdered someone. Except no one ever leaves this biker gang. Well, alive that is. Jim Knighthorse might have something to say about that... a lot to say, actually. As he digs for the truth about the murder, an imminent showdown in the desert looms. There will be action, and there will be blood. A lot of blood. But not even Jim can take on a gang of bikers alone. Luckily, he has friends in low places.Click BUY NOW or READ FOR FREE today!",
  "genres": [
    "Mystery",
    "Fiction"
  ],
  "author": "J.R. Rain",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/13334771-jim-knighthorse-series"
}