{
  "title": "All Torc'd Up",
  "description": "“The Skokie Swift is an express train. For 20 minutes I am warm, and even seated, while the train barrels out the northern tip of Chicago and into the suburbs with no stops in between. Hell begins when the doors shut and I am trapped on this train for 20 minutes and unable to scream aloud, though in my mind my scream has the same pitch and cadence as the squeal of the wheels on the tracks when we round a curve. Each morning I am subject to the kind of anxiety that keeps some people from ever boarding a plane or an elevator in their lives: rising panic, choking fear. My heart palpitates. I hear it in my ears so loudly I hear little else.”In 1973 Holly’s life consists of chasing cockroaches with a shoe, working at a low-paying job, and sleeping. Her apartment is an area of devastation. She has no money for food, so she typically goes to bed early to escape the hunger. She hopes to understand why her mentally ill mother committed suicide long ago, and how to overcome the panic attacks, the periodic rages and the depression that plague her. Thus far, her psychiatrist offers no answers, so she seeks the answers on her own by reading college textbooks on Abnormal Psychology. They don't help her either because she suffers from a condition that will not be known or recognized in medical and psychiatric circles for another 10 years.Holly unexpectedly falls in love with a roadie for a famous English rock band. Dreams of marriage and children and a “normal” life are suddenly within her grasp, when Trevor takes her with him on tour and introduces her to the very \"un-normal\" backstage world of Rock and Roll. She urgently must conceal her problems and symptoms from Trevor if she is to keep him. But as their relationship gets progressively more serious, her illness gets increasingly difficult to hide.",
  "genres": [],
  "author": "Nell Gavin",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/10366580-all-torc-d-up"
}