{
  "title": "The Bitch",
  "description": "The Bitch explores the dark choices that Jake, as a two-time offender faces to save both his life and his soul—life imprisonment if caught for the third time under the federal ha-bitch-ual criminal law—known to outlaws as \"The Bitch.\" Choices that may cost him everything and everyone he loves. What are the limits of loyalty? What is the spiritual process by which a savvy hair designer deteriorates into a mass murderer? A work in the cold existentialist tradition of Sartre and Camus, and the transgressive fiction of Celine, The Bitch struggles for answers and, on finding them, a way out.ABOUT THE AUTHORLes Edgerton is an ex-con who spent two years in prison for burglary at the Pendleton Reformatory in Indiana. Since his release, he has earned a B.A. from Indiana University and an MFA in Writing from Vermont College. This will be the thirteenth book he has published, with several more forthcoming later this year and next, including a short story collection, an existential noir novel, a new black comedy novel, and his memoir. His career for many years as an outlaw and criminal lend an air of rare verisimilitude to his crime novels.PRAISE FOR THE BITCHTHE BITCH is the kind of raw crime fiction that's right up my alley, like sandpaper for the brain. Edgerton has got the chops. Mad chops. Gonna make us all ashamed of our puny efforts one day.—Anthony Neil Smith, author of CHOKE ON YOUR LIESTHE BITCH is a vicious barnstormer of a novel, a noir rollercoaster that won't let you unbuckle until that final three-word smackdown. Les Edgerton is Eddie Bunker's pulpy cousin and Eugene Izzi's soul brother, and with a spiritual family like that, you can't go wrong. Pick it up immediately.—Ray Banks, author of DEAD MONEYLes Edgerton doesn’t pussyfoot around. He writes about real people drowning in desperation in THE BITCH. He’s got a story to tell you so get ready; it’s coming at you fast. Get ready…—Linwood Barclay, author of NEVER LOOK AWAY AwayLes Edgerton’s brilliantly hardboiled THE BITCH is the tense and hard hitting story of Jake Bishop, a reformed ex-con whose dark past drags him back into a life of crime like an umbilical cord tied tight around his neck.—Paul D. Brazill, author of 13 SHOTS OF NOIRI liked THE BITCH so much that I wanted to publish it. But we lost out and Bare Knuckles Press got a hell of a book. The Bitch is a dark crime fiction story that never once pulls a punch or ducks behind some bullshit like “happy endings” or “closure.” The Bitch isn't afraid to stay dark until the very end.—Brian Lindenmuth, editor/publisher of Snubnose Press and SPINETINGLER MAGAZINEFrom its opening sentence to its last, THE BITCH is an engrossing journey into some very dark places. Les Edgerton writes like a poet with a mean streak, and his prose goes down easy and smooth like good liquor as it carves up your insides.—Henry Perez, author of MOURN THE LIVINGImagine, if you will, Les Edgerton, Dashiell Hammett and Raymond Chandler sipping straight whiskey while swapping lies in the back booth of the Linebacker bar as the “noir” legends welcome Edgerton into the brotherhood of broken dreams. With THE BITCH, Edgerton earns his way into this special literary brotherhood. No, The Bitch isn’t a wild woman, but prison slang for “ha-BITCH-ual criminal.” This is a taut tale of double-cross, death, diamonds and destruction as Jake Bishop fights to protect all he holds dear—his freedom, his pregnant wife, and his teen-age brother—by holding THE BITCH at bay when trapped into one last job. Sam Spade and Phillip Marlowe could learn a thing or two from this hairdresser.—Bob Stewart, author of REMORSE",
  "genres": [
    "Crime",
    "Noir",
    "Novels",
    "Fiction"
  ],
  "author": "Les Edgerton",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/13341596-the-bitch"
}