{
  "title": "Judgment Call",
  "description": "New York Times bestselling author J. A. Jance brings back acclaimed sheriff Joanna Brady in an exciting and twisting mystery set against the beauty and isolation of the Arizona desertJudgment CallWhen Joanna Brady's daughter, Jenny, stumbles across the body of her high school principal, Debra Highsmith, in the desert, the Cochise County sheriff's personal and professional worlds collide, forcing her to tread the difficult middle ground between being an officer of the law and a mother. While investigating murders has always meant discovering unpleasant facts and disquieting truths, the experienced Joanna isn't prepared for the knowledge she's about to uncover. Though she's tried to protect her children from the dangers of the grown-up world, the search for justice leads straight to her own door and forces her to face the possibility that her beloveddaughter may be less perfect than she seems—especially when a photo from the crime scene ends up on Facebook. A photo only one person close to the crime scene could have taken.The gruesome picture is just the tip of the iceberg. Even a small, close-knit town like Bisbee has its secrets. Navigating her way through the unfamiliar world of social media, Joanna discovers shocking—and incriminating—information. The details build, from a hushed-up suspension, to a group of teenagers with a grudge against the late Ms. Highsmith, to a hateful video calling for the principal's death. The video evidence points to one particular privileged boy, who's already lawyered up thanks to his father, a well-to-do doctor determined to protect his son's reputation. Yet the deeper Joanna digs, the more complications she uncovers. It seems the quiet, upstanding principal had a hidden past, full of mysterious secrets she'd successfully kept buried for years.As the seasoned sheriff juggles professional constraints and personal demands—budget cuts, new team members, an arrogant coroner, a confused teenager, a precocious toddler, and a high-maintenance mother—she finds herself walking a fine line between justice and family that has never been so blurred.",
  "genres": [
    "Mystery",
    "Fiction",
    "Audiobook",
    "Suspense",
    "Mystery Thriller",
    "Crime",
    "Thriller"
  ],
  "author": "J.A. Jance",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/13342424-judgment-call"
}