{
  "title": "Angel of Mercy",
  "description": "When Mercy wakes up in the hospital after a brutal stabbing, she has little recollection of the attack; only the blurred memories of a mysterious stranger with piercing blue eyes that haunts her dreams. Remembering enough of her own identity, (Name – Merceline Renault, check. Occupation – bartender at the nightclub Eden in Seattle, check. Phone number, ABC’s and the lyrics to every musical ever made, check.) Mercy struggles to piece together the events that brought her to the ICU at Northwest Hospital. When the blue-eyed stranger turns up in her hospital room, Mercy assumes it’s the medication that’s bringing her dreams to life.Mercy is stunned to find her wounds virtually healed with only the faintest trace of a scar left. Even more jarring, the surprised eyes that look back at her in the mirror are no longer her own familiar brown but a startling shade of blue – the same blue as her mystery man. After spotting the same man, that only she can see , Mercy follows him home, brazenly confronting him. (kids at home, never do that!) Her savior turns out to be less than human, or is it more?Samael is a fallen angel, bound to the Earth and living out his life among humans but apart from them. Sam and his brethren dwell among us, never seen, never heard, but always watching… and on occasion, intervening to atone for sins great enough to be cast down from heaven. Unwilling to let an innocent die, Sam bestowed some of his Grace to Mercy, healing her wounds and accidentally imbuing her with some of his angelic powers.Thrust into a world within her own where angels and demons coexist unseen by mere mortals, Mercy must learn to accept the fact that she is no longer strictly human; she is something new. Complicating things is Adamiel, the reckless fallen angel who is Sam’s enigmatic friend. In every way that Sam is light, Adam is dark, from his jet black hair to his wicked smile. Equal parts information and aggravation, Sam and Adam help Mercy acclimate to her new life.Determined to find a balance between her new abilities and juggling friends, family, job and others who are attracted to her Grace, Mercy struggles to play catch up before she draws too much unwanted attention from the powers that be and their minions. But now Mercy’s eyes are opened to a whole new world beyond the human realm… and their eyes are opened to her.",
  "genres": [
    "Angels",
    "Paranormal",
    "Romance",
    "Paranormal Romance",
    "Urban Fantasy",
    "Fiction",
    "Amazon"
  ],
  "author": "Lisa Olsen",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/13344911-angel-of-mercy"
}