{
  "title": "The Pit Bull Placebo: The Media, Myths and Politics of Canine Aggression",
  "description": "First it was the Bloodhound, sensationalized in the dramatizations of Uncle Tom's Cabin. Then it was the Doberman, symbol of the Nazi menace. Today, it is the Pit bull that is vilified for the depravity of his masters. Today, police chase down fleeing Pit bulls in the street, firing dozens of wild shots in response to media-fed rumors of supernatural Pit bull abilities. Politicians coach and nurture this fear with their own brand of rhetoric used to assist in the passing of quick and ineffective legislation created to pacify communities ignorant of the real cause for dog attacks. Hundreds of animal shelters throughout the country kill all unclaimed Pit bull-looking dogs, as they are deemed \"unadoptable\" solely on their physical appearance. This has occurred because the human/dog bond, the most complex and profound inter-species relationship in the history of mankind, has been reduced to a simple Breed of dog = degree of dangerousness. We have come to accept that hanging entire breeds of dogs in effigy for the sins of their owners is an acceptable solution to canine aggression because we have been placated by a Pit Bull Placebo. Like the pharmacologically inactive sugar pill dispensed to pacify a patient who supposes it to be medicine, eradication of the Pit bull is the placebo administered to ease the public's anxiety about dog attacks. The book, The Pit Bull The Media, Myths and Politics of Canine Aggression, explores how our views and beliefs about canine aggression have changed over the last 150 years and how our perceptions about the nature and behavior of dogs has been influenced by persons and organizations who often times disseminate information about dog attacks which is tailored to further an agenda unrelated to the improvement of the human/dog bond. We are in the midst of a social hysteria about Pit bulls because we have abandoned centuries-old common-sense and have been duped by inaccurate reporting from the \"Pit Bull Paparazzi\" and by politicians who traffic in rumors, myths and pseudoscience in their efforts to pass legislation that demonizes dogs while exonerating criminal and abusive owners. If we truly believe that the extremely rare cases of fatal dog attacks merit extreme measures in the management of dogs, if our concern and shock is genuine, then we must be equally genuine and sincere in seeking out and addressing the real causes for these incidents. Only by stepping back from the swirl of present-day hysteria surrounding isolated cases of severe canine aggression and examining the problem from a broader and more objective perspective can we hope to understand and address the human and canine behaviors which contribute to these incidents.",
  "genres": [
    "Dogs",
    "Nonfiction",
    "Animals",
    "Sociology"
  ],
  "author": "Karen Delise",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/1334486.The_Pit_Bull_Placebo"
}