{
  "title": "Covet",
  "description": "The hottest vampire romance series you'll read this year! Step behind the curtain of Vampirerotique and discover a dangerously seductive world of vampires, shifters, fae and angels in this series of passionate page-turning forbidden romances. They've burned for each other for two years, the forbidden attraction between them growing each night.Now resisting the sinful desires of their hearts is becoming impossible.Javier knows better than to succumb to his hunger for Lilah, a mortal female belonging to a powerful patron of Vampirerotique, the theatre he runs with three other vampires. A single touch is all it would take to break the sacred law of his kind, sentencing himself to death, but his passion for her has become too fierce to ignore.He will risk everything to claim Lilah. Lilah has fought her desire for Javier, but each glance he steals, his eyes promising pleasure and so much more, ignites a fire inside her that will no longer be denied. She will risk everything to win his heart and her freedom.When their resistance burns away in the heat of a wild moment, what will await them--the eternity they desire or death? If you love passionate, steamy paranormal romances with no cliffhangers and no cheating, and plenty of bite, then you won't be able to put down this addictive series of vampire romances from an NY Times and USA Today best-selling author of over 60 books!Grab your copy now and get ready to scorch your Kindle with this hot vampire romance. Enter the dark, sinful and seductive world of the four vampire owners of London's premier vampire theatre, Vampirerotique, and discover how these powerful vampires will be brought to their knees by the women who claim their hearts in this passionate, intense and thrilling vampire romance series from New York Times and USA Today best-selling paranormal romance author Felicity  Book 1: Covet Book 2: Crave Book 3: Seduce Book 4: Enslave Book 5: Bewitch Book 6: Unleash",
  "genres": [
    "Vampires",
    "Paranormal",
    "Paranormal Romance",
    "Romance",
    "Erotica",
    "Fantasy",
    "Erotic Romance"
  ],
  "author": "Felicity Heaton",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/13346791-covet"
}