{
  "title": "The Kinshield Saga",
  "description": "Omnibus contains The Kinshield Legacy and The Wayfarer King. Also includes the novella Sole Sacrifice.The Kinshield Legacy (book 1)A mysterious stone tablet with five magical gems has sat abandoned in a cave for two hundred years. The kingdom is in ruins, with only warrant knights to keep the peace. But then, the gems in the tablet, one by one, disappear.Warrant knight Gavin Kinshield is a man of many secrets. He's the one deciphering the runes in the tablet. Unless he can find a suitable replacement, he'll be Thendylath's next king. All he really wants is the letter written by his ancestor Ronor Kinshield, champion to King Arek, confessing the truth of how the king perished... a letter he must earn by tracking down a common thief.But when Gavin saves a woman's life, what should have been a simple task draws him face-to-face with his nightmarish past... and the truth of King Arek's demise.The Wayfarer King (book 2)Beyonders, evil beings that materialize without warning from the realm of chaos, continue to invade the world of men, destroying everything -- and everyone -- in their path. The most powerful of them all, Ritol, has been confined for two hundred years inside the palace in Thendylath, trapped by King Arek's magic.Having newly claimed the right to rule Thendylath as king, Gavin Kinshield has no money or army, but he's determined to protect his people from the beyonder attacks. With his new power of Wayfarer, Gavin has the ability to journey to all seven realms. To end the invasion, he must travel to the realm of chaos and summon Ritol. But can he escape before the beyonder champion kills him, devours his soul and takes his place as Wayfarer?If wizard Brodas Ravenkind has his way, Gavin will never make it that far. Not only does Ravenkind want the throne for himself, he wants revenge for his cousin's murder too. After all, he made a promise the first time Gavin crossed him…",
  "genres": [],
  "author": "K.C. May",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/13349719-the-kinshield-saga"
}