{
  "title": "Crave",
  "description": "His mind has been set on his work for the past one hundred years. Now a forbidden beauty has stolen his attention and is threatening to steal his heart too.  Callum has come to the city of romance on business, not pleasure, but when he sets eyes on a gorgeous werewolf in a nightclub, he can’t ignore the dark carnal craving she ignites in him. His work for Vampirerotique, the theatre he runs with three other vampires, can wait. The only thing that matters now is satisfying his sinful hunger for a woman who most vampires would consider an enemy.  Kristina is on the run from her pack. Her alpha is intent on forcing her to bear his child and she’s not about to live through the same nightmare as her mother had. When a tall, dark and sexy vampire catches her eye, she can’t believe the ferocity of the desire he unleashes in her or the fact that she enjoys the feel of his eyes on her and his silent pursuit of her in the clubs each night.  When Kristina finally gets a taste of Callum in a forbidden kiss, will she be strong enough to resist the allure of the vampire and his offer to share his bed for a week of unbridled, wild nights, or will she surrender to her own craving for the safety and passion she finds in his embrace?   London Vampires is the hottest vampire series you'll read this year, so grab your copy now!  This series is complete at 6 books and features vampire romances with plenty of steam, lots of bite, NO cheating and NO cliffhangers.   Enter the dark, sinful and seductive world of the four vampire owners of London's premier vampire theatre, Vampirerotique, and discover how these powerful vampires will be brought to their knees by the women who claim their hearts in this passionate, intense and thrilling vampire romance series from New York Times and USA Today best-selling paranormal romance author Felicity Book 1: Covet Book 2: Crave Book 3: Seduce Book 4: Enslave Book 5: Bewitch Book 6: Unleash",
  "genres": [
    "Vampires",
    "Paranormal",
    "Paranormal Romance",
    "Erotica",
    "Romance",
    "Fantasy",
    "Adult"
  ],
  "author": "Felicity Heaton",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/13352111-crave"
}