{
  "title": "قصر الذئاب",
  "description": "نبذة النيل والفرات:هذه رواية \"قصر الذئاب Wolf Hall\" الحائزة على جائزة \"مان بوكر\" لعام 2009 من تأليف الروائية \"هيلاري مانتيل\" الذي تأخذنا فيها إلى كواليس عشرينيات القرن السادس عشر من تاريخ إنجلترا برواية تعرض بواقعية نقدية بريطانيا التيودورية كمجتمع غير متكامل عبر شخصيات تمثل ثقافة عصر النهضة بالعمل على استكشاف نقاط التقاطع بين النفسي الفردي والسياسي الأوسع نطاقاً.عند هذا المنعطف التاريخي تبدو إنجلترا قاب قوسين أو أدنى من كارثة حقيقية، فلو أن الملك هنري الثامن مات دون أن يعقب وريثاً ذكراً للعرش، لتعرضت البلاد للدمار في غمار حرب أهلية دامية.هكذا لم يكن من العجيب أن هنري الثامن كان مشغولاً بتحقيق رغبته الجارفة في إبطال زواجه الذي دام عقدين من الزمن من كاترين، للزواج من آن بولين، وهي الرغبة التي كان يعارضها بابا روما ومعظم ملوك أوروبا وأمرائها.وعلى امتداد الرواية نتابع الدمار الذي يتعرض له الكاردينال اللامع وولزي المستشار المتألق للملك هنري الذي يسقط إزاء عجزه في تحقيق رغبة الملك مخلفاً وراءه فراغاً في السلطة ومأزقاً.وسط هذه الأزمة تشتد الحبكة الروائية بظهور \"توماس كرومويل\" الذي يجمع بين الجاذبية الشديدة والنزوع إلى التنمر، ويملك قدرة فريدة على قراءة الناس من حوله على الرغم من أنه محارب مرتزق وابن حداد قاسٍ، فبدا كسياسي عبقري، وراشٍ، ومستأسد يحظى بطاقة لا حدود لها لمزيد من العمل والإنجاز، لقد خرق كرومويل جميع قواعد المجتمع الصارمة في صعوده إلى السلطة، وبدا أكثر استعداداً لخرق المزيد منها.قام من رماد كارثة شخصية، إذ إنه خسر عائلته، كما خسر سيده المحبوب وولزي وشق طريقه بسلاسة في بلاط يسود فيه قانون الغاب، وشريعة الذئاب ليواجه بمفرده البرلمان والمؤسسة السياسية والبابوية، لإعادة صياغة بريطانيا وفقاً لرغباته ورغبات هنري الثامن في إنجاز عمل الكاردينال القائم على إغلاق الدور الدينية لبناء المدارس والجامعات فهل سينجح كرومويل في تغيير وجه إنجلترا القرن السادس عشر أم أنه سيجد أمامه ما لم يكن في الحسبان؟",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Audiobook",
    "Book Club",
    "British Literature",
    "Literary Fiction"
  ],
  "author": "Hilary Mantel",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/10368711"
}