{
  "title": "Mrs. Goodfellow: The Story of America's First Cooking School",
  "description": "Recovering the Life and Influence of the “Mother of American Cooking,” the Woman Who Changed the Way We Learn How to Prepare MealsIn Philadelphia during the first decades of the nineteenth century, a widow, Mrs. Elizabeth Goodfellow, ran a popular bakery and sweet shop. In addition to catering to Philadelphia’s wealthy families and a reputation of having the finest desserts and sweet dishes in the young country, her business stood out from every other establishment in another way: she ran a small school to learn the art of cooking, the first of its kind in America. Despite her fame—references to her cooking as a benchmark abound in the literature of the period—we know very little about who she was. Since she did not keep a journal and never published any of her recipes, we have to rely on her students, most notably Eliza Leslie, who fortunately recorded many of Goodfellow’s creations and techniques. Goodfellow is known to have made the first lemon meringue pie and for popularizing regional foods, such as Indian (corn) meal. Her students also recall that Mrs. Goodfellow stressed using simple wholesome ingredients that were locally grown, presaging modern culinary fashion.By assembling the many parts of this puzzle from old recipe books, advertisements, letters, diaries, genealogical records, and other primary sources, researcher and writer Becky Diamond has been able to provide a more complete portrait of this influential figure in cooking history. Mrs. Goodfellow: The Story of America’s First Cooking School begins with what we know about Elizabeth Goodfellow—where she was born, her husbands, her children, where her shop was located. We then travel back in time to discover the kinds of foods that would have been available to Goodfellow and how she may have used them. The book next turns to the rise of both commercial eating establishements and books of recipes. From here, the author explains the rapid expansion of cooking schools, such as the New York Cooking Academy and the Boston Cooking School, made famous through its association with Fannie Farmer, and ends with a discussion of the role of celebrity chefs. Thoroughly researched and including a range of authentic recipes, Mrs. Goodfellow is a delicious exploration of the life and legacy of one of America’s most influential cooks.",
  "genres": [
    "Nonfiction",
    "Cooking"
  ],
  "author": "Becky Libourel Diamond",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/13356932-mrs-goodfellow"
}