{
  "title": "True at First Light",
  "description": "Both a revealing self-portrait and dramatic fictional chronicle of his final African safari, Ernest Hemingway's last unpublished work was written when he returned from Kenya in 1953. Edited by his son Patrick, who accompanied his father on the safari, True at First Light offers rare insights into the legendary American writer in the year of the hundredth anniversary of his birth.A blend of autobiography and fiction, the book opens on the day his close friend Pop, a celebrated hunter, leaves Ernest in charge of the safari camp and news arrives of a potential attack from a hostile tribe. Drama continues to build as his wife, Mary, pursues the great black-maned lion that has become her obsession. Spicing his depictions of human longings with sharp humor, Hemingway captures the excitement of big-game hunting and the unparalleled beauty of the scenery -- the green plains covered with gray mist, zebra and gazelle traversing the horizon, cool dark nights broken by the sounds of the hyena's cry. As the group at camp help Mary track her prize, she and Ernest suffer the \"incalculable casualties of marriage,\" and their attempts to love each other well are marred by cruelty, competition and infidelity. Ernest has become involved with Debba, an African girl whom he supposedly plans to take as a second bride. Increasingly enchanted by the local African community, he struggles between the attraction of these two women and the wildly different cultures they represent. In True at First Light, Hemingway also chronicles his exploits -- sometimes hilarious and sometimes poignant -- among the African men with whom he has become very close, reminisces about encounters with other writers and his days in Paris and Spain and satirizes, among other things, the role of organized religion in Africa. He also muses on the act of writing itself and the author's role in determining the truth. What is fact and what is fiction? This is a question that was posed by Hemingway's readers throughout his career and is one of his principal subjects here. Equally adept at evoking the singular textures of the landscape, the thrill of the hunt and the complexities of married life, Hemingway weaves a tale that is rich in laughter, beauty and profound insight. True at First Light is an extraordinary publishing event -- a breathtaking final work from one of America's most beloved and important writers.",
  "genres": [
    "Fiction",
    "Classics",
    "Africa",
    "Literature",
    "Travel",
    "American",
    "Novels"
  ],
  "author": "Ernest Hemingway",
  "average_rating": "3.34",
  "url": "https://www.goodreads.com/book/show/133595.True_at_First_Light"
}