{
  "title": "My Ride With Gus",
  "description": "First published in 1996New Year's Eve, 1995. Rising young architect Jimmy Gambar is on top of the world, ready to pop the question to the girl of his dreams at a fancy restaurant. Ten minutes later he snaps and storms out, leaving behind the girlfriend, her ridiculous gift of a hot pink necktie and the precise way of life he's known for so long.Later that night, big trouble - a sleazy downtown bar, a shady lady with a switchblade in his SoHo loft, an accidental fall against a metal lamp. Now Jimmy has a dead woman's body lying on his rug, and only one person to turn to - a man he hasn't seen in twenty years. His big brother Gus (\"The Ghost\") Gambuzza. \"What started out as a wild ride to get rid of a corpse ends up as a touching and believable story of family love and survival, a testament to Carillo's storytelling abilities.\"- Publishers Weekly \"What a lovely book this is...a long night filled with happenings that should seem improbable but don't because Carillo's reality is so inviting...a tender tale, albeit knowing and funny too.\"- New York Daily News \"Reminisent of the movie 'After Hours,' this nightmarish picaresque novel mixes elements of slapstick, the surreal, and the absurd, all delivered in rambunctious, wildly profane Brooklynese.\"- Booklist \"Oddly heartwarming\"-London Gentleman's Quarterly\"A classic New York gangster story, replete with world-weary hoods, fruity dialogue and witty one-liners...the observations of Brooklyn life and the redemption of Jimmy's soul are warm and almost profound.\"-London Daily Telegraph \"An inspired marriage of the pciaresque narrative and the road movie in which Gus, worldly wise and world weary, and Jimmy, his paranoid straight man, move through a series of hilarious near-disasters.\"- Newport News Daily Press \"Carillo sustains his deliberately improbably narrative with elan, piling up the jokes in the best comic-thriller tradition.\"-The Times of London \" 'My Ride With Gus' is a funny, touching, ultimately exhilarating trip with people who will stay with you long after the trip ends. It's a novel about the mob, about love, about family, one that could only come together in the hands of someone who knows how to tell a story, and knows New York City just as well.\"- Mike Lupica \"...continuing suspense and snappy, wisecracking dialogue.\"-The London Independent \"My Ride With Gus is at times hilarious, and at others it is a moving account of just what family and life and society is all about.\"- The Pilot, Southern Pines, N.C.\" 'My Ride With Gus' is outrageously funny, with Brooklynese molding the scnee...zany characters, bizarre predicaments, hilarious subplots and downright scary situations.\"-The Post and Courier",
  "genres": [
    "Fiction",
    "Amazon",
    "Mystery Thriller",
    "Mystery"
  ],
  "author": "Charles Carillo",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/13359884-my-ride-with-gus"
}