{
  "title": "Thrilled to Death: A Detective Jackson Mystery",
  "description": "Are you looking for a great new mystery/thriller series with compelling characters and distinctive plots that pull you from book to book? You've found it! Fans of Connelly and Crais love the Detective Jackson series too, and Mystery Scene magazine calls it \"thrilling.\"***A young widow with an infant son and second thoughts about motherhood. A young heiress with fame, fortune, and reckless desires. When the first goes missing and the second turns up dead, both cases land on the desk of Detective Wade Jackson--along with a world of complications.While Jackson has a personal stake in the disappearance--the girl's former mother-in-law is the woman he loves--his department superiors have a political interest in the the heiress's mother is a wealthy, powerful benefactor. Caught in the middle with no evidence of foul play on either front, Jackson may be chasing shadows.The police chief turns up the heat as the girls' loved ones lose hope, so Jackson has to go for broke and piece together the puzzle of a psychiatrist, an agoraphobic strip-club owner, a benevolent organization for needy mothers, and a bizarre service for edgy thrill-seekers. Dark territory holds few surprises for a veteran cop like Jackson, but there are some shocking places even he's never been...until now.***\"Sellers knows how to wring as much tension as possible from her intricate, socially relevant plots, but it is her talent for creating intriguing characters that makes her suspense novels so memorable. In fact, she's so good that it's surprising she hasn't yet broken through into suspense super-stardom.\"--Mystery Scene magazine\"This thriller is every bit as exciting and suspenseful as her earlier books. Fast-paced, well-plotted and with terrific writing, the book is highly recommended.\"--Spinetingler magazine\"The Detective Jackson series rolls along with this exhilarating entry. The first sentence will draw you into the story and keep you guessing until the surprising ending.\"--RT Reviews\"Ms. Sellers has a delightfully twisted mind and the talent to take her unsuspecting readers down trails that fork and bend back and curve and twist until at the end, you have a sense of satisfaction coupled with a pleasant mental exhaustion as your mind wanders back to how you got there... You are gonna love this thriller.\" --BookBitch.com\"L. J. Sellers is a wonderful storyteller...There are plenty of twists and turns... The characters are well-developed and engaging. Readers new to the series can begin with THRILLED TO DEATH and then go back to the other books in the series. It's a fast read. Perfect for summer reading. The first page will grab the reader's attention and from there, it's an exciting read all the way through to the final page.\"--OverMyDeadBody.com",
  "genres": [
    "Mystery",
    "Fiction",
    "Crime",
    "Thriller",
    "Audiobook",
    "Mystery Thriller"
  ],
  "author": "L.J. Sellers",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/10045995-thrilled-to-death"
}