{
  "title": "The Waters of Babylon: A Novel About Lawrence After Arabia",
  "description": "A brilliantly imagined and elegantly written novel that speculates on the enigmatic life of the legendary T. E. Lawrence following his retreat from celebrity as \"Lawrence of Arabia,\" \"The Waters of Babylon\" focuses on the story of Lawrence's life after Arabia -- although in fully creating its character, the narrative ranges from his childhood as a troubled boy and youth, to his first adventures in the Middle East, through his years in India and his final days at Clouds Hill. Peopling his story with some of the great figures of the twentieth century, author David Stevens has created a challenging portrait of a man who gave up fame to pursue his ideals. For decades, the story of T. E. Lawrence has been shrouded in the trappings of modern mythology -- thanks in great part to his immortalization on film as a charismatic, larger-than-life figure -- and for all intents and purposes his life ended at a point of glory and celebrity. As depicted in David Stevens's novel, however, the reality was far different from the myth.In fact, following his brief but shining moment in the spotlight of public consciousness, Lawrence attempted a retreat into anonymity, abandoning his celebrity and joining the Royal Air Force -- not as a ranking officer, as would have been his due, but as a regular airman, an erk. This much of Lawrence's story David Stevens knows to be fact, because Stevens's father spent time in the Air Force with Lawrence (whom he disliked). Using his father's recollections as a springboard, and employing extensive research, Stevens has crafted an amazingly rich and detailed novel about the life Lawrence may very well have led during his years as a soldier, and after.Thenovel begins with Lawrence, who has reinvented himself as T. E. Shaw, headed back to the part of the world in which he had initially gained recognition and notoriety. With his return comes a flood of memories and associations, some of them sweet, many of them painful. As he adjusts to his new life as an ordinary airman in the RAF, he gradually surrenders his privacy, and a bond develops between him and the other men. An odd kind of love/hate relationship even arises between Lawrence and another of his bunkmates, a loner named Slaney.Over the course of the novel, which carries the reader all the way to Lawrence's death, we learn much of the background for this enigmatic man's behavior, including details of his upbringing (by a harsh, religiously fanatical, unforgiving mother) and of his romantic experiences (mostly furtive and unacknowledged longings after men, although one proves the exception and becomes the basis for his fantasies).Part a search for love, part confessional, part detective story, \"The Waters of Babylon\" is a fascinating, multilayered portrait of a remarkable, complex man who became a legend in his own lifetime -- and who spent the rest of that life trying to escape his own fame.",
  "genres": [
    "Historical Fiction",
    "LGBT",
    "Gay",
    "Fiction"
  ],
  "author": "David       Stevens",
  "average_rating": "3.32",
  "url": "https://www.goodreads.com/book/show/1036957.The_Waters_of_Babylon"
}