{
  "title": "Clockwork Girl",
  "description": "Urban fairy tales for the weird girl in all of us. Athena Villaverde is a brave new voice in the world of offbeat young adult fiction. Like a combination of Francesca Lia Block, Charles de Lint, Kathe Koja, Tim Burton, and Hayao Miyazaki, her stories are cute, kinky, edgy, magical, provocative, and strange, full of poetic imagery and vicious sexuality. Clockwork Girl is a collection of three short bizarro novellas that make a perfect introduction to her unique style. CATERPILLAR GIRL Cat Filigree is a caterpillar girl trapped in the ugly stages of metamorphosis, desperately waiting to be transformed into a butterfly. With her flaky skin and glazed eyes, she has become one of the least popular girls at her high school. Tormented daily by the popular lady bug girls and fig-beetle jocks, she hides away from the world, listening to Bauhaus records and reading Grant Morrison comics. She thinks she's doomed to be alone forever, until she meets Lilith- a beautiful, punk rock, corset-wearing spider girl whom Cat falls madly in love with. But there's a because she's a spider girl, Lilith has the tendency to kill and eat her lovers. And butterflies happen to be her favorite food. CLOCKWORK GIRL Pichi was once a normal human girl. But now her skin is made of brass, her organs have been replaced by cogs and gears, and her heart must be wound up every day in order to stay alive. She is a clockwork girl. Like most children of poor families, she was sold to a toymaker, surgically transformed into a mechanical living doll, and given as a Christmas present to a rich little girl who was no longer satisfied with ordinary porcelain dolls. She has no memory of her past or even her real name. All she knows is that she's in love with her new owner and wants to be with her forever. But what she doesn't know is that little girls always outgrow their toys, eventually. BEEHIVE GIRL Her skin is made of honeycomb. She smells of baked oranges and is dripping with amber- colored honey. Living bees swarm around her like miniature lovers and crawl through her hair as she dances. She is Maya, the queen of the tango; the sexiest, most powerful dancer in town. Every man in the tango community longs to dance with Maya, but very few dare to try. You see, Maya's skin is a living beehive. And if a man attempts to dance with her who lacks the proper amount of talent and grace, he will get stung . . . perhaps even stung to death.",
  "genres": [
    "Bizarro Fiction",
    "Short Stories",
    "Horror",
    "Steampunk",
    "Fantasy",
    "Fiction",
    "Science Fiction"
  ],
  "author": "Athena Villaverde",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/13361338-clockwork-girl"
}