{
  "title": "Wendy and the Lost Boys: The Uncommon Life of Wendy Wasserstein",
  "description": "The authorized biography of Pulitzer Prize-winning playwright Wendy Wasserstein.In Wendy and the Lost Boys bestselling author Julie Salamon explores the life of playwright Wendy Wasserstein's most expertly crafted herself. The first woman playwright to win a Tony Award, Wendy Wasserstein was a Broadway titan. But with her high- pitched giggle and unkempt curls, she projected an image of warmth and familiarity. Everyone knew Wendy Wasserstein. Or thought they did.Born on October 18, 1950, in Brooklyn, New York, to Polish Jewish immigrant parents, Wendy was the youngest of Lola and Morris Wasserstein's five children. Lola had big dreams for her children. They didn't Sandra, Wendy's glamorous sister, became a high- ranking corporate executive at a time when Fortune 500 companies were an impenetrable boys club. Their brother Bruce became a billionaire superstar of the investment banking world. Yet behind the family's remarkable success was a fiercely guarded world of private tragedies.Wendy perfected the family art of secrecy while cultivating a densely populated inner circle. Her friends included theater elite such as playwright Christopher Durang, Lincoln Center Artistic Director André Bishop, former New York Times theater critic Frank Rich, and countless others.And still almost no one knew that Wendy was pregnant when, at age forty-eight, she was rushed to Mount Sinai Hospital to deliver Lucy Jane three months premature. The paternity of her daughter remains a mystery. At the time of Wendy's tragically early death less than six years later, very few were aware that she was gravely ill. The cherished confidante to so many, Wendy privately endured her greatest heartbreaks alone.In Wendy and the Lost Boys , Salamon assembles the fractured pieces, revealing Wendy in full. Though she lived an uncommon life, she spoke to a generation of women during an era of vast change. Revisiting Wendy's works- The Heidi Chronicles and others-we see Wendy in the free space of the theater, where her many selves all found voice. Here Wendy spoke in the most intimate of terms about everything that matters family and love, dreams and devastation. And that is the Wendy of Neverland, the Wendy who will never grow old.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Theatre",
    "Biography Memoir",
    "History",
    "Feminism",
    "Plays"
  ],
  "author": "Julie Salamon",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/10369875-wendy-and-the-lost-boys"
}