{
  "title": "An Extended Journey",
  "description": "READER REMARKS (Amazon Kindle eBook Edition):“It is hard to find really skillfully written time travel novels but this one was one. It is rare to say this but I was glad it was as long as it is and sad when it ended.” --Laurie Pollack (Pennsylvania)--\"Characters are believable and real, events and locations are so well described, you feel as if you are there. Use of actual people of the times helps keep the feeling of authenticity. The plot flows smoothly and the pacing keeps you turning the pages. A great read.\" --DanaRae (South Carolina)--“This is a powerful, superbly written book and a wonderfully structured story. I am a Thomas Jefferson fan, and have never read a more fully-realized, realistic version of him. It's like author Paul Sherman knew the man personally... and shares with us the 'normal guy' version of Jefferson that we never considered.\" --Michael Russell--“Sherman's sharp eye for detail adds a lot to this imaginative tale. It's a good read, and a page-turner, which I recommend without reservation.” --Retired English Teacher--“I absolutely loved it. This is a fun way to experience how our ancestors lived. Paul Sherman did a great job on research and presentation. I intend to recommend it to my book club friends.” --Venita Fountain (Louisiana)--“This is a remarkable book sure to delight all fans of the time travel genre, not to mention readers who just like a fun yet important American story well told -- one with big issues at its core. An America with no racial guilt or hatred? What a concept!” --Peter Boody (New York)--THE STORY:This is an adventure to be enjoyed. It involves Time Travel, but it's not Science Fiction. Nor is it Romance, though there’s an abundance of love. It’s about a man and a woman and their two little daughters, and it makes you wonder, what would I do?An Extended Journey is the story of a family stranded in a strange yet familiar world, our American past of the 18th century. At first it’s about survival, but then there are choices to make and consequences to face. It’s about an unsought opportunity to correct the biggest mistake our nation’s Founders ever made.David Gearns is an ordinary guy who responds to extraordinary circumstances. He’s a 21st century white, middle-class, corporate employee who travels with his wife and young children on a combination business and pleasure trip, unaware that they will soon be on a different journey entirely. Their visit to Colonial Williamsburg becomes much too authentic when they are whisked through time to Virginia of 1780, taken there and apparently abandoned by an irritating little black lady who means to make some changes. But what gives her or the Gearns family the right to interfere with history? How much involvement can David risk when his family is endangered? A lot, it turns out. The assignment is to convince Thomas Jefferson to eradicate slavery before it’s too late. Now is the time, during the Revolution when the flames of freedom burn their brightest. But Jefferson is the Governor of Virginia with a heartfelt plan of his own, albeit one doomed to failure. Influencing him is impossible, almost, and all the more difficult during a war. Our travelers are caught in skirmishes at Monticello and Williamsburg and finally in the key battle at Yorktown where their progress with Jefferson and the very survival of our country are newly threatened.The world will change, one way or the other.",
  "genres": [
    "Time Travel",
    "Fiction",
    "Historical Fiction"
  ],
  "author": "Paul  Sherman",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/13363529-an-extended-journey"
}