{
  "title": "America's Bravest",
  "description": "(Alternate cover edition of ASIN B006G0DFY6.) The Rescue Squad in the Hidden Cove Fire Department deals with all kinds of emergencies: blazing fires, horrific car accidents and a myriad of medical calls. Like most firefighters, they also have complicated personal relationships due to the nature of their jobs. In AMERICA’S BRAVEST, each of the six novellas details both the love and work of one firefighter with overarching themes of arson, a blogger out to discredit them, and balancing their personal and professional lives.In IN TOO DEEP, Captain Gabe Malvaso struggles with his attraction to Rachel Wellington, a firefighter on his squad. But when they’re trapped in a basement, thinking they’ll die, all bets are off.HOT SHOT picks up with Paramedic Brody O’Malley, who’s happy with single life until a class reunion where he meets Emma Walsh, the only woman he ever loved. But because he broke her heart, she’s refuses to rekindle old flames.WORTH THE RISK follows Ryan O’Malley, Brody’s twin cop brother, as he pursues prickly Lieutenant Felicia White, who’s always disliked his “playboy” persona. But when they are forced to work together on an arson case, sparks fly.EL BOMBERO is the story of Firefighter Tony Ramirez and his beloved wife Sophia, sweethearts since high school, who run into the biggest challenge of their lives: Sophia can no longer tolerate the danger her husband is in every day.In RESCUE ME, twenty-four-year-old Sydney Sands saves the life of local businessman Max Delinsky only to fall head over heels in love with him. But trouble comes in merging the discrepancy in their ages and Max’s difficulty with her past.TRIAL BY FIRE tells the story of Battalion Chief Cal Erikson, whose been fighting for two years with blogger Parker Allen about the fire department. Imagine his surprise when he finds himself attracted to the fiery journalist with deep scars from her past. The arson case is solved, but not before both their lives are endangered.In THE EPILOGUE, get a closer look at how all six couples live happily ever after!Librarian note: this is a compilation of novellas. It is book 4 and is separate from the other books in the Hidden Cove Firefighters Series (7 books). Only the first novella, In Too Deep, can be obtained as single edition.",
  "genres": [
    "Romance",
    "Contemporary",
    "Amazon",
    "Contemporary Romance",
    "Suspense",
    "Novella",
    "Fiction"
  ],
  "author": "Kathryn Shay",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/13365667-america-s-bravest"
}