{
  "title": "Days of Vengeance",
  "description": "First, he murdered his wife.Then he lost his memory.Now he has to remember where he buried the body or his in-laws will kill him.\"Dear Frank, I know you killed your wife, and I can prove it...\"After receiving this note, Frank Fowler, a man suffering from amnesia, begins to suspect he may have murdered his wife Kelly, who vanished three days before he lost his memory. The bad news is Kelly's family has the same suspicions and will stop at nothing to make him remember what he has done to their beloved sister and where he buried her body.Frank's search for answers becomes a fight for survival after he recalls that his wife's relatives are a gang of ruthless killers serving a mysterious one-legged man. His chances are slim: one of the in-laws is a cop and another is a multimillionaire.However, the question still remains: Why did he kill his wife?Frank's options are limited: he either finds his wife's body or dies. In his race against time Frank has all the clues to the puzzle, he just needs to remember them before it's too late.DAYS OF VENGEANCE, a suspense novel----------------AN EVIL MIND, a suspense novelHow do you stop a serial killer who can escape from any prison? \n  \nOn December 11, fifteen-year-old Helen Hinton is brutally murdered in an abandoned house. Her killer, Edward Phillips, is caught and sentenced to death. Helen's blood was on Edward's clothes and shoes, the murder weapon has his fingerprints on it. Edward claims he's innocent. He's telling the truth.Two months after Edward Phillips is transferred to death row, a murder similar to Helen's occurs in another city. The victim is eighteen-year-old Laura Sumner.On an October morning, Mark Hinton, Helen's father, visits Edward in prison to talk about Laura Sumner's case. Edward tells him that he knows who really killed Helen.What he doesn't tell Mark is that the real killer is the most dangerous criminal on the planet.",
  "genres": [
    "Horror",
    "Paranormal"
  ],
  "author": "Tim Kizer",
  "average_rating": "3.01",
  "url": "https://www.goodreads.com/book/show/13369590-days-of-vengeance"
}