{
  "title": "Astreya, Book II: The Men of the Sea",
  "description": "In Book The Voyage South, Astreya leaves home, hungry for information about his father's mysterious origins. The crew of the Mollie abandons him in a strange land where only his new friends, Gar and Lindey, help him survive. Pursued by academics and thugs, Astreya flees with Lindey to Charton, only to find himself in the clutches of Adramin, his cousin, who is one of the Men of the Sea Astreya had wanted to know more about. In Book The Men of the Sea, Astreya learns from his grandfather Oron how to control his power over the shipstones aboard the great ship Cygnus. He still yearns for Lindey, left on shore against her will. Trying to purge a nagging guilt, Roaring Jack sails the Mollie south again, and this time Astreya's friend Cam is a stowaway. Adramin does everything he can to make Astreya fail. At The City of the Sea, the lawful meeting place of the great ships, family politics turn violent, with tragic consequences. Astreya must hurry to protect Lindey from his marauding uncle Mufrid, who wants the stone Gar gave her. A day-and-night sailing duel, a battle at sea, a shipwreck, a fight in a pub, escapes by sea and secret passage, help from unexpected allies and treachery from family all take their toll on Astreya and his friends. Astreya and Lindey face even more dangers and deceptions before the final conflict in Book III of The Astreya The Wanderer's Curse. \"Hamilton has an intuitive grasp of story... Astreya is a work of great power, insight, and ferocious imagination... I recommend it unreservedly.\" - Spider Robinson, Nebula and Three-time Hugo Award Winner, Recipient of the Heinlein Lifetime Achievement Award \"The books feature a pirate, knife fights and much more as factions within the ruling family of the Men of the Sea struggle for supremacy... Hamilton has produced a set of well-rounded characters whom you can empathize with and they are pacey novels which are hard to put down.\" - David Hayes, HistoricNavalFiction.com",
  "genres": [
    "Fantasy"
  ],
  "author": "Seymour Hamilton",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/13372467-astreya-book-ii"
}