{
  "title": "Sugarland: a novel",
  "description": "As children, Kit and Kiki Smithers performed as the Sugar Babes, but those glory days are long gone. All that remains are the blues the sisters sing as they cope with withering marriages, cheating spouses, lost opportunities, and the demands of motherhood.Sugar Land is a verdant novel about the healing power of forgiveness, the seemingly impossible task of loving, the resilience of family ties, and what happens when a tornado meets a double-wide trailer.PMA Benjamin Franklin Award finalist (1999)“Every character in this novel resonates with life. This talented author knows how to bring pen-and-ink people to flesh and blood fulfillment…poignantly authentic.” Southern Living“Alternately wrenching and humorous…Rodgers’ strength is her knack for realistic characters…and a womanly wise, laugh-through-tears appreciation of life.” Publisher’s Weekly“Richly appealing…” Library Journal“Bittersweet…priceless…” Chicago Tribune“Pure charm…compelling…full of humor and compassion. Sugar Land is a delight to read, and Rodgers is a terrific discovery.” Tampa Tribune-TimesFrom Library Journal:\"As little girls, Kit and Kiki Smithers of Sugar Land, TX, could belt out songs that made audiences love them. As adults, they are finding love harder to handle, as Kiki deals with her philandering, physically abusive husband, Wayne, and Kit feels the love seep out of her marriage to Mel, a good man who is just letting himself - and their relationship - go. When both sisters become pregnant for the third time, suffering ensues: cataclysmic loss for Kiki and overwhelming guilt for Kit, unsure of her unborn child's paternity after a virtual assault by Wayne and a spontaneous tumble with her boss. Their show-biz-agent mother, Viveca, nurtures and nudges the sisters as she herself battles cancer. In snappy prose, Rodgers (Crazy for Trying) creates fully dimensional characters in a story with elements of love, loss, humor, passion, joy, feminism, and even mothers-in-law. As richly appealing as the best country music.\"",
  "genres": [
    "Fiction",
    "Contemporary"
  ],
  "author": "Joni Rodgers",
  "average_rating": "3.22",
  "url": "https://www.goodreads.com/book/show/13373674-sugarland"
}