{
  "title": "Being and Homelessness: Notes from an Underground Artist",
  "description": "John Sibley was a homeless artist living in winter on the streets of Chicago for six months. The terrain is Chicago’s Loop, Near Westside and the now abolished Maxwell Street open-air-market between 1989 and 2005. His aim in these philosophical essays is to shed light on a growing global problem. \"Being and Homelessness\" is not as much concerned with the cause but the wretched anxiety and pain of being homeless, which forces one to live, to exist in an in-authentic mode of \"being-in-the-world.\" Sibley uses an existential lens to focus on this ghastly problem because the homeless being-in- itself is forged in rootlessness, displacement, and their lives are governed by the existential D’s of death, dread and despair. After his dark night of the spirit Sibley believes that being homeless in the world, displaced and rootless, is one of the most terrifying challenges that a human can experience. \"I gazed down into the underbelly of the abyss. I am blessed that I escaped the stygian darkness of the nether world of alleys, bridge viaducts, vacant cars and subways caverns. To escape that region of dread and despair teaches you that pain and suffering are central to the human condition,\" he writes. In these essays Sibley uses the term \"being-in-the-world\" as an experience that makes one acutely aware of that gap between consciousness and objects in the world. Being-in-the-world makes the homeless aware of a distance, an emptiness, a gap that separates them from the region of things. This essay is a plea to maximize this nation’s resources, both public and private to help the wretched existence of the homeless. \"I cannot recall the exact day-to-day or month-to-month suffering that I endured, but the existential feeling of dread, despair, hopelessness, wretchedness and loneliness still clings to my consciousness. \"I write to illuminate the plight of the homeless so that when you see them in libraries, on subways, city busses, local train stations or standing in front of missions like they had stepped out of painter Edward Hopper’s canvas, you won’t judge them, as Anatole Broyard noted, as 'creatures of the darkness, where sex, drugs, gambling and other crimes are directed against a bourgeois culture that despises them.'” The homeless problems have become a Malthusian nightmare not just in Chicago but in urban cities across the nation and worldwide. The large population of homeless men, women and children give most urban cities a Third-World urbanscape. It would be disingenuous to state that the homeless only need shelter when the problem is much deeper than that. The Government needs to invest in creating a new Integrative Holistic Rehab Center [IHRC] to combat the multiple cause of homelessness. We need to heed the words of the homeless, Danish genius, Kierkegaard, who believed philosophy must recognize the presence of man-in-the-world. The reality is that for millions of us in our times we are only a lost job, a breadwinner's disability or death, a business failure, a lawsuit, a divorce, a long-term illness or natural disaster away from homelessness. Let the experience of John Sibley inspire you with its honesty, faith and redemption.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Philosophy",
    "Memoir",
    "Autobiography",
    "Anthropology"
  ],
  "author": "John H. Sibley",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/13374361-being-and-homelessness"
}