{
  "title": "\"Heil America\" Incorporated (We Didn't Think It Could Happen Here): Volume One",
  "description": "Becca had no way of knowing just how much her life would be changed by the message she received that Saturday morning when she went to her Social Network to play her farm game. Not just her life…but her very “You don’t know me, but I work for your Social Network. This morning we had visitors from Homeland Security and they demanded that we turn over to them all information pertaining to your account. This message will be deleted in 20 minutes and all traces of it will disappear. Hopefully they will not detect it before then. I do not dare leave it on here longer than that. I can only hope you get the message in time. Overhearing the conversations of these men I realize that you are in grave danger. You must leave your home immediately. Go somewhere safe…they are coming to pick you up. They also mentioned obtaining information concerning all your phone contacts. This means they will have records of everyone that you have on your contact list on your Social Network as well as your phone. Find a place to go that you will not be traced if possible. I am a follower of your blog or I would have had no idea who you were or what serious danger you were in. May God keep you safe. A Friend.” Her story begins with these “It wasn’t supposed to be this way. Who would have thought… that a woman in her fifties would find herself hiding here, in this secret room, quietly locked away in the home of a member of the underground resistance? Underground resistance… Heaven Forbid! I still can’t believe we live in a time where such a thing even exists!” What she encounters next should be a wake-up call to all of us here in America! The last decade in American history has been full of surprises. What has happened to our country? Who is behind it? Why is it being allowed to occur? What can we expect next? Are you in danger? A must read for those who realize that the United States is changing…Fast! Although this book is fictional, it is based on facts. Facts that you need to know. Facts that will surprise, enlighten, and bring into focus the ‘big picture’…what is happening here is no longer a nationalistic problem…its scope is worldwide. And your life depends on knowing what that picture is. Time is running out for you to be aware and prepare yourself for what is occurring. Be prepared to be surprised!",
  "genres": [],
  "author": "N.A. Forbush",
  "average_rating": "4.71",
  "url": "https://www.goodreads.com/book/show/13374598-heil-america-incorporated-we-didn-t-think-it-could-happen-here"
}