{
  "title": "Gods of Noonday: A White Girl's African Life",
  "description": "The daughter of medical missionaries, Elaine Neil Orr was born in Nigeria in 1954, in the midst of the national movement that would lead to independence from Great Britain. But as she tells it in her captivating new memoir, Orr did not grow up as a stranger abroad; she was a girl at home―only half American, the other half Nigerian. When she was sent alone to the United States for high school, she didn't realize how much leaving Africa would cost her. It was only in her forties, in the crisis of kidney failure, that she began to recover her African life. In writing Gods of Noonday she came to understand her in the Christian church and the Yoruba shrine, the piano and the talking drum. Memory took her back from Duke Medical Center in North Carolina to the shores of West Africa and her hometown of Ogbomosho in the land of the Yoruba people. Hers was not the dysfunctional American family whose tensions are brought into high relief by the equatorial sun, but a mission girlhood is haunted nonetheless--by spiritual atmospheres and the limits of good intentions. Orr's father, Lloyd Neil, formerly a high school athlete and World War II pilot, and her mother, Anne, found in Nigeria the adventure that would have escaped them in 1950s America. Elaine identified with her strong, fun-loving father more than her reserved mother, but she herself was as introspective and solitary as her sister Becky was pretty and social. Lloyd acquired a Chevrolet station wagon which carried Elaine and her friends to the Ethiope River, where they swam much as they might have in the United States. But at night the roads were becoming dangerous, and soon the days were clouded by smoke from the coming Biafran War. Interweaving the lush mission compounds with Nigerian culture, furloughs in the American South with boarding school in Nigeria, and eventually Orr's failing health, the narrative builds in intensity as she recognizes that only through recovering her homeland can she find the strength to survive. Taking its place with classics such as Out of Africa and more recent works like The Poisonwood Bible and Don't Let's Go to the Dogs Tonight, Gods of Noonday is a deeply felt, courageous portrait of a woman's life.",
  "genres": [
    "Africa",
    "Memoir",
    "Nonfiction",
    "Biography Memoir",
    "Nigeria"
  ],
  "author": "Elaine Neil Orr",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/1337479.Gods_of_Noonday"
}