{
  "title": "Heat Of The Moment",
  "description": "A sexy contemporary romance for fans of Rachel Gibson and Kristan Higgins...When twenty-nine-year-old Kenley Mitchell loses her job and her boyfriend all in one week, she decides to cash in her severance pay and book a week-long trip to Florida. A relaxing vacation by the beach is just what she needs – she’ll lose herself in the sand and the sun, doing her best to forget all her problems. But on her first night there, Kenley runs into star baseball player Chad Parnell. The only problem? She has no idea who he is -- until after a paparazzi camera catches her in a, uh, compromising position with the hunky first baseman.Chad’s trip to Florida was supposed to be business only. He’s just about to land a multi-million dollar endorsement deal with Expera Footwear, and he doesn’t need any distractions. But when paparazzi pictures of him and Kenley surface in the tabloids, Expera is not happy. They don’t want Chad’s dalliances messing up their family friendly reputation – so Chad does the only thing he can do, and tells them that Kenley’s his girlfriend. Of course, now he has to somehow convince Kenley to go along with his plan.Kenley wouldn’t have even been in those stupid pictures if Chad hadn’t been acting like a manipulative womanizer, and so at first she says no way to his crazy scheme. As far as she’s concerned, he doesn’t deserve her help with anything. But when he makes her an offer she can’t refuse, Kenley somehow finds herself signing up for a stint as his fake girlfriend.She knows it sounds crazy, but whatever. It’ll be strictly business, right? But when the sparks start to fly, Kenley and Chad are going to have to figure out what’s real, and what isn’t. And they just might be surprised at the answer….",
  "genres": [
    "Romance",
    "Sports",
    "Contemporary",
    "Baseball",
    "Fiction"
  ],
  "author": "Locklyn Marx",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/13376453-heat-of-the-moment"
}