{
  "title": "Circles",
  "description": "A Dream Vision, a terrifying destiny, a journey of a lifetime—the future of an entire Peoples may rest on the shoulders of one young boy. Pinnacle Book Achievement Award - Best Historical Fiction“This novel of historic fiction is a must for any fan of Native American history, or seeker of knowledge, or lover of life. It is expertly crafted with vivid imagery and characters that will become beloved. If you don't know what it means to sing someone home, prepare to swallow hard. It is heart warming and moving. Truly a thing of beauty.” ~ T.W. GriffithWith much of the world still undiscovered, a small band of people live a peaceful life, until the Dream Vision of a young boy changes everything. Only nine winters old, Feather Floating in Water’s dreams turn his seemingly ordinary childhood into the journey of a lifetime. He must help his people face a terrifying destiny from which they cannot turn away. He must find a way to make his people listen.Bright Sun Flower, the boy’s grandmother, guides his beginnings, teaching him about the Circle of Life, and how without it, no life can exist. But he needs a bigger push, and gets it from a grey wolf and a Great Elder. The boy’s journey leads him to discover that the Circle of Life involves all people, all living things, and not just the world he knows.In the end, an ancient People guide the boy in his Visions, toward an unexpected place hidden from outsiders.EVOLVED PUBLISHING PRESENTS the 1st book in the extraordinary, award-winning “Shining Light’s Saga” series. Take an authentic journey into a culture lost to time and the ravages of “progress.”“A beautiful story of what should have been... The story is strongly written and will appeal to those who believe that mankind should live in harmony with nature. If you expect savagery and blood - look elsewhere.” ~ John Chapman",
  "genres": [
    "Historical Fiction",
    "Historical",
    "Fiction",
    "Native Americans"
  ],
  "author": "Ruby Standing Deer",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/13378689-circles"
}