{
  "title": "The Katres' Summer",
  "description": "The galactic adventure begun in The Dracons’ Woman and The Lobos’ HeartSong, takes everything to a new level in the most exciting installment yet in Laura Jo Phillips’ thrill-packed “Soul-Linked Saga,” The Katres’ Summer. Trapped for a year in the living hell of being held captive by a mysterious sex slave ring and having her body turned into a puppet by an insidious Xanti Controller device, and armed only with her photographic memory and strange ability to control computers with her mind, Summer Whitney makes a courageous escape from her captors with the help of a fellow prisoner with a dark past, the manipulative Darleen Flowers. The two forge an unlikely alliance as Summer conceives a valiant quest to free every woman held by her former captors, but is confused by her feelings about the three magnificently handsome Katre brothers, Clan Jasani shapeshifters who aided in her rescue and with whom she will work to free the others. Why can she sense their emotions? Why does the oldest brother, Maxim, seem to dislike her so much? Why do they stir such powerful feelings deep in her body? And why do people keep on talking about her being an “Arima” and refer to her as perhaps being the “Mind”? Old mysteries are resolved and new ones are introduced as Summer will have to call upon every ability she ever knew she had, and quite a few that she will discover for the first time, to complete her task. Her perilous journey will bring her face to face with the evil Xanti, whose true nature is finally and shockingly revealed, as well as with a shadowy new enemy, the Brethren. Only by unlocking her long-hidden potential, both as a penetrating Mind but also as a formidable warrior, will Summer have any hope of bringing to fruition the age-old prophesy for the salvation of the Jasani people and of fulfilling her secret desire of finding eternal love with three adoring, handsome men. The Katres’ Summer delivers the three-dimensional characters, thrilling plot twists, and intense sensuality that thousands of readers have come to associate with Laura Jo Phillips and The Soul-Linked Saga. Her many fans will find this 111,000 word novel a worthy successor to her previous works and will leave them hungry for more.",
  "genres": [
    "Science Fiction",
    "Romance",
    "Shapeshifters",
    "Paranormal",
    "Fantasy",
    "Reverse Harem",
    "Aliens"
  ],
  "author": "Laura Jo Phillips",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/13379715-the-katres-summer"
}