{
  "title": "The Dawn Of Angels",
  "description": "Left by her mother at a young age, Kyra has grown-up in the foster system, leaving her angry and hateful towards the world. The only person she can trust is Hammond, her case worker who has watched over her since the time her mother left. When Hammond places Kyra in a foster home located in a small town, strange things begin happening and Kyra starts unraveling the mystery of her past. When Kyra’s life is threatened, she is saved by an angel, her guardian angel, Ashur, who falls from heaven to save her. Together, Ashur and Kyra must figure out why her life is in danger and stop a strange cult from bringing about the end of days. \"I didn’t just fall from heaven to save your life…” Ashur pulls me in closer until my chest touches his. “…I came here because after all those years, I could not spend another moment of eternity knowing that you would not be there.” He begins to sweep his head down toward mine. I know what’s coming and I can’t allow it. Turning away, I say, “I can’t.” My objection is not that I don’t love him, but that I can’t love him. He is an angel, I am a mortal. Two worlds that never have, and never will exist together. “You know as well as I do that this can never be. No matter how desperately we may want it. What will become of us?”“I don’t know,” he says. “I don’t care.”“Well, I do,” I say. “All this will end and you will have to go back. And I will be left here alone.”“But…”“No,” I say, sternly. “It’s better this way.”Our eyes meet and I look away, but his eyes do not retreat as if they are holding me in place, preventing me from leaving.Approximately 75,500 wordsReviews for \"The Dawn of Angels\" -- \"Angel books have taken the reading world by storm lately. I haven't been a part of that at all. The Dawn of Angels is my first angel book, and I am so happy that I decided to get into the angel craze. The Dawn of Angels was such an amazing book...I was pulled in right from the start and I didn't want to stop reading it. Now I am just waiting for the next book, so I can find out what happens.\" --Melissa, Reading it All --\"There are no wasted characters watching from the sidelines, every one of them holds a secret(s) and they all focus on Kyra (with hints or friendliness or wariness or hatred). The town being “small” does not account for every single person being a critical player.\" Burgandy Ice, Colorimetry-- \"The action in this book was great! The entire book is about angels and the different rankings of the angels. You could also tell that the authors put a ton of effort and research into this book. It was awesome reading this and also gaining some knowledge. Nicely done perspective on angels. This book is also full of mystery. Mystery surrounds the towns people and the town which makes this book full of suspense to where you dont want to put it down and you just have to keep reading to find what happens next.\" --Valerie, Intriguing Reads",
  "genres": [
    "Paranormal"
  ],
  "author": "Vivienne Malynn",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/13385530-the-dawn-of-angels"
}