{
  "title": "The Last Myth: What the Rise of Apocalyptic Thinking Tells Us about America",
  "description": "During the first dozen years of the twenty-first century--from Y2K through 2012--apocalyptic anticipation in America has leapt from the margins of society and into the mainstream. Today, nearly 60 percent of Americans believe that the events foretold in the book of Revelation will come true. But it's not just the Christian Right that is obsessed with the end of the world; secular readers hungry for catastrophe have propelled fiction and nonfiction books about peak oil, global warming, and the end of civilization into best-sellers, while Doomsday Preppers has become one of the most talked-about new reality TV shows on television. How did we come to live in a culture obsessed by the belief that the end is nearly here?The Last Myth explains why apocalyptic beliefs are surging within the American mainstream today. Tracing the development of our expectation of the end of the world from the beginnings of history through the modern era, and examining the global challenges facing America today, authors Mathew Barrett Gross and Mel Gilles combine history, current events, and psychological and cultural analysis to reveal the profound influence of apocalyptic thinking on America's past, present, and future.Engaging, powerful, and insightful,  The Last Myth  will change the way you look at the world--and its end.\"The Last Myth  is book of ideas born out of this moment in time... This book is one that should be brought to the dinner table for lively and transformative conversation with family and friends. At a time when so much separates us ideologically, these ideas can unite us in our understanding that the only end of the world we really need to fear is the end of our imagination.\"--Terry Tempest Williams, author of  When Women Were Birds  and  The Open Space of Democracy",
  "genres": [
    "Nonfiction",
    "Religion",
    "Sociology",
    "Microhistory",
    "Society",
    "Science",
    "Cultural"
  ],
  "author": "Mathew Barrett Gross",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/13390391-the-last-myth"
}