{
  "title": "In Sunlight and in Shadow",
  "description": "Entrancing in its lyricism, In Sunlight and in Shadow so powerfully draws you into New York at the dawn of the modern age that, as in a vivid dream, you will not want to leave. In 1946, Harry Copeland has returned after fighting in the 82nd Airborne from North Africa all the way to the Elbe. Reluctantly assuming the direction of the family fine leather goods manufacture, he finds his life unsatisfactory and on hold – until he is “accidentally” united with Catherine Thomas Hale, the woman for whom he has been waiting all his life, although the forces behind his patience have never been revealed to him. A young actress, singer, and heiress, she has been waiting for him, even if she has known this only in flashes that do not come clear to her until the end of the narrative, and that have not prevented her engagement to a much older man who has been taking advantage of her since childhood.The meeting of Catherine and Harry, their courtship, and their intense love, play out on the stage of New York awakening at mid-century – in the deep worlds of the theater, industry, and high finance, and during the collision of aristocratic New York society with the formidable wave of second-generation, fully assimilated Jews. Though after being broken in the war Harry wants nothing but peace, family, and love, organized crime carries on its extortions as always, even in a city now full of the kind of men who stormed the Point du Hoc and the Siegfried Line. This becomes his moral and physical struggle. While Catherine’s is of a different nature, it is just as consequential, and the courage required of her is perhaps even greater.Of the widest scope – from the air over Sicily to the heat-and-color-saturated Sacramento Valley; the Bay of Biscay to the sea off Maine; the steel mills of Gary, Indiana to the beaches of Amagansett; London in the blitz; the invasion of Normandy; and a single shell gliding across an American lake in August; from the luminous houses of the wealthy to the pounding of the boards beneath a Broadway chorus line – this is yet, first, and foremost a love story, but also a hymn to New York of the period when one great age elided into the other that we call our own. Rich in language and classical allusion, it is true to the mottoes at its outset: the Dantean “Amor mi mosse, che me fa parlare,” “Love moved me, and made me speak,” and to the lines of Lucretius that describe Catherine’s extraordinary representation of the powers, beauties, and graces of womanhood – “Nothing comes forth into the shores of light, or is glad or lovely without you.”",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Romance",
    "Historical",
    "New York",
    "Audiobook",
    "Novels"
  ],
  "author": "Mark Helprin",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/13391073-in-sunlight-and-in-shadow"
}