{
  "title": "The Last Mask - Tradition",
  "description": "Dark tendrils of mirth crept out of the shadows and wove their way across the green fields towards the big top; the merriment of the show within the circus drawing them towards it like a bright flame.He was approaching. His black claws reaching out into this world like a slithering death, exploring this fresh realm that was full of new sensations, but also held many old memories for this ebony clown.Ladies and gentlemen, welcome to The Last Mask – Tradition the first book in The Last Mask Trilogy, a fantastical journey through a world of theatrical decadence. Joseph Scamboldi doesn't have a face, and on this most important night that was a problem, for tonight Joseph was supposed to become a clown.Stories are not born of the light; they are the stuff of shadows, creeping from the darkness as we huddle around the flames. This is a tale of where those stories come from, the world that inspires the decadence of the theatrical, the dreams of the artist; a realm called the Joke.Not many people get the Joke, for only a few can understand its dance of mirth, or the irony of its ways. But as the boy without a face steps upon its stage, and takes the spotlight of this play, he will realise that the traditions of a family’s circus run deeper than any of them have known.As traditions fall, and the boy searches for his identity, the world of the Joke unfolds around him. A game of cosmic mirth played out before the eyes of those who no longer see, with the key to power hanging in the balance between the flames and what lies beyond, for the one who will be.Shadows gather and the darkness awaits the punchline, for tonight the show will not go on. The Last Mask - Tradition is for readers who enjoy tales with great imagination, extravagant theatrical performances of the likes of the Cirque du Soleil, or stories grounded in characters that spark the mind.With the creation of the world of the Joke Winterflood set out to make a world without limits, where the reader was never sure what lurked around the next corners. In The Last Mask we have a story that has deep layers of culture and history weaved into a setting never seen before. A full length novel of 84,000 words.- Reviews for The Last Mask -\"I'll never look at clowns, harlequins, mimes, big tops or anything remotely stripy and circuslike in the same way again. I finished this 2 days ago, and I'm still replaying bits over in my mind. This is theatrical decadence, Gothic romanticism with a twist of horror. Loved it, I really, really, really did.\" - Sammy Smith -\"Start with plenty of sinister, add a pinch of whimsy and a full helping of fantastic poetic flair and you’ve begun what may be one of the most uniquely crafted and diabolically creative circus stories to be published in a very long time.- Tom Clementson (Kindle Book Review) -",
  "genres": [],
  "author": "Stephen Winterflood",
  "average_rating": "4.71",
  "url": "https://www.goodreads.com/book/show/13391740-the-last-mask---tradition"
}