{
  "title": "No Exit",
  "description": "Sometimes glimpsing the future can be deadly. US Navy SEAL Kelly Nolan, who commands a small special ops unit, is assigned duty to protect a Presidential candidate during a visit to England. So what has a woman from half the world away seen that makes them seek her out? Rebecca Miller is an especially gifted psychic. Two years ago she ‘read’ a US Senator’s wife and although Elizabeth Glover’s fears about her husband’s death were real, Rebecca reassured her that measures would be taken to avoid it. She ‘saw’ two of the people protecting him – a Native American and an old flying buddy. And now, ex fighter pilot and Senator John Glover is a viable Presidential candidate, working hard to get the votes, while Rebecca Miller is invited to speak at a paranormal symposium in London. At Heathrow, she’s not met by the event organizer, but by two men in military uniforms. One of them, Kelly, a Native American, is vaguely familiar. Has she seen him before? Is this handsome guy really talking to me? she wonders. Yes, he is and she’s now in protective custody… She knows this is about that Senator destined to be President. She has no choice but to go with them. At the airfield, Rebecca refuses to get into the chopper that awaits because she knows she will die if she goes near it. He might be psychic himself, and he might even like her, but Kelly Nolan’s patience is wearing very thin. Then comes a shot from the woods and Rebecca Miller is dead at his feet.  Rebecca, from the other side of life, is given a choice; she may stay, or return to finish what she started.  After Rebecca wakes on a morgue slab and scares the pants off a medic, Kelly gets the call that she’s alive. Even disbelievers call it a miracle, and those who want John Glover dead return to their drawing boards. Whatever lies in store for the psychic and the SEAL, life will never be the same again for anyone involved, and many lives change. Some for the better.",
  "genres": [
    "Paranormal",
    "Romantic Suspense",
    "Mystery",
    "Romance"
  ],
  "author": "Julie Harris",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/13395040-no-exit"
}