{
  "title": "Expect Nothing Less",
  "description": "Charlie Lofton’s future is hanging by a thread – a tenuous thread spun from his own reckless doings. But Charlie is a smart guy who has luck and a few close friends on his side. Throughout his own gripping account of the events that take place in this novel, he faces threats from peers, criminals, law enforcement, and even family. The story begins with an actual bang in Atlanta and carries us to Bermuda, Florida, and New York City, where the reader’s imagination will settle into every coincidental twist Charlie encounters along the road to his ultimate purpose.After he loses his father at an early age, Charlie finds love and companionship with the girl next door, but he allows it to detrimentally fade away in his adolescence. After that he makes some crucially bad decisions which leave him in precarious and sometimes comical situations. Even though he commits some reprehensible acts, we can not help but feel for him, and we want to cheer for him to overcome the adversity he has created for himself.The story unfolds to reveal odd, intriguing characters, from Charlie’s childhood friends who arrive at adulthood along widely diverse paths, to Tomcat, the Geechee goon who initially presents a threat to Charlie, but proves a protector in later chapters. There is the respected but libertine politician and father of Charlie’s high school nemesis.In Bermuda we encounter Clive the banker and cricket player, and Red Stevenson the mariner who tutors Charlie in maritime mores and techniques. There is the super-lawyer Harvey King and the inmate Marvin “the disorderly” Dixon. Plenty of law officers, investigators, and criminals round out the cast of characters and interact to weave a rich plot from purpose and coincidence.The book is alternately tragic and funny, and throughout this forty-odd year odyssey amusing episodes will evoke a chuckle or two, or perhaps jerk a tear. The pace is compelling, finally wending its way to a profoundly uplifting finale, and when the book is closed for the final time the journey seems too short.",
  "genres": [],
  "author": "Warren Strickler",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/13394740-expect-nothing-less"
}