{
  "title": "Molecular Biology of the Cell",
  "description": "Molecular Biology of the Cell is the classic in-dept text reference in cell biology. By extracting the fundamental concepts from this enormous and ever-growing field, the authors tell the story of cell biology, and create a coherent framework through which non-expert readers may approach the subject. Written in clear and concise language, and beautifully illustrated, the book is enjoyable to read, and it provides a clear sense of the excitement of modern biology. Molecular Biology of the Cell sets forth the current understanding of cell biology (completely updated as of Autumn 2001), and it explores the intriguing implications and possibilities of the great deal that remains unknown. The hallmark features of previous editions continue in the Fourth Edition. The book is designed with a clean and open, single-column layout. The art program maintains a completely consistent format and style, and includes over 1,600 photographs, electron micrographs, and original drawings by the authors. Clear and concise concept headings introduce each section. Every chapter contains extensive references. Most important, every chapter has been subjected to a rigorous, collaborative revision process where, in addition to incorporating comments from expert reviewers, each co-author reads and reviews the other authors' prose. The result is a truly integrated work with a single authorial voice. Features : - Places the latest hot topics sensibly in context - including genomics, protein structure, array technology, stem cells and genetics diseases. - Incorporates and emphasises new genomic data. - All of molecular biology is brought together into one section (chapters 4-7) covering classically defined molecular biology and molecular genetics. - Two chapters deal exclusively with methods and contain information on the latest tools and techniques. - New chapters on \"Pathogens, Infection, and Innate Immunity\". - Cell Biology Interactive CD-ROM is packaged with every copy of the book. - Contains over 1,600 illustrations, electron micrographs and photographs, of which over 1,000 are originally conceived by the authors.",
  "genres": [
    "Science",
    "Biology",
    "Textbooks",
    "Nonfiction",
    "Reference",
    "Medicine",
    "Biography"
  ],
  "author": "Bruce Alberts",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/13400.Molecular_Biology_of_the_Cell"
}