{
  "title": "The Good Daughter",
  "description": "Most good daughters would say they owe their fathers everything. Marisa Peruzzo, Mafia princess, would.She owed him for killing her fiance.She owed him for destroying her mother.She owed him for chaining her to the 'family business'.And she owed him for taking away her lifelong friend.Payback's a bitch.\n***FBI meets Mafia Princess:Dave sat up straighter when she entered the bar. Sandro had promised the contact would have useful information and be immediately recognizable, but he never specified male or female. Was this his informant? Carlo Peruzzo's daughter. The Mafia princess herself.Her gaze scanned the room until she saw him. Though her lips were pressed in a straight line, a sparkle flashed in her eyes as if she knew just how she had shocked him.Dave realized his heart rate had kicked up a few notches when their eyes had locked. His jaw would have dropped if he hadn't been the kind of guy trained not to show his emotions.She walked purposefully toward him, making her way through the crowded tables. Black designer jeans hugged nice curvy hips, and her full breasts were covered with a pink plaid, pearl-button western shirt. Interesting color choice. A leather belt wrapped around her waist, and his focus narrowed. Best he could tell the belt was pink, too. And there were some kind of pink jewels inlaid in the buckle.He hid a smile. The only thing that would complete the color coordination was if she had on-he looked down, yep, pink cowboy boots. Pretty-in-pink cowgirl-Mafia princess. That certainly wasn't an image he expected to see. With her head high, and her gaze fixed on him she seemed unaware-or unaffected-by the attention she garnered. And she certainly got a fair share of stares. He saw more than one man pause with a drink halfway to his mouth, head swiveling to keep track as she walked past.Dave had never seen the high-and-mighty Mafia daughter in anything other than expensive business suits, with her hair pulled back and her makeup understated, but tonight she wore this chic knock-off cowgirl look well. With her dark wavy hair swinging free around her shoulders, her smooth olive skin glowing, and lips a luscious color of pink to match as well, she could raise the lust level in a saint.Dave was no saint. 94,000 words, 376 pages***Each book in the Vista Security Series is stand alone but if you'd like to read in order:The Good Daughter (Vista Security Origins Book 1)Trust No One (Vista Security Book 2)Edge Of Trust (Vista Security Book 3)Forced To Trust (Coming Soon)and for fans of The Good Daughter:Nia, Be Mine (Coming Soon)",
  "genres": [
    "Romantic Suspense",
    "Romance",
    "Thriller",
    "Suspense",
    "Contemporary",
    "Fiction",
    "Mystery"
  ],
  "author": "Diana Layne",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/13402098-the-good-daughter"
}