{
  "title": "Jean-Baptiste Cléry: Eyewitness to Louis XVI & Marie-Antoinette's Nightmare",
  "description": "While tending his family’s garden one September morning in 1779, a young commoner encountered a prince in a chance meeting that would change both of their lives.The young man certainly never imagined that he was setting out on a journey that would take him from the quaint village where he was born to the magnificent courts of Russia, Poland and England. But neither could the young farm boy have imagined that he would one day also witness firsthand the horrific treatment of the royal family imprisoned in a dark medieval prison during the mayhem of the French Revolution. Cléry, born Jean-Baptiste Cant Hanet, was the only personal servant to remain with King Louis XVI and his family in the tower of the Temple Prison. Although Cléry himself was closely scrutinized in the tower and even threatened with the guillotine, he managed to secretly record the guards’ cruel and merciless treatment of the king, Queen Marie-Antoinette, their two children, and the king’s sister. JEAN-BAPTISTE CLÉRY is the first non-fiction work to provide insight into the cultural and psychological world of this tragic royal family from a very different perspective, that of a dedicated servant. Cléry was the only personal servant permitted to accompany and remain with Louis and his family in the Temple where they were imprisoned in 1792. Isolated from his family, accused of spying, and eventually imprisoned himself for his loyalty, Cléry spent his final days in exile in Austria.Was Cléry wrongly accused of infidelity to the royal family? Was he an agent of the revolutionaries? JEAN-BAPTISTE CLÉRY separates fact from rumor, and finally unravels the truth about this ordinary man in an extraordinary setting with very extraordinary actors. The biography also exposes the inner struggles of the young servant who served as the personal valet to King Louis XVI and Queen Marie-Antoinette before their tragic rendezvous with the guillotine.Incorporating findings from research based on journals and memoirs from the late 18th and early 19th century France, the compelling story sheds light on the often neglected aspects of the lives of royal servants including their steadfast loyalty and dedication to the king’s family as well as concern for their own personal well-being in dangerous, terrifying circumstances.",
  "genres": [
    "History",
    "France",
    "Nonfiction",
    "French Revolution",
    "Biography",
    "European History"
  ],
  "author": "Will Bashor",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/13405784-jean-baptiste-cl-ry"
}