{
  "title": "Luminous Chaos",
  "description": "Book two in The Mysteries of New Venice, the steampunk adventure series The Guardian called a \"magnificent achievement\" It's 1907 in the icily beautiful New Venice, and the hero of the city's liberation, Brentford Orsini, has been deposed by his arch-rival -- who immediately assigns Brentford and his friends on a dangerous diplomatic mission to Paris.So, Brentford recruits his old friend and louche counterpart, Gabriel d'Allier, underground chanteuse and suffragette Lillian Lake, and the mysterious Blankbate--former Foreign Legionnaire and leader of the Scavengers, the city's garbage collecting cult--and others, for the mission.But their mode of transportation--the untested \"transaerian psychomotive\"--proves faulty and they find themselves transported back in time to Paris 1895 ... before New Venice even existed. What's more, it's a Paris experiencing an unprecedented and crushingly harsh winter.They soon find themselves involved with some of the city's seediest, most fascinating inhabitants. But between attending soirees at Mallarmé's house, drinking absinthe with Proust, trying to wrestle secrets out of mesmerists, and making fun of the newly-constructed Eiffel Tower, they also find that Paris is a city full of intrigue, suspicion, and danger.For example, are the anarchists they encounter who are plotting to bomb the still-under construction Sacre Coeur church also the future founders of New Venice? And why are they trying to kill them?And, as Luminous Chaos turns into another lush adventure told in glorious prose rich in historical allusion, there's the biggest question of them all: How will they ever get home?ebook ISBN: 978-1-61219-142-3",
  "genres": [
    "Steampunk",
    "Fantasy",
    "Fiction",
    "Science Fiction",
    "Historical Fiction",
    "Science Fiction Fantasy",
    "Alternate History"
  ],
  "author": "Jean-Christophe Valtat",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/13406754-luminous-chaos"
}