{
  "title": "Girl Cook: A Novel",
  "description": "I, for one, have piled enough skyscraper salads to be given some consideration. I’m not working my way up the kitchen ladder for my goddamn health. I know all too well the sting of vinegar in an open cut. Oh yes, that salad you’re eating as a light appetizer? My bare hands have massaged dressing into every leaf. Lettuce loves me. But I’ve got ambition and, I don’t mind saying, a decent palate. I want to be The Chef. And the only way to do this is by becoming the greatest cook I can be. Which means kicking ass on the line, not just salads and desserts. These are my hopes. These are my dreams.Layla Mitchner is a twenty-eight-year-old Cordon Bleu graduate trying to carve out a space for herself in the fast-paced, high-pressure world of Manhattan’s top restaurant kitchens. She knows she’s got the talent to be a great chef, but there she is slaving for a misogynistic boss who’d sooner promote the dishwasher than give a woman the chance to prove her sous-chef mettle. And while Layla knows that the dwindling balance in her bank account won’t begin to cover what she owes her roommate, she’s desperate not to seek help from her self-absorbed, serially divorced, soap-opera-actress mother.Her romantic prospects seem no brighter. She gets set up with a nice enough guy, but his tassel loafers and corporate demeanor reek of the WASP aristocracy she’s determined to leave behind. After continuously striking out, she meets a musician who appears to be the bohemian Mr. Right of her dreams, only to find he may be more deadbeat than heartthrob. But Layla refuses to settle for anything short of true love and success, and she ultimately finds both where she least expects them.Hannah McCouch’s fresh and animated voice leaps off the pages of Girl Cook, a deliciously modern Cinderella story of love, sex, chefs, and the city.",
  "genres": [
    "Chick Lit",
    "Fiction",
    "Romance",
    "Foodie",
    "Food",
    "Adult Fiction"
  ],
  "author": "Hannah Mccouch",
  "average_rating": "2.75",
  "url": "https://www.goodreads.com/book/show/1340755.Girl_Cook"
}