{
  "title": "An Accident of Hope",
  "description": "In 1956, Anne Sexton was admitted into a mental hospital for post-partum depression, where she met Dr. Martin Orne, a young psychiatrist who treated her for the next eight years. In that time Sexton would blossom into a world-famous poet, best known for her \"confessional\" poems dealing with personal subjects not often represented in poetry at that time: mental illness, depression, suicide, sex, abortion, women's bodies, and the ordinary lives of mothers and housewives. Orne audiotaped the last three years of her therapy to facilitate her ability to remember their sessions. The final six months of these tapes are the focus of this book.In An Accident of Hope, Dawn Skorczewski links the content of the therapy with poetry excerpts, offering a rare perspective on the artist's experience and creative process. We can see Sexton attempting to make sense of her life and therapy and to sustain her confidence as a major poet, while struggling with the impending loss of Orne, who was moving elsewhere. Skorczewski's study provides an intimate, in-depth view of the therapy of a psychologically tortured yet immensely creative woman, during a period of emerging feminism and cultural change. Tracing the mutual development of the poet and the therapist during their years together, the author explores the tension between the classical therapeutic setting as practiced in the early 1960s and contemporary relational and developmental concepts in psychoanalysis, just then beginning to emerge.An Accident of Hope also raises broader questions about the nature of healing in psychotherapy. The poet and therapist we encounter in these sessions present complex and conflicted images of the therapeutic and creative process. Orne, equal parts honesty and hesitancy, works to bolster Sexton's self-image and maintain that she is more than the sum of her poetry. Sexton, working against a tendency to hide from her most painful feelings, valiantly pushes to tell the truth in therapy, while her poems invite the readers to see another side of the story.Just as Orne kept the audiotapes so that one day they might help others who suffer, An Accident of Hope tells the story of a therapy but moves beyond it. By offering a glimpse into the past, the present is open for reappraisal, both of Sexton herself and the legacy of psychoanalytic treatment.",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Poetry",
    "Biography"
  ],
  "author": "Dawn M. Skorczewski",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/13407639-an-accident-of-hope"
}