{
  "title": "Riding with Brother",
  "description": "Cecelia is all set for a long weekend at the family lake house, but her car won't start. Her sexy older stepbrother Aiden offers a simple solution, she can ride with him on the back of his motorcycle. He promises to drive slowly, but it's not a fear of crashing that's stopping Cece from getting on the back of her brother's bike. She's worried about what will happen when the engine is thrumming between her legs and she is pressed up against the big hard body of her secret crush.*****This 5,800+ word short story is for readers who enjoy pseudo-incest, stepbrother-stepsister incest and bad boys with big bikes.*****Excerpt from insideTwenty minutes later I was in the woods, bent over the trundle cart arranging my pile so I could fit a few more logs in, when I felt two strong hands running over my hips. I straightened and arms circled my waist, hands cupping my breasts as lips pressed against my neck. Melting into Aiden's embrace, I asked him, \"What do you think you're doing?\" \"Helping.\" A moan gurgled up my throat. \"Not really.\" I turned to face him and wrapped my arms around his neck. His palm against the small of my back, he pushed me closer. He cupped my head, his mouth angling down to kiss me. It started with a slow lick of his tongue across my bottom lip. Stopping in the center, he moved up, his tongue slipping between my top lip and teeth. He drew it in, sucked on it a few seconds before his tongue probed deeper. His hold growing more possessive as he kissed me, he lifted me off my feet. I wrapped my legs around his waist, wishing we were naked and that his cock was buried inside me. He was hard and ready, his strong arms sliding me along his shaft. His teeth grazed the underside of my chin before he kissed the hollow. \"I want to lay you down and fuck you right now, baby girl.\" \"Why don't you?\" I challenged and flexed my thighs. \"Because I want to take my time doing it.\" He turned and braced my back up against a tree trunk. No longer needing both hands to support me, he pushed my tee up to massage my left breast. \"I want...\" He stopped talking for a few seconds as he kissed and pushed and squeezed at my flesh. \"I want to slowly drive you crazy, baby girl,\" he finished. His hand was up under my bra now, his thumb rubbing the nipple to a hard point. \"I want to kiss and fuck and suck you so thoroughly, you're not going to give those boys back at school a chance to even say hello. I want you to shut them out because you can't wait to get back to my bed.\"",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Erotica",
    "Novella",
    "Friends To Lovers",
    "Erotic Romance"
  ],
  "author": "Christa Wick",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/13410716-riding-with-brother"
}