{
  "title": "Tidal Whispers",
  "description": "Heart's Desire by Julie Reece:After a terrible accident, Tessa returns to her family beach house to heal. She doesn't expect to see her first summer crush from seven years before. Cameron, though, reappears and ignites a relationship that's far more intense than ever before. The only problem? Summer is once again coming to an end, and this time, Tessa will have to decide whether to choose life with Cameron or to never see him again. The Sweetest Song by Claire Gillian:Under Poseidon's rule, Circe is the most destructive siren in the Pacific ocean, her songs luring ships and their crew to their watery graves. Not Otis, the best halibut fisherman in the Alaskan waters. His ship, the Calypso, has avoided disaster each time Circe set her sights on him. Given one last chance to deliver Otis to Davy Jones' locker, Circe takes to land to waylay the handsome captain. Instead, it may be Otis himself who hooks the Siren. Pearl of Pau'maa by Kelly Said:Should Miki choose to wed the local wealthy boy she doesn't love, her stomach will stop grumbling. Her soul, however, will suffocate. With one last opportunity before she must concede, she sneaks off for a final dive to her hidden crate at the bottom of the seabed. What waits for her is more than a captured lobster. It's a treasure she cannot claim without great sacrifice or true love. The Undergarden by Jocelyn Adams Nixie:A water sprite, lives a solitary existence as she struggles to understand the strange world beyond her waters. When she meets one of the pink ones, a curious boy named Wyatt, their friendship blooms into a love that can exist only upon the sands that divide his solid ground from her underwater paradise. Some love, though, once born, cannot be undone, even in the face of death.",
  "genres": [
    "Fantasy",
    "Mermaids",
    "Romance",
    "Anthologies",
    "Young Adult",
    "Fiction",
    "Short Stories"
  ],
  "author": "Jocelyn Adams",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/13410587-tidal-whispers"
}