{
  "title": "Nextwave",
  "description": "The CEO of Nextwave hires Brandon to test the security of their exciting new product, the Brainset, which allows users to communicate directly with the internet through a web of sensors installed directly on their brains. Brandon discovers that the company’s beautiful and bitchy VP of Marketing, Hannah, has secretly installed her own Brainset. Hannah is irate when Brandon decides to conduct his security tests on her rather than on the five official testers, but she quickly finds that there is nothing she can do to change his mind.Throughout the testing period, Brandon forces Hannah into even more outrageous sexual acts, ostensibly in the name of proving how dangerous the Brainsets could be. The attractive woman is forced to strip naked, spank her own ass, and pleasure herself, all in front of a webcam so Brandon can watch. The hacker installs his own Brainset so that he can ‘feel’ Hannah’s emotions directly. She tries to escape numerous times, but Brandon’s close monitoring leads to immediate discovery and quick, painful punishments.Hannah’s situation gets even worse when Brandon decides that in order to prove how dangerous a hacked Brainset could be, he must train her to do something both difficult and distasteful. Ponygirl training seems like just the thing. The Brainset proves to be an excellent tool in demanding precise movements and instant obedience. Unfortunately, Hannah’s brainwaves show that she is getting sexual pleasure from being forced to march naked in bondage gear. To demonstrate that Hannah is not a willing slave, Brandon must find increasingly difficult and humiliating acts for her to perform.As the testing period draws to a close, Brandon is faced with a dilemma. He wants to demonstrate his hacking prowess, but he does not want to go to jail for the things he has done. Also, he would like to expose the security flaws of the Brainset without discouraging the company from moving forward with mass production, which he desires for his own ends. Can Brandon have his cake and eat it too?",
  "genres": [
    "BDSM",
    "Erotica",
    "Science Fiction"
  ],
  "author": "Jay Beach",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/13411352-nextwave"
}