{
  "title": "Say You'll Be Mine",
  "description": "In this utterly charming debut romance, a teacher with big dreams joins forces with a no-nonsense engineer to survive an ex's wedding and escape matchmaking pressure from their Indian families. Their plan? Faking an engagement, of course.Meghna Raman’s parents wanted her to be an engineer, but instead she’s followed her passion, becoming a theater teacher and aspiring playwright. But when she discovers that her beloved writing partner, best friend, and secret crush, Seth, is suddenly engaged—and not to her—she realizes he’s about to become the one-that-got-away. Even worse, he’s asked her to be his best man. And worse than that, she’s agreed. Determined to try and move on and relieve a bit of the pressure she feels, Meghna agrees to let her parents introduce her to a potential match. Maybe she’ll even find the engineer her family wishes she became. . . . Grumpy, handsome engineer Karthik Murthy has seen enough of his parents’ marriage to know that it isn’t for him. He only agreed to his mother’s matchmaking attempts to make her happy, never dreaming he would meet someone as vibrant as Meghna. Though he can’t offer her a real marriage, a fake engagement could help Meghna soothe the sting of planning Seth’s wedding festivities and Karthik avoid the absurd number of set-ups his mother has planned for the next year. But as they find common ground, grow protective of one another’s hearts, and learn to fall for the flaws they thought they hated, an undeniable chemistry takes shape. Soon, Meghna and Karthik’s expectations and insecurities threaten to risk something that’s become a lot more real than they hoped. Say You’ll Be Mine is a delightful trip back to the heyday of swoony romantic comedies from the nineties, but with a deep and poignant look at the effects of culture and family in our most intimate relationships.",
  "genres": [
    "Romance",
    "Contemporary",
    "Fiction",
    "Contemporary Romance",
    "Audiobook",
    "Adult",
    "Chick Lit"
  ],
  "author": "Naina Kumar",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/134117190-say-you-ll-be-mine"
}