{
  "title": "His Highness the Duke",
  "description": "The would-be heroine…Aeron wants nothing more than to continue to live out her very long, solitary life in a small metal room listening to communications for the Federation Military. It’s not glamorous. It’s not even charming. But it’s safe. There’s no chance of getting hurt.When she intercepts a communication about the impending genocide of the Qurilixian people, she has no choice but to act. No one at the Federation seems inclined to do anything about the threat and suddenly it’s up to her to save a whole planet. Enlisting the help of her degenerate sister, Aeron finds herself signed up as a prospective bride to the very barbarians she’s trying to save.The man who did not need saved…High Duke of Draig, Lord Bron, is not looking forward to his seventh failed attempt at a marriage ceremony, but when he sees the lovely Aeron he knows instantly his years of waiting have finally paid off. The gods have blessed him with a life mate… or have they? His new bride is insistent she’s not there for marriage, but for a mission. It’s up to Bron to convince her to stay, or risk spending the rest of his life alone. Contains graphic sexual content, adult language, and violence.ABOUT THE SERIES (Books 5-8):The Noblemen brothers aren’t new to the sacred Qurilixian bridal ceremony. After several failed attempts at finding a bride, it’s hard to get excited about yet another festival. No matter how honorable they try to live, it would seem fate thinks them unworthy of such happiness--that is until now.With very few words spoken and the shortest, most bizarre courtship in history, they will bond to their women forever. And once bonded, these men don’t let go.",
  "genres": [
    "Romance",
    "Dragons",
    "Science Fiction",
    "Paranormal",
    "Aliens",
    "Shapeshifters",
    "Paranormal Romance"
  ],
  "author": "Michelle M. Pillow",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/13412430-his-highness-the-duke"
}