{
  "title": "Unrequited Death",
  "description": "For fans of THE HUNGER GAMES and Xmen - who also enjoy original storylines!From the NYT bestselling author of A TERRIBLE LOVE, comes a ★★★#1 Amazon Dark Fantasy Bestselling series★★★Praise for \"...I have read all six books and can't wait for this final one to come out. Usually I don't read books about teens. However these are so much more and for all age groups. Some characters reminding me of my own children and grandchildren. These books take paranormal to a new level. Read all of them. Love this author...\" - nancy\"...I have thoroughly enjoyed this series, so much so I have preordered the next book in the death series due out in September. Thanks to the author for entertaining me...\" - Jack Dodd\"...This entire series is awesome. I'm glad I gave this series a shot... It has been truly amazing to follow the characters through this series. I have experienced happiness, shock, anger, sadness. It is a beautiful thing when a story can pull such emotion from the reader...\" - TaraAnnGThe Graysheets remain ominously quiet during the teen's senior year. When tragedy strikes Tiff, her confidence shatters into a million pieces and the group doesn't know how to pick up the scattered mess of her emotional health.As the control of the Zondorae scientists slips away, they make a final move to swing the balance in their favor, negotiating a future for the paranormals that is so final, a covert group moves to halt the momentum of their control over humanity with Jeffrey Parker as the catalyst.In a final bid to protect everyone, Caleb discovers he was at the center from the beginning, an unwilling pawn moved on a chess board that no longer exists. Will he have a future of safety and happiness for himself and Jade? Or will the decisions made before the fateful day of inoculation remain to hinder that forever?Full length novel.New adult recommended ages 17+ for sexual situations, profanity and violence",
  "genres": [
    "Paranormal",
    "Zombies",
    "Young Adult",
    "Dystopia",
    "Fantasy",
    "Paranormal Romance",
    "Horror"
  ],
  "author": "Tamara Rose Blodgett",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/13412690-unrequited-death"
}