{
  "title": "Queen Victoria’s Book of Spells: An Anthology of Gaslamp Fantasy",
  "description": "“Gaslamp Fantasy,” or historical fantasy set in a magical version of the nineteenth century, has long been popular with readers and writers alike. A number of wonderful fantasy novels, including Stardust by Neil Gaiman, Jonathan Strange and Mr Norrell by Susanna Clarke, and The Prestige by Christopher Priest, owe their inspiration to works by nineteenth-century writers ranging from Jane Austen, the Brontës, and George Meredith to Charles Dickens, Anthony Trollope, and William Morris. And, of course, the entire steampunk genre and subculture owes more than a little to literature inspired by this period.Queen Victoria’s Book of Spells is an anthology for everyone who loves these works of neo-Victorian fiction, and wishes to explore the wide variety of ways that modern fantasists are using nineteenth-century settings, characters, and themes. These approaches stretch from steampunk fiction to the Austen-and-Trollope inspired works that some critics call Fantasy of Manners, all of which fit under the larger umbrella of Gaslamp Fantasy. The result is eighteen stories by experts from the fantasy, horror, mainstream, and young adult fields, including both bestselling writers and exciting new talents such as Elizabeth Bear, James Blaylock, Jeffrey Ford, Ellen Kushner, Tanith Lee, Gregory Maguire, Delia Sherman, and Catherynne M. Valente, who present a bewitching vision of a nineteenth century invested (or cursed!) with magic.The Line-up:“Queen Victoria’s Book of Spells” by Delia Sherman“The Fairy Enterprise” by Jeffrey Ford“From the Catalogue of the Pavilion of the Uncanny and Marvelous, Scheduled for Premiere at the Great Exhibition (Before the Fire)” by Genevieve Valentine“The Memory Book” by Maureen McHugh“La Reine D’Enfer” by Kathe Koja“Briar Rose” by Elizabeth Wein“The Governess” by Elizabeth Bear“Smithfield” by James P. Blaylock“The Unwanted Women of Surrey” by Kaaron Warren“Charged” by Leanna Renee Hieber“Mr. Splitfoot” by Dale Bailey“Phosphorus” by Veronica Schanoes“We Without Us Were Shadows” by Catherynne M. Valente“The Vital Importance of the Superficial” by Ellen Kushner and Caroline Stevermer“The Jewel in the Toad Queen’s Crown” by Jane Yolen“A Few Twigs He Left Behind” by Gregory Maguire“Their Monstrous Minds” by Tanith Lee“Estella Saves the Village” by Theodora Goss",
  "genres": [
    "Fantasy",
    "Short Stories",
    "Steampunk",
    "Anthologies",
    "Historical Fiction",
    "Fiction",
    "Historical Fantasy"
  ],
  "author": "Ellen Datlow",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/13414149-queen-victoria-s-book-of-spells"
}