{
  "title": "Lucia: A Venetian Life in the Age of Napoleon",
  "description": "From the acclaimed author of A Venetian Affair comes the vivid and dramatic story of the fall of Venice and the rise of a new age during the tumultuous Napoleonic period, as seen through the eyes of his great-great-great-great-grandmother.In 1787, Lucia, the beautiful sixteen-year-old daughter of a prominent Venetian statesman, is married off to Alvise Mocenigo, scion of one of the most powerful Venetian families. But their life as a golden couple will be suddenly transformed when Venice falls to Bonaparte. As the larger events unfolding around Lucia mingle with her most personal concerns, we witness—through her letters to her sister and other primary sources—her painful series of miscarriages and the pressure on her to produce an heir; her impassioned affair with an Austrian officer and its stunning results; the glamour and strain of her career as a hostess in Hapsburg Vienna and lady-in-waiting at the court of Napoleon’s stepson, Prince Eugène de Beauharnais, as well as her intimate relationship with the Empress Joséphine; and her amazing firsthand account of the defeat of Napoleon in Paris in 1814. In her later years, Lucia, regal and still beautiful and a bit battle-hardened herself, was Byron’s landlord during the poet’s stay in Venice. In a fitting finale to this sweeping drama, Lucia stands as a relic of a lost golden she created, in part, the aura that gave rise to the Romantic view of Italy and its culture that we still nourish today.With the brave and articulate Lucia at the center of his re-creation of this remarkable historical period, Andrea di Robilant has once again reached across the centuries, and deep into his own past, to bring history to rich and vivid life on the page.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "Italy",
    "19th Century",
    "Historical",
    "Audiobook"
  ],
  "author": "Andrea di Robilant",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/1037623.Lucia"
}