{
  "title": "Underbelly Hoops: Adventures in the CBA - A.K.A. The Crazy Basketball Association",
  "description": "UNDERBELLY HOOPS covers Carson Cunningham's final season in the storied and now defunct Continental Basketball Association (CBA). In the process, it takes a sober look at minor league professional basketball, as Cunningham tries to navigate a poor relationship with his coach and yet finish his career on his own terms by playing a final season and winning a championship.As UNDERBELLY HOOPS shows, the CBA was a realm where hopeful players desperately hung on and crusty motels might very well have no clocks. It was a place where a trainer could be ordered to fill the visiting team's cooler with warm shower water and a coach might tell a player (namely, Cunningham) that he was focusing too much on his marriage and child rather than basketball. It was also a place where entire hotel wings could become saturated with the pungent smell of marijuana. And yet, even as it chipped away at your dignity and made little economic sense to remain, the CBA drew you in with the allure of action and the prospect of an NBA call-up. And it could inspire, like when you and your teammates caught a rhythm that made you remember why basketball is such a beautiful game, or when you saw guys continue to strive, to persevere, even if their dreams weren't fully realized.\"The hoops answer to Ball Four. By turns funny and poignant—and always self aware—this book allows fans into the locker room and huddle, yes, but also into the cortex of a professional basketball player. If Carson Cunningham could have jumped, run and created his shot off the dribble as masterfully as he writes and observes, he'd be starring in the NBA.\"—L. Jon Wertheim, Senior Writer for SPORTS ILLUSTRATED",
  "genres": [
    "Sports",
    "Basketball",
    "Nonfiction",
    "Memoir"
  ],
  "author": "Carson Cunningham",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/13414385-underbelly-hoops"
}