{
  "title": "The Big Miss: My Years Coaching Tiger Woods",
  "description": "The Big Miss is Hank Haney’s candid and surprisingly insightful account of his tumultuous six-year journey with Tiger Woods, during which the supremely gifted golfer collected six major championships and rewrote golf history. Hank was one of the very few people allowed behind the curtain. He was with Tiger 110 days a year, spoke to him over 200 days a year, and stayed at his home up to 30 days a year, observing him in nearly every at tournaments, on the practice range, over meals, with his wife, Elin, and relaxing with friends. The relationship between the two men began in March 2004 when Hank received a call from Tiger in which the golf champion asked him to be his coach. It was a call that would change both men’s lives. Tiger—only 28 at the time—was by then already an icon, judged by the sporting press as not only one of the best golfers ever, but possibly the best athlete ever. Already he was among the world’s highest paid celebrities. There was an air of mystery surrounding him, an aura of invincibility. Unique among athletes, Tiger seemed to be able to shrug off any level of pressure and find a way to win. But Tiger was always looking to improve, and he wanted Hank’s help. What Hank soon came to appreciate was that Tiger was one of the most complicated individuals he’d ever met, let alone coached. Although Hank had worked with hundreds of elite golfers and was not easily impressed, there were days watching Tiger on the range when Hank couldn’t believe what he was witnessing. On those days, it was impossible to imagine another human playing golf so perfectly. And yet Tiger is human—and Hank’s expert eye was adept at spotting where Tiger’s perfection ended and an opportunity for improvement existed. Always haunting Tiger was his fear of “the big miss”—the wildly inaccurate golf shot that can ruin an otherwise solid round—and it was because that type of blunder was sometimes part of Tiger’s game that Hank carefully redesigned his swing mechanics. Hank’s most formidable coaching challenge, though, would be solving the riddle of Tiger’s personality. Wary of the emotional distractions that might diminish his game and put him further from his goals, Tiger had developed a variety of tactics to keep people from getting too close, and not even Hank—or Tiger’s family and friends, for that matter—was spared “the treatment.” Toward the end of Tiger and Hank’s time together, the champion’s laser-like focus began to blur and he became less willing to put in punishing hours practicing—a disappointment to Hank, who saw in Tiger’s behavior signs that his pupil had developed a conflicted relationship with the game. Hints that Tiger hungered to reinvent himself were present in his bizarre infatuation with elite military training, and—in a development Hank didn’t see coming—in the scandal that would make headlines in late 2009. It all added up to a big miss that Hank, try as he might, couldn’t save Tiger from. There’s never been a book about Tiger Woods that is as intimate and revealing—or one so wise about what it takes to coach a superstar athlete.",
  "genres": [
    "Sports",
    "Nonfiction",
    "Biography",
    "Memoir",
    "Audiobook",
    "Biography Memoir",
    "Adult"
  ],
  "author": "Hank Haney",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/13414591-the-big-miss"
}