{
  "title": "A Nation Worth Ranting About",
  "description": "An all-new collection of furiously funny rants from the most recent seasons of the Rick Mercer Report plus three brilliantly written, previously unpublished pieces by Rick. Illustrated throughout with photos and snatches of dialogue from Rick’s encounters and exploits across Canada. “[Mercer’s] trademark one-camera rants against the Canadian parliamentary machine are more concise, and more believable, than any campaign ads.” —The Globe and Mail “The comedian of choice for viewers who read.” —Toronto Life “Canada’s hottest TV comic.” —Maclean’s \"Week after week, Mercer continues to delight with his alternately giddy and cutting political humour.” —The Canadian Press “Canada’s leading political satirist.” —The New York Times  “A good rant is cathartic. Ranting is what keeps me sane.They always come from a different place. Take the prime minister, for example. Sometimes when I rant about him, I am angry; other times, I am just severely annoyed—it’s an important distinction.”—Rick Mercer, from his introduction Within these pages you’ll find every rant that Rick has so brilliantly and blisteringly delivered since the publication of his previous bestseller, Rick Mercer Report: The Book. Together these rants form a chronicle of human folly, mostly featuring politicians, of course, but with honorable mentions going to people who don’t know how to use escalators and Canadian drivers who don’t think they need snow tires.   Is Mercer getting better or are the fools among us getting worse? Whatever the inspiration—Rick Mercer’s ranting has never been stronger or more on target.   There is a loud, cathartic laugh to be found on almost every page here—with the exception of Rick’s impassioned rant on bullying in schools, words that touched thousands of Canadians, went viral and helped widen the debate on a major problem. Also reprinted here is the rant encouraging students to vote, which resulted directly in a campus ballot and outrage in Ottawa.  (People still are still standing on the left on escalators, and the prime minister is still very much the man he was, but you can’t win them all.) In addition, Rick has authored three new essays specially for this book: the hilarious behind-the-scenes story of his meeting with Rick Hansen, a hero who absolutely was not a disappointment in real life; a heartfelt reflection on public reaction to his bullying rant; and an account of his response—mystified, followed by delighted—to the news that he’d inspired a “vote mob.” Illustrated throughout with photographs and dialogue from Rick’s travels across Canada, A Nation Worth Ranting About will make you proud, will make you think, will make you almost as angry as Rick, and over and over again will make you laugh out loud.",
  "genres": [
    "Nonfiction",
    "Humor",
    "Canada",
    "Politics",
    "Comedy",
    "Essays",
    "Biography"
  ],
  "author": "Rick   Mercer",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/13414642-a-nation-worth-ranting-about"
}