{
  "title": "To Live Again",
  "description": "If you've ever had a thought, a dream that you were someone else, living a different life, maybe you were. If you've heard the voice of someone lost to you and knew it wasn't a dream, then perhaps you will understand what happened to me, that my having an affair was not about sex.My name is Michelle Powers. I awoke one morning to discover that everything I knew about the world, myself, and my life was a lie. I always thought of myself, until that morning, as a realistic, moral woman, and went about doing my duty in all things, even if I didn't want to. That day I met the man I had been married to. Only not in this lifetime. I suppose before I get started with my tale I should introduce you to the people in my life that were most affected by the changes I made.My name is Larry Powers. I've loved one woman my entire life, and that’s Michelle. I fell in love with her in college and have never thought of loving anyone else. I never knew Michelle was unhappy. Since I was happy with our lives and our five children, I assumed she was also. She told me right from the beginning of … of the affair, that she'd met a man, Chance Morgan, and that she'd fallen in love with him. She tried to tell me that he was her husband from a past life. How was I supposed to deal with that?I don't blame Larry for hating me. I'm the man who blasted everything he valued into tiny particles of dust. But I didn't do any of it maliciously. I only intended to reclaim my wife. I am Chance Morgan, the man Michelle loves, and the man that Larry fears and hate. Sure, Larry had a right to be hurt, but what about me? Larry has only loved Michelle for a little over twenty-eight years. I've loved her forever. No, I don’t blame Larry for hating me. But in turn he shouldn't blame me for loving my wife.Well, now you've met us. My husbands, yes I suppose you're waiting for me to mention something about that. What can I say? I was a married woman. I slept with a man I was not legally married to, at least this time around. But I had been married to him so many times in the past that even I, even now, can't make myself accept such an archaic word as “Affair” for what happened. I was forced to choose between—the here and now with Larry or the anticipation of a future life with Chance. As you read how one day changed the lives of an entire family I don't ask for your acceptance, just that you keep an open mind. Who knows if the same thing might not happen to you?",
  "genres": [],
  "author": "F.D. Davis",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/10046625-to-live-again"
}