{
  "title": "Lethal Expedition",
  "description": "Hailed as the new Michael Crichton, compared to Stephen King and Jules Verne, James M. Tabor is an emerging suspense master who deftly blends heart-stopping adventure, cutting-edge science, and gripping intrigue. Now, in this original eBook short story, microbiologist Hallie Leland, the unforgettable protagonist from Tabor’s upcoming thriller The Deep Zone, battles a cabal of Islamic militants, Mexican drug lords, and domestic terrorists to save America from bioterror Armageddon.\nIncludes a preview of Tabor’s electrifying debut thriller, The Deep Zone, which #1 New York Times bestselling author Brad Thor called “an absolutely phenomenal read—The Andromeda Strain for the twenty-first century. Ladies and gentlemen, meet James M. Tabor—the new Michael Crichton.”\n\nMore advance praise for James M. Tabor’s The Deep Zone\n“The Deep Zone packs all the suspenseful wallop of Michael Crichton’s The Andromeda Strain, Stephen King’s The Stand, and Jules Verne’s Journey to the Center of the Earth. This is a literal cliffhanger that alters the way we look beneath the surface of our reality.”—Katherine Neville, New York Times bestselling author of The Eight“Deep-earth adventure, scintillating science, and cutthroat intrigue collide with thrilling results in James M. Tabor’s The Deep Zone. Wildly imaginative but grounded in today’s headlines, the story left me breathless and awed. Truly impressive.”—James Rollins, New York Times bestselling author of The Devil Colony“Just like the perilous cave that serves as its backdrop, this story is dark and terrifying—but with a light at its end. The book should come shrink-wrapped with a seat belt.”—Steve Berry, New York Times bestselling author of The Columbus Affair“One of the most ripping, primal thrillers I’ve read in a long while . . . Mixing adventure with breathless suspense, James M. Tabor expertly takes readers to the bottom of one of the world’s deepest caves and makes the journey both harrowing and awesome. This one really stands out.”—David Morrell, New York Times bestselling author of Creepers",
  "genres": [
    "Adventure",
    "Thriller",
    "Mystery"
  ],
  "author": "James M. Tabor",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/13414762-lethal-expedition"
}