{
  "title": "Stone of Tymora: Forgotten Realms",
  "description": "Praise for Stone of Tymora : “This fast-paced fantasy . . . is a perfect pick for . . . readers seeking powerful characterization and complex, fast-changing stories.”— Midwest Book Review“[T]he lucidly described action and swift pace will keep the pages turning and anticipation of further adventures simmering.” —Booklist“The pace never falters, the cast is positively festooned with pirates and menacing magical creatures (such characters from parallel stories as Drizzt Do'Urden the Dark Elf also put in appearances) and Maimun's narrative ends on a cliffhanger that will leave readers slavering for the next episode.” — Kirkus Meet Maimun—an orphan who couldn’t imagine how unfortunate it would be to discover a stone that makes him forever lucky. Fleeing a powerful demon named Asbeel, Maimun stows away aboard the ship Sea Sprite , where he encounters a cast of characters well-known to Salvatore Captain Deudermont, Drizzt Do’Urden, Wulfgar, Catti-brie, and the dwarf Bruenor. Drizzt becomes a mentor to Maimun and aboard Deudermont’s ship, they sail the treacherous seas of the Forgotten Realms. Hunted by a demon, haunted by a mysterious spellcaster, and chased by a pirate, Maimun, with Drizzt’s help, must unravel the secrets of the Stone of Tymora before his luck runs out! Read If you are looking for more about Drizzt, search for “Homeland” by R.A. Salvatore, the first book in the epic Legend of Drizzt.If you are looking for more epic fantasy series featuring young heroes, look for “The God Catcher” by Erin M. Evans, about a young thief and a woman who may be a dragon—or who may just be criminally insane.If you are looking for more adventure fantasy, search for “The Shard Axe” by Marshiela Rockwell, a chilling mystery set in the world of Dungeons & Dragons Online.If you are looking for more stories set in the Forgotten Realms, search for “Twilight Falling” by Paul Kemp, about Erevis Cale, an assassin with a conscience.If you are looking for more sword and sorcery, search for “Shadowbane” by Erik Scott de Bie, featuring a vigilante hero in the tradition of Batman and V for Vendetta.For more about R.A. Salvatore and Geno Salvatore, go to DungeonsandDragons.com",
  "genres": [
    "Forgotten Realms",
    "Fantasy",
    "Audiobook",
    "Dungeons and Dragons",
    "Fiction",
    "Novels",
    "Science Fiction Fantasy"
  ],
  "author": "R.A. Salvatore",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/13414728-stone-of-tymora"
}