{
  "title": "The Long Walk: A Story of War and the Life That Follows",
  "description": "In the tradition of Michael Herr’s Dispatches and works by such masters of the memoir as Mary Karr and Tobias Wolff, a powerful account of war and homecoming.Brian Castner served three tours of duty in the Middle East, two of them as the commander of an Explosive Ordnance Disposal unit in Iraq. Days and nights he and his team—his brothers—would venture forth in heavily armed convoys from their Forward Operating Base to engage in the nerve-racking yet strangely exhilarating work of either disarming the deadly improvised explosive devices that had been discovered, or picking up the pieces when the alert came too late. They relied on an army of remote-controlled cameras and robots, but if that technology failed, a technician would have to don the eighty-pound Kevlar suit, take the Long Walk up to the bomb, and disarm it by hand. This lethal game of cat and mouse was, and continues to be, the real war within America’s wars in Iraq and Afghanistan.But The Long Walk is not just about battle itself. It is also an unflinching portrayal of the toll war exacts on the men and women who are fighting it. When Castner returned home to his wife and family, he began a struggle with a no less insidious foe, an unshakable feeling of fear and confusion and survivor’s guilt that he terms The Crazy. His thrilling, heartbreaking, stunningly honest book immerses the reader in two harrowing and simultaneous the terror and excitement and camaraderie of combat, and the lonely battle against the enemy within—the haunting memories that will not fade, the survival instincts that will not switch off. After enduring what he has endured, can there ever again be such a thing as “normal”? The Long Walk will hook you from the very first sentence, and it will stay with you long after its final gripping page has been turned.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "War",
    "Military Fiction",
    "Biography",
    "History",
    "Military History"
  ],
  "author": "Brian Castner",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/13414795-the-long-walk"
}