{
  "title": "The Sandcastle Girls",
  "description": "Over the course of his career, New York Times bestselling novelist Chris Bohjalian has taken readers on a spectacular array of journeys. Midwives brought us to an isolated Vermont farmhouse on an icy winter’s night and a home birth gone tragically wrong. The Double Bind perfectly conjured the Roaring Twenties on Long Island—and a young social worker’s descent into madness. And Skeletons at the Feast chronicled the last six months of World War Two in Poland and Germany with nail-biting authenticity. As The Washington Post Book World has noted, Bohjalian writes “the sorts of books people stay awake all night to finish.”In his fifteenth book, The Sandcastle Girls, he brings us on a very different kind of journey. This spellbinding tale travels between Aleppo, Syria, in 1915 and Bronxville, New York, in 2012—a sweeping historical love story steeped in the author’s Armenian heritage, making it his most personal novel to date.When Elizabeth Endicott arrives in Syria, she has a diploma from Mount Holyoke College, a crash course in nursing, and only the most basic grasp of the Armenian language. The First World War is spreading across Europe, and she has volunteered on behalf of the Boston-based Friends of Armenia to deliver food and medical aid to refugees of the Armenian genocide. There, Elizabeth becomes friendly with Armen, a young Armenian engineer who has already lost his wife and infant daughter. When Armen leaves Aleppo to join the British Army in Egypt, he begins to write Elizabeth letters, and comes to realize that he has fallen in love with the wealthy, young American woman who is so different from the wife he lost.Flash forward to the present, where we meet Laura Petrosian, a novelist living in suburban New York. Although her grandparents’ ornate Pelham home was affectionately nicknamed the “Ottoman Annex,” Laura has never really given her Armenian heritage much thought. But when an old friend calls, claiming to have seen a newspaper photo of Laura’s grandmother promoting an exhibit at a Boston museum, Laura embarks on a journey back through her family’s history that reveals love, loss—and a wrenching secret that has been buried for generations.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Book Club",
    "Historical",
    "Audiobook",
    "War",
    "Romance"
  ],
  "author": "Chris Bohjalian",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/13414792-the-sandcastle-girls"
}