{
  "title": "Rare Birds: The Extraordinary Tale of the Bermuda Petrel and the Man Who Brought It Back from Extinction",
  "description": "The inspiring story of David Wingate, a living legend among birders, who brought the Bermuda petrel back from presumed extinction Rare Birds is a tale of obsession, of hope, of fighting for redemption against incredible odds. It is the story of how Bermuda’s David Wingate changed the world—or at least a little slice of it—despite the many voices telling him he was crazy to try. This tiny island in the middle of the North Atlantic was once the breeding ground for millions of Bermuda petrels. Also known as cahows, the graceful and acrobatic birds fly almost nonstop most of their lives, drinking seawater and sleeping on the wing. But shortly after humans arrived here, more than three centuries ago, the cahows had vanished, eaten into extinction by the country’s first settlers. Then, in the early 1900s, tantalizing hints of the cahows’ continued existence began to emerge. In 1951, an American ornithologist and a Bermudian naturalist mounted a last-ditch effort to find the birds that had come to seem little more than a legend, bringing a teenage Wingate—already a noted birder—along for the ride. When the stunned scientists pulled a blinking, docile cahow from deep within a rocky cliffside, it made headlines around the world—and told Wingate what he was put on this earth to do. Starting with just seven nesting pairs of the birds, Wingate would devote his life to giving the cahows the chance they needed in their centuries-long struggle for survival — battling hurricanes, invasive species, DDT, the American military, and personal tragedy along the way. It took six decades of obsessive dedication, but the cahow, still among the rarest of seabirds, has reached the hundred-pair mark and continues its nail-biting climb to repopulation. And Wingate has seen his dream fulfilled as the birds returned to Nonsuch, an island habitat he hand-restored for them plant-by-plant in anticipation of this day. His passion for resuscitating this “Lazarus species” has made him an icon among birders, and his story is an inspiring celebration of the resilience of nature, the power of persistence, and the value of going your own way.",
  "genres": [
    "Nature",
    "Conservation",
    "Science",
    "Birds",
    "Natural History",
    "Animals",
    "Environment"
  ],
  "author": "Elizabeth Gehrman",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/13414903-rare-birds"
}