{
  "title": "Shadows",
  "description": "Love. Nightmares. Angels. War.\n Shadows, the first book in the Rephaim series, 'Scary, sexy, suspenseful.' Claudia Gray It's almost a year since Gaby Winters watched her twin brother die. Her body has healed in the sunshine of a new town, but her grief is raw and constant. It doesn't help that every night in her dreams she fights and kills hell-beasts. And then Rafa comes to town and tells her things about her brother and her life that cannot be true, things that are dangerous. Who is Rafa?  Who are the Rephaim?  And who is Gaby? The truth lies in the shadows of her nightmares. Paula Weston lives in Brisbane with her husband, a retired greyhound and a moody cockatiel. She reads widely, and is addicted to paranormal stories. Shadows, book one of the Rephaim series, is her first novel. textpublishing.com.au 'When you're close to finishing editing a book, you're usually ready to let it go. You know it's as fabulous as the day you began and hopefully a little more so, but you've read it so many times your enthusiasm has dampened, at least for a while. Not so with Shadows. I love everything about this the frisson between the sassy, stubborn heroes Gaby and Rafa, the bleached-out sunscape of Pandanus Beach, the crazy velocity of the story, the satisfy-me-but-make-me-desperate-for-book-two ending. Shadows is wildly enjoyable - more so each time I read it.' Alison Arnold, editor 'Fans in need of another angel series after finishing Lauren Kate's Fallen series will devour Shadows, eager for the next books in the Rephaim series; there's a heroine - Gaby- to get behind, a boy - Rafa - to fall in love with, as well as the many sides fighting to win you over (just don't decide too early).' Book Probe Blog 'Shadows is a completely exciting, fast-paced debut that had me on the edge on my seat. This book has just shot straight up to my favourites shelf...Shadows is the first book of the Rephaim series and a brilliant start at that. With its gritty story and riveting ideas, this book stands out against the endless contenders in this genre. Paula Weston is an author to watch and I'm already eager to try more from her in the future.' Realm of Fiction Blog 'Shadows is filled with mystery, I kept trying to guess what was going to happen or what the explanation would be and I'm pleased that it was never predictable. There was also plenty of action which were fast paced and intense...Shadows ticks all the boxes when it comes to great paranormal stories and it is sure to please fans of paranormal YA fiction.' Vegan YA Nerds Blog",
  "genres": [
    "Angels",
    "Fantasy",
    "Young Adult",
    "Paranormal",
    "Romance",
    "Urban Fantasy",
    "New Adult"
  ],
  "author": "Paula Weston",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/13414880-shadows"
}