{
  "title": "Living Beautifully with Uncertainty and Change",
  "description": "Is it possible to live well when the very ground we stand on is shaky? Yes, says everyone's favorite Buddhist nun, it's even possible to live beautifully, compassionately, and happily on shaky ground—and the secret is: the ground is always shaky. Pema shows how using a traditional Buddhist practice called the Three Vows or Three Commitments is a way to relax into profound sanity in the midst of whatever non-sanity is happening around us. Just making these simple aspirations can change the way we look at the world and can provide us with a lifetime of material for spiritual practice. The three commitments are three methods for embracing the chaotic, uncertain, dynamic, challenging nature of our situation as a path to awakening. The first of the commitments, traditionally called the Pratimoksha Vow, is the foundation for personal liberation. This is a commitment to doing our best to not cause harm with our actions or words or thoughts, a commitment to being good to each other. It provides a structure within which we learn to work with our thoughts and emotions, and to refrain from speaking or acting out of confusion. The next step toward being comfortable with groundlessness is a commitment to helping others, traditionally called the Bodhisattva Vow. It is a commitment to dedicate our lives to keeping our hearts and minds open, and nurturing our compassion with the longing to ease the suffering of the world. The last of the three commitments, traditionally known as the Samaya Vow, is a resolve to embrace the world just as it is, without bias; a resolve to see everything we encounter, good and bad, pleasant and painful, as a manifestation of awakened energy. It is a commitment to see everything and anything as a means by which we can awaken further.",
  "genres": [
    "Buddhism",
    "Spirituality",
    "Nonfiction",
    "Self Help",
    "Philosophy",
    "Religion",
    "Psychology"
  ],
  "author": "Pema Chödrön",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/13414918-living-beautifully-with-uncertainty-and-change"
}