{
  "title": "Four Star Funerals: An Anthology About Death",
  "description": "By Ann Barrington, David R. Davis, Melissa Russell Deur, Patricia Holland, Kathryn Lay, Deborah J. Lightfoot, Martha Moore, Cecile Odell, Diane Roberts, and BJ Stone. Cover art copyright (c) 2011 by David R. Davis. All rights reserved.\"Four Star An Anthology About Death\" (in three Memoir, Poetry, & Fiction) packs the emotional wallop of \"Titanic,\" darkened with a dash of \"Tales From the Crypt.\" This 10-author anthology about death and its aftershocks will sear your soul, make you laugh ... and ultimately help you heal, if you're haunted by a death that has upended your emotions in ways you never expected.From the Anguish, joy, anger, relief, regret, sadness, numbness, fear, guilt, greed, indifference -- so many ways to feel about a death. Maybe you reach for a touch of humor to lighten your heart. Whatever your response to the end of a life, know that you are not alone.“Four Star Funerals” is a collection drawn from the personal experiences of the Four Star writers, a critique group that met at the Four Star Coffee Bar in Fort Worth, Texas. Death has not merely touched our group, it has hammered many of us in recent years. We’ve lost children, husbands, mothers and fathers, brothers and sisters, close friends. We’ve lost one of our own, a beloved member of our close-knit group.“Write what you know” is standard advice to writers. We’ve taken it to heart. Death is what we’ve come to know too well in recent times. Our individual responses to our bereavements show a universe of emotions. You never know how you will react until you’ve been there.If you’ve been there, if you’ve lost someone important to you, maybe you’ve been surprised -- even shocked -- by your reaction. Perhaps you have felt that your emotions are inappropriate. Maybe it will help you to know that one of us, in our small but diverse writers’ group, has felt much as you have. In our essays, anecdotes, poems, and stories, we hope you find a measure of comfort. You are not alone, nor are we.",
  "genres": [],
  "author": "Ann Barrington",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/13415348-four-star-funerals"
}