{
  "title": "Discord",
  "description": "Now Available on Amazon!The saga continues as Haley Helms accepts the plight of her new found life with Andrew Alexander. Andrew is determined to ensure their wedded bliss, but Haley isn’t so sure they will ever walk down the aisle. Not only will her strength be tested when she meets the rest of Andrew’s nefarious family of Parevites, but her love for Andrew will, too. As the life Haley once knew further unravels, she will be forced to make a decision between following her true destiny or becoming immortal and forever damning her soul. Mankind’s fate is still in the hands of the Parevites, but will the eight children unite in time or will ancient rivalries and past loves prevent their unification? As I stepped forward, ignoring Andrew’s suggestion, a sudden stabbing pain pierced my stomach. “Ouch,” I said, wincing.Bending over and holding my abdomen, there was another sharp pain, forcing me to my knees. Blood dripped from my nose, turning the snow around me pink. As I looked down, I noticed the inner stitching of my jeans was completely blood soaked.“Haley!\" Andrew shouted as he ran toward me.A ring of fire encircled me. Andrew lunged in my direction. His body slammed against what seemed to be an invisible wall, throwing him backward.“Andrew!” I screamed, crawling on my knees and extending my hand toward the fire. I quickly retracted it, feeling the flames sear my fingertips.The air was thinning around me. I frantically clawed at my throat, gasping for air. Alec had been right, Alexandria was reclaiming her soul—our soul. Andrew’s love was never the reason for her return. Holding my chest, trying my hardest to inhale, my face hit the cold snow, blackening the world around me. ~*~When I opened my eyes, I stood in a small, bare room, which was brightly lit. I blinked rapidly, eventually able to focus after my eyes adjusted to the light. Nothing around me looked familiar as I searched the room with only my eyes—afraid to move.“Hello.” I called out in a soft whisper at first, unsure of what to expect.I waited several seconds for a reply, but I could hear nothing, not one sound—everything was eerily quiet.Cautiously walking across the room, I felt the warm, soft pillow-like floor. I leaned my hand against the wall beside me, quickly pulling it away. It wasn’t hard, which I had expected, but rather an opaque liquid that rippled when I touched it. “Hello!” I shouted this time, panicking slightly as I noticed there were no doors or windows in the room.“Haley.” An angelic voice spoke.I quickly turned toward the voice.",
  "genres": [
    "Paranormal",
    "Young Adult"
  ],
  "author": "Samantha Shakespeare",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/13415895-discord"
}