{
  "title": "Anđeli će samo zaspati",
  "description": "Anđeli nemaju raspored kada će tko umrijeti. Anđeli ne znaju zašto netko mora umrijeti, no tajna ostanka na ovom svijetu i napuštanja zemaljskog života ne može svakome biti otkrivena, a u nju su upućeni samo odabrani. Misterij života i smrti otkriva se rijetkima. Ovo je priča o tridesetogodišnjoj Katarini, mladoj ženi punoj života, i njezinom anđelu čuvaru kojem je povjeren mučan zadatak da joj najavi da će uskoro umrijeti - roman prvijenac novinarke Merite Arslani.Katarina je tridesetogodišnjakinja, živi u Zagrebu i radi na televiziji kao pisac scenarija za zabavne emisije. Jednog dana javlja joj se Danijel, njezin anđeo čuvar, koji joj je došao reći da je bolesna i da će umrijeti za tri mjeseca. Do tog dana Katarina nije ni znala da je bolesna, a i nikada nije razmišljala o anđelima čuvarima niti je mislila da oni zbilja postoje. Iako je vjerovala da postoji neki svijet izvan ovog svijeta u kojem živimo, nije očekivala da će baš ona biti ta koja će dobiti dokaz da postoji drugi svijet. Ispočetka zbunjena, Katarina mu nije vjerovala da je uistinu anđeo, a kamoli njezin anđeo čuvar, ali je uz njegovu pomoć i trud pomalo počela otkrivati svijet u kojem će nastaviti živjeti nakon smrti. I dok joj Danijel otkriva kako izgleda život nakon smrti, Katarina iskorištava vrijeme koje joj je ostalo kako bi sumirala sve što je radila kroz život. Zajedno s njim prisjeća se nekih važnih stvari i događaja u životu i ti isti događaji je podsjećaju na neke pjesme i pomalo sa svojim anđelom čuvarom slaže \"soundtrack\" svog života.Danijel, od početka razočaran što je tako brzo došlo vrijeme za Katarinin odlazak uporno nastoji smisliti kako da Katarina živi još neko vrijeme. Pokušao je uvjeriti ostale anđele da Katarinu ostave tamo gdje je, ali to ostaje samo njegova želja. Priliku vidi u jednom neočekivanom događaju. Katarini jedan od kolega s kojim radi pet godina otkriva kako je u nju zaljubljen već jako dugo, ali joj ranije nije imao hrabrosti to reći. Zbunjenoj Katarini ovo je najmanje što joj u trenutku kada umire treba, a ni do sadabaš nije imala sreće u ljubavi i pomalo joj je bilo dosta ljubavnih avantura. Međutim, Katarina ne zna da su anđeli popustili Danijelovim zahtjevima i dogovorili se ako se Katarina ovaj put uspije zaljubiti da će je pustiti da živi...",
  "genres": [],
  "author": "Merita Arslani",
  "average_rating": "3.46",
  "url": "https://www.goodreads.com/book/show/13417003-an-eli-e-samo-zaspati"
}