{
  "title": "Joy, Interrupted: An Anthology on Motherhood and Loss",
  "description": "Joy can be interrupted - but not lost. Most people think of motherhood as a joyous experience, but for some it can be an experience of interrupted joy. This anthology delves into the subject of motherhood and loss from different perspectives of authors and artists from all over the world. The book is uniquely structured around the five stages of grief, mirroring the grief journey many go through. Editor and publisher Melissa Miles McCarter conceived of the anthology six years after her daughter died of SIDS and then struggling with secondary infertility after an ectopic pregnancy. The anthology focuses on mothers and their children who face loss in all forms, losses which can \"interrupt the narratives of our lives.\"Some of these universal themes addressed include: coping with the death of a child; relationships between mother and child (including adoption and estrangement): caring for disabled children: and having to mother one's own mother because of an illness.This anthology includes Short Stories, Poetry, Art Work, Essays, Fiction, Creative Non-Fiction and more. Contributors explore such topics as Adoption, Death, Infertility, Disabilities, Illness, and Estrangement. Various themes addressed include Coming of Age, Identity, Recovery, Connections, and Forgiveness. The internationally acclaimed contributors are: Merrill Edlund , Aliki Economides, Monika Pant, Grace Benedict, Chris Reid, Paul Salvette, Terri Elders , Liz Dolan , Mark Moore, Emily Polk, Lottie Corley, Sandra Kolankiewicz, Megan Moore, Valerie Murrenus Pilmaier, Anna Steen, Nina Bennett, Kim Hensley Owens , Joanne L. DeTore, Robyn Parnell, Danelle, Svetlana Bochman, Erin Williams, Gail Marlene Schwartz, Olivia Good , Elynne Chaplik-Aleskow, Margaret Kramar, Carol Alexander, Valean Iolanda, Samantha, Kristin Anderson, Lisa Wendell, Janeen McGuire, Anindita Chatterjee, Jenn Williamson, Mazel Flores, Rebecca Manning, Pooja Sachdeva, Nancy Arroyo Ruffin, Gabriella Burman, Sheila Hageman, Ruth Krongold, G. Karen Lockett Warinsky , Jennifer Molidor, Alan Nolan, Trangdai Glassey-Tranguyen, Jemila Modesti, Deborah Finkelstein, Jessica Karbowiak, Ann Mathew, Yolanda Arroyo Pizarro, Ione Citrin, Ivan Jim Saguibal Layugan, Mary O'Neill, Lori Lamothe and Michèle AimPée Parent.",
  "genres": [],
  "author": "Melissa Miles McCarter",
  "average_rating": "4.77",
  "url": "https://www.goodreads.com/book/show/13417320-joy-interrupted"
}