{
  "title": "Tides of Love",
  "description": "Alternate cover edition of ASIN B0066B1XTY**Includes lengthy excerpt for the National Reader's Choice winner and sequel novel TIDES OF PASSION**He left all he loved behind...Will he be able to return and win her heart?An earth-shattering secret revealed in his recently deceased mother's diary causes harsh words between Noah Garrett and his brother. Desolate and totally bewildered, Noah leaves Pilot Isle and has no contact with his family or even Elle Beaumont, the girl who has been his shadow all through childhood. Now, ten years later, Noah is a renowned biologist and returns to Pilot Isle to head up a research lab. Coming back home opens up old wounds and uncovers buried feelings. Hoping to have a few days to cope with all the old emotions welling up within him, Noah really isn't ready to face anyone yet. However, it's just his luck that the first person he literally bumps into is Elle. The only difference is, Elle is no longer a thin red headed mischievous imp who is constantly in trouble and always needing to be rescued. This Elle is a gorgeous, passionate young woman who sets Noah's blood on fire.Marielle Claire Beaumont has loved Noah since she was a child. As a sad little girl who'd recently lost her mother and couldn't speak English, Elle met Noah when he saved her from taunts at school. Ever since then Elle has loved Noah unconditionally and followed him around like a little puppy. Her world was shattered when he left so suddenly. His silence all these years has been very difficult, and Elle is stunned when she slams into him so unexpectedly. It's not long before she's disrupting Noah's life again as sparks of passion fly in every direction between the two.",
  "genres": [
    "Romance",
    "Historical Romance",
    "Historical",
    "Contemporary",
    "Fiction",
    "Historical Fiction",
    "Amazon"
  ],
  "author": "Tracy  Sumner",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/13418081-tides-of-love"
}