{
  "title": "The Zul Enigma",
  "description": "WHO... OR WHAT... IS ZUL?THE ZUL ENIGMA, J M Leitch's debut sci fi thriller, awarded Book of the Month by E-thriller.com, is provoking passionate feedback: \"... chillingly possible. An intelligent and riveting read which left me with a lasting sense of unease\"\"...it absolutely blew my mind into a bazillion pieces\" and \"by far, one of the best books I've ever read.\"'It took Scott Fuller a full five minutes to recover from the shock. A relative of the infamous Dr Carlos Maiz, the man charged with committing murder on the largest scale in the history of mankind, had hunted him down wanting to talk. He inhaled a deep breath before returning the call.'The Zul Enigma, best selling futuristic science fiction thriller, seamlessly weaves New Age beliefs with hard, physics facts. Set in 2068 it spans two generations following a quest to expose the perpetrator behind a cataclysmic event that takes place in 2012, changing the world forever.In March 2012, when an alien entity claiming to represent the Galactic Federation contacts Dr Carlos Maiz, Director of the United Nations Office for Outer Space Affairs, he thinks it's a hoax. But Zul persuades Carlos that, without his intervention, the coming month of December will not just mark the end of the year... it will be the end of the world.Carlos, doing battle with his own demons as well as with a sceptical boss, NASA, the National Security Agency, National Intelligence and the President of the USA who wants him committed to a mental asylum, races the ticking clock to set up a global initiative to avert Zul's horrific prediction. But when a monstrous apocalypse of a different nature altogether brings the planet to its knees, rather than being lauded for saving humanity Carlos is accused of destroying it... and of inventing Zul.Fifty-five years later, Rachael Harris makes a disturbing discovery. She is related to the infamous Carlos Maiz. The more she learns, however, the more convinced she is that he was the victim of a sophisticated conspiracy. Delving deep and tracking down two of his old associates she uncovers the hideous reality underlying the events of that frightful day in December 2012, revealing a tale of global deception for a prize of absolute power.Underpinned by a theme of betrayal, this dystopian novel is set against a backdrop of climate change, overpopulation, world war, alien encounters, presidential plots and a new world order. A venomous twist reveals the most horrific conspiracy one could ever imagine and Zul is behind it.'I was there, damn you. I saw it with my own eyes. And it was horrific. And of course it was wrong. It was the worst thing I could ever, ever, have imagined.''Now it's too late. It doesn't matter who you tell or what you say. No one will ever believe you.'",
  "genres": [
    "Science Fiction",
    "Amazon",
    "Science Fiction Fantasy"
  ],
  "author": "J.M. Leitch",
  "average_rating": "3.30",
  "url": "https://www.goodreads.com/book/show/13418197-the-zul-enigma"
}