{
  "title": "Wishhobbler",
  "description": "Somewhere in the damp, twisting alleyways of the Songwynd slums there lives a hideous freak of nature.Driven by poverty, Spin and her family move to the Songwynds in search of work. There they share a tiny, rat-infested flat with a wishhobbler.An enormous toffee and custard guzzling fleabag, the wishhobbler’s viciousness has caused fear and mayhem among the slum dwellers. Unable to hit back at the wishhobbler, her victims instead pick on Spin and her family. Friendless, haunted by thugs and bullies, and struggling to cope with a rare illness, Spin isn’t having much fun.When the wishhobbler disrupts the carefully laid plans of the mysterious Television Racers, Spin finds herself at the centre of a deadly confrontation.And then things take a turn for the worse ...By turns comic and terrifying, this fully illustrated novel is a must for anyone who's ever been bored, bullied or lived with a monster.Originally published in 2001, this is a brand new and expanded edition of a much loved novel. The original 24 stunning pen and ink drawings have now been joined by nearly 30 brand new illustrations.Abandoned by her mother at an early age, Spin has been adopted by Sir Fistache mal Arthreign. The knight’s habit of collecting waifs and strays has thrown together a family of rowdy headbangers. Expelled from countless towns and villages, they hope to make a fresh start in the Songwynd slums. But the decision to bring along their pet wishhobbler wrecks any chance of this.An outsider wherever she goes, Spin longs for something to be a part of. Forced into work to feed and clothe her adoptive family, she finds a way of using her new job to enter the carefully guarded world of the Television Racers. Not the first mistake she’s ever made, but it could well be the last ...",
  "genres": [
    "Fantasy",
    "Gothic"
  ],
  "author": "Francis O'Dowd",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/103789195-wishhobbler"
}