{
  "title": "Piercing Crimson",
  "description": "PROLOGUETHEY WERE AFTER ME.Vampires, people I thought I knew, but the secrets hidden beneath their chalky white skin made my blood run cold. I shivered as the flashbacks came back, crashing into me. Even now, the cool winds matched my frantic pace, moaning and howling through the trees as if to divulge my location. Not that it was necessary; they knew. I could feel their gazes on me as I struggled through the branches that were constantly nagging at me and slowing me down. Each time I dared a look through the gloom, I could see their burning crimson eyes on me, bemused at my terror.I staggered, now, as I thought back to the first day I had crossed paths with a vampire – not that I knew of. The man of the shadows, his eyes had pierced through me, and the weakness I felt then was not unlike how I felt now with just one gaze.They played with my mind as they made a show out of their hunt for my soul. Every now and then, I would hear their voices inside my head, manipulating my thoughts as to compel my actions. They did it now, too, and I unconsciously lost control of myself to them.A moment was all they needed – all it took for me to fall to the ground, descending on my knees. If they were the predators, then I was the shot prey, at their feet as they lingered around me in the shadows.And I gave up all hope. I was a lost cause, just another soul the immortals after me would breathe in before they decided they needed more air. They would go about on their hunt for more victims to manipulate, innocents to torture, and lives to tear apart.It was in their very nature, and I accepted that as I pulled myself out of my drowning weakness, not allowing it to take over. The lack of air suffocated me as I stood up to face the immortals. Suddenly, I realized it wasn’t the air escaping me; it was my very soul.That final look into those glinting crimson eyes – so many that all I saw were numerous flashes as they swiftly approached the prey, never one in the same place – confirmed my true fear; I was a goner to the world. My life slowly descended out of me when one of the vampires reached forward with an arm, stripping me of my soul. With just one snap of his wrist, my mind went blank.",
  "genres": [],
  "author": "Maria M.",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/13420066-piercing-crimson"
}