{
  "title": "Zerrin",
  "description": "Zerrin: (Smitten, Bitten, Hidden) A three part young adult, fantasy fiction novel by Patria L. Dunn (Patria Dunn-Rowe)Waterville, Maine is exactly where Alana Cassidy never expected to end up. Just across the river from Winslow, the town she grew up in, it is where she is now forced to call home. Placed in a horrible foster home, with equally horrible foster parents, the death of her mother and father five years ago was only the beginning of the nightmare her life has become. Jonas of Altonia: former guard of the King’s court, banned from his home, injured and dying he waited out his fate, hidden under a forgotten dock deep in the woods behind the Pernickle’s farm. He hadn’t wanted to be saved, but she’d heard his song, planting a seed that took root the second she dragged him free of what would have been a fresh water grave. With just a bite and a merman's tear, a whole new life awaits Alana Cassidy if she wants it. Never as simple as it seems, she contends with the pain of leaving her foster siblings she's grown to love behind, or staying and living with the wrath and abuse of her soon to be legal parents. Her own parents wouldn't have wanted this life for her, and with Jonas's help, she is starting to realize that in her grief, she'd forgotten how to live. Whoever said transforming into a mermaid was easy, especially when the price attached is becoming King Triton's dead daughter, Zerrin? Bound in Jonas's essence -a secret between them all their own- the kingdom of Altonia awaits, and with it the surprise of a resurrected princess. Bitten and changed, Alana has a lot to learn. Looks can be deceiving, but acceptance is not so freely given. Captivity brings even more questions for a newly transformed Princess Zerrin. Readily accepted by the citizens of Altonia, King Triton is not so easily swayed, the bite marks along his daughter’s neck, baring tale to the evil that could be growing within her now. Secluded and left to wait out her fate, Zerrin begins to realize that Jonas may not have been completely honest with her. Without a King or Queen to rule it’s court, war is imminent, and Padigonia may be lost forever. A king of her choosing is what Triton has offered, but Zerrin has secrets she will be forced to reveal. It was never her intention to hurt anyone, but in order to live again she must do just that. Her past is her future, though finding it again will be harder than she realizes.",
  "genres": [
    "Mermaids"
  ],
  "author": "Patria Dunn-Rowe",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/13422361-zerrin"
}