{
  "title": "Yet Icebound Rivers Flow",
  "description": "\"I took to writing when I was in my 30s. By then, I had finished secondary school in Valmiera on the lovely Gauja River, had been a medical student in Riga for 2 years, had spent 4 years of the war in various concentration camps in Latvia and in Germany, Buchenwald included, had resumed my medical studies, graduated, and been a doctor for several years. My first short stories were published in 1953. In 1957, I discarded humour and wrote 'Yet Icebound Rivers Flow'. Why did I touch once more the wounds inflicted on the Latvian people by German fascists? Does not every human being, like you and me, yearn for sunshine, for peace, for kindness? Is it necessary to bring back to mind pain and sufferings? Yes. It was necessary to write this book. First, because I knew all the people in it, good and bad, and was present at the funeral of those whose bodies were burnt. Second, because it would have been unjust to allow the heroism of true enthusiasts to slip into oblivion. Finally, this event has to be recalled so that what happened then may never reoccur. I did not succeed in rendering the event in its entirety. But who has been able to paint the ocean in all its fathomless grandeur? I only hope that the events described here will never repeat themselves, so that I may continue to live in Cesis, a little town on the Gauja, and cure people with weak lungs, and write humorous short stories.\" After the Soviet occupation of Latvia, Birze joined the Young Communist League. He was arrested in July 1941, after the Occupation of Latvia by Nazi Germany. He was first held in prison in Valmiera, then in Salaspils concentration camp. After this he was assigned to do forced labor in the construction of a hangar at the Spilve Airport in Riga. In July 1944 he was among 1200 people transported to Germany to the Buchenwald concentration camp. In April 1945 Birze managed to escape. He tried to return home through Poland, but he was arrested and held in the filtration camp in Hrodna.",
  "genres": [],
  "author": "Miervaldis Birze",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/13423871-yet-icebound-rivers-flow"
}