{
  "title": "Unto Others: The Evolution and Psychology of Unselfish Behavior",
  "description": "No matter what we do, however kind or generous our deeds may seem, a hidden motive of selfishness lurks--or so science has claimed for years. This book, whose publication promises to be a major scientific event, tells us differently. In Unto Others philosopher Elliott Sober and biologist David Sloan Wilson demonstrate once and for all that unselfish behavior is in fact an important feature of both biological and human nature. Their book provides a panoramic view of altruism throughout the animal kingdom--from self-sacrificing parasites to insects that subsume themselves in the superorganism of a colony to the human capacity for selflessness--even as it explains the evolutionary sense of such behavior.Explaining how altruistic behavior can evolve by natural selection, this book finally gives credence to the idea of group selection that was originally proposed by Darwin but denounced as heretical in the 1960s. With their account of this controversy, Sober and Wilson offer a detailed case study of scientific change as well as an indisputable argument for group selection as a legitimate theory in evolutionary biology.Unto Others also takes a novel evolutionary approach in explaining the ultimate psychological motives behind unselfish human behavior. Developing a theory of the proximate mechanisms that most likely evolved to motivate adaptive helping behavior, Sober and Wilson show how people and perhaps other species evolved the capacity to care for others as a goal in itself.A truly interdisciplinary work that blends biology, philosophy, psychology, and anthropology, this book will permanently change not just our view of selfless behavior but also our understanding of many issues in evolutionary biology and the social sciences.",
  "genres": [
    "Psychology",
    "Philosophy",
    "Science",
    "Evolution",
    "Nonfiction",
    "Anthropology",
    "Biology"
  ],
  "author": "Elliott Sober",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/134244.Unto_Others"
}