{
  "title": "Dear Cary: My Life with Cary Grant",
  "description": "He was the most charming, handsome, romantic, and famous leading man in the world....what could possibly go wrong?With unparalleled honesty, Dyan Cannon shares the heartwarming and heartbreaking story of her magical romance and stormy marriage to screen legend Cary Grant.He was the ultimate star, defining Hollywood glamour as well as cinematic achievement. She was a bright new actress, beautiful and funny, who would one day prove her talent by being the first woman to receive Academy Award nominations for her work on-screen and behind the camera.When he asked to meet Dyan, she assumed it was for an acting part, but he had a different role in mind for her...and so began a storybook romance that brought her to dizzying heights. On his arm, she found herself traveling in the inner circles of power and glamour in which Cary Grant was king, with friends such as NoËl Coward, Jimmy Stewart, Frank Sinatra, Audrey Hepburn, and so many others considered Hollywood royalty.Behind closed doors, she discovered a Cary no one knew. A thoughtful, caring, and private person, with dark family secrets that weighed heavily on him. He was a man contending with the swan song of an astonishing film career while her career was just beginning. Despite the age difference, they fell in love, got married, and had a beautiful daughter together. Happily Ever After still proved elusive, and their relationship was beset with tragic twists and turns. It took a tremendous toll on Dyan as she struggled to keep her heart and mind intact.With rare photos and never-before-seen letters and notes from Cary Grant, Dear Cary is told with poignancy and hard-won wisdom. For anyone who has ever loved and lost, Dyan Cannon’s memoir is an exploration of what love means, and an inspirational story of surviving life’s slings and arrows.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Memoir",
    "Autobiography",
    "Biography Memoir",
    "Audiobook",
    "Film"
  ],
  "author": "Dyan Cannon",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/13425453-dear-cary"
}