{
  "title": "Mark of the Loon",
  "description": "What happens when a workaholic serial remodeler falls in love with an old stone cottage built by an ornithologist and his eccentric Irish wife? If you’re Madison Boone, you kick your budding romance with handsome Psych Professor Coleman Welles to the curb and lose yourself in a new project.Madison is a skilled property “flipper” who renovates distressed homes in addition to her busy real estate sales career. She struggles with the inability to put down roots years after the sudden death of her beloved parents. Madison and her three wise, hilarious friends all wonder if she uses her busy, work-centric lifestyle as an excuse to avoid connection with anyone but them.When Madison checks out a probate sale outside Healdsburg, California, she falls in love with the European-style house on a private tract of land overlooking Lake Sonoma. In fact, she likes the place so much she climbs in the window for a private tour. With help from lawyer and friend Genevieve Delacourt, Madison soon learns that the estate’s corrupt attorney has manipulated the sale and is attempting to steer the purchase to an anonymous client in a deceitful plan for personal gain.Good fortune enables her to purchase the Blackburne’s property, but far more than a new home and lush gardens await discovery during this renovation. As Madison works on the remodel, she’s drawn into an old love story with dangerous consequences. In the process, she discovers herself as she unearths buried secrets. The series of events both endanger Madison and lead her to love – and a permanent home. Mark of the Loon is the skillful combination of history, mystery, and romance in a novel that explores deep friendship, choices, and how individuals cope with loss.",
  "genres": [
    "Mystery",
    "Fiction",
    "Romance",
    "Amazon",
    "Mystery Thriller",
    "Chick Lit",
    "Contemporary"
  ],
  "author": "Molly  Greene",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/13425780-mark-of-the-loon"
}