{
  "title": "It Worked for Me: In Life and Leadership",
  "description": "New York Times Bestselling AuthorColin Powell, one of America’s most admired public figures, reveals the unique lessons that shaped his life and careerIt Worked for Me is a collection of lessons and personal anecdotes that shaped four star-general and former Secretary of State Colin Powell’s legendary career in public service. At its heart are Powell’s “Thirteen Rules,”—notes he accumulated on his desk that served as the basis for the leadership presentations he delivered throughout the world.Powell’s short-but-sweet rules such as “Get mad, then get over it” and “Share credit,” are illuminated by revealing personal stories that introduce and expand on his principles for effective leadership: conviction, hard work, and above all, respect for others. In work and life, Powell writes, “It is the human gesture that counts.”A compelling storyteller, Powell shares parables both humorous and solemn that offer wise advice on succeeding in the workplace and beyond. “Trust your people,” he councils as he delegates presidential briefing responsibilities to two junior aides. “Do your best--someone is watching,” he advises those just starting out, recalling his own teenage summer job shipping cases of soda. Powell combines the insight he gained serving in the top ranks of the military and in four presidential administrations, as well as the lessons learned from his hardscrabble upbringing in the Bronx and his training in the ROTC. The result is a powerful portrait of a leader who was reflective, self-effacing, and grateful for the contributions of every employee, no matter how junior.Powell’s writing--straightforward, accessible, and often very funny--will inspire, move, and surprise readers. Thoughtful and revealing, his book is a brilliant and original blueprint for leadership.",
  "genres": [
    "Leadership",
    "Biography",
    "Nonfiction",
    "Memoir",
    "Military Fiction",
    "History",
    "Audiobook"
  ],
  "author": "Colin Powell",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/13425638-it-worked-for-me"
}