{
  "title": "The Christmas Kalends of Provence and Some Other Provençal Festivals",
  "description": "Check out ngims Publishing's other illustrated literary classics. The vast majority of our books have original illustrations, free audiobook download, and navigable Table of Contents. Browse our library collection by typing in ngims or ngims plus the title you're looking for, e.g. ngims Gulliver's Travels.Finding literary works with illustrations, such as this book, on the web is hard to find. Much more a book that is beautifully formatted placed with amazing illustrations like this for a very affordable price. The book’s price, which is very nominal, covers the time and effort that has been taken out to put everything together and formatted the materials for your convenience.It is for your interest why this book has been made in one easy, readable and the most convenient possible place for you. Most of the e-books available online are not made for an average reader or even for readers who want the simplest book possible for easy reading. This e-book is of good quality for a very affordable price. Thomas Allibone Janvier was an American story-writer and historian, born in Philadelphia of Provencal descent. His father was Philadelphia businessman and poet Francis De Haes Janvier. He received a public school education, then worked in Philadelphia for newspapers from 1870-81. He had published the Ivory Black Stories, tales of artist life, which were reprinted in book form in 1885 as Color Studies. In them he pictured the life and color of what was then considered the Latin quarter of the city, with the old-fashioned French restaurants, the artist colony to the north, and the studios in Tenth Street where Abbey, Millet, F. Hopkinson Smith, Laffan and others made the Tile Club famous. He published many stories and articles in Harper's Magazine. He and his wife also lived for three years in Avignon, Provence, France, where they became friends with Mistral and Felix Gras. Mrs. Janvier's translations of the latter's work introduced him to English-speaking readers. His books from this period include An Embassy to Provence, Christmas Kalends of Provence and The South of France. He was made an honorary member of the Felibrige society in France, and of the Fol Lore Society of London, where he and his wife lived from 1897 to 1900, and the Century Club in New York.FEATURES: • Includes beautiful artworks and illustrations  • Active Table of Contents for an easy navigation within the book • Saves space and don’t have to carry a hard copy around • Offers an easy access and convenience to this classic literary masterpiece for a reasonable price • Gives a lasting entertainment and values for readers of all ages",
  "genres": [],
  "author": "Thomas A. Janvier",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/10380766-the-christmas-kalends-of-provence-and-some-other-proven-al-festivals"
}