{
  "title": "My Extraordinary Ordinary Life",
  "description": "In her delightful and moving memoir, Sissy Spacek writes about her idyllic, barefoot childhood in a small East Texas town, with the clarity and wisdom that comes from never losing sight of her roots. Descended from industrious Czech immigrants and threadbare southern gentility, she grew up a tomboy, tagging along with two older brothers and absorbing grace and grit from her remarkable parents, who taught her that she could do anything. She also learned fearlessness in the wake of a family tragedy, the grief propelling her \"like rocket fuel\" to follow her dreams of becoming a performer.With a keen sense of humor and a big-hearted voice, she describes how she arrived in New York City one star-struck summer as a seventeen-year-old carrying a suitcase and two guitars; and how she built a career that has spanned four decades with films such as Carrie , Coal Miner's Daughter , 3 Women , and The Help . She details working with some of the great directors of our time, including Terrence Malick, Robert Altman, David Lynch, and Brian De Palma-who thought of her as a no-talent set decorator until he cast her as the lead in Carrie. She also reveals why, at the height of her fame, she and her family moved away from Los Angeles to a farm in rural Virginia.Whether she's describing the terrors and joys of raising two talented, independent daughters, taking readers behind the scenes on Oscar night, or meditating on the thrill of watching a pair of otters frolicking in her pond, Sissy Spacek's memoir is poignant and laugh-out-loud funny, plainspoken and utterly honest. My Extraordinary Ordinary Life is about what matters the exquisite worth of ordinary things, the simple pleasures of home and family, and the honest job of being right with the world. \"If I get hit by a truck tomorrow,\" she writes, \"I want to know I've returned my neighbor's cake pan.\"",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "Autobiography",
    "Biography Memoir",
    "History",
    "Film"
  ],
  "author": "Sissy Spacek",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/13426294-my-extraordinary-ordinary-life"
}