{
  "title": "The Wanderer",
  "description": "When Alain-Fournier was killed in battle on the Meuse in 1914, he left behind Le Grand Meaulnes, a novel of wistful enchantment. The tale is recounted by François Seurel, whose father heads the village school where Augustin Meaulnes comes to board. A tall, somber youth of 17, he instantly becomes the class ringleader, and is soon known as le grand Meaulnes. When the youth sets off on an impetuous errand of a few hours and doesn't return for several days, events take a darker turn.After Meaulnes's reappearance, Seurel notices his companion's unrest, and tries to uncover its source. He wakes in the midwinter nights to find Meaulnes pacing the room \"like someone rummaging about in his memory, sorting out scraps.\" Meaulnes remains disconsolate, but finally reveals the nature of his travels, and the strange days of revelry at his unintended destination--the \"lost domain\" to which he is desperate to return and doesn't know how to find. Seurel rightly guesses that Meaulnes met a young woman there, and that he is in love. \"Often afterwards, when he had gone to sleep after trying desperately to recapture that beautiful image, he saw in his dreams a procession of young women who resembled her ... but not one of them was this tall slender girl.\" The two friends set about retracing Meaulnes's path, and their journeys take them into manhood, when Meaulnes finds at last a way to bring his quest full circle.Alain-Fournier pairs his tightly twisting plot with a poignant nostalgia. His descriptive powers bring to the reader the sights and sounds--the icy winter winds and rattling carriage wheels--from an earlier time, all the while weaving a brilliant affirmation of loyalty and lasting friendship.",
  "genres": [
    "Classics",
    "Fiction",
    "France",
    "French Literature",
    "Literature",
    "Romance",
    "20th Century"
  ],
  "author": "Alain-Fournier",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/13426369-the-wanderer"
}