{
  "title": "Cellblock Visions",
  "description": "Almost everyone in prison is either making art or buying it,\" notes Phyllis Kornfeld as she uncovers the alternative artworld flourishing today in American prisons. Her book, Cellblock Visions , not only presents some of the most inventive and gripping examples of outsider art, but also offers an unprecedented account of prison art in particular as a subject worthy of serious consideration. Having worked for many years as an art facilitator in jails and penitentiaries, Kornfeld is in a unique position to explain how art emerges in the most restrictive of environments and what gives inmate art its distinctive character. From painting to toilet-paper sculpture, the works of prisoners range from awkward attempts to amazing displays of virtuosity. In this book, Kornfeld presents the artists whose works offer freshness and surprise and tells the moving stories behind them.Filled with quotes from men and women prisoners and with Kornfeld's own anecdotes, Cellblock Visions shows how these artists, most of them having no previous training, turn to their work for a sense of self-worth, an opportunity to vent rage, or a way to find peace. We see how the artists deal with the cramped space, limited light, and narrow vistas of their prison studios, and how the security bans on many art supplies lead them to ingenious resourcefulness, as in extracting color from shampoo and weaving with cigarette wrappers. Kornfeld covers the traditional prison arts, such as soap carving and tattoo, and devotes a major section to painting, where we see miniatures depicting themes of alienation and escape, idyllic landscapes framed by bars, portraits of women living in a fantasy world, large canvasses filled with erotic and religious symbolism and violent action. The brief, vivid biographies of each artist portray that individual's experience of crime, prison, and art itself.There is a growing movement to bring the best of prison art to the public's attention for the dynamic immediacy of its form and for the power of its messages. This book is a contribution to that movement and a tribute to the humanity of the artists.",
  "genres": [
    "Art"
  ],
  "author": "Phyllis Kornfeld",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/1342891.Cellblock_Visions"
}