{
  "title": "Borderlands / La Frontera: The New Mestiza",
  "description": "Rooted in Gloria Anzaldúa's experience as a Chicana, a lesbian, an activist, and a writer, the essays and poems in this volume profoundly challenged, and continue to challenge, how we think about identity. Borderlands / La Frontera remaps our understanding of what a \"border\" is, presenting it not as a simple divide between here and there, us and them, but as a psychic, social, and cultural terrain that we inhabit, and that inhabits all of us. This twenty-fifth anniversary edition features a new introduction by scholars Norma Cantú (University of Texas at San Antonio) and Aída Hurtado (University of California at Santa Cruz) as well as a revised critical bibliography. Gloria Anzaldúa was a Chicana-tejana-lesbian-feminist poet, theorist, and fiction writer from south Texas. She was the editor of the critical anthology Making Face/Making Soul: Haciendo Caras (Aunt Lute Books, 1990), co-editor of This Bridge Called My Back: Writings by Radical Women of Color , and winner of the Before Columbus Foundation American Book Award. She taught creative writing, Chicano studies, and feminist studies at University of Texas, San Francisco State University, Vermont College of Norwich University, and University of California Santa Cruz. Anzaldúa passed away in 2004 and was honored around the world for shedding visionary light on the Chicana experience by receiving the National Association for Chicano Studies Scholar Award in 2005. Gloria was also posthumously awarded her doctoral degree in literature from the University of California, Santa Cruz. A number of scholarships and book awards, including the Anzaldúa Scholar Activist Award and the Gloria E. Anzaldúa Award for Independent Scholars, are awarded in her name every year.",
  "genres": [
    "Poetry",
    "Nonfiction",
    "Feminism",
    "Theory",
    "Queer",
    "Race",
    "Memoir"
  ],
  "author": "Gloria E. Anzaldúa",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/13427917-borderlands-la-frontera"
}