{
  "title": "The Grief of Others",
  "description": "Is keeping a secret from a spouse always an act of infidelity? And what cost does such a secret exact on a family?The Ryries have suffered a loss: the death of a baby just fifty-seven hours after his birth. Without words to express their grief, the parents, John and Ricky, try to return to their previous lives. Struggling to regain a semblance of normalcy for themselves and for their two older children, they find themselves pretending not only that little has changed, but that their marriage, their family, have always been intact. Yet in the aftermath of the baby's death, long-suppressed uncertainties about their relationship come roiling to the surface. A dreadful secret emerges with reverberations that reach far into their past and threaten their future.The couple's children, ten-year-old Biscuit and thirteen-year-old Paul, responding to the unnamed tensions around them, begin to act out in exquisitely - perhaps courageously - idiosyncratic ways. But as the four family members scatter into private, isolating grief, an unexpected visitor arrives, and they all find themselves growing more alert to the sadness and burdens of others - to the grief that is part of every human life but that also carries within it the power to draw us together.Moving, psychologically acute and gorgeously written,The Grief of Others asks how we balance personal autonomy with the intimacy of relationships, how we balance private decisions with the obligations of belonging to a family, and how we take measure of our own sorrows in a world rife with suffering. This novel shows how one family, by finally allowing itself to experience the shared quality of grief, is able to rekindle tenderness and hope.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Grief",
    "Audiobook",
    "Family",
    "Literary Fiction",
    "Adult Fiction"
  ],
  "author": "Leah Hager Cohen",
  "average_rating": "3.34",
  "url": "https://www.goodreads.com/book/show/13429323-the-grief-of-others"
}