{
  "title": "Executive Severance",
  "description": "According to Wikipedia, the Twitter network began in 2006 and as of this writing in 2010 is approaching 200 million users worldwide. By 2009 I realized Twitter was a happening thing and if I didn't jump on the bandwagon I'd be left behind with my ocarina and tambourine. But how to proceed? I had dabbled in Facebook and MySpace, but this Twitter thing was different. Limited to 140 characters (or less), with no photos, videos or extended links, Twitter conveyed the brief, the inconsequential, the trivial. In other words, the Twitter medium was a perfect vehicle for my literary aspirations.I conceived a literary experiment: Was it possible to maintain a narrative structure and attract a reading public 140 characters at a time? After 15 months and the more than 800 tweets that make up this Twitter novel, I can say confidently that the answer is \"no.\"I adopted the detective genre as the driver for my story because the brevity enforced by the Twitter medium of necessity requires that much be left out of the narrative. In Understanding Media, Marshall McLuhan said:\"Likewise, in reading the detective story the reader participates as co-author simply because so much has been left out of the narrative.\"Twitter as a medium forces the reader to fill in many of the blanks, so the detective genre mirrors the biases of the Twitter medium. Would my hero solve the crime? Would he undergo physical and mental trials? Would he get the girl? Would he spawn a publishing franchise? I soon realized that Twitter forced me to adopt the serial techniques of newspaper comic page story telling. To succeed I needed to learn and adopt the narrative strategies of Al Capp (creator of L'il Abner) or Chester Gould (creator of Dick Tracy), as well as Raymond Chandler or Mickey Spillane. How did comic strip authors hold their readers' attention each day and tell a joke while moving the story forward? How did mystery writers plant clues to direct or misdirect their readers while inexorably leading to the revelatory climax?",
  "genres": [
    "Mystery"
  ],
  "author": "Robert K. Blechman",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/13431425-executive-severance"
}