{
  "title": "Love and Fatigue in America",
  "description": "Love and Fatigue in America records an Englishman’s decade-long journey through his newly adopted country in the company of a mystifying illness and a charismatic dog.    When he receives an unexpected invitation from an unfamiliar American university, he embraces it as a triumphant new beginning. Instead, on arrival, he is stricken with a persistent inability to stand up or think straight, and things quickly go wrong. Diagnosed with ME disease—chronic fatigue syndrome—he moves restlessly from state to state, woman to woman, and eccentric doctor to eccentric doctor, in a search for a love and a life suited to his new condition. The journey is simultaneously brave, absurd, and instructive.    Finding himself prostrate on beds and couches from Los Alamos to Albany, he hears the intimate stories offered by those he encounters—their histories, hurts, and hopes—and from these fragments an unsentimental map emerges of the inner life of a nation. Disability has shifted his interest in America from measuring its opportunities to taking the measure of its humanity. Forced to consider for himself the meaning of a healthy life and how best to nurture it, he incidentally delivers a report on the health of a country.    By turns insightful, comic, affecting, and profound, Roger King’s Love and Fatigue in America briskly compresses an illness, a nation, and an era through masterly blending of literary forms. In a work that defies categorization, and never loses its pace or poise, the debilitated narrator is, ironically, the most lively and fully awake figure in the book.“Remarkable. . . . [S]mart and funny. . . .[A]musing observations about everything American. . . . [T]his is not a traditional novel. . . . [T]his, as it turns out, is a brilliant perspective from which to view and write about life. . . . [G]reat reckonings unfurl in mere paragraphs.”—Jackson Newspapers.com“As the disease drives the narrator city to city, woman to woman, and doctor to doctor, it brings into relief many of America’s follies and excesses, most notably our health-care system, which King portrayed as antiquated, bureaucratic, and inhumane. After more than fifteen years, America brings the narrator ‘not aspiration realized, nor a largeness of life fitting to its open spaces, but the nascent ability to be satisfied with less.’”—The New Yorker",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Disability",
    "Contemporary",
    "Illness"
  ],
  "author": "Roger    King",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/13431491-love-and-fatigue-in-america"
}