{
  "title": "It's Your Life, Live BIG",
  "description": "The Success Journey Starts With You...In It's Your Life, LIVE BIG!, author Josh Hinds shares practical, yet simple action steps to get you started on your journey to LIVE BIG!Begin by crafting a solid foundation of what true success means to you.  From there, you will create a road map to guide you to your best accomplishments.  You will build the framework upon which to focus your actions to reach your greatest achievements.  In the lessons set forth in It's Your Life, LIVE BIG! you will Define your success, visualize your goals, and take action to move forward with confidence and persistence to create your own positive change.  \"Live your life by choice, rather than chance,\" and get started on your journey to \"LIVE BIG!\"Josh Hinds overcame Tourette's and other challenges to become a successful motivational speaker, entrepreneur, and pioneer of personal development on the internet.  From a learning disability, to a reversal of his family's fortune, Josh's journey in life was filled with one obstacle after another.  But by learning to see past the adversity and focus on a vision of what life could be, he overcame those hurdles  to enjoy success.  Josh now shares his experience with audiences in person and around the world to inspire them that they, too, can LIVE BIG! Inside the pages of this book, Josh reveals how you too can live a BIG life!\"Josh proves that with a strong enough desire, and a road map to get there, anyone can achieve their goals and realize their dreams. Fortunately, in this terrific book, he provides us with the information we need in order to do just that. As always, Josh holds nothing back; he shares it all - including the difficulties he faced and overcame along the way. From thinking the right way...to the workarounds that can help you achieve the improbable, follow Josh's sage wisdom and advice and you'll find yourself living a rich, successful life. And, you'll LIVE BIG.\"- Bob Burg Co-author of The Go-Giver and author of The Art of Persuasion\"This excellent book will help you develop the momentum you need to propel you towards a life of success and significance.\"- Dr. Nido Qubein President, High Point University Chairman, Great Harvest Bread Co.",
  "genres": [],
  "author": "Josh Hinds",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/13435409-it-s-your-life-live-big"
}