{
  "title": "Samantha Moon",
  "description": "The first four Vampire for Hire novels, plus the Christmas Moon novella and a never-before-published short storyMother, wife, private investigator ... and vampire. Six years ago, federal agent Samantha Moon was the perfect wife and soccer mom with the minivan and suburban home. Then the unthinkable happened, an attack that changed her life forever. And forever is a very long time for a vampire.Samantha’s adventures as a night-roaming vampire and private investigator in Samantha Moon include ...Vampire for Hire #1: Moon Dance: Samantha is hired by Kingsley Fulcrum to investigate the attempt on his life, a horrific scene watched on TV around the country. But Kingsley isn’t exactly what he appears to be; after all, there is a reason why he survived five shots to the head.Vampire for Hire #2: Vampire Moon: Samantha Moon hunts down a powerful crime lord and protects an innocent woman from her ruthless ex-husband—all while two very different men vie for her heart. As the stakes grow higher and her cases turn personal, Samantha Moon will do whatever it takes to protect the innocent and bring two cold-blooded killers to justice—her own brand of justice.Vampire for Hire #3: American Vampire: Samantha receives a heartbreaking call from a very unlikely source: a five-year-old girl who’s been missing for three months. Using her considerable resources—including her growing supernatural abilities—to locate the missing girl before it’s too late, Samantha also receives devastating news on the home front, forcing her to make the ultimate choice of life and death.Vampire for Hire #4: Moon Child: Samantha Moon is faced with an impossible decision that will change her life and those of the ones she loves forever—a decision that no mother should ever have to make. And through it all, Samantha finds herself in a lethal game of vampire versus vampire as a powerful and desperate enemy will stop at nothing to claim what he most desires.Christmas Moon (Vampire for Hire #4.5): With Christmas just around the corner, Samantha takes on a very strange case: A priceless family treasure has been stolen, something passed down through the generations and buried in secrets. And Samantha gets half of whatever it is ... if she can find it first.]... and the all-new Samantha Moon short story Vampire Dreams (Vampire for Hire #6.5)",
  "genres": [
    "Paranormal",
    "Vampires",
    "Fantasy",
    "Mystery",
    "Fiction",
    "Paranormal Romance",
    "Romance"
  ],
  "author": "J.R. Rain",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/13436387-samantha-moon"
}