{
  "title": "Paradise",
  "description": "They promised her that no matter what happened, they would be waiting there for her. They promised that it would only be two weeks, a short vacation, just some time to spend together and away from the daily demands of parenthood. They promised it would be just like going to sleep, and before she knew it, it would be over. These were promises they could not keep.They always told Hope that Paradise was the place they would wait--forever. Paradise was where they married long before Hope was born. It was the faith instilled, over and again before placing her in stasis. Just a short respite, a vacation to work things out Hope was too young to understand. While locked in stasis, a solar storm ravages the planet, burning the life from those exposed and bringing society to ruin. Helpless in the stasis pod, Hope absorbs an educational augmentation program, not for two weeks, but for centuries, awaiting her parents’ return.Michigan, a young hunter in a tribe of hunter-gatherers discovers Hope during a mating contest and awakens her to a world where she inhabits the body of an adult, is emotionally only seven, and the is final vessel of all humanities applied knowledge.Plagued with the unending monotone voices lecturing knowledge implanted during stasis, Hope tries to adapt to this new world, to this small tribe, themselves failing to illness, to a dwindling food supply, and the unrelenting taking of the Amabo. The Amabo were once a peaceful philanthropic tribe, caring for those survivors unable to care for themselves. Now they are brutal takers. Their culture is one of violence, of dominance, and the collecting of their needs from others. A practice, after so many generations, that has become their birthright.Hope and Michigan resolve to find Paradise, to fulfill the last promise of her parents and free themselves from a world of savage collection.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Dystopia"
  ],
  "author": "Jonathan Fore",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/13437140-paradise"
}