{
  "title": "The Wishing Rock Theory of Life: a novel with recipes",
  "description": "The Wishing Rock Theory of Life (a novel with recipes) is the second novel in the Wishing Rock series. The series begins with Letters from Wishing Rock , which was named a 2013 B.R.A.G. Medallion Honoree and given the Awesome Indies Seal of Approval . The third book in the series, The Tides of Wishing Rock , concludes this popular series filled with wit, wisdom, and recipes!“ Reading it felt like sitting comfortably by the fire, talking with my nicest and funniest friends, all of whom had uplifting and sometimes hilarious thoughts to share. ” Molly Ringle, author of What Scotland Taught Me“Ms. Stucky's novels are fantastic! A fresh approach to writing that takes readers into the lives of the characters (which are all interesting and fun). I never wanted the books to end! The concepts of happiness, joy, and love are all addressed in ways that are thought-provoking and so much fun to read. I love the fact that the characters are so real, and the story is so believable. I recommend this book to anyone, but especially someone that you think might benefit from a new way of looking at happiness in life.” – SJ, Amazon reviewer“ I wish this series would have been around when I was younger and still trying to figure out what I wanted in a relationship and in life in general.” – PLL, Amazon reviewer“Author Pam Stucky skillfully drew me into a warm circle of friends through their texts, emails, letters, and newsletters. She has created a cast of individuals having distinct quirks, senses of humor, and worldviews. Their correspondence ranges from thoughtful discussions of relationships lost or changed, to a newsy travelogue about Switzerland or Scotland, to speculation about a newly-arrived mystery woman or the whereabouts of a hidden treasure, to a hilarious description of a mud-bath, to the mundane details of everyday life.” – Judi Wildfeuer, Amazon reviewerIn Pam Stucky’s debut novel, Letters from Wishing Rock , readers fell in love with the quirky residents of Wishing Rock, Washington – an island town where everyone lives in the same building. Now the cast, the shenanigans, and the wisdom are all back in The Wishing Rock Theory of Life.Fresh off their auspicious adventure in the Dogwinkle Days parade, Ruby and Ed are suffering a few growing pains as they settle into their new relationship. Gran and Liam, on the other hand, are blissfully traveling through Switzerland, savoring the fondue, the chocolate, and the mountain life. Pregnant Pip is adapting to her new home in Scotland with husband Captain Gavin, while back at Wishing Rock, Erin is struggling with life and psychic Alexandra is faced with an incident that could change the course of her future. In an effort to cope with this development, as well as help Erin, Alexandra leads the poker gals in a campaign to step outside their comfort zones and experience new adventures. Along the way, life in Wishing Rock hits a curve when a mysterious woman shows up in town making a shocking claim.As in the first novel in the series, letters between the neighbors and their friends chronicle the twists and turns of the characters’ daily lives, and are interspersed with recipes tried and tested by the characters themselves. Buried treasures, secret pasts, and the detritus of affairs of the heart all come to light in this witty and wise novel that explores fear, forgiveness, risk, dreams, trust, and love.",
  "genres": [
    "Audiobook",
    "Fiction"
  ],
  "author": "Pam Stucky",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/13438630-the-wishing-rock-theory-of-life"
}