{
  "title": "A Maze of Murders",
  "description": "A violent past haunts Sir Walter Maltravers, the wealthy lord of Ingoldby Hall. As a commander during the War of the Roses, he fought alongside Edward IV at the bloody, fratricidal Battle of Towton. Decades earlier, and thousands of miles away, he served in the fanatical bodyguard of the last Byzantine emperor, Constantine XI Palaeologus.There, as Turkish Jannisaries breached Constantinople’s walls and set the city aflame, Sir Walter committed what may have been an unforgivable sin: instead of defending the emperor with his last drop of blood, Maltravers fled. But not before scooping up all the treasure he could carry, including the Lacrima Christi---a giant ruby said to be a holy relic of incalculable value.When the ruby disappears from Canterbury’s Franciscan monastery, Sir Walter fears the emperor’s vengeful loyalists---the Athanatoi---have tracked him to his estate. He doesn’t have much time to ponder his dilemma. Crawling on his bare knees to the shrine at the center of his enormous private hedge maze, the penitent Sir Walter encounters his axe-wielding killer. . . . Maltravers’s head turns up days later, impaled on a pole.Gossips in Canterbury whisper of the fabled Athanatoi, come to claim their bloody due from a traitor. But apothecary Kathryn Swinbrooke doesn’t think so. Her Irish fiancée, Colum Murtagh, the King’s Commissioner in Canterbury, is called in to investigate the crimes. A Renaissance woman in a Middle Age world, Swinbroke comes to believe that all is not as it seems within the cozy confines of Ingoldby Hall. She asks tough questions of the wealthy power-players who seem to hover around the murder case. And before long, the death toll mounts: a maid, a madwoman, a scribe, a retainer. . . . One thing becomes abundantly clear: if Swinbrooke and Murtagh don’t nail down the killer---or killers---soon, they’ll be next!",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Historical Mystery",
    "Medieval",
    "Fiction",
    "Crime",
    "Historical"
  ],
  "author": "Celia L. Grace",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/1344349.A_Maze_of_Murders"
}