{
  "title": "Here's to Not Catching Our Hair on Fire: An Absent-Minded Tale of Life with Giftedness and Attention Deficit - Oh Look! A Chicken!",
  "description": "Did you know that if you forget to pay a speeding ticket you WILL get arrested—in front of your kids, the neighbors—the dog—and anyone else who happens to be there? And if someone tells you to give Bob Dole a lap dance you shouldn’t listen because you WILL get in trouble?These and other nuggets of wisdom are imparted to offer those suffering from ADHD some hope in knowing that they are not alone. A hysterical romp through a life so convoluted and chaotic you know it has to be true, Stacey Turis’s debut gives a voice to the genius yet tormented souls suffering from giftedness, ADHD, or a combination of both (a condition known as twice-exceptional).Chronicling her life journey from a state of self-loathing to one of self-acceptance, the stories flow timelessly, incorporating the resulting lessons and reflections gleaned from each adventure. Including both the tragic details of a horrifically abusive time in her childhood to comic adventures such as deciding to dye her hair plum the day before an important presentation only to have it turn out purple, her life has never suffered from a dull moment. And though she often thought Karma was the reason she found herself in so many “pickles,” a friend explained that when you put yourself out in the world more than anyone else, it’s really just a matter of statistics. Lucky for Turis and the rest of us, she’s put herself out there again to allow us all to look at life through her pair of less-struggle-more-sass glasses.With over three hundred million people suffering from ADHD worldwide and experiencing many of the same debilitating symptoms, Turis’s goal is to share her experiences so others can rid themselves of the shame of hiding their behavior. A rip-roaring and bracingly honest look at a twice-exceptional life, Here’s to Not Catching Our Hair on Fire: An Absent-Minded Tale of Life with Giftedness and Attention Deficit—Oh Look! A Chicken! is a rollicking depiction of a life that seems to be constantly going off the rails.",
  "genres": [
    "Nonfiction",
    "Adhd",
    "Memoir",
    "Humor",
    "Biography",
    "Mental Health",
    "Biography Memoir"
  ],
  "author": "Stacey Turis",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/13445354-here-s-to-not-catching-our-hair-on-fire"
}