{
  "title": "تاريخ أوروبا: وبناء أسطورة الغرب",
  "description": "نبذة المؤلف : منذ سنين دراستي للقانون والاقتصاد في باريس، كنْتُ أتضايق كثيراً من النرجسية في الثقافة والعلوم الإنسانية الغربية ونظرة التعالي، بلْ والازدراء في كثير من الأحيان، بالنسبة إلى حضارات الشعوب الأخرى ومؤسساتها وعاداتها...كما بدأْتُ أشعر بمدى توغُّل الشعور بالتفوّق الغربي لدى العديد من المثقفين العرب وتبنّيهم الطروحات الفكرية والإشكاليات الغربية في النظر إلى تطوّر التاريخ الإنساني دون ممارسة النقد في الطروحات التي كانت تقدمها الثقافات الأوروبية المختلفة حول عبقريتها وتفوّقها....أطمح أن يساهم هذا المؤلَّف في التخلُّص من هيمنة المقولات والإشكاليات الأوروبية، الفلسفية والاقتصادية والسوسيولوجية المتوغلة فيها، ودخول ثقافتنا العربية في مرحلة بناء استقلال فكري يسمح بوضع نظام معرفي وقيَمي ومرجعي مستقل عن الصور النمطية المتبادَلة بين تخيُّلات الغرب حول الشرق وتخيُّلات الشرق حول الغرب؛ فتصبح ثقافتنا متجذِّرة فعلياً في الواقع العربي ومسيرته التاريخية التي هي بدورها تحتاج إلى مزيدٍ من البحث النقدي لكيْ نعي كعرب ماذا حلَّ بنا من تهميش في حياة الأمم وفي صنع الأحداث، بلْ من عدم الوجود، ابتداءً من القرن الحادي عشر.... كما أنَّ البحث المعمَّق في واقع المسيرة التاريخية الأوروبية المعقَّد، ونقد جميع أنواع الخطابات الإيديولوجية حول تاريخ أوروبا قد يساعد في توضيح التاريخ العربي المعاصر نظراً لشدة تأثير التاريخ الأوروبي فيه؛ وهذا خاصةً بالنسبة إلى الهيمنة الاستعمارية التي خضعت لها الأقطار العربية وأدوات تحديث مجتمعاتها المختلفة، المتأثِّرة باستيراد جميع أنواع العلوم الإنسانية من القارة الأوروبية...وفي هذا الكتاب أيضاً سعيٌ حثيث إلى فهم ماذا حصل بحضارات القارة الأوروبية التي أنتجت أرقى أنواع الفنون والأدب، بشكل خاص في الحيِّز الموسيقي والرسم، كما وأنتجت أبشع أنواع العنف الفتاك، سواءً في حروب القارة الداخلية أم في حروبها الخارجية. وفي هذا السياق سعيْتُ إلى فهم الآليات الذهنية الأوروبية التي أدَّت إلى معاداة السامية تجاه اليهود وإلى المجازر الشهيرة ضدهم خلال الحرب العالمية الثانية؛ ويُظْهِر سرد المعطيات الموضوعية حول تصرّف الشعوب الأوروبية تجاه الأوروبيين من الديانة اليهودية مدى المسؤولية الجماعية لأوروبا في بروز ونشر العقيدة الصهيونية، وهي قضية أساسية قلَّما تُثار في المناقشات والمجادلات حول الكيان الصهيوني وشرعيته المفقودة في الشرق العربي والإسلامي لتبيان أنَّ الشعوب العربية ليست طرفاً في آليات اضطهاد اليهود في أوروبا.وفي هذا الكتاب، بالتالي، مادة فكرية لتقوية المقاومة السياسية والمعنوية والأخلاقية ضد الشرعية الممنوحة أوروبياً للكيان الصهيوني، التي يجب أن تترافق مع المقاومة الميْدانية لإعطائها مزيداً من الدعم والتأييد والزخم.",
  "genres": [
    "History",
    "Politics"
  ],
  "author": "Georges Corm",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/13446830"
}