{
  "title": "Keeper of the Grey",
  "description": "Keeper of the Grey (20,520 words)She had waited over a century to avenge the death of Jean Baptistes. Now, another soul lay silenced and broken before her... a young man in love with another who asked nothing of life but to be accepted for who he was. The old woman would wait no longer. It was time. With a thunderous clap she brought her crippled hands together and summoned the Grey. The lavender candle flickered as an empowered breeze filled the chamber. High above the stained glass rosette of the church's ceiling, the White Terror of the Night issued a battle cry as That Which Exists Outside the Realm of Time awakened... the two Great Firmaments prepared for battle and fate itself fell powerless to its knees.And so begin The Chronicles of Abigoth:Volume 1: Keeper of the GreyVolume 2: When Vengeance HowlsVolume 3: As Snowfall Ashens (Coming Soon)Volume 4: SoulTorn Rhapsodies (Coming Soon)NOTE: The Chronicles of Abigoth is an ongoing series which may at times contain graphic violence, strong language, demons, shifters and other unworldly things--and yes, adult sexual situations. Each chronicle is self contained unless otherwise indicated. These are not short stories. Each chronicle is novella length (roughly 100-200 pages) or longer.Consider each chronicle to be its own thrill ride at a paranormal amusement park--an amusement park where romance and mayhem duck in and out of the shadows.SPECIAL BONUS MATERIAL... TRY BEFORE YOU BUY!THE DISCIPLES OF GOEDRIC TRILOGYGay Gene Rising: Part 1: (158 pages) What people are saying about The Disciples of Goedric... \"A gay Da Vinci Code that thrills and enthralls!\"\"En epic, an absolute epic...\"\"Spellbinding and terrifyingly possible\"\"Reads like a blockbuster movie\"\"If I didn't have books II and III in my posession I could have been driven clear over the brink of sanity\"\"Thank you for creating a mythology that carves out a place for us in the universe\"\"A rare look at the human condition that engages and inspires\"",
  "genres": [
    "M M Romance"
  ],
  "author": "Jeffrey Jude",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/13447494-keeper-of-the-grey"
}