{
  "title": "My Big Fake Irish Life",
  "description": "Twenty-six-year-old Linda Symcox has been chasing her lifelong dream of becoming an actress for the last five years, so when she gets a chance to read for a popular television series, she takes an extended lunch in order to make the audition. After all, it could be her lucky break. But the “quick” audition takes over two hours costing Linda her telemarketing job; and when she doesn’t book the acting gig, her agent fires her too, explaining that she just doesn’t have “it.” The elusive “it.” As much as Linda wants to hate her ex-agent for being so insensitive, he gets her thinking in a new direction. If she doesn’t have it, what if she reinvented herself and became someone who did? Someone with red hair and an Irish accent? With nothing to lose, Linda gives herself a complete makeover and re-emerges as Meghan O’Connell from Galway, Ireland—and just in time. A high-powered casting director is looking for an unknown to fill the lead role of a new television series called \"Soul Saver.\" And the actress must be Irish. Meghan gets an audition and is so convincing, she lands the role. Her life is changed forever. On the first day of filming her new television series, Meghan meets her co-star, Michael, who met her before as Linda, the American. He doesn't recognize her. Will he? Meghan decides to simply stay away from him, but how can she when they are working so closely together? Worse, how can she stay away from the guy she’s falling in love with? What had started out as an innocent little lie ends up snowballing into an insane comedy of errors. Meghan’s lie forces her to live a double life that eventually affects her family, friends, and most importantly her new boyfriend to the point that she has to decide on telling the truth and giving up her lifelong dream, or living the lie and losing the people she loves.",
  "genres": [
    "Romance",
    "Chick Lit",
    "Adult",
    "Ireland"
  ],
  "author": "Caitlin McKenna",
  "average_rating": "3.37",
  "url": "https://www.goodreads.com/book/show/13447464-my-big-fake-irish-life"
}