{
  "title": "Man by a tree",
  "description": "Put a tree on your shelf :-)\"I have to say; what a superbly originally fantastic piece of writing. It's as though someone put a rocket up Terry Pratchett's derriere and then fired him into a drunken Adams. Captivating, humorous, easy-to-read and thought provoking... And there's clearly some very deep latent messages here about us mere mortals.\" J. OwenTake a devilish romp through a world of death, where souls pay for experiences, monkeys are the hosts, and Reginald is the service provider.Reginald has been in control for millenia. With His staff of hundreds, and millions of souls passing through to experience the delights of physicality, his reign has become complacent. His servants, Satan and Lucifer, jump at the chance to take what they see as rightfully theirs.The Grim Reaper, or Graham Reader as he calls himself, has been doing his job of transporting souls ever since he can remember, to gain his wings. But he has become tainted by the actions of the monkeys living on the planet. Unbeknown to him, a plan is afoot to change the status quo of 'up above' and 'down below', where he is a linchpin to both interested parties.Visit...http://djc.yolasite.com/Stores...(print+ebook)https://www.createspace.com/3731273https://www.smashwords.com/books/view...Featured on...http://eponymous.weebly.com/sci-fi.htmlhttp://www.frednath.com/Guest-Writer....Try the Quizzes!http://www.quizazz.com/quiz.php/13783...http://www.quizazz.com/quiz.php/13829...http://www.quizazz.com/quiz.php/13680...http://www.quizazz.com/quiz.php/13469...Quotes from http://www.authonomy.com/books/39322/...\"Sharp, dark and sardonic are rarely found wrapped in a single package on this site. Your book has managed the trinity.\" Greg Levin (Notes on an Orange Burial)\"Have very much enjoyed what I've read so far...\" James Lark (More Tea, Jesus?)\"a damned good tale.\" \"Reads very well!\" Fred Nath (The Cyclist)\"...inventive and unpredictable. Nice work!\" vmorr\"Great comic writing.\" Mark Kirkbridge\"I've fallen in love...\"Bryn Hammond\"Great stuff!\" Emsbabee\"...a fantastic read\" Scott Toney\"Very funny!\" Sue50\"Original, ironic, sardonic, witty and wacky; a great read. I enjoyed this very much.\" Colin Neville\"Very inventive and unique.\" PA Davies\"...it's good fun. It made me laugh\" Candymace\"biting wit and irreverence... so many great images here\" turnerpage\"...it's great stuff. Very droll in places... blissfully so.\" Sandie Zand\"...well-written story...great word choice... different textures... voice is great... pull the reader into the story...\" Auna June\"Humourous writing, great inventive plot. All the elements of a classic (Graham Reader, indeed!). Fantastic stuff, Dani, keep it up!\" Jack Hughes\"Clever, entertaining and well-written. A winner!\" Richard Allen\"I think this could be a seller.\" Inspectorrick\"Well written and completely believable... I loved to read it.\" the dragon flies (Peter)\"solemn, descriptive and dark... liked the interspersed action between the dialogue\" MIRO1K\"This is bloody good stuff. The writing is wonderful and the narrative flows. Utterly not my usual sort of thing but I was gripped. Weird, wonderful and thick with detail - loved it.\" Shielab\"This has enormous humourous potential\" Warrick\"This is a wild story... Dramatic beginning... interesting....It's a funny, enjoyable read.\" Wanttobeawriter\"I think this could easily be picked up by a publisher or agent!\" Noelle J. Alabaster",
  "genres": [],
  "author": "Dani J. Caile",
  "average_rating": "4.78",
  "url": "https://www.goodreads.com/book/show/13448123-man-by-a-tree"
}