{
  "title": "Goading the Enforcer",
  "description": "Out of the cage: The problem with peeling away a mask is that you never know what’s underneath.Jared Templeton returned to Colin City for one reason, to make it through his sister’s wedding. After that he wanted to return to his home in Massachusetts and go back to his blessed solitude and his life as an assassin. He didn’t plan on attending a viewing for a deceased mentor, agreeing to help his shifter friend rescue a blind man, or learning that he had a shifter mate, a male shifter mate. He’d never been attracted to a man before, but he couldn’t deny that he lusted after this one. And he had no clue what to do about it, or how he could fit the wolf shifter into his life if he did give in to his desires.Carson Angeni is the enforcer for the Stone Ridge wolf pack. He’s followed his alpha’s commands and obeyed him without question, even to the point of taking lives to ensure the safety of his pack. When he’s faced with a mate who kills for money, with no remorse and no conscience, he questions Fate’s choice. How can he accept someone who seems to get his jollies by goading those around him, not to mention Jared lives halfway across the country? But as he gets to know the man, Carson learns that there is more to him than Jared’s brash exterior displays. There’s definitely a connection between them and both have trouble denying it, but Carson can’t accept Jared’s work as an assassin. And when Carson discovers that Jared knew from the beginning that he was Carson’s mate, it creates even more tension between them. Can Carson learn to trust his mate while trying to convince Jared to give up the only life and the only job he’s ever known, to settle with him in Stone Ridge?",
  "genres": [
    "M M Romance",
    "Shapeshifters",
    "Paranormal",
    "Romance",
    "Fantasy",
    "Erotica",
    "M M Paranormal"
  ],
  "author": "Charlie Richards",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/13448964-goading-the-enforcer"
}