{
  "title": "Daughter of the Dark",
  "description": "DAUGHTER OF THE DARK is the second novel in the “Shadow Through Time” fantasy trilogy. It follows the fate of Pagan of the house of Guardians. Only seventeen and barely able to control his Guardian powers, Pagan has been given the task of championing the most consequential child ever born, the newborn child of The Light – Glimmer – who will grow to become the Catalyst. Pagan is injured as he and the babe flee their brown homeworld of Ennae, arriving in the strange rainbow-hued world of Magoria (our Earth), helpless and friendless.Small town funeral direct, Sarah McGuire finds them and her home becomes their sanctuary, however Sarah’s forthright manner takes some getting used to. Pagan struggles to adapt, for he has little choice. He knows nothing of caring for a babe and already shoulders the burden of not only hiding his own healing powers in a world that is as confusing as it is contradictory, but as Glimmer grows he must also hide the frightening intelligence locked inside her child’s body.On Ennae, the world they have fled, the fearful firegod of Haddash, Kraal, has made a pact with The Dark, Glimmers evil father. In return for a magical talisman now held by the Plainsmen, Kraal will give The Dark sovereignty over Ennae, yet little does he know that The Dark’s ambitions now lean towards power over all four worlds. There is no place in either of their plans for Glimmer to live.On the airworld of Atheyre, The Light and her lover Talis watch on helplessly, unable to protect Pagan or Glimmer from the evil that conspires against them, and behind all is the inexorable Maelstrom, growing in strength and momentum. Before it destroys the four elemental worlds, Glimmer must return to Ennae and face those who would have her dead. Only one thing can distract her from fulfilling her destiny, yet that one thing is exactly what she needs to bring peace to the four worlds.",
  "genres": [
    "Fantasy"
  ],
  "author": "Louise Cusack",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/13449094-daughter-of-the-dark"
}