{
  "title": "The Anathema",
  "description": "It sounds like a Spring Break out of a dream – a lush island, perfect beaches, and the company of a beautiful girl. But for Alex Warner, things are never that simple. After all, his host for spring break is no other than the tyrannical future head of the Black Sun, Anastasia Martynova. And while Emily Muir is indeed beguiling, she could end up costing him both his freedom and his budding relationship with the Changeling, Eerie.  From the depths of the Ether, The Anathema, exiled from Central for a half a century, put an elaborate plan in motion to return to Central by force, stalking the depleted Auditors with a combined force of heretic Operators, Weir and Witches. During their long stay in the Outer Dark, The Anathema have developed a host of terrible new protocols and abilities that Central is completely unprepared for. Even worse, the Auditors face a betrayal from one of their own that will rock the very foundations of the Academy.  Meanwhile, Alex is reluctantly forced to make a number of choices, knowing that whatever he leaves behind will come back to haunt him. No longer able to cling to his apathetic neutrality, Alex must choose sides in both love and war, and quickly, before the decision is made for him.  It will take the mustered forces of the Auditors, the Black Sun, the Hegemony, the student body, and even poor Alex Warner, to contend with the violent return of The Anathema. And by the time the dust has settled, the conflict will have lasting – even fatal – consequences for the staff and students of the Academy.  The Anathema is the second volume of The Central Series.  NOTE: New version published 11-4-2013 – Includes professional edit and proofing!",
  "genres": [
    "Urban Fantasy",
    "Fantasy",
    "Young Adult",
    "Supernatural",
    "Science Fiction",
    "Magic",
    "Vampires"
  ],
  "author": "Zachary Rawlins",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/13449207-the-anathema"
}