{
  "title": "Persephone, Queen of the Dead",
  "description": "This is not the myth that has been passed down through the ages where the Greek God Hades abducts and rapes his niece Kore, the daughter of his sister, the Goddess Demeter; dragging her down to the Underworld to be his consort, thus changing her from the maiden Kore to Persephone, the Goddess of the Underworld. Persephone: Queen of the Dead tells the story of a young Goddess who falls in love and marries a God that she knows her mother does not approve of. It is the story of her life and what she had to sacrifice to be with the only man she loved. This story is told not only through the Goddess' own words, but also her mother, the Goddess Demeter's, for the lives of the two are entwined for eternity. The story begins with Kore as a young maiden, who happens to behold the God Hades as he emerges from the Underworld and falls instantly in love. Part 1 switches between Kore as she tells of her first love and her mother, Demeter as she expresses the betrayal of not only her daughter, but of the other gods as well. It is this betrayal that causes Demeter to withhold her Fertility from the world until most mortal life dies. A compromise is made and Kore, whose new name is Persephone, is forced to leave her husband for one-half of the year to be with her mother. During this time, Demeter allows the vegetation to once again sprout, but when Persephone returns to the Underworld the Goddess of Fertility once again withholds her gifts. Thus the seasons have been created. Continuing on the story explains the role Persephone assumes as Queen of the Dead, and tells several tales of mortals who risked everything by entering into the Underworld. Orpheus travels for weeks to beg the Goddess of Death to return his wife Eurydice to life; the Lapth prince Pirithous, with the help of his companion Theseus, tries to kidnap Persephone and make her his bride, for their foolishness they are turned into statues; four years later when the hero Hercules enters the Underworld as one of his Twelve Labors he is able to free his cousin Theseus Other tales within the story include that of Psyche and Eros, followed by Adonis who was raised by Persephone, and finally the story of how the new God Dionysus was created. The last part explains how with the beginning of Christianity the Old Gods were demoted into demons and without the daily offerings they became accustomed to, they began to fade. Only the strongest of the gods survived during this period. With the beginning of the new century hope was returned as the Old Religions were beginning to be revived.",
  "genres": [],
  "author": "Isadora Marie",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/13449147-persephone-queen-of-the-dead"
}