{
  "title": "De Dwerg",
  "description": "6h 58min«Nessuno è grande di fronte al proprio nano.»Scritto negli anni della Seconda guerra mondiale e ambientato in una corte rinascimentale italiana, Il nano è forse l’opera in cui più esplicitamente Lagerkvist si interroga sul la guerra, la peste, gli avvelenamenti e i tradimenti narrati sono evidenti proiezioni delle tragedie di cui è testimone. Ma è soprattutto con l’inquietante figura del nano di corte che l’interrogativo si spinge fino in fondo, in un tentativo, amaramente attuale, di capire perché periodicamente nella storia l’odio, l’indifferenza ai massacri, il trionfalismo bellico arrivino a prevalere su quei valori che rendono l’uomo umano. Il nano, che regge le fila dell’azione e attraverso il cui sguardo distorto veniamo a conoscenza di fatti e personaggi, incarna questa aberrazione, l’essere amputato della sua umanità fisica e spirituale che ubbidisce solo alla logica del potere. Disprezzando la corporeità in ogni sua manifestazione, dal cibo al desiderio, all’attaccamento alla vita, è nauseato dalla povertà, dalla malattia, dalla sporcizia dei profughi; privo di trascendenza, è cieco alla nostalgia dell’infinito, al dubbio e alle contraddizioni, alla gioia, all’arte e all’amore, scambiando per superiorità la propria limitatezza e per lucidità la propria mediocrità. Ma il nano non è che quella creatura «dal volto di scimmia che talvolta leva la testa, affiorando dai bassifondi dell’anima», è il «sosia» del principe guardato con un cannocchiale capovolto. Sterili, i nani sono generati dagli uomini, «appartengono alla razza umana e non vi appartengono, ospiti di passaggio, in una visita che dura da migliaia di anni». 2018 Storyside (Audiolibro): 9789178178650",
  "genres": [
    "Fiction",
    "Classics",
    "Historical Fiction",
    "Swedish Literature",
    "Nobel Prize",
    "Sweden",
    "Literature"
  ],
  "author": "Pär Lagerkvist",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/13449612-de-dwerg"
}