{
  "title": "The Author: Part 1",
  "description": "Carefully wending his way up the Eastern seaboard, Malcolm Columba is not your garden variety serial killer. When two dissimilar murders occur on Long Island, preceding another in Old Town, Maine, two seasoned Suffolk County homicide detectives note certain similarities that carry the killer’s signature. The investigation leads authorities to believe that they have an eco-terrorist on their hands, punishing those deemed responsible for environmental pollution, claiming the lives of their loved ones in retaliation.\tBut a more compelling mystery surrounds the antagonist as factions within federal, state, and local governments look the other way in the interest of national security; namely, certain members of the Justice Department, the FBI, key Albany bureaucrats, as well as corrupt police officials. Additionally, a Mafia don and his crew work the parameters.\tThe penultimate hour reveals that Malcolm Columba, serial killer extraordinaire, is the “Father of the Federation,” that is, author and architect of an operation that safely places agents of the Bureau within the ranks of extremist groups around the globe, made possible via a wealthy industrialist’s powerful connections. By murdering the magnate—Columba’s quintessential target—the psychopath has suddenly become expendable; however, it takes an unlikely vigilante with a vengeance to find the madman in a race to the finish.\tCharged with Columba’s murder, in addition to others for which he is being framed, Justin Barnes, a protagonist with a single-minded purpose, eventually seeks out (with help from the maverick’s scintillating associate, Jacqueline Rubino, along with a handful of Suffolk County’s rogue detectives) and ultimately destroys a relentless sinister force hellbent on securing an encoded document that promises to imperil the hegemony of a nation: ours.Editor’s note: The Author is the second in a series of four novels portraying Justin Barnes; it is the prequel to The Teacher, first published in May, 2006.",
  "genres": [],
  "author": "Robert Banfelder",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/13449909-the-author"
}