{
  "title": "Knots  ~ a Justin Barnes Novel",
  "description": "Down-and-out insurance salesman, Kalvin Matheson, enamored with two notorious serial killers, strives to surpass their deeds. Justin Barnes, Suffolk County Long Island Homicide’s covert operative, is called in to untangle the web of clues left by this extraordinary murderer. An atypical ending will floor the reader.\tJustin Barnes is back to solve yet another series of vicious murders in which the victims are tied with intricate knots.\tKalvin Matheson is enamored by the deadly acts of Malcolm Columba and Clarence Emery—his two dearly departed serial killer “pals” killed by Justin—and embarks on a single-minded mission to follow in his heroes’ footsteps and surpass their diabolical acts. It is Matheson’s intent to be cloned along with his identical dead twin brother, Alvin, via the advancements in groundbreaking technology immixed dubious promises made by both Reality and Clonite, two connected institutions.\tWhereas the Reality Movement borders on the lunatic fringe, Clonite is a well-respected company, immersed in mainstream science. Now that Clonite has supposedly cloned the first human being, Reality is taking on a new dimension—one of unparalleled proportion. Police authorities have every reason to believe that both Malcolm Columba and Clarence Emery were deeply involved with the two groups, giving homicide detectives a possible lead to their serial killer’s identity. However, Reality’s member list is kept as secret as Clonite’s laboratories and client list. \tNow that Clonite is on the brink of success, the one-time, up-front fee is one million dollars for the promise of “everlasting life,” though one must patiently wait for technology to become available and the procedure perfected. However, the pot is proverbially sweetened for Matheson by Bishop John of the Reality church. The bishop offers Kalvin two clones for the price of one. Consequently, bodies suddenly expire like a two-for-one-sale—involving insurance schemes perpetrated by out-of-work Matheson in an attempt to raise one million dollars. Justin Barnes, along with Team Three detectives, must locate and surreptitiously weed through both organizations’ lists in the hope of discovering the killer.\tAs Kalvin murders for money and, just as importantly, the thrill, Justin Barnes and the Team Three homicide squad follow clues that lead them down a primrose path to the penultimate hour they arrest their prime suspect.",
  "genres": [],
  "author": "Robert Banfelder",
  "average_rating": "4.71",
  "url": "https://www.goodreads.com/book/show/13450037-knots-a-justin-barnes-novel"
}