{
  "title": "The Battle for New York",
  "description": "At exactly midnight on December 31, 2012, every electronic device made in China for the last 30 years stops working.From the U.S. electrical grid and all its back-ups, engine control-management systems, early warning systems on U.S. satellites, every motor vehicle, aircraft and ship made after 1985, to even simple memory chips inside children’s teddy bears—every electronic fuse, resistor, or connector that was “Made in China” becomes dormant…forever.Simple impulse-directional chips, electrodes, monitor screens, power switches, fuses, bulbs, verbal and visual components, electronic on/off-switches, emergency override switches, communication chips, information-saving boards, and most important emergency burn-out protectors stop operating and performing their micro-important chores.At one minute past midnight on January 1st, 2013, every modern television broadcast of the U.S. New Year’s Eve festivities on the East Coast black-out. Millions of motor vehicles with an engine management system or engine-computerized system suddenly die, causing loss of control and thousands of accidents only seconds into the New Year. Traffic lights, directional beacons, communication stations, and all aircraft landing systems black out a couple of minutes later, as their modern back-ups start failing.Children’s Christmas presents, nearly forgotten, stop buzzing, moving, and blinking and go silent. Radios, computers, and all forms of electronic communication devices—even the latest 132 million electronic Christmas presents given only a week earlier (iPhone 5Gs, IPod Nano 4s, IMac Notepads and iPad 3s) go silent, never to blink on again. Ninety seconds after midnight, the entire electrical grid of North America deactivates itself and goes into close-down mode.Within five minutes into a cold New Year’s Day, newly lit candles are the only light and heat available in every northern metropolis in the country.The shutdown of the United States of America, and 97% of the entire world, is accomplished by 12:30 am U.S. Eastern time on the first day of the New Year in 2013.It takes only 30 minutes to completely dismantle the whole of modern Western civilization as we know it.",
  "genres": [
    "Science Fiction",
    "War"
  ],
  "author": "T.I. Wade",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/13450915-the-battle-for-new-york"
}