{
  "title": "Against Them: How & Why Alexander Haig, Bob Woodward, Donald Rumsfeld, & Richard Cheney Covered Up the JFK Assassination in the Wake of the Watergate Break-In",
  "description": "In 1974, Bob Woodward and Carl Bernstein published All the President's Men, the real-life whodunit that introduced Deep Throat to the American people. A White House insider turned confidential informant, Deep Throat had provided the young Washington Post reporters with enough insider information about the Watergate break-in to force President Richard Nixon from the Oval Office. As a condition of receiving the information, they promised not to reveal Deep Throat's identity until after his death. In the summer of 1999, Bob Woodward dropped in on a retired FBI official named Mark Felt at his home in Santa Rosa, California. During that visit, Woodward convinced Felt to assume the role of Deep Throat. Mired by health issues, the elderly Felt made his belated Deep Throat debut in the spring of 2005, telling the world, \"I'm the guy they used to call Deep Throat.\" By any cursory examination of the facts, Mark Felt was not Deep Throat. Felt had been a straight-laced FBI man, hopelessly loyal to J. Edgar Hoover's \"Seat of Government.” Deep Throat had been a chain-smoking Scotch drinker, supposedly disillusioned by the trappings of Washington politics. In Against Them, Tegan Mathis reveals, for the first time anywhere, that Deep Throat was actually a hard-partying White House aide named Richard Bruce Cheney. When Bob Woodward asked Mark Felt to assume the role of Deep Throat, he only did so to provide cover for the next vice president of the United States of America. A few loose ends had to be tied down before the 2000 presidential election, so Bob made the extraordinary trip to Santa Rosa to cut a deal. But that's just the beginning of the story. The author goes on to explain, through a meticulous examination of rather bizarre new evidence, how and why Alexander Haig, Bob Woodward, Donald Rumsfeld, and Richard Cheney used their bogus Deep Throat story to cover up the John F. Kennedy assassination in the wake of the Watergate break-in. This is the book Americans have been waiting for since November 22, 1963.",
  "genres": [
    "Politics"
  ],
  "author": "Tegan Mathis",
  "average_rating": "3.21",
  "url": "https://www.goodreads.com/book/show/13450846-against-them"
}