{
  "title": "Magic In The Storm",
  "description": "From the winner of the Golden Leaf Award for Best Regency, a Regency romance with a twist of magic. Adriana Hayden paints with a tumultuous passion that her guardian considers unseemly in a proper Regency miss. But when she meets the most handsome, fascinating man she’s ever encountered, the emotions she had only expressed through her art spill over into real life. And when he then unexpectedly joins her in London at the height of the season, puts her life in danger and starts telling her fantastical stories of magical people, she doesn’t know what to think. But she does know that she wants to do everything she can to help him. Morgan Valentine should have been the most powerful Vallen in England. Instead, he was thrown out of the family’s house when he was a teenager and imprisoned in the forest on their estate. Determined to hone magical powers that should be his, he is only able to shatter his bonds when a beautiful woman appears – to steal his heart and to give him the strength to escape to London. From a deep forest of magic to the glittering ballrooms of Regency society, will Morgan and Adriana be able to join forces and attain their deepest desires… before time runs out? \"…A character-driven romance with a good dose of magic and adventure thrown into the mix …[with] a genuinely involving romance between two charismatic characters. Magic in the Storm is highly recommended for its inventive plot, strong characterization and excellent writing style. … If you’re a fan of paranormal or historical romances, Magic in the Storm is definitely worth checking out; and if you’re not a fan of these genres, it might be worth giving the book a try anyway. It might just convert you…\" David Wendt, IndieBookSpot.com \"This book should be put on people's to be read list. It's a fantastic paranormal read and if you aren’t fan of historical, ignore it for this book please. It was pleasure to read this book, it's a true paranormal romance book... this book is perfect example of what a paranormal romance should [be].\" Booked Up Please note that while the first two books in the Storm Series are \"sweet\", this book is has some adult content. The Storm  STORM ON THE HORIZON (free everywhere) BRIDGING THE STORM MAGIC IN THE STORM THROUGH THE STORM",
  "genres": [
    "Paranormal Romance",
    "Paranormal",
    "Romance",
    "Historical",
    "Fantasy",
    "Historical Romance",
    "Historical Fiction"
  ],
  "author": "Meredith Bond",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/13450991-magic-in-the-storm"
}