{
  "title": "Secret Admirer",
  "description": "Secret Admirer (#10 of the Sensual Erotica Series)A sensual \"quickie\" about a sensuous night spent with a mysterious lover. - (Approx. 5150 words) Perfect for mobile eReaders - have access to a quickie whenever you need a fix.Amy wants to avoid emotional baggage by seeking a passionate night with an anonymous lover. The hotel guarantees hot sex with a mysterious stranger and Amy isn't disappointed. Her secret lover instinctively knows how to please her. Once the night is over, Amy is shocked to discover her mystery man not only knows her, but has wanted her for some time. When her ex finds out, sparks start to fly!Amy loves to be loved and decides an anonymous partner is just what she needs. She goes to a hotel, puts on a blindfold, and waits for her mystery lover. Amy enjoys an amazing night of sex with an experienced man. But she is horrified to learn that her partner is actually her ex's best friend. When Brad calls to confront her, Amy can't believe it. The experience convinces her of one thing; she needs Troy back in her life. Unfortunately, Amy is in for a little surprise.Excerpt from Secret Admirer:She pulled out a delicate mask. It reminded her of a Mardi Gras mask, except there were no holes for eyes. So this pretty thing is my blindfold. There were instructions included in the gold bag. She followed them, noticing one instruction in particular. \"Do not take off the mask under any circumstances. Removal will result in immediate dismissal. No exceptions.\" Amy put the bag in the closet and walked to the bed.She put the blindfold over her eyes. The fit was tight but comfortable. She would not be able to peek without taking it off. Amy lay on the luxurious bed, waiting for her partner to come. Her heartbeat echoed in her head while she waited. The anticipation was thrilling - the not knowing who would come through the door or what he would do with her. Amy wondered how the night would unfold. Would he by shy and uncertain, sexually aggressive, or sweet and romantic?All of her senses went on red alert the instant she heard the key in the lock. It opened slowly. Amy's breath increased. Then the door closed shut and there was the click as the lock slid into place. He's here.Adult Reading Material (18+) This book is for mature audiences only and contains sexually explicit content.* If you enjoy this erotic story check out the series, Sensual Erotica. The short stories are stand-alone scenarios made to excite and titillate, but all are interconnected. Enjoy the palate of sensual experiences contained in the series as Amy and Troy make their way in the world. Pick and choose the situations that arouse you, or be a little naughty and sneak a peek at the ones you've always been curious about.",
  "genres": [],
  "author": "Red Phoenix",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/13451334-secret-admirer"
}