{
  "title": "Knowing Yourself",
  "description": "Kay is entranced with the possibilities which lie before her. Five handsome, willing men are vying for her hand in marriage. The stakes are ownership of a medieval keep perched on the rocky edge of a stormy ocean. Each man seems more stunning than the last, and it is her choice which will reward the prize.To make the game even more interesting, Kay is disguised as a handmaiden to her sister, Em, so that she might more freely mingle with the suitors. In this way she can learn their strengths and catch them in their most unguarded moments.As the threat of border reivers approaches the keep, Kay finds that her pleasurable pastime takes on a far more serious overtone. Knowing who to trust and who to depend on becomes a matter of life and death! All author's proceeds from sales of the Sword of Glastonbury series benefit battered women’s shelters. Knowing Yourself is book one in the Sword of Glastonbury series. Each novel ends in a happily ever after, which then leads into the next book in the series. Each of these full-length romances features its own flavor, atmosphere, and main characters. Each is set in a different part of medieval England and showcases the natural beauty of its region. Knowing Yourself is set in Cumbria, in northwestern England. Knowing Yourself is a lighthearted tale of romance and courtship, with a pair of fun-loving sisters, in the style of a medieval bachelorette contest. It is suitable for teens and older. It does not feature any strong language nor any intimacy beyond a gentle kiss.To learn more about the widespread use of the wax tablet for note taking in medieval times, be sure to read this article:https://www.bl.uk/eblj/1994articles/p...",
  "genres": [
    "Romance",
    "Medieval",
    "Historical Romance",
    "Historical Fiction",
    "Historical",
    "Amazon",
    "Fiction"
  ],
  "author": "Lisa Shea",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/13452634-knowing-yourself"
}