{
  "title": "Wicche Hunt",
  "description": "I’m Arwyn Cassandra Corey, the Sea Wicche of Monterey. Want a psychic reading? Sure. I can do that. In the market for art? I have all your painting, photography, glass blowing, and ceramic needs covered in my newly remodeled art gallery by the sea. Need help solving a grisly cold case? Unfortunately, I can probably help with that too.After more than a decade of being nagged, guilted, and threatened, I’ve finally joined the Corey Council and am working with my mother and grandmother to hunt down a twisted sorcerer. We know who she is. Now we need to find and stop her before more are murdered.The evil the sorcerer and her demon are doing is seeping into the community. Violent crimes have been increasing and as a result Detectives Hernández and Osso have brought me another horrifying case. I’ll do what I can, because of course I will. What are a few more nightmares to a woman who barely sleeps?Declan Quinn, the wicked hot werewolf rebuilding my deck, is preparing for a dominance battle with the local Alpha. A couple of wolves have already left their pack to follow Declan, recognizing him as the true Alpha. Declan needs to watch his back as the full moon approaches. The current Alpha will do whatever it takes to hold on to power, including breaking pack law and enlisting the help of a local vampire.And if Wilbur, my selkie friend is right, I might just be meeting my dad soon. Perhaps he’ll have some advice for this wicche hunt. I’m going to need all the help I can get.Content Wicche The Sea Wicche Chronicles is a contemporary fantasy novel with suspense elements about a clairvoyant witch who, among other things, helps detectives hunt a killer. While there are light, funny, romantic moments, there are also dark ones that may be disturbing for some readers. Warning visions that include graphic or explicit violence, murder.",
  "genres": [
    "Urban Fantasy",
    "Romance",
    "Paranormal",
    "Fantasy",
    "Magic",
    "Witches",
    "Fae"
  ],
  "author": "Seana Kelly",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/134531395-wicche-hunt"
}