{
  "title": "Grind",
  "description": "Convicts round up wild mustangs, a schizophrenic homeless man wins the jackpot and disappears, a truck driver with a child's mind spends his last hours in the embrace of a prostitute's photos—disparate and vivid, Mark Maynard's characters intersect in the new wild west of Reno, Nevada. \n   \"Throughout the volume’s eight tenuously linked tales, lives and fortune are lost, and the city of Reno emerges as a locus of shattered souls. Maynard’s debut collection bursts with idiosyncratic characters... …packs a strong emotional punch...…is strangely entertaining.”—Publishers Weekly \n   \"In Grind, Maynard reveals a world the Nevada tourism board would rather you didn’t see…. A debut collection of stories that perfectly captures the seediness, desperation and sense of loss permeating the hot desert world of Reno.”—Shelf Awareness \n   \"Mark Maynard’s Reno is so sleazily appealing, so filled with convict cowboys, wild horses, racing pilots, truckers, snow bums, eco-terrorists, tattoo conventions, pawnshops and jackpots that you emerge from reading Grind dazed by this author’s empathy for neglected quarters of humanity. You feel gritty all over—and more alive.”—Carolyn Cooke, author of Daughters of the Revolution \n   \"The characters in these stories are as beautiful and broken as the desert itself. Mark Maynard explores the stony truths of lost lives with an unflinching eye for detail, an insider's sense of the place and its people, and an honest compassion. The heartbreaks here are real, as are the moments of uncommon grace and hard-won redemption.”—Kim Barnes, author of In the Kingdom of Men \n   \"Mark Maynard's Grind is chock full of men and women who are desperate with want and full of spirit. Pawnbrokers. Truckers. Casino shills. Prison inmates. They're all here, and they're all gloriously alive. This is prime American fiction—tough, generous, and open-eyed.”—Alyson Hagy, author of Boleto\n\"Grind is exactly what I like in a locally based book. Plenty of those characters who make a visit to the environs of Reno both an exciting potential and an illicit affair…. This is a Northern Nevada book.”—D. Brian Burghart, Reno News & Review",
  "genres": [
    "Fiction",
    "Short Stories"
  ],
  "author": "Mark  Maynard",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/13453072-grind"
}