{
  "title": "Stuck Rubber Baby: Mundos Diferentes",
  "description": "La obra está situada en los años en que Kennedy era presidente y las luchas por los derechos civiles eran encarnizadas. Y si además vivías en una pequeña población del Sur, donde el racismo estaba a la orden del día, la cosa se complicaba más.Es en este escenario, en esta época, donde y cuando Toland Polk aprende a ver otros mundos: el de la comunidad negra y el de los homosexuales. Y todo gracias a una chica, la única que le importa a Toland, un homosexual reprimido. A través de los ojos de Toland iremos viendo cómo era aquella época, cómo parte de la sociedad americana, lejos de ser lo liberal que venía proclamando al mundo, estaba sometiendo a todo aquel que era diferente al estereotipo del “anglosajón blanco normal”. De este modo, iremos viendo cómo a la vez que Toland va admitiendo su realidad como gay, asistirá a manifestaciones por los derechos humanos y la igualdad, a la vez que se verá inmerso en un mundo protagonizado por personas que acabarán siendo bastante buenos amigos, aunque esa forma de vida no será en absoluto del agrado de su hermana y, sobre todo su cuñado. Dentro de ese mundo de injusticias que Toland irá descubriendo, destacará la persecución homófona del los cuerpos policiales, de los políticos y de la sociedad, a través de organizaciones como el Ku Klux Klan. Además, veremos como Toland intentará luchar desesperadamente contra su condición de homosexual, intentando hacer todo lo posible por “curar” esa enfermedad y ser “normal” como casi todo el mundo. Será a lo largo de esa época de descubrimiento cuando descubrirá a Ginger, una joven con la que saldrá en su intento por normalizarse y que le influenciará notablemente.Destacar que lo curioso es que, 40 años más tarde, al igual que hicieran negros y homosexuales en los 60, ahora son los hispanos los que están reclamando su lugar en esa sociedad e intentado lograr unos derechos que le son negados.LOS PREMIOSLa lista de Premios y Nominaciones de esta obra es interminable, por ello, destacaremos únicamente los principales. Stuck Rubber Baby ganó el Premio Eisner de 1996 a la Mejor Novela Gráfica y el Premio Harvey del mismo año en la misma categoría. También ha ganado el Premio de la Crítica del Festival de Angouleme y el Premio a la Mejor Novela Gráfica en los Premios Comic Art del Reino Unido, además del Premio Luchs de Alemania. También ha estado nominada al Premio al Mejor Libro Gay de la Asociación de Libreros Americanos y al Premio Literario Lambda.En España quedó ganador de los Premios de la Crítica 2006, en la lista de los mejores de 2006 de la revista Rockdelux, etc.Álvaro Pons(Extraído de La Cárcel de Papel)“Debo reconocer que, en su día, me sorprendió mucho la lectura de Stuck Rubber Baby, de Howard Cruse. En primer lugar, por el hecho de que fuera Paradox Press la que se encargara de la edición, una filial de una grande como DC (heredera descafeinada de la sugerente Piranha Press) que se atrevía con una obra que resumía con brillantez la historia del colectivo homosexual americano a través de la vida de Toland Polk, un joven sureño que debe afrontar su salida del armario en plena era Kennedy.Pero sobre todo, me sorprendió por la impresionante calidad de la obra. Cruse, un desconocido para mí en ese momento (mi primera lectura de la obra se remonta al año 98 o así) era un reverenciado autor dentro de la comunidad gay por Wendel, pero su obra apenas se había visto fuera de esos circuitos y, mucho menos, había llegado a España, por lo que encontrar a un autor que demostraba ese despliegue de capacidad narrativa era cuanto menos, inesperado.Casi diez años después, aprovecho la edición de Dolmen para releerla pausadamente en castellano, con una extraordinaria traducción de Diego García (a este hombre deberían clonarlo y ponerle a traducir todo tebeo extranjero publicado en España). Y no puedo menos que repetir todas aquellas sensaciones y descubrirme ante una de las grandes obras que ha dado este medio.Cruse consigue un delicado y difícil ejercicio de equilibrismo, a modo de los malabaristas que mantienen varios platos girando en lo alto de una vara sin que caigan ni paren en ningún momento. Usando el personaje de Toland Polk como eje de la narración, nos introduce en la sociedad sureña americana de los años 60, que se debatía entre la intolerancia de unas tradiciones ultraconservadoras, con una fuerte componente racista, y los vientos de renovación social y liberalidad que llegaban del norte y eran abanderados por la juventud. Un protagonista sobre el que se desarrolla un extenso reparto coral que va plasmando en paralelo los problemas de la comunidad homosexual y las reivindicaciones igualitarias de la comunidad negra, que Cruse compara acertadamente, pero sin dejar de evidenciar sus diferencias y, sobre todo, las contradicciones de aquellos que eran capaces de defender unas y no otras y viceversa. La búsqueda de la propia identidad de Toland se va transformando paulatinamente en el testimonio del cambio de la identidad de una sociedad que ve cómo sus cimientos morales y éticos deben evolucionar obligatoriamente.Pero sobre todo, hay que destacar la capacidad de Cruse para humanizar a sus personajes. Sus errores, incoherencias y dudas son las de cualquier ser humano de carne y hueso, consiguiendo una cercanía completa hacia el lector, al que logra hacer llegar las sensaciones y sentimientos de todos aquellos que pasan por sus viñetas. Alegría, dolor, amor, miedo, ira… sentimientos universales que en Stuck Rubber Baby se reúnen y transmiten la lector con fuerza, pero dejando el espacio necesario para provocar una reflexión que nunca caerá en el fácil panfletarismo.Stuck Rubber Baby es, sin duda, uno de esos tebeos de lectura obligada, que pone a la historieta al nivel de cualquier otra forma de expresión cultural y que se disfruta especialmente en la cuidada y excelente edición de Dolmen”.",
  "genres": [
    "Graphic Novels",
    "Comics",
    "Queer",
    "Fiction",
    "LGBT",
    "Historical Fiction",
    "Graphic Novels Comics"
  ],
  "author": "Howard Cruse",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/13453835-stuck-rubber-baby"
}