{
  "title": "Little White Lies",
  "description": "Miranda Carrington has been secretly in love with her boss for years, but after getting involved with his twin brother, Jack, and also spending one passionate night with Holt, she has a serious problem. Miranda is pregnant and doesn't know which one of them is the father.HOLTMiranda watched Holt until he disappeared around the corner. He was incorrigible, impossible, domineering, and…she was still hopelessly in love with him. Oh, God, what was she going to do? She might have been able to lock her feelings for him away in a small corner of her heart if he had remained as aloof towards her as he’d been over the past three years. But how could she possibly keep them contained if he continued to unleash that seductive charm on her? She’d seen how Holt went after something he wanted. He was relentless, and failure was not an option. She doubted he even knew the meaning of the word, and more than anything Miranda was terrified she wouldn’t be able to hold out against him.JACKMiranda’s breath caught in her throat the minute the door was thrown open and she got a brief glimpse of Jack’s face. She’d seen that look before, but never had it been so intense, so…animalistic. He dragged her into his arms, his mouth devouring hers with a hunger that was so fierce she was instantly swept away by the sheer force of it. Vaguely, it registered that he had inched her through the doorway and closed the door, but every nerve and fiber in her body was acutely aware that he was frantically trying to tug her clothes off.MIRANDAHow could she be in love with two men at the same time? But she was. In her heart, Miranda knew she loved them both and would be crushed if she lost either one of them. Jack was everything a woman could want in a man. He was kind and generous, a fabulous lover, and he wasn't afraid of commiting to a relationship. And yet, she couldn’t seem to bury the memory of Holt’s searing kisses or the shameless way her body responded to his touch.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Adult",
    "Erotica"
  ],
  "author": "Kimberley Reeves",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/13453956-little-white-lies"
}