{
  "title": "BadAss Zombie Road Trip",
  "description": "AN AMAZON #1 BESTSELLING HORROR TITLE.2,000 miles. Seven days. Two souls. One zombie. Satan. Everyone LOVES Tonia Brown's BADASS ZOMBIE ROAD TRIP. You know why? Because it's BADASS! Just check out what people are saying!Tash Williams from Badass Zombie Road Trip is a fantastic book, the storyline is extremely well thought out and the action starts almost immediately. It is also extremely funny and has one of the best instances of truly expressive swearing I have ever read in a book… I am being honest in saying that this book is one of the best stories I have read in a long while.Nathan Robinson at Snakebite Nicely written, well plotted with enough twists and turns to keep any reader's attention all the while being an interesting take on the zombie genre… and far enough away from traditional zombie fare to attract a full range of horror fans.The Aussie writing of BadAss Zombie Road Trip is spot on – action in all the right places, witty dialogue and realistic characters who are either love ‘em or hate ‘em types, and there are more than a few laughs along the way.Lori Bowland at Living Dead Readers are in for a treat with \"Badass Zombie Road Trip. It's one of the most enjoyable of horror comedy novels to come along in a while. The entire book is hilarious, wonderful and flawless. It's the best of screwball comedies with a bit of the grisly to keep it delightfully weird. Be prepared to laugh your hearts out and be taken on an insane cross country journey.Graeme Reynolds' Zombie Road Trip is a very different book from the usual zombie fare. For one thing, it’s absolutely hilarious. Horror comedy is not an easy thing to pull off, but this book delivers it in spades. It’s a funny, sometimes moving, sometimes gross and always entertaining road novel, which happens to have a zombie as one of the protagonists.Buy Zombie Road Trip was a unique tale about the undead and one that I highly recommend picking this one up immediately! It’ll be a quick read but a fun has seven days to find his best friend’s soul, or lose his own, dragging a zombie across the country with a stripper who has an agenda of her own, while being pursued for a crime he didn’t commit... and dealing with Satan.",
  "genres": [
    "Zombies",
    "Horror",
    "Humor",
    "Fiction",
    "Urban Fantasy"
  ],
  "author": "Tonia Brown",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/13454467-badass-zombie-road-trip"
}