{
  "title": "Return of a King: The Battle for Afghanistan",
  "description": "In the spring of 1839 British forces invaded Afghanistan for the first time, re-establishing Shah Shuja on the throne, in reality as their puppet, and ushering in a period of conflict over the territory still unresolved today. In 1842, the Afghan people rose in answer to the call for jihad against the foreign occupiers, and the country exploded into violent rebellion. In what is arguably the greatest military humiliation ever suffered by the West in the East, more than eighteen thousand cold and hungry British troops, Indian sepoys and camp followers retreated through the icy mountain passes, and of the last survivors who made their final stand at the village of Gandamak, only one man, Dr Brydon, made it through to the British garrison at Jellalabad. An entire army of what was then the most powerful military nation in the world was utterly routed by poorly equipped tribesmen. The West's first disastrous entanglement in Afghanistan has clear and relevant parallels with the current deepening crisis today, with extraordinary similarities between what NATO faces in cities like Kabul and Kandahar, and that faced by the British in the very same cities, fighting the very same tribes, nearly two centuries ago. History at its most urgent, The Return of a King is the definitive analysis of the first Afghan war. With access to a whole range of previously undiscovered sources, including crucial new material in Russian, Urdu and Persian, and contemporary Afghan accounts including the autobiography of Shah Shuja himself, prize-winning and bestselling historian William Dalrymple's masterful retelling of Britain's greatest imperial disaster is a powerful and important parable of neo-colonial ambition and cultural collision, folly and hubris, for our times.",
  "genres": [
    "History",
    "Nonfiction",
    "War",
    "India",
    "Asia",
    "Politics",
    "Military History"
  ],
  "author": "William Dalrymple",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/13454654-return-of-a-king"
}