{
  "title": "Kissed in Paris",
  "description": "Jump into the pages of the second delicious novel in Juliette Sobanet’s bestselling City of Love series and be swept away to Paris…When event planner Chloe Turner wakes up penniless and without a passport in the Plaza Athénée Hotel in Paris, she only has a few fleeting memories of Claude, the suave French man who convinced her to have that extra glass of wine…before taking all of her possessions and slipping out the door. As the overly organized, go-to gal for her drama queen younger sisters, her anxiety-ridden father, and her needy clients, Chloe is normally prepared for every disaster that comes her way. But with her wedding to her straitlaced, lawyer fiancé back in DC only days away and a French con-man on the loose with her engagement ring, this is one catastrophe she never could have planned for.As Chloe tries to figure out a way home, she runs into an even bigger problem: the police are after her due to suspicious activity now tied to her bank account. Chloe's only hope at retrieving her passport and clearing her name lies in the hands of Julien, a rugged, undercover agent who has secrets of his own.As Chloe follows this mysterious, and—although she doesn't want to admit it—sexy French man on a wild chase through the sun-kissed countryside of France, she discovers a magical world she never knew existed. And she can’t help but wonder if the perfectly ordered life she’s built for herself back home is really what she wants after all…Juliette Sobanet’s captivating Paris novels have reached over 500,000 readers worldwide, hitting the top 100 Bestseller Lists on Amazon US, UK, France, and Germany, becoming bestsellers in Italy and Turkey as well. Time for that romantic trip to Paris? All you have to do is grab your copy of Kissed in Paris and turn the page…",
  "genres": [
    "Romance",
    "Chick Lit",
    "Contemporary",
    "Contemporary Romance",
    "Fiction",
    "France",
    "Mystery"
  ],
  "author": "Juliette Sobanet",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/13454788-kissed-in-paris"
}