{
  "title": "67 Cents: Creation of a Killer",
  "description": "A Snapshot of 67 Cents: Creation of a KillerIn “67 Cents: Creation of a Killer,” you will meet Nick, a man who can’t seem to say No. That can cause serious problems in an environment of unbridled crime and violence such as South Boston during the 1960s through 80s.While still a young boy, Nick is recruited by his father to help out at the family’s auto repair shop in the heart of “Southie.” It’s here that he’s introduced to the brutal reality of street justice, where verdicts are swift, penalties severe, and there are no appeals.As time passes, Nick will witness and eventually contribute to a level of violence unprecedented in Boston’s long history. Nick wasn’t always a Yes man. He struggled through his early years, as a constant outsider. But at a fairly young age, he experiences a major revelation. He decides he’s had enough of this outsider status. From this point on, he will do absolutely anything he has to do in order to gain and maintain acceptance and respect. In doing so, he finds out the hard way that certain choices, once made, cannot be undone.He learns to bend the rules, put aside his childhood values, and break the law in ever increasing ways. Nick finds out that, like a lethal drug, money has a power of addiction all its own, especially easy money. One skill he acquires is that of brutally fighting back against adversaries, eventually being pushed to the ultimate act of revenge; murder. Not only does he find that he’s good at killing, he actually enjoys it!Nick’s quest to become the ultimate insider succeeds, but at what price? It quickly becomes evident to him that being connected to the underworld reaps substantial rewards. It takes a bit longer for him to realize that with those rewards comes tremendous risk and sometimes extreme misery. But once he’s on this chosen path, there’s no turning back.And he finds that one particular decision that he makes, drastically alters the entire course of his life.",
  "genres": [],
  "author": "Thomas M. Cirignano",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/13455319-67-cents"
}