{
  "title": "Celtic Shores",
  "description": "Celtic Shores is a magical masterpiece! Best Book of May, 2012, GoodReads - #25 Celtic Steel Series, Book 2 Patrick MacCahan just became the new Laird of the O'Malley clan. His new position is met with many obstacles; including a tempestuous new wife, a two-decade long war with a neighboring village, a missing foster child and a pagan witch who overpowers the clan at every turn. Parkin MacCahan's life just got a lot more exciting. His older brother Patrick has married the eldest daughter of the O'Malley clan. His father is building a shipping empire off the coast of Northern Ireland. Parkin must oversee the operations and coordinate efforts between the O'Malleys and the MacCahans. In order to dock at O'Malley port, Parkin and his men must sail past the legendary Island of Women. Will Parkin be able to withstand the temptation to trespass the legendary shore? Or will he be invited? Kyra O'Connell has resided in O'Malley territory all of her life. As the niece of the late Laird Dallin O'Malley, and daughter of the clan's chieftan, she has been part of the inner circle for as long as she can remember. When a spy is found among the villagers, Kyra is asked to take up residence on the Island of Women and to infiltrate their ranks as a spy herself. Celtic Steel Series - Other Books in the Series - coming soon! Celtic Stars, Book 3 - August, 2012 Celtic Skies, Book 4 - October, 2012 Celtic Sun, Book 5 - December, 2012 Best Books of May, 2012, GoodReads - #25 BooksforMen - 5 STARS \"This book has just the right mixture of action, drama, and romance to entwine any reader into the lives of the characters of the book.\" 5 STARS \"This is definitely not your mamma's romance novel. Most importantly, this is one of the best science fiction / paranormal medieval novels I have read in some time.\" WHAT IS CELTIC SHORES? “An intriguing fantasy novel.” “A science fiction story with a paranormal romance thrown in.” “An engaging mystical twist on a highlander romance.” AUTHOR COMPARISONS : \"Great read couldn't put it down. Can't wait for the next book in the series. You rank up there with Diana Gabaldon of the Outlander series.\" ~ B. Breen ”The last time I had just a detailed landscaped story in my mind was after reading The Hobbit by Tolkien.\" – Christina ********************************* DIALECT DISCLAIMER The characters represented in this work of fiction come from a time and place unlike our own. In an attempt to create as realistic as possible an atmosphere for the reader; there will be some direct emphasis on accent, dialect and pronunciation in the dialogue. What you will find are not, in fact, misspellings or instances of bad grammar on the part of the author. Rather, you will discover phonetically enriched wordings—to symbolize the language and methods of communication in the period and geographical areas represented.",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Fantasy",
    "Historical Fiction",
    "Medieval",
    "Paranormal"
  ],
  "author": "Delaney Rhodes",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/13455374-celtic-shores"
}