{
  "title": "Highland Shifter",
  "description": "Tiếp nối ba cuốn tiểu thuyết Phía sau một lời thề, Thề ước thầm lặng và Giữ trọn lời thề, Tình yêu vượt thời gian là cuốn sách thứ tư trong series MacCoinich Time Travel ăn khách của Catherine Bybee. Series này đã được bình chọn vào top 10 tiểu thuyết xuyên không lãng mạn hay nhất trên Amazon. Năm 2011, Catherine đã giành được giải nhất trong cuộc thi More Than Magic Contest - giải thưởng văn học cao quý cho các tác giả văn học lãng mạn pha viễn tưởng với series này.Dựa vào manh mối là một cuốn sách bí ẩn cùng giác quan thứ sáu của mình, Helen Adams đã tới Scotland để tìm hiểu về sự mất tích bí ẩn của một thiếu niên. Một cơn địa chấn bất ngờ đã đưa cô vượt thời không, rời bỏ thế kỷ XX để trở về Scotland thời Trung Cổ và gặp gỡ những thành viên của gia đình MacCoinnich. Lần đầu du hành vượt thời gian trở về quá khứ, Simon McAllister - MacCoinnich vẫn còn là một thiếu niên. Trải qua nhiều biến cố, anh đã coi Scotland thế kỷ XVI là nhà của mình và trở thành một chiến binh Cao nguyên đáng gờm với kỹ năng biến hình cũng như giao tiếp với động vật. Và cũng tại đây, số phận đã đưa Helen đến với anh.Cùng lúc đó, gia đình Simon liên tục phải đối mặt với các cuộc tấn công từ kẻ thù bí ẩn, còn Helen lại trở thành mục tiêu bị truy đuổi ngay trong thời đại của cô. Để giải quyết những mối nguy hiểm, đồng thời bảo vệ gia đình MacCoinnich, Simon và Helen phải trải qua các chuyến du hành vượt thời gian cùng với nhau, rồi tình yêu của họ bắt đầu chớm nở.Nhưng cho dù vượt qua được mọi chuyện, làm thế nào họ có thể giữ một mối quan hệ với khoảng cách thời gian hàng thế kỉ?Tình yêu vượt thời gian được đánh giá là cuốn tiểu thuyết lãng mạn hư cấu đầy hấp dẫn, trên nền một tình yêu ngang trái giữa hai con người thuộc hai thời đại khác nhau, và một chuyện tình đẹp như tranh vẽ trên từng trang sách hấp dẫn, khiến người đọc không thể rời mắt.",
  "genres": [
    "Time Travel",
    "Romance",
    "Fantasy",
    "Historical Romance",
    "Paranormal",
    "Historical",
    "Audiobook"
  ],
  "author": "Catherine Bybee",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/13455189-highland-shifter"
}