{
  "title": "Hotter on the Edge",
  "description": "Three novellas of science fiction romanceOn the edge of space... On the edge of danger... On the edge of desire...All That Glitters by Erin KellisonCheated out of a fortune by the Sol royal family, lowborn Simon Miner will do anything to get his revenge, no matter how ruthless. When Princess Mica Sol, a terraforming expert, is shot out of the sky on the way to her sister’s lavish wedding, she fears the worst—scavengers—and flees into an alien jungle to avoid capture. But the man who pursues and captures her is none other than Simon, her former lover. Passions reignite as violence rocks Sol City, and Simon and Mica must fight for love, family, and their world… or lose everything.To Buy a Wife by KC KleinIn a harsh land where corruption rules and women are few, cold realist Hudson Land must purchase a wife to save his farm. Instead of an auction, he witnesses the start of an execution. With his first look at a beautiful woman in years, Hudson knows he has to have her—no matter the cost. Lake, a chemist and a rebel fighter, is resigned to her death, but when some back-hill farmer rescues her from the chopping block she has no intention of simply becoming his wife. She’s pledged her life to the Rebellion and being bought for some stranger’s bed doesn’t change a thing, though his soft caresses have her longing for more. As lies and secrets build between them, are the quiet moments during the nights they’ve shared enough to stand against two warring factions in a world where only the strong survive?Enslaved by Starlight by Jessa SladeTransformed by empathic crystals into the perfect paramour, Benedetta Galil is the last treasure of her fading world. When raiders attack—seeking to corrupt the crystals and conquer all of charted space—she gives herself as a prize to the one man in the universe who values freedom over power. Mercenary sheership Captain Corso Deynah left oppression behind him on a burning planet and has no use for a sex slave, even one as seductive as Benedetta. But while he stubbornly resists her body, her fierce spirit tempts him, and he will risk everything—his ship, his seclusion, the very stars—to win not just her passion but her love.",
  "genres": [
    "Romance",
    "Science Fiction",
    "Anthologies",
    "Science Fiction Romance",
    "Erotica",
    "Paranormal",
    "Futuristic"
  ],
  "author": "Erin Kellison",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/13455583-hotter-on-the-edge"
}