{
  "title": "Loving Amy",
  "description": "Loving Amy (#1 of the Sensual Erotica Series)A sensual \"quickie\" about unrequited love - Designed to get you in the mood. (Approx. 4250 words) Perfect for mobile eReaders - have access to a quickie whenever you need a fix.Troy has wanted Amy, his best friend's girl, for years. He finally gets his chance one fateful night when the redheaded vixen asks him to make love to her - but there's a problem. She is totally drunk and he wants more than a one night stand. Troy must navigate the treacherous waters of giving a tipsy Amy what she desires without losing his one chance to claim her for his own.Troy has patiently waited on the sidelines for his chance with Amy. Years of being her \"friend\" has taken its toll, but that all changes the night the copper-haired beauty propositions Troy at his Christmas party. As much as he wants to ravish her, she is too drunk for Troy to trust her desires. Instead, he concentrates on pleasing her body. Amy's cries of ecstasy give him confidence he has done his job well, but before the night is over Troy makes a fatal error. It is enough to ruin his chance at loving Amy?Excerpt from Loving Amy:He noticed her stumble as she walked away. Then Amy bumped into the couch and fell on the small Christmas tree in the corner. Daniel helped her up, righting the tree. Amy giggled and looked in Troy's direction. Crap, she is really drunk. It would be so much easier to pretend she wasn't. Now what was he going to do? He didn't want her feeling taken advantage of after the hangover wore off.He stood out on the deck a while longer contemplating his next move. Troy sucked on his cigarette to give himself time to think, but it didn't take long to formulate a plan. Troy crushed the smoldering butt with his foot, before heading to his bedroom and locking the door behind him.Amy lay in a seductive pose on his bed. \"You made it. I was afraid you were having second thoughts.\"\"Never.\" Troy pulled off his shirt and tossed it to the ground before getting into bed with her.Adult Reading Material (18+) This book is for mature audiences only and contains sexually explicit content.* If you enjoy this erotic story check out the series, Sensual Erotica. The short stories are stand-alone scenarios made to excite and titillate, but all are interconnected. Enjoy the palate of sensual experiences contained in the series as Amy and Troy make their way in the world. Pick and choose the situations that arouse you, or be a little naughty and sneak a peek at the ones you've always been curious about.",
  "genres": [
    "Erotica",
    "Romance",
    "Contemporary",
    "Short Stories",
    "Erotic Romance"
  ],
  "author": "Red Phoenix",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/13456612-loving-amy"
}