{
  "title": "Private Pleasures",
  "description": "Fans of Bella Andre and Sylvia Day will love Jami's latest steamy story! Wendy Carmichael's career as a high-powered attorney leaves her little time for a love - or sex - life. She has a broken engagement to prove it.  With everything she's worked for on the line, she can't afford to be distracted -especially not by Drew Walker.  The first time she laid eyes on the brash, cocky millionaire five years ago Wendy knew that giving into the chemistry sparking between them could only lead to trouble. But when they're thrown together at a party in paradise, his wicked smile and rock hard body draw her like a moth to a flame.  Convincing herself one night of indulgence can't hurt, Wendy decides to find out once and for all if being with Drew is as hot as she's always imagined. But Drew isn't satisfied with just one night, and neither is Wendy. When Drew proposes a no holds barred, no strings attached affair that will end when he moves across the country, Wendy can't say no. Yet as the nights pass, each hotter than the last, Wendy discovers that what she thought was casual is anything but, and has potential to be so much more. Now she fears that when cocky, too sexy for his own good Drew walks out of her life, she'll be saying goodbye to the man of her dreams.   Praise for Private \"Like all of Jami's books, Private Pleasures is sexy, hot, and full of emotion. I loved watching the sparks fly between Wendy and Drew!\" -- Top 10 Kindle bestseller Bella Andre \"Private Pleasures is a fantastically sexy battle of wills between a hero and heroine who are equals in every sense of the word. A smoking hot read!\" -- USA Today bestseller Victoria Dahl Praise For Jami Praise for Jami Alden's “Jami Alden always takes you on a wild ride! - New York Times best seller Catherine Coulter “The perfect balance of emotion and romance.” -New York Times best seller Maya Banks “Hot and emotionally charged, Jami Alden always delivers.” -New York Times best seller Shannon McKenna “A fantastic story that will keep you hot and bothered.” -Romantic Times Book Reviews for Private Party “Alden can wring every emotion from her characters.” -Romantic Times Book Reviews",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Erotica",
    "Contemporary",
    "Adult",
    "Love",
    "Erotic Romance"
  ],
  "author": "Jami Alden",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/13456994-private-pleasures"
}