{
  "title": "The Sensitive's Circle, Finding Balance & Creating Hope",
  "description": "SYNOPSIS FOR: THE SENSITIVE’S CIRCLE, FINDING BALANCE & CREATING HOPEWritten and Illustrated by Michael Sortomme © 2011 The world is changing, faster and faster, day-to-day. Life, and society with it, is careening out of control. As our present grows more complicated, smaller and linked in the most unexpected of ways, our common histories are being reinvented, our past recreated in washed out images, or discarded altogether; our future is unclear. Many are caught in a psychic limbo, unable to move, plan or weigh opportunities for growth, not knowing where to turn for support or who to call in case of emergency. Lurking in every group, society, nationality, gender and race, are people more similar than different, with gifts misunderstood but craved by others. They are the sensitives, people kept separate, used as other’s anchors and commodities to be exploited, but discarded by the whole as freaks of nature. Millions of international sensitives have lost their voice in this new age of violent earth-changes, disintegrating social and government structures and rampant fear, especially within the construct of organized religion and the medical establishment.  The Sensitive’s Circle reaches out to the growing group of disenfranchised psychics, caretakers and conscious healthcare providers overwhelmed by the weight of responsibility and overloaded by the call to save the planet. It provides a helping hand to the keepers of balance, too overworked to fulfill their own needs and provide their inner beings and Higher Selves with nourishment.  The book is divided into three sections. The preface and introduction seeks out first contact, recognizing universal need and connection. The first ten chapters define what a sensitive is and outlines the challenges and similarities that bond seemingly diverse individuals together from around the world. It also tells the author’s childhood story, from a Reincarnationist’s point of view, and includes the changing belief structures that have shaped her life-long spiritual practice. The final six chapters offer skills for creating balance, health and spiritual protection through introspection, meditation, ritual, changing negative physical routines and behavior patterns and embracing positive change on all levels: body, mind and soul. The words are uplifting and edifying, the art draws the soul’s recognition of truth to the surface and the prayers are relevant for our time. It is written not for the novice, nor the adept, but geared for all people of many professions that feel, give and express until it hurts.",
  "genres": [],
  "author": "Michael Sortomme",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/13456869-the-sensitive-s-circle-finding-balance-creating-hope"
}