{
  "title": "A Cat's Chance in Hell",
  "description": "If the Demon Master gets his way the City is about to become Hell on Earth.Gabi has some extraordinary talents. Some might call them supernatural, but for her they’re just part of everyday life. What she knows about the supernatural would give most humans nightmares forever. Ridding the streets of bad-ass creatures of the night is Gabi’s other job. Taking up the mantle of her father’s legacy, she is a Hunter for the Malus Venatori. If she had a choice it would be her only job, but a girl has to make a living, right?Being ambushed and kidnapped by the sinfully sexy Master Vampire of the City should have been just another night on the job, except for the fact that Julius has other plans for her. When he reveals that his nemesis wants control of the City and has plans to fill it with Demons from the Etherworld, creating an army of Ghouls and turning humans into nothing more than cattle to feed his Clan, Gabi must choose her path. She must decide whether to join with Julius in a stand against the Demon Master or flee the City with her friends and family, leaving the Vampires to wage their own war and the rest of the residents to their fate.But it’s not in Gabi’s nature to back down from a fight, no matter how impossible the odds. As the Malus Venatori prepare for war, Gabi finds herself pulled deeper into Julius’s world and makes some disturbing discoveries about her unusual supernatural abilities. Her existence might just be the answer to a mystery as old as the Vampire race. Even more unsettling than that is her undeniable attraction to Julius and the taste of his blood. But before she can come to terms with her conflicting desires they must all survive the Demon onslaught and find a way to safeguard the truth of her heritage. While the supernatural bad guys know her as Angeli Morte, her friends call her Hellcat!If you like your heroine smart, sassy and absolutely kick-ass and your Vampire hero sexy as sin and twice as dangerous you’re going to want to read the hellcat series.",
  "genres": [
    "Urban Fantasy",
    "Vampires",
    "Paranormal",
    "Magic",
    "Fantasy",
    "Romance",
    "Shapeshifters"
  ],
  "author": "Sharon Hannaford",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/13457108-a-cat-s-chance-in-hell"
}