{
  "title": "Taming Feral",
  "description": "Taming Feral (#5 of the Sensual Erotica Series)A sensual \"quickie\" about a sexy Master/Slave relationship - (Approx. 6100 words) Perfect for mobile eReaders - have access to a quickie whenever you need a fix.Amy falls hard for Brad. He is sexy, intelligent and terribly handsome - but he hides a dirty little secret. Brad wants Amy as his sex slave. It is not an easy task to tame the strong willed redhead, but Brad knows how to tease her into submission. Amy is about to discover a whole new world of sexual pleasure.Amy meets Brad in a communication class and is completely taken by him. But there's a problem, Brad wants her as his sex slave. He promises to please her like no other man, but Amy is far too independent to become a man's toy. Still, Brad is convinced he can get her to call him master. His plan is to tame her feral spirit with the exotic pleasures hidden within The Room.Excerpt from Taming Feral:Brad moved to the other side of her neck and bit down lightly. Amy struggled to stay still when her knees threatened to buckle. Then he sucked on the delicate skin, harder and harder until it brought a bite of pain. She instinctively unclasped her hands and jerked away. He stopped and looked at her. \"You cannot move, Feral.\"\"That hurt.\"Brad circled the area on her neck that had received his attention. \"Pleasurable pain?\" The richness of his voice and the warmth of his touch excited her.Amy realized she'd pulled back because it was unexpected, not unpleasant. She clasped her hands behind her back and presented her neck to him again. She could feel his hot breath before his lips came down on her neck. She felt the sting, but did not resist. Instead, she gave into the feeling and started moaning softly. Brad pulled away, admiring the mark his lips had left on her white skin. It seemed so high school, but somehow he'd made it incredibly erotic.Brad leaned in close. \"I can make you want me like you have never wanted any man.\"Adult Reading Material (18+) This book is for mature audiences only and contains sexually explicit content.* If you enjoy this erotic story check out the series, Sensual Erotica. The short stories are stand-alone scenarios made to excite and titillate, but all are interconnected. Enjoy the palate of sensual experiences contained in the series as Amy and Troy make their way in the world. Pick and choose the situations that arouse you, or be a little naughty and sneak a peek at the ones you've always been curious about.",
  "genres": [],
  "author": "Red Phoenix",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/13457176-taming-feral"
}