{
  "title": "Bottoms Up",
  "description": "Bottoms Up (#3 of the Sensual Erotica Series)A sensual \"quickie\" about two girls enjoying one guy - (Approx. 5450 words) Perfect for mobile eReaders - have access to a quickie whenever you need a fix.Troy lives out every guy's dream when his girlfriend, Kate, arranges a surprise ménage a trois. The new girl is a little blond who only likes it one kinky way. Troy is about to find out the petite spitfire can take all he can give her and more. Is Troy man enough to make both girls quiver in erotic nirvana? You bet he can.After screwing things up with Amy, Troy returns to Kate. Their relationship begins to heat up the night she arranges a ménage a trois with her girlfriend, Jenny. The little blond has a tight ass and an insatiable need. Troy can't believe his luck when the girls offer to fulfill his greatest fantasy. Who says one man can't please two women at the same time? Kate and Jenny decide to put him to the ultimate test.Excerpt from Bottoms Up:Kate took Troy's hand and led him to the burgundy couch. \"Instead of telling you, why don't we show you?\" She sat down next to him, running her red nails seductively up his thigh. Then she called to Jenny, \"Hurry, girl, he's waiting.\"The pixie came out of the kitchen with a bottle of red wine and three glasses. \"I'm going as fast as I can,\" Jenny complained good-naturedly. She poured the wine and handed Troy the first glass. \"This is for you, sexy.\"Kate held up her glass to toast. \"Here's to a night none of us will forget.\"\"Bottoms up,\" said Jenny. She clinked Troy's glass and wiggled her ass flirtatiously.Troy took a long drink and put the wine down. \"Okay, what's this all about?\" He had a good idea, but Troy needed to hear it to believe it.\"I want to fulfill your ultimate fantasy tonight,\" announced Kate, as she started unbuckling his belt.Adult Reading Material (18+) This book is for mature audiences only and contains sexually explicit content.* If you enjoy this erotic story check out the series, Sensual Erotica. The short stories are stand-alone scenarios made to excite, but all are interconnected. Enjoy the palate of sensual experiences contained in the series as Amy and Troy make their way in the world. Pick and choose the situations that arouse you, or be a little naughty and sneak a peek at the ones you've always been curious about.",
  "genres": [],
  "author": "Red Phoenix",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/13457094-bottoms-up"
}