{
  "title": "Her Gift",
  "description": "Her Gift (#8 of the Sensual Erotica Series)A sensual \"quickie\" about two lovers coming together in a new way - (Approx. 5750 words) Perfect for mobile eReaders - have access to a quickie whenever you need a fix.Troy doesn't know Amy wants to give something personal to him on his last day - something no other man has ever touched. The reunited lovers reluctantly face their upcoming separation by making the most of the two weeks they have together. Troy enjoys an evening of sensual lovemaking the night Amy presents him with a one-time gift. In a tender encounter, Troy takes her final virginity.Troy is excited to be leaving for New Delhi until he sees Amy again. In a desperate move, he recaptures her heart and the lovers reunite. Unfortunately, Troy and Amy only have two weeks together. Amy is so deeply in love with Troy that she willingly gives him something she hasn't shared with another man. Troy takes the opportunity to make sweet love to her in the most intimate way. Afterwards, he adds a little more spice to the night with whip cream and champagne. Yum!Excerpt from Her Gift:The gorgeous redhead put her hands on his chest. \"Lover...Do you mind if I call you that?\"\"No, I like it,\" Troy said, brushing his hand against her cheek.Amy smiled at him shyly. \"I wish I had known you when I was younger. I wish you had been my first.\"\"Yes, that would have been nice, Amy.\" Troy played with her long red hair, loving the soft feel of it. \"There is something I have never done, but I want to do it with you now.\"He was intrigued. \"Really?\"She looked down at her feet, blushing a bright shade of pink. \"Oh...how do I even say it? It sounds so crass.\"He chuckled lightly. \"Just say it, Aims.\"\"I want you to be my first...the other way.\"Adult Reading Material (18+) This book is for mature audiences only and contains sexually explicit content.* If you enjoy this erotic story check out the series, Sensual Erotica. The short stories are stand-alone scenarios made to excite and titillate, but all are interconnected. Enjoy the palate of sensual experiences contained in the series as Amy and Troy make their way in the world. Pick and choose the situations that arouse you, or be a little naughty and sneak a peek at the ones you've always been curious about.",
  "genres": [],
  "author": "Red Phoenix",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/13457220-her-gift"
}