{
  "title": "British Lover",
  "description": "British Lover (#9 of the Sensual Erotica Series)A sensual \"quickie\" about hot and humorous English love - (Approx. 5500 words) Perfect for mobile eReaders - have access to a quickie whenever you need a fix.Amy encounters a devilishly handsome Brit at an animal shelter. Taken by his sexy accent; she soon finds he can also kiss her to distraction. Jeremy is determined to show the sassy yank some authentic British lovin' before he heads back to his homeland. Amy finds herself in rather titillating situations due to Jeremy's exhibitionist tendencies, and the two partake in some wicked British fun.Troy loves Amy too much to ask her to wait. He ends the relationship, leaving Amy distraught. She seeks diversion by volunteering at a local animal shelter where she meets Jeremy, a Brit visiting from Oxford, England. Jeremy not only has an adorable accent, but he knows how to make her laugh. His exhibitionist ways lead to some interesting encounters and Amy learns firsthand the meaning of international relations.Excerpt from British Lover:Amy giggled. \"I love your words! Say some more, please.\"Jeremy took a sip of his wine and then complained in mock disgust, \"You Americans, so easily entertained.\"\"Yes we are, especially by smarmy gits.\" Amy broke out in hysterics, kicking her feet on the blanket.\"You know sweet fanny adams about me. I'm not a smarmy git.\"Amy broke out in a fresh peal of laughter and had to wipe the tears from her eyes when she finally stopped laughing. \"Well, I do like a guy with a sense of humor.\"Jeremy patted the blanket. \"Then come lie here and let me tickle that funny bone of yours.\" Amy finished off her wine and lay down beside Jeremy, trying not to giggle. He leaned over her and asked, \"Would it be all right if this classy Brit kissed this sassy Yank?\"She smiled up at him. \"I suppose...\" Jeremy's cold lips pressed against hers as he plundered her mouth with his tongue.Adult Reading Material (18+) This book is for mature audiences only and contains sexually explicit content.* If you enjoy this erotic story check out the series, Sensual Erotica. The short stories are stand-alone scenarios made to excite and titillate, but all are interconnected. Enjoy the palate of sensual experiences contained in the series as Amy and Troy make their way in the world. Pick and choose the situations that arouse you, or be a little naughty and sneak a peek at the ones you've always been curious about.",
  "genres": [],
  "author": "Red Phoenix",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/13457227-british-lover"
}