{
  "title": "The Flame",
  "description": "The Flame (#6 of the Sensual Erotica Series)A sensual \"quickie\" about a hot night of naughty paddling - (Approx. 4250 words) Perfect for mobile eReaders - have access to a quickie whenever you need a fix.Amy calls Brad her Master. In his house she becomes Feral, his willing sex slave. Brad is falling for the beautiful redhead and has only her pleasure in mind the night he brings out the paddle. After an erotic night of naughty pleasure, Brad expresses his true feelings in the bedroom. Amy opens her heart to him, unaware that an old flame has returned to rip their world apart.Amy never thought she would enjoy being submissive to Brad, but the man knows just how to please her. After a chance meeting with her almost-lover Troy, Brad is shaken enough to express his true feelings for Amy in a night of deep passion. She assumes Troy has moved on and decides to start a life with Brad. Her budding relationship is threatened the day Troy returns for her with his arms wide open.Excerpt from The Flame:Brad played with her long red hair murmuring, \"My beautiful Feral.\" He grasped the back of her neck and kissed her deeply. The look he gave her at the end of the kiss was ripe with tenderness. Brad escorted her to The Room and asked her to strip down while he retrieved something from the kitchen. Amy stood in the secret room naked and alone. She looked at the wall of sex toys and wondered what tonight's entertainment would be.Brad returned with a single chair and placed it next to her. \"I need you to get the paddle off the wall.\" Amy's insides churned. Was he going to punish her for what happened earlier with Troy? She took it down slowly, her hand trembling as she walked back to him.When she returned to his side, Brad was already wearing his leather mask and had other items laid out for her. She handed the paddle over saying softly, \"Don't hurt me, Master.\"Brad's green eyes stared at her from behind the dark mask. \"I will do what I want, Feral.\" She was relieved when he smiled and added, \"But I promise you will like it.\"Adult Reading Material (18+) This book is for mature audiences only and contains sexually explicit content.* If you enjoy this erotic story check out the series, Sensual Erotica. The short stories are stand-alone scenarios made to excite and titillate, but all are interconnected. Enjoy the palate of sensual experiences contained in the series as Amy and Troy make their way in the world. Pick and choose the situations that arouse you, or be a little naughty and sneak a peek at the ones you've always been curious about.",
  "genres": [],
  "author": "Red Phoenix",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/13457212-the-flame"
}