{
  "title": "Neverking: Prince of the Elves",
  "description": "Neverking tells an irresistible and enthralling story of heroism, undying friendship, and powerful love that takes place in a vibrant and very believable world of deceit and danger.Coming-of-age should never be this hard. But when your father’s been cursed to walk the lands as an undead skeleton and he happens to be the King of the Elves, ‘coming-of-age’ gets a new definition. Avador Andor sets forth to defy odds that an army of well-trained men would fear to even think about, in order to save his father and his lands. The young Elf is united with two of his childhood friends, each refusing to let him go alone, and join him to face the impossible odds together. They experience an unforgettable journey that puts the power of friendship through one bitter test after another. Together, as a team that has never seen the world beyond its village, they must confront and conquer ‘the unknown’ by protecting and believing in each other.What happens to the Prince when the King can't die?Avador, Tigran, and Falstaff. These three friends find out what happens but none of them like the answer… it almost kills them. A sadistic man who calls himself a ‘king’ curses the King of the Elves beyond any hope of recovery. Avador Andor, the Prince of the Elves must lead a journey to stop his father’s assailant from following through with his other plans, now that his one obstacle is gone. Avador has never seen the world or what it could do before now. The coming-of-age Prince quickly recalls his father’s advice and teachings and puts them to use with the help of his two best friends. Their journey takes them to Avador’s father where they believe the quest is over. But when they see him as he is, a cursed skeleton walking for all eternity as an undead, the mission becomes an out-of-control downhill tumble to stop the man who did this to him. Neverking tells an irresistible and enthralling story of heroism, undying friendship, and powerful love that takes place in a vibrant and very believable world of deceit and danger.",
  "genres": [],
  "author": "George Avgoustis",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/13457584-neverking"
}