{
  "title": "The Memory of You",
  "description": "The Memory of You The Return to Redemption Series Prequel Winner of Romance Writers of America® Golden Heart® Award She can’t forget him—He can’t remember her Together, they must discover the healing power of unforgettable love The day Lieutenant Matthew Foster departed for his so-called ‘tour’ in Vietnam, he never expected a sudden change in his itinerary would include an extended stay in the horrific Hanoi Hilton. Six years later, he’s finally released with the other POWs during Operation Homecoming. Unfortunately, his memories before his capture were erased by the complimentary torture provided by the hotel’s concierge. Due to prior facial injuries and the beard concealing his gauntness, he looks nothing like the boyish photo in his military file. When the Army informs Matt he has a wife and he was mistakenly declared dead, he’s sure Abby must have made a new life for herself. He doubts the bitter man he’s become can salvage the boy she once cared for, so to be fair to her, he decides to simply write a note to wish her well and leave. But before he does, he can’t resist going to Redemption, PA, to catch a glimpse of the woman he’d loved enough to marry. The irony of the small town’s name is totally eclipsed by Matt’s dread that he’ll discover he’s lost something truly worth remembering. That fear becomes reality when he learns Abby is engaged, and he’s a daddy! Luckily, his wife doesn’t recognize him, so Matt could still walk away from the beautiful stranger who’s been starring in his X-rated dreams. However, he could never, ever abandon his sons. The clock is ticking. Any day, the military will inform Abby he’s alive, and her wedding is in only six weeks. It doesn’t give Matt much time to discover if he can reclaim the love the war stole from him. “A heart-warming tale of love and second chances. I thoroughly enjoyed this book!” Joy Nash, USA Today best-selling author of The Unforgiven and A Little Light Magic “A poignant and sensual read filled with great characters you’ll fall in love with.” Hope Ramsay, best-selling author of Welcome to Last Chance",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Fiction",
    "Contemporary",
    "War",
    "Military Fiction",
    "Adult"
  ],
  "author": "Laurie Kellogg",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/13458858-the-memory-of-you"
}