{
  "title": "Marinade",
  "description": "**This is book one of the Wishing Well Series. The entire collection is also available. Marinade, Bigger, Carryout.** What if having your most desired wishes come true was as easy as throwing something in an old well, and stating your wish? What if the one granting your wish was a beautiful demon named Daniel? Would you take a chance? Allison Philips, a girl you'll love to hate, is on the verge of losing her best friend, Sarah. She reluctantly decides to go to the freshman wishing well party with the hope of finding her friend and giving her an apology. Never a believer in anything but herself, she makes a wish that she knows will make Sarah happy. Instead, Allison fights for her life as Daniel makes her wish come true in the most agonizing and terrifying way possible. Amanda is Allison's old high school classmate. She throws her bracelet in the old well, and uses her wish to land the one guy that hasn't even noticed her existence. Daniel grants her wish, and Amanda soon realizes that her new boyfriend holds a dark and gruesome past. He plans to use Amanda to fufill his own sadistic desires. Back in his home, under the well, he pulled his shirt over his head, and removed the leather strap from his nape. His hair fell to his shoulders, and he shook his head in relief from the binding. The upcoming party would prove to be quite entertaining, of that he was certain, and he walked to his full length mirror to take a good look at what everyone would see in a few short hours time. A tan and very hard body; the perfect blend to bring the young people to his side in the beach side town. He was taller than most men, and his smile was of absolute perfection. The demon laughed at his chiseled body, and ran his hand down the perfectly sculpted chest and stomach. When his hand lowered enough to trail over his thick c*ck through his jeans, he smiled again. “I would swear I was made by a woman.” Vanity, it was his favorite sin, and one he quite enjoyed Language, Sexual content, graphic violence, bloody gore. Recommended for ages 18+",
  "genres": [
    "Horror"
  ],
  "author": "Rebecca Ratliff",
  "average_rating": "3.31",
  "url": "https://www.goodreads.com/book/show/13459761-marinade"
}