{
  "title": "The Righteous",
  "description": "Medical student Jacob Christianson is sent by church elders to investigate a murder within the polygamist enclave of Blister Creek, Utah. He brings his young sister Eliza, who must choose a husband from three old men jostling for power within the church hierarchy.Jacob discovers that the murdered woman has been killed in accordance with secret blood oaths taken within the polygamist temple. Together with his sister, he uncovers a plot to overthrow the church leadership, with murders that reach beyond the community and into the \"gentile\" world. The Righteous is a heart-pounding suspense-thriller with a depth that will haunt the reader long after the last page is turned.\"Deeply engrossing! Michael Wallace delivers the thinking man's thriller while establishing one of the freshest male leads in crime fiction--Jacob Christianson, an aspiring doctor and cult elder's favored son. Jacob's analytic nature has him questioning everything, including the nature of God and the sexist politics of polygamy. It also makes him a perfect fit to track down a killer whose grisly crimes threaten Jacob's community, family, and soon, his very life.\"-- Lisa Gardner, New York Times bestselling author of LIVE TO TELL.\"Wallace authoritatively and unsparingly tears open the veil shrouding a Utah polygamist community and its secret oaths of blood atonement, temple sacrifice, and angels with drawn swords. Inside we find a riveting thriller that recaptures everything lost from the original American religion.\"-- Jeffrey Anderson, National bestselling, International Thriller Award nominated author of SLEEPER CELL.Includes Bonus book group discussion questions, and an excerpt of Mighty and Strong (the sequel to The Righteous).",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Religion",
    "Crime",
    "Mystery Thriller",
    "Suspense"
  ],
  "author": "Michael  Wallace",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/10387289-the-righteous"
}