{
  "title": "Stop Forgetting to Remember: The Autobiography of Walter Kurtz",
  "description": "WHO SHOT WALTER KURTZ?Nobody. Walter Kurtz doesn’t exist. He’s the alter ego of me, Peter Kuper. But, if he were real, perhaps his obituary would read something like this:Walter Kurtz, illustrator and self-exposing cartoonist, dies of embarrassment at 48.Walter Alan Kurtz, born September 22,1958, in Cleveland, Ohio, to Harvey and Olive Kurtz (an Ellis Island rewrite from Kurtzberg), was pronounced dead at Mt. Sinai Hospital on Monday. He was rushed there following his collapse at the publication party for his coming-of-middle-age novel, Stop Forgetting to Remember. Kurtz was among the wave of cartoonists who helped to redefine the medium of comics and ushered in an explosion of interest in the graphic novel. He was noted for drawing the world-famous “Ebony vs. Ivory” for Nuts magazine every month and for cofounding the political zine Bomb Shelter with his lifelong friend Saul Blockman. As an educator and lecturer, Kurtz has encouraged legions of aspiring cartoonists to avoid entering the field. He was a successful illustrator whose work appeared in numerous newspapers and magazines, but his heart belonged to cartooning until the end.Survived by his wife, Sandra B. Russ, and their only child.Of course, a laundry list of Walter Kurtz’s accomplishments barely scratches the surface of the cartoon character. Are professional details what define an alter ego?“Brilliantly insightful,” “Painfully hilarious,” and “Pow! Blam! Bang! Comics aren’t just for kids anymore!” are words I’ve heard to describe Walter Kurtz’s work.Yet I can’t keep from wondering whether this excessive praise comes from people who are ignorant of the medium’s capacity to address serious subject matter like parenting and masturbation. But jealousy aside, the truth is, I could never bring myself to delve as deep and reveal as many embarrassing details as he has bravely (?) done in this book. The idea of exposing one’s shameful history for all to see is beyond me, and frankly I’m still baffled by what motivates him. One can only imagine the discomfort this must have created for friends and family, most especially for his long-suffering wife, Sandra. My spouse would have killed me!But let me not end these flaps on a down note. I personally believe his self-immolation illuminates our understanding of the human condition and helps comics take another step closer to receiving the recognition they deserve as a serious art form. The best obituary that will ever be written about Walter Kurtz is the graphic novel you hold in your hands. He’s dug his own grave.",
  "genres": [
    "Graphic Novels",
    "Comics",
    "Memoir",
    "Nonfiction",
    "Biography",
    "Graphic Novels Comics",
    "Comic Book"
  ],
  "author": "Peter Kuper",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/1347507.Stop_Forgetting_to_Remember"
}