{
  "title": "Rooted in Danger",
  "description": "Behind the public façade of Blackthorne, Inc., a high-end private investigation company, lies a band of elite covert operatives, and they’re back doing what they do best.Foster (Fozzie) Mayhew, Blackthorne’s Intel Specialist, is cocky and arrogant, befitting his Aussie heritage. Put him in a helicopter with his surveillance instruments and he can spot the fleas on a squirrel's balls from five hundred feet. He’s happiest when he’s rescuing hostages, getting them to safety while Uncle Sam is still negotiating. But Fozzie's boss pulls him from the work he loves and sends him to locate Victoria Hamilton, estranged daughter of a rich client.Torie Stoker, born Victoria Hamilton, is hiding from her father who needs her at home and married. There's no love lost between Torie and her family. They shipped her off to a Swiss boarding school when she was thirteen, and at twenty-nine, she's never looked back. When her best friend, Kathy, dies, Torie settles in Oregon, determined to give meaning to Kathy’s death by continuing the botanist’s quest for rare plants with potential medical applications. When a man shows up with a gun, Torie realizes how badly her father must want her back.Fozzie wants nothing more than to locate his target, report to his boss, and get back to his real job. When he finds Torie being dragged away at gunpoint, his protective instincts kick in. Soon, they're racing to discover why her father sent armed men after her. Or could it have something to do with Kathy’s pharmaceutical research to cure orphan diseases? The answers threaten to change Torie’s life forever.Rooted in Danger, the third in the Blackthorne, Inc. series, starts on a tropical island, and things heat up from there. Rooted in Danger will keep readers turning pages as the stakes—and romance--escalate.",
  "genres": [
    "Romantic Suspense",
    "Suspense",
    "Contemporary Romance",
    "Military Fiction"
  ],
  "author": "Terry Odell",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/13477611-rooted-in-danger"
}