{
  "title": "The Competitive Advantage of Nations",
  "description": "Now beyond its eleventh printing and translated into twelve languages, Michael Porter’s The Competitive Advantage of Nations has changed completely our conception of how prosperity is created and sustained in the modern global economy. Porter’s groundbreaking study of international competitiveness has shaped national policy in countries around the world. It has also transformed thinking and action in states, cities, companies, and even entire regions such as Central America.Based on research in ten leading trading nations, The Competitive Advantage of Nations offers the first theory of competitiveness based on the causes of the productivity with which companies compete. Porter shows how traditional comparative advantages such as natural resources and pools of labor have been superseded as sources of prosperity, and how broad macroeconomic accounts of competitiveness are insufficient. The book introduces Porter’s “diamond,” a whole new way to understand the competitive position of a nation (or other locations) in global competition that is now an integral part of international business thinking. Porter's concept of “clusters,” or groups of interconnected firms, suppliers, related industries, and institutions that arise in particular locations, has become a new way for companies and governments to think about economies, assess the competitive advantage of locations, and set public policy.Even before publication of the book, Porter’s theory had guided national reassessments in New Zealand and elsewhere. His ideas and personal involvement have shaped strategy in countries as diverse as the Netherlands, Portugal, Taiwan, Costa Rica, and India, and regions such as Massachusetts, California, and the Basque country. Hundreds of cluster initiatives have flourished throughout the world. In an era of intensifying global competition, this pathbreaking book on the new wealth of nations has become the standard by which all future work must be measured.",
  "genres": [
    "Economics",
    "Business",
    "Nonfiction",
    "Management",
    "Politics",
    "History",
    "Finance"
  ],
  "author": "Michael E. Porter",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/134778.The_Competitive_Advantage_of_Nations"
}