{
  "title": "Future Tides: The Collected Works of Christopher Ruz",
  "description": "Lonely AIs, Peruvian parasites, graffiti activists and far-future memory swapping meet in Future Tides, a collection of all Christopher Ruz's short works from 2007 to 2011. Cyberpunk and space opera sit side by side with award-winning tales of heroin addiction and swords-and-sorcery fantasy in this 18 story, 60,000 word compilation. Future Tides includes three previous collections - PAST THE BORDERS, THE KING & OTHER STORIES, and NOTHING TOO DANGEROUS - as well as an exclusive scifi FRONT PAGE CAPTION.In THE ANT TOWER, Parkin, a soldier-turned-mercenary, has been hired by the King's Magician to accompany him on a long journey into the great western desert, in search of an ancient and powerful artifact. After years spent battling the heathens in the frozen north, Parkin is glad for an easy contract. But there's more to fear in the desert than thirst, and as Parkin's comrades fall one by one, he's forced to ask - what does the Magician really want from him? And what evil has taken root in the rock mound known as the Ant Tower?In THE KING, Derek and his misanthropic friends are competing to find enlightenment through misery. But Derek isn't playing by the rules. He has a plan that'll make him the idol of his all friends, as well as get him back into Sylvia's pants. All he has to do is quit heroin while they all watch. Except, Derek has never used heroin. And so begins the greatest lie of his life... a lie that might be too big to back away from...In THE LAST BROADCAST, the colony ship known as the Vale has been spiralling towards Epsilon Eridani for four millennia, and Barry - the semi-sentient AI set to guard its frozen human cargo - has had a long time to question nature of his mission. There are too many gaps in his code, too many mistakes left unfixed. Could Barry's programmers really have been so lax? Or does he have a greater purpose, some secret mission buried in his source code? He has another eighteen thousand years to find the answer. In the meantime, he's growing bored, and idle hands are the devil's playthings...And in THEY TRADE IN EYES, Alicia is faced with a terrible decision. To get any sort of job in the future economy requires new eyes - cobalt plated units with laser-blue irises, that can interpret petabytes of data at a glance, that record every moment of your life. Can she bring herself to go under the knife, and trade in her old fleshsacks for new units? And can she evade the street-dealers who steal and resell eyes to fill the new market in memory-trading? Business is business. Someone has to make a killing. Trade In EyesNo ExitWhispersThe Hard SellThe Aliens Came AlphabeticallyNever Old Enough To KnowThe Ant TowerOccupiedBack To CivilisationThe KingFront Page CaptionEight Ways From TomorrowAn Unknown HungerThe Last BroadcastWhat You Bring BackBlack RainLong Way HomeHercule And The Doctor",
  "genres": [],
  "author": "Christopher Ruz",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/13480612-future-tides"
}