{
  "title": "Through Dagus's Eyes",
  "description": "Dagus Whitton is tired of being controlled. After his brother Drake moved in with his shifter mate, Dagus had felt a great sense of accomplishment from finally living on his own, especially considering his blindness. But that was before being kidnapped by scientists bent on using him as a bargaining chip against the shifters living in the area. Now he struggles being alone, but hates always having someone watching over him. He’d had his life neatly in hand and just wants to get that feeling of contentment back. Discovering a mate has its pros and cons, and Dagus isn’t certain he’s ready for more drama.Brad Nadeau never thought he’d find a mate, since his homophobic father filled his head with the belief that Fate didn’t grant them to gay shifters. When his biker gang walks into a gay bar in Colin City for a night of fun, Brad’s world is turned upside-down. Not only does he find his mate, but he discovers that the guy is human, blind, and already knows about shifters. That should make claiming Dagus easy, right? Except accepting his mate means Brad will have to leave the only family he’s known for the last thirty-seven years, his motorcycle gang. When his leader tells him that the gang needs to move out in less than forty-eight hours to search for a missing member, Brad is faced with an important choice, and not much time to make it in. Learning that the local wolf pack is experiencing dangerous unrest due to several members not liking all the other shifter breeds in the area doesn’t make his choice any easier. Is Brad ready to face down shifters like his father to start a whole new life with a mate he isn’t certain wants his brand of care?",
  "genres": [
    "M M Romance",
    "Shapeshifters",
    "Paranormal",
    "Romance",
    "Disability",
    "Fantasy",
    "Paranormal Romance"
  ],
  "author": "Charlie Richards",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/13481046-through-dagus-s-eyes"
}