{
  "title": "Dam Busters: The True Story of the Legendary Raid on the Ruhr",
  "description": "Product Description The night of May 16th, 1943. Nineteen specially adapted Lancaster bombers take off from RAF Scampton in Lincolnshire, each with a huge 9,000lb cylindrical bomb strapped underneath it. Their to destroy three dams deep within the German heartland, which provide the lifeblood to the industries supplying the Third Reich's war machine. From the outset it was an almost impossible task, a suicide to fly low and at night in formationover many miles of enemy-occupied territory at the very limit of the Lancasters' capacity, and drop a new weapon that had never been tried operationally before from a precise height of just sixty feet from the water at some of the most heavily defended targets in Germany. More than that, the entire operation had to be put together in less than ten weeks. When visionary aviation engineer Barnes Wallis's concept of the bouncing bomb was green lighted, he hadn't even drawn up his plans for the weapon that was to smash the dams. What followed was an incredible race against time, which, despite numerous setbacks and against huge odds, became one of the most successful and game-changing bombing raids of all time. About the Author James Holland was born in Salisbury, Wiltshire, and studied history at Durham University. A member of the British Commission for Military History and the Guild of Battlefield Guides, he also regularly contributes reviews and articles in national newspapers and magazines and appears on national radio. His books include Fortress Malta, Italy's Sorrow, The Battle of Britain and his fictional WW2 series featuring Sergeant Jack Tanner. He has also made acclaimed television programmes on the Battle of Britain and the Dambusters raid for BBC. His many interviews with veterans of the Second World War are available at the Imperial War Museum and are also archived on www.secondworldwarforum.com.",
  "genres": [
    "History",
    "Nonfiction",
    "World War II",
    "Military History",
    "Aviation",
    "War",
    "Military Fiction"
  ],
  "author": "James  Holland",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/13481463-dam-busters"
}