{
  "title": "Starlight",
  "description": "This 1st print edition is supplanted by the Revised 2nd print edition, which incorporates the material previously published as The Best of Pact Arcanum 3.5 , available   amazon.com/Starlight-Pact-Arcanum-Vol...The Wanderer Earth 2142. A century has passed since his father's death, and Antonio Jameson has returned home to pay his respects to a man he never had a chance to know, but has always resented.  Captain of the Jumpvessel Singularity, he has spent his entire adult life navigating the void between the stars, blissfully avoiding any part of the fate that the higher powers had decreed for him in the war between the White Wind and the Red. But in a world where immortality is commonplace, death is not always what it seems, and destiny is not so easily cast aside. The Mentor In memory of his love for Tobias, Rafael became Antonio's closest friend and ally, supporting his protégé's advancement in the Spacer Guild despite the deep disapproval of Antonio's family.  Both Spacers have their secrets, however, and nothing stays buried forever. Will the truth set them free, or tear them apart? The Inquisitor Razheel has served the Court of Shadows faithfully for over a century.  As Night's Herald, the spymaster was required to give up her own identity without openly taking sides in the divide between The Court's Nightwalker and Daywalker factions.  Now, after thirty thousand years of war, something new walks the Earth, which may be the greatest weapon yet in the war between the races.  As Antonio's fate becomes clear, she steps seamlessly into the role of revolutionary, and all of her carefully laid plans rise to fruition. The war comes full circle, and one woman's actions may set her entire race on the path to salvation, or lead it to extinction.",
  "genres": [
    "M M Romance",
    "Vampires",
    "Science Fiction",
    "Fantasy",
    "Paranormal",
    "M M M",
    "Romance"
  ],
  "author": "Arshad Ahsanuddin",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/13481375-starlight"
}