{
  "title": "Chronique du Règne de Charles IX",
  "description": "En 1572, durant une courte période de paix des guerres de religion, Bernard de Mergy, jeune noble protestant, se rend à Paris pour se mettre aux ordres de Coligny. Il y retrouve son frère, George, converti au catholicisme.Amoureux d'une noble catholique, Diane de Turgis, Bernard tente de la séduire et de conquérir l'estime du roi. Mais il ne peut faire oublier sa religion, dans cette époque d'intolérance.Pour les beaux yeux de Diane, il se bat en duel et tue son rival, Comminges. Blessé, il est soigné par Ambroise Paré. Il est ensuite caché par une sorcière à qui Diane fait dire une messe blanche pour son rétablissement. Mais Diane, qui est très dévote, veut à tout prix le convertir.Au hasard d'une rue, il échappe de justesse à des catholiques. Et il se trouve fort heureusement chez Diane pendant le massacre de la Saint-Barthélemy. Cette nuit-là, Diane tente une nouvelle fois, mais en vain, de le convertir. Déguisé en moine, Bernard fuit Paris.George, de son côté, a refusé d’abattre Coligny, puis de prendre part au massacre. Il est emprisonné. Libéré sur ordre du frère du roi, il participe au siège de La Rochelle, ville dans laquelle Bernard a trouvé refuge.Bernard, qui combat sous les ordres de La Noue, tend une embuscade à un groupe de cavaliers menés par un capitaine en qui il ne reconnaît pas son frère. Il ordonne à ses arquebusiers de ne pas manquer le capitaine. George est grièvement blessé. Il meurt stoïquement, refusant l’assistance d’un moine et d’un ministre de la religion réformée qui se disputent impudemment son âme.Quant à savoir si Bernard va se consoler et si Diane va prendre un autre amant, l’auteur laisse au lecteur le soin d’en décider.",
  "genres": [
    "France",
    "Historical Fiction",
    "Classics",
    "Fiction",
    "French Literature",
    "Historical",
    "Religion"
  ],
  "author": "Prosper Mérimée",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/13483025-chronique-du-r-gne-de-charles-ix"
}