{
  "title": "Think Like a Cat: How to Raise a Well-Adjusted Cat—Not a Sour Puss",
  "description": "Pam Johnson-Bennett, feline behaviorist, shows you that by \"understanding your cat's motivations, needs and communication\" you can modify and prevent behavior problems, avoid common mistakes made by both novice and experienced owners, and ultimately continue to enrich and enjoy a relationship \"in which you are unconditionally loved, endlessly forgiven for your mistakes, never judged, and constantly entertained.\"How can you have a great relationship with your cat? \"If your impression of cat ownership involves filling up a food bowl and putting a litter box in the extra bathroom, then both you and your cat will soon be very unhappy.\" Some people might get a cat because they think that a cat will be less trouble than a dog. Let's face it, comparing cats and dogs is like, well, like comparing apples and oranges. They are different, and they have different needs. A dog is a pack animal that needs a leader. By nature a dog expects to get rubbed and wrestled with. Dogs like to horse around. A cat does not. A cat is a solitary predator and needs its space. But what both cats and dogs do need is your love and attention. Just because a cat is, by nature, independent doesn't mean that he or she doesn't need your praise or physical affection. There are a lot of myths about cats -- like the one above -- that lead to their mistreatment. By learning more about what makes a cat a cat, you will be better able to give your feline the space, care, and love that he or she needs. And this sentiment couldn't be truer when it comes to training your cat. Hitting or yelling at your cat when he scratches his claws on your nice new couch just doesn't make sense. Your cat is only being a cat. He needs to scratch his nails so they can stay healthy and strong. Also, scratching helps a cat relieve stress and relax. Imagine being yelled at and hit for sprawling out on the couch with a magazine and a glass of nice red wine after a long day's work. You must align your training expectations with your cat's needs if you want to have a happy, well-trained cat. Johnson-Bennett advises you to \"get on her level emotionally, physically, and mentally in order to map out an effective training plan.\" She outlines three basic methods for training: positive reinforcement (rewarding kitty for good behavior), remote control (spraying kitty with a water gun when she jumps on the kitchen counter), and redirection (getting kitty to scratch on a scratching post instead of your expensive couch). By using these training methods in the first place, you will get a head start in establishing good behavior, and in the process you and your cat will become closer.If you want to learn more about your cat and what you can do to strengthen and enjoy your relationship with each other, then Think Like a Cat should really be on your reading list. From years of experience as a vet technician and as an adoring cat owner, Johnson-Bennett knows her stuff. And she covers it all in this book -- from grooming, training, health, and nutrition to emergency care, games, and toys. So get ready to hear a lot more purring around the house!Jen Forman",
  "genres": [
    "Nonfiction",
    "Cats",
    "Animals",
    "Reference",
    "How To",
    "Self Help",
    "Science"
  ],
  "author": "Miriam M. Gonzalez Hernandez",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/13484.Think_Like_a_Cat"
}