{
  "title": "Bones: The Complete Apocalypse Saga",
  "description": "When mankind is visited by Three Great Apocalypses, the only thing standing in their way is a feckless but loyal, easily distracted yet occasionally ferocious German shepherd named Bones, a one-time cadaver dog with the Pittsburgh Bureau of Police. This is his story.In BONES, our hero must battle a plague of dangerous parasites that brings the dead back to life with the goal of destroying the planet. SHEPHERD finds Bones delivered to earthquake-devastated Los Angeles to hunt for survivors only to run afoul of armies of rage-driven rats and birds emerging from the rubble. And when mankind reaches its final hour and a pocket of surviving Indians are all that's left of humanity, it falls on Bones to save the species before civilization is wiped out forever in ALPHA.Three Apocalyptic novellas of nature run amok, three interwoven stories that feature a German shepherd at the center of the things, three stories with so much action you might just explode reading them.Includes prequel short story, MONGREL.Praise for Wheaton's FOUR NAILS IN THE \"Remarkably character-driven...Wheaton convincingly showcases his talents as a writer of horror prose, taking his time to craft characters who are thoroughly fleshed out and engaging without holding off too long on the suspense...proves here to be a quite gifted storyteller undeniably worthy of an interested reader's time and attention.\" - Michael Compton, Fangoria\"Genuinely twisted and engrossing...may just leave you shaken for days.\" - Jessa Sobczuk, Rue Morgue [referring to Sunday Billy Sunday]\"This is muscular, original fiction that marks the debut of an exciting new voice in the speculative/dark fantasy genre.\" - Michael Rowe, editor of the Queer Fear anthology series and co-author of Triptych of Terror\"His tales are visceral, intellectual, and often grisly, but Wheaton never forgets that touch of humanity and wry humor which allow true horror to cut that much deeper to the bone.\" - Ken Plume, author, There's a Zombie In My Treehouse\"Wheaton's writing is haunting. Days, weeks, even months later, you will find your mind returning to his worlds. Stephen King is no longer my only addiction.\" - Todd Farmer, screenwriter, Drive Angry\"Four Nails in the Coffin is a shotgun blast to the brain. In a good way.\" - Gary Dauberman, screenwriter, Swamp Devil",
  "genres": [
    "Horror",
    "Zombies",
    "Post Apocalyptic",
    "Thriller",
    "Paranormal",
    "Fiction",
    "Apocalyptic"
  ],
  "author": "Mark  Wheaton",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/13483975-bones"
}