{
  "title": "Ascension",
  "description": "THIS NOVEL IS NOT YET PROOFREADIt's all fun and games until she starts playing.Daniel 'Jerry' Jericho is a your average teenager. Outgoing, curious, smart, friendly, likes cars, rock music, movies, drinks, smokes, is moody at times, a few parental issues, girl troubles, has supernatural blood, decapitates monsters in his spare time...you know, the usual.Its been three months since he found out that vampires, werewolves, ghosts, witches and pretty much every other horrible thing you've ever dreamt about are real. That was around about the same time he decided he was going to protect as many people as he could from them.Backed by his best friend Goose, his uncle Joe, the vampire vixen sisters, Cass and Claire, the annoyingly mature fourteen year old psychic Rachel and the peaceful super-vamp Sophinia, Jerry is going to school during the day and hunting evil at night all the while desperately searching for answers about his unnatural blood.When large groups of supernatural creatures that were targeting him start getting massacred without warning, Jerry thinks it's possible that he may have an ally out there protecting him.Unbelievably powerful, undeniably intelligent and indescribably beautiful, Aria isn't just an ally, she's every teenage guys greatest fantasy. Not to mention the fact that she has a thirty foot wing span. And when she offers Jerry protection and answers to all the questions that have plagued him since this began, he thinks his dreams have come true.So why are his instincts telling him that this woman is more dangerous than anything any of them have ever seen before? Most preternatural creatures just want to eat people.Aria wants to play...and this is a game like no other.Start playing and start praying. Let the games begin.2/8 of the Blood Heavy series.WARNING: This novel contains strong language and violence throughout.",
  "genres": [
    "Urban Fantasy",
    "Young Adult",
    "Vampires",
    "Paranormal"
  ],
  "author": "S.L.J. Shortt",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/13483824-ascension"
}