{
  "title": "Fairy Tale Flirts 5 Romantic Short Stories",
  "description": "Five modern takes on classic fairy tales, and the only magic is the real-life kind. Each sweet, funny, romantic short story is 10,000-13,000 words in length. The stories can be read separately, but are linked together in the collection, and wrap up in the perfect happily ever after. Stories include:“Cindi” 13,000 wordsCindi wants a perfect match—of designer shoes, that is. When her stepmother gets tickets to the Jiminy Shoes trunk sale, it looks like her dreams are coming true. Until her stepmother refuses to bring her along. With a little luck, Cindi finds herself at the sale with the shoes of her dreams, and a handsome man to boot. But when she dashes off with one of the pricey shoes by mistake, her life changes forever.“Red” 10,000 wordsWhen Rose brings her Grandmother leftover goodies from her floundering health-food bakery, she realizes she has bigger problems than Grandma’s daily fiber intake—a hot, young man is prowling around her rich Granny’s apartment. Jack Wolff seems to be preying on elderly women, but despite Rose’s protests, Granny’s not willing to give him up. And the nerve of him, Jack’s hitting on Rose, too. Can Rose save her business and her Grandma’s heart before it’s too late?“Belle” 11,000 wordsBelle’s father is sidelined by a stroke, and she’s determined to save his job as a master carpenter for the mysterious Prince Maxim. Despite her training, completing work on the Prince’s library is harder than she imagined, with the elusive prince watching her every move from the shadows. Belle’s intrigued by the intelligent, kind man who won’t let himself be seen. Is Belle the one to help him move beyond his painful past?“Snow” 11,000 wordsShawna White wants nothing more than to land a role in a musical, but she’s running out of cash while she chases her dream. Her stepmother, Veronica Midas, suggests she take a nanny job for the rich man she’s trying to land, and Shawna finds herself in charge of seven kids. But Veronica didn’t realize Shawna would be living there, enchanting Jeremy and his children. Now Veronica will do whatever it takes to win her man.“Goldie” 12,000 wordsGoldie Lockston isn’t exactly homeless; she’s just a struggling artist who crashes with friends. When her pal asks her to take over vacation dog-sitting duties for a wealthy client in Grimm Towers, Goldie decides it wouldn’t hurt to move in for the week. But she wasn’t counting on being discovered when Blake Behr comes home early. Or posing as his girlfriend. Or having feelings for this grumpy, wealthy lawyer who’s unlike her in every way.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Short Stories",
    "Fantasy",
    "Fairy Tales",
    "Anthologies"
  ],
  "author": "Lisa  Scott",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/13484904-fairy-tale-flirts-5-romantic-short-stories"
}