{
  "title": "هموم القلب",
  "description": "\"تجرفك الحياة بقوة أحياناً، وحتى لو كنت تحب شخصاً، لا تستطيع العثور على طريقك إليه مجدداً\". بهذه العبارة يمكن لنا أن نكتشف \"هموم القلب\" رائعة سيدة الرواية الأميركية المعاصرة \"دانيال ستيل\" التي ترجمت رواياتها إلى أكثر من 28 لغة، وتصدرت قائمة الكتب الأكثر مبيعاً حسب النيويورك تايمز؛ وتحولت أكثر من 28 رواية من رواياتها إلى أعمال تلفزيونية ناجحة. بكثير من الواقعية وبمزيج من الرومانسية، وبأسلوب أدبي على غاية من الرهافة تعالج الروائية مشكلة عاطفية بحتة؛ تتناول فيها حياة امرأة طموحة وموهوبة تعمل مصورة فوتوغرافية أمضت كل حياتها كمراقبة؛ مؤرخة للوضع البشري، في بداية الرواية اعتُبرت \"هوب دان\" شخصاً غير منظور تقريباً وهي، في نواح أخرى، إنسانة هائلة صاحبة ضوء داخلي وقوة قادرين على ملء مساحة كبيرة. تعيش هذه المرأة قصة حب مفعمة مع زوجها \"بول فورست\" يعمل جراحاً وأستاذاً في هارفارد وكانت علاقتهما شغوفة وقوية، إلى أن يقع الزوج فريسة مرض \"باركنسون\" فأصيب بالارتعاش وفقد قدرته على الحياة بشكل طبيعي، فيقرر طلاقها، على الرغم من الحب الذي جمعهما، ولكنه، لا يريدها أن تبقى بقربه وهو ينتظر موته فهي تستحق حياة أفضل برأيه. بعد طلاقها بدت امرأة مستقلة جداً وعاشت حياة هادئة ومنعزلة لسنوات عدة، تبدو ماهرة في إبقاء نفسها مشغولة، فهي تلتقط صوراً في شوارع هارلم ليلة الميلاد، وتصور في مقهى سائقي الشاحنات في الجادة العاشرة عند الرابعة فجراً وهذا ما تفعله، وهكذا تحب تمضية وقتها. تتوالى الأحداث إلى أن يُعرض عليها تصوير \"فين أونيل\" أرستقراطي إيرلندي حاصل على شهادة الدكتوراه من أوكسفورد، ونال الوسام البريطاني بعدما فاز بجائزة الكتاب الوطنية في أميركا عن فئة القصص الخيالية، وهو شخصية مثيرة جداً، وهنا تأخذ حياة \"هوب دان\" طريقاً إلى التغيير، عندما تلتقي بـ \"فين أونيل\" حيث يطلب منها تصويره بهدف وضع الصورة على غلاف كتابه الجديد فأخبرته عن الكثير من حياتها مع \"بول\" وطلاقها وبدت له امرأة حنونة وودودة وفي الوقت نفسه امرأة غامضة بالنسبة إليه، وبقيت الأسئلة دون أجوبة \"إنهما شخصان معتادان على النظر إلى قلوب الأشخاص الآخرين، لكنهما حيّرا بعضهما بعضاً\". قال لها \"استمتعت بالتحدث إليك. أنا مفتون بعينيك وبالغموض الكبير الذي رأيته فيهما. أتمنى أن نلتقي مجدداً قريباً...\". أما هي فشعرت أن \"لديهما العديد من الاهتمامات المتشابهة. لو حضرت لائحة بكل شيء تريده من رجل، لوجدت أن فين يملك كل شيء (...) كل ما تذكرته لاحقاً هو فين يقبلها، والشعور بأمان كبير بين ذراعيه، ورغبة في عدم انتهاء القبلة أبداً، وفيما نظرت إلى عينيه بذهول بعد ذلك، أدركت أنها تقع في غرامه هي الأخرى. إنها البداية المثالية لسنة جديدة. وربما لحياة جديدة\". فهل تتوقف الأمور عند هذا الحد أم أن هنالك مفاجآت أخرى تنتظر قلب هذه المرأة، حيث بدت وكأنها تحمل طفلاً في أحشائها...! هذا ما سوف نكتشفه معاً عند قراءتنا لهذه الرواية الممتعة والشيقة البعيدة عن التكلف، والتي تكشف فيها \"دانيال ستيل\" عن ذلك الجانب الخفي في تكوين النفس البشرية، تلك المسافة ما بين حب ماضٍ وحب آتٍ في حياة كل إنسان حيث يقول المثل الصيني \"كان ذلك آنذاك، والآن هو هذا\".",
  "genres": [
    "Romance",
    "Fiction",
    "Chick Lit",
    "Contemporary",
    "Novels",
    "Mystery",
    "Suspense"
  ],
  "author": "Danielle Steel",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/13485038"
}