{
  "title": "Open Heart",
  "description": "Meet ordinary teens with extraordinary powers in the award-winning  Farsighted Series .Plus-sized Simmi Shergill doesn't need to use her gift of psychic feeling to lure Alex and Dax into falling for her; they do that on their own. Choosing between the blind seer who loves her and the charming telekinetic with \"bad idea\" written all over him won't be easy--especially while trying to survive high school.Evolved Publishing presents the second in a 5-part series,  Farsighted , by award-winning author Emlyn Chand. YA / ROMANCE / PARANORMAL / FANTASYSimmi Shergill's life is a mess. Her powers of psychic feeling are on the fritz, and Grandon Township's sudden population boom has brought quite a few unsavory characters to town. She also looks like an over-blown balloon in her size 14 pants, but not even starving herself seems to be helping.At least she has Alex, the boyfriend who loves her so much he'd do anything for her. Last summer, he even risked his life to protect her from the mysterious boy everyone was convinced wanted to kill her.Just one she's not so sure she feels the same way. Is Alex really the man of her dreams? Why can't she stop fixating on her would-be killer, Dax? Part of her wants to run screaming in the other direction whenever Dax is around, while the other part longs to run into his embrace, no matter whom she'd hurt or what she'd risk.Simmi's loyalty is on the line. Whom will she choose--the blind seer who loves her, or the charming telekinetic with \"bad idea\" written all over him? Emotions run high in the tension-packed book two of the \"Farsighted\" series.Praise for  Farsighted :\"Chand's characters are compelling and diverse... Shapri is a standout.\" - Kirkus Reviews \"A showdown...brings the novel to a surreal and...suspenseful close.\" - Publisher's Weekly \"A suspenseful and spellbinding mystery that grips you from the very start.\" - IndieReader \"A paranormal story line vastly different from the many offerings of vampires, fae and elves... Right away I liked Farsighted\" - Tracy Riva for Midwest Book Reviews \"Alex Kosmitoras might not have a magic wand or vampiric strength and speed, but he is a totally swoon-worthy hero that any mom would be proud to let her daughter date.\" - Melissa Luznicky Garrett, author of Turning Point \"You don't have to be psychic to know that Farsighted is going to take the world by storm. Vampires are so last year.\" - Kimberly Kinrade, author of Forbidden Mind \"I read the book in one sitting... the ONLY other time I have done this is when I read the Harry Potter series.\" - Marie Bothwick, blogger at Write Panic Live",
  "genres": [
    "Young Adult",
    "Paranormal",
    "Fantasy",
    "Urban Fantasy",
    "Romance"
  ],
  "author": "Emlyn Chand",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/13485266-open-heart"
}