{
  "title": "Gabriel's Revenge",
  "description": "Turning to check on Abby, I saw that she looked frozen, transfixed at the sight of the fire, in shock. My heart stopped as I saw a line of fire heading from the outside wall directly at Abby!Running quickly the two steps to get to her, I quickly wrapped my arms around Abby’s waist and swing around in a half circle, narrowly escaping the fire as it passed. Reaching the center of the room, it branched out left and right while the original fire continued farther for a short distance.When it stopped, there was a cross burning in the middle of the floor, our final message from the monk!“Bastard,” I repeated again under my breath. Looking at Abby, she seemed to have regained her senses as she looked around at our quickly deteriorating situation. The room was rapidly being devoured by the fire, and the smoke was already choking us to tears.Seeing a chair burning against the wall, I grabbed it and ran toward the outer wall, flinging it through the curtained windows at the last second. The shattering of glass met my ears, as well as welcome air, although it promptly hiked up the level of fire and heat.Grabbing Abby’s hand, I yelled “One chance kid, let’s do this!”We both start running toward the wide window, the curtains blocking it now burning at full intensity. Jumping through blindly, I said a quick prayer as our bodies were propelled through the burning fabric… into nothingness.JT Lewis is the author of the new YA series, Pepper and Longstreet, exciting mysteries that hearken back to the old Hardy Boys and Nancy Drew mystery series./Here is what others have said about “Gabriel’s Revenge”! The action was intense and sure to hook you from the first page. This is a compelling, tightly woven mystery that is sure to please any reader. Do not miss this story. JT Lewis has penned a fascinating tale about an intriguing character in a non-stop, pulse pounding, read. A real winner! Alexandria WeisGabriel's Revenge is the brilliant sequel to Murder! Too Close to Home. JT Lewis brings us the further adventures of his multifaceted character Gabriel Celtic in yet another complex murder mystery that is sure to have you hooked from page one. This is a series that has something for everyone - you will NOT be disappointed!Garden Summerland",
  "genres": [
    "Mystery",
    "Adventure"
  ],
  "author": "J.T. Lewis",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/13485465-gabriel-s-revenge"
}