{
  "title": "Heart Stopper",
  "description": "ASIN B0076MERG8 moved to the most recent edition hereWhat keeps your heart beating..? It could stop at any moment. Think about it.. Are you worried..?Dr. PRIYA JOSEPH is an Irish-Indian coder working at a new pacemaker clinic in Galway, a small city on the west coast of Ireland that is a research and manufacturing hub within the multi-billion-dollar medical devices industry. Priya’s life is already off the rails; in fact, the train has disappeared screaming into a ravine when, after a night out that she does not remember apart from a vague memory of being with a mysterious woman, she wakes up in an unfamiliar apartment and finds the dead body of her boss, American cardiologist and inventor, Dr Daniel Fairer III. Priya is dragged by his family into an investigation of Daniel’s death. As they uncover secrets about the groundbreaking pacemaker technology that Daniel and his research partners developed and the wireless controllers that communicate with the implanted pacemakers, their investigation threatens a multi-million dollar enterprise. Priya learns that she has unwittingly been involved in research that could have consequences far beyond the small city where she has been trying to hide from her life. She discovers that her past is not what she thought it was and now that she actually wants a future, she may not survive long enough as she is being pursued her and her pursuers will do whatever it takes to complete their mission but time is running out. And they have a problem. Which they need Priya to solve.Heart Stopper is an unusual and exciting novel that breaks barriers between genres. It is a medical thriller, a murder mystery, and a love story, but it is so much more than any one of those.",
  "genres": [
    "Mystery",
    "Medical",
    "Lesbian",
    "Crime",
    "Thriller",
    "LGBT"
  ],
  "author": "R.J. Samuel",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/13485769-heart-stopper"
}