{
  "title": "Sweet, Decadent Fire",
  "description": "She was on fire for him …Every inch of her flesh screamed for moreHe looked at her as if she were his world. When he pressed his lips against the corner of her mouth, she felt and heard a low growl rumble deep in his chest. The sound of it wrapped around her body and gently pulsated over her flesh in ways that made her feel delicious, intoxicating sensations she’d never even imagined experiencing.Rising onto the very tips of her toes, she slipped her arms around his neck and then, without any other thought than needing to get closer to him, she arched her body into his. He gently teased her lips with his, and then he kissed his way to her neck. She let the pleasure take her, let it wipe out all thought other than his hands and hot lips moving over her flesh.She was fully clothed, but his hands wandering, massaging, caressing every inch of her body, felt as if they were touching her bare flesh, wreaking such glorious havoc that her breaths were coming in short, ragged gasps.She felt something dark, powerful, and dominating shift inside him. It didn’t frighten her at all. In fact, it excited her. She moved her body against his as his teeth scraped her neck and his tongue soothed the sting. His hand gripped her thigh and lifted her leg to wrap it around his thigh. The feeling of her hot, throbbing core pressing against his was so unexpectedly erotic it nearly caused her to climax. Moist, beckoning heat gathered, pooled between her legs. She felt so empty, so needy.She ached to feel the weight of his body on top of hers. She ached for him to fill her.By the time he took possession of her mouth and his tongue parted her lips, she had completely forgotten that they were standing on a busy sidewalk. He wasn’t simply kissing her. His lips, his tongue, his hands were making love to her, worshipping her. The hot, passionate desire he displayed as he feasted her on mouth was the single most extraordinarily sensual experience she’d ever imagined. And she’d imagined many.On a breeze of hot, sensual bliss, she was soaring so incredibly high. She was on fire for him. Her entire body was so entirely aroused. Every inch of her flesh screamed for more. She wanted more. She needed so much more from him.Then, he went completely still. His arms briefly tightened around her, nearly crushing her to him. She felt deep, terrible anguish. She felt regret. Every muscle in her body tensed. She felt anger and frustration. But they weren’t hers. Somehow she knew the emotions belonged to him. She felt them for only a few seconds before he released her and took a step back.“I’m sorry.” She saw a mixture of pain and love in his eyes when he reached out for her as to take her in arms again, but then he stopped. “I shouldn’t have kissed you.” His arms folded behind his back, he looked down at her hand for a few seconds. And then, his expression void of any emotion, he met her gaze. He held out his hand for her. When she didn’t take it, he took her hand and led her into the restaurant.She could feel her heart racing. A kiss? It was only a kiss to him? In a state of shock, she followed his lead. To her it had been so much more than a kiss. If they’d continued, she would have … oh, God. It wasn’t just a kiss to her. It was so much more. It was a magical moment of … of sweet, decadent fires of desire merging.",
  "genres": [
    "Paranormal",
    "Paranormal Romance",
    "Vampires",
    "Romance",
    "Erotica",
    "Demons",
    "Short Stories"
  ],
  "author": "Candice Stauffer",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/13486630-sweet-decadent-fire"
}