{
  "title": "The Plaza",
  "description": "Plaza-in Mexican culture, a slang word describing the territory of a certain cartel.\"I've been a reporter for years, and a resident of Juarez, Mexico all of my life. I've never seen anything like it. No one thought the drug war would be like this...My town has become the battleground for drug cartels. Even the police are being killed on a daily basis. Bands of teenagers working as paid assassins & extortionists are hitting every business, no matter how small. Things I took for granted like going to a restaurant, getting a haircut, or even an evening at the movies with my family put all our lives in danger. Robberies and public executions have become common place. Now when I report only five homicides in twenty-four hours, it is considered a good day.\" - Saul Saavedra, crime reporter for The Juarez Daily in THE PLAZA.Saul Saavedra is a crime reporter for the Juarez Daily newspaper. In just a year’s time he saw his city change from decent place to live and work to a crime-infested inferno. He reports the happenings in a city that is experiencing total social decay and writes against the government that at best does nothing about it. Two major drug cartels battle it out in Juarez and Saul soon finds himself in the crossfire between La Linea and the Sinaloa Cartel.Guns for hire are a dime a dozen in a war among cartels, but Felipe stands out as one of the best. His only love is for money, or so he believes, until he meets a beautiful young prostitute named Ruby. As he rises in the ranks of La Linea his relationship with Ruby changes as well, and soon he learns that she too has a taste for blood.Thousands of Mexicans are deported to Mexico every year, Juarez being a dumping ground for many. Some are convicts that have spent years in federal prison and now have lost their status as residents. Juan, a psychopathic killer, is given the option to return to Mexico or finish out his sentence in the federal penitentiary. For him the choice is obvious and he soon finds himself at home in violent Juarez and finds work in the Sinaloa Cartel.Based on true events in the city of Juarez, The Plaza is about the people, the government and the cartels that make up both the innocent victims and the criminals that are the pawns in the drug war of Mexico.",
  "genres": [
    "True Crime"
  ],
  "author": "Guillermo Paxton",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/13486973-the-plaza"
}