{
  "title": "How to Build a Fortune [With CD-ROM with Workbook and Trump Cards and DVD]",
  "description": "Learn from a true master of wealth how to create your own personal fortune! Donald Trump is a self-made multi-billionaire and acclaimed TV star, so he knows more than most about what it takes to build a fortune. Here for the first time, \"The Donald\" teaches a complete eight-week course on how to get rich. More than great tips and tactics, he gives you a total, step-by-step program for transforming your financial future, Trump-style. First, get the big picture from the world's most famous businessman in an exclusive, in-depth DVD interview devoted to one topic: how to create wealth. Then, hear more detail from Donald Trump in an exciting hour-long audio recording of a live seminar. Next, listen to his team of six handpicked experts, introducing the foundation for wealth creation. This compelling video and audio material is just the beginning. On the accompanying CD-ROM you also get an exciting, richly detailed workbook with precise action steps that transform Donald Trump's powerful knowledge into real-world results. And that's not all! Your purchase of this unique audio business course entitles you to a full 12-month FREE online course in wealth creation at TrumpUniversity.com, taught by Donald Trump and his mastermind team. With additional teleseminars, ongoing discussions, and special reports from Donald Trump, this course alone is worth the price of the product. Included with the product: \n\n   DVD - Donald Trump Speaks  \n   Audio CD - The Trump Way To Wealth  \n   Audio CD - Wealth Masterminds  \n   Bonus CD-ROM with:  \n \n\n\n   Interactive Workbook of Eight Action Steps from Donald Trump including: \"The Power to Make Money, Getting Where You Want by Acting as If,\" and \"The Mindset to Aim High\"  \n   Three Special Reports from Donald Trump: How the Rich Get Rich, Negotiate to Win, and Wealth: The Inside Story  \n   Bonus report on the Active Learning System from Dr. Stephanie Burns, Seven Steps to Boost Your Learning 12-Month FREE Online Program in wealth creation at TrumpUniversity.com  \n   Including teleseminars, discussion forum, and special reports from Donald Trump and his team of masterminds.",
  "genres": [],
  "author": "Donald J. Trump",
  "average_rating": "2.97",
  "url": "https://www.goodreads.com/book/show/1039.How_to_Build_a_Fortune_With_CD_ROM_with_Workbook_and_Trump_Cards_and_DVD_"
}