{
  "title": "Apocalypse Island",
  "description": "This is an alternate cover edition for ASIN: B0072ZB8DYA small Maine city has turned into a killing ground.Is it a serial killer, someone with a penchant for the macabre and a need to destroy?Or is it a darker force, an ancient legend from a mysterious Island come ashore to wreak havoc upon the unsuspecting?Amid the backdrop of Portland’s burgeoning night scene, Police Lieutenant Rick Jennings discovers that no one is safe, and that evil has many faces.Extended Description:Danny Wolf, a gifted musician with alcohol problems is witnessing brutal murder in his dreams. Someone is carving a cross on each of the young female victims before crucifying them.Newly released from prison for a crime he did not commit, Wolf is having trouble adjusting to civilian life. He believes the dreams are a symptom of his adjustment until he discovers that they are real and that the victims are his own groupies. He soon begins to doubt his sanity. Could he be a homicidal madman?Wolf has no memory of his early childhood but discovers that he spent his first eight years in a Catholic orphanage on a mysterious island off the coast of Maine. Is it possible that his early life and the murders are somehow connected?Soon the killings become more bold and gruesome, as members of the church begin to die.Enter Police Lieutenant Rick Jennings and his young assistant Laura Higgins. They discover a government conspiracy involving the Catholic Church, and a cold war CIA mind control program known as MK-Ultra where children were used as test subjects.Danny Wolf becomes the number one suspect in the murders, but no one, not even Wolf, is prepared for what they discover on Apocalypse Island, a mind blowing secret that was supposed to stay hidden forever.",
  "genres": [
    "Mystery",
    "Thriller",
    "Fiction",
    "Horror",
    "Mystery Thriller",
    "Fantasy",
    "Paranormal"
  ],
  "author": "Mark Edward Hall",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/13487605-apocalypse-island"
}