{
  "title": "Lover Mine",
  "description": "Lover Mine (#13 of the Sensual Erotica Series)A sensual \"quickie\" about sweet romance and tender lovemaking - (Approx. 5500 words) Perfect for mobile eReaders - have access to a quickie whenever you need a fix.Troy is determined to keep Amy for himself by planning a night she will never forget. Flowers, presents & art are his tools of romance. Amy is swept away by his sentimental gesture. The love they feel transfers into the bedroom for a night of exquisite passion. Before the evening ends, Troy toys with the idea of proposing. His inaction may cost, for fate has one last twist for the longtime lovers.Pampering and presents is Troy's plan for the night. He has a short time before he heads back to India and he makes every effort to impress Amy. It's been over a year since he has seen the stunning redhead and his only desire is to love her well. A night of tender lovemaking ends the perfect date, but is it enough to overcome what lies ahead?Excerpt from Lover Mine:\"Amy, would you care to join me in the the bedroom?\"She looked up at Troy with such intensity that he stopped breathing for a second. He shook his head to regain his bearings and then took her hand. He loved seeing the joy in her eyes when she saw the candlelight dancing on the walls. \"Oh Troy, it's amazing!\"\"Remember our first time with the tea lights?\"She giggled. \"Yes, I also remember you complaining that you couldn't see me.\"\"Well, tonight there are enough candles so I can see you just fine.\"\"The rose petals on the bed are a nice touch.\" She had tears in her eyes when she kissed him. \"I love you, Troy. More than you'll ever know.\"\"I've longed to make love to you again, Miss Gardner.\" He picked her up and carried her to the large bed.Amy ran her fingers across his jaw line. \"I dreamed you would love me again, Troy Dawson.\"Adult Reading Material (18+) This book is for mature audiences only and contains sexually explicit content.* If you enjoy this erotic story check out the series, Sensual Erotica. The short stories are stand-alone scenarios made to excite and titillate, but all are interconnected. Enjoy the palate of sensual experiences contained in the series as Amy and Troy make their way in the world. Pick and choose the situations that arouse you, or be a little naughty and sneak a peek at the ones you've always been curious about.",
  "genres": [],
  "author": "Red Phoenix",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/13488440-lover-mine"
}