{
  "title": "No Father Can Save Her",
  "description": "Julene Tripp Weaver's No Father Can Save Her tells in verse the tumultuous coming of age story of a girl growing up in Queens, NY during the 1960s and 70s. When the little girl's father dies, her uncle steps in inappropriately as her mother descends slowly into mental illness. This collection touches upon all kinds of relationships-family, friendships, sexual liaisons, and racial tensions-and the boundary crossings among them. The poems here are gutsy, hard-hitting, and honest, as is clearly evidenced in these lines from \"Out in the World\": \"At twelve, she's wise to it already, / that any man would have her.\" Weaver's language is direct, muscular, and heartbreaking. But ultimately, No Father Can Save Her is a journey of healing, redemption and strength. Lana Hechtman AyersAuthor of What Big Teeth Each small scene in No Father Can Save Her illuminates a coming-of-age both shocking and ordinary, each poem a bright moment of witness that takes a forgiving stance. The precise language of these poems creates a constant, questioning sense of wonder; we can not only survive, but find joy, can not only breathe, but sing. Joanna RoseAuthor of Little Miss Strange The father dies. The in-house uncle takes her to bars. Boys in cars, men at construction sites can't save her. Music helps, and food, and sometimes playing slut. The speaker asks her younger self, \"What are you doing with such pure skin, how will you use it?\" With clarity and precision, this poet brings us along on the unapologetic search for love. And did I really fall out of the car in climax screaming, No, I'm a virgin, in full view of my father's grave? You will remember this strong book. Penelope Scambly SchottWinner of 2008 Oregon Book Award forA is for Mistress Hutchinson Disturbs the Commonwealth",
  "genres": [
    "Poetry"
  ],
  "author": "Julene Tripp Weaver",
  "average_rating": "4.90",
  "url": "https://www.goodreads.com/book/show/10390117-no-father-can-save-her"
}