{
  "title": "100 Horrors: Tales of Horror in the Blink of an Eye",
  "description": "Cruentus Libri Press is proud to present its first horror anthology.100 AUTHORS from the four corners of the globe grace the pages of this anthology with their darkest imaginings.100 STORIES running the gamut of horror from serial killers to the supernatural; from the occult to the ordinary.100 WORDS is all they have to work with, crafting tales of micro-horror with the brevity and intensity of an ice-pick between the eyes.100 HORRORS contains stories from the following world-class Phil Ambler, Sharla Anderson, A.R. Aston, Darren Barker, Colin F. Barnes, Nathan Barnes, Anne E. Barringer, C.G. Bauer, David Bernstein, Stacy Bolli, Cheryl Brandys, Jason D. Brawn, Robert D. Brewer, Russell Brown, Kevin G. Bufton, Nate D. Burleigh, J.D. Carter, S.J. Caunt, Lily Childs, Alex Clements, R. M. Cochran, Scott Cole, Josh Cook, Anthony Cowin, Marius Renos Dicomites, Michael Dortmundt, James Everington, James Fadeley, Kurt Fawver, Ed Fortune, J. Rodimus Fowler, Jamie Freeman, Charlotte Emma Gledson, Ken Goldman, Rich Gray, Rachel Green, V.Ð. Griesdoorn, Naryssa Eve Hamilton, Miriam H. Harrison, Tony Healey, Quinn Hernandez, Christopher Hivner, Gill Hoffs, Jack Horne, Sebastian J. Howley, Paul S. Huggins, Allen Jacoby, William J. Joel, K. Trap Jones, Neil Kloster, Kim Krodel, Lisamarie Lamb, Veronica Marie Lewis-Shaw, David Lightfoot, Bob Lock, Aurelio Rico Lopez III, Chris Marrs, Cee Martinez, Jon McAchren, L.H. McGuire, Jessica McHugh, Alec McQuay, Kate Monroe, Matt Moody, Noah Mullette-Gillman, David Naughton-Shires, Peter Newman, Paco, I.S. Paton, Dan Pawley, Jeremy Peterson, Daniel E. Potts, Bruce L. Priddy, Shawn M. Riddle, Suzanne Robb, R. Phillip Roberts, S. Wayne Roberts, Nathan Robinson, H.J. Rodgers, Robert Ropars, Brian Rosenberger, Abigail Runkle, Brandon Scott, Marc Shapiro, Lance Shoeman, Lisa Ann Smith, James Steele, Kristal Stittle, Gene Tanta, David Thomas, Alexander W. Tkachuk, Donald Jacob Uitvlugt, Laura Ann Via, Jonathan Ward, Ren Warom, Pavelle Wesser, Neil Weston, Andrew J. Wilson, John Xero and Angel Zapata.",
  "genres": [
    "Horror",
    "Short Stories"
  ],
  "author": "Kevin G. Bufton",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/13488682-100-horrors"
}