{
  "title": "الحل الإسلامي للمشكلة العنصرية",
  "description": "http://www.4shared.com/office/xAPI7fL...كتاب الحل الإسلامي للمشكلة العنصرية يورِد محاضرة أحد الدبلوماسيين الألمان ” محمد آمان ” في إحدى المؤتمرات الإسلامية المقامة في أواخر التسعينات في لندن .يتحدث في المحاضرة عن تجربته الشخصية مع العنصرية المتفشية في ألمانيا النازية آنذاك و التي كانت متمثلة بنظرية الهرينفولك و عرفها الكاتب :” أي الشعب السيد أو السيادة الشعبية أو السيادة الجنسية . و التي تقول بتفوق و سيادة الشعب أو الجنس أو العرق الألماني الذي يجب أن يهيمن هيمنة مطلقة على جميع الأعراق و الشعوب الأخرى في العالم “ .ثم يتحدث عن الإسلام و تجربته مع حلوله التي قدمها لمشكلة العنصرية .نقاط تختصر محتوى الكتاب , مستخلصة من رأي الداعية + محاضرة الدبلوماسي الألماني :1- ينهى الإسلام عن القتال مع المسالمين تجاه المسلمين من جميع الديانات . أي أولئك الذين لم يقاتلوا المسلمين ولم يحاولوا إخراجهم من ديارهم .2- ساحة القتال ليست عورةً بلا مبادئ . تقول الفقرة عن طريقة معاملة الرسول عليه السلام للعدو في الحرب :” أوصى المجاهدين بالالتزام بآداب الإنسانية حتى في قتل العدو . إذ أوصاهم بعدم التمثيل بجثث القتلى أو تشويهها و بعدم قتل الولدان و النساء و الشيوخ و أصحاب الصوامع ” الرهبان ” و عمال العدو الذين يستخدمهم بالأجر لغير القتال . كما أمرهم بعدم الغدر و بعدم الاختلاس من الغنائم ” .3- العفو عند المقدرة . و تمثل ذلك في قصة فتح مكة و عبارة الرسول عليه الصلاة و السلام المشهورة لأهل القرية حين آذوه و أخرجوه و أصحابه ثم حين واتته فرصة الاقتصاص بعد الفتح قال لهم : ” لا تثريب عليكم اليوم .. اذهبوا فأنتم الطلقاء ” .4- الإخاء و المساواة في الإسلام .” لقد جعل الإسلام الإخاء بين البشر قرين الإيمان “ .5- الحج التجسيد الحقيقي لمعنى وحدة البشر , و سماه الداعية :” المؤتمر السنوي العالمي للوحدة الإسلامية ” .6- الكبرياء و الهوى .تثبت هذه الفقرة أن العرب قوم شديدي التفاخر بالأنساب و لم يكونوا وحدهم أصحاب هذه الحمية الجاهلية بل سبقهم بنو إسرائيل الذين اعتقدوا أنهم شعب الله المختار و أنهم الأفضل على جميع الأقوام .و أن الرسول صلى الله عليه و سلم بُعث في عصر كانت العصبية القبلية و التكبر بالأنساب في أوجه . و في تلك الفترة جاءت الآية ” يا أيها الناس إنا خلقناكم من ذكرٍ و أنثى و جعلناكم شعوباً و قبائل لتعارفوا إن أكرمكم عند الله أتقاكم ” .يورد الداعية قصة ابن القبطي للدلالة على أن عصر النبي عليه السلام قد عالج كثيراً من أمراض العنصرية آنذاك .” و ذلك في قصة ابن القبطي الذي تسابق مع ابن عمرو بن العاص و كانَ والياً على مصر فسبق ابن القبطي ابن عمرو بن العاص فضربهُ الأخير و سافر القبطي إلى أمير المؤمنين عمر بن الخطاب رضي الله عنه في المدينة يشتكي عمرو بن العاص و ابنه . فأرسل عمر بن الخطاب إلى عمرو بن العاص و قال له كلمته الخالدة :متى استعبدتم الناس و قد خلقهم الله أحراراً ؟ ” و مكّن ابن القبطي من القصاص من ابن العاص.7 – المرأة في الإسلام .هذه الفقرة خاصةً منحتني حباً و ثقةً قويةً بالله و دين الله مقارنة بشكوكي الكثيرة و حيرتي في تلك السنِّ الغضة التي قرأت فيها الكتاب . لأنني كنت أصدق كلام الفتيات الأكبر مني سناً في المدرسة حين كن يتذمرن و يرددن ما يقرأنه في المجلات عن حقوق المرأة و ظلم المجتمع لها و نسب كل هذا للدين .8- الإسلام و الرق .تم إلغاء نظام الرق بعد الإسلام تدريجياً . على سبيل المثال كانت كفارة بعض الذنوب تحرير رقاب العبيد . بينما في عقيدة بني إسرائيل كان جزاء السرقة أن يسترق السارق و يُصبح مِلكاً للمسروق ! .9- تسامح الإسلام مع أهل الكتاب .10 – الرسالة العالميّة .جاءت رسالة الإسلام للناس أجمعين بكافة أطيافهم بينما كانت الرسالات السماوية قبله مخصصة لأقوام بعينهم .11- لماذا يرى اليهود أنهم أعلى شأناً من العرب ؟ج / مِن الكتاب : ” قيل لهم في كتابهم المقدس / التكوين .. أن أباهم إبراهيم كان له زوجتان هما سارة و هاجر . و هم يقولون أنهم أبناء إبراهيم من زوجته الشرعية سارة . أما العرب فهم من سلالة ” الجارية ” هاجر . و لذلك فالعرب هم نسل أدنى منزلة و أقل شأناً “ .12 – الإسلام هو أكثر الأديان التي أسيء فهمها في الغرب .13 – “ كَانَ النَّاسُ أُمَّةً وَاحِدَةً فَبَعَثَ اللَّهُ النَّبِيِّينَ مُبَشِّرِينَ وَمُنذِرِينَ وَأَنزَلَ مَعَهُمُ الْكِتَابَ بِالْحَقِّ لِيَحْكُمَ بَيْنَ النَّاسِ فِيمَا اخْتَلَفُواْ فِيهِ وَمَا اخْتَلَفَ فِيهِ إِلاَّ الَّذِينَ أُوتُوهُ مِن بَعْدِ مَا جَاءَتْهُمُ الْبَيِّنَاتُ بَغْيًا بَيْنَهُمْ فَهَدَى اللَّهُ الَّذِينَ آمَنُواْ لِمَا اخْتَلَفُواْ فِيهِ مِنَ الْحَقِّ بِإِذْنِهِ وَاللَّهُ يَهْدِي مَن يَشَاء إِلَى صِرَاطٍ مُّسْتَقِيمٍ ” البقرة 21314 – ” مهما يكُن البلد الذي يعيش فيه الناس و مهما تكُن اللغة التي يتكلمونها و مهما يكن لون بشرتهم فهم يعتبرون أسرةً واحدة يعيشون منتشرين تحت سقف واحد هو سقف السماء و مع هذا أصلهم مشترك ” .15 – القدوة مبدأ يحفز على التطبيق . و في الإسلام كان الرسول محمد عليه الصلاة و السلام الأسوة الخلقية الحسنة للمسلمين في المساواة .16- ” أيها الناس .. فإن لكم على نسائكم حقاً , و لهن عليكم حقا . استوصوا بالنساء خيراً .. إنكم إنما أخذتموهن بأمانة الله و استحللتم فروجهن بكلمات الله “ الرسول عليه الصلاة و السلام / خطبة حجة الوداع .17- استحدث المذهب اللينيني أو الشيوعي العنصرية الإيديولوجية .",
  "genres": [
    "Religion"
  ],
  "author": "Ahmed Deedat",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/13489632"
}