{
  "title": "Flaked Out: The Story of Cod and Newfoundland",
  "description": "Travel in this children's book to Canada's easternmost province and learn about its unique and exciting history. Codfish have swum in the waters off Newfoundland for thousands of years and have been central to the province's livelihood. Track the impact of a unique fish, Newfoundland's currency, as it feeds the early explorers, provides a basis for the settlement, then struggles for survival against the technologies of modern society. This valuable creature is often depicted on the postage stamps that also commemorate landmark historical events. The wonderful art of Newfoundland stamps enhances the dynamic stories of a proud people and their famous fish.KIRKUS REVIEW: This children's book by Colman tells the story of the overfishing of cod off Newfoundland's coast. Colman's tale begins with the northern land's first settlers, the Beothucks, who arrived nearly 2,000 years ago to a bounty of giant fish swimming off the coast. Colman traces the groups of European explorers and fishermen who followed and, in an air of lawlessness and with a lust for cod, developed various advanced fishing techniques. This led to Queen Elizabeth's claiming of Newfoundland and encouraging of year-round settlement of the territory. As the animals were fished at younger and younger ages, growing smaller and smaller, laws requiring specific kind of nets were put into effect. Around the turn of the 20th century, the first hatcheries appeared to aid in the repopulation of the diminishing species. Colorful stamps--the author has collected stamps since age 5--head each section of the book, depicting scenes, symbols and characters from Newfoundland's history. The rapid and devastating effects of human settlement and consumption take a turn for the better near the end, as we learn that in more recent decades, scientists and the government have taken the helm in the cause of cod. Though the fish are nowhere near the size they were when the Beothucks first feasted on them, their population has been increasing. For readers who want to know more, Colman provides an extensive review of research at the end of the book, where, through a brief, lively narrative, he provides the names of books that go deeper into aspects of cod history that this book sketches out. With its brief, straightforward narrative, Colman's informative book seems to be intended for children, though readers of any level are granted a view of a phenomenon many have likely overlooked.",
  "genres": [],
  "author": "C.H. Colman",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/13489711-flaked-out"
}