{
  "title": "Battle Hymn of the Tiger Daughter",
  "description": "Okay, enough already.First, there was Tiger Mother. Her battle hymn joyfully sang the death knell of America and its lazy, over-indulgent parents. The “Chinese” way was the only way to parent if you wanted “success.”And mental illness.Now, there’s Bringing Up Bebe, which claims that French parents are the ones who know how this parenting thing is done.Oh, please.Come on, American parents. Grow a pair! We have no reason to put ourselves down.First, the stereotype these cultural parenting books portray isn’t true. For every high-achieving Asian, there’s a just-as-high achieving Jew, WASP, Hispanic, etc. doing as well or better without the trauma of parental tyranny.As for the French, I don’t know what playgrounds Pamela Druckerman hangs out on, but I’ve spent many an afternoon on French playgrounds in Paris and beyond and I’ve seen some pretty atrociously behaved enfants. I’ll never forget being in a row boat under a lovely bridge in the Loire valley with my very well-behaved American kids. Paradise except for the French 10-year-olds pelting us and the other boaters with rocks.Listen up, American parents. We nail it. Why? Because one precept guides American parents above all that makes our country and our culture still the go-to paradigm for education, business entrepreneurship, and the arts.This one distinctly American value sets children raised the “American” way on the path to true success and happiness.The value is this: American parents praise the rebel, the dreamer, and the outcast above all else. We’re not about chasing a stereotype to fit into the old ways; we’re about standing out and finding new ways. We’re not about conforming to society’s demands for good behavior. We’re about remaking society one amazing, breathtaking, shocking risk at a time.We question everything.Even ourselves.So unlike the provincial French of Druckerman’s world or the “Chinese” of Chua’s world, we’re out to grab the best of every culture we can get our hands on.That’s why Americans raise the kind of kids who can invent Facebook, Google, and Apple.That’s why we raise the kind of kids who can write Battle Hymn of the Tiger Mother or Bringing Up Bebe. Yes, those books were written by fierce, questioning, re-inventing *American* moms. Americans take the best from every culture, avoiding destructive mistakes, because we’re not culture-bound. That’s why America is still the go-to country for mad creativity, fierce independence, and daring self-direction.Want your kid to make it big? Go to France. (I know, hilarious, right?)Want your child to have a happy, fulfilling life? See you in China! (Yeah, I didn’t think so.)Want your child to be creative, independent, mentally balanced and ready to take on the world? Read Battle Hymn of the Tiger Daughter, the story of one American kid, one American mother, lots of self-doubt, and eventual triumph--the American way.",
  "genres": [
    "Memoir",
    "Nonfiction"
  ],
  "author": "Diana Holquist",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/13490291-battle-hymn-of-the-tiger-daughter"
}