{
  "title": "Not Easily Washed Away: Memoirs Of A Muslim's Daughter",
  "description": "Not Easily Washed Away is the true story of a young girl who was born to a Muslim family in Pakistan. She suffered through sexual, mental and physical abuse for fifteen years, which was perpetrated by her father Abdulla. Laila decides to take advantage of her father’s incestuous addiction by having him acquire a visa for her to the United States, where she feels as if she can rid herself of a putrid past. The book is written from a psychological perspective in first person, as Laila shares her painful past with the reader, sparing no details of her ordeal as a child, teenager and young adult. After she realizes her father’s diabolical plan is to keep her in Pakistan for himself, Laila decides to take fate into her own hands. Her new attitude helps her to turn the tables on her father, now living in America, and manipulate him into marrying an American woman to get Laila’s visa to the United States.The United States is not the instantaneous answer to Laila's plight. She arrived in Seattle, Washington, in 2004 to start a new life away from her father, but ends up being unable to stop the incestuous relationship with him and later on, with her stepmother. Things get even worse for Laila, as she is now twenty years old, depressed, and worried that her family’s fate back in Pakistan might be jeopardized if she leaves home. In the spring of 2007 Laila’s life changes when her younger sister arrived from Pakistan and when she meets an interesting, Christian, Jamaican man at school. The young man confronts Laila about the abuse, and when she realizes she has feelings for him, she tells him everything. The young man tries to convince Laila that she can become mentally stronger and free herself of her abusive father and stepmother by running away with him.",
  "genres": [
    "Feminism",
    "Romance"
  ],
  "author": "Anon Beauty",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/10390814-not-easily-washed-away"
}