{
  "title": "The Happiness Lottery",
  "description": "The Happiness Lottery By Elizabeth Zinn It is Christmas Eve in an affluent suburb of Detroit, located on a lake looking across to the Canadian shore. A horrific accident launches a series of events that generate the story in The Happiness Lottery. Anna Thiers' parents are killed instantly, and she will spend months recovering from her grave injuries – both to her body and her spirit. A compassionate psychologist, Peter Wheaton, guides her through the first weeks after she awakens from a coma, and becomes a steadfast friend throughout the book. He also takes on the job of counseling her troubled grandmother, Elizabeth Brady, who is appointed guardian of both Anna and her little brother, Toby. As Anna struggles to regain her health she is caught up in Elizabeth's neurotic behavior and her own fragile emotions. And Peter Wheaton becomes increasingly pessimistic about Elizabeth's ability to cope with her grandchildren as he uncovers more and more of her past. We also now learn of Peter's bouts of extreme depression, his own demons and the anguish he endures from extraordinary hallucinations. After an outburst of rage Anna banishes Elizabeth from the house for good -- an act that can't be undone and will determine the future for both of them. The Happiness Lottery is a collection of intertwined personal Anna's difficult path back to health after a devastating accident and her metamorphosis from a surly adolescent into a mature young woman; Elizabeth's passage from a horribly damaged early life to existence as a bitter older woman and beyond, to hope and peace; finally, Peter's brave struggle to overcome his own personal demons and a final confrontation with his destiny. Written with compassion and a deep perception of human relationships, The Happiness Lottery lingers in the mind long after the last page is turned.",
  "genres": [],
  "author": "Elizabeth Zinn",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/13491202-the-happiness-lottery"
}