{
  "title": "Heart's Blood",
  "description": "NAMED TO KIRKUS' BEST OF 2012, Finalist in the Western Fiction Category, 2012 International Book Awards; Honorable Mention in 2012 San Francisco Book Festival; Finalist in Leapfrog Press's 2011 Fiction Contest. Heart’s Blood is a riveting family saga set on the border of southern Arizona. The story follows the life of the central character, Tyler McNeil, from his impulsive (and fateful) decision to leave his itinerant existence, through unexpected parenthood, loss, love, and finally peace in his old age. A cast of colorful characters wander in and out of the tale, sometimes taking center stage, sometimes weaving themselves into the tapestry of the whole. We meet Mana, an illiterate and abused border crosser who bears a child and then vanishes; Lita, her infant daughter whom Ty adopts and raises; the complex and evil Blanco, leader of a powerful drug cartel; the frightening Marcela Beltran, Blanco’s wife, who only eats white food and covets Lita’s daughter; Claire, the love of Ty’s life whose stumbling heart threatens to take her from him; and, CJ, Ty’s natural son who rejects him when he learns of his parenthood. These and many others serve up a hearty mixture of love, hate, murder, compassion, and humor. On one important level, Heart’s Blood is a novel of place, filled with lyrical and cinematic descriptions of the vistas of southern Arizona, the changing seasons, and the rich mix of rural life at the end of the 20th century. On another level it brims with those themes that scream at us daily from the media -- the evils of the drug trade, illegal immigration, human smuggling, and the plight of those caught up in the drama of life on both sides of the border. But at the most fundamental level its themes transcend place and time, for it is a tale of secrets kept and revealed, blood ties versus emotional ties, blood spilled and blood passed on from generation to generation, family to family.",
  "genres": [],
  "author": "Elizabeth Zinn",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/13491213-heart-s-blood"
}