{
  "title": "What We Leave Behind",
  "description": "It is said that our lives are a sum total of the choices we make, which inevitably leaves us to wonder: what if? What if we had the chance to go back and live what could have been? What We Leave Behind hones in on the fleeting moments and stand-out events that irrevocably change our lives. The book chronicles the life and emotional growth of Jessica Parker as she frees herself from the past and moves forward with her future. At sixteen, Jessica is managing the emotional trauma of her father’s death while surrendering to the profound pain of a failed first love. Jonas Levy, a twenty-two-year-old medical student, has abruptly walked out of Jessica’s life after an intense summer romance, and the wounds are still raw. Is it possible to ever forget the boy you first gave your heart to? Jessica eventually moves on, and in her twenties, becomes a successful music supervisor in Los Angeles. She marries film producer, Marty Tauber, starts a family, and appears to have it all until things slowly begin to unravel. The marriage struggles through a miscarriage and becomes harder and harder to sustain. With an unexpected phone call from New York, a secret from Jessica’s past comes to light. As the rippling effects of her betrayal emerge, Jessica finds herself caught in the firestorm of long-hidden emotional trauma. Thrust into a modern day moral and ethical dilemma, Jessica must face the pain of her past or lose everything she holds dear. Will she be able to reconcile old feelings in time to salvage her marriage? An honest, tender, and poignant portrayal of love in its many forms, this heart-wrenching novel will resonate with any woman who has questioned her past and wondered what could have been.",
  "genres": [
    "Fiction",
    "Romance",
    "Audiobook",
    "Relationships",
    "Contemporary",
    "Chick Lit",
    "Book Club"
  ],
  "author": "Rochelle B. Weinstein",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/13492155-what-we-leave-behind"
}