{
  "title": "Like It or Not",
  "description": "Be it forced seduction/dubious consent, non-violent intimidation, or pre-negotiated fantasy, there is something wickedly taboo about non-consensual sex, where consent is muddled. While rape is a crime of power, focusing on exerting physical control over another person, non-con is all about the gray area where verbal consent is either never given (not a 'yes', but not a 'no' either) or doesn't match the arousal and passion both parties share during the act. In \"Like It or Not\", we push the boundaries of consent without fully breaking them.When Connor's rent money is due and not even hooking can make up the shortfall, he really is \"Out of Options\". So when playboy Jarrett makes him a very generous offer, he doesn't look too closely at the terms—and lives to regret it. Then, werewolf Trevor is subjected to \"Obedience Classes\" when his pack alpha becomes fed up with his rebellion. Dirk, the wolf charged with this task, though, seems more interested in claiming Trevor for himself, by any means necessary. Writer Ian Richards has to decide \"What It's Worth\" to get his story when his contact meets him in a private club. In fact, Vincenzo has no intention of letting his information go easily, if at all.In \"Blindside\", freshman Matt is tired of enduring the hazing by (admittedly gorgeous) upperclassman Dylan, when Dylan ups the ante significantly. And as much as Matt wants Dylan, he can't be sure the whole thing isn't one more bizarre prank. Confessor Isak must resort to \"Unnatural Means\" when he is charged with the task of forcing Sain to confess his sins of murder and witchcraft before inevitable execution. Torturing in the name of the Divine is difficult enough, but when Sain's seductive magic takes hold of him, he isn't sure it will be Sain who breaks under pressure to find release. Finally, \"Salting the Earth\" becomes Ronan's only choice when he suspects his sister has been taken by the fairies. However, this only draws the interest of ruthless King Finnbheara, who extracts a price for his cooperation that may be too high for Ronan to pay.",
  "genres": [
    "M M Romance",
    "Anthologies",
    "BDSM",
    "Paranormal",
    "Fantasy",
    "Erotica",
    "Gay"
  ],
  "author": "S.L. Armstrong",
  "average_rating": "3.34",
  "url": "https://www.goodreads.com/book/show/13492551-like-it-or-not"
}