{
  "title": "Lucy : l'espoir",
  "description": "Il y a trois millions sept cent mille ans, dans la vallée de 1 Afar, en Afrique orientale, à la frontière entre la Tanzanie et le Kenya d'aujourd'hui LUCY a perdu son clan un soir d'orage. Elle est enceinte. Elle n'a pas pu suivre les siens à travers les hautes herbes pour échapper à la colère du ciel.Elle erre dans la savane arborée, perdue, apeurée, tremblante. C'est la première fois qu'elle se retrouve seule, le moindre bruit la terrifie. Dans son errance, elle croise la route de deux chasseurs Australopithèques d'un autre clan que le sien, qu'elle suit à leur insu, jusqu'à leur campement au bord du lac bleu.C'est la première fois qu'elle voit des chasseurs d'une telle audace. Ils sont plus grands, ils se déplacent mieux, plus vite, Lucy en est très impressionnée.Cachée dans un taillis, elle assiste à un combat très violent entre l'un des chasseurs et le mâle dominant du clan. A l'issue d'un affrontement incertain, le jeune chasseur est finalement vaincu et banni.Cette histoire nous conte la rencontre improbable de ces deux êtres, des liens qui peu à peu s'établissent entre eux. Une relation au début hostile, puis méfiante, parfois drôle et facétieuse, avant que ne se révèlent les premiers troubles d'une émotion pudique, porteuse d'un grand sentiment qui renverse tout, pour ce qui constitue peut-être la première histoire d'amour du monde...Tanino LIBERATORE (de son vrai nom Tanino Liberatore) est né par hasard le12 avril 1953 à Quadri en Italie.Désireux très tôt de dessiner des femmes nues, il étudie au lycée Artistique de Pescara avant de prendre un chemin qui comme tous les chemins le mènera à Rome, à l'Université d'Architecture.Entre 1974 et 1978, Tanino Liberatore collaborera avec plusieurs agences de publicité avant de rencontrer en 1978 un certain Tamburini et de commencer à publier ses premières bandes dessinées dans Cannibale, le magazine de ceux qui n'aiment pas le poulet.En 1980 sort le premier numéro du magazine Frigidaire, magazine étonnant qui se bornera à publier de la bande dessinée au lieu de parler de l'actualité des réfrigérateurs. Liberatore y réalise les célèbres illustrations des séries Bordello et Client, puis y développe avec Tamburini les premières aventures de Ranxerox : Ranxerox à New-York, Ranxerox : Bon anniversaire Lubna.Au début des années 80, comme tout bon italien qui se respecte, Liberatore décide de conquérir le monde. Il réalise des couvertures de magazines et des affiches pour d'importants festivals, dessine la pochette du disque de FrankZappa, The Manfrom Utopia, et conçoit des scénographies et des personnages de synthèse pour le théâtre ou les télévisions françaises ou italiennes.Depuis 1982, Liberatore vit et travaille en France mais continue à jurer en italien. Il collabore régulièrement avec Alain Chabat, avec lequel il a publié en 1997 le tome 3 des aventures de Ranxerox, Amen. Il a également participé au film Astérix et Obélix : Mission Cleopâtre d'Alain Chabat, pour lequel il a remporté le César 2003 des Meilleurs Costumes, et a réalisé certains décors de son film préhistorique RRRrrrr ! ! !.--Note de l'auteurLa grande histoire des hommes a débuté il y a environ six millions d'années, à une époque où notre lignée, celle des hominidés, par l'effet conjugué de phénomènes d'abord tectoniques puis climatiques, s'est séparée de celle des grands singes.Tous les êtres humains, sans distinction de race, ont donc en commun une seule et même origine.Le berceau de l'humanité, là où pour la première fois se sont manifestées les prémices d'une émergence de conscience, se situe dans une petite vallée de l'Afar, en Afrique orientale.Sans délaisser le cadre scientifique, j'ai opté pour un récit fidèle à l'image de nos ancêtres, certes, jonché d'obstacles et de difficultés, mais surtout inventif, facétieux, délibérément optimiste, et par-dessus tout peut-être, poétique ; parce que la poésie affleure partout, chaque fois que l'homme vit en harmonie avec la nature.Je situe mon histoire dans cet espace de poésie, d'harmonie, de symbiose avec la nature, comme à cet instant où l'héroïne observe une traînée lumineuse s'inscrire sur la voûte céleste. Elle se sent vivante, dans un monde dont elle sent confusément battre le coeur à l'unisson du sien, avec au fond du regard cette lueur d'humanité qui pose l'invincible questionnement du grand mystère qui nous enveloppe.Je me suis appliqué à ce que cette question fondamentale plane sur le récit, par le puissant moyen de la suggestion qui éveille en nous l'imagination et la rêverie, pour tenter de nous restituer cette part de nous-mêmes, plus intime que la conscience, et ainsi nous permettre d'accéder à l'universel auquel nous sommes indéfectiblement liés : la densité d'une lumière dans son expression originelle, la vision virginale des paysages luxuriants des grandes plaines africaines, quelques animaux contemporains des héros de cette histoire qui ont accompagné notre fantastique évolution à travers le temps, toute chose dont l'existence concrète, singulière et sensible, comme la couleur d'un ciel, la virginité d'une eau transparente, le léger bruissement d'une feuille dans la chaleur de la savane, autant d'éléments que Tanino Liberatore a su si merveilleusement restituer.Entre la représentation fondatrice, primitive, des deux héros de cette histoire et les créatures que nous sommes devenues, il existe une similitude secrète, une parenté troublante. Nous incarnons «le Rêve humain».Chacun à notre manière, consciemment ou inconsciemment, nous nous débattons au service d'un grand projet commun, celui de nous libérer de l'apesanteur. Il nous faut pour cela endosser notre panoplie de héros, et nourrir infatigablement ce rêve de nos illusions, de nos croyances puisées au creuset de notre incommensurable naïveté de créature mortelle.C'est cette marque inscrite au plus profond de nos gènes, ce mythe du héros qui n'a d'autre choix que celui de se transcender pour échapper au chaos. C'est ce rêve originel et enfantin que j'ai voulu raconter, le rêve des enfants que nous persistons à rester toute notre vie.Biographie de l'auteur-Producteur, scénariste, PATRICK NORBERT a écrit de nombreux scénarios pour le cinéma. Il est l'initiateur de cette version de l'histoire de \" LUCY \" qui a débuté il y a dix ans. En 1978, TANINO LIBERATORE rencontre Tamburini et commence à publier ses premières bandes dessinées dans Cannibale. En 1980 sort le premier numéro du magazine Frigidaire. Liberatore y réalise les célèbres illustrations des séries \" Bordello \" et \" Client \" et dessine également la pochette du disque de Frank Zappa, The Man from Utopia. Toujours avec Tamburini, il développe les premières aventures de Ranxerox : Ranxerox à New York et Ranxerox : Bon anniversaire Lubna. Depuis 1982, Liveratore vit et travaille en France. Il collabore régulièrement avec Alain Chabat, avec lequel il a publié en 1997 le tome 3 des aventures de Ranxerox, Amen. Il a également participé au film Astérix et Obélix : Mission Cléopâtre d'Alain Chabat pour lequel il a remporté le César 2003 des Meilleurs costumes.",
  "genres": [
    "Bande Dessinée",
    "Comics",
    "Graphic Novels"
  ],
  "author": "Patrick Norbert",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/13493390-lucy"
}