{
  "title": "Facing the Beast Within: the Anxiety of Cameron Poole",
  "description": "NEW FROM INTERNATIONALLY PUBLISHED NEW YORK TIMES BESTSELLING AUTHOR Mark Cheverton has written 26 books, with over 2 million copies in print. Cameron Poole has a problem, a big he's a bully magnet who struggles with anxiety. Being the smallest sixth-grader at his summer camp, everything around him triggers his everyday struggles with anxiety, or with his Beast, making it impossible for him to do the same things other kids can do. In a constant state of worry, Cameron feels like a perpetual failure, the effects of mental illness on self-esteem. That's bad enough, but when Cameron learns that mythical monsters are trying to invade his camp, things go from bad to worse. Malphas, the Demon Lord from a parallel world called Agartha, wants to bring magical creatures from another world to form his monster army, attack Camp Pontchartrain, and begin his invasion. But before he can bring the biggest and most ferocious monsters to Earth, he must find the seven Skull Keys that will keep the gateway between worlds open forever. Enemies become friends against a common cause when Cameron is chosen to lead an unusual collection of kids to stop Malphas from finding the Skull Keys. But the Demon Lord of Agartha has other plans. He sends mythical creatures to Earth, gremlins, imps, gargoyles . . . to find the keys and destroy anyone in their way. To stop the Malphas and his monster army from getting all the Skull Keys, Cameron must face his deepest fears while trying to keep his friends safe. But when he learns Malphas's real plan, Cameron's blood runs cold with fear. Can Cameron control his anxiety and confront his Beast while battling an army of minotaurs, banshees, ghouls, golems, and other nightmarish monsters? Buckle up and get ready for a thrilling adventure! While writing this novel, Cheverton worked with a large team of psychologists, social workers, and licensed mental health counselors to learn about the many symptoms of anxiety as well as how these professionals teach their patients coping strategies to help them stand up against their own Beasts. These learnings, coupled with Cheverton's own experiences with his son's anxiety, were woven throughout the story and form a teaching tool for parents and therapists while at the same time offering kids a spine-tingling adventure that will keep them turning the page. Hopefully, kids with anxiety will find a kindred spirit in Cameron Poole and feel that they're not alone in their personal storm of fear and doubt. Parents will gain a little understanding as to what their children are going through, and hopefully, people without anxiety will gain a little insight and compassion toward those suffering from this terrible affliction.",
  "genres": [],
  "author": "Mark Cheverton",
  "average_rating": "4.75",
  "url": "https://www.goodreads.com/book/show/134932464-facing-the-beast-within"
}