{
  "title": "Boneyard 11",
  "description": "Pretty Woman\" meets \"The Godfather\" in a border prison. Convicted drug lord Gaspar lost his wife and family, but wants company and prison visits, so he arranges a marry with a beautiful call girl--but he had no idea what he was getting into. The sweet, gentle Nan steps up to being a wife--and when Gaspar is attacked and harried by Feds and gangs, she strikes back with spectacular fury.What’s a nice call girl like Nan doing in a place like the penitentiary?1. When a divorced crime boss decided he’d like conjugal visits, she won the personality segment of the cattle call.2. She’s safe in there than outside with the Feds and rival gangs trying to nail her.3. Since he got battered into the hospital, she’s been trying to patch up his shattered family.4. She’s starting to see the monthly trysts in the “boneyard” as a sort of haven from the cares of the world.5. It’s a great place for planning her para-military raids against the MS-13 wildboys who threaten her husband’s life.6. Irony. She’s finding it comes with the territory.Our Nan is not your typical romance heroine.She’s a high-priced take-out prostitute who marries the carcerated border “Godfather” Gaspar for money and convenience, but gives him genuine affection and a fierce loyalty.Authentically kind and sweet-natured, she reacts to threats with a cold-eyed, homicidal efficiency.Desiring nothing but peaceful sleep, she detonates a war that shocks even veteran border cops.While having lived on illegal sex trade since she was twelve, she is scrupulously honest and has never even been arrested.And after living a life without love or sexual response, she finds herself falling for a handsome athlete--who is in charge of a Federal task force targeting her husband’s cartel.But aside from the bundle of contradictions, Nan isn’t typical because she’s just not an ordinary person. Charming and gentle but all spring steel inside, filtering the world through her infectious sense of humor, capable of reaching out touchingly to a child but stepping up bravely to danger, thinking out of the box and ahead of the gangsters, Feds, killers and corrupt cops that suddenly surround her, Nan Gaspar is a woman to be dealt with, and to be remembered. And all she wants out of life is a good night’s sleep.",
  "genres": [],
  "author": "Linton Robinson",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/13493506-boneyard-11"
}