{
  "title": "اعتراف أين الله",
  "description": "إعتراف أين الله\" الرواية الأكثر شهرة للكاتب الروسي \"مكسيم غوركي\" جاءت لتعبر عن مرحلة هامة في تاريخ روسيا، مرحلة شديدة التعقيد، وهي المرحلة التي أعقبت إخفاق ثورة (1905) وما حدث على أثرها من تشديد قبضة النظام القيصري على الحراك الثقافي والإجتماعي والسياسي، وقد كان غوركي حينها ضمن الجبهة الثورية اليسارية المتشددة والتي عرفت تصدعات فكرية تنتج عنها ظهور تيارات أسمت نفسها بالباحثون عن الله أو بناة الله...تدور أحداث الرواية حول لقيط غير شرعي يدعى \"ماتفي\" تولى رعايته شماس الكنيسة \"لاريون\" وعودة على إرتياد الكنيسة وعمل على مساعدته في الحفاظ على نظافتها وأمور مشابهة أخرى، وكانت تدور بينهما الكثير من الحوارات الروحانية التي جعلت \"ماتفي\" يشعر بالأمان إلا أن الرجل العطوف \"لاريون\" يتعرض للغرق ويموت فتنتقل الرعاية إلى \"تيتوف\" صاحب السلطة في \"مزرعة سولوكيه\"، زاد ما تفي تعلقاً بالكنيسة وبحب الله لكن قربة من تيتوف مكنه من الإطلاع على سجلات المزرعة وبدأت تتغير نظرته إلى الحياة حين إكتشف الإستغلال والنهب الذي كان يقوم به تيتوف للمزارعين بإسم الكنيسة!...تتوالى الأحداث في الرواية حتى يكبر \"ماتفي\" ويحب ابنة تيتوف التي تربى معها فرغب بالإرتباط بها غير أن تيتوف أجبره أن يتخلى عن مبادئه من أجل تحقيق رغبته تلك، ولم يتوانى ماتفي عن إرضاء تيتوف على الرغم من إنه كان يعيش صراعاً حاداً، وعندما توفيت زوجته وابنته بدأ رحلته المجنونة في البحث عن الله ليتخلص من عذاباته الداخلية وانتقل من دير إلى آخر.وعلى الرغم من أنه كان يعيش محاطاً بالرهبان إلا أنه عاش وحيداً في الأرض كالهلال في السماء ثم ما لبث أن ألتحق بالطبعة العمالية في روسيا آنذاك، لتنتهي قصة البحث بعد أن وصل إلى الحقيقة التي كان يبحث عنها والتي تعزز إيمان \"غوركي\" بالبروليتاريا العمال الذين لا يجدون مصدر لقوتهم إلا ببيع قوة عملهم.يمكن القول إن رواية إعتراف هي الأكثر تعبيراً عن توحيد الناس في سبيل غاية مشتركة هي تحرير الإنسان من العبودية الداخلية والخارجية، وبمعنى آخر الإنتقال من الفردية إلى فهم العالم فهماً جماعياً... وللقارئ الحكم في نهاية الأمر.",
  "genres": [
    "Russian Literature",
    "Novels",
    "Literature",
    "Fiction",
    "Classics",
    "Philosophy"
  ],
  "author": "Maxim Gorky",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/13493457"
}