{
  "title": "Arrogant Beggar",
  "description": "The target of intense critical comment when it was first published in 1927, Arrogant Beggar’ s scathing attack on charity-run boardinghouses remains one of Anzia Yezierska’s most devastating works of social criticism. The novel follows the fortunes of its young Jewish narrator, Adele Lindner, as she leaves the impoverished conditions of New York’s Lower East Side and tries to rise in the world. Portraying Adele’s experiences at the Hellman Home for Working Girls, the first half of the novel exposes the “sickening farce” of institutionalized charity while portraying the class tensions that divided affluent German American Jews from more recently arrived Russian American Jews.The second half of the novel takes Adele back to her ghetto origins as she explores an alternative model of philanthropy by opening a restaurant that combines the communitarian ideals of Old World shtetl tradition with the contingencies of New World capitalism. Within the context of this radical message, Yezierska revisits the themes that have made her work famous, confronting complex questions of ethnic identity, assimilation, and female self-realization.Katherine Stubbs’s introduction provides a comprehensive and compelling historical, social, and literary context for this extraordinary novel and discusses the critical reaction to its publication in light of Yezierska’s biography and the once much-publicized and mythologized version of her life story. Unavailable for over sixty years, Arrogant Beggar will be enjoyed by general readers of fiction and be of crucial importance for feminist critics, students of ethnic literature. It will also prove an exciting and richly rewarding text for students and scholars of Jewish studies, immigrant literature, women’s writing, American history, and working-class fiction.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Classics",
    "Literature"
  ],
  "author": "Anzia Yezierska",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/134937.Arrogant_Beggar"
}