{
  "title": "Black Unicorn",
  "description": "From Publishers Weekly Tanaquil, whose only talent is the ability to fix things, lives in the isolated desert palace of her mother, the sorceress Jaive. When an inquisitive peeve--one of the palace pets--unearths a cache of strange, sparkling bones, Tanaquil uses them to piece together a unicorn's skeleton. A stray blast of Jaive's magic brings the creature to life, and it escapes to the desert, followed by Tanaquil and the peeve. Free at last from her mother's wizardry, Tanaquil embarks on a series of adventures that culminate in the fulfillment of an ancient prophecy. A magical journey that mirrors a teenager's coming-of-age is hardly a new plot device, but experienced SF writer Lee allows events to unfold at their own pace, revealing unexpected twists along the way. The combination of self-assured storytelling and the near-tangible evocation of a quirky world will have much appeal for fantasy devotees. As in the novels of Robin McKinley ( The Hero and the Crown; The Blue Sword ), an understated current of feminism runs throughout. Illustrations not seen by PW. Ages 12-up. Copyright 1991 Reed Business Information, Inc. --This text refers to an out of print or unavailable edition of this title. From School Library Journal Grade 7-12-- Tanaquil may be the daughter of a sorceress, but she can't do any magic--or so she thinks--and she finds life in her mother's castle very dull and lonely. Her one skill, that of mending things, leads her to piece together a pile of old bones found in the desert and unknowingly bring back to life a black unicorn that needs Tanaquil to help it return to its own, more perfect world. In the process of doing this, Tanaquil finds a sister, and discovers what her own powers really are. The plot of The Black Unicorn is in no way as simple as this description. It is complex and twisting, and while readers may not be sure where they're going, they'll never be bored. Lee's lush and highly visual style and her down-to-earth sense of humor are a constant entertainment. Her imagination is boundless, whether in recreating the life of desert nomads or describing a castle full of magical devices all gone slightly awry. The static cover illustration, with rearing unicorn and silver-gowned heroine, does not begin to convey the special flavor of this stylish, humorous fantasy. --Ruth S. Vose, San Francisco Public Library",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Fiction",
    "Unicorns",
    "Magic",
    "High Fantasy",
    "Science Fiction Fantasy"
  ],
  "author": "Tanith Lee",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/1039187.Black_Unicorn"
}