{
  "title": "East of Orleans",
  "description": "Their worlds were different, but their desires were the same . . . Isabella McCoy, from the banks of the Chattahoochee River in Georgia, was as naïve as she was beautiful. Jacqueline Rousseau, the exotic New Orleans prostitute, was known for cruelly breaking men’s hearts while she emptied their pockets. Both with dark secrets of their own, running away from their pasts, to an uncertain future. Fate brought them together, and into the arms of the notorious cotton broker Jules McGinnis, who became both a husband and lover to them. Jealousy. Passion. Love. Murder. Now both women must overcome the truth of their tormented pasts and their unknown futures, as they face one of the most scandalous murder trials Georgia had ever seen. East of Orleans, is a 358 page novel. It is the deep South in the 1880’s, a time when the South is still reeling from its bitter defeat in the Civil War, vainly struggling to live with post-war reconstruction. Meet Jules McGinnis, Rhett Butler reincarnated who has managed to transform himself from a Confederate soldier into a wealthy businessman by taking advantage of the broken South. Through arrogance and false conceit, he marries the woman he doesn’t love and loves the one he will not marry. Then there is Isabella McCoy, one whose youth was snatched by her rape by the one she despises, forcing her to abandon her dream of a life with the one she truly loves. And finally there is Jacqueline Roussea, a beautiful French creole “prostitute” fearful of true love who manages to avoid sex by drugging her clientele. In this epic novel, Renee Irvin paints a picture of lost love and desperation. If you have never suffered the pain of loss, never doubted that you took the wrong road in life, then this book is not for you. But if truly wish to embark upon an unforgettable journey, delve into a forgotten world in which the South was truly “Gone with the Wind, and discover whether or not true love will conquer that false love borne of desperation and stubborn pride, then this book is for you. Review Fesmire (Goodreads) July 2012 \"In the deep South of the 1880's, two young women, Isabella McCoy, a beautiful white girl from rural Georgia and Jacqueline Rousseau, a sultry, black French Creole who works in the finest bordello in New Orleans, are on separate paths in their unhappy lives. This epic novel takes us into their world, which is filled with love, lust, betrayal, rape, murder, wealth, greed, power and corruption. There are surprises at every turn as each woman copes with the cards life has dealt her. And then their paths converge when they burn the cotton fields of the man one is married to and both hate. In one of the most dramatic scenes ever written, the two women save the black sharecroppers' wives and their children from horrible slave conditions and their terrible fate. Isabella and Jacqueline's friendship is literally forged in fire and each must now fulfill her destiny. Renee Irvin takes the reader on an unforgettable journey back to another time and place and into the hearts and minds of two remarkable women. She has seamlessly woven the numerous characters and story elements to create a beautifully detailed tapestry of hope borne of heartbreak and of strength borne of family love. An absolutely wonderful read from cover to cover.\" --Ann K Fisher 318 Pages Revised March 18,2012",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Romance",
    "Historical",
    "Historical Romance",
    "Mystery",
    "Southern"
  ],
  "author": "Renee' Irvin",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/13494411-east-of-orleans"
}