{
  "title": "The Scrolls of Udanadar",
  "description": "Awarded Best Young Adult Fiction 2012-2013 by Texas Association of Authors!Awarded 4 out of 5 Stars by ForeWord Clarion Reviews!Achieved Trafford Publishing's Seal of Literary Excellence!The Scrolls of Udanadar is a Young Adult fantasy adventure appropriate for all ages. Have you ever questioned the purpose of your existence? Or felt that in the great scheme of the universe how insignificant you are? Fifteen-year-old Bartholomew Fix found out just how wrong those assumptions can be. Infected with the spirit of adventure by the bite of the Wandering Bug, he is compelled to seek out an agent of the Universe who transports him to another planet in need of his off-world energy. He awakens in the home of a great urKa'uun and becomes his apprentice.There is no magic, only Ka'uun- the energy of creation- provided by the planet's spirit; the urKa'uun are its users. Bartholomew is unusually adept and learns quickly how to use this energy. His arrival is fortuitous as the Thousand Year King is dying too soon; the one person made impervious with Ka’uun through an ancient ritual in order to stop the five kingdoms of men from warring with each other and keep the fearsome Urilok at bay. They have fought each other for ages as pawns under the slave yolk of the Perq; immortal masters of Ka’uun who were chased out of their world mere centuries in the past. Should the King die, all could be lost.The boy is sent out on a seemingly harmless mission with the urKa'uun's other ward, a skilled girl born of the wild-wise Duvar, to bring back the Scrolls of Udanadar containing the instructions creating the King, and the Kingmaker device, which can find the successor. But a simple mission is never so simple and soon the two find themselves on a quest spanning the realm to find these items and stave off war. The adventure is at times humorous and other times fraught with danger as they face bandits, pirates, evil spirits and an ancient enemy that rears its head. These trials force Bartholomew to grow from a naïve boy concerned with the little things in his world, into a brave hero learning what is to sacrifice in order to achieve a higher goal",
  "genres": [],
  "author": "S. Cameron Roach",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/13495151-the-scrolls-of-udanadar"
}