{
  "title": "Powerful Alpha",
  "description": "[Siren Everlasting Classic ManLove: Erotic Alternative Paranormal Romance, M/M, shape-shifters, HEA]The power of two…Shy loner Danny Jones lives in a world of vivid dreams, mostly kinky sexual fantasies in which the football players he caters to indulge their lusts upon him in every conceivable way. Lately, though, the slump-shouldered waterboy’s dreams are being invaded by a golden-brown grizzly bear who reminds him of someone on the team.When Matthew Edwards is offered a full scholarship to Twin Pines College, the chance to pursue both his athletic and academic dreams is all he needs to switch schools. That the college is all male and rumored to be gay friendly is just the icing on the cake. When Matthew meets the timid Danny, he sees right through his camouflage. All Danny needs is a little encouragement to come out of his shell, and with Matthew’s help, Danny transforms.When he discovers Danny has been attacked and left for dead, Matthew is surprised to find himself shifting into a bear, and he’s even more shocked to learn Danny—and the whole team—might just be bears, too.Will Danny and Matthew’s love be enough when their bond unleashes a startling new legacy? Or will the unknown enemies who want to prevent the team from fulfilling its fate prevail?Note: Powerful Alpha [Twin Pines Grizzlies 1] was previously published as Waterboy [Gridiron Gods 1]. Due to popular demand, the series has been revised to emphasize the bear shifting. If you have already read Gridiron Gods 1 to 7, you do not need to read Twin Pines Grizzlies 1 to 7 in order to continue with Strong Alpha [Twin Pines Grizzlies 8].Powerful Alpha will be available on its release date in your bookshelf for download if you have already purchased Waterboy directly at BookStrand (this option is not available if purchased elsewhere).",
  "genres": [
    "M M Romance",
    "Paranormal",
    "Fantasy",
    "Shapeshifters",
    "M M Shapeshifters",
    "Romance",
    "Erotica"
  ],
  "author": "Anitra Lynn McLeod",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/13495487-powerful-alpha"
}