{
  "title": "Devoted Alpha",
  "description": "[Siren Everlasting Classic ManLove: Erotic Alternative Paranormal Romance, M/M, shape-shifters, HEA]The erotic torment of his virgin lover…In high school, Tyler thought Evan was too young, and he reluctantly let him go, but Tyler never forgot their brief but passionate encounter. When Tyler needs help passing chemistry, brainy Evan is the first choice. Tyler doesn’t know Evan is now blind, but that doesn’t change his feelings for his gorgeous tutor.Evan has saved himself for Tyler, and he can’t wait to have the sexy football player take him to the edge of sexual pleasure. Evan’s hunger for orgasm control turns into an erotic torment that bonds their souls, and the two become twinned bear shifters.When a madman kidnaps Evan to turn him into a pain-craving submissive, the two must use the strength of their bond to keep the madman from killing Tyler and claiming Evan to gain entry into the Twin Pines Grizzlies. To thwart the villain’s plans, Evan must confess his darkest secret.When Tyler learns what Evan has done to alter the course of his destiny, will he be able to forgive him, or will Evan pay for his crime with Tyler’s life?Note: Devoted Alpha [Twin Pines Grizzlies 4] was previously published as Defensive Guard [Gridiron Gods 4]. Due to popular demand, the series has been revised to emphasize the bear shifting. If you have already read Gridiron Gods 1 to 7, you do not need to read Twin Pines Grizzlies 1 to 7 in order to continue with Strong Alpha [Twin Pines Grizzlies 8].Devoted Alpha will be available on its release date in your bookshelf for download if you have already purchased Defensive Guard directly at BookStrand (this option is not available if purchased elsewhere).",
  "genres": [
    "Shapeshifters",
    "M M Romance",
    "Erotica",
    "BDSM",
    "Paranormal",
    "M M Shapeshifters",
    "Romance"
  ],
  "author": "Anitra Lynn McLeod",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/13495497-devoted-alpha"
}