{
  "title": "Dark Swan Bundle: Storm Born, Thorn Queen, Iron Crowned & Shadow Heir",
  "description": "Just typical. No love life to speak of for months, then all at once, every horny creature in the Otherworld wants to get in your pants. . .  Eugenie Markham is a powerful shaman who does a brisk trade banishing spirits and fey who cross into the mortal world. Mercenary, yes, but a girl's got to eat. Her most recent case, however, is enough to ruin her appetite. Hired to find a teenager who has been taken to the Otherworld, Eugenie comes face to face with a startling prophecy--one that uncovers dark secrets about her past and claims that Eugenie's first-born will threaten the future of the world as she knows it.Eugenie Markham is a shaman for hire, paid to bind and banish creatures from the Otherworld. But after her last battle, she's also become queen of the Thorn Land. It's hardly an envious life, not with her kingdom in tatters, her love life in chaos, and Eugenie eager to avoid the prophecy about her firstborn destroying mankind. And now young girls are disappearing from the Otherworld, and no one--except Eugenie--seems willing to find out why. New York Times bestselling author Richelle Mead takes readers back to the Otherworld, an embattled realm mystically entwined with our world--and ruled by one woman's dangerous choice. . .Shaman-for-hire Eugenie Markham is the best at banishing entities trespassing in the mortal realm. But as the Thorn Land's queen, she's fast running out of ways to end the brutal war devastating her kingdom. Her only hope: the Iron Crown, a legendary object even the most powerful gentry fear. . .#1 New York Times bestselling author Richelle Mead returns to the Otherworld, a mystic land inextricably linked to our own--and balanced precariously on one woman's desperate courage . . .Shaman-for-hire Eugenie Markham strives to keep the mortal realm safe from trespassing entities. But as the Thorn Land's prophecy-haunted queen, there's no refuge for her and her soon-to-be-born-children when a mysterious blight begins to devastate the Otherworld. . .",
  "genres": [
    "Fantasy",
    "Urban Fantasy",
    "Romance",
    "Paranormal",
    "Fae",
    "Paranormal Romance",
    "Supernatural"
  ],
  "author": "Richelle Mead",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/13495955-dark-swan-bundle"
}