{
  "title": "Give It To Steve!",
  "description": "PRODUCT DESCRIPTIONOn the morning of December 19, 1948, Philadelphia, basking in the glow of post-war optimism and shrouded in the black smoke of booming factories, awoke to gridiron dreams of a first-ever NFL championship for its long-suffering Eagles – and the first flakes of a raging blizzard. And as the 1:30 p.m. kickoff for pro football’s title tilt between the Eagles and the Chicago Cardinals drew closer and eight inches of snow piled up on the rigid turf of Shibe Park, there was a huge problem: The Eagles’ superstar running back Steve Van Buren was nowhere to be found. “Give It To Steve!” tells the remarkable story of how pro football’s “Greatest Generation” of blue-collar, combat-hardened Everymen pulled off the game they remember as “The Blizzard Bowl.” It was the last NFL championship game in leather helmets and the first on national TV – in a bygone era before the Roman-numeraled orgy of the Super Bowl, when the NFL was still man enough to play in the snow, even if the players themselves had to clear the field. The story follows the unlikely odyssey of Van Buren -- whose slashing style revolutionized pro football – from an obscure Caribbean island to a snow-obliterated end zone, helped by his unbelievable dash on old-fashioned trolleys and a subway just to get to the game. The saga concludes with a poignant epilogue – the difficult medical price that Van Buren and other vets of the leather-helmet era have paid for their years of smash-mouthed football glory. ABOUT THE AUTHORWill Bunch is senior writer for the Philadelphia Daily News, where he writes the popular blog Attytood. He shared the 1992 Pulitzer Prize for spot news reporting in 1992 when he was at New York Newsday. His books include Jukebox America: Down Backstreets and Blue Highways in Search of the Country’s Greatest Jukebox; The Backlash: Right-Wing Radicals, High-Def Hucksters and Paranoid Politics in the Age of Obama; and Tear Down This Myth: The Right-Wing Distortion of the Reagan Legacy. His first Amazon Kindle Single was October 1, 2011: The Battle of the Brooklyn Bridge. His articles have also appeared in the New York Times Magazine, The Washington Post, The Los Angeles Times, American Journalism Review, and elsewhere. He lives in the Philadelphia suburbs with his family. Follow on Twitter: @Will_Bunch .",
  "genres": [],
  "author": "Will Bunch",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/13496167-give-it-to-steve"
}