{
  "title": "The Mother-Earth Series Omnibus",
  "description": "This volume contains the three complete works of the Mother-Earth fantasy/adventure Book A Measure of Disorder, Book A Cure for Chaos, and Book Mother's Heart. Follow Jenni Kershaw and her eighth grade science class through their harrowing adventures, battling powerful evils and sometimes even themselves. It's different, imaginative, and critically acclaimed.Save over buying the three books separately!Praise for the Mother-Earth SeriesFor Book One, A Measure of Disorder —“…I was hooked! I could hardly put this book down. Reading Teen followers, you will have your doubts before reading this book. DON’T. It is WELL written, well thought out, and the whole concept is completely insane. Which makes for one great fantasy book.” — Austin, from ReadingTeen.net“A Measure of Disorder by Alan Tucker is a wonderful foray into fantasy and imagination”. — Tracy, from Midwest Book Review“…the plot really kept me hooked and I flew through the last hundred pages. I just had to know what was going to happen next. I really enjoyed A Measure of Disorder and would recommend it to anyone who enjoys fantasy and adventure books. This is a book that I think would have appeal to readers of all ages. The ending of the book really surprised me and I am excited to read the next book in the series.” — Aimee, from A Book Dork blog“This book is right up my alley... well worded and caters well to the young community. I highly recommend it!” — Mercedes, from Goodreads.com“As I neared the end of the book, I found myself reading ravenously to find out what happened. I’d love to give more details, but this is really a book that you just need to read to appreciate.” — Jessica, from A Hopelessly Devoted BibliophileFor Book Two, A Cure for Chaos —“A Cure for Chaos offers Tucker’s unique and fantastical prospective to children, teens and adults alike … It’s a stellar trip into the world of imagination and a voyage you will never want to return from. I can’t wait till the third volume comes out!” — Tracy, from Tracy Riva’s Book Review Blog“…And I really admire the genius of Mr. Tucker for creating this world that is so awesome and... well, believable. From my point of view, if a fantasy author can make you believe, even for the shortest second, that what they are writing about is real, they have done their job. Or, even if they make you want to believe it. ‘Cause that’s kinda the point of fantasy. My dictionary states that fantasy is ‘imagination, especially when extravagant and unrestrained.’ And that is exactly what the crazy awesomeness of the Mother-Earth series is.To anyone who enjoys an insane fantasy book, I really recommend the Mother-Earth series. It is one of my favorites, and even more so since I’ve read this book. This is an incredible series that will fully captivate you.” — Austin, from ReadingTeen.netFor Book Three, Mother’s Heart —“The Mother-Earth series has not only changed my opinion on reading but has also heightened my love for fantasy books a hundredfold. Alan Tucker has woven a world into these pages unlike any I have ever read about. …This is definitely a story that I recommend to any lovers of Tolkien, Lewis, and many of the other greats. This series will always be among my favorites and I thank you, Mr. Tucker, for writing a series that impacted me so.” — Austin, from ReadingTeen.net",
  "genres": [],
  "author": "Alan  Tucker",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/13496231-the-mother-earth-series-omnibus"
}