{
  "title": "Terror and Consent : The Wars for the Twenty-First Century",
  "description": "An urgent reconceptualization of the Wars on Terror from the author of The Shield of Achilles (“magisterial”— The New York Times , “a classic for future generations”— The New York Review of Books ). In this book Philip Bobbitt brings together historical, legal, and strategic analyses to understand the idea of a “war on terror.” Does it make sense? What are its historical antecedents? How would such a war be “won”? What are the appropriate doctrines of constitutional and international law for democracies in such a struggle?He provocatively declares that the United States is the chief cause of global networked terrorism because of overwhelming American strategic dominance. This is not a matter for blame, he insists, but grounds for reflection on basic issues. We have defined the problem of winning the fight against terror in a way that makes the situation virtually impossible to resolve. We need to change our ideas about terrorism, war, and even victory itself.Bobbitt argues that the United States has ignored the role of law in devising its strategy, with fateful consequences, and has failed to reform law in light of the changed strategic context. Along the way he introduces new ideas and concepts—Parmenides’ Fallacy, the Connectivity Paradox, the market state, and the function of terror as a by-product of globalization—to help us prepare for what may be a decades-long conflict of which the battle against al Qaeda is only the first instance.At stake is whether we can maintain states of consent in the twenty-first century or whether the dominant constitutional order will be that of states of terror. Challenging, provocative, and insightful, Terror and Consent addresses the deepest themes of governance, liberty, and violence. It will change the way we think about confronting terror—and it will change the way we evaluate public policies in that struggle.",
  "genres": [
    "Politics",
    "History",
    "Nonfiction",
    "Law",
    "War",
    "Terrorism",
    "Political Science"
  ],
  "author": "Philip Bobbitt",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/1039265.Terror_and_Consent_"
}