{
  "title": "الشوقيات",
  "description": "أربعة وستون عاماً، تلك هي المساحة الزمنية التي منحها الله لأحمد شوقي على سطح هذه الأرض (1868-1932)، ولكنه في هذه المساحة المحدودة ذاع شعره في الدنيا، وشغل الناس، وملأ جميع الأسماع، وأشجى كثيراً من القلوب.و كما شغل الناس في حياة صاحبه شغلهم بعد وفاته، ولا يزال حتى الآن يشغل الرواد، وسيظل مدخلاً يتوصل به إلى خصائص الشعر العربي في عتقه وأصالته، ومَعْلماً بارزاً يدل على مستوى وأبلغه الشعر العربي في عصر النهضة. فقد منحه الله موهبة شعرية فذّة، وبديهة مطواعة سيّالة، فلم يكن يجلس إلى مكتبه للتفكير وكدّ الذهن كي ينشئ قصيدة، وإنما كانت تنثال عليه الخواطر انثيالاً، وكأنها تفيض من كل صوب... يغمغم بالشعر ماشياً أو جالساً بين أصحابه، حاضراً بينهم بشخصه، غائباً عنهم بروحه وفكره، لا يعرف جليسه أنه ينظم إلا إذا سمع منه بادئ ذي بدء غمغمة تشبه النغم الصادر من غور بعيد، ثم رأى ناظريه وقد برقا، تواترت فيهما حركات المحجرين، ثم بَصُرَ به وقد رفع جبينه، وأمرّها عليه إمراراً خفيفاً، هنيهة بعد هنيهة، كما يقول الشاعر خليل مطران، وتلك سمة الشعراء الملهمين.وقد تفجر ينبوع الشعر على لسانه وهو صغير، واستكمل أداته ولما يجاوز العشرين من عمره. وكان لثقافته المتنوعة الجوانب فيما بعد (غربيها وشرقيها) أثرها في شعرهن حيث قام شوقي باستحداث ألوان فنية لم يسبق للشعر العربي أن مارسها؛ \"لأنه خلق ليكون مجدداً\" كما قال طه حسين، ولكنه لم يخرج عن العمود الشعري الذي تعارف عليه النقاد من قديم، فظل محتفظاً للقصيدة بتقاليدها العباسية: وحدة الوزن والقافية، ومن جزالة الأسلوب ونصاعته، وبعد عن التكلف المقيت لألوان البديع، كما اعتمد في تصويره على الصور المركبة حيناً، الممتدة أحياناً، وعلى الصور الجزائية التي تقف عند حدود التشبيه والاستعارة والكناية أحايناً، لكنه عرف كيف يستعيد من كنوز التشبيهات والاستعارات القديمة، ويضفي عليها من ذات نفسه وثقافته ما يكسبها جدة وطرافة، فكانت صورة تستمد روحها من تجربة الشاعر وثقافته الواسعة الشرقية والغربية، لا من انفعالات فطرية.خلّف شوقي آثاراً شعرية ونثرية بما في ذلك مسرحياته الشعرية والنثرية، وقصصاً ألفها في مطلع حياتها، ونثراً أخذت عباراته شكل السجع. من هذه الآثار ديوانه \"الشوقيات\" الذي بين يدي القارئ وهو من الشعر الغنائي، ويقع في أربعة أجزاء. وقد خرج في طبعته هذه بحلة جديدة حيث تمّ عرضه عرضاً يتسق ومكانة الشعر والشاعر، عرضاً يُعنى بتبويبه وتقسيمه وتنسيقه، وضبط كلماته، وشرح مفرداته، والتعريف بأعلامه، وتحديد البحر العروضي الذي آثره الشاعر لقصيدته. إلى جانب ذلك ضمّ الديوان دراسة مستفيضة حول الشاعر أحمد شوقي شملت جوانب حياته ولمحة عن مؤلفاته وآثاره الشعرية والنثرية.",
  "genres": [
    "Poetry",
    "Literature"
  ],
  "author": "أحمد شوقي",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/13498554"
}