{
  "title": "Hay-Wire",
  "description": "Bertha Muzzy Sinclair or Sinclair-Cowan best known by her pseudonym B. M. Bower, was an American author who wrote novels, fictional short stories, and screenplays about the American Old West. Her works, featuring cowboys and cows of the Flying U Ranch in Montana, reflected \"an interest in ranch life, the use of working cowboys as main characters (even in romantic plots), the occasional appearance of eastern types for the sake of contrast, a sense of western geography as simultaneously harsh and grand, and a good deal of factual attention to such matters as cattle branding and bronc busting.\" She was married three to Clayton Bower in 1890, to Bertrand William Sinclair (also a Western author) in 1905, and to Robert Elsworth Cowan in 1921. However, she chose to publish under the name Bower. Bower began writing to \"save my sanity\" after moving to Big Sandy with her first husband. Seeking financial independence from Clayton, she began sending stories to publishers in 1900. She regularly wrote new material while continuing to send out her old stories once a month. Bower published her first short story, \"Strike of the Dishpan Brigade,\" locally in 1901. Her first short story to be published nationally, \"Ghost in the Red Shirt,\" appeared in Lippincott’s Magazine in 1904. Later that year, Bower published her first Western novel, Chip of the Flying U, as a serial in Popular Magazine by Street & Smith. The book introduced readers to the fictional Flying U Ranch and the \"Happy Family\" of cowboys who lived there. The story line centers on a cowboy named Chip and his relationship with Dr. Della Whitmore, a self-reliant doctor from the East who \"can shoot a coyote, laugh off a hazing, doctor a horse, and turn cowboys into pediatric orderlies.\" Their relationship begins coldly when Della takes credit for a painting done by Chip. But they fall in love after Della restores credit to Chip and after Chip rescues Della from a runaway horse. The book was so popular that it was re-released in hardcover in 1906 with three watercolor illustrations by famed painter Charlie Russell. Chip of the Flying U rocketed Bower to fame, and she wrote an entire series of novels set at the Flying U Ranch. Bower went on to write 57 Western novels. She died in July 1940 in Los Angeles, California, at the age of 68. By the time of her death, her books had sold more than two million copies, not counting her many short stories and articles. According to Elmer Kelton, Bower's sales dropped when it was revealed that she was female. Bower's novels have been praised for their accurate portrayal of cowboy life. She wrote factually about such things as cattle branding and bronc busting, having witnessed these events firsthand. Bower's West is a place of change in which characters embrace new technologies from barbed wire to Kodak cameras. She infused her novels with humor. Her cowboys lightheartedly josh each other, and readers are invited to laugh at the ironic situations in which her characters are entangled. There is little violence in Bower's writing. In Chip of the Flying U, the eponymous character does not even carry a six-shooter. Instead, Bower's writing is characterized by a lighthearted, pleasant mood. For example, in describing a ranch kitchen, she imagines a tea kettle \"singing placidly to itself and puffing steam with an air of lazy comfort, as if it were smoking a cigarette.\"",
  "genres": [
    "Westerns"
  ],
  "author": "B.M. Bower",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/13498952-hay-wire"
}