{
  "title": "Disposable People",
  "description": "Ten year old Kenneth Lovelace often went to bed without dinner. Instead of feeling hunger, however, what he mostly felt was fear and shame, knowing that his family’s poverty was the reason he had no food. Kenneth also recalls his bitterness whenever his parents locked him out of their tiny, one-room house to act on their 'urge'. This was in the 1970s, when Jamaica's socialist regime was dragging the country into bankruptcy, and when an Old Timer had told him that he was cursed since birth. Beginning with his earliest memories, “Disposable People” traces the life of Kenneth Lovelace, now a consultant living in the USA. After a string of failed marriages, bad relationships and other misfortunes, Kenneth looks back at his life in his old, hateful village with hopes of finding the roots of his latest tragedy. What comes out is a story of mischief and adventures, sex, prejudice, evil spirits, adversities and, progressively, violence.\"Brian was already dead when they got there, but they still gotsomething to watch as some of the farmers continued to chop. Chop, chop, chop. Some dogs find it hard to stop barking at cars that have long driven away.Diary entry: Watch him wail. Wail Brian wail. See them chop. Chop, chop,chop. See him bleed. Bleed boy bleed. See them hack. Hack, hack, hack.Here are three things I just can’t do, no matter how hard I try: (1) I cannot spell Nietzsche without looking it up in the dictionary; (2) I cannot prepare Jamaican fried dumplings perfectly, no matter how many times I see others do it; (3) I cannot get this image out of my head: a large group of men swarming my cousin like flies, killing him, and continuing to chop as though they were also trying to get down to his soul.A little while later, our older family members also came. Brian’s papa, Uncle Thomas, came. Said nothing. Just stood there. By then he was well into his can only make love twice a month stage of life but, like a true Jamaican, still wanted it to be with two different women. His mom, Aunt Beverley - Auntie B for short, also came. Not one intelligible word from her either, but her body shook and trembled like a Pentecostal caught by the spirit, before she was taken away by Aunt Josephine and Aunt Frida.Aunt Martha came also, and she led the screaming. She was in her 300th month of pregnancy (growing up I cannot remember a time when she wasn’t pregnant), and we all worried for her health as she hit those high-pitched notes. When I looked around I saw that Miss Jacky had come as well. She was not a member of our family, just one of those that lived on the other side of the yard. Like a second-hand car, she always had a used look about her. She lavished more attention on her face, and had more control over her hair than she did her kids. I remember she spent endless hours at the hairdresser and beauty salon, and took those birth control pills that reduce acne. Anyway, I digress, perhaps because I was distracted by her long, flowing, artificial hair at the time.Every one of the other older folks also came, except Grandpa, who had something (not someone, for the Old Timer was long past that stage), eating him. [For clarity: cancer had taken over where the girls had left off ]. After his second heart attack, he was stuck on his veranda with spit on his chin, hanging down like stalactite. Useless and abandoned like a condemned building, he sat there with his shriveling skin looking like aroll of wet toilet tissue put out to dry.\"",
  "genres": [
    "Contemporary",
    "Fiction"
  ],
  "author": "Ezekel Alan",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/13499187-disposable-people"
}