{
  "title": "Out of My League: A Rookie's Survival in the Bigs",
  "description": "\"Dirk Hayhurst writes about baseball in a unique way. Observant, insightful, human, and hilarious.\"--Bob Costas-   \"Even more than he did in The Bullpen Gospels, Dirk Hayhurst teaches us here what happens when a 'dream career' collides with reality. There is such universality in his struggles, that if by the book's end you don't become him in your mind, there's probably something wrong with your heart. This book shows why baseball is so often used as a metaphor for life.\"--Keith Olbermann\"Not many pitchers have replaced future Hall of Famer Greg Maddux. Only one has written a delightful book about it. This isn't the story of any old Triple-A veteran trying to finally reach the majors. This is the story of Dirk Hayhurst finally reaching the majors. Which makes the story worth reading.\"--Rob Neyer, Sports Nation \"Hayhurst has done it again... Turns out he's a starter and a closer.\"--Tim Kurkjian, ESPN  \"A stirring, revealing tale of humanity.\"--Ken Rosenthal, Fox Sports \"Gripping, revealing--and not at all what you'd expect.\"--Tyler Kepner, The New York Times    \" With razor-sharp wit and keen observational powers, Dirk Hayhurst delivers a rare gem of a baseball book. Out of My League captures both the joy and the toll of becoming a big leaguer unlike anything else before it.\"--Tom Verducci, Sports Illustrated   -\"Hilarious, illuminating and poignant...This is more than a baseball book. It's the story of a man learning that it's possible to grip a baseball without it gripping him.\"--Craig Calcaterra, NBC Sports.com \"Hayhurst has done it again...If only I could pitch as well as he can write, I might have more Cy Youngs than Greg Maddux.\"--Jayson Stark, ESPN.com \"Memorable... Hayhurst delivers an entertaining story for more than just sports fans. This is about life, relationships and the sacrifices made to pursue a dream\"--Jordan Bastian, MLB.com \"Funny, earthy, touching. Dirk finally makes it to a big-league mound, but as a writer, he's been throwing strikes in the Show for a while now, and \"Out of My League\" is another quality start.\"--King Kaufman, Bleacher Report \"The most candid portrayal of life as a professional athlete I've ever seen.\"--Michael Dolan, Editor-in-Chief,  Athletes Quarterly \"It's never too inside baseball, even though it is literally from inside baseball.\"--John Manuel, Editor, Baseball America \"Dirk is a good friend who has never been afraid to tell it like it is. He has a genuine gift for telling the stories of his life in such a way that they reveal profound truths. I find his writing both entertaining and thought provoking... unlike his fastball.\"--Ben Zobrist, Tampa Bay Rays All-Star \"Baseball is a game governed by countless rules, none bigger than this Don't over think it. Dirk Hayhurst takes us down the rabbit hole that is his mind, to a place where that rule is constantly violated, every decision, every move, every breath over thought. In the process, he provides a brutally honest take on life in the majors--the oversized ballparks, hotel rooms, and personalities, but also the self-doubt, loneliness, and despair. I laughed, I cried, I even learned how to doctor a baseball.\"--Jonah Keri, author of The Extra 2%  \"Compulsively readable and enjoyable...Apparently, it's not enough for Hayhurst to be a major league pitcher; he has to be a fantastic writer, too.\"--Matt Fraction, Marvel Comics",
  "genres": [
    "Baseball",
    "Sports",
    "Nonfiction",
    "Memoir",
    "Biography",
    "Biography Memoir",
    "Comedy"
  ],
  "author": "Dirk Hayhurst",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/13499303-out-of-my-league"
}