{
  "title": "When Vengeance Howls",
  "description": "When Vengeance Howls, The Chronicles of Abigoth: Volume 2Lucas thrashed in his sleep from one side to the next where he lay on the floor. A tangle of blankets tied up his legs and a salty dampness collected on his skin as he struggled to escape his dream—a dream that had pursued him relentlessly since that day in the park six months past. There was no escape. Once again he found himself racing through dimly lit tunnels that harbored nothing but his own panic and the howls of whatever it was that pursued him. The howls were deafening as they slammed against the gleaming white walls of catacombs that burrowed into the deepest depths of the earth. Lucas knew that once the beast finally caught him that crimson would stain the walls of his dreams, leaving behind only the darkness of death and the echoes of his own screams as his soul was torn from his flesh like meat off a bone…A thousand feet beneath the sewers of Detroit, deep within the abandoned salt mines that stretched for miles in all directions, an ancient mist had risen and its voice empowered the winds that swept through the crystalline catacombs. “We are the Dire,” it sang. “We are the froth of ancient seas, born of rage and botheration. We are the mend of broken souls. We are adjudication.”NOTE: The Chronicles of Abigoth is an ongoing series which may at times contain graphic violence, strong language, demons, shifters and other unworldly things—and yes, adult sexual situations. Each chronicle is self-contained unless otherwise indicated. These are not short stories. Each chronicle is novella length or longer. Consider each chronicle to be its own thrill ride at a paranormal amusement park—an amusement park where romance and mayhem duck in and out of the shadows.PLUS! SPECIAL BONUS MATERIAL… TRY BEFORE YOU BUYTHE DISCIPLES OF GOEDRIC, A TRILOGY",
  "genres": [
    "M M Romance"
  ],
  "author": "Jeffrey Jude",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/13499805-when-vengeance-howls"
}