{
  "title": "An End to Evil: How to Win the War on Terror",
  "description": "An End to Evil charts the agenda for what’s next in the war on terrorism, as articulated by David Frum, former presidential speechwriter and bestselling author of The Right Man, and Richard Perle, former assistant secretary of defense and one of the most influential foreign-policy leaders in Washington.This world is an unsafe place for Americans—and the U.S. government remains unready to defend its people. In An End to Evil, David Frum and Richard Perle sound the alert about the dangers around the continuing threat from terrorism, the crisis with North Korea, the aggressive ambitions of China. Frum and Perle provide a detailed, candid account of America’s a military whose leaders resist change, intelligence agencies mired in bureaucracy, diplomats who put friendly relations with their foreign colleagues ahead of the nation’s interests. Perle and Frum lay out a bold program to defend America—and to win the war on terror.Among the topics this book • why the United States risks its security if it submits to the authority of the United Nations• why France and Saudi Arabia have to be treated as adversaries, not allies, in the war on terror• why the United States must take decisive action against Iran—now• what to do in North Korea if negotiations fail• why everything you read in the newspapers about the Israeli-Arab dispute is wrong• how our government must be changed if we are to fight the war on terror to victory—not just stalemate• where the next great terror threat is coming from—and what we can do to protect ourselvesAn End to Evil will define the conservative point of view on foreign policy for a new generation—and shape the agenda for the 2004 presidential-election year and beyond. With a keen insiders’ perspective on how our leaders are confronting—or not confronting—the war on terrorism, David Frum and Richard Perle make a convincing argument for why the toughest line is the safest line.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Political Science"
  ],
  "author": "David Frum",
  "average_rating": "2.78",
  "url": "https://www.goodreads.com/book/show/134996.An_End_to_Evil"
}