{
  "title": "Torn",
  "description": "Isadora Rivers feels trapped. Her small town high school is suffocating her.Another day of wannabe gangsters, dumb jocks, and Barbie clones, and she'll just lose it. Her keen emotional sensitivity is to blame. She sees through all of the poser behavior to the pain and insecurity simmering just below the surface, and it's overwhelming. She feels like she's literally drowning in other people's emotions.This same sensitivity, however, makes her a great actress. Suffocating or not, her high school is one of the top arts schools in the country. Acting is not only her passion, but it also looks like her way out. If she can just score the lead role in the school play, she might get herself noticed by a Hollywood agent. But she's got a strong reckless streak, and it keeps getting her in trouble and jeopardizing her chances.Riding her bike at top speed, she swerves in front of a car and nearly gets hit. The driver, Tristan Blake, turns out to be the mysterious new boy at school. He's rebellious, broody, and wise beyond his years. He's also devastatingly gorgeous. From the moment their eyes meet, Isadora is irresistibly drawn to him. But as soon as he enters her life, things go horribly wrong. She begins having disturbing visions full of unimaginable glamour and unbearable darkness. He knows things about her he shouldn't. And he's somehow sofamiliar. As he at turns pulls her close, and then pushes her away, Isadora feels like her heart is being twisted and torn.She soon discovers that her whole future is in jeopardy, and her only hope is to stay away from Tristan. But how can she turn away from the only boy she has ever loved? As a harrowing event looms closer, one that threatens to rip apart her psyche, Isadora must reach deep inside herself and find the strength to change her own destiny. But is she strong enough to do it?",
  "genres": [],
  "author": "Ashley S. Morgan",
  "average_rating": "3.08",
  "url": "https://www.goodreads.com/book/show/13499830-torn"
}