{
  "title": "Haytham The Secret in the Rubble",
  "description": "The air grew thin as a sinister spirit sucked the oxygen from the room. She gasped for breath yet inhaled scalding wet air. Her head felt light; the room began to spin. Another gust of wind blew causing an abandoned floor lamp to topple over with a crash. She spun around and screamed when she saw Falcon standing directly behind her. Frightened, she nearly gave him a beating with the coveted book.“What are you doing in here? Why did you sneak up on me like that?” “I‘m not to let you out of my sight. Travis‘s orders.”She hugged the soft book against her body in an attempt to control her shaking.His impish grin melted into a reverent spirit as his eyes fell upon the book; and his face grew more solemn than she had ever seen it. His eyes went from the book and back on her. “You found it?”She nodded. He smiled but this time there was nothing impish in his grin.“It’s been here all this time.” “Twenty four years,” she whispered, and then, as if she’d just discovered buried treasure, “Want to see if the prophesy is hidden inside?” Readers intoxicated with The Secrets of Moonshine are thirsty for more! In Haytham, Denise Daisy takes you on a cross country trip with Bronwyn and the rogue Falcon delivering another page turning combination of romance and suspense; all the while divulging secrets and introducing some bizarre new characters along the way. The Bronwyn/Travis forbidden love theme continues as Bronwyn finds herself face to face with the lovely Kenalycia after running for her life and accidentally being transported through the portal to Eden. It is there she meets the impious one himself, Abaddon, fighting off his advances as she fights her way back to Travis. Spellbinding, and full of surprising twists and turns, this forbidden love story is well on its way to epic greatness.",
  "genres": [
    "Fantasy",
    "Romance",
    "Paranormal"
  ],
  "author": "Denise Daisy",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/13500483-haytham-the-secret-in-the-rubble"
}