{
  "title": "The Best Vampire Stories 1800-1849: A Classic Vampire Anthology",
  "description": "In this International Book Awards anthology finalist, the best vampire short stories from the first half of the 19th century are unearthed from long forgotten journals and magazines. They are collected for the first time in this groundbreaking book on the origins of vampire lore. Watch the book trailer: www.AndrewBarger.com/bestvampirestori...The cradle of all vampire short stories in the English language is the first half of the 19th century. Andrew Barger combed forgotten journals and mysterious texts to collect the very best vintage vampire stories from this crucial period in vampire literature. In doing so, Andrew found the second and third vampire stories originally published in the English language, neither printed since their first publication nearly 200 years ago. Also included is the first vampire story originally written in English by John Polidori after a dare with Lord Byron and Mary Shelley. The book contains the first vampire story by an American who was a graduate of Columbia Law School. The book further includes the first vampire stories by an Englishman and German, including the only vampire stories by such renowned authors as Alexander Dumas, Théophile Gautier and Joseph le Fanu.As readers have come to expect from Andrew, he has added his scholarly touch to this collection by including story backgrounds, author photos and a foreword titled \"With Teeth.\" The ground-breaking stories are:1819 The Vampyre - John Polidori (1795-1821)1823 Wake Not the Dead - Ernst Raupach1848 The Vampire of the Carpathian Mountains - Alexander Dumas (1802-1870)1839 Strange Event in the Life of Schalken the Painter - Joseph Sheridan le Fanu (1814-1873)1826 Pepopukin in Corsica - Arthur Young (1741-1820)1819 The Black Vampyre: A Legend of Saint Domingo - Robert Sands (1799-1832)1836 Clarimonde - Théophile Gautier (1811-1872)",
  "genres": [
    "Vampires",
    "Horror",
    "Short Stories",
    "Anthologies",
    "Classics",
    "Fantasy",
    "Paranormal"
  ],
  "author": "Andrew Barger",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/13501465-the-best-vampire-stories-1800-1849"
}