{
  "title": "William & Lucy: A Tale of Suspicion and Love",
  "description": "Michael Brown Pens Outstanding Novel of an Untold Romance between William Wordsworth and the Lucy of his poems. LOS ANGELES, Calif. Michael Brown’s remarkable work, William & Lucy, takes place in England at the end of the 18th century, which marked the dawn of the Romantic Era in poetry. Wordsworth, at 28 years of age, encounters a mysterious young woman named Lucy and both are smitten. Rather like Dante and his Beatrice, William and Lucy become one of the more captivating relationships in literature. Romanticism in poetry, as personified by Wordsworth, was marked by meditation, worship of nature, and the decision to abandon classical verse by composing poems for the common man. William Wordsworth and Samuel Taylor Coleridge led the way with the second edition of their book “Lyrical Ballads,” which became the single most important book of poetry in the history of English literature. The Lucy poem in that volume, “She Dwelt Among the Untrodden Ways”, one of five Lucy poems he composed during his lifetime, presents Lucy living in rural Somerset and charts her “growth, perfection, and death” according to literary critic Geoffrey Durant. Lucy’s unresolved identity has intrigued literary historians for ages. Who was she? Where did she come from? Did she ever exist? No one knows. This is William and Lucy’s story… The drama plays out during a time when young Wordsworth and Lucy are beset with personal, political and financial challenges: Lucy, a governess and artist, must fight off the unwanted sexual advances of her employer and he won’t be denied. Her troubles only worsen when she is accused of stealing by the lady of the house. For his part, William’s revolutionary style of poetry is labeled by critics as ‘mere doggerel’; William finds himself due to this and other factors, fast approaching abject poverty. To make matters worse, England is at war with France and the poet is accused of being a French spy due to his outspoken political views, the punishment for which is death by hanging. At long last Michael Brown, through dedicated research and imaginative storytelling, has released the poet laureate from the bondage of his dour portrayal in history and has given us the flesh and blood Wordsworth, a man of adventure and passion. And for the first time ever the author originates the identity of LUCY in a love story that has never been told. To request a complimentary paperback review copy, contact publisher at tarnpublishing@gmail.com. To purchase this book log onto:Amazon.com, Kindle.com and most eBook outlets.About the AuthorMichael Brown has won 3 Emmy Awards, an ACE Eddie Award and a Lifetime Career Achievement Award as a film editor. He is a member of the Directors Guild of America & the Writers Guild of America and has sold ten scripts to ABC, CBS & NBC. He lives in Southern California with his wife, Holly. This is his first novel.William & Lucy * by Michael BrownA Tale Of Suspicion And Love Official Publication Date: April 12, 2012 Available now as an eBook & PODTrade Paperback; $15.95; 358 pages",
  "genres": [
    "Historical Fiction",
    "Fiction"
  ],
  "author": "Michael     Brown",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/13501589-william-lucy"
}