{
  "title": "Jeans: A Cultural History of an American Icon",
  "description": "The story of America’s best-loved garment, from the humble pants Levi Strauss sold to California miners in the 1870s to big-city socialites spending big money—$300 and up—for premium jeans today  Since their emergence over a century and a half ago, blue jeans have been worn by every segment of American society, and exported around the world as a symbol of our civilization. In Jeans, James Sullivan traces the evolution of jeans from a simple utilitarian garment into what fashion critics have called “the American uniform,” the very embodiment of our society’s ethos.  Beginning with the adoption of front-buckled trousers as a style of dress in nineteenth-century America (derided as “fornication pants” by Mormon leader Brigham Young), Sullivan tells the story of the riveted blue jeans’ humble origin as “waist overall” work pants. He then follows their mass production by such regional entrepreneurs as San Francisco’s legendary Levi Strauss and their further popularization as youth clothing and Westernwear in the twentieth century with the rise of such national brands as Lee and Wrangler. Sullivan shows how such film stars as John Wayne, James Dean, Marlon Brando, and Marilyn Monroe evangelized jeans for a new generation, and how in recent decades designer fashion and consumer culture have combined to make them ubiquitous: worn by rappers, hipsters, discount shoppers, and politicians, embodying the fashion and cultural ideas of vastly different segments of society.  Touching on a broad-ranging host of topics—from the rise and fall of natural indigo dyes to the enduring mythos of the cowboy, from the explosion of youth culture in the Baby Boom era to the globalization of the textile industry and the erosion of American manufacturing—Jeans is a history of American culture as told through its pants.",
  "genres": [
    "Nonfiction",
    "History",
    "Fashion",
    "Microhistory",
    "American History"
  ],
  "author": "James  Sullivan",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/1350149.Jeans"
}