{
  "title": "Health and wellbeing millionaire : what if your health and happiness are the secret to your greatest wealth?",
  "description": "Do you love books on health and wellbeing?Discover the Real Secret to Wealth- Health.You hold in your hands the success secrets of the best in the industry. Learn what they know about acheiving physical, emotional, mental and spiritual health, and why millions are now discovering why their health really is their greatest wealth. This book shows you how it is possible to go from where you are to living your BEST life now.In this book you will How to have unlimited health, happiness and wellnessHow to achieve and maintain work life balanceNew discoveries that will motivate you for lifeHow a healthy body and a healthy mind will allow you to achieve your life's goals and dreamsThe secrets to experiencing real happinessWhy our physica, emotional and spiritual health are the real keys to successHow to create health and wealth in your life and businessFeaturing inspiring stories from;PAUL BROWN (Face 2 Face)DONNA RUSCHEN (Transform Coaching)MARK BUNN(Ancient Wisdom Modern Health)DR JOANNA MCMILLAN (Dr Joanna)DR JOHN TICKELL (Dr John TIckell.com)MARIA GANIS (Enosis International)JOHN GEARON (It's All About you)NATALIE COOK (Olympic Gold Medallist)MEGAN WOLFENDEN (BerryHealthy.biz)BRETT HANDRECK (BPH Fitness)LEISA WHEELER (Embracing Health)DR KRISTIAN RONACHER (DrWholebody.com)JENNIFER ATKINS (Jenesis Mind and Body)JUSTIN TAMSETT( JustinTamsett.com)SUSAN DEAN ( Plan Coaching)DR MICHAEL ELSTEIN (Eternal Health)About the AuthorFiona Jones is the creator and 9 times best-selling author of  The Millionaire Book  Series. It was her love of reading and passion for inspiring people that led her to develop the series.Her mission is to inspire millions to make millions by sharing extraordinary success stories through her books.During this time she has interviewed and worked with over 100 super successful entrepreneurs.Fiona has been a full time authorpreneur for the past 5 years, and is the co-founder of Source Publishing Group, a boutique publishing house that helps others to share their message with the world by mentoring them to produce their own book.Through her Millionaire School she aims to share mindset and wealth creation strategies via her mentors and teachers.Fiona started her career in the medical world, working as an ultrasonographer in Obstetrics and Gynaecology. Throughout this rewarding career, Fiona invested in property, mostly in Sydney and on the Gold Coast. Her first property renovation on a block of units in Sydney resulted in a phenomenal profit. She has a natural flair for property, and currently has several projects under development. Fiona holds a Certificate IV in Real Estate, has had a successful business in the beauty industry and has honed her skills through attending seminars and reading extensively on mindset and investment strategies.Some of Fiona's mentors include Dr Wayne Dyer, Dr Deepak Chopra, Dr John Demartini and Shanti Gowans.In her spare time, Fiona volunteers in a school banking role to support and encourage school children to start saving early. She believes anyone can achieve wealth simply by the habit of saving. She is also making plans to fulfil her dream of building a school in Bali with a huge collection of books. She loves to walk, swim, read and practice yoga.Fiona currently lives on the Gold Coast in her 13 acre property, complete with a yoga retreat that she shares with her husband and two children, the local wildlife and menagerie of horses and farm animals.If you are interested in healthy living, health and wellness, health books, health and fitness, health business, healthy lifestyle books, healthy lifestyle you need to read this book.",
  "genres": [
    "Self Help"
  ],
  "author": "Fiona Jones",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/13502206-health-and-wellbeing-millionaire"
}