{
  "title": "Abe Fortas: A Biography",
  "description": "Abe Fortas was a New Dealer, a sub-cabinet official, the founder of an eminent Washington law firm, a close adviser to Lyndon Johnson, and a Supreme Court justice. Nominated by Johnson to be Chief Justice, he was rejected by Congress and resigned from the Court early in the Nixon administration under a cloud of impending scandal. This engrossing book--the first full biography of Abe Fortas--tells his dramatic story.Drawing on Fortas's previously unavailable personal papers, on numerous archives, and on extensive interviews with his family and associates, Laura Kalman, a historian and lawyer, illuminates Fortas's evolution from New Dealer to Washington lawyer to Great Society liberal, and in so doing also provides a unique view of American liberalism from the 1930s through the 1960s.\"There was no single Abe Fortas,\" writes Kalman. \"There was a variety of personae, and Fortas moved comfortably from one to another. Kalman describes Fortas's various personae:* the boy who as \"Fiddlin' Abe\" played the violin in dance bands to earn spending money and who grew to consider chamber music the love of his life;* the Jew who cared more about Israel than Judaism;* the civil libertarian who worked for irascible Harold Ickes as Under Secretary of the Interior during the New Deal, who defended those charged with disloyalty by Joseph McCarthy, and promoted social justice on the Court;* the urbane corporate lawyer whose friends became clients and whose clients became friends;* the brilliant legal tactician who secured Lyndon Johnson's Senate seat in 1948 and whose successful defense of the Gideon case was described by William O. Douglas as \"the best single argument\" he heard in all his years on the Supreme Court;* the Supreme Court justice who willingly risked compromising his judicial integrity to advise President Johnson;* the man who hobnobbed with the powerful yet was powerless to combat the attacks against him when he was a Supreme Court justice, and whose resignation from the Court contributed to the destruction of the liberal agenda for social reform.Reflecting on the various aspects of Fortas's enigmatic personality and the events of his life, Kalman creates a new portrait of the man that is more insightful and complete than any yet published. Engagingly written and superbly researched, this is the authoritative account of Fortas and the legal and political history he helped to shape.",
  "genres": [
    "Biography",
    "Politics",
    "History"
  ],
  "author": "Laura Kalman",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/103950.Abe_Fortas"
}