{
  "title": "The Lies We Tell for Love",
  "description": "“What would you do for love?”“How would you handle the discovery that your marriage was built on lies?”Damon Whitmore is a true go-getter who will stop at nothing to get what he desires. His wife Octavia was no exception. When Damon first saw Octavia he knew he had to have her. He went through great lengths until his mission was accomplished. Now, two years later, he and Octavia share a wonderful and lavish life together. Damon exceeded all of Octavia’s expectations while managing to keep his secrets of deceit and manipulation hidden but what’s done in the dark eventually comes to light and Damon’s lies are slowly beginning to unravel.When a face from Damon’s past re-surfaces, Damon finds himself facing a life alerting dilemma that could cause him to lose the very thing he fought so hard to build—his family with Octavia. Damon refuses to lose and he’ll stop at nothing, including murder, to keep his family in tact.Octavia Ellis-Whitmore never thought she would be a one man woman. Living by a no strings attached policy, she kept her encounters with men strictly sexual. When she met Damon everything in her world changed. Octavia opened her heart and fell hard for Damon. Octavia is now living and loving her life to the fullest. However, history has a way of repeating itself and temptation has a way of finding Octavia. When things at home begin to get rocky, Octavia finds herself struggling between remaining true to the vows she pledged to Damon and exploring her feelings for a new and mysterious stranger—a stranger who has a startling connection to Damon and his past.As the drama unfolds, lies and secrets will be exposed and lines will be crossed on both ends. How far will Damon and Octavia go to protect each other from the other’s transgressions and how many will fall victim to the lies that have been spun in the name of love?",
  "genres": [
    "Suspense",
    "Romance",
    "African American Romance"
  ],
  "author": "Mz. Robinson",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/13502693-the-lies-we-tell-for-love"
}