{
  "title": "Rex and the City: True Tales of a Rescue Dog Who Rescued a Relationship",
  "description": "In this humorous, moving, keen, fun and startlingly original memoir, critically-acclaimed author Lee Harrington shares her story of love, loss, dysfunctional relationships, and the shelter dog who put things right. In 1997, Lee and her then-boyfriend Ed were on the verge of breaking up. Money was tight, their careers were floundering (Lee was an aspiring novelist: Ed was an aspiring documentary filmmaker) and their personalities, frankly, did not mix. Plus, they lived in a crumbling, cramped tenement apartment on the Lower East Side--for which they paid more than they earned. Then, on a fateful day in August , they decided on impulse to visit a nearby animal shelter, just to \"look at\" dogs. In a split-second decision that would change their lives, they brought home a troubled spaniel mix named Wallace. They quickly realized that this dog was more than they could handle--he was aggressive, fearful of humans, untrained and seemingly untrainable. For the first few months of their new lives with this aggressive animal, Lee and Ted struggled with the question--the reality--of whether they could realistically rehabilitate this dog (they even considered bringing him back to the shelter). They also struggled with the question of whether they could make it as a couple. Faced with a new responsibly, they bickered constantly, worried incessantly, cried daily (mostly Lee) and disagreed on nearly every aspect of how to handle the dog. Their disagreements ranged from how to train the dog to where he should sleep to what to feed him. But the one thing they could agree on was that they loved their dog. And slowly but surely, that love helped transform both the dog and the relationship. Both Lee and Ed, through the dog, learned how to love in new and fearless ways. And thus, by rescuing a needy spaniel, they ended up rescuing themselves. Written with keen insight, sparkling humor, piercing honesty and masterful prose, Harrington's memoir leaves the reader with the sense that, while adopting an abused dog can often be a challenge at first, the rewards are limitless. This is an exhilarating book--readers will laugh out loud, smile in recognition, nod in empathy, and/or pause in reflection as Harrington shares both her pains and her joys of her life with a troubled dog. Mostly, readers will be reminded--in a delightful way--that love does indeed conquer all. Especially dog love.",
  "genres": [
    "Nonfiction",
    "Dogs",
    "Animals",
    "Memoir"
  ],
  "author": "Lee    Harrington",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/13503137-rex-and-the-city"
}