{
  "title": "Summer Magic",
  "description": "When her fiance calls off their engagement, veterinarian assistant Lisa Prentice joins the circus in hopes of escaping the everyday grind. But life under the big top isn't quite what she expected. None of the veterinarian's former assistants managed to please their short-tempered boss, and Lisa fears that her days are numbered, too. Michael Figaro, a dashing young trapeze artist, is also caution about whether Lisa can stay, and because of that, he tries to keep his distance. Still, Lisa finds herself overwhelmingly attracted to him. Although Michael is the aerialist, it is Lisa who is flying on an emotional high wire. What happened to her safety net? Will their love survive?This breezy romance follows Lisa Prentice, a veterinarian assistant, as she begins her new traveling with the Jessell and Stern circus. She is interested in continuing the care of an Arabian horse named Ebony that she helped to save while the circus was on a layover in New York. Of course, she has other reasons for \"running away with the circus.\" Her fiance', a prominent lawyer, has recently dumped her for another attorney. Lisa wants to heal by concentrating on her career. Enter Michael Figaro, the star aerialist with the circus and the son of the circus owner. Immediately, there are sparks between the two. However, Michael also has a jealous twin, a trapeze artist named Claudette, and Rita, the pretty aerialist who would like his attention. When Claudette begins to fall in the ring, Michael begins to spend more time with Rita, training her for Claudette's position. Will romance blossom between the two, or will his love for Lisa prevail?This book is an example of the perfect romance. I enjoyed Ms. Voeller's ability to switch between the points of view of Lisa and Michael. I felt I knew all the characters very well...This is a great story to read in one sitting and spend a few hours swept away in the magic of the circus. Reviewed by Bethany Payne, Roundtable Reviews",
  "genres": [
    "Romance",
    "Contemporary"
  ],
  "author": "Sydell Voeller",
  "average_rating": "3.31",
  "url": "https://www.goodreads.com/book/show/13503217-summer-magic"
}