{
  "title": "Be the Inspiration: 7 Ways to Inspire Your World",
  "description": "Be the Inspiration: 7 Ways to Inspire Your World is a leadership book designed for coaches, consultants, thought leaders, change agents, small biz, org leaders, beginning leaders/managers, plus experienced leaders... It is for anyone who really wants to make a difference no matter where he or she is right now. This book takes you from getting inspired personally to being the inspiration to everyone around you. The Be the Inspiration movement is for people who truly want to make a difference. It's time to move people with your message. It is time to mentor, to give back, to love more, to be more... The Be the Inspiration book explains how to use the acronym INSPIRE and you will learn key components of explosive personal and leadership growth. This ebook includes the key concepts that I have been teaching in my leadership coaching program. Testimonial \"What I learned about leadership has supported me in all of my roles, professionally and personally. Sheri helped me to get comfortable with embracing my personal story and the value it brings. Writing my I-story was healing and powerful. Sheri is truly a role model for me, demonstrating that great joy can come through inspiring others.\" Kathryn Quintana, Certified Family Manager Coach You will learn and use the acronym INSPIRE • I- Your compelling “I” story • N-New Beliefs • S- Step into Inspired Action • P- 3 P’s- People, Purpose, Prosperity • I- “I love” (unconditional love) • R- Reaching Out • E- Managing Your Energy and Enthusiasm This book includes: • Concepts I have been teaching in my leadership group coaching classes. • Ideas that have propelled my coaching practice to a global level. • Exercises in each chapter to give you a practical application of each concept. • Stories from people just like you- who have transformed their lives.",
  "genres": [
    "Business"
  ],
  "author": "Sheri Kaye Hoff",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/13503272-be-the-inspiration"
}