{
  "title": "Unspoken Abandonment: Sometimes the hardest part of going to war is coming home",
  "description": "Prepare to walk more than a mile in one soldier's boots as you see exactly what it's like to go to war and face the struggles of coming home. This is as real as it's going to get...Unspoken Abandonment is the story of one man's struggle to return home from the war in Afghanistan, only to find the person he once was may never be the same. Bryan Wood is a military veteran who served during combat operations in Eastern Afghanistan. After returning from combat, he found that his life was falling apart at every turn, and Bryan faced the greatest battle of his life in finding his own peace. He surprisingly found the answer was hidden within a daily journal kept while at war, and Bryan's path ultimately led him to find redemption in the most unexpected of places: love. In a genre filled with war novels, Unspoken Abandonment stands out as the work is brilliantly written, in a narrative form, which takes the reader on a breathtaking journey into the heart of Afghanistan. The reader is then taken back to America to face \"life after combat.\" This story takes a head-on look at the powerful effects of war and post traumatic stress, but the true focus is on the inspirational triumph over this demon that haunts hundreds of thousands of America's bravest men and women. The story is captivating, the message is inspiring, and this is a must-read for every American who cares to take an inside look at what our soldiers face on a daily basis. This amazing story will grab your attention immediately, and it is sure to keep you up past your normal bedtime for more than a few late nights of reading.Read a free introductory sample here: http://bryanwoodbooks.com/sample.pdf",
  "genres": [
    "Nonfiction",
    "Military Fiction",
    "Biography",
    "War",
    "History",
    "Memoir",
    "Amazon"
  ],
  "author": "Bryan A. Wood",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/13503574-unspoken-abandonment"
}