{
  "title": "A Wilderness of Error: The Trials of Jeffrey MacDonald",
  "description": "Academy Award-winning filmmaker and former private detective Errol Morris examines the nature of evidence and proof in the infamous Jeffrey MacDonald murder caseEarly on the morning of February 17, 1970, in Fort Bragg, North Carolina, Jeffrey MacDonald, a Green Beret doctor, called the police for help.  When the officers arrived at his home they found the bloody and battered bodies of MacDonald’s pregnant wife and two young daughters. The word “pig” was written in blood on the headboard in the master bedroom. As MacDonald was being loaded into the ambulance, he accused a band of drug-crazed hippies of the crime.So began one of the most notorious and mysterious murder cases of the twentieth century. Jeffrey MacDonald was finally convicted in 1979 and remains in prison today. Since then a number of bestselling books—including Joe McGinniss’s Fatal Vision and Janet Malcolm’s The Journalist and the Murderer —and a blockbuster television miniseries have told their versions of the MacDonald case and what it all means.Errol Morris has been investigating the MacDonald case for over twenty years. A Wilderness of Error is the culmination of his efforts. It is a shocking book, because it shows us that almost everything we have been told about the case is deeply unreliable, and crucial elements of the case against MacDonald simply are not true. It is a masterful reinvention of the true-crime thriller, a book that pierces the haze of myth surrounding these murders with the sort of brilliant light that can only be produced by years of dogged and careful investigation and hard, lucid thinking.By this book’s end, we know several that there are two very different narratives we can create about what happened at 544 Castle Drive, and that the one that led to the conviction and imprisonment for life of this man for butchering his wife and two young daughters is almost certainly wrong.  Along the way Morris poses bracing questions about the nature of proof, criminal justice, and the media, showing us how MacDonald has been condemned, not only to prison, but to the stories that have been created around him.In this profoundly original meditation on truth and justice, Errol Morris reopens one of America’s most famous cases and forces us to confront the unimaginable. Morris has spent his career unsettling our complacent assumptions that we know what we’re looking at, that the stories we tell ourselves are true. This book is his finest and most important achievement to date.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Crime",
    "History",
    "Journalism",
    "Mystery",
    "Audiobook"
  ],
  "author": "Errol Morris",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/13503531-a-wilderness-of-error"
}