{
  "title": "Mind Reader",
  "description": "* First published by Vicki Hinze writing as Victoria Cole in 1993. First time in ebook. *SHE KNOWS A CHILD’S LIFE IS IN DANGER BUT NO ONE BELIEVES HER.HE KNOWS SHE’S A FRAUD AND IS OUT TO PROVE IT.THEY SEEK THE TRUTH AND DISCOVER THE TRUTH CAN SET YOU FREE . . . OR KILL YOUCaron Chalmers is an empath. A mind reader cursed with imaging only victims. She sees what they see, feels what they feel, endures what they endure and has since she was seven. But even with all the sensory perception and insights, sometimes she fails to save victims in time. Sometimes she interprets the signs wrong—and a year ago, she did exactly that. She messed up and a victim died. Caron nearly died with her. Her “gift” shut down.Now it’s back. There’s another victim—this time a child—and because of the mistake made last year and the shut-down, her police contact, though aware of her many successes, isn’t willing to stake his career on her. Yet he can’t dismiss her and calls in help from a private investigator, Parker Simms: a man with a past as bleak as Caron’s and a specific agenda of his own: proving Caron Chalmers is the fraud he believes her to be.In a hostile alliance, Caron and Parker seek the truth . . . and discover a labrynth of lies and deceptions that require skills and experience they have and trust they don’t but must somehow find before the child becomes another victim lost. Yet trust never comes without costs, and some are too steep to pay. The situation grows desperate. Time for the child’s survival grows short . . . and for Caron and Parker, who must live with the consequences of missteps and wrong moves, the unthinkable happens: Stakes that couldn’t get any higher soar.Praise for MIND READER“This is not a book to be begun at midnight. As tightly controlled a mystery/thriller as I’ve read in a long time. Not to be missed.” – Heartland Critiques“I loved this thrilling, suspenseful, and emotionally moving story–from the first page, I was hooked!” – Rendezvous“A powerful new author. A strong, emotional story of real people. Will worm their way into your heart and stay there.”– The Talisman“A tense, action-filled story of suspense that will keep you turning the pages.”– Affaire de Coeur“Victoria Cole [Hinze/Barrett] writes with a fresh ingenuity and intensity that will make readers eagerly anticipate future works.”– Romantic Times“A story that turns your blood hot–and cold–by turns. Plenty of chills, plenty of thrills.”– Nora Powers, author",
  "genres": [
    "Romance",
    "Paranormal",
    "Mystery",
    "Paranormal Romance",
    "Contemporary Romance",
    "Fiction",
    "Romantic Suspense"
  ],
  "author": "Victoria  Cole",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/13503903-mind-reader"
}