{
  "title": "THE BEAUTIFUL EVIL",
  "description": "How well do you know yourself? If forced to either face your inner demons—escaping with a secured, inner peace or the possibility of complete emotional ruin — how would you fare? The demons? They dwell in all of us. They watch us from our shadows. They ride us—oh, yes, they do—whispering in our ears, tempting us with our own darkness. In the end, many succumb. And you?The Beautiful Evil takes readers through the tumultuous consequences of one woman’s journey into a dark, personal hell in the pursuit of passion, hope and serenity. Scarred by the death of her father at a young age, Constance is a heartbroken child with no place to turn for emotional support. Any discussion regarding her father’s mysterious final days and his scandalous death are forbidden by her cold and distant mother, Madeline. Instead, Madeline dedicates herself to the mission of turning her daughter into a proper debutante. Madeline chooses Constance’s friends, activities and clothing according to her rigid, high society standards. Devoid of self-expression, Constance's only true friend is her reflection in a bedroom mirror.Her adult life, however, proves to be just as passionless and controlled. Constance believes her life will stay this way forever, until a purchase of an antique vase changes everything. When she opens the vase, demons storm into her life. Like bloodthirsty parasites, they dig into her, quickly attaching themselves to her psyche; quietly sucking away her soul.But one of the demons, Tisiphone, befriends Constance—offering Constance a way out of her shut-down heart and emotionally bereft life. Desperate to feel anything, Constance's decisions catapult her into a shadowy world of untrustworthy men, illegal drugs and murder. In the mists of the wreckage, Constance finds herself staring into the abyss, forced to make one, final heart-rending decision if she is to find peace.A captivating thriller that will keep readers questioning reality until the final ultimate act, The Beautiful Evil is a surreal and tense journey into the darkest recesses of the human psyche.",
  "genres": [
    "Psychological Thriller",
    "Suspense",
    "Fiction",
    "Mystery"
  ],
  "author": "Robbi Sommers Bryant",
  "average_rating": "2.88",
  "url": "https://www.goodreads.com/book/show/13504358-the-beautiful-evil"
}