{
  "title": "Cupid Painted Blind",
  "description": "Sweet Little Lies by Liz Schulte - Author of Dark Corners and The Guardian Trilogy The day Femi caught her first bounty she knew this was it; she found her place in the Abyss. However, one mistake, one act of kindness, one beautifully whispered lie could cost her everything--even her life.Autumn's Call by Lisa Rayns - Author of The Curse of the Egyptian GoddessWhen Autumn realizes death is chasing her, she runs only to be stalled by an unresolved ghost. Is he there to help her? Or does he want retribution for his murder?Tell a Soul by Olivia Hardin - Author of Witch Way BendsHe’s the dependable one. The strong and steadfast one. Still, there’s one woman who has always turned his firm resolve on end. Langston is surprised beyond belief to find Kristana again, and this time without a husband. Has fate finally given them the chance to be together? Kristana can’t escape her intense attraction for the strange giant Langston, but the murmuring voices in her head are threatening to drive her mad. Can she find a way to trade one torment for another and thereby find true love?The Siren Sarina by C.G. Powell - Author of Spell CheckedBeing a siren is not all that it is cracked up to be, especially when you play with the gods. Sarina, like all good sirens, has a penance for sex and not with just anyone. This time her prey is Ares the god of war and lover to Aphrodite. Not that Sarina minds stepping on the goddess of loves toes, but when Ares gifts her with the powers of a god, Zeus can’t help but to intervene.Fool Moon by Cait Lavender - Author of Cowboy MoonAll Jack saw when he looked at Carlie was perfection until she ripped out a man's throat. Confused by the pull she had on his heart, he is left with the choice to chase after the love of his life or to be left howling at the Fool Moon.When Opportunity Haunts by Stephanie Nelson - Author of The Gwen Sparks SeriesWith an eternity as the Angel of Death before him, not much could get under Dorian Hade's skin--that was until he met Gwen Sparks. She shuts down all of his advances and insists they are just friends. Dorian takes matters into his own hands and tricks Gwen into a romantic weekend away from her ex-boyfriend at a haunted bed and breakfast.",
  "genres": [],
  "author": "Liz Schulte",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/13505753-cupid-painted-blind"
}