{
  "title": "Tudor Rules: How Anne Boleyn Helped Me Survive High School",
  "description": "Can't get enough of the Tudors? Read Tudor Rules, a modern-day tale with plenty of Tudor intrigue and romanceFind out what happens when Amanda, a suburban teen, attempts to use Tudor rules of behavior to win the boy of her dreams and get back at the boy who rejected herTudor Rules echoes much of the drama of the Royal Tudor court, with betrayals, low-cut necklines, and a not-to-be missed musical theater production. With the help of her ladies in waiting, Amanda succeeds in transforming herself into the kind of girl that attracts Brandon, the King of her high school, but learns, when it's almost too late, that in getting what you want, you can lose everything you care about.Praise for Tudor Rules\"Amanda's attempt to live by a series of outrageous but surprisingly useful 16th-century maxims leads her on a journey to self-knowledge and bravery that's filled with romance, competition, and costume design. Giggly with backstage gossip and stinging with sibling rivalry, Tudor Rules is a delightful read.\" -E. Lockhart, author of The Disreputable History of Frankie Landau-Banks and The Boyfriend List\"Tudor Rules was an amazing book. I had the hardest time putting the book down. I loved this book so much!\" -Aurelia Polly, Teen Reviewer.In Tudor Rules, Libby Schmais brilliantly captures the fun, effervescent side of teenage angst. In Amanda Berenson’s slightly nerdy, funny, and believable teenage voice, Tudor Rules explores the arcane courtship rituals involved in a high school theater production, a period version of High School Musical, complete with a plague epidemic. Distilling the lessons of Ann Boleyn’s ill-fated relationship with Henry VIII, Amanda applies Tudor logic to our Facebooking century, finding her way through the highs and lows of high school drama to a surprising but satisfying conclusion. -- Abby Bardi, author of The Book of Fred.\"Ever stylish and wry, Libby Schmais tells the tale of a teen obsessed with all things Tudor. Experiencing high school through the lens of Anne Boleyn, a \"nobody\" is propelled from her shell into the limelight. She learns invaluable lessons of love, fashion, friendship and self esteem along the way\". -Debbie Hrbek, Entertainment Lawyer",
  "genres": [
    "Young Adult",
    "Tudor Period"
  ],
  "author": "Libby Schmais",
  "average_rating": "3.05",
  "url": "https://www.goodreads.com/book/show/13505882-tudor-rules"
}