{
  "title": "Perón: A Biography",
  "description": "Latin America has produced no more remarkable or enduring political figure than Juan Perón. Born to modest circumstances in 1895 and trained in the military, he rose to power during a period of political uncertainty in Argentina. A shrewd opportunist who understood the needs and aspirations of the country's workers, Perón rode their votes to the presidency and then increased their share of the nation's wealth. But he also destroyed the independence of their unions and suppressed dissent. Ousted in a coup in 1955, he wandered about Latin America and finally settled in Spain, where he masterminded an astonishing political comeback that climaxed in his reelection as president in 1973.Joseph Page's engrossing biography—the first full-length study of the enigmatic Argentine—has been more than eight years in preparation. Based upon interviews on three continents, never-before inspected Argentine and U.S. government documents and exhaustive research, Page's book spans Perón's formative years; his arrest and dramatic rescue by the descamisados (shirtless ones, or workers) in 1945; his relationship with the now-mythic Evita; the violence and mysterious murders that punctuated his career; his tragic legacy, personified by his third wife, Isabel, who assumed the presidency after his death under the influence of a Rasputin-like astrologer; and the continuing appeal of Peronism in Argentina. Page's study of Argentine-American relations is particularly penetrating, especially in its description of the struggle between Perón and U.S. ambassador Spruille Braden.Joseph Page's ambitious, absorbing book sheds much-needed light on one of the most fascinating and least understood political figures of our times. His masterful portrait of this complex man will be required reading for anyone interested in Argentina, Latin America or the phenomenon of charismatic leadership.",
  "genres": [
    "History",
    "Biography",
    "Politics",
    "Spanish Literature",
    "Nonfiction",
    "Biography Memoir"
  ],
  "author": "Joseph A. Page",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/1350615.Per_n"
}