{
  "title": "The Forbidden Claim",
  "description": "US Marshall Jinx Collins is an outspoken, free-spirited, and fearless woman. It's that same fearlessness, however, that tends to get her into trouble. Jinx questions her life prior to being adopted. When those questions lead her to a murderer who's about to be transported into the witness protection program, Jinx decides to kidnap him to see if she can uncover the truth. Jed Kane has worked undercover in the human trafficking ring for years. When Jed accepts a job to disguise himself as one of his worst enemies and take a ride from the correctional facility to a secured location, he certainly had not planned on being abducted by Jinx Collins. Jed's uncertain as to how he feels about her touchy-feely hands and loose lips-unsure if they irritate him or if they are awakening his badly behaving desires. Jed knows he must first find out what the fanatical little lady wants with a murderer before he can act on whatever he's feeling. Straight away Jinx is attracted to the resilient and enticing Jed Kane-the only man who hasn't backed down from her candor. While Jinx discovers that the questionable criminal may be able to assist her in finding out the truth about her past, Jed vows to save Jinx from her daring self. Once Jinx starts to understand what Jed feels for her-he wants to own her-she demands that he succumb to the raging frenzy. Jed allows himself to seduce her body, submitting himself to that dominant need. But haunted by a world of unlawful ownership, Jed forbids his cold heart to stake its dangerous claim on Jinx Collins. Locked away in a dark basement, a little boy is waiting to be rescued-and Jinx's past holds the key to his prison. If Jinx can finally find the truth which holds her fears, and if Jed can forgive himself for his past, then not only might they be able to save the boy, but they might also discover that their carnal desires really derive from their own prison... an inescapable prison of love. To My Readers: The Forbidden Claim is a story about a man who for years has worked undercover in a world of malevolence. He's so deep into his cover that when Jinx Collins clashes into his life, he fears he will become the very evil he's been fighting against. Jed wants to own Jinx, and in his heart he knows that is forbidden. He surrenders to his badly behaving desires and allows himself to claim ownership of Jinx's body. But Jinx wants him to take ownership of her heart. By the time I finished this story, Jed Kane had broken my heart more times then I'd like to admit, but in the end I still fell in love him . . . I hope you do too",
  "genres": [
    "Contemporary Romance",
    "Romantic Suspense",
    "Erotica"
  ],
  "author": "Kelly Gendron",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/13506364-the-forbidden-claim"
}