{
  "title": "The Little Women Letters",
  "description": "Vibrant, fresh, and intelligent, The Little Women Letters explores the imagined lives of Jo March’s descendants—three sisters who are both thoroughly modern and thoroughly March. As uplifting and essential as Louisa May Alcott’s Little Women, Gabrielle Donnelly’s novel will speak to anyone who’s ever fought with a sister, fallen in love with a fabulous pair of shoes, or wondered what on earth life had in store for her. With her older sister, Emma, planning a wedding and her younger sister, Sophie, preparing to launch a career on the London stage, Lulu can’t help but feel like the failure of the Atwater family. Lulu loves her sisters dearly and wants nothing but the best for them, but she finds herself stuck in a rut, working dead-end jobs with no romantic prospects in sight. When her mother asks her to find a cache of old family recipes in the attic of her childhood home, Lulu stumbles across a collection of letters written by her great-great-grandmother Josephine March. In her letters, Jo writes in detail about every aspect of her life: her older sister, Meg’s, new home and family; her younger sister Amy’s many admirers; Beth’s illness and the family’s shared grief over losing her too soon; and the butterflies she feels when she meets a handsome young German. As Lulu delves deeper into the lives and secrets of the March sisters, she finds solace and guidance, but can the words of her great-great-grandmother help Lulu find a place for herself in a world so different from the one Jo knew?Some things, of course, remain unchanged: the stories and jokes that form a family’s history, the laughter over tea in the afternoon, the desire to do the right thing in spite of obstacles. And above all, of course, the fierce, undying, and often infuriating bond of sisterhood that links the Atwater women every bit as firmly as it did the March sisters all those years ago. Both a loving tribute to Little Women and a wonderful contemporary family story, The Little Women Letters is a heartwarming, funny, and wise novel for today.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Romance",
    "Contemporary",
    "Adult Fiction",
    "Book Club",
    "Chick Lit"
  ],
  "author": "Gabrielle Donnelly",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/10397646-the-little-women-letters"
}