{
  "title": "All Shall Be Well; And All Shall Be Well; And All Manner of Things Shall Be Well",
  "description": "Meet Burt Hecker - a mead-drinking, tunic-wearing medieval re-enactor from upstate New York in Tod Wodicka's debut, a modern-day Arthurian quest that introduces one of the most winning oddball characters to come along in years.Meet Burt Hecker: a mead-drinking, tunic-wearing medieval re-enactor from upstate New York. He prefers oat gruel to French fries because potatoes were unavailable in Europe before 1200 AD; and, at war with the modern world, he enjoys hosting large-scale re-enactments at the Victorian bed and breakfast he calls home.But Burt has some serious problems. After an incident involving the New York State police and an illegally borrowed car, Burt is forced to join a local music therapy workshop to manage his anger. He gallantly accompanies the group to Germany for a festival celebrating the music of the visionary saint Hildegard von Bingen--but he has no plan to return home. His real destination is Prague: he must find his estranged son Tristan, who, he believes, has lost his way in the Bohemian city.As we move between past and present, the tragic details of Burt's life are gradually revealed: the recent death of his beloved wife; the circumstances that separate him from his children; his complicated relationship with his mother-in-law. And we begin to understand, with heart-wrenching clarity, Burt's eccentric and poignant devotion to a time other than one's own.Wildly inventive and mesmerizing, Tod Wodicka's debut is a modern-day Arthurian quest that introduces one of the most winning oddball characters to come along in years.",
  "genres": [
    "Fiction",
    "Novels",
    "Literature",
    "Literary Fiction",
    "Contemporary",
    "Book Club",
    "Drama"
  ],
  "author": "Tod Wodicka",
  "average_rating": "3.22",
  "url": "https://www.goodreads.com/book/show/1350704.All_Shall_Be_Well_And_All_Shall_Be_Well_And_All_Manner_of_Things_Shall_Be_Well"
}