{
  "title": "Bloodline",
  "description": "In a thrilling masterwork that will make you rethink your perceptions of life and death, New York Times bestselling author James Rollins takes you to the edge of medicine, genetics, and technology, revealing the next evolutionary leap immortality—a horrifying truth that is locked inside the BloodlineGalilee, 1025. Infiltrating an ancient citadel, a Templar knight uncovers a holy treasure long hidden within the fortress's the Bachal Isu—the staff of Jesus Christ—a priceless icon that holds a mysterious and terrifying power that promises to change humankind forever.A millennium later, Somali pirates hijack a yacht off the coast of the Horn of Africa, kidnapping a young pregnant American woman. Commander Gray Pierce is enlisted for the covert rescue mission into the African jungle—for the woman is no rich tourist; she's Amanda Gant-Bennett, the daughter of the U.S. president.Suspicious that the kidnapping masks a far more nefarious plot, Gray must confront a shadowy cabal, one who has been manipulating events throughout history . . . and now challenges the current presidency.For this sensitive mission, SIGMA is aided by a pair of special operatives with unique former Army Ranger Captain Tucker Wayne and his military war dog, Kane. But what should be a straightforward rescue turns into a fiery ambush and a deadly act of betrayal as Gray and his team discover that the hostage is a pawn in a shattering act of terrorism with dark repercussions. And the danger is only beginning. . . .Halfway around the world, a firebombing at a fertility clinic in South Carolina exposes a centuries-old conspiracy to manipulate our genetic code. With time against them, SIGMA must race to save an innocent unborn baby, one who holds the key to a mystery and whose very existence raises questions about the nature of humanity, Could you live forever?Would you live forever?",
  "genres": [
    "Thriller",
    "Fiction",
    "Adventure",
    "Mystery",
    "Action",
    "Mystery Thriller",
    "Science Fiction"
  ],
  "author": "James Rollins",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/13507960-bloodline"
}