{
  "title": "The Gem Cardoza Chronicle",
  "description": "This is the second book in the Dead Hunger series. Just thought we'd make it clear in case you found this one first . . .As Flex, his niece Trina, Gem, Hemp and Charlie brave the wild world teeming with the walking dead, they make up the rules as they go along. Flex Sheridan was an electrician before the world took a nasty turn; Gem, an artist. Hemp is a scientist who specializes in epidemics and also carries in his bag of tricks a mechanical engineering degree. Charlie is a metal and punk rocker in her mid-twenties who has learned how to take out two zombies at once with her crossbow. Each one of them has their own story.This one is Gem's chronicle.They know they need to stay safe. But they also know that to hole up and hide away is to allow the creatures who crave human flesh to walk the world forever. Join with them as they struggle to balance their natural tendencies toward self-preservation with their strong desire to rid the world of the zombie scourge. Our band of machine gun-toting nomads moves from place to place in fortified vehicles, keeping their eyes peeled for survivors, and zombie battles ensue at nearly every turn. But this is not a world where love dies. This is a moment in history when human connections and things of beauty are more important than ever; things to be embraced and held tightly to.So hop in the Crown Victoria with the ballistic steel body and the swiveling AK-47 on the top, and hang on to your seat as Gem powers the car through hoards of zombies and gets her precious Trina and Flex where they need to be. Learn what Hemp and Charlie discover in the lab – a huge clue to what caused the epidemic that has 90% of the world hunting the rest. But after you meet this group, youll begin to wonder: Who are the hunters, and who are the hunted?",
  "genres": [
    "Zombies",
    "Horror",
    "Fiction"
  ],
  "author": "Eric A. Shelman",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/13508580-the-gem-cardoza-chronicle"
}