{
  "title": "The Vampire King",
  "description": "Having exited the stage, the next stop was the subbasement. That's where all of the heating and cooling equipment are located. As I was about to turn off the lights in the storage area, something moved and caught my eye. That was odd, so grabbing a stick I headed for the area in question, and then gave it a good poke. And in a blink of an eye, they had me pinned down and spread eagle on the floor before it even registered in my head. Four of them in a coordinated attack, one on each arm, and one on each leg I couldn't move. These bats had long fangs, and stronger than anything that comes to mind, holding me down. It was like some choreographed dance with death as they synchronized the timing of sinking their fangs into each limb, pinning me even harder to the floor. There was no escape, and no understanding of what was happening. Then out of shadows' appeared an old looking bat several times the size of the ones that had me pinned down. Looking confident, taking it's time, strolling along as if playing with its prey to impress the others in a show of power and spectacle before it made its kill, almost prancing if you will. While this was going on the fangs of the other bats already sunk into my limbs began to feed. You could feel the life disappearing as the high powered vacuums in their mouths began to drink my blood. This was really pissing me off. The big one walked on my chest and began to expand its mouth as its fangs grew to what seemed like inches. As it stretched its head forward and upward about to thrust its face down into my throat. All I could think of is if you are going to kill me by biting me I am going to bite you on the way out. At that moment I shifted my weight and the big monster on my chest lost its balance and its throat fell into my mouth and I bit as hard as I could and hung on... Death was near; the white light at the end of the tunnel was showing itself. The images of long ago dead relatives presented themselves and shoved me with both hands in the chest and said it's not your time yet. Before my eyes could focus there was a warm transforming, tingling feeling running down my throat, it was the blood of the big bat.Things began to come into focus, as the incredible power began to enter my limp body. The monster in my mouth was flinging like a limp doll. The skin on my arms and legs closed in on the fangs of the smaller bats as my body began to withdraw all of the blood they had taken from me. You could see them reacting in horror as they tried to make their escape. Before I could understand what was going on I had already sucked the blood out of 3 of the bats and cast their dead husks a side and was about to eat the last one when I heard a weak cry in my head barely able to speak asking for help. It shocked me back to reality.There hidden behind some spare theatre seat cushions was the most pathetic looking bat I had ever seen. Thirst, I'm hungry, must feed all of these jumbled or garbled images flowing into my mind from this tiny and pathetic looking creature. You want some of this don't you as I handed over the last bat that had attacked me? My grip was still tight on the animal who had tried to kill me. But I gently presented it to the bat that was nothing but skeleton and to my amazement the bat that looked almost dead starting drinking its blood until there was nothing left. You could see the helpless creature coming back to life before my eyes. And within seconds it seemed to be back to normal. \"Ah\" it walked over to me and rubbed its head against me in gratitude. I had just made a friend.Looking down my work uniform was covered in blood and ripped to shreds. The shock of what had just happened was wearing off as the reality of it set in. I walked over to the mirror to get a better look and there was no reflection. This must be a dream, it couldn't be real, why is this happening to me, must be losing my mind. As those and other questions were whirling around in my head a calm and clear voice spoke to me telepathically and said\" You have just drank the blood of one of the oldest vampires on the planet and absorbed it's power you are not human anymore.\" I spun around and saw the little bat calmly staring up at me. “You have much to learn, but not much time to prepare, the coven is aware of what just happened. We have the ability to read thoughts and see images over vast distances. You just ate a ranking member of the high consul and it is forbidden for anything other than a bat to drink the blood of the ancients. It is how they have held on to power for so long. With a body frame as large as yours you have the ability to drink more blood and increase your power at a faster rate. This makes you a threat to them. They know if they do not take the blood from you soon it will become impossible to defeat you later. They are in Romania asleep because it is daytime there when they awake they will make their plans and prepare to come find you and kill you and me too because I did not die when the others did.\"",
  "genres": [],
  "author": "H.F. Galloway",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/13509894-the-vampire-king"
}