{
  "title": "Darkness Awakened",
  "description": "Praised by JR Ward as a \"paranormal star!,\" New York Times bestselling author Stephanie Rowe rivets readers with her thrilling entry into the dangerous, sensual world of the Calydon warrior, where lust rules, honor thrives, and death looms over all. No warrior is safe from his own darkness, or from the woman destined to love and destroy him.  When his blood brother goes missing, immortal warrior Quinn Masters will break every rule of his kind to save him, including teaming up with the sensuous, courageous woman destined to be his ultimate destruction.  Haunted by a brutal past, Illusionist Grace Matthews will risk everything to rescue her kidnapped sister, even if it means putting her life in the sinfully capable hands of an immortal warrior whose ravaging kisses and intense passion propel her ruthlessly toward a fateful destiny she can't afford to believe in.  The Legend of the Calydons: The Calydons are a race of ancient immortals cursed with a dark side. Each Calydon is destined to meet his soul mate, to be so drawn to her that he is unable to resist bonding with her through the rituals of his race, but their destiny is to destroy each other and all they care about the moment their bond is complete.  Books in the Order of the Blade series: DARKNESS AWAKENED (Book One) DARKNESS SEDUCED (Book Two) DARKNESS SURRENDERED (Book Three) FOREVER IN DARKNESS (novella)(Book Four) DARKNESS REBORN (Book Five) DARKNESS ARISEN (Book Six) DARKNESS UNLEASHED (Book Seven) INFERNO OF DARKNESS (Book Eight) DARKNESS POSSESSED (Book Nine) SHADOWS OF DARKNESS (Book Ten) HUNT THE DARKNESS (Book Eleven) DARKNESS REVEALED (Book Twelve, Coming Soon!)  \"A fast-paced plot with strong characters, blazing sexual tension and sprinkled with witty banter, Darkness Awakened sucked me in and kept me hooked until the very last page.\" ~Literary Escapism  \"Rarely do I find a book that so captivates my attention, that makes me laugh out loud, and cry when things look bad. And the sex, wow! It took my breath away. The author keeps the tension high from page one. The pace kept me on the edge of my seat, and turning the pages. I did not want to put this book down... This one is a must read.\" ~D. Alexx Miller, Alexx Mom Cat's Gateway Book Blog  *This novel is approximately 450 pages, and there are excerpts from other books by the author in the back of the book.  ABOUT THE AUTHOR: New York Times and USA Today bestselling author Stephanie Rowe is the author of more than 40 novels, including her popular Order of the Blade and NightHunter paranormal romance series. Stephanie is a four-time nominee of the RITA® Award, the highest award in romance fiction. She has won many awards for her novels, including the prestigious Golden Heart Award. She has received coveted starred reviews from Booklist, and Publishers Weekly has called her work \"[a] genre-twister that will make readers...rabid for more.\" Stephanie also writes a romantic suspense series set in Alaska. Publisher's Weekly praised the series debut, ICE, as a \"thrilling entry into romantic suspense,\" and Fresh Fiction called ICE an \"edgy, sexy and gripping thriller.\" Equally as intense and sexy are Stephanie's contemporary romance novels.",
  "genres": [
    "Paranormal",
    "Paranormal Romance",
    "Romance",
    "Fantasy",
    "Vampires",
    "Urban Fantasy",
    "Supernatural"
  ],
  "author": "Stephanie Rowe",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/13513078-darkness-awakened"
}