{
  "title": "The Greatest Love Story of All Time",
  "description": "The Greatest Love Story of All Time is a laugh-out-loud debut novel from the Marie Claire blogger, Lucy RobinsonIt's Fran's thirtieth birthday and things are good . . .She's bluffed her way into a Very Posh Job and her outlandishly handsome and talented boyfriend Michael is escorting her to the Ritz with a bulge the shape of a ring box in his pocket.But something has gone wrong. Very wrong. By the end of the evening Fran is howling in bed with a bottle of cheap brandy and one of Michael's old socks.In her quest to figure out why her life has suddenly gone down the pan, Fran comes up with a failsafe plan: live like a badger, stalk a stranger called Nellie and cancel her beloved Gin Thursdays in favour of drinking gin every night. But then Fran's friends force a very different plan on her and it's nowhere near as fun. How could eight dates possibly make her feel better?But eventually she agrees. And so begins the greatest love story of all time . . .Praise for Lucy Robinson:'The new Marian Keyes . . . romantic and laugh-out-loud hilarious' Cosmopolitan'An absolute must-read' Huffington Post'Prepare for public-transport belly laughs' Glamour'Refreshingly playful' RedLucy Robinson is the author of The Greatest Love Story of All Time, A Passionate Love Affair with a Total Stranger and The Unfinished Symphony of You and Me. Lucy worked in theatre and then television documentaries before starting a blog for Marie Claire about her laughably unsuccessful foray into the world of online dating. She did not meet a man during this time but she did become a novelist: every cloud has a silver lining. She now lives in Bristol with her partner, The Man, whom she met when she took off to Buenos Aires to become a bohemian writer in 2010.Twitter: @Lucy_RobinsonFacebook: www.facebook.com/LucyRobinsonWriterInstagram: RobinsonWriterWebsite: www.lucy-robinson.co.uk",
  "genres": [
    "Romance",
    "Chick Lit",
    "Contemporary",
    "Fiction",
    "Contemporary Romance",
    "Adult",
    "Humor"
  ],
  "author": "Lucy Robinson",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/13514150-the-greatest-love-story-of-all-time"
}