{
  "title": "Spiritual Growth: Being Your Higher Self",
  "description": "Note: The eBook version has been revised and updated, however the information and teaching is essentially the same as the printed version.This book is a national and internationally best-selling classic with a timeless message. It has been translated into over 24 languages.Once in a decade comes a book that can affect people at the very core of their experience. A contemporary masterpiece in the tradition of the world's great spiritual writings, Spiritual Growth is such a book. It contains the essence of the contemporary spiritual path, embodying joy, growth, and increased aliveness. The teachings are profound and inspirational.Open the book to any page. Quiet your mind, read, savor the words. The effect is instantaneous. Your mind is uplifted, your heart is opened, and your body experiences the sensations of peace.The techniques are practical. Spiritual Growth teaches readers how to move to higher consciousness, when to be an active force, and when to surrender and let things happen. Spiritual Growth will teach readers how to: be their Higher Selves in their everyday life, create a vision of their higher purpose, and manifest what they want rapidly and easily.Readers will learn to work with light for healing and growth, to connect with the Universal Mind for enhanced creativity, and to link with the Higher Will to carry out their higher purpose. A series of meditations (each of the 21 chapters has one) take the reader step-by-step through the process of spiritual growth.These easy-to-learn processes taught by Orin, a wise and gentle spirit teacher, have helped hundreds of thousands take a quantum leap, accelerate their spiritual growth, and live their lives with more joy, harmony, peace, and love.Spiritual Growth gives you tools to lift the veils of illusion, see truth, expand and contract time, raise your vibration, achieve higher states of consciousness, open your heart, and know yourself in new, more loving ways.Spiritual Growth teaches you to have more satisfying relationships with others by using the skills of non-attachment, right use of will, being transparent to others' energies, and communicating as your Higher Self. You will learn to become a source of light and to grow through world service.Speaking always to the higher aspect of the reader, Orin offers the next step in spiritual growth for those who want to know more about who they are, why they are here, and what they came to do.",
  "genres": [
    "Spirituality",
    "Self Help",
    "Nonfiction",
    "Metaphysics",
    "Philosophy",
    "New Age",
    "Collections"
  ],
  "author": "Sanaya Roman",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/135144.Spiritual_Growth"
}