{
  "title": "A Single Shard",
  "description": "The Barnes & Noble ReviewLinda Sue Park's novels are distinctive for their focus on various aspects of Korean history. A Single Shard, the winner of the 2002 Newbery Medal, is a tenderly rendered tale about a 12th-century Korean boy named Tree-ear, who must overcome a host of obstacles in order to attain his life's dream. Orphaned as a toddler, Tree-ear (named after a type of mushroom that grows out of a tree without the benefit of parent seeds) has been raised by a kindly, crippled weaver named Crane-man (so named because he has only one good leg). Over the years, they have eked out a meager but relatively happy existence living under a bridge and scavenging for food, though never stealing or begging. The town they live in, Ch'ulp'o, is renowned for the many artisans who craft the area's unique clay into beautiful celadon pottery. Tree-ear has dreams of one day creating his own pottery, and for this reason, he starts spying on one of the most gifted craftsmen in town, a cranky old codger named Min. When Tree-ear accidentally breaks some of Min's work, he offers to pay for the damage by working off the debt, hoping Min will eventually offer him an apprenticeship. Things don't go as planned, however. The curmudgeonly Min isn't an easy man to work with, and Tree-ear's dream of creating his own pottery seems more unattainable with each passing day. Things come to a head when Min is offered a shot at a royal commission and Tree-ear offers to carry samples of the artisan's work to the royal court -- a hike of many days across some of Korea's most unforgiving country. The journey is fraught with setbacks that test Tree-ear's courage and integrity, but in the end, he comes to know a triumph of heart, mind, and spirit that will leave him, and Korean history, forever changed.This delightfully endearing tale is not only entertaining; it's inspirational and educational. Tree-ear's decisions and actions in the face of several ethical dilemmas exemplify honor, honesty, and integrity at their best, setting a fine example for young readers to follow. And Park's vivid portrayal of this era in Korean history offers a colorful introduction to a culture and an art form that might otherwise go unknown. (Beth Amos)",
  "genres": [
    "Historical Fiction",
    "Young Adult",
    "Fiction",
    "Middle Grade",
    "Childrens",
    "Historical",
    "Juvenile"
  ],
  "author": "Linda Sue Park",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/1351442.A_Single_Shard"
}