{
  "title": "A Year Down Yonder",
  "description": "Richard Peck, whose hysterical historical novel, A Long Way to Chicago, was a 1999 Newbery Honor Book, does it again. This time out, Peck wins the 2001 Newbery Medal for A Year Down Yonder, the sequel to his 1999 award winner, which introduced the indomitable and fearsome figure of Grandma Dowdel as viewed through the eyes of her grandson Joey. Once again Peck takes his readers to the tiny Illinois town where this coolly conniving grandmother lives, but now we see her through the eyes of her granddaughter, 15-year-old Mary Alice. It's 1937, and while rumor has it that the worst of the Depression is over, the \"Roosevelt recession\" is firmly in place. It's not bad enough that Mary Alice's dad has lost his job, or that her parents are being forced to move into a \"light housekeeping\" room, or that her older brother Joey has gone off to plant trees out west with the Civilian Conservation Corps. Now Mary Alice must spend a year living with her feisty and formidable grandmother in a hick town where the other kids in school think of her as the \"rich Chicago girl.\" Grandma Dowdel is well known about town and most of the residents cower in fear at the mere sight of her. It's a fear well justified, for the woman has little tolerance for fools, a rifle she knows how to use, and a knack for cooking up outrageous schemes. At first, Mary Alice finds herself an unwitting (and often unwilling) accomplice to some of Grandma's more shocking manipulations, but as time goes by, Mary Alice discovers a knack of her own when it comes to conniving. Peck evokes a wonderful sense of time and place, depicting the harsh realities and simple lifestyles of these Depression-era folk through catchy colloquialisms and delightful details. Grandma Dowdel is a truly unique and unforgettable character capable of generating awe as well as side-splitting laughter. The supporting cast is equally entertaining, from the bumbling antics of the local farm boys to the snooty-nosed members of the local DAR group. And as Mary Alice struggles to deal with some typical (and not so!) adolescent problems -- peer pressure, poverty, love pangs, and the indignities of using a privy -- Grandma Dowdel teaches her some of the larger lessons in life, including her own brand of justice and the real meaning of unconditional love.\n\n--Beth Amos",
  "genres": [
    "Historical Fiction",
    "Young Adult",
    "Fiction",
    "Middle Grade",
    "Childrens",
    "Humor",
    "Historical"
  ],
  "author": "Richard Peck",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/1351516.A_Year_Down_Yonder"
}