{
  "title": "I'm Starved for You",
  "description": "In this first installment of the saucy and sinister new Byliner Serial, “Positron,” Margaret Atwood takes readers on a thrill ride to the near future, where paranoia reigns but sex has definitely not gone out of style.  “I’m Starved for You” introduces us to the world-weary inhabitants of Consilience. This gated community isn’t your average American town, but in a dystopian society imagined by the visionary, internationally bestselling Atwood (“The Handmaid’s Tale,” “The Year of the Flood”), it may be as close as anyone can hope to get.  Husband and wife Stan and Charmaine are among thousands who have committed to a new social order because the old one is all but broken. Outside the walls of Consilience, more than half the country is out of work, gangs of the drug-addicted and disaffected menace the streets, warlords disrupt the food supply, and overcrowded correctional facilities churn out offenders to make room for more.  The Consilience prison, Positron, is something else altogether. The very heart of the community and its economic engine, it’s a bold experiment in voluntary incarceration. In exchange for a house, food, and what the online brochure hails as “A Meaningful Life,” residents agree to spend every other month as inmates.  Stan and Charmaine have no complaints—until the day Stan discovers a note under the fridge of the house he and Charmaine must share with another couple while they’re back inside Positron. It’s a missive of erotic longing, pressed with a vivid lipstick “I’m starved for you!” it breathes. If Stan rarely thought about the house’s other residents before—they’ve never met them and don’t know their names; it’s not allowed—now he can’t stop thinking about them, especially the note’s sex-addled author, so unlike his girlish wife, Charmaine. He has to meet her, but in this highly ordered and increasingly surveilled world, disorderly thoughts are a risk, and breaking the rules has dire consequences.  Equal parts “Tom Jones” and “Brave New World,” this hilarious yet harrowing story will leave you eager to return to Positron—but as a voyeur, not an inmate.  ABOUT THE AUTHOR  Margaret Atwood is the author of the internationally bestselling novel “The Handmaid’s Tale” as well as forty other books of fiction and nonfiction, including “The Blind Assassin,” “Oryx and Crake,” and “The Year of the Flood.” Her most recent collection of stories is “Moral Disorder.” She has written about utopias and dystopias in “In Other SF and the Human Imagination.” Atwood was awarded the Booker Prize in 2000 for “The Blind Assassin.”  PRAISE FOR \"I'M STARVED FOR YOU\"  \"What makes this story so impressive is Atwood’s management of detail. She sets up a completely plausible universe, as seamless as a stocking, and shockingly believable. In fact, she is so good at imagining such a society that it’s obvious she’d make a great Minister of Protocol.” —Aritha Van Herk, “The Globe and Mail”",
  "genres": [
    "Fiction",
    "Dystopia",
    "Science Fiction",
    "Short Stories",
    "Canada",
    "Speculative Fiction",
    "Science Fiction Fantasy"
  ],
  "author": "Margaret Atwood",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/13515663-i-m-starved-for-you"
}