{
  "title": "Boost Your Self Esteem",
  "description": "Boost Your Self Esteem includes a free bonus of over 200, consecutively listed, Power Affirmations! In this ‘Boost Your Self Esteem’ ebook, Stephen Richards, the foremost authority on mind power, has exerted a great deal of his expertise in helping you build and boost your self-esteem. This is a step-by-step guide to live the life that you truly want to. Certainly you can skip through the book, but if you value yourself then you will find the worksheets and the ‘TO DO’ plans will help you plan your rise to high self-esteem. This is not a quick read, it is quite interactive and will require some serious insight into yourself, and you may relate fully to the new you at the end of it. Take the self-esteem test in the book. Find out what characteristics people with great self-esteem display. Discover the simple things you can do immediately to start restoring self-esteem. This is a serious book from former BAC (British Association of Counsellors) counsellor and clinical hypnotherapist turned self-help guru Stephen Richards. He has helped over quarter of a million people turn their lives around, now it is your chance to secure self-worth and the self-esteem you so richly deserve. See more about Stephen Richards here: www.cosmicordering.netFROM THE AUTHORSome may see this book as means to an end and apply themselves to what it asks of them, but some will briefly look through it and fall back into their old life. Both ways are correct! The first place where self-esteem begins its journey is within us. For us to regard others as worthy, we have to begin by regarding ourselves as worthy. Self-esteem can really be far-reaching in that every aspect of our lives may at one point be affected by it. In the event that our self-esteem is low, we would typically live rather boring lives. Your happiness and joy in life is determined by your self-esteem.",
  "genres": [
    "Self Help",
    "Nonfiction"
  ],
  "author": "Stephen Richards",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/13515982-boost-your-self-esteem"
}