{
  "title": "Dark Passage",
  "description": "Jen takes refuge in a rundown mansion when her life falls apart. To escape reality she finds herself choosing between the world of the living and the dead. She begins having vivid experiences with a beautiful male entity who longs to be her soulmate. Her childhood friend, 19 year old Ivy, has come from a rough past and has always been different. She learns she has the ability to communicate with the dead and as time passes other supernatural gifts emerge. Ivy will stand against the evil that would separate a love that transcends time and her true destiny emerges. Jen & Ivy are drawn into the compelling world of the dark side and propelled on the most important journeys of their lives. “Let’s go Jen. It won’t do him any good if we are all caught”. With one final glance behind her, Jen urged her horse forward, and toward the safety of the mountains. Her heart was heavy and she immediately thought of the other realm. Her hope was that they were aware of what had happened and would help. Chaos was already breaking out; and the world was in danger of slipping back to a time of great darkness, reminiscent of the Middle Ages. In the quiet of early dawn she hears his distant voice \"you are beautiful. I love you always\".... ****\"This is not the high school romance type book. Characters are well developed and facing issues that are suitable for an adult who doesn't want the typical high school girl worries. Great story, characters grab you and full of twists. can't wait for part two and an excerpt is at the end. We need more \"grown up\" books like this\"! - Deborah\"Great book! I stayed up all night and read the first 16 chapters and couldn't put it down\" - Adena\"This book starts out strong grabs you and does not let you go to the end and leaves you wanting the next book in the series.Character are compelling you find yourself rooting for Jen and Ivy yet still feeling for all the others in hopes they find their way. Truly a must read\"- Heidi. Watch for book 2 to this 3 book series! ! It is in review now and Receiving great reviews. Coming live end if March / early April.",
  "genres": [
    "Paranormal",
    "Fantasy",
    "Romance",
    "Young Adult",
    "Fiction",
    "Angels",
    "Mystery"
  ],
  "author": "M.L. Woolley",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/13516090-dark-passage"
}