{
  "title": "Releasing You From The Past: Healing Past Hurt Through Forgiveness",
  "description": "This audio from the The Releasing Your From series, by international best-selling mind power author Stephen Richards, is your first step on an unforgettable healing path. This non-religious audio is one of the most powerful ways to help release you from your past through forgiveness.Many are under the misconception that to forgive someone is to let them off the hook. Not so! Many of you believe that you have to forgive the perpetrator for any acts of wrongdoing against you in order to move on, and in so doing you hold back on this very major point. Holding back simply means that all of this negative energy implodes inwards … into yourselves. Chakras just cave in with this amount of catastrophic vibrational negativity. This Releasing You From The Past: Healing Past Hurt Through Forgiveness audio CD - through the power of forgiving others and yourself - will help you move on through healing the hurt of the past, but without compromising your values. You will be able to make peace with your mistakes and get on with your life.Now you can break free from the hurtful action from your past, which can have a powerful influence on your present life. Carrying grudges and resentments for years can cause great pain. The goal of seeking or granting forgiveness is designed into the framework of this audio and will help move you beyond your feelings of hurt, anger or guilt of wrongdoing.Nearly every one of us has been hurt by the actions or words of another. Even just being criticized is enough to destabilize us, to move our psyches to seek shelter from the hurt being reigned upon us. From childhood onwards we have endured hurt, perhaps your mother or father criticized you, right up to your work colleagues sabotaging your life plane. So we go on holding these grudges right up until we die. Now you have the opportunity to change all of that with this powerful audio CD.",
  "genres": [
    "Self Help",
    "Spirituality"
  ],
  "author": "Stephen Richards",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/13516138-releasing-you-from-the-past"
}