{
  "title": "Inspire Me: Unlock Your Inner Happiness",
  "description": "Whatever spiritual path you follow, Cosmic Ordering, Law of Attraction, New Thought ... this ‘Inspire Me’ audio CD is your time, time to chill and recharge and to put the smile back on your face with this feel good factor for getting you into the positivity zone of mind, body and spirit harmony and positivity. The narration of Stephen Richards and the vocals of Lisa Tenzin-Dolma weave a special kind of magic around you.Now you can step out of the ordinary and into something special ... it changes everything. This is not just an uplifting feast for the ears, but also food for the soul. Just take time out to play this anywhere and anytime and your spirits will begin to pick up ... then soar. Do you want that feeling of jumping, dancing, laughing and singing to be as strong as it once was? Well here it is! Each of the ‘Inspire Me’ tracks is related to the law of attraction’s discipline of Cosmic Ordering and can make a difference to how you feel. There tracks communicate a feeling of mind, body and spirit harmony and positivity. Be prepared for the narration of Stephen Richards and the vocals of Lisa Tenzin-Dolma to weave a special kind of magic around you. Because when your heart opens then you will begin to understand what you have been missing. Just like your body needs sustenance, your mind, heart and soul also need the strength to go through your day.This CD will help calm the spirit, re-establish the daily equilibrium of life and encourage happiness and well-being. A breathtaking change to some of the nonsense that is produced to cater for Western ears, this should press all the right buttons. ‘Inspire Me’ is intended to achieve a state of positivity and happiness within yourself and your life. This can lift you, quite simply, into a world of your own ... and that feeling will linger on. This is your time, so make it special. With this track you will step out of the ordinary and into something special. Track Titles:1. Brand New Day2. Message from My Heart3. Let Me Feel Love Again4. Fulfil My Wish5. Childhood Dreams6. Give Me Strength",
  "genres": [
    "Self Help"
  ],
  "author": "Stephen Richards",
  "average_rating": "4.82",
  "url": "https://www.goodreads.com/book/show/13516179-inspire-me"
}