{
  "title": "Tiger Paw",
  "description": "As a serial killer wreaks havoc on Wall Street, dismantling a corrupt financier’s empire one body at a time, FBI profiler Scott Forrester uncovers the deadly secret of a demon-worshipping Hindu cult that is determined to change the very fabric of society. Firmly in their assassin’s crosshairs, Scott Forrester is forced underground to stop the killing spree. But will he survive the deal he must make with the Devil to thwart their satanic plan?Royal Palm Literary Award Winner for Best Thriller of 2012 –from the Florida Writers AssociationBest Indie Thriller Nominee – Kindle Book Reviews“A great variation to the thriller genre…the author blended a detective storyline with a thread of the esoteric which makes it stand out from other thrillers. The ending leaves you guessing… a well thought out story, with lots of action. Recommended for all lovers of thrillers and action books.” – Midwest Book Review“5 Stars! - This book had my juices flowing-my heart pounding, blood boiling, anger, rage, PISSED OFF. It had me thinking of all kinds of things. So applicable to what is going on today. Believable. For a debut novel, I was really impressed.” – Sherry Fundin, Fundinmental Book Reviews“This book goes far beyond a 5 STAR rating! Charles A. Cornell is a magnificent storyteller and his debut novel is brilliant. Tiger Paw was a very tumultuous read for me. It touches on everything that's wrong in government and Wall Street. I can imagine the challenge he faces when writing the next novels. It will be hard to top this.” – Laura Thomas, FU Only Knew Book ReviewsMore on Tiger Paw...In Charles A Cornell’s critically acclaimed mystery thriller, Tiger Paw, FBI Special Agent Scott Forrester investigates a series of bizarre murders at the center of a Wall Street stock scam. The killer’s most recent victim – billionaire Wall Street mogul Matthew Carleton - was drowned in a bath tub of red wine. The FBI believes the murders are the work of a professional hit man. But the killer leaves behind an indecipherable message that defies explanation. Scott Forrester teams up with criminal psychologist, Dr. Rajeev Chandra. They decode the killer's cryptic warning. It points to an East Indian cult whose religious icon - an altarpiece lost for centuries and now on display in the US - is haunted by a disturbing past. As the billionaire financier’s Wall Street empire is dismantled one body at a time, they encounter sinister forces deep inside the corridors of power in Washington that are determined to silence anyone who uncovers their connection with the cult. The conspiracy is spreading like a cancer and is on a mission to change the very fabric of society. Dogged by his own demons – his troubled brother, a disabled Afghan war veteran; an adversarial boss hell bent to destroy his career; and a failed love life - Scott Forrester follows the trail of the elusive killer as he wreaks havoc from Wyoming to the Bahamas. Forrester falls into the cult’s carefully laid trap. Exposed to the assassin’s crosshairs and forced to take his fight underground, Scott Forrester must confront the cult’s menace in all its physical and spiritual forms. And the ultimate price to end this nightmare? Cross the no man’s land that divides good from evil… to bargain his soul with the Devil himself. Tiger Paw is a thriller cloaked in mystery, psychological suspense and international intrigue. A story of people who have sold their souls in exchange for wealth and power. A story of greed, deception, and revenge. And a story of one man’s struggle to triumph against the greatest evil he has ever faced.",
  "genres": [
    "Mystery",
    "Thriller",
    "Crime"
  ],
  "author": "Charles A Cornell",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/13517241-tiger-paw"
}