{
  "title": "Lovesick: a novelistic memoir",
  "description": "A wild adventure through Thatcher’s Britain, set against a backdrop of the British Indie Music Scene. Naïve, defiant and incisively witty, Isobel Blackthorn fashions her own path through the counter-culture, poverty and politics of the eighties. By turn absurdly funny, sexually charged an heartrendingly sad, Lovesick is an unforgettable, tragi-comic tale of a young woman’s search for her identity.Pretty girl, nice smile is all Isobel can say about herself. That, and she’s working class. What matters to her is she’s different. After devouring Camus’ The Outsider she realises for reasons strange to her, she is strange to the world. And she’s searching for love. It’s a disastrous mix. Her unquenchable need for romance leads her to Lanzarote, Canary Islands, were she takes unconventionality to extremes. She’d determined to be truly herself, face her fears and go with the flow. But her obsession with the charismatic Miguel, her thirst for danger and an acquired taste for cocaine launch her into the island’s criminal underworld.\"Seen through the eyes of a woman of heart and mind, this is a story that takes the reader on a tempestuous journey through the music and politics, the frenzies and phobias of Thatcher’s England in the 1980s. The passions of the era are enacted in Isobel Blackthorn’s headlong pursuit of love and sexual fulfilment, leading her eventually to the fabled beauty of Lanzarote in the Canary Islands, a type of anti-England. The hedonism Isobel ‘adopts’ on Lanzarote as a corrective to the bleak outcomes of her political commitment and her quest for love take in, unavailingly, free-wheeling experiments with a smorgasbord of drugs. What shines through in these pages is Isobel Blackthorn’s determination, despite setbacks and episodes of despair, to engage with life truthfully. \" Robert Hillman, The Honey Thief",
  "genres": [],
  "author": "Isobel Blackthorn",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/13517614-lovesick"
}