{
  "title": "The Quartet",
  "description": "The Quartet (#11 of the Sensual Erotica Series)A sensual \"quickie\" about two passionate couples together for one night. - (Approx. 5100 words) Perfect for mobile eReaders - have access to a quickie whenever you need a fix.Amy is thrilled when she gets an invite to enjoy a foursome with \"The Boys\" and Greg's new girlfriend. However, Amy is also a little nervous. It's the first time she has ever felt the touch of another woman. The night of ecstasy gets complicated when emotions are exposed that go deeper than simple lust. Has her plan of casual sex backfired into a hornet's nest of heartbreak?Just when Amy thinks she has her sex life figured out, an old friend comes back into the picture. Instead of the ménage they've enjoyed in the past, he wants to try a foursome with her. Although Amy is anxious about being with another woman, the idea of playing with \"Her Boys\" again squelches her fears. She is unprepared for the emotions that come to light during the passionate night. To further complicate matters, there is a huge surprise waiting for Amy when she arrives back home.Excerpt from The Quartet:Greg lifted his shot up. \"To new adventures.\" They slammed down his toast.After another refill, Amy said with a nod to Sheila, \"To our newest member.\"Sheila smiled and replied, \"It is nice when four people can share something so intimate together.\" Amy stared at Sheila with new admiration. She'd been afraid that Sheila was a stick-in-the-mud, but it was obvious there was a lot more to the woman.After the third shot, the group was considerably looser. Troy walked over to Amy and began rubbing her back. Amy felt chills and closed her eyes, giving into the pleasure of Troy's talented hands.Greg copied his cousin and started massaging Sheila's shoulders. When Amy opened her eyes, she was startled to see Sheila watching her intently. They both giggled. Here they were, two strangers about to get naked in front of each other and copulate with their respective partner...Adult Reading Material (18+) This book is for mature audiences only and contains sexually explicit content.* If you enjoy this erotic story check out the series, Sensual Erotica. The short stories are stand-alone scenarios made to excite and titillate, but all are interconnected. Enjoy the palate of sensual experiences contained in the series as Amy and Troy make their way in the world. Pick and choose the situations that arouse you, or be a little naughty and sneak a peek at the ones you've always been curious about.",
  "genres": [],
  "author": "Red Phoenix",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/13518019-the-quartet"
}