{
  "title": "Amy's Choice",
  "description": "Amy's Choice (The Last Book of the Series - #14 of Sensual Erotica)A sensual \"quickie\" about three men fighting over one girl - Designed to get you in the mood. (approx. 11,000 words)Amy becomes a local celebrity when she is nearly killed by falling mums. The accident steals her memory, giving old boyfriends the chance to vie for her attention. The men finally get a fair chance to win her over on their own terms without her memories of Troy Dawson. The love she feels for one gets mixed up with the love she once felt for Troy. An engagement looms - which lover will she choose?Amy becomes a national news sensation when she almost dies from a falling flowerpot. A couple having a fight over the romantic merits of chrysanthemums nearly kill Amy when the woman throws them out the window. Amy loses her memory, leaving her open to rekindling old relationships. Past boyfriends come to vie for her love while Troy is off in India. Circumstances force her to make a quick decision when she is proposed to by one of her old beaus. The time has come for Amy to make her choice.Excerpt from Amy's Choice:\"The doctor says the accident caused temporary memory loss, but he assures me I will get them back. I hope I do...\" Amy felt the tears coming again.\"Miss Amy, please don't cry.\" Troy Evans came to her and wrapped his arms around Amy again. She closed her eyes. Even though she didn't remember him, Troy's embrace felt warm and safe like his name.\"Give her space,\" Brad snapped. \"She doesn't even know who you are. You think she wants strangers hanging on her like that?\"Troy slowly pulled away, looking down at her. \"Amy, you've got to remember me. You and I had rousing good times together. I'd be happy to tell you about them if he,\" Troy nodded at Brad, \"would give us a moment alone.\"\"I am not leaving Amy alone with a cad like you.\"\"Amy never mentioned anyone named Brad and I was with her the week before the accident.\"Amy looked over at Brad again. He gazed at her with such intensity it made her stomach flutter. \"Amy and I have a long history together. Longer than yours I can assure you.\" Brad took her hand again and squeezed it gently. \"Circumstances separated us, but that's in the past.\" He moved in close. \"I'm here for you, Amy.\"Adult Reading Material (18+) This book is for mature audiences only and contains sexually explicit content.* If you enjoy this erotic story check out the series, Sensual Erotica. The short stories are stand-alone scenarios made to excite and titillate, but all are interconnected. Enjoy the palate of sensual experiences contained in the series as Amy and Troy make their way in the world. Pick and choose the situations that arouse you, or be a little naughty and sneak a peek at the ones you've always been curious about.",
  "genres": [],
  "author": "Red Phoenix",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/13518024-amy-s-choice"
}