{
  "title": "A Whisper From Eden",
  "description": "Perched high upon lofty cliffs, overlooking the turbulent waters of the Missouri River, the great Mandan tribe could survey the river and the wild prairies of North Dakota. From these walled fortresses, like ruling kings from medieval times, the rich and powerful Mandan knew how to wield magic, magic taught to them by the great god, Lone Man, one of The People from Above. According to the Mandan myths and lore, the People from Above sped through the skies in vehicles that were like comets and landed on the prairie. When Lone Man visited, he taught them magic because they were special. They were his chosen ones. This is a unique take on real events, with magic, the supernatural, and . . . the promised return of the god Lone Man. The year is 1837. Clayton Pinckney is enthralled with the Indians. He is a sixteen-year-old, aspiring writer who has little interest in his advantaged life. He is handsome, well educated, and the son of a wealthy plantation owner. However, his enthrallment with the Indians is a shame to his family. Clayton is determined to prove his is not just a foolish boy with silly ideas, such as his ideals about the Indians. He feels he can ignite imaginations and provoke curiosities with his writing, A heated clash with his father is all that is needed to prompt him to run away from home in search of that wild and exotic Mandan tribe and follow his calling.After a dangerous trek, the naïve Clayton finds them and is thrilled with this unique tribe, their elaborate culture, and their amazing appearance. Many have blond hair and others have white hair. They are like nothing he has ever seen or even imagined. At first, he is completely enamored with what looks to him like a utopian society. He becomes very involved with the flamboyant Chief Rained for Many Days and falls hopelessly in love with the chief’s magical young daughter, the exotic and, at times, very frightening, Crying Wind. However, as he learns more about the Mandan, he finds he has a big problem – much of what he has seen is too unbelievable to reveal.",
  "genres": [
    "Historical Fiction",
    "Folklore",
    "Native American"
  ],
  "author": "Phoenix Reads",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/13518532-a-whisper-from-eden"
}