{
  "title": "Reflecting on Midnight",
  "description": "Reflecting on Midnight contains Brad Convissar's four previously-released novellas. Purchased separately, the four stories (which combine for 76,000 words) will cost you $4.96; purchased together in this collection, only $3.99. Now what does it include?\"Dogs of War\"- After divorcing his wife of two years, Gary Lettner thinks he has found the perfect house for himself and Molly, his eight-year-old dachshund. But when the throats of the dead begin to cry out in a voice that only Molly can hear, and when evidence of past atrocities committed in his new home begin to surface, Gary finds himself an unlikely participant in a brutal quest for vengeance. Some crimes are too horrible to go unpunished, no matter the cost.\"King of the Merge\"- William Brookshire is just an average college student on the way to a midnight rendezvous with the girl who used to be the love of his life when a spur-of-the-moment street race turns his life upside down. He knows it isn't his fault when the driver of the Porsche runs a red light, knows it isn't his fault when the driver dies of the injuries he sustained during the horrible accident, but William just can't convince himself that he is completely free of responsibility. And when a vision of the driver starts appearing in his room, starts stalking him around campus, starts appearing in his car, it threatens to drive him mad.\"Fotoshop of the Gods\"- Douglas McIntire is just your average college student, out buying replacement parts so he can fix his broken computer. But when he leaves the small computer store, he caries with him not just new parts, but a mysterious disk as well, one that contains a disturbing program. A program that allows Doug to bend and warp reality as he sees fit. Will he use it responsibly? Or will he allow the program's dark voice to drag him down a dark path? Could you resist the temptation if given the power to reshape your little corner of the world?\"I Never\"- Welcome to The Tavern at the Edge of Forever. I hope you survive your experience.Marco Conti and his three brothers, the children of Chicago-area crime boss Adolpho Conti, have been abducted from their homes in the dead of the night. Their destination is The Tavern at the Edge of Forever, an almost-mythical place where the most powerful criminal masterminds in the world gather to work out business deals and to work out their differences. A place where games are played and where the losers usually end up dead. Marco can't imagine what twist of fate has brought the four of them to The Tavern, but he is determined to make sure that they all make it out alive. Of course, survival is much harder when the deck is stacked against you by the Mistress of the Tavern herself.About the Author",
  "genres": [
    "Thriller",
    "Fiction"
  ],
  "author": "Bradley Convissar",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/13519437-reflecting-on-midnight"
}