{
  "title": "Whisper",
  "description": "When Calliope Evans starts suffering monster headaches and hearing mysterious voices, she wonders if her fragile teenage psyche has finally cracked. After all, being the only girl without a cell phone in a world where you only show up on the social GPS if you’re in the network is a total stressor. Throw in a fretful yet loving mother who is always up her \"arsenal\" just waiting for a boy to take advantage of her or a drug to cloud her inhibition- well, there’s only so much junk a typical melodramatic, eyeball rolling teenager can handle, right?Newsflash. Callie Evans is anything but typical. When she discovers just how unique she truly is, Calliope’s life morphs into a story that surprises her at every turn. On her sixteenth birthday, Callie is visited by a pair of outlandish Micros, pint sized angels whose job it is to coach newbie angels in training. These crazy Micros are Silas, flamboyant and fashion frenzied, and Jules, an Italian Diva with a flair for leather bustiers, cigarettes and heavy artillery.Silas and Jules feed Callie a tale she can only laugh at. Until she discovers it’s true. After, not only does she have to find a way to hide her identity from the civilized world (including Joshua Pride, the super-hot new guy at school who harbors a secret of his own), but she has to learn to navigate her new world, fulfill her revealed purpose and, eventually, simply survive.Whisper is the story of an exceptional teenager faced with exceptional challenges within impossible circumstances. Its language resonates with young people. Its humor and whimsy add necessary lightness to the heavy themes that face today’s teens- themes they yearn to understand but aren’t often spoken of. Whisper delicately touches on the unique and sometimes desperate situations that young people of today’s moral wasteland often find themselves wading around in, unprotected and unprepared. With spiritual undertones and a mysterious teen romance, Whisper is the whole package – a feel good page turner that leaves the reader wanting more, even on the very last page. It is the first novel in a series of three.",
  "genres": [
    "Amazon",
    "Romance",
    "Paranormal"
  ],
  "author": "Dana Faletti",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/13519126-whisper"
}