{
  "title": "Scorched Skies",
  "description": "FEAR THE HEAT...The White King has crossed the line, sounded the horn, sent out the wolves. When blood is shed and life is lost, the reality of Ari’s position as both hunter and prey finally sets in. It seems her father will stop at nothing to force her will to his own, and distracted by Charlie’s latest mistake and her seemingly misguided attraction to Jai, Ari never thought to fear anyone else but the Jinn King. Blindsided and attacked, Ari learns a new wolf has joined the hunt. A dark sorcerer believes he knows a way to bleed the power of the Seal and wield it as his own, and he is even less patient than The White King.The War for the Seal has only just begun and it’s time for Ari to take a stand. The time of being prey is over.Now Ari must become the hunter.To journey into the dark world of the Jinn, begin Ari’s story with book one of the Fire Spirits series, Smokeless Fire ( B005XP1VBY), available in Kindle and paperback.REVIEWS for Scorched Skies (Fire Spirits #2)“Just wow. The uniqueness, realness, and thrills that Samantha brings to this series always seem to blow me away. I adored this installment from beginning to end!” 5/5 stars Shortie Says Reviews“There are enough twists and turns to keep you on edge, fully engaged and turning the page anticipating what's next. Of course you never really see what's coming. That's the beauty of this story.” 5/5 stars TSK TSK, What to read? Reviews“There is never a dull moment. I was constantly in sweet, torturing agony as the romance picks up…Scorched Skies will have you jumping out of your skin for Borrowed Ember!” 5/5 stars Reading by the Beach Reviews“Scorched Skies is a great followup to Smokeless Fire. There is action, suspense, and romance in abundance…the next book cannot come soon enough.” Maddy Edwards, author of One Black Rose series.“I strongly recommend this series to paranormal romance lovers! Personally, I love reading about the Jinn; they are a refreshing change from the typical paranormal species.” 4/5 stars Reading, Eating & Dreaming Reviews",
  "genres": [
    "Fantasy",
    "Paranormal",
    "Young Adult",
    "Romance",
    "Paranormal Romance",
    "Magic",
    "Urban Fantasy"
  ],
  "author": "Samantha Young",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/13519607-scorched-skies"
}