{
  "title": "Rex Randall and the Jericho Secret",
  "description": "Rex Randall and the Jericho Secret by Vince CarterThe ladies say \"Move over James Bond. Welcome to the 21st century.\"Rex Randall is the world famous author, known for his Incognito series of books and movies. His main character, Jason Hendrix, has a loyal following around the world, eager to read about his next exploits. This is especially so, since it is widely known that his life is modeled on the real lifestyle of Rex.It is an unusual lifestyle, only dreamed of by most. That’s because, in real life, Rex lives with five beautiful women in a polyamorous, non-monogamous relationship. It is also a luxurious lifestyle, fueled by the enormous wealth generated by all those books and movies. They want for nothing and enjoy the many pleasures of life. They work hard, play hard, and rest easy.In his series of thriller books, Rex’s alter ego, Jason, is a chameleon-like investigator that assumes numerous identities to pursue his assignments. In order to give the stories an increased level of realism, Rex spends countless months, himself, thoroughly researching key elements of the story concept by accepting assignments in real life and donning various cover identities. Then, with exacting detail, Rex would be able to convert his actual experiences into an exciting series of scenes for Jason in the novels. It is the distinguishing factor that gives his books that air of authenticity, no matter how unusual the premise.In preparation for his next novel, Rex and his five female loves, engage in their reality based research by going undercover and posing as security consultants to the U.S. Secret Service. In the process, they discover the Jericho Secret. This secret, unknown even to the Secret Service, is so explosive that, if revealed to the world, could put the President of the United States in mortal jeopardy.",
  "genres": [
    "Suspense"
  ],
  "author": "Vince  Carter",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/13519815-rex-randall-and-the-jericho-secret"
}