{
  "title": "Blood of the Son",
  "description": "Skye Morrison has a lot in common with today’s college graduates; she’s neck-deep in student loan debt and desperate for a job. For four years, the nightlife of Austin, Texas (home of Skye’s Alma Mater) has satiated her thirst for good music, a revamp in fashion and men – especially local musician, Jameson Doyle, but her spot as a waitress at Drop Kick Dan’s bar wasn’t going to cut the slack. A personal life troubled by a hounding ex only made matters worse. Skye was never the damsel in distress type, but when an unexpected public shouting match with her ex turned physical, a savior disguised as a heavenly gorgeous Irishman came to her rescue. Archer Rhys, a businessman with a lot to offer, doesn’t exactly sweep Skye off her feet but she couldn’t help but to be captivated by his ravenous good looks. When Archer makes Skye a lucrative job offer as his personal assistant for his new downtown Austin club, The Mausoleum, she quickly finds out that she may have gotten more than she bargained for. In this breakout novel, J.L. McCoy takes the reader on an indulgent descent into a modern-day counterculture of nighttime extravagances. Close your eyes, succumb to intense passion, sip a Vampire’s Kiss and let the pounding of the club music overtake you. With animated detail, you’ll find yourself on an unimaginable journey deep into the lair and grasp of Archer Rhys and his mind games. Distracted by Jameson’s charm and blinded by Archer’s allure and generous paycheck, Skye’s new life invokes the reader’s empathy as she’s surrounded in a whirlwind of desire, deceit and even death. Blood of the Son; this isn’t your little sister’s vampire novel.Approximately 84.020 words",
  "genres": [
    "Vampires",
    "Paranormal",
    "Romance",
    "Urban Fantasy",
    "Paranormal Romance",
    "Fantasy",
    "Supernatural"
  ],
  "author": "J.L. McCoy",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/13520274-blood-of-the-son"
}