{
  "title": "Pillow Stalk",
  "description": "HUMOR AND DANGER MELD PERFECTLY…  \"A multifaceted story...plenty of surprises...And what an ending!\" – New York Journal of Books Interior Decorator Madison Night might look like a throwback to the sixties, but as business owner and landlord, she proves that independent women can have it all. But when a killer targets women dressed in her signature style—estate sale vintage to play up her resemblance to fave actress Doris Day—what makes her unique might make her dead. The local detective connects the new crime to a twenty-year old cold case, and Madison's long-trusted contractor emerges as the leading suspect. As the body count piles up, Madison uncovers a Soviet spy, a campaign to destroy all Doris Day movies, and six minutes of film that will change her life forever. Praise for PILLOW STALK: \"Make room for Vallere’s tremendously fun homage. Imbuing her story with plenty of mid-century modern decorating and fashion tips, not to mention a steady patter of Doris Day trivia, Vallere debuts a well-paced cozy series. Her disarmingly honest lead and two hunky sidekicks will appeal to all fashionistas and antiques types and have romance crossover appeal.\" – Library Journal\"If you are looking for an unconventional mystery with a snarky, no-nonsense main character, this is it. Madison is a strong leading lady who lands in lots of quirky situations. Instead of clashing, humor and danger meld perfectly, and there’s a cliffhanger that will make your jaw drop. You’ll look forward to the second Mad for Mod mystery.\" – RT Book Reviews\"A charming modern tribute to Doris Day movies and the retro era of the 50s, including murders, escalating danger, romance... and a puppy!\" – Linda O. Johnston, Author of the Pet Rescue Mysteries\"Pillow Stalk is an intricately plotted and well-written book, I really enjoyed the story. I can't imagine decorating a house in the style from Doris Day's movies but it makes fine reading.\" – Leanne Davis, Fresh Fiction\"It was fast and furious, had a lot of info, characters, suspects, and even a few tangled romances. I love mysteries where I can’t figure out who the real killer is until the end, and this was one of those. The novel was well written, moved at a smooth pace, and Madison’s character was a riot.\" – ChickLit Plus\"If you love the Technicolor movies of Doris Day and Rock Hudson and watch Mad Men for fashion tips, author Diane Vallere has written a mystery that will appeal to the mid-century modern heart.\" – Joanne Hamilton-Selway, ReaderToReader.com Books in the Mad for Mod Humorous Mystery Series:  \n   MIDNIGHT INK (prequel novella in OTHER PEOPLE’S BAGGAGE) \n   \n    PILLOW STALK (#1)\n   \n   THAT TOUCH OF INK (#2) (April 1, 2014) \n   WITH VICS YOU GET EGGROLL (#3) (April 2015) \n \nPart of the Henery Press Mystery Series Collection, if you like one, you'll probably like them all...",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "Cozy",
    "Fiction",
    "Chick Lit",
    "Contemporary",
    "Amateur Sleuth"
  ],
  "author": "Diane Vallere",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/13520172-pillow-stalk"
}