{
  "title": "Death Troupe",
  "description": "The Jerome Barron Players have a problem. Their writer, Ryan Betancourt, has killed himself under mysterious circumstances and they need a replacement right away. The Players, unofficially known as Death Troupe, come together once a year to perform a high-end murder mystery play written specifically for that season’s host town. Their writer has to possess special talents, as there’s a wager involved: If the townspeople can correctly identify the murderer before the show’s final act, they don’t have to pay for the engagement. So far, no town has ever won the bet.Enter Jack Glynn, original writer for the Barron Players. He and Ryan wrote two Death Troupe engagements before Ryan stole Jack’s girlfriend, lead actress Allison Green. Although Jack found fame in Hollywood after quitting the troupe, eccentric director Jerome Barron convinces him to return for one show: The upcoming engagement in the Adirondack town of Schuyler Mills.It is only then that the troupe’s advance man, private investigator Wade Parker, tells Jack of the strange events which surrounded the group’s previous engagement in Red Bend, California. A local retiree killed himself a few days after the performance—an act Wade suspects was prompted by the storyline of Ryan’s final play. He also reveals that Ryan was greatly unnerved by anonymous third parties who had interfered with the group’s marquee clue distribution.This is one of the unique features of Death Troupe: As the performance approaches, clues are sprinkled through the town in a variety of ways, from fake headstones bearing characters’ names to real players acting out their assigned roles. In Red Bend, a stranger pretending to be a troupe member had dropped clues that were surprisingly accurate, and Ryan had reacted badly to this—perhaps badly enough to kill himself.Events take a sinister turn shortly after Jack arrives in the small, snow-covered village of Schuyler Mills. Someone leaves a bizarre arrangement of black roses and plastic skulls in his hotel room. Ryan’s missing notebook from the Red Bend engagement turns up, and it contains an alarming tale of psychological harassment. The people of Schuyler Mills are enthusiastic about Jack’s presence, but he knows that many of them, from the local community theater group to the town mayor, could have ulterior motives.As the weeks go by, someone begins distributing clues that Jack doesn’t recognize, from a plastic head stuck in an ice-fishing hole to confidential information scrawled on a billboard. Reading Ryan’s notebook, Jack begins to fear that the same web that snared his old writing partner in Red Bend is being spun around him in Schuyler Mills.",
  "genres": [
    "Mystery"
  ],
  "author": "Vincent H. O'Neil",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/10403945-death-troupe"
}