{
  "title": "The Violinist's Thumb: And Other Lost Tales of Love, War, and Genius, as Written by Our Genetic Code",
  "description": "From New York Times bestselling author Sam Kean comes incredible stories of science, history, language, and music, as told by our own DNA.  In The Disappearing Spoon, bestselling author Sam Kean unlocked the mysteries of the periodic table. In The Violinist's Thumb, he explores the wonders of the magical building block of life: DNA.  There are genes to explain crazy cat ladies, why other people have no fingerprints, and why some people survive nuclear bombs. Genes illuminate everything from JFK's bronze skin (it wasn't a tan) to Einstein's genius. They prove that Neanderthals and humans bred thousands of years more recently than any of us would feel comfortable thinking. They can even allow some people, because of the exceptional flexibility of their thumbs and fingers, to become truly singular violinists.  Kean's vibrant storytelling once again makes science entertaining, explaining human history and whimsy while showing how DNA will influence our species' future.Genes, freaks, DNA : how do living things pass down traits to their children? --The near death of Darwin : why did geneticists try to kill natural selection? --Them's the DNA breaks : how does nature read --and misread --DNA? --The musical scores of DNA : what kinds of information does DNA store? --DNA vindication : why did life evolve so slowly --then explode in complexity? --The survivors, the livers : what's our most ancient and important DNA? --The Machiavelli microbe : how much human DNA is actually human? --Love and atavisms : what genes make mammals mammals? --Humanzees and other near misses : when did humans break away from monkeys, and why? --Scarlet A's, C's, G's, and T's : why did humans almost go extinct? --Size matters : how did humans get such grotesquely large brains? --The art of the gene : how deep in our DNA is artistic genius? --The past is prologue --sometimes : what can (and can't) genes teach us about historical heroes? --Three billion little pieces : why don't humans have more genes than other species? --Easy come, easy go? : how come identical twins aren't identical? --Life as we do (and don't) know it : what the heck will happen now? --Epilogue : genomics gets personal",
  "genres": [
    "Science",
    "Nonfiction",
    "History",
    "Biology",
    "Genetics",
    "Medicine",
    "Audiobook"
  ],
  "author": "Sam Kean",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/13521382-the-violinist-s-thumb"
}