{
  "title": "Lettere dal buio",
  "description": "Lettere dal buio è una raccolta di 16 racconti brevi a cui fa da sfondo e collante la più atavica tra le emozioni umane: la paura. 1)Calandrina: un'inquietante e tuttavia rassicurante traghettatrice di anime intrappolate ancora in questa dimensione.2)Mors tua vita mea: due ragazzini sono stati rapiti e l'uomo che li tiene in ostaggio alza la posta per ottenere il riscatto: saranno loro a decidere chi dei due deve morire.3)Qelippot: che cosa succederebbe se un giorno ti ritrovassi a sputare conchiglie e nessuno oltre a te riuscisse a vederle?4)Il rasoio di Occam: la soluzione del caso è sotto gli occhi del procuratore distrettuale, nascosta in bella vista. Riuscirà a sbrogliare la matassa in tempo?5)La mano sinistra: il diavolo cammina in mezzo a noi, lasciando dietro di sé le impronte inconfondibili del suo passaggio.6)Pianerottolo dantesco: lo spioncino della porta di casa può trasformarsi nell'occhio di un Grande Fratello totalizzante e alienante.7)La Casa ha deciso: e se un giorno gli oggetti di casa vostra volessero uccidervi?8)Non aprite quella porta: attenti che a scherzare col fuoco si finisce col bruciarsi davvero...9)Il miracolo di Zi' Andrea: quando l'adorazione e la preghiera sono così potenti da far prendere vita a una statua della Madonna...10)Aguscello: giro giro tondo, casca il mondo... I bambini son tornati, e stavolta non solo per giocare.Nell'ultima parte della raccolta c'è una sezione intitolata \"Istantanee di un...racconto\", composta da 6 racconti lampo di massimo due paginette, storie fulminanti che vi lasceranno di sasso e con alcuni interrogativi in sospeso.Una piccola full immersion là dove l'ombra è più nera. Ecco perché il consiglio, durante la lettura, è quello di tenere la luce ben accesa...",
  "genres": [
    "Horror",
    "Short Stories",
    "Fiction",
    "Thriller",
    "Paranormal",
    "Suspense",
    "Italian Literature"
  ],
  "author": "Germano Dalcielo",
  "average_rating": "3.28",
  "url": "https://www.goodreads.com/book/show/13529857-lettere-dal-buio"
}