{
  "title": "Liar & Spy",
  "description": "The instant New York Times bestseller from the author of the Newbery Medal book When You Reach Me: a story about spies, games, and friendship. Seventh grader Georges moves into a Brooklyn apartment building and meets Safer, a twelve-year-old self-appointed spy. Georges becomes Safer's first spy recruit. His assignment? Tracking the mysterious Mr. X, who lives in the apartment upstairs. But as Safer becomes more demanding, Georges starts to wonder: what is a lie, and what is a game? How far is too far to go for your only friend? Like the dazzling When You Reach Me, Liar & Spy will keep readers guessing until the end.Praise for Liar & Spy   • Guardian Prize for Children's Fiction (UK)   • Texas’ 2014-2015 Bluebonnet Master List   • A Junior Library Guild Selection    • A New York Times Bestseller    • An Indie Bestseller    • Kirkus Reviews starred review    • Publishers Weekly starred review    • The Horn Book starred review    • School Library Journal starred review    • The Bulletin of the Center for Children’s Books starred review    • Autumn 2012 Kids’ Indie Next List    • Nominated for the Best Fiction for Young Adults 2013    • Kirkus Reviews Best of Children’s Books 2012 List    • Publishers Weekly Best of Children’s Fiction 2012    • School Library Journal Best of Children’s Fiction 2012 List    • The Horn Book’s Best of 2012 List    • Barnes & Noble Best Books of 2012 for Kids List    • Amazon’s Best of the Year, Middle Grade (#3)    • A New York Times Book Review Notable Children’s Book of 2012    • Holiday gift guides: Chicago Tribune, San Francisco Chronicle, LA Times    • NPR Outstanding “Backseat” Reads for Ages 9-14, NPR’s Backseat Book Club    • One of The Atlantic Wire’s 25 favorite middle grade and young adult book covers of 2012    • The Wall Street Journal’s Best Children’s Books of 2012    • The Chicago Public Library Best of the Best 2012    • The Bulletin of the Center for Children’s Books 2012 Blue Ribbons ListFrom the Hardcover edition.",
  "genres": [
    "Middle Grade",
    "Realistic Fiction",
    "Mystery",
    "Fiction",
    "Young Adult",
    "Childrens",
    "Friendship"
  ],
  "author": "Rebecca Stead",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/13531477-liar-spy"
}