{
  "title": "Predator Nation: Corporate Criminals, Political Corruption, and the Hijacking of America",
  "description": "Charles H. Ferguson, who electrified the world with his Oscar-winning documentary \nInside Job\n, now explains how a predator elite took over the country, step by step, and he exposes the networks of academic, financial, and political influence, in all recent administrations, that prepared the predators’ path to conquest.       Over the last several decades, the United States has undergone one of the most radical social and economic transformations in its history.   ·         Finance has become America’s dominant industry, while manufacturing, even for high technology industries, has nearly disappeared. ·         The financial sector has become increasingly criminalized, with the widespread fraud that caused the housing bubble going completely unpunished. ·         Federal tax collections as a share of GDP are at their lowest level in sixty years, with the wealthy and highly profitable corporations enjoying the greatest tax reductions. ·         Most shockingly, the United States, so long the beacon of opportunity for the ambitious poor, has become one of the world’s most unequal and unfair societies.  If you’re smart and a hard worker, but your parents aren’t rich, you’re now better off being born in Munich, Germany or in Singapore than in Cleveland, Ohio or New York. This radical shift did not happen by accident.       Ferguson shows how, since the Reagan administration in the 1980s, both major political parties have become captives of the moneyed elite.  It was the Clinton administration that dismantled the regulatory controls that protected the average citizen from avaricious financiers.  It was the Bush team that destroyed the federal revenue base with its grotesquely skewed tax cuts for the rich. And it is the Obama White House that has allowed financial criminals to continue to operate unchecked, even after supposed “reforms” installed after the collapse of 2008. \n     Predator Nation\n reveals how once-revered figures like Alan Greenspan and Larry Summers became mere courtiers to the elite.  Based on many newly released court filings, it details the extent of the crimes—there is no other word—committed in the frenzied chase for wealth that caused the financial crisis.  And, finally, it lays out a plan of action for how we might take back our country and the American dream.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Economics",
    "Finance",
    "Business",
    "History",
    "Audiobook"
  ],
  "author": "Charles  Ferguson",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/13531645-predator-nation"
}