{
  "title": "The Man Who Saved the Union: Ulysses Grant in War and Peace",
  "description": "From New York Times bestselling author H. W. Brands, a masterful biography of the Civil War general and two-term president who saved the Union twice, on the battlefield and in the White House, holding the country together at two critical turning points in our history.Ulysses Grant rose from obscurity to discover he had a genius for battle, and he propelled the Union to victory in the Civil War. After Abraham Lincoln's assassination and the disastrous brief presidency of Andrew Johnson, America turned to Grant again to unite the country, this time as president. In Brands's sweeping, majestic full biography, Grant emerges as a heroic figure who was fearlessly on the side of right. He was a beloved commander in the field but willing to make the troop sacrifices necessary to win the war, even in the face of storms of criticism. He worked valiantly to protect the rights of freedmen in the South; Brands calls him the last presidential defender of black civil rights for nearly a century. He played it straight with the American Indians, allowing them to shape their own fate even as the realities of Manifest Destiny meant the end of their way of life.  He was an enormously popular president whose memoirs were a huge bestseller; yet within decades of his death his reputation was in tatters, the victim of Southerners who resented his policies on Reconstruction. In this page-turning biography, Brands now reconsiders Grant's legacy and provides a compelling and intimate portrait of a man who saved the Union on the battlefield and consolidated that victory as a resolute and principled political leader.",
  "genres": [
    "Biography",
    "History",
    "Civil War",
    "Nonfiction",
    "American History",
    "Presidents",
    "American Civil War"
  ],
  "author": "H.W. Brands",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/13531850-the-man-who-saved-the-union"
}