{
  "title": "A Wicked War: Polk, Clay, Lincoln, and the 1846 U.S. Invasion of Mexico",
  "description": "Often forgotten and overlooked, the U.S.-Mexican War featured false starts, atrocities, and daring back-channel negotiations as it divided the nation, paved the way for the Civil War a generation later, and launched the career of Abraham Lincoln. Amy S. Greenberg’s skilled storytelling and rigorous scholarship bring this American war for empire to life with memorable characters, plotlines, and legacies.    When President James K. Polk compelled a divided Congress to support his war with Mexico, it was the first time that the young American nation would engage another republic in battle. Caught up in the conflict and the political furor surrounding it were Abraham Lincoln, then a new congressman; Polk, the dour president committed to territorial expansion at any cost; and Henry Clay, the aging statesman whose presidential hopes had been frustrated once again, but who still harbored influence and had one last great speech up his sleeve. Beyond these illustrious figures, A Wicked War follows several fascinating and long-neglected characters: Lincoln’s archrival John Hardin, whose death opened the door to Lincoln’s rise; Nicholas Trist, gentleman diplomat and secret negotiator, who broke with his president to negotiate a fair peace; and Polk’s wife, Sarah, whose shrewd politicking was crucial in the Oval Office. This definitive history of the 1846 conflict paints an intimate portrait of the major players and their world. It is a story of Indian fights, Manifest Destiny, secret military maneuvers, gunshot wounds, and political spin. Along the way it captures a young Lincoln mismatching his clothes, the lasting influence of the Founding Fathers, the birth of the Daughters of the American Revolution, and America’s first national antiwar movement. A key chapter in the creation of the United States, it is the story of a burgeoning nation and an unforgettable conflict that has shaped American history.",
  "genres": [
    "History",
    "American History",
    "Nonfiction",
    "War",
    "Politics",
    "Military History",
    "Military Fiction"
  ],
  "author": "Amy S. Greenberg",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/13532290-a-wicked-war"
}