{
  "title": "Psycho USA: Famous American Killers You Never Heard Of",
  "description": "AMERICA’S MOST COLD-BLOODED!   In the horrifying annals of American crime, the infamous names of brutal killers such as Bundy, Dahmer, Gacy, and Berkowitz are writ large in the imaginations of a public both horrified and hypnotized by their monstrous, murderous acts. But for every celebrity psychopath who’s gotten ink for spilling blood, there’s a bevy of all-but-forgotten homicidal fiends studding the bloody margins of U.S. history. The law gave them their just desserts, but now the hugely acclaimed author of The Serial Killer Files and The Whole Death Catalog gives them their dark due in this absolutely riveting true-crime treasury. Among America’s most cold-blooded you’ll meet   Robert Irwin, “The Mad Sculptor”: He longed to use his carving skills on the woman he loved—but had to settle for making short work of her mother and sister instead.   Peter Robinson, “The Tell-Tale Heart Killer”: It took two days and four tries for him to finish off his victim, but no time at all for keen-eyed cops to spot the fatal flaw in his floor plan.   Anton Probst, “The Monster in the Shape of a Man”: The ax-murdering immigrant’s systematic slaughter of all eight members of a Pennsylvania farm family matched the savagery of the Manson murders a century later.   Edward H. Ruloff, “The Man of Two Lives”: A genuine Jekyll and Hyde, his brilliant scholarship disguised his bloodthirsty brutality, and his oversized brain gave new meaning to “mastermind.”   Spurred by profit, passion, paranoia, or perverse pleasure, these killers—the Witch of Staten Island, the Smutty Nose Butcher, the Bluebeard of Quiet Dell, and many others—span three centuries and a host of harrowing murder methods. Dramatized in the pages of penny dreadfuls, sensationalized in tabloid headlines, and immortalized in “murder ballads” and classic fiction by Edgar Allan Poe and Theodore Dreiser, the demonic denizens of Psycho USA may be long gone to the gallows—but this insidiously irresistible slice of gothic Americana will ensure that they’ll no longer be forgotten.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "History",
    "Crime",
    "Horror",
    "Audiobook",
    "Mystery"
  ],
  "author": "Harold Schechter",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/13535715-psycho-usa"
}