{
  "title": "Grace: A Memoir",
  "description": "Beautiful. Willful. Charming. Blunt. Grace Coddington’s extraordinary talent and fierce dedication to her work as creative director of Vogue have made her an international icon. Known through much of her career only to those behind the scenes, she might have remained fashion’s best-kept secret were it not for The September Issue, the acclaimed 2009 documentary that turned publicity-averse Grace into a sudden, reluctant celebrity. Grace’s palpable engagement with her work brought a rare insight into the passion that produces many of the magazine’s most memorable shoots. With the witty, forthright voice that has endeared her to her colleagues and peers for more than forty years, Grace now creatively directs the reader through the storied narrative of her life so far. Evoking the time when models had to tote their own bags and props to shoots, Grace describes her early career as a model, working with such world-class photographers as David Bailey and Norman Parkinson, before she stepped behind the camera to become a fashion editor at British Vogue in the late 1960s. Here she began creating the fantasy “travelogues” that would become her trademark. In 1988 she joined American Vogue, where her breathtakingly romantic and imaginative fashion features, a sampling of which appear in this book, have become instant classics. Delightfully underscored by Grace’s pen-and-ink illustrations, Grace will introduce readers to the colorful designers, hairstylists, makeup artists, photographers, models, and celebrities with whom Grace has created her signature images. Grace reveals her private world with equal candor—the car accident that almost derailed her modeling career, her two marriages, the untimely death of her sister, Rosemary, her friendship with Harper’s Bazaar editor-in-chief Liz Tilberis, and her thirty-year romance with Didier Malige. Finally, Grace describes her abiding relationship with Anna Wintour, and the evolving mastery by which she has come to define the height of fashion. NAMED ONE OF THE BEST BOOKS OF THE YEAR BY  FINANCIAL TIMES“If Wintour is the Pope . . . Coddington is Michelangelo, trying to paint a fresh version of the Sistine Chapel twelve times a year.”— Time",
  "genres": [
    "Fashion",
    "Memoir",
    "Nonfiction",
    "Biography",
    "Biography Memoir",
    "Audiobook",
    "Art"
  ],
  "author": "Grace Coddington",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/13536591-grace"
}