{
  "title": "Dogfight: The 2012 Presidential Campaign in Verse",
  "description": "In his latest laugh-out-loud book of political verse, Calvin Trillin provides a riotous depiction of the 2012 presidential election campaign.   Dogfight is a narrative poem interrupted regularly by other poems and occasionally by what the author calls a pause for prose (“Callista Gingrich, Aware That Her Husband Has Cheated On and Then Left Two Wives Who Had Serious Illnesses, Tries Desperately to Make Light of a Bad Cough”). With the same barbed wit he displayed in the bestsellers Deciding the Next Decider, Obliviously On He Sails, and A Heckuva Job, America’s deadline poet trains his sights on the Tea Party (“These folks were quick to vocally condemn/All handouts but the ones that went to them”) and the slapstick field of contenders for the Republican nomination (“Though first-tier candidates were mostly out,/Republicans were asking, “What about/The second tier or what about the third?/Has nothing from those other tiers been heard?”). There is an ode to Michele Bachmann, sung to the tune of a Beatles classic (“Michele, our belle/Thinks that gays will all be sent to hell”) and passages on the exit of candidates like Herman Cain (“Although his patter in debates could tickle,/Cain’s pool of knowledge seemed less pool than trickle”) and Rick Santorum (“The race will miss the purity/That you alone endow./We’ll never find another man/Who’s holier than thou.”)   On its way to the November 6 finale, Trillin’s narrative takes us through such highlights as the January caucuses in frigid Iowa (“To listen to long speeches is your duty,/And getting there could freeze off your patootie”), the Republican convention (“It seemed like Clint, his chair, and their vignette/Had wandered in from some adjoining set”), and Mitt Romney’s secretly recorded “47 percent” speech, which inspired the “I Got the Mitt Thinks I’m a Moocher, a Taker not a Maker, Blues.”From the Hardcover edition.",
  "genres": [
    "Poetry",
    "Humor",
    "Politics",
    "Nonfiction",
    "History",
    "Comedy",
    "American History"
  ],
  "author": "Calvin Trillin",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/13536883-dogfight"
}