{
  "title": "Why Peace",
  "description": "\"Who doesn't want peace?\" you might ask yourself. But look around you: War and human rights violations are everywhere. Fear is a dominant cultural bond. Meanwhile, so many of us consent to this aggression—when it is done by the government we think represents us. Why Peace is about our aspirations to our own progression, to where peaceful and voluntary societal systems and associations replace the machinery of aggression and coercion. Only by interacting peacefully can we achieve a more harmonious, prosperous, healthy, fair and tolerant society. This book is an exploration of aggression, and of the evolutionary (and revolutionary) process to peace. Through the insights of men and women, from a wide range of backgrounds, cultures, and perspectives, Why Peace presents stories of wars, invasions, and political repressions—down to the most basic levels of authoritarianism. These individuals share mind-opening and inspiring personal experiences with state violence: North Korean gulag prisoners, exiled journalists, soldiers at war (and some who refused to go back), Colombian campesinos displaced by drug war fumigations, people violently displaced by their government for private corporate interests in the Amazon, families run over by war, victims of cluster bombs in Southeast Asia, Guantánamo prisoners, a Cuban student denied the rights to speak and organize, and much more. Also in this collaboration are military officers, former state officials, political prisoners, activists, economists, aid workers, and others. Each has contributed to this work to help demonstrate the philosophy, morality, and universal benefits of non-aggression and protecting human rights. Seventy-eight people, from thirty-four countries on five continents, share their stories here. Find out why they all came to a similar conclusion: peace is best for all and its time has come.",
  "genres": [
    "Philosophy"
  ],
  "author": "Marc Guttman",
  "average_rating": "4.87",
  "url": "https://www.goodreads.com/book/show/13537182-why-peace"
}