{
  "title": "Our Harsh Logic: Israeli Soldiers' Testimonies from the Occupied Territories, 2000-2010",
  "description": "Israeli soldiers speak out for the first time about the truth of the Palestinian occupation, in \"one of the most important books on Israel/Palestine in this generation\" (The New York Review of Books) The very name of the Israel Defense Forces—which many Israelis speak of as \"the most moral army in the world\"—suggests that its primary mission is the defense of the country's territory. Indeed, both internationally and within Israel, support for the occupation of Palestinian territory rests on the belief that the army's actions and presence in the West Bank and Gaza are essentially defensive and responsive, aimed at protecting the country from terror.But Israeli soldiers themselves tell a profoundly different story. In this landmark work, which includes hundreds of soldiers' testimonies collected over a decade, what emerges is a broad policy that is anything but defensive. In their own words, the soldiers reveal in human and vivid detail how the key planks of the army's ostensibly protective program—\"prevention of terror,\" \"separation of populations,\" \"preservation of the fabric of life,\" and \"law enforcement\"—have in fact served to accelerate acquisition of Palestinian land, cripple all normal political and social life, and ultimately thwart the possibility of independence. The many soldiers who have spoken out have taken aim at a silence of complicity, both within Israel and in the wider world, that perpetuates the justification for occupation. In the process, they have created a gripping and immediate record of oppression. Powerful and incontrovertible, Our Harsh Logic is a supremely significant contribution to one of the world's most vexed conflicts.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Israel",
    "History",
    "Judaism",
    "Social Justice",
    "Memoir"
  ],
  "author": "Breaking the Silence",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/13538349-our-harsh-logic"
}