{
  "title": "Killing Kennedy: The End of Camelot",
  "description": "More than two million readers have thrilled to Bill O'Reilly and historian Martin Dugard's Killing Lincoln, the riveting work of nonfiction about the shocking assassination that changed the course of American history. Now the anchor of The O'Reilly Factor recounts in gripping detail the brutal murder of John Fitzgerald Kennedy - and how a sequence of gunshots on a Dallas afternoon not only killed a beloved president but also sent the nation into the cataclysmic division of the Vietnam War and its culture-changing aftermath.In January 1961, as the cold war escalates, John F. Kennedy struggles to contain the growth of communism while he learns the hardships of solitude, and temptations of what it means to be president of the United States. His beautiful young wife, Jackie, must also adjust to a life of constant scrutiny. Despite personal and political trials, Kennedy's approval ratings soar.At the same time, JFK acquires a number of formidable enemies, among them Soviet leader Nikita Khruschev, Cuban dictator Fidel Castro, and Allen Dulles, director of the Central Intelligence Agency. When his brother, Attorney General Robert Kennedy, cracks down on powerful elements of organised crime, the list of those who have it in for the president grows.Then, in the midst of a 1963 campaign trip to Texas, Kennedy is gunned down, resulting in national chaos. Jackie and the nation mourn while the hunt for the perpetrators commences.The events leading up to the most notorious crime of the twentieth century are almost as shocking as the assassination itself. A page-turner from beginning to end, Killing Kennedy chronicles both the heroism and deceit of Camelot, bringing history to life in ways that will profoundly move the reader.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Politics",
    "Historical",
    "American History",
    "Audiobook"
  ],
  "author": "Bill O'Reilly",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/13538641-killing-kennedy"
}