{
  "title": "Sleep No More",
  "description": "From the #1 New York Times bestselling author Iris Johansen comes a new thriller that will have Eve Duncan questioning everything she thought she knew about her family and her past\nOne woman held captive for decades…\n\nAnother one freed by the truth…\n  Forensic sculptor Eve Duncan knows what it's like to be haunted by the past.  For years after her daughter Bonnie was stolen from her, she fought for closure.  But now as she's striving to begin anew, she can't shake the feeling that something terrible is about to happen—or maybe already has.  When her mother, Sandra, asks for help in finding a missing friend named Beth Avery, Eve is sure that she's hiding something.  It’s odd that Sandra would get involved at all, and the fact that she adamantly refuses to go to the police for help reinforces Eve’s suspicions that something is very wrong.Eve learns that Beth has been locked away in a mental hospital for years, which makes it even harder to understand how she could have disappeared. As Sandra reluctantly reveals small pieces of the truth about Beth's identity, Eve is shocked to discover that their lives are strangely entwined, and Beth's disappearance now puts them all in grave danger.Desperate, Eve enlists a secret weapon to pick up Beth's trail: rogue profiler, Kendra Michaels. With an uncanny ability to detect clues and solve puzzles, Kendra begins to uncover the bizarre circumstances of Beth's escape from what should have been the safety of her hospital room. Beth is on the run, and as her mind clears--detoxing from the drugs that have held her prisoner--she begins to see the threads of a twisted plot within the powerful Avery family, threatening to destroy Beth and anyone else who might jeopardize the high-stakes game that is already in play.",
  "genres": [
    "Mystery",
    "Suspense",
    "Fiction",
    "Thriller",
    "Mystery Thriller",
    "Crime",
    "Romantic Suspense"
  ],
  "author": "Iris Johansen",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/13538710-sleep-no-more"
}