{
  "title": "The Missing Class: Portraits of the Near Poor in America",
  "description": "Fifty-seven million Americans-including 21 percent of the nation's children-live a notch above the poverty line, and yet the challenges they face are largely ignored. While government programs assist the poor, and politicians woo the more fortunate, the \"Missing Class\" is largely invisible and left to fend for itself. Missing Class parents often work at a breakneck pace to preserve the progress they have made and are but one divorce or unexpected hospitalization away from sliding into poverty. Children face an even more perilous and uncertain future because their parents have so little time to help them with their schoolwork or guide them during their adolescent years. With little supervision, the younger generation often flounders in school, sometimes falling prey to the same problems that are prevalent in the much poorer communities that border Missing Class neighborhoods. Paradoxically, the very efforts that enabled parents to get ahead financially often inhibit their children from advancing; they are in real danger of losing what little ground their parents have gained.The Missing Class is an urgent and timely exploration that describes-through the experiences of nine families-the unique problems faced by this growing class of people who are neither working poor nor middle class. Katherine Newman and Victor Tan Chen trace where these families came from, how they've struggled to make a decent living, and why they're stuck without a safety net. An eloquent argument for the need to think about inequality in a broader way, The Missing Class has much to tell us about whether the American dream still exists for those who are sacrificing daily to achieve it.",
  "genres": [
    "Nonfiction",
    "Sociology",
    "Economics",
    "Poverty",
    "Society"
  ],
  "author": "Katherine S. Newman",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/1040736.The_Missing_Class"
}