{
  "title": "The Accomplice",
  "description": "An ambitious young politico lands a dream job only to find himself implicated in dealings more shady than he could have ever suspected Smarting over a recent gubernatorial campaign in which he may have cost his boss the race, Henry Hatten is concerned about becoming a political has-been. But he catches a break when he lands a job as communications director for Nebraska Senator Tom Peele’s presidential campaign.  As the campaign progresses, however, Henry finds himself involved in dealings so dirty, even a potential spot in the White House might not justify the means.  In a world in which campaigns are won in the margins, pushing players to the very edge, how do you avoid sliding over and damning yourself? The Accomplice has drawn enthusiastic professional reviews, including a boxed, starred, \"must-read\" Publishers Weekly notice and inclusion in Library Journal's \"Fabulous Fall Firsts\" feature. Some samples:“. . . A riveting look at how love, lust, and murder can derail a presidential campaign. . . In the current campaign season, this thriller is a must read.” -- Publishers Weekly (Starred, Boxed Review)\"Providing an insider's sharp-eyed look into the exciting and seamy aspects of high-stakes political contests, this debut novel is a must-read in presidential election years.\" -- Library JournalLibrary Journal also listed The Accomplice in its \"Fabulous Fall Firsts\" feature, October 2012 Edition.“Robbins . . . deftly combines a lively insider's look at campaign politics with a satirically spiked murder story. . . Robbins stocks his impressive first novel with great characters . . . The narrative flows freely and easily, the dialogue crackles, and the comedy comfortably coexists with the drama. Perfectly timed for the 2012 election, this book sets itself apart from most political thrillers with equal parts insight and imagination.”-- Kirkus Reviews\". . . Timely with condemnation, the Accomplice is a delightful political thriller that enables the audience to observe what goes on behind the curtain on a major run for the White House. Ethical politician seems like an oxymoron as even knowing to keep oneself clean fails to prevent scandalous, illegal and in this case murderous behavior from happening. Purist Henry is superb as a sort of Forty Year Old Virgin surrounded by hedonist devils who ask not what they can do for their country - ask what their country can do for them.\"-- The Mystery Gazette (Harriet Klausner)\". . . Robbins gets the details right, from the heat of an Iowa summer to the toll of too many bad meals consumed while on the road. This slick political novel seems perfectly timed to draw a crowd during the election cycle.\" -- Booklist",
  "genres": [
    "Fiction",
    "Mystery"
  ],
  "author": "Charles  Robbins",
  "average_rating": "3.18",
  "url": "https://www.goodreads.com/book/show/13538908-the-accomplice"
}