{
  "title": "Breakfast with Lucian: The Astounding Life and Outrageous Times of Britain's Great Modern Painter",
  "description": "An insider's account―the first of its kind―of the thoroughly unconventional life of one of the twentieth century's most shockingly original paintersLucian Freud's paintings are instantly often shocking and disturbing, his portraits convey a profound yet compelling sense of discomfort. Freud was twice married and the father of at least a dozen children, and his numerous relationships with women were the subject of much gossip―but the man himself remained a mystery. An intensely private individual (during his lifetime he prevented two planned biographies from being published), Freud's life, as well as his art, invites questions that have had no answer―until now.In Breakfast with Lucian , Geordie Greig, one of a few close friends who regularly had breakfast with the painter during the last years of his life, tells an insider's account―accessible, engaging, revealing―of one of the twentieth century's most fascinating, enigmatic, and controversial artists. Greig, who has studied his subject's work at length, unravels the tangled thread of a life lived on Freud's own uncompromising terms. Based on private conversations in which Freud held forth on everything from first love to gambling debts to the paintings of Velázquez, and informed by interviews with friends, lovers, and some of the artist's children who have never before spoken publicly about their relationships with the painter, this is a deeply personal memoir that is illuminated by a keen appreciation of Freud's art.Fresh, funny, and ultimately profound, Breakfast with Lucian is an essential portrait―one worthy of one of the greatest painters of our time.An NPR Best Book of the Year",
  "genres": [
    "Art",
    "Biography",
    "Nonfiction",
    "Memoir",
    "Biography Memoir",
    "20th Century",
    "Art History"
  ],
  "author": "Geordie Greig",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/13539072-breakfast-with-lucian"
}