{
  "title": "Gothic Blue Book: The Haunted Edition",
  "description": "A collection of short stories and poems resurrect the spirit of the Gothic Blue Book. Gothic Blue Books were short fictions popular in the 18th and 19th century. They were descendants of the chap book trade. Burial Day Books presents its first Gothic Blue Book, The Haunted Edition. The following twelve short stories and two poems honor the Gothic story. Misery, fear, despair, regret and dread are highlighted in the following pages, stirring old ghosts, witches, and awakening death. The following collection of new and established horror authors weave together brilliant tales of terror celebrating the history of the Gothic story with a new twist. ABOUT THE CONTRIBUTORS JOHN EVERSON is the Bram Stoker Award-winning author of the erotic supernatural horror novels Covenant, Sacrifice, The 13th, Siren and The Pumpkin Man. He's also penned five short story collections, including Needles & Sins, which included the Stoker nominated Letting Go. Over the past 15 years, John's short fiction has appeared in more than 75 magazines and anthologies, and he has contributed to Green Hornet and Kolchak: The Night Stalker anthologies, as well as to the non-fiction On Writing Horror reference book for writers. His stories and novels have also been translated and published in Poland, Turkey and France. John is also the publisher of Dark Arts Books (www.darkartsbooks.com), a Chicago area press spotlighting the cutting edge work of some of the best authors working in short horror/dark fantasy fiction today. For more on his fiction, art and music visit www.johneverson.com. K. TRAP JONES is an award winning author of literary horror novels and short stories. His passion for folklore, classic literary fiction and obscure segments within society lead to his creative writing style of \"filling in the gaps\" and walking the line between reality and fiction. With a strong inspiration from Edgar Allan Poe, Bram Stoker and Dante Alighieri, his stories involve topics and situations where very little is known, which provides an open canvas to explore. He is an active member of the Florida Writer's Association and hopes to rejuvenate the classical era of horror one story at a time. www.ktrapjones.com GREG MOLLIN is a fiction writer living in Orange County, California. He has been involved in everything from hardcore punk music to graphic design and even a stint as writer/performer on a popular cable television sketch comedy show. His short story, The Monster on Myers Avenue was recently published in Dark Moon Digest #3. He is currently at work on his first novel. www.gregmollin.com CYNTHIA (cina) PELAYO grew up in a haunted house with very superstitious parents. So, a lifelong fascination with Gothic literature, romantic horror and the macabre seemed fitting. Pelayo holds a genuine curiosity for superstition, folklore and myth. She holds a Bachelor of Arts in Journalism from Columbia College, a Master of Science in Integrated Marketing Communication from Roosevelt University, and a Master of Fine Arts in Writing from The School of the Art Institute of Chicago. She is a member of the Horror Writer's Association and is also the Publisher/Gravedigger at Burial Day Books. She wears black - most of the time and she stays out of the sun as much as (un)humanly possible. www.burialday.com. GERARDO PELAYO is the Undertaker at Burial Day Books and is a lifelong Chicagoan who got his Bachelor of Science at DeVry Technical Institute. He also holds a Master of Applied Science from Roosevelt University. He writes code by day and well writes code by night. He tweets daily random facts, and his obsessions are comic books, fantasy baseball, and BBQ. Follow him on twitter @Thee_Undertaker. MARC RUVOLO works and resides in Chicago, IL where he writes short fiction, performs music, and skulks in gloomy lanes when not attending to his day job as a disgruntled shopkeep. www.bucketoblood.com",
  "genres": [
    "Horror",
    "Gothic",
    "Short Stories",
    "Fiction",
    "Anthologies"
  ],
  "author": "Cynthia Pelayo",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/13540072-gothic-blue-book"
}