{
  "title": "Dirty Old Town and Other Stories",
  "description": "'A fantastic writer.' Donald Ray Pollock 'Nigel Bird is fast becoming one of the top writers in his genre.' Luca Veste DIRTY OLD TOWN is the debut collection from the prize-winning writer Nigel Bird. His brilliantly observed slices of life allow us to visit places we may not normally choose to enter and to walk a few miles in the shoes of others. Though his tales have darkness at their core, they are also full of a heart and spirit that one rarely finds in the world or ‘noir’ or ‘crime-writing’. There are 9 stories Drinking Wine (Spo-Dee-Oh-Dee); Dirty Old Town; Sea Minor; Sisterhood; One Hundred And Ten Per Cent; Merry Christmas (I Don’t Want To Fight Tonight); Three Little Birds; and Silver Street. Each will remain with you for days after you’ve read it. Some will be around for weeks. In this collection we meet a frustrated housewife who needs to let her hair down; an elderly school janitor who can’t see the wood for the trees; a group of Muslims intent on revenge; a young girl whose father has just left home; a father and son breaking-and-entering partnership; a young man working on a city farm; and a pimp who’s fallen in love. All of them struggle to meet life’s demands and some of them cope better than others. Five of the stories here have been published by the highly respected editors of The Reader Magazine, A Twist Of Noir, Beat To A Pulp, Title Fights, Static Movement and Dark Valentine. The collection also includes two pieces that are being given their first outing and another that was put together put for the Big Beat From Badsville's Ramones series. The story 'Sisterhood' was selected for publication in Mammoth's Best British Crime Stories 9. In 2010 Nigel Bird was the winner of the prestigious Watery Grave Invitational competition hosted by the Drowning Machine. Since then he has gone on to win the Things I’d Rather Be Doing fairytale/crime-story competition. Praise for Nigel Bird and his work 'The stories have well written plots and all have unexpected endings which are not obvious when reading them. I found the stories to be well conceived and ideal to read in ebook format. I hope that Nigel is able to write a full size novel to further develop his writing skills. Some of the short stories here could easily have been the base for a much longer book.' Paul Blackburn (at Euro Crime) ‘This is crime writing at its best. Read this collection, it is a crime not to do so.’ Richard Godwin (Apostle Rising) 'Each story is short and sweet, most with a nice wicked twist at the end. The blurb accompanying the collection says that the stories will stay with you for a while. A couple of them have certainly been rattling round my head for a few days. I did have one complaint, however – I wanted more of them! A nice collection.' Rob Kitchin (View From The Blue Room) ‘I was surprised by every story. These are short, punchy, thoughtful, hard as a punch, but sometimes they dig in and squeeze. It's dirty stuff, done beautifully.Nigel is also responsible for the too-cool \"Dancing With Myself\" interview series at his blog, Sea Minor.” Anthony Neil Smith (Yellow Medicine, Psychosomatic, Hogdoggin') ‘Taking A Line For A Walk’, included here, was listed among the top 5 stories of 2010 by Bill Hayes and Naomi Johnson over at Death By Killing. 'It won't take long to realise he is also one of the best writers out there on the noir scene' Ian Ayris (Abide With Me) ‘A rare talent.",
  "genres": [
    "Short Stories",
    "Fiction"
  ],
  "author": "Nigel Bird",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/10408265-dirty-old-town-and-other-stories"
}