{
  "title": "The Best American Short Stories 1969",
  "description": "Once again, a selection of the finest short fiction being written in the United States is assembled by the Editors of The Best American Short Stories.The 1969 edition of this annual volume includes such celebrated writers as Bernard Malamud, Mary Lavin, Joyce Carol Oates, Maeve Brennan and Sylvia Plath. The late Miss Plath's extraordinary story \"Johnny Panic and the Bible of Dreams,\" moves the reader to realize what her future might have been in fiction as well as poetry. There are also many accomplished stories from new writers at the start of their careers, and the stories come from a wide range of publications--major national magazines to small quarterlies.In a year that saw more than its share of tragedy, it is not surprising that many of the stories in this volume should deal with tragic themes. One of them, John Bart Gerald's \"Walking Wounded,\" is explicitly concerned with national it dramatizes the effect of the Vietnam war at the point where the war comes home, the arrival of wounded soldiers. Most of these stories inhabit more interior landscapes, such as Mary Gray Hughes' \"The Foreigner in the Blood,\" which explores the fascinating world of a psychiatrist's madness.This book is, as always, a rewarding experience in itself, and one of great interest to readers who want to stay abreast of the latest developments in American fiction.Contains the following \"The Eldest Child\" Maeve Brennan\"Play Like I'm Sheriff\" Jack Cady\"Murphy's Xmas\" Mark Costello\"Walking Wounded\" John Bart Gerald\"The Foreigner in the Blood\" Mary Gary Hughes\"The Boy in the Green Hat\" Norma Klein\"Happiness\" Mary Lavin\"The Boat\" Alistair MacLeod\"The Day the Flowers Came\" David Madden\"Pictures of Fidelman\" Bernard Malamud\"Porkchops with Whiskey and Ice Cream\" Matthew W. McGregor\"Gold Coast\" James Alan McPherson\"The Inheritance of Emmy One Horse\" John R. Milton\"By the River\" Joyce Carol Oates\"The Visitation\" Nancy Pelletier Pansing\"Johnny Panic and the Bible of Dreams\" Sylvia Plath\"Paper Poppy\" Miriam Rugel\"The Tea Bowl of Ninsei Nomura\" Margaret Shipley\"The Colony\" Isaac Bashevis Singer\"Benjamen Burning\" Joyce Madelon Winslow",
  "genres": [
    "Short Stories",
    "Fiction"
  ],
  "author": "Martha Foley",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/1354139.The_Best_American_Short_Stories_1969"
}