{
  "title": "Eerst grijs dan wit dan blauw",
  "description": "Het is maandagochtend. Een oogarts vindt de vrouw met wie hij een buitenechtelijke affaire beleefde liggend op de grond, in een rooddoorweekt, kanten hemd. Ze is door messteken om het leven gebracht.Drie jaar eerder. Een man ontdekt dat zijn vrouw zonder een woord het huis heeft verlaten. Ze blijft jaren weg. Bij terugkomst weigert ze ook maar iets over haar avonturen te vertellen.Een bus-, trein-, boot- en vliegreis. Een vrouw gaat terug naar de plekken die haar leven kleurden.Het is vrijdagochtend. Een autistische jongen verheugt zich op een begrafenis. De overledene zette hem op het spoor van wat zijn leven zou beheersen: de sterren.Eerst grijs dan wit dan blauw is een meeslepend vierluik, dat zijn geheimen pas geleidelijk prijsgeeft. Een klassieke roman over de onkenbaarheid van de ander en de grillen van het lot.Recensie van de redactie:Dubbelportret van De Moor (1941) viel op door de psychologische diepgang en de ingehouden maar trefzekere vertelstijl. Ook deze psychologische roman vertoont deze kenmerken, maar is hechter gestructureerd en brengt intrigerender figuren naar voren. Het verhaal is opgebouwd als een vierluik en start op de ochtend dat een oogarts de vriendin van zijn vrouw, Magda (ook zijn ex-minnares), vermoord aantreft. Dit dode personage draagt verder de hele roman. In het tweede luik, dat drie jaar eerder speelt, ontdekt de man van Magda dat ze verdwenen is en het derde deel focust in op de reis die ze onderneemt langs de locaties die haar leven bepaalden. In hun wanhopige pogingen om zinvolle relaties aan te gaan, staan de volwassen personages in wezen niet ver af van een emotioneel gestoorde puber. Toch is dit geen koud, desolaat boek geworden, daarvoor beschrijft de auteur haar figuren met te veel warmte, mededogen ook. Het verhaal is bijzonder vakkundig geconstrueerd. Maar het meest indrukwekkend blijft de vlijmscherpe karaktertekening.",
  "genres": [
    "Fiction",
    "Literature",
    "Dutch Literature",
    "Roman",
    "Novels",
    "Literary Fiction"
  ],
  "author": "Margriet de Moor",
  "average_rating": "3.08",
  "url": "https://www.goodreads.com/book/show/13541456-eerst-grijs-dan-wit-dan-blauw"
}