{
  "title": "In the Shadow of the Banyan",
  "description": "A beautiful celebration of the power of hope, this New York Times bestselling novel tells the story of a girl who comes of age during the Cambodian genocide.You are about to read an extraordinary story, a PEN Hemingway Award finalist “rich with history, mythology, folklore, language and emotion.” It will take you to the very depths of despair and show you unspeakable horrors. It will reveal a gorgeously rich culture struggling to survive through a furtive bow, a hidden ankle bracelet, fragments of remembered poetry. It will ensure that the world never forgets the atrocities committed by the Khmer Rouge regime in the Cambodian killing fields between 1975 and 1979, when an estimated two million people lost their lives. It will give you hope, and it will confirm the power of storytelling to lift us up and help us not only survive but transcend suffering, cruelty, and loss. For seven-year-old Raami, the shattering end of childhood begins with the footsteps of her father returning home in the early dawn hours, bringing details of the civil war that has overwhelmed the streets of Phnom Penh, Cambodia’s capital. Soon the family’s world of carefully guarded royal privilege is swept up in the chaos of revolution and forced exodus. Over the next four years, as the Khmer Rouge attempts to strip the population of every shred of individual identity, Raami clings to the only remaining vestige of her childhood—the mythical legends and poems told to her by her father. In a climate of systematic violence where memory is sickness and justification for execution, Raami fights for her improbable survival. Displaying the author’s extraordinary gift for language, In the Shadow of the Banyan is a brilliantly wrought tale of human resilience.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Asia",
    "Book Club",
    "War",
    "Historical",
    "Literary Fiction"
  ],
  "author": "Vaddey Ratner",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/13546322-in-the-shadow-of-the-banyan"
}