{
  "title": "Skippy Dies",
  "description": "Paul Murray's Skippy Dies is a tragicomic masterpiece about a Dublin boarding school Longlisted for the Man Booker Prize 2010 Ruprecht Van Doren is an overweight genius whose hobbies include very difficult maths and the Search of Extra-Terrestrial Intelligence. Daniel 'Skippy' Juster is his roommate. In the grand old Dublin institution that is Seabrook College for Boys, nobody pays either of them much attention. But when Skippy falls for Lori, the frisbee-playing siren from the girls' school next door, suddenly all kinds of people take an interest - including Carl, part-time drug-dealer and official school psychopath. . . A tragic comedy of epic sweep and dimension, Skippy Dies scours the corners of the human heart and wrings every drop of pathos, humour and hopelessness out of life, love, Robert Graves, mermaids, M-theory, and everything in between. 'That rare thing, a comic epic. . . Murray is a brilliant comic writer, but also humane and touching, and he captures the misery and elation, joy and anxiety of teenage life' David Nicholls, Guardian 'Novels rarely come as funny and as moving as this utterly brilliant exploration of teenhood and the anticlimax of becoming an adult . . . one of the finest comic novels written anywhere' Eileen Battersby, Irish Times 'I loved Skippy Dies . . . three novels fused into one ignited tragicomic tour de force' Ali Smith, Times Literary Supplement Books of the Year 'An unforgettably exuberant saga set in an Irish boys' school. The insulting repartee is Shakespearean, the minor characters hilarious, and Murray captures the fleeting joys and lasting sorrows of adolescence perfectly' Emma Donoghue, Daily Telegraph 'A triumph . . . brimful of wit and narrative energy' Sunday Times 'The sprawling brilliance of Paul Murray's darkly comic second novel works on many different levels . . . When you finish the last page, you may be tempted to start all over again' Metro Paul Murray is the author of An Evening of Long Goodbyes, shortlisted for the Whitbread First Novel Award in 2005, and Skippy Dies, longlisted for the Man Booker Prize 2010.",
  "genres": [
    "Fiction",
    "Ireland",
    "Contemporary",
    "Irish Literature",
    "Coming Of Age",
    "Literary Fiction",
    "Book Club"
  ],
  "author": "Paul Murray",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/10409954-skippy-dies"
}