{
  "title": "Viagens na Minha Terra",
  "description": "Biblioteca Ulisseia de Autores Portugueses #1O Romance resume-se, a intricada história, de uma velhinha com sua neta Joaninha. A menina –moça, tem um primo, filho da única filha da avó, que já falecera. A moça tinha por si só a avó. Todas as semanas, Frei Dinis, vinha visitá-las, e algumas vezes trazia notícias de Carlos, que já algum tempo, fazia parte do séquito de D. Pedro. Só que a maneira como Frei Dinis falava de Carlos, dava para perceber algo, que só a idosa e Frei Dinis conheciam. Passara o ano de 1830, Carlos formara-se em Coimbra, e só então visitou a família, mas com muitas reticências em relação a avó e Frei Dinis. Carlos também pressentia que ele e a avó mantinham um segredo. Carlos, nas suas andanças, já tinha eleito uma fidalga para ele: D. Georgina, mulher de fino trato. No entanto a guerra civil progredia, eram meados de 1833. Os Constitucionalistas tinham tomado a Esquadra de D. Miguel, Lisboa estava em poder deles, e Carlos era um dos guerreiros da parte Realista. Em 11 de Outubro, os soldados estão todos por volta de Lisboa, as tropas constitucionais vinham ao encalço das Realistas, e na batalha sangrenta, muitos ficaram feridos. A casa de Joaninha foi tomada por soldados Realistas, que vigiavam a passagem dos Constitucionais. Numa das andanças de Joaninha, por perto de casa, encontra Carlos, ele pede que não diga que ali está, mas abraçam-se e trocam juras de amor ali mesmo. Só que Carlos sabia que Georgina o esperava, e a sua mente tornou-se confusa, já não sabia se amava Georgina. Com Carlos ferido e alojado perto do vale onde morava Joaninha, essa veio inúmeras vezes vê-lo, e ajudá-lo na enfermidade. Certo dia Carlos depois de muita insistência de Joaninha foi ver a avó, e ficou surpreso da cegueira da mesma, por lá encontrou Frei Dinis, e quanto mais o olhava , menos gosto tinha. Enquanto permaneceu por perto, Carlos e Joaninha mantiveram um tórrido romance. Mas, Carlos, já refeito dos ferimentos seguiu para a tropa, e antes passa na casa da avó para se despedir. Implora que ela conte a verdade sobre o suspeito segredo. Então, Dona Francisca conta que o Frei Dinis é pai de Carlos, que a sua mãe morreu de desgosto, e para se defender, Frei Dinis mata o pai de Joaninha, e o marido da sua amante. Com isso Carlos parte, deixando Joaninha desolada. Volta a viver com Georgina. Escreve à prima contando todo o seu romance com Georgina, o que para a moça foi um impacto terrível. Mais Tarde Carlos se fez Barão. Também abandona Georgina , que vira Abadessa. Joaninha, enlouqueceu e morreu. Frei Dinis foi quem cuidou da velha senhora até á morte. E assim o Comboio chega ao Terreiro do Paço, e Garrett finaliza mais uma das suas melhores obras.",
  "genres": [
    "Classics",
    "Portugal",
    "Fiction",
    "Portuguese Literature",
    "Romance",
    "Literature",
    "Novels"
  ],
  "author": "Almeida Garrett",
  "average_rating": "3.17",
  "url": "https://www.goodreads.com/book/show/10409991-viagens-na-minha-terra"
}