{
  "title": "The Brothers Wroth: The Warlord Wants Forever, No Rest For The Wicked, Dark Needs At Night's Edge, Untouchable",
  "description": "An exclusive Kresley Cole eBook box set featuring her New York Times bestselling Immortals After Dark titles! Includes The Warlord Wants Forever, No Rest for the Wicked, Dark Needs at Night's Edge, and Untouchable.The Warlord Wants Forever (Immortals After Dark #0.5)Nikolai Wroth, once a ruthless human warlord in the 1700s and now a general in the rebel vampire army, needs to find his bride, the one woman who can render him truly alive. As a turned human, he doesn't enjoy a heartbeat or breathing and is consequently weaker than fully blooded vampires. \nHe wants his bride for the power she will bring him and can hardly believe it when his heart beats for Myst the Coveted, a mad, fey, mythological creature.\nShe eludes him for five years, but he has finally chased her to ground and stolen the jewel which commands her, giving him absolute power over her. While he possesses it, he can make her do anything, and he plans to in order for her to experience firsthand the agonizing, unending lust she'd purposely subjected him to for half a decade. \nYet when Wroth realizes he wants more from her and frees her, will she come.\nNo Rest For The Wicked (Immortals After Dark #3\nA vampire soldier weary of life...\nCenturies ago, Sebastian Wroth was turned into a vampire - a nightmare in his mind - against his will. Burdened with hatred and alone for ages, he sees little reason to live. \nUntil an exquisite, fey creature comes to kill him, inadvertently saving him instead.A valkyrie assassin dispatched to destroy him...\nWhen Kaderin the Cold Hearted lost her two beloved sisters to a vampire attack long ago, a benevolent force deadened her sorrow - accidentally extinguishing all of her emotions. Yet whenever she encounters Sebastian, her feelings - particularly lust - emerge multiplied. \nFor the first time, she's unable to complete a kill.Competitors in a legendary hunt...\nThe prize of the month-long contest is powerful enough to change history, and Kaderin will do anything to win it for her sisters. Wanting only to win her, forever, Sebastian competes as well, taking every opportunity - as they travel to ancient tombs and through catacombs, seeking relics around the world - to use her new feelings to seduce her. \nBut when forced to choose between the vampire she's falling for and reuniting her family, how can Kaderin live without either?\nDark Needs at Night's Edge(Immortals After Dark #5)\nA raven haired temptress of the dark...\nNéomi Laress, a famous ballerina from a past century, became a phantom the night she was murdered. Imbued with otherworldly powers but invisible to the living, she haunts her beloved home, scaring away trespassers - \nuntil she encounters a ruthless immortal even more terrifying than Néomi herself.A vampire warrior consumed by Madness...\nTo prevent him from harming others, Conrad Wroth's brothers imprison him in an abandoned manor. But there, a female only he can see seems determined to drive him further into madness. \nThe exquisite creature torments him with desire, leaving his body racked with lust and his soul torn as he finds himself coveting her for his own.How far will he go to claim her?\nYet even if Conrad can win Néomi, evil still surrounds her. Once he returns to the brutality of his past to protect her, will he succumb to the dark needs seething inside him?Untouchable (Immortals After Dark #8)#1 NEW YORK TIMES BESTSELLING AUTHOR KRESLEY COLE delivers a breathtaking tale of a brutal vampire soldier about to know love for the first time... and a Valkyrie aching for his touch.Murdoch Wroth will stop at nothing to claim Daniela - the delicate Valkyrie who makes his heart beat for the first time in three hundred years. Yet the exquisite Danii is part ice fey, and her freezing skin can’t be touched by anyone but her own kind without inflicting pain beyond measure. \nCan they conquer an agony of frustration and slake the overwhelming desire burning between them?",
  "genres": [
    "Romance",
    "Paranormal",
    "Paranormal Romance",
    "Fantasy",
    "Vampires",
    "Urban Fantasy",
    "Shapeshifters"
  ],
  "author": "Kresley Cole",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/13546517-the-brothers-wroth"
}