{
  "title": "The Child's Child",
  "description": "From three-time Edgar Award–winning mystery writer Ruth Rendell, writing here under her Barbara Vine pseudonym, an ingenious novel-within-a-novel about brothers and sisters and the violence lurking behind our society’s taboos When their grandmother dies, Grace and Andrew Easton inherit her sprawling, book-filled London home, Dinmont House. Rather than sell it, the adult siblings move in together, splitting the numerous bedrooms and studies. The arrangement is unusual, but ideal for the affectionate pair—until the day Andrew brings home a new boyfriend. A devilishly handsome novelist, James Derain resembles Cary Grant, but his strident comments about Grace’s doctoral thesis soon puncture the house’s idyllic atmosphere. When he and Andrew witness their friend’s murder outside a London nightclub, James begins to unravel, and what happens next will change the lives of everyone in the house. Just as turmoil sets in at Dinmont House, Grace escapes into reading a manuscript—a long-lost novel from 1951 called The Child’s Child—never published because of its frank depictions of an unwed mother and a homosexual relationship. The book is the story of two siblings born a few years after World War One. This brother and sister, John and Maud, mirror the present-day Andrew and Grace: a homosexual brother and a sister carrying an illegitimate child. Acts of violence and sex will reverberate through their stories. The Child’s Child is an enormously clever, brilliantly constructed novel-within-a-novel about family, betrayal, and disgrace. A master of psychological suspense, Ruth Rendell, in her newest work under the pseudonym Barbara Vine, takes us where violence and social taboos collide. She shows how society’s treatment of those it once considered undesirable has changed—and how sometimes it hasn’t.",
  "genres": [
    "Fiction",
    "Mystery",
    "Historical Fiction",
    "Crime",
    "British Literature",
    "Suspense",
    "Psychological Thriller"
  ],
  "author": "Barbara Vine",
  "average_rating": "3.18",
  "url": "https://www.goodreads.com/book/show/13547105-the-child-s-child"
}