{
  "title": "My Year in Meals",
  "description": "For the first time, #1 New York Times bestselling author Rachael Ray offers fans a glimpse into her own kitchen diary. From everyday meals to complicated culinary feats, Rachael reveals what she herself cooks for her family and friends for one whole year.Ever wonder what Rachael Ray cooks when the cameras aren’t rolling? Here she gives you an inside look into her kitchen for one full year. My Year in Meals offers intimate access to tasty dishes that will take you from breakfast to dinner. From the meals she whips up at a moment’s notice to family feasts, and dishes inspired by her travels around the world, you can now enjoy twelve incredible months of Rachael’s homemade favorites.Need something to get you out of bed in the morning? Try the Almond Custard Brioche Toast or Eastern Egg Sandwiches with Bacon. Looking to fire up that backyard barbecue? Try the Baby Back Ribs with Bourbon BBQ sauce. For something simple that will knock your guests’ socks off, try Rachael’s Egg Tagliatelle with Truffle Butter and Butternut Squash Risotto. Rachael even shares her husband John Cusimano’s amazing cocktail recipes, guaranteeing that you’ll never reach for store-bought Margarita mix again. To top it off, Rachael includes personal stories behind many of the dishes and her own never-before-seen photos of these culinary creations. In no time at all, you’ll feel like you’ve stepped into her home for a change!***A year of delicious food is only enhanced by a selection of equally tasty cocktails, and Rachael’s husband, John Cusimano, is no stranger to the cocktail shaker. Now he’s sharing his secrets with you. Whether shaken or stirred, straight up or on the rocks, with a cherry or a twist, John’s creations—like his Strawberry Velvet featuring honey liqueur, strawberries, and lime—are always fresh, fun, and certain to make any gathering more memorable. With plenty of options for every occasion and season, such as the Pomegranate Margarita, the Halloween Fizz, and the Nod to Nog, these fabulous concoctions are the perfect complement to Rachael’s year of great eating.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Nonfiction",
    "Food",
    "Reference"
  ],
  "author": "Rachael Ray",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/13547167-my-year-in-meals"
}