{
  "title": "The Divinity of Dogs: True Stories of Miracles Inspired by Man's Best Friend",
  "description": "From the bestselling author of God Stories , an uplifting collection of inspirational and heartwarming stories from people who have encountered the divine through their dogs.“My dogs have been the reason I have woken up every single day of my life with a smile on my face. I am among the ranks of millions of people who appreciate the souls of dogs and know they are a gift of pure love and an example of all that is good.” —Jennifer SkiffThe Divinity of Dogs is about the moments you learn something profound about life from an experience with a dog. Featuring more than seventy stories culled from hundreds of submissions to the author’s website, these inspiring and heartwarming true stories show where love, tolerance, comfort, compassion, loyalty, joyfulness, and even death have provided experiences that have led to spiritual enlightenment.You’ll meet Little Bit, the Chihuahua who detected a small lump in her owner’s breast, a growth even doctors couldn’t find. There’s Emma, the devoted Rottweiler who ferociously grabbed her owner’s arm at the moment he was trying to commit suicide, saving his life. You’ll be inspired by Luna, the Retriever who dragged her owner to safety after she collapsed late at night in a field. And you’ll fall in love with the many dogs who simply provide steady comfort when needed— dogs like Bo, the Boxer who soothed his mistress after the loss of her son. The author also weaves her own experiences with dogs throughout the book, showing how they comforted her through mistreatment as a child, a divorce, and a cancer diagnosis.The stories that make up The Divinity of Dogs provide hope, help, and healing for readers in the complex and difficult times in which we live. Whether you believe dogs are divine or are actually a gift from the divine, The Divinity of Dogs gives you permission to accept what you dogs are healers, educators, protectors, and tangible examples of pure love.",
  "genres": [
    "Animals",
    "Nonfiction",
    "Dogs",
    "Short Stories",
    "Memoir",
    "Audiobook",
    "Spirituality"
  ],
  "author": "Jennifer Skiff",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/13547267-the-divinity-of-dogs"
}