{
  "title": "Polyphony, Volume 4",
  "description": "INTRODUCTION It's been a long, strange road since the first volume of Polyphony was conceived by the dashboard lights along the lonely miles of I-5 in the Willamette Valley. Two and a half years have gone by, three volumes have been published in the series, markets have changed, production technology has evolved, and somehow, our book has found a home in genre. When Polyphony first took off, it was on a wing and a prayer, with the help of a few dozen supporters and a hell of a lot of hope. New Weird was not the topic of the hour, the definition of slipstream was even more arguable than it is now. The phrase \"interstitial arts\" hadn't crept into the critical lexicon, let alone spawned a foundation or a conference. We weren't even sure whether to call Polyphony \"cross-genre\" or \"slipstream\" or \"literary with a genre sensibility\" (the last being the least elegant but most descriptive). As Supreme Court Justice Potter STewart said in another context, \"We know it when we see it.\" We weren't the first. Lady Churchill's Rosebud Wristlet, Leviathan and Strange Horizons, to name several, had charted this oh-so-literate genre territory before us. We haven't necessarily been the bestonly the years will tell that. But we have been privileged to make a mark, and perhaps even set a standard, for a kind of fiction that many wanted to write, and many more wanted to read. We could fill this book thanking all the mentors, authors, publishers, reviewers, critics, booksellers, friends, fans, and family members that have helped drive that winding road. Instead we thought we'd fill this book with stories. Curl up and read. That's what we'll be doing because we still love short fiction. Deborah Layne and Jay Lake Portland, Oregon July, 2004",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Short Stories",
    "Speculative Fiction"
  ],
  "author": "Deborah Layne",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/1354733.Polyphony_Volume_4"
}