{
  "title": "Driving the Saudis",
  "description": "Actress, producer, and occasional chauffeur Jayne Amelia Larson offers a funny and insightful memoir about the time she spent as a driver for members of the Saudi royal family visiting Beverly Hills, detailing her invitation inside one of the world’s most closely guarded monarchies.When the Saudi royal family vacationed in Los Angeles, they hired Jayne Amelia Larson, an actress struggling to make ends meet, to be their personal chauffeur. She’d heard stories of the Saudis’ outrageously generous gratuities and figured that several weeks at their beck and call might be worth her time. But when the family arrived via their private jet with an entourage of forty and millions of dollars in cash, Jayne Amelia realized she might be getting into more than she bargained for. For weeks, Larson observed the family’s opulent lifestyle: they occupied four luxury hotels, enjoyed day in and day out shopping binges, and servants catered 24/7 to Princess Zaahira and her entourage. From the thirteen-year-old princess who slapped down $100 dollar bills at a supermarket and didn’t bother to wait for her change to the nanny who ran away in the airport the moment she was handed her passport, the stories Larson shares are bizarre, poignant, and illustrative of the profound contradictions and complications that only such massive wealth can create. Driving the Saudis, based on the author’s successful one-woman stage show, is a vivid portrait of the Saudi royals as few ever get to see them. As funny as it is insightful, this is a true-to-life fable for our times. But at its heart, it’s a story about the corruption that infinite wealth creates, and about what we all do for money.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "Book Club",
    "Biography Memoir",
    "Travel",
    "Islam"
  ],
  "author": "Jayne Amelia Larson",
  "average_rating": "3.20",
  "url": "https://www.goodreads.com/book/show/13547498-driving-the-saudis"
}