{
  "title": "Lamar Hunt: A Life in Sports",
  "description": "Written by award-winning author Michael MacCambridge, this is the definitive, official biography of one of the 20th century’s most important and beloved sporting figures; the soft-spoken, strong-willed man whose audacious challenge to the National Football League transformed American sports. Hunt revolutionized three different sports—pro football, tennis, and soccer—winding up in the Hall of Fame of each. Drawing on 50 years of Hunt’s personal papers and more than 200 interviews, MacCambridge provides an intimate, original portrait of the man forever captivated by these serious pursuits we call games.     \"I can't separate what part of pro football is business and what part is personal with me,\" he said. \"I just know that it is very important that I succeed.\"He had loved games as a young boy, had played them as a young man, and now, as a naive but determined 27-year-old in the summer of 1959, Lamar Hunt announced that he was going to launch a new football league.What he couldn't possibly have known on that day was that the forces of the entrenched National Football League would soon be arrayed against him. The league would place its own team in his hometown of Dallas, in direct competition with his team, and would attempt to undermine the new league, trying on repeated occasions before that first season to prevent the new American Football League from ever starting.And what the NFL couldn't have known, but would soon find out, was that Hunt, the mild-mannered, bespectacled son of legendary oilman H. L. Hunt, had an indomitable will, and patience beyond his years. Resolute and innovative, he successfully launched the AFL and, seven years later, helped broker a merger deal, which created the need for a championship game between the two leagues. Then he came up with the name of the game--the Super Bowl.Never before, and not since, has anyone with so many resources spent so much time watching, participating in, and being captivated by the absorbing ritual of sports and the suspended state of play. His accomplishments would put him in the company of the other giants of American sports--Charles C. \"Cash and Carry\" Pyle, Abe Saperstein, George Halas, Branch Rickey, Red Auerbach, Pete Rozelle. Each was present at a revolution. But Hunt, significantly, was present at a number of revolutions. And he was the catalyst for each one. Before his death in 2006, Hunt revolutionized three different sports--pro football, tennis, and soccer--winding up in the Hall of Fame of each.Written by award-winning author Michael MacCambridge, Lamar A Life In Sports is the definitive and official biography of one of the 20th century's most important and beloved sporting figures; the soft-spoken, strong-willed man whose audacious challenge to the NFL transformed the landscape of American sports, but only served as an opening act to his epic sporting journey. Drawing on 50 years of Hunt's personal papers and more than 200 interviews, author Michael MacCambridge provides an intimate, original portrait of the man forever captivated by these serious pursuits we call games.",
  "genres": [
    "Sports",
    "Football",
    "Biography",
    "Soccer"
  ],
  "author": "Michael MacCambridge",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/13547789-lamar-hunt"
}