{
  "title": "Honey the Hero",
  "description": "Smart Books for Smart Kids (Loving Birds Helps Too) - For Kids 3-8 Years Old~~~FINALIST: Eric Hoffer Awards - 2013 - Children's Books~~~Honey, an inquisitive, young parakeet living in the Australian Outback, decides to become a superhero after she spies a human family watching Superman. Since she already has the power of flight, all she needs to do is create a costume to conceal her true identity and then fly off in search of animals that need rescuing.Unfortunately, every time she tries to help, Honey only ends up making matters worse. She spoils Kangaroo’s game of hide-and-go-seek by revealing his hiding place to Wallaby; Mr. Anteater must go hungry when she alerts the ants to his presence, and Mrs. Koala is made a laughingstock among bears when Honey pretends to be her Joey. Finally realizing that she’s not as heroic as she’d like, Honey gives up her day-saving efforts.But what happens when someone actually needs Honey’s help? Will she rise to the challenge?There’s only one way to find out: join Honey in her Australian superhero adventure.~~~[Children’s Picture Books, Birds, Animals, Values, Friendship, Imagination, Adventure, Australia]~~~\"HONEY THE HERO\" by Emlyn Chand (Illustrated by Sarah Shaw)~~~Evolved Publishing brings you the first of the charming and colorful \"Bird Brain Books\" series. This children's picture book, with full color illustrations by artist Sarah Shaw, is sure to bring great fun and the joy of reading to kids 3 years old and up. [DRM-Free]~~~DISCOVER THE FULL \"BIRD BRAIN BOOKS\" SERIES:Honey the HeroDavey the DetectivePoppy the ProudTommy Goes Trick-or-TreatingCourtney Saves ChristmasVicky Finds a ValentineIzzy the InventorRicky the RuntLarry the LonelySammy Steals the ShowPolly Wants to be a PirateRuby to the Rescue~~~WHAT OTHERS ARE SAYING ABOUT THE \"BIRD BRAIN BOOKS\":Poppy the Proud: \"Poppy the Proud has so many great lessons in it - including teaching children that everyone is special and beautiful in their own way. The writing is perfect for the younger age set, and the beautiful illustrations by Sarah Shaw will help keep your little one engaged. My 5 year old loved it and reading Poppy brought about a conversation about bragging, friendship, and being special.\" ~ Karen TozCourtney Saves Christmas: \"This book is so stinkin' cute. My kiddos loved it. The illustrations [by Noelle Giffin] are fun and really captivated my 4 and 5 year old. I love that Courtney's adventure began because she wanted to say, \"thank you.\" What a great message to send during the holidays. I have a feeling this book will be read long after Christmas has come and gone.\" ~ Delphina “Delphina Reads Too Much”Vicky Finds a Valentine: “This children's book is so cute and really let's young children know what being friends is all about. The illustrations, done once again by Noelle Giffin, lend a nice touch to a great book. This book is for the younger set up to about 9 years old. I highly recommend this book to be in any child's library. Both thumbs up!” ~ Naila Moon",
  "genres": [
    "Childrens"
  ],
  "author": "Emlyn Chand",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/13548955-honey-the-hero"
}