{
  "title": "حلم السلتي",
  "description": "سعى الروائي البيروفي، ماريو بارغاس يوسا، في رواياته على معانقة أمريكا اللاتينية بأوهامها وأحلامها المجهضة وأساطيرها التي سحقتها أحذية الطغاة والدكتاتوريين.وذكرت مجلة لو نوفيل أدبسر فاتورة الفرنسية أن يوسا التحق بعد ثماني وعشرين سنة، بعدوه اللدود، الكاتب الكولومبي غارسيا ماركيز، وبعد عشرين سنة، بالكاتب المكسيكي أوكثافيوس باث، العملاقين الكبيرين في الأدب الأمريكي اللاتيني فهو روائي مثلهما، تشكل رواياته مرآة وهاجة تعكس صورة قارة طالما شهدت تمزقات وانفجارات ومفارقات. وهو يتيم الثورات المستحيلة، وعملاق الكتابة، عامل بلا كلل، يقارنه النقاد بـ«فكتور هوغو»، لم يتخل فارغاس ليوسا يوما عن الالتزام فوقف في البداية إلى جانب حكومة فيديل كاسترو، ثم يمم شطره، شيئاً فشيئاً، نحو اليمين الليبرالي ومنذ ذلك الحين حمل حملة شعواء في الصحافة على الحكومات التقدمية في أمريكا اللاتينية.ولد يوسا في مارس 1936، ودرس في جامعة ليما، ثم عمل مصححاً وناقداً أدبياً وسينمائيا، وناضل في صفوف الشبيبة الشيوعية قبل أن ينفصل عنها بسبب توجهاتها الستالينية، ثم سافر إلى إسبانيا، حيث أنجز في مدريد أطروحته، قبل أن ينتقل إلى باريس أواخر الخمسينات في القرن الماضي.يواصل بارغاس يوسا، الحاصل على أربعين دكتوراه، العمل بلا انقطاع، وفي عام 2011 أصدر روايته بعنوان «حلم السلثيء» التي هي عبارة عن سيرة روائية لثوري أيرلندي، وتاجر أسلحة ودبلوماسي بريطاني، قام بالكشف عن فظاعات الاستعمار في أفريقيا والبيرو.ومن الواضح أن يوسا، يظهر، من خلال مؤلفاته، أنه أحد أعلام الأدب العالمي المبرزين، طبقت شهرته الآفاق، حتى قبل حصوله على جائزة نوبل للآداب في العام 2010م.هذا، ويتمحور الموضع الرئيسي لرواية «حلم السلتي» حول شجب وتعرية عملية استغلال الإنسان للإنسان في غابات الكونغو، التي كانت ملكية خاصة للملك ليوبولد الثاني، ملك بلجيكا، وفي منطقة أمازونيا البيروفية التي كانت مصدراً للاستغلال البريطاني حتى مطلع القرن العشرين.ومن خلال سفرياته المتعددة، يكشف المغامر والثوري الآيرلندي روجيه كأسماء (1864 ــ 1916)، الذي كان أصدر تقريراً شهيراً عن أفريقيا، يحمل اسمه، مدى الظلم الاجتماعي، وخطورة تداعيات الاستعمار التي شهدها أيضاً في وطنه.. وانطلاقاً من حلمه في رؤية عالم خال من الاستعمار والمستعمرات وهو حلم سيقود معركته لاحقا ابتداء في خوض معركة خاصة هي معركة استغلال وطنه آيرلندا.هذان الموضوعان سوف يرسمان مسار هذا الرجل المناضل والصادق، الذي تحول عمله الإنساني، بسرعة إلى مرجعية يجب الرجوع إليها، فيما يؤدي عمله السياسي إلى موت مأساوي.وفي هذه الرواية، يقوم يوسا بإنعاش شخصية ساحرة، وتاريخية، ويجعلها حية في زمانه هو. وفي الوقت عينه، يدعونا إلى التفكير بمواضيع معاصرة مثل القومية، وكراهية البشر، وفظاعات الاستعمار الأوروبي في أفريقيا وأمريكا اللاتينية.وفي تعليق له حول كتابه، «حلم السلتي»، قال يوسا: «إن الأدب فعل للتمرد، حتى وإن كان الكاتب غير داع به، ليس بالضرورة، تمرداً سياسياً، بل فعل للتمرد ضد الحياة والتاريخ فإذا ما كنتم تبتكرون عوالم فلأن العالم كما هو، لا يحظى برضاكم.ثمة عنصر ثوري في التخيل، يبحث رغبات وميولا لأشياء يفتقدها العالم الواقعي فعندما تنتهون من قراءة كتاب عظيم، تتأثرون بجميع عيوب وشوائب العالم الواقعي. إن الرواية هي مصدر كل نقد للعالم والمجتمع، وإلا لماذا أفاقت كل الأنظمة المستبدة في التاريخ أنظمة رقابة على الأدب؟ لأنها تهابه من دون الكتب الجيدة التي قرأت، كانت نظرتي إلى العالم ستكون مختزلة جداً. وللكاتب مسؤولية باعتباره مواطناً، إذ عليه أن ينخرط في المشاركة والصحافة تساعدني كثيراً لكي أصبح على تماس بالتاريخ يوماً بعد يوم، وفوق كل شيء، أحب الأدب، لكن ليس على شاكلة الكاتب الذي يتغزل في برجه العاجي، منقطعاً عن بقية العالم».وفيما يلي بعض الفقرات الخاصة بالكونغو، من رواية حلم السلتي:عندما فتحوا باب الزنزانة، دخلت أيضاً، مع دفقة الضوء وهبة الريح، ضجة الشارع التي تخمدها الجدران الحجرية، فاستيقظ «روجيه مذعورا» وبينما هو لا يزال يرمش، مشوشا، مصارعا من أجل استعادة السكينة، لمح شبح الشريف مستنداً إلى فراغ الباب، كان وجهه المترهل، بشاربه الأشقر وعينيه النمامتين، يتأمله بجفاء لم يحاول مداراته من قبل قط، هذا شخص سيتألم إذا ما استجابت الحكومة الإنجيلزية لطلبه بالرحمة.«هل يمكنني الاستحمام اليوم» سأل قبل أن يدخل السجان البدين برأسه، وهو ينظر إلى عينيه بالاشمئزاز نفسه الذي لمحه روجيه في عيني معاون المحامي. لا يمكنك الاستحمام حتى يوم تنفيذ حكم الإعدام، قال الشريف متلذذا بالكلمات، إذا كانت هذه هي رغبتك الأخيرة في ذلك اليوم.هناك آخرون، بدل أن يطلبوا الاستحمام، يطلبون وجبة دسمة. وهذه صفقة سيئة لمستر إيليس.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Ireland",
    "Africa",
    "Nobel Prize",
    "Spanish Literature",
    "Novels"
  ],
  "author": "Mario Vargas Llosa",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/13549358"
}