{
  "title": "A Muslim American Slave: The Life of Omar Ibn Said",
  "description": "Born to a wealthy family in West Africa around 1770, Omar Ibn Said was abducted and sold into slavery in the United States, where he came to the attention of a prominent North Carolina family after filling “the walls of his room with piteous petitions to be released, all written in the Arabic language,” as one local newspaper reported. Ibn Said soon became a local celebrity, and in 1831 he was asked to write his life story, producing the only known surviving American slave narrative written in Arabic.    In A Muslim American Slave , scholar and translator Ala Alryyes offers both a definitive translation and an authoritative edition of this singularly important work, lending new insights into the early history of Islam in America and exploring the multiple, shifting interpretations of Ibn Said’s narrative by the nineteenth-century missionaries, ethnographers, and intellectuals who championed it.    This edition presents the English translation on pages facing facsimile pages of Ibn Said’s Arabic narrative, augmented by Alryyes’s comprehensive introduction, contextual essays and historical commentary by leading literary critics and scholars of Islam and the African diaspora, photographs, maps, and other writings by Omar Ibn Said. The result is an invaluable addition to our understanding of writings by enslaved Americans and a timely reminder that “Islam” and “America” are not mutually exclusive terms.    This edition presents the English translation on pages facing facsimile pages of Ibn Said’s Arabic narrative, augmented by Alryyes’s comprehensive introduction and by photographs, maps, and other writings by Omar Ibn Said. The volume also includes contextual essays and historical commentary by literary critics and scholars of Islam and the African diaspora: Michael A. Gomez, Allan D. Austin, Robert J. Allison, Sylviane A. Diouf, Ghada Osman, and Camille F. Forbes.  The result is an invaluable addition to our understanding of writings by enslaved Americans and a timely reminder that “Islam” and “America” are not mutually exclusive terms.Best Books for General Audiences, selected by the American Association of School Librarians",
  "genres": [
    "History",
    "Nonfiction",
    "Islam",
    "Biography",
    "Memoir",
    "Religion",
    "African American"
  ],
  "author": "Omar Ibn Said",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/10411079-a-muslim-american-slave"
}