{
  "title": "The Believer's Daughter",
  "description": "Things Grace Mathison did her sophomore year of high school that she never expected to do in her lifetime: 1.) Run away with her brother to New York City2.) Tattoo a unicorn on a pop star’s back 3.) Fall in love with a Russian graffiti artist At the age of 15, Grace Mathison has been sheltered most of her life. Her father is a successful television evangelist, famous for starting headline-grabbing feuds with the fathers of Grace’s classmates at the Treadwell Academy over lyrics in rap music and risqué catalog covers. Unlike her classmates at Treadwell, she prefers riding her horse, True Heart, and sketching in her drawing pad, over gossiping and shopping for fancy clothes. When Grace’s beloved older brother, Aaron, makes international headlines with a romantic relationship gone wrong, Grace finds out that her father doesn’t practice forgiveness as he preaches. Aaron is disowned, and begs Grace to run away with him to start a new life. Delving head-first into a personal examination of the difference between right and wrong, Grace grapples with everything in which she has been raised to believe.She and Aaron find themselves in New York City, struggling to meet adult challenges like paying rent and holding down jobs. To make matters worse, their parents’ troubles are only beginning. Grace learns that they are being investigated for financial fraud, and their entire empire is in danger. And then there’s Felix, the cute tattoo artist who dabbles in graffiti. Incredibly, in a city inhabited by millions, he and Grace keep crossing paths.Grace starts to realize what she’s really made of… she’s a lot tougher and smarter than the mean girls at Treadwell ever knew. In the face of losing everything she cherishes, she closely examines what she believes in and discovers what she least expected to find: that she believes in herself.",
  "genres": [
    "Young Adult",
    "Romance",
    "Fiction",
    "Contemporary",
    "High School"
  ],
  "author": "Caitlyn Duffy",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/13550544-the-believer-s-daughter"
}