{
  "title": "WISHBONE...Be Careful What You Wish For",
  "description": "WISHBONE IS A HORROR-THRILLER in the vein of THE SIXTH SENSE, THE BUTTERFLY EFFECT, SHUTTER ISLAND, CARRIE, or MISERY.A Manhattan power couple survive a tragedy and attempt a fresh start only to be plagued by unexplained and disastrous occurrences...be careful what you wish for. At the age of nine, growing up in the French countryside, Julien Grenier witnessed the brutal murder of his grandfather. Now, at forty-five, he continues to be plagued by horrific nightmares and reenactments of that tragic event. Living a successful though austere lifestyle on the Upper East Side of Manhattan, Julien has recreated himself, building emotional walls that even his young wife cannot penetrate. Though somewhat moody, Julien is a good man with a heart of gold, and a great sense of loyalty and responsibility; enabling his wife, Rachael, to turn a blind eye to his tightly-kept secrets. Rachael is thirty-two years old; an art dealer and playful free spirit, but after a home invasion assault leaves her emotionally unstable and destroys their care-free and content world, they relocate to a safer environment with the hope of a fresh start. Kings Hollow is a quaint town, nestled in the serene Catskill Mountains of upstate New York. At first, their new home appears to be the miracle they prayed for, until a traditional children's game begins to destroy their bliss; Rachael is no longer herself and Julien is experiencing a string of bad luck and unfortunate accidents. At the center of it all is seventeen-year-old Sarah, a part-time caretaker on the property. Can Julien and Rachael escape the nightmare of Kings Hollow...or is this just Wishful thinking? WISHBONE is a multi-layered thriller incorporating several sub-plots; in the vein of Pet Sematary, What Lies Beneath, Misery and Stir of Echoes. Dramatic horror at its best, Brooklyn Hudson takes you on a suspenseful roller coaster ride of emotional turmoil and shocking events.",
  "genres": [
    "Horror",
    "Thriller",
    "Mystery",
    "Fiction",
    "Paranormal",
    "Suspense",
    "Romance"
  ],
  "author": "Brooklyn Hudson",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/13550737-wishbone-be-careful-what-you-wish-for"
}