{
  "title": "The Boy Who Cried Zombie",
  "description": "The Boy Who Cried Zombie is a sampler from Alice in Zombieland, which is out now. Pick it up on Amazon It all began with The Interview. This is the very first Zombie A.C.R.E.S. short story and it laid out the path for future stories. William Lohman, a recently deceased man, holds an interview that is seen by the entire world. In this interview, he tells of how the largest pharmaceutical company in the world, Roslun Global, has been conducting secret experiments meant to revive the dead, among other atrocities. Mr. Lohman is taken quite seriously seeing as how he is obviously one of these experiments, what with the decay and all.This interview knocked over the first domino in a long series for Roslun Global, and the company’s greedy CEO Richard Roslun. Richard was not known for being subtle or calm, but he was known for getting results…at any cost.Nine years has passed since that historic interview changed the world forever. People have learned to live with the idea of zombies, much the same way they learn to live with many modern diseases; it’s a terrible thing, but it doesn’t affect them. Until it does, that is.Georgia ‘Gee’ Marie is a typical college student in the state of Washington. She enjoys reading and hanging out with her friends, smoking a little weed and going to work. Her life is pretty mundane, until she returns to see her father one day. Tough Love is the story of what this average college student finds when she returns to her father’s home that fateful day. Gee and her younger half-sister Alice, are about to begin the greatest trials of their lives. Not only will their will to survive be tested, but the bonds that hold them together as family and loved ones will be stressed to the max.Gee and Alice are not the only ones to be greatly affected by the terrible actions of Richard Roslun. Sam Ashe and his fiancée, Heather Young, have just moved to a nice neighborhood in Seattle. Their new neighborhood is beautifully manicured, right down to the last tree lining the street. This area was chosen for its aesthetics, but also for its safety. According to several of Sam’s favorite zombie reporting sites, a very low number of incidents have been reported here.This would be why Sam is caught off guard one night in The Boy Who Cried Zombie. After an intense gaming session, Sam sees what he believes to be a zombie. Thinking of his love, he heads off to save her from the inevitable zombie outbreak about to occur. Their path is not an easy one, and again, human emotions will be stretched to the limit. If you have ever been in love, and I mean true love, then Sam and Heather’s tale will grab you by the heartstrings and never let go.",
  "genres": [
    "Zombies",
    "Short Stories",
    "Horror"
  ],
  "author": "Joshua Cook",
  "average_rating": "3.18",
  "url": "https://www.goodreads.com/book/show/13551452-the-boy-who-cried-zombie"
}