{
  "title": "The Havenshire Resistance",
  "description": "“The planet Drako is inhabited by space travelers who over time regressed to a feudal society where previous technology is outlawed, until a new generation of human visitors, including a psychopath bent on total domination, change the status quo. Good might triumph over evil, but it is taking years to accomplish within the framework of the existing society. The struggle presents reminders from our history and lessons for the future woven between the lines of this intriguing adventure.” Arleen Alleman, AuthorWhen chaos erupts in the kingdom, Havenshire falls to Krystal’s worst enemy. As queen she must safeguard her precious daughters and devise a plan to rescue her beloved from Jarrack. She forms the \"Havenshire Resistance\" and initiates an underground black market to finance a ragtag army of Samurai, peasants, and renegades among the gentry. Hiding in the safety of the Fire Temple, Krystal waits for her daughters to mature. As the girls near their seventeenth birthday, dreams stimulate their repressed memories, and they are compelled to find each other. It’s a dangerous world for teenage girls. Desert riders roam the countryside to find and capture Krystal’s daughters. The girls travel with trusted guardians and animal friends—a dragon, panther, and hawk—to join forces and learn how to use their special abilities in the upcoming battle. The daughters petition the wolves to join their fight against Jarrack the wolves’ Council of Elders.Krystal prepares her army to wage a surprise attack against the enemy stronghold that was once her home. A cunning schemer and determined general, Krystal is now a stranger to her own children. Can she win the battle and regain her stolen life? How will her strong will and fortitude fit into the role of queen once the battle is over?",
  "genres": [],
  "author": "Diane Rapp",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/13551957-the-havenshire-resistance"
}