{
  "title": "A Whisper in the Dark: Twelve Thrilling Tales",
  "description": "Last year, literary history was made with the publication of Louisa May Alcott's thriller,A Long Fatal Love Chase. This \"new\" novel--denied publication in her lifetime--went on to be a national best-seller, and marked Alcott's major debut as a writer of adult fiction, complementing her already secure position as author of timeless children's classics. But this newly discovered novel was by no means Alcott's first or only attempt at sensational writing; she was a prolific writer who produced many other \"blood & thunder\" stories, many written and published under a pseudonym or anonymously.This collection represents the best of Alcott's adult oeuvre, starting with A Modern Mephistopheles, a dark Faustian tale inspired by A Long Fatal Love Chase. The stories in this volume display dramatic intensity and thrilling, suspenseful plots that show Alcott to be a complex and passionate writer. Readers will discover within this maelstrom of murder, deceit, obsessive desire, treachery, duplicity, and betrayal that love and honor can still conquer all.The book takes its title from the tale \"A Whisper in the Dark,\" arguably Alcott's high-gothic masterpiece, a story of imperiled innocence. Also featured \"The Abbot's Ghost,\" one of Alcott's few thrillers that employs the supernatural; \"Perilous Play,\" a sensationalist story in which she suggests that with the appropriate stimulation--in this case hashish--even the innocent reveal a dark side; and V.V.; or Plots and Counterplots, fraught with passion and jealousy that introduces the mysterious Virginie Varens, the darkest heroine in all of her work.Throughout, Alcott's treatment of such adult themes as sexual conflict, treachery and deception, drugs and suicide results in a gripping voyage of discovery for the modern reader. As novelist Susie Mee points out in her introduction, \"[Alcott] also knew that one has to explore what lies beyond that threshold. As a result, she spread her cobweb wide and caught many strange and wondrous creatures in it, some of whom are contained within these pages.\"",
  "genres": [
    "Classics",
    "Fiction",
    "Short Stories",
    "Mystery",
    "Historical",
    "Gothic",
    "Classic Literature"
  ],
  "author": "Louisa May Alcott",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/1355185.A_Whisper_in_the_Dark"
}