{
  "title": "Intrinsic Motivation and Self-Determination in Human Behavior",
  "description": "Early in this century, most empirically oriented psychologists believed that all motivation was based in the physiology of a set of non-nervous­ system tissue needs. The theories of that era reflected this belief and used it in an attempt to explain an increasing number of phenomena. It was not until the 1950s that it became irrefutably clear that much of human motivation is based not in these drives, but rather in a set of innate psychological needs. Their physiological basis is less understood; and as concepts, these needs lend themselves more easily to psycho­ logical than to physiological theorizing. The convergence of evidence from a variety of scholarly efforts suggests that there are three such needs: self-determination, competence, and interpersonal relatedness. This book is primarily about self-determination and competence (with particular emphasis on the former), and about the processes and structures that relate to these needs. The need for interpersonal relat­ edness, while no less important, remains to be explored, and the findings from those explorations will need to be integrated with the present theory to develop a broad, organismic theory of human motivation. Thus far, we have articulated self-determination theory, which is offered as a working theory-a theory in the making. To stimulate the research that will allow it to evolve further, we have stated self-determination theory in the form of minitheories that relate to more circumscribed domains, and we have developed paradigms for testing predictions from the various minitheories.",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Education",
    "Personal Development",
    "Leadership",
    "Self Help",
    "Neuroscience"
  ],
  "author": "Edward L. Deci",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/1041225.Intrinsic_Motivation_and_Self_Determination_in_Human_Behavior"
}