{
  "title": "Hello, Zombie!",
  "description": "Take a break from predictable novels to become part of a darkly comic adventure in Surrealism and social commentary, told through a collection of over 2 dozen songs...Welcome to ZUMANKIND’s groundbreaking debut performance of Hello, Zombie! – the riotously hilarious and brilliantly terrifying, black-as-a-top-hat satiric, saturnine-vs-jovial mad-cap Broadway Musical Scentsation!Embark with us on a darkly comic adventure in Surrealism and social commentary, told through a collection of over 2 dozen songs - some in which you may even play a part!Experience All the Greatest Broadway Hits of All Time, performed by a most unlikely cast of zombies and living actors – joined together for the very first time! Join Us Now and be part of our equally unlikely audience – blending zombie and living-human theatre-goers! Be-in and be proud, and stand out for brotherhood!Hear forever enduring and unifying classics like, “Somewhere Under the Grave-Row’, “Sinkin’ In Your Brain”, and “I’m Getting Buried in the Mass Grave!” So “Let Zombie Pride March Begin!” for “Life is a Brash Soiree, Old Sponge,” and “The Mushroom Will Cloud, Tomorrow…”Welcome to the Grand Theatre; where the curtain between the macabre and the make-believe is stripped naked - forever to haunt your mind’s ear. Not even a rather severe case of death, zombification, or worse could cause you to forget these disturbingly catchy, archetypal musical classics! Prepare yourself for a nail-biting, brain-tingling adrenalin splattering that promises to keep you on the edge of your seat (if you weren’t already helplessly shackled there)!- Jam-packed with COLOR ILLUSTRATIONS for the illiterate undead!( Contains intense zombie psychoanalysis, satire, surrealism...)“Ladies and gentlemen, boys and girls – sentient and receptively challenged – this evening’s crowning performance will now begin. Please take your seats if you are able; and if you can understand this announcement please note there are translators fluent in American Revenant Sign Language on the screens to the left and right of the main stage…”",
  "genres": [
    "Zombies"
  ],
  "author": "Jeff  Cannon",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/13553013-hello-zombie"
}