{
  "title": "Shades: Eight Tales of Terror",
  "description": "Here there be ghosts...Within these pages lurks a cast of phantoms who have returned from the grave with a vengeance. You will find no friendly ghosts here, just eight deathly horrors with their own personal bones to pick with the living. These are the ghosts of our nightmares. Whether driven by madness, vengeance, pain, bloody evil, or primordial rage...they are all specters that are as dangerous as they are frightening. So get comfortable, get that night light ready, and find out who survives and who doesn't in this anthology of the baleful dead. Stories within include...Death and White Satin - A young bride-to-be unearths the wrong wedding dress and discovers that horror and madness can echo down through the decades.An Echo of Blood and Mirrors - A young man is surprised in the boy's bathroom by the head cheerleader. But things quickly take a turn for the worse as he discovers she's on the run from a triple murderer who has been dead for over a century.Dance of the Ancients - Three lawmen search for a missing state trooper on a hill doomed to disappear under the rising waters of a new lake. Fearing the worst, they find something even worse than they feared.A Memory of Me - A night spent in a forgotten graveyard lands three college boys in a situation that none of their classes have prepared them for.Legacy of Flies - A young woman discovers she is the heir of a vast family fortune. But she also finds her inheritance comes with a ghoulish legacy that may very well be the death of her.Storm Chase - A hurricane approaches and Bernie March's wife is standing down the hill beside the tractor he needs to bring in ahead of the storm...exactly where he buried her three years earlier.A Singularity of Purpose - A callous young punk discovers that returning from the dead isn't just the prerogative of humans when he finds himself in one last desperate race with the dog he tormented in life.A Long, Cold Forever of a Night - On a humid July night, a middle-aged couple find themselves alone in a deserted rural intersection...with the deadly phantom of a high school classmate who died in an ice storm decades earlier.",
  "genres": [
    "Horror",
    "Fiction"
  ],
  "author": "D. Nathan Hilliard",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/13554923-shades"
}