{
  "title": "Starstruck",
  "description": "As the drama surrounding Madison, Carmen, Gaby, and Kate is played out in front of the cameras and the relentless paparazzi, the girls quickly discover that fame comes at a price. Featuring hot new characters and old favorites from the #1 New York Times bestselling series L.A. Candy, the second Fame Game novel chronicles the rise and fall of Hollywood’s newest reality stars.---Are the stars of The Fame Game ready for their close-ups?Madison Parker has discovered that not all publicity is good publicity. After turning herself in for stealing some bling, the reality star is stuck doing community service while her Fame Game castmates soak up all the screen time. Not that newcomer Kate Hayes needs more attention—ever since her breakout song became an overnight sensation she's suddenly acting like she's Katy Perry. Aspiring actress Carmen Curtis is finally making a name for herself, but she's finding it harder than ever to get out from behind her famous mother's shadow. And in Hollywood, leading men are a dime a dozen, but a good man is hard to find. So when two of the girls have their eye on the same guy, that can mean only one thing: on-camera drama.In the second novel in bestselling author Lauren Conrad's Fame Game series, friendships are tested, lines are crossed, and fashion crimes are committed—and that's before the cameras even start rolling.Anyone who has ever wondered what it is like to make it in Hollywood will love this fun, addictive series written by someone who has seen—and lived—it all. Full of dishy details about young Hollywood that only an insider can reveal, bestselling author, fashion designer, and television star Lauren Conrad shows that the real drama happens behind the scenes.",
  "genres": [
    "Young Adult",
    "Chick Lit",
    "Fiction",
    "Romance",
    "Contemporary",
    "Teen",
    "Audiobook"
  ],
  "author": "Lauren Conrad",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/13554846-starstruck"
}