{
  "title": "The Treeman",
  "description": "Kindle at Amazon UK: http://amzn.to/GNvWyE Kindle at Amazon USA: http://amzn.to/GHoeIG Paperback at Lulu: http://bit.ly/GH2lUhWhat would you do if a ghost told you to get a life? ...Izzy flees to the countryside to make a new start. Away from her fickle fiance, the interfering ghost of her dead father and his sex-hungry mistress. Not only do all three follow her and shatter her peace, but she's also joined by Jodie, her annoying younger sister, and her mother going through a startling life change. The serene village of Hanningdon is about to become very busy indeed.But Izzy makes a discovery to put all this into the shade. A beautiful and disturbed young man living in the oak tree outside her window. A treeman with a mysterious gift and an even more mysterious past. And a brother who makes everything much more complicated.The infuence of their late Romany grandmother, Mari, still holds strong over the two brothers and over Hanningdon itself. And Izzy seems to be the key to unlock their secrets, their hearts and the magic of Mari.Funny and compelling, the story of Izzy and the Treeman will keep you in suspense to the end, with a host of outrageous characters.An intriguing romance, with a dash of danger and a splash of paranormal activity and magic. Acclaim for THE TREEMANBook One in The Hanningdon Magic Series“A superbly crafted and expertly developed debut novel…very funny, but equally tragic. Romance and deep-seated passions underpin the narrative.”Andrew Marlow, Moonprint Publishing“The most inventive book I have read in years…you’ll be hooked because there are so many twists and turns. It’s very good.”Bernie Keith, BBC Radio Northamptonshire“Her book will have you up in the wee hours, laughing and sympathizing, altogether unable to put it down.”Carol Marrs Phipps, co-author of Good Sister, Bad Sister“Cheer for them, hurt for them, love for them. Each back story is compelling, interesting, and paints a vivid picture of each personality.”Javier A Robayo, author of The Gaze",
  "genres": [
    "Paranormal",
    "Romance"
  ],
  "author": "Kaye Vincent",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/13555178-the-treeman"
}