{
  "title": "Beyond Sanctuary",
  "description": "In Beyond Sanctuary, the immortal Tempus and his ancient cavalry squadron take the war between magic and the gods to the mages of Wizardwall. Tempus and his Sacred Band of Stepsons begin a series of new adventures that start in Sanctuary(R) but go far “beyond,” pitting some of Thieves World's(R) most canonical characters against unforgettable villains and their own frailties while souls hang in the balance.  Love and war mix in a heady mix of ancient history and mythic fiction, love and hate, philosophy and ethos. Sacred Band pairs are forged in the crucible of the wizard wars: lovers and warriors win and lose as the hurly-burly of battle tests all loyalties. Some of Thieves' World's most popular characters stretch out and new characters are introduced in this fast-paced tale that's lyrical and lucid: the immortal Tempus and his sister; the allergic mageling Randal; the Froth Daughter Jihan, join the Sacred Band of Stepsons, fighting for freedom of the human spirit.  Beyond Sanctuary marks the emergence of the Sacred Band series of novels, as well as the first authorized and independent Thieves' World® novel. Two iconic Thieves' World stories lead naturally into this trek into farther realms of body and mind, so new readers are well grounded. Although Beyond Sanctuary stands alone, it begins a major epic and is the first of the author's three “Beyond” novels. Janet Morris stretches out and plows new ground, exploring unknown realms with Tempus and his hand-picked band of paired fighters. Demons and warlocks, witches and fiends, enemies human and inhuman clash at every turn while allegiances fracture and reform. Ancient warfare becomes reality and gods take the field with their favorites. Passion, philosophy, and high adventure make a heady, vivid mix as armies use magic and gods use the weather to harry opposing forces. When the Sacred Band and its formidable female allies finally join with the local high-peaks bandits and the storm god of the armies to assault Wizardwall itself, anything can happen – and does. War and witchery abound in this mystical adventure of love and death Beyond Sanctuary.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Science Fiction",
    "Science Fiction Fantasy",
    "Dark Fantasy",
    "Sword and Sorcery",
    "Historical Fiction"
  ],
  "author": "Janet E. Morris",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/13555790-beyond-sanctuary"
}