{
  "title": "The Angry Woman Suite",
  "description": "Secrets and lies suffuse generations of one Pennsylvania family, creating a vicious cycle of cruelty in this historical novel that spans the early 1900s to the 1960s. Raised in a crumbling New England mansion by four women with personalities as split as a cracked mirror, young Francis Grayson has an obsessive need to fix them all. There's his mother, distant and beautiful Magdalene; his disfigured, suffocating Aunt Stella; his odious grandmother; and the bane of his existence, his abusive and delusional Aunt Lothian. For years, Francis plays a tricky game of duck and cover with the women, turning to music to stay sane. He finds a friend and mentor in Aidan Madsen, schoolmaster, local Revolutionary War historian, musician and keeper of the Grayson women's darkest secrets. In a skillful move by Fullbright, those secrets are revealed through the viewpoints of three different people-Aidan, Francis and Francis'stepdaughter, Elyse-adding layers of eloquent complexity to a story as powerful as it is troubling. While Francis realizes his dream of forming his own big band in the 1940s, his success is tempered by the inner monster of his childhood, one that roars to life when he marries Elyse's mother. Elyse becomes her stepfather's favorite target, and her bitterness becomes entwined with a desire to know the real Francis Grayson. For Aidan's part, his involvement with the Grayson family only deepens, and secrets carried for a lifetime begin to coalesce as he seeks to enlighten Francis-and subsequently Elyse-of why the events of so many years ago matter now. The ugliness of deceit. betrayal and resentment permeates the narrative, yet there are shining moments of hope, especially in the relationship between Elyse and her grandfather. Ultimately, as more of the past filters into the present, the question becomes: What is the truth, and whose version of the truth is correct? Fullbright never untangles this conundrum, and it only adds to the richness of this exemplary novel. A superb debut that exposes the consequences of the choices we make and legacy's sometimes excruciating embrace.",
  "genres": [
    "Amazon",
    "Thriller",
    "Mystery Thriller",
    "Fiction",
    "Book Club",
    "Literary Fiction",
    "Historical"
  ],
  "author": "Lee Fullbright",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/13555924-the-angry-woman-suite"
}