{
  "title": "خماسية مدن الملح",
  "description": "مدن الملح هي رواية عربية للروائي السعودي عبد الرحمن المنيف ، تعد واحدة من أشهر الروايات العربية وتتألف هذه الرواية من خمسة أجزاء. الرواية تتكلم وتصور الحياة مع بداية اكتشاف النفط والتحولات المتسارعة التي حلت بمدن وقرى الجزيرة العربية بسبب أكتشاف النفط.أجزاء الرواية 1-التيه: يتناول الجزء الأول بوادر ظهور النفط في الجزيرة العربية من خلال سكانها وتظهر شخصية متعب الهذال الرافضة كتعبير عن الموقف العفوي لأصحاب الأرض مما اجبر السلطة أن تستعمل العنف. يصف هذا الجزء بالتفصيل بناء المدن الجديدة (حران كانت النموذج) والتغيرات القاسية والعاصفة على المستوى المكاني وخاصة الإنساني. 2-الأخدود: في الجزء الثاني ينتقل منيف إلى تصوير اهل السلطة والسياسة في الصحراء التي تتحول إلى حقل بترولي. نقطة البداية كانت انتقال الحكم من السلطان خربيط إلى ابنه خزعل الذي يمنح كل التسهيلات إلى الأمريكان لتحقيق مخططاتهم. الشخصية الرئيسية في هذا الجزء هو مستشار السلطان الجديد صبحي المحملجي الملقب بالحكيم وهو من أصل لبناني جاء إلى حران أولا كطبيب ثم ينتقل إلى العاصمة موران بحس مغامر ليرتقي إلى أكبر المناصب ويبسط نفوذه. في هذا الجزء تزداد وتيرة التحولات حدة وسرعة بحيث لا يستطيع أحد أن يتنبأ بما ستؤول اليه الأمور. ينتهي هذا الجزء في لحظة انقلاب فنر على اخيه حين كان خارج موران. 3-تقاسيم الليل والنهار: يعود الجزء الثالث إلى جذور العائلة الحاكمة إلى سنوات التصارع القبائلي التي تتوج خربيط كأهم حاكم في المنطقة في اللحظة التي يقتحم فيها الغرب الصحراء فيجد في تحالفه مع خربيط وسيلة لامتلاك الثروة التي كان يبحث عنها ويستغل السلطان ذلك الظرف للهيمنة على كل ما يمكن أن تطاله يده ويعود هذا الجزء إلى نشأة كل من خزعل وفنر. 4-المنبت: الجزء الرابع هو عبارة عن سيرة خزعل في المنفى حتى وفاته مع رصد للتغييرات الانقلابية التي فرضها فنر ومحاولته أن يحول مسار الصحراء من جديد متخلصا من بقايا سياسات أبيه وأخيه والنفوذ الأامريكي ويبدأ في تأسيس دولة بأجهزة موالية له ذات ملامح قاسية كالصحراء. 5- بادية الظلمات: بعد أن يستقر الأمر بلا منازع لفنر يعود منيف لرصد حالة الناس في ظل هذه المتغيرات حيث لا تبقى العادات هي نفسها ولا حتى الأمكنة ويتغير حتى شكل الانتماء والهوية. في هذا الجزء الأخير يصبح اسم الأرض بالدولة الهديبية ويصبح فنر شخصية أسطورية لكنه ينتهي بالاغتيال من خاصته. تعتبر من الروايات الممنوعة في المملكة العربية السعودية، تمثل نقلة نوعية في السرد التاريخي والتأريخ الشخصي لحقبة يجد الكثير من الجيل الجديد صورة غير كاملة يضيعها وصف ما بعد تلك المرحلة أو الحاضر بصورة وردية ولكن أيضا غير كاملة(60% من سكان السعودية حول ودون 21 سنة 2004-2007) مدن الملح هي وثيقة مهمة تتحدث وتؤرخ عما هب على الحياة البدوية من رياح حضارية أثرت بلا شك بحياة البداوة الكاتب رصد بدقة الحياة البدوية وعبر عن ما يجيش في نفوس الكثير من البدو وتحول حالهم إلى الغنى المفاجئ والاثار الناتجة عن ذلك.",
  "genres": [
    "Novels",
    "Fiction",
    "Literature",
    "Historical Fiction",
    "Politics",
    "Roman",
    "Cultural"
  ],
  "author": "عبد الرحمن منيف",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/13556408"
}