{
  "title": "Lifeboat No. 8: An Untold Tale of Love, Loss, and Surviving the Titanic",
  "description": "When the Titanic started sinking, who would make it off alive? The two cousins who had been so eager to see their first iceberg? The maid who desperately tried to escape with the baby in her care? The young newlyweds who’d booked passage despite warnings not to?One hundred years after that disastrous and emblematic voyage, Elizabeth Kaye reveals the extraordinary, little-known story behind one of the first lifeboats to leave the doomed ship.Told in real time and in the actual voices of survivors, Kaye’s poignant, pulse-pounding narrative includes the story of the Countess of Rothes, the wealthiest woman on the ship, bound for California, where she and her husband planned to start an orange farm. It was the Countess, dressed in ermine and pearls, who took command of Lifeboat No. 8, rowing for hours through the black and icy water. In the words of one of the Titanic’s crew, she was “more of a man than any we have on board.”At the heart of Kaye’s tale is a budding romance between the Countess’s maid, Roberta Maioni, and the Titanic’s valiant wireless operator, Jack Phillips. While Roberta made it safely onto Lifeboat No. 8, holding nothing but a photo of Jack she had run back to her cabin to retrieve, he remained on the ship, where he would send out the world’s first SOS signal. But would it be received in time to save his life?Surviving that fateful night in the North Atlantic was not the end of the saga for those aboard Lifeboat No 8. Kaye reveals what happened to each passenger and crew member and how the legendary maritime disaster haunted them forever.A century later, we’re still captivated by the Titanic and its passengers. With its skillful use of survivors’ letters, diaries, and testimonies, “Lifeboat No. 8” adds a dramatic new chapter to the ongoing story.",
  "genres": [
    "Nonfiction",
    "History",
    "Historical",
    "Adult",
    "Short Stories",
    "Survival",
    "Biography"
  ],
  "author": "Elizabeth Kaye",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/13556710-lifeboat-no-8"
}