{
  "title": "The Magnificent Ambersons",
  "description": "\"At the age of nine, George Amberson Minafer, the Major's one grandchild, was a princely terror…\"\nGeorgie Amberson Minafer, the spoiled only grandchild of a wealthy Midwest family, is alternately loathed and revered by nearly everyone in town. His beautiful face and privileged upbringing create an image that is difficult for people to resist, particularly people who are used to watching everything the Amberson family says and does. When Lucy Morgan arrives in town and enters the story, she too is captured by the magnificence of the Amberson family, and particularly by Georgie. But little do Georgie and Lucy know that their parents were also once in love.Isabel Amberson, Georgie’s mother, was the most sought-after girl in town. Eugene Morgan, Lucy’s father, was the only young man who could capture Isabel’s heart. Through a youthful misunderstanding the star-crossed lovers were parted, only to be reunited years later, now with children of their own. Will Eugene and Isabel be able to finish their love story with a happy ending? Or will Georgie, used to being worshipped by his mother, be unable to accept that his mother is a woman who may need some completion outside of serving her one and only adored son?The Magnificent Ambersons is a story of unfulfilled love and the redemption of the human soul told against the backdrop of a changing world, a world in which old money and family prestige is rapidly being taken over by progress and industrialization. Written in 1918 and winner of the Pulitzer Prize in 1919, The Magnificent Ambersons still delivers a relative tale for today’s audience that is facing a whole new set of socioeconomic pressures in an ever-changing world.Bonus Content: Introduction, Glossary, Image GalleryLegacy Vintage Collection Enhanced eBooks have been professionally edited for readability and professionally formatted for your favorite e-reader! View more on The Vintage Reader.Please Note: The ebook available to read instantly from Goodreads is NOT the Legacy Vintage Collection Enhanced Edition.",
  "genres": [
    "Fiction",
    "Classics",
    "Historical Fiction",
    "Literature",
    "American",
    "Novels",
    "Book Club"
  ],
  "author": "Booth Tarkington",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/13556953-the-magnificent-ambersons"
}