{
  "title": "Insanity",
  "description": "From Book 1: Adelaide Carmichael and Damien Allen couldn't have been more opposite.Adelaide's mother abandoned her when she was ten years old, leaving her to be raised by her abusive and alcoholic father.Damien on the other hand came from a wealthy family, was a local celebrity, and seemed to have a bright future ahead of him.Despite their differences, Adelaide and Damien were young, wild, and fiercely in love.And they had a plan.They were going to run away together.To live and love each other freely without restraints.And their plan was set in motion, until tragedy struck and for some reason, Adelaide wound up in The Oakhill Institution for the insane.Adelaide has no idea what she did to wind up at Oakhill, but she knows one thing for sure...She wants out.And after Damien follows her there to aid her in escaping, Adelaide slowly begins putting together the pieces of her missing memory.And it doesn't take Adelaide long to figure out that sometimes...That one true love never dies.This is a mature New Adult Romance novel, intended for ages 17 and up. Excerpt~There's a ringing in my ears that I can't shut out. There's a hand on my wrist that doesn't let go. Before exhaustion takes over I look up. Blue eyes is at the end of the bed. He releases my wrist and laces his fingers through mine. I squint as the sedative blurs my vision, begins to decapitate my mind, and then notice the painful look in those blue blue eyes.On top of the pain in the two blue gems there's familiarity.Oh God. Oh God. Oh God.How could I forget him? Him, of all people. The one person in the entire world who holds the key to my heart. The one and only person who has ever really loved me. Then I remind myself that they feed and inject me with so many drugs, that its a miracle I don't forget who I am.I struggle to sound coherent, “Damien?”He mouths something.Six words.Six words that seem too impossible to be true.Six words that bleed hope into my soul.Six words.“You're not crazy. I love you.”",
  "genres": [
    "Romance",
    "New Adult",
    "Young Adult",
    "Abuse",
    "Contemporary",
    "Dark",
    "Mystery"
  ],
  "author": "Lauren Hammond",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/13557662-insanity"
}