{
  "title": "Eville",
  "description": "First day on the job: The room is on fire, flooded with smoke. The boss is blowing holes in the wall with her elephant gun, miserably failing in an attempt to shoot down the tentacle-covered beast hungrily latched onto her new employee’s leg. Alex peers through the window, four stories above ground, contemplating if he could miraculously survive a jump down, seeing as how this demon is likely to devour him before his mad boss actually hits her mark. You know, this sort of crap never happened when he was working at the video store. Welcome to EVILLE, the first in a series of quirky, epic, sci-fi/fantasy adventures (think The Hitchhiker's Guide to the Galaxy crossed with The Addams Family). Serene Necrosia is a brilliant scientist, on the brink of creating something that will change the lives of every living thing on the planet. The only problem is that she has been vaporizing, incinerating, and generally decimating her staff at an alarming rate- all in the name of progress, naturally. But now the Hunchback Union has had enough, and is refusing to supply the woman additional labor. What’s a mad scientist to do? Search for a desperate, poor sap who doesn’t know any better to fill in the vacancy. Alex Hobbs is down on his luck. He’s lost his job, is dead broke, his girlfriend just dumped him, his car died, and the turkey baking in his neighbor’s oven detonated and burned down his apartment. It’s been one of those weeks. Desperate, he turns to the local employment agency for a job- any job to keep him from starving on the street. When a rather odd fellow working at the agency tells Alex about an exciting entry level position, vaguely described as being in the scientific/medical field, he jumps at the opportunity. Sure, it sounds too good to be true, but a guy’s luck has to turn around sometime, right? Alex now finds himself stuck in an insane mansion deep in the countryside, bordering the mysterious community of Eville, populated by a colorful cast of volatile inventors, the worlds’ surliest hunchback, stately werewolves, goblin barbers, and the lonely, disembodied brains of ex-husbands whose only form of communication is a worn out Etch-A-Sketch. With free room and board and an exceptionally generous salary, Alex figures he can stick through the madness long enough to get back on his feet. That is, of course, if Serene doesn’t inadvertently kill him off with one of her crackpot inventions before payday.",
  "genres": [
    "Fantasy",
    "Humor",
    "Horror",
    "Science Fiction",
    "Paranormal"
  ],
  "author": "Holand Peterson",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/13558074-eville"
}