{
  "title": "Thrown to the Wolves",
  "description": "Thrown to the Wolves is the first volume of the Wolf Mountain werewolf sex series. The second volume is Sating the Wolves, available now.High in the mountains above a remote ski resort, Aylen and Emily peer through their binoculars at the distant wolf pack. Why are they not mating? What scent have they caught on the wind? Why do these wolves seem... different?It won't be long before they discover the terrible truth...The howl turned to a yell, cracking halfway as the vocal cords shifted, and the alpha came, his screams echoing around the clearing. As soon as he'd filled Emily with his seed he fell to the side, sliding out of her ravaged pussy to collapse beside her. Aylen stared in shock. He was human, it was undeniable. The fur remained across the chest and back, thinner but still coarse, and the hair on his head was a long, greasy mane, but apart from that he looked entirely human.Howls erupted from the edge of the clearing, and in the darkness Aylen could make out the shifting shapes of the other wolves. They began to prowl from the darkness into the moonlight, both men and women, all of them muscular and powerful. They walked like... well, like wolves. Aylen knew each of them intimately, and she thought she could identify them by the way they moved around the clearing.One woman, tall and rangy with dark, dirty hair and a pert, luscious ass prowled around the center, her eyes never leaving Emily and the alpha. She was the alpha female, Aylen realized, and she'd been cheated from her prize. The alpha male lazily lifted his head and growled a warning, and she backed away a few steps before holding her ground. The male rose to his feet and stood firm, a low growl rumbling from his throat, and then he turned quickly, lifted Emily easily with one hand and threw her over his shoulder. Without another sound he was gone from the clearing, and Emily with him.Too late, Aylen understood her problem. When the alpha had fucked Emily he'd made her the new alpha female. The old alpha had fallen in rank, and Aylen herself... well, she was nothing. Fair game. She hid behind the rock, trying to make herself smaller. The other wolves knew she was there, but maybe they'd be preoccupied with their own kind in the mating frenzy that was beginning. If she stayed silent she may have the chance to creep from the clearing while the wolves were lost in their private bliss. She just had to -The first wolf attacked. The man landed heavily on her back, pushing her down against the rock with his powerful arms, pinning her to the cold stone as he yanked her ski pants down to her knees. She yelled in shock and pain as he forced his way inside her. His cock was enormous, and this time it was already erect. Aylen's nose was filled with the musky scent of his sweat, and she felt his searing breath on the back of her neck as he forced her against the rock. He fucked her feverishly, hard and fast, and it was only moments before she felt the first jet of hot cum spurt into her pussy. She never even saw her attacker. By the time she caught her breath and turned around he'd melted back into the pack.Aylen shook with fear. She felt hot cum dripping down her inner thighs, and she knew her body was sending out signals that every member of the pack could sense. She tried to back against the rock to block attackers from the rear, but as she turned she saw four men staring at her body. Their sharp yellow eyes bore into her, and their lips gleamed as they snarled with hunger.",
  "genres": [
    "Paranormal",
    "Erotica",
    "Shapeshifters",
    "Werewolves",
    "Paranormal Romance"
  ],
  "author": "Aya Fukunishi",
  "average_rating": "2.82",
  "url": "https://www.goodreads.com/book/show/13558470-thrown-to-the-wolves"
}