{
  "title": "For Services Rendered",
  "description": "A Cinderella story . . .  Claire Kendrick didn't know what to think when she was summoned to the 50th floor to meet the president of Callahan, International. As handsome, blue-eyed Nick Callahan explained her special assignment --- writing an article about him for CEO Magazine --- Claire's apprehensions grew. There was something he wasn't telling her, something odd that she couldn't put her finger on. What did he really want from her?  Her green eyes, golden hair, and striking beauty were the first things that had caught Nick's attention. Then he had her background checked out, and he was doubly impressed. Claire Kendrick was a smart, hard-working, loyal employee. She was also supporting her mother, who needed expensive full-time medical care. All in all, Claire was the perfect candidate for the position Nick needed to fill.  While researching the article on Nick, Claire found herself awed by the success story of the man who'd made his first million before he was thirty. His brilliant blue eyes were mesmerizing, his sexy smile distracting, his hidden, kind nature surprising and admirable. And then, out of the blue, Nick offered her a startling proposition. He would support Claire and her mother in exchange for services rendered --- as a wife and mother to his children!  It would have been a fantasy, a dream come true, a Cinderella story --- except for one oversight. Could Claire exist in a marriage of convenience? What kind of marriage would it be . . . without love?  * * * In the hands of Patricia Kay, USA Today bestselling author of more than 50 novels of romance and women's fiction, this classic, heartwarming, and sexy romance comes alive with an emotional connection that will leave readers sighing happily.  FOR SERVICES RENDERED was first offered to readers in 1993 in a limited edition distributed to mail order subscribers. This 2012 edition is the first time this story has been available to readers everywhere.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Chick Lit",
    "Adult",
    "Category Romance",
    "Marriage"
  ],
  "author": "Ann Patrick",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/13558778-for-services-rendered"
}