{
  "title": "Lysis/Symposium/Gorgias",
  "description": "Athenian philosopher Plato was born in 427 BCE. An admirer of Socrates in early manhood, he later founded the school of philosophy in the grove Academus. Much recorded of his life is uncertain; that he left Athens for a time after Socrates' execution is probable; that later he went to Cyrene, Egypt & Sicily is possible; that he was wealthy is likely; that he was critical of democracy is obvious. He lived to be 80. Linguistic tests including those of computer science try to establish the order of his extant philosophical dialogs, written in splendid prose, revealing Socrates' mind fused with Plato's thought. In Laches, Charmides & Lysis, Socrates & others discuss separate ethical conceptions. Protagoras, Ion & Meno discuss whether righteousness is teachable. In Gorgias, Socrates is estranged from his city's thought. His fate is impending. The Apology (not a dialog), Crito, Euthyphro and Phaedo relate the trial & death of Socrates & propound the soul's immortality. In Symposium & Phaedrus, written when Socrates was still alive, we find the origin & meaning of love. Cratylus discusses the nature of language. The ten books of the Republic concern righteousness (& involves education, sex equality, the structure of society & abolition of slavery). Of the six so-called dialectical dialogs Euthydemus deals with philosophy; metaphysical Parmenides is about general concepts & absolute being; Theaetetus reasons about epistemology. Of its sequels, Sophist deals with not-being; Politicus with good & bad statesmanship & governments; Philebus with what is good. Timaeus seeks the origin of the visible cosmos out of abstract geometrical elements. Unfinished Critias treats of lost Atlantis. Unfinished also is Plato's last work of the twelve books of Laws (Socrates absent), a discussion of principles of law which Plato thought Greeks might accept. The Loeb Classical Library's Plato is in twelve volumes.",
  "genres": [
    "Philosophy",
    "Classics",
    "Nonfiction",
    "Ancient"
  ],
  "author": "Plato",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/1356.Lysis_Symposium_Gorgias"
}