{
  "title": "Comrade Fox: Low-living in Revolutionary Russia",
  "description": "“I never gave a monkeys for Marxism or Monarchism or Liberalism or Conservatism or Socialism or any ism. I’ve always been leery of anyone brandishing an ism – an excuse to howl at the moon if you ask me. And they’re all moralists too, always got it in for someone else, usually someone like me.” - Archibald Brinsley Fox.Brinsley Fox, adventurer, shirker, thief, cavalier poseur and all-round bad lot, was never the stuff of revolutionary heroes. But Lenin wasn’t to know that when he invited Fox along to the Russian Revolution...It is April 1917 when Fox breezes into Petrograd, during the Spring of Hope. He personally hopes to seduce Lenin’s former mistress – the bewitching Inessa Armand – and purloin a Fabergé Egg.Meanwhile the Russian economy has gone to hell in a handcart. The Great War is being lost hand over fist. The place is falling apart. Yet drink and be merry is the order of the optimistic day; ideal for a man who believes that fun and moral fibre are mutually exclusive.Alas, the mood of Russia darkens over the months, and Fox’s leisurely life unravels in parallel. Fleeing a brute he cuckolded, Fox charges pillar to post around Russia. From the Eastern Front – the most disastrous front in the history of warfare – into the fateful July Uprising. From a cabal of counter-revolutionaries to a botched break-in at the Catherine Palace. From a lynch mob in a Dark Age village to a bizarre, fledgling republic. From helping ‘Comrade Lenin’ with his ludicrous, little coup to fleeing across country pursued by rabid Red Guards. And on into the final death throes of hope...Along the way Fox has to face anarchic shoot-outs, violent Cossacks, dangerously desperate women, blithe fanatics, deadly disease, sinister river-gangs, hordes of rapists and even some sensible innocents, wondering where it will all end...This is a diary of horrors and heroics, written with verve and style, and scant regard for “the luxurious morals of the materially cosseted.”",
  "genres": [
    "Historical Fiction",
    "Russia"
  ],
  "author": "Stewart Hennessey",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/13560619-comrade-fox"
}