{
  "title": "Lost in Infinity",
  "description": "This book is not for everyone.'Lost in Infinity' is a novel that many readers will find hard to define. In fact, it's much easier to list what it is most definitely not, than what it really is. It's not necessarily a tale of suspense or a thriller. It's not a mystery by normal standards. It's not inspirational, romantic or full of laughs. Depending upon your perspective and final take on the tale, it's not even entirely fiction.This book is not for everyone. 'Lost in Infinity' is a novel intended for a very specific audience… The author would have you believe this is a \"psychological roller coaster wrapped in the factual memoir of a chronic insomniac suffering from apeirophobia (the fear of infinity).\" He would go on to explain that the \"novel unfolds the history of his life as he tries to unlock repressed memories through a near schizophrenic relationship with his own splintered subconscious.\" This is a clever ruse to suck in his niche reader. This book is not for everyone.Influenced by Chuck Palahniuk, Kurt Vonnegut and Carlton Mellick III, the novel offers a unique look into the private confessions of a self-absorbed blogger on the precipice of a mental breakdown. The recurring theme of déjà vu leads you through the work giving glimpses of a dark past while offering anecdotes that will eerily relate to most readers. Mixing in humor and satire with a confused childhood spent under the microscope of therapists keeps the mood light while he digs deeper into his past looking for the root of his problems. The narrator pulls back the curtain and reveals his dark inner turmoil as he fears a slow deliberate path toward schizophrenia. A repetition of events and recollections leads the reader through the twisted break the author fears while touching on life's everyday issues and questions. He delves into sleepless nights, stress, relationships and the pitfalls of higher education while he openly offers opinions on religion, suicide, insomnia, depression and the meaning of life.Many casual readers will be turned off by the jumping timeline. Some will be confused by the author's back and forth focus on his missing memories. The first person pseudo-oral narrative will leave others simply frustrated. The rest will grow sick of the author's defense mechanisms, most often hiding behind his pretentious recollections of growing up a childhood 'genius'. This book is not for everyone.Now that you've been properly warned and many have moved on to their next light read…'Lost in Infinity' is part social commentary, part psychological mystery and part diary. What begins as an egotistical journal from an overconfident, yet anti-social, bratty blogger slowly dissolves into the twisted chaos of a mind on the brink of collapse. The reader is eventually forced to decide if the book is a cry for help from a man attempting to rationalize his schizophrenia or a clever ruse to make them stop and contemplate the meaning of existence. 'Lost in Infinity' will leave the reader questioning everything they thought they knew about the author's sanity, about their own life, about existence and the infinite universe beyond.",
  "genres": [
    "Horror"
  ],
  "author": "Travis Besecker",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/13561541-lost-in-infinity"
}