{
  "title": "Les Contemplations",
  "description": "Hugo écrit Les Contemplations en 1856 alors qu'il vit un exil politique (thème qu'il abordera dans Les Châtiments). Il vit aussi depuis plusieurs années un exil intérieur qui hante Les Contemplations. Composées de deux parties distinctes, \"Autrefois\" et \"Aujourd'hui\", Les Contemplations est la première œuvre poétique maîtresse d'Hugo, plus de dix mille signes jetés à la face de la mer et du ciel sur l'île de Jersey. Marqué à tout jamais par la mort de sa fille Léopoldine, Hugo annonce dans sa préface qu'on ne peut réconcilier ces deux parties : \"un abîme les sépare, le tombeau\". Les plus beaux poèmes d'Hugo sur la force de la nature, la nostalgie de l'enfance et la fatalité de la mort se trouvent dans Les Contemplations. Ils sont indépassables. Dans cette œuvre en vers, Hugo joue d'une variété de rythme et de ton assez incroyable. Classique par moment, romantique, sage parfois, vénérant ses maîtres Gautier, Le Conte de L'Isle ou Banville, romantique déchaîné souvent comme dans \"Réponse à un acte d'accusation\" – poème que l'on peut considérer comme la profession de foi romantique d'Hugo – partout et tout le temps, Hugo réinvente l'acte de création poétique. Ce que dit \"La bouche d'ombre\", poème de huit cents vers, nous fait atteindre un degré supérieur dans l'ordre de la vision poétique. Le verbe d'Hugo se transforme en traité cosmogo-théologico-moral. \"Dieu dictait, j'écrivais\", constate logiquement Hugo à la fin du recueil. Aujourd'hui encore, après que Rimbaud, en lisant Les Contemplations, l'a considéré comme \"le premier des voyants\", que les surréalistes l'ont intronisé maître, Hugo continue d'impressionner par l'envergure de son génie protéiforme. --Denis Gombert",
  "genres": [
    "Poetry",
    "Classics",
    "France",
    "French Literature",
    "School",
    "19th Century",
    "Fiction"
  ],
  "author": "Victor Hugo",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/135617.Les_Contemplations"
}