{
  "title": "Fairy Tale Interrupted: A Memoir of Life, Love, and Loss",
  "description": "To everyone else, John F. Kennedy Jr. may have been American royalty, but to RoseMarie Terenzio he was an entitled nuisance—and she wasn’t afraid to let him know it. RoseMarie was his personal assistant, his publicist, and one of his closest confidantes during the last five years of his life. In this, her first memoir, she bravely recounts her own Fairy Tale Interrupted , describing the unlikely friendship between a blue-collar girl from the Bronx and John F. Kennedy Jr.Funny, moving, and fresh, her memoir is a unique account by the woman who was with him through dating, politics, the paparazzi, and his marriage to Carolyn Bessette. Her street smarts, paired with her loyalty, candor, and relentless work ethic, made her the trusted insider to America’s most famous man.After John and Carolyn’s tragic, untimely deaths on July 16, 1999, RoseMarie’s whole world came crashing down around her, along with her hopes for the future. Only now does she feel she can tell her story in a book that is at once a moving tribute and a very real picture of her friend and employer.Many books have sought to capture John F. Kennedy Jr.’s life. None has been as intimate or as honest as Fairy Tale Interrupted , a true portrait of the man behind the icon—patient, protective, surprisingly goofy, occasionally thoughtless and self-involved, yet capable of extraordinary generosity and kindness. She reveals what John really had in mind for his political future, how he handled media attention, and the reality of life behind the scenes at George magazine. She also shares how she dealt with the ultra-secretive planning of John and Carolyn’s wedding on Cumberland Island—and the heartbreak of their deaths.Fairy Tale Interrupted is a deeply loving story and a fascinating adventure, filled with warmth, humor, insight, and five years’ worth of unforgettable memories.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "Biography Memoir",
    "History",
    "Audiobook",
    "Autobiography"
  ],
  "author": "RoseMarie Terenzio",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/10415676-fairy-tale-interrupted"
}