{
  "title": "Parasouls ~ Divine Intervention",
  "description": "Born amongst humans, yet not quite human themselves, the parasouls fight to remain hidden. Using ancient tunnels and abandoned, buried basements as their homes, parasouls live in the underbelly of society; obscured from humans in a world they've created – a world where they don’t need to pretend they’re normal. Damian McNamara built and controls the society they’ve learned to thrive in. Angelique is the leader of a special team whose job is to keep the “normals” from knowing of the parasouls’ existence. Her gift is a curse, a constant reminder that she’s not normal, or human. Her fingertips come alive with electric blue flames, leaving her physically unable to touch another living soul without inflicting indescribable pain upon them. The Parasoul Acquisition Control Taskforce, a little known government entity, hunts them, collecting parasouls for their special abilities. Shane is the headhunter for the taskforce. Like Angelique, he’s never been able to touch anyone due to his gift of red and orange flames that singe the flesh of others. The moment Shane and Angelique meet, the heavens open and connect their souls forever. So what happens when Shane finds himself trapped between the only thing he’s ever desired and his job? Has he been left with no choice but to deliver the one person who owns his soul over to his boss, General Ritter, and the government’s taskforce? In a world where battle lines are obscured, how do you know which side is the good, the bad, or the dictators? Both sides are in for a rude awakening. Can love conquer all when you’re supposed to hate the one soul you can’t live without? How long can they fight the urge to give in to their connection? Can two parasouls on opposite sides find common ground and forge a future?",
  "genres": [
    "Romance",
    "Fantasy"
  ],
  "author": "Michele Richard",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/13562661-parasouls-divine-intervention"
}