{
  "title": "إضاءة تصوير تنقيح",
  "description": "ترجمة، تحقيق: سامح خلفكما في كل مرة يعود فيها سكوت كيلبي، المؤلف الأول عالمياً والأكثر رواجاً ضمن فئة كتب التصوير الفوتوغرافي. رئيس تحرير وناشر مجلة \"مستخدمي فوتوشوب\"، وناشر مجلة \"الإضاءة\". أعاد في هذا الكتاب اختراع كيفية تأليف كتب الإضاءة عبر الكشف. أخيراً، عن هذه العملية برمتها، من البداية إلى النهاية. سوف ترى كل شيء. بدءاً من التجهيز الكامل للإضاءة (وجميع المعدات المستخدمة)، إلى اللقطة (بما في ذلك جميع إعدادات الكاميرا وصفحة التدقيق التي تبين توالي مراحل اللقطة)، إلى الجزء المهم جداً الذي لا تجسر معظم الكتب على إدراجه؛ المعالجة اللاحقة والتنقيح في فوتوشوب.يشقّ هذا الكتاب أيضاً طريقاً جديداً في مضماره من خلال الطريقة البصرية التي يعتمدها في تعليمك كيفية إعداد الإضاءة. ليس هناك أي تخطيطات رسومية أو نماذج ثلاثية الأبعاد؛ بل سترى مخطط الإضاءة من خلال صورة واضحة تحتل صفحة كاملة، أخذت من الأعلى أثناء التصوير الحيّ، بحيث يمكنك أن ترى أين وضع كل شيء بالضبط (الموضوع، المصور، الإضاءة، الخلفية، وغير ذلك من العناصر). إضافة إلى ذلك، ستشاهد معاينات جانبية، ومن فوق الكتف. وغيرها من معاينات وراء الكواليس، وذلك لكي تتمكن من الإمساك بتقنية الإضاءة في كل مرة.ستتعلم من هذا الكتاب: ?\tالمخططات التفصيلية، خطوة فخطوة، التي تهدف إلى إنشاء تأثيرات الإضاءة المطلوبة والمرغوبة أكثر. ?\tكيف تستفيد من ضوء واحد أكثر مما ظننت أنك قد تستطيع. ?\tكيف تسيطر على الضوء وتُشكّله بأقل كلفة ممكنة. ?\tإعدادات الكاميرا، والمعدات، وقوة الطاقة الكهربائية لكلّ لقطة. ?\tتقنيات التنقيح التي يستعملها المحترفون بالفعل لإظهار مواضيعهم في أفضل صورة. ?\tكيفية تنقيح الشعر، والعيون، والشفاه، والجلد، والكثير من حيل التنقيح الصغيرة الأخرى ذات التأثير الكبير. ?\tكيفية إنشاء تأثيرات البورتريه عالية التباين من دون شراء برامج مساعدة باهظة الثمن. ?\tمجموعة كبيرة من حيل المهنة، الاختصارات الثمينة، والتأثيرات الخاصة المدهشة التي توفر لك مزايا حقيقية أمام منافسيك. إضافة إلى ذلك كله، ألحق سكوت فصلاً إضافياً خاصاً يبيّن لك فيه كيفية إنشاء تأثيرات الاستديو نفسها باستعمال فلاشات الكاميرا والمعدّلات المصنوعة لها، ليس هناك كتاب يضاهيه أبداً.",
  "genres": [
    "Photography",
    "Nonfiction",
    "Reference"
  ],
  "author": "Scott Kelby",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/13562790"
}