{
  "title": "Missing 411: Western United States and Canada",
  "description": "Missing-411 is the first comprehensive book about people who have disappeared in the wilds of North America. It’s understood that people routinely get lost, some want to disappear but this story is about the unusual. Nobody has ever studied the archives for similarities, traits and geographical clusters of missing people, until now.A tip from a national park ranger led to this three year, 7000+ hour investigative effort into understanding the stories behind people who have vanished. The book chronicles children, adults and the elderly who disappeared, sometimes in the presence of friends and relatives. As Search and Rescue personnel exhaust leads and places to search, relatives start to believe kidnappings and abductions have occurred. The belief by the relatives is not an isolated occurrence; it replicates itself time after time, case after case across North America.The research depicts 28 clusters of missing people across the continent, something that has never been exposed and was a shocking find to researchers. Topography does play a part into the age of the victims and certain clusters have specific age and sex consistency that is baffling. This is not a phenomenon that has been occurring in just the last few decades, clusters of missing people have been identified as far back as the 1800’s. The manuscript for the research was extremely large so the story was split between two books, Missing 411 Western United States and Canada and Missing 411 Eastern United States. The Eastern version will be released in late March and will include a list of all missing people in each edition and a concluding chapter that draws both books together for conclusions.Some of the issues that are discussed in each • The National Park Service attitude toward missing people• How specific factors in certain cases replicate themselves in different clusters• Exposing cases involving missing children that aren’t on any national database• Unusual behavior by bloodhounds/canines involved in the search process• How storms, berries, swamps, briar patches, boulder fields and victim disabilities play a role in the disappearance• The strategies of Search and Rescue personnel need to change under specific circumstances Major news organizations do a deplorable job of coveringstories and issues which are deemed too unusualor too far outside the box. Chances are, they will find a wayto trivialize or ignore the disturbing evidence accumulatedby David Paulides, a former lawman turned investigativejournalist. The paper trail uncovered by Paulides throughsheer doggedness is impressive, the evidence indisputable.People are vanishing without a trace from our nationalparks and forests, yet government agencies are saying nothing.At a minimum, this story deserves space on the frontpage of every newspaper in the country, and it warrants aformal high level inquiry by the federal agencies whose filesleave little doubt that something very strange is unfoldingin our wilderness.George Knapp, Host, Coast to Coast AMAfter reading this book, you will forever walk in the woods with a different awareness.",
  "genres": [
    "Nonfiction",
    "True Crime",
    "Mystery",
    "Paranormal",
    "History",
    "Crime",
    "Mystery Thriller"
  ],
  "author": "David Paulides",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/13563254-missing-411"
}