{
  "title": "Blood and Whiskey",
  "description": "Death is just the beginning.Enlightenment just took a strange detour. Welcome to LonePine, Wyoming, population 438. It's like any other small, slowly dying town in the American West. Only with more vampires.Blood and Whiskey is a story of love, loyalty, loss and sacrifice in the modern American West. With meditations on the nature of good and evil, a new cosmology for vampires -- including a shared meta-consciousness where vampire (and human) minds reside between deaths -- and a cast of gritty, quirky, realistic western characters, Blood and Whiskey tangles the vampire and cowboy myths into a groundbreaking new \"modern gothic western\" genre.In Book One of the series, The Cowboy and the Vampire: A Darkly Romantic Mystery, perpetually broke, down-on-his-luck cowboy, Tucker, falls hard for Lizzie, a whip smart, big city girl and hotshot reporter. She falls hard for him, too. Things get complicated when Lizzie finds out the awful truth about the undead heritage coursing through her veins. Tucker, with a little help from his Dad, his best friend and paranoid survivalist Lenny and his overly-sensitive cow dog Rex, take on Lizzie's maniacal vampire father and his beautiful consort Elita. It's a blood-spattered undead apocalypse of terror and tumbleweeds.In Book Two, Blood and Whiskey, the \"vamp-sanity\" and mayhem continue as Tucker, Lizzie and the rest of the gang tackle the afterlife, a cold-blooded killer from the old west and a war brewing between the vampire nations. Lizzie is pregnant, with a growing, unquenchable thirst for human blood. The most powerful vampires from the ruling clans are headed to LonePine to test her new powers and if they find her lacking, everyone in the tiny town will be destroyed.Dating the undead isn't Tucker's only problem. Lenny's niece has been snatched from the streets of Portland, Oregon and he turns to Tucker for help. It's an inconvenient time to take a road trip, but sometimes friendship trumps common sense. With a duffle bag of improvised weapons, he sets out for Portland with Lenny to find the kidnapped girl.They end up in remote Plush, Oregon, where -- smack dab in the middle of the sagebrush desert -- they uncover a human blood farm run by a fearsome cowboy enemy resurrected from the Old West. His name is Henry Plummer and his sights are set on Lizzie.As the truth about what they have uncovered dawns on Tucker and Lenny, they rush back to LonePine. The Vampire illuminati have already arrived, including Rurik, a handsome Russian vampire angling to take Tucker's place next to Lizzie.How far will Lizzie and Tucker go to protect their unlikely love? Can a cowboy and a vampire ever hope to find happiness? Is death really the ultimate high? Find out in Blood and Whiskey.",
  "genres": [
    "Paranormal",
    "Vampires",
    "Fantasy",
    "Romance",
    "Horror",
    "Thriller",
    "Urban Fantasy"
  ],
  "author": "Clark Hays",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/13563405-blood-and-whiskey"
}