{
  "title": "The Rise of Kyro",
  "description": "Tommy is back. Now, he just needs to figure out what it means to be a werewolf while keeping it a secret from young Josiah, his enthusiastic fight prodigy with a superhero complex. Calling himself Kyro to cloak his true identity as an MMA fighter, Tommy walks into a special kind of bar, and a whole different world opens to him, and with it, a complicated new path that threatens what he loves most: his professional fighting career, and Maya, his true love. Soon, Tommy meets new Carni friends who help him along the way, but finds out that some are friends and some are just out to get him. The werewolf society has rules he doesn’t even understand yet, and Tommy needs to figure out who has his best interests at heart and who just wants to manipulate him for their own evil agendas. Ordinarily, a fight or two would take care of any dangerous situations, but Tommy’s greatest challenges rise to the surface as he realizes that it’s going to take more than brawn and MMA fighting skills to stay alive. When danger threatens all that he holds dear, he learns to keep his friends close and his enemies closer.One thing’s for sure: Maya will never use Tommy. Tommy and Maya's love reaches new heights as they struggle with the sacrifices and reap the gifts that are the foundations of a serious relationship. Maya asserts her own power in the relationship and even proves that she is as smart as she is beautiful, as she accepts that the man she loves is a werewolf, but she is not. Will Tommy's rise to alpha werewolf status among his own kind be an asset? Or will drive a wedge between him and everyone he loves?**Acclaim for the novels of H.T. Night**“H.T. Night is a riveting storyteller, capturing the essence of the vampire genre.” —April M. Reign, author of I.O.U. and Dividing Destiny“The Werewolf Whisperer is a wonderful story that incorporates friendship and love with a lot of great vampire action.”—Summer Lee, author of Angel Heart “A hip and timely vampire novel filled with real characters and some of the coolest vampires since The Lost Boys! You're going to love Night's completely original take on the supernatural.”—J.R. Rain, author of Moon Dance and The Body Departed “Bad Blood is fast, hilarious and sexy. Rain, Nicholson and Night just might have created the coolest vampire since Kiefer Sutherland. The Mount Shasta setting is dreamy. The cult is deliciously creepy. And Spider is as sexy as they come. I was pressing the ereader's 'forward' button so fast that I broke it. Let's hope we hear more from Spider.\"—H.P. Mallory, bestselling author of Fire Burn and Cauldron Bubble and To Kill A Warlock",
  "genres": [
    "Paranormal",
    "Romance",
    "Paranormal Romance",
    "Vampires",
    "Fantasy"
  ],
  "author": "H.T. Night",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/13564392-the-rise-of-kyro"
}