{
  "title": "FISH TANK:  A Fable for Our Times",
  "description": "FISH TANK:A FABLE FOR OUR TIMES—book #1 of The Critter Chronicles series—is an insightful allegory about the human condition, tackling issues of politics and power, limited resources and climate change. The book provides a thoughtful story about how society makes decisions, in particular those decisions that impact the environment and others around us. FISH TANK is a small book based on a large premise—that story has the power to change the world. FISH TANK was a category (first novel) finalist in the Next Generation Indie Awards! FISH TANK is also available as an AI-generated audiobook on Google Play!A FISH TANK Discussion Guide for Book Clubs and Classrooms is available. See the author's website for free download.--- REVIEWS ---FISH TANK is the ANIMAL FARM for our times. The two books would make a great pair to teach together.- Dr. Pete Coppolillo, Ecologist and Executive Director of Working Dogs for ConservationIn FISH TANK, the author represents planet Earth as a fish tank, and humanity as a bunch of talking fish of different species, interests and motivations engulfed in a very peculiar situation. What results is a clever and fascinating fable that provides an insightful mirror on the folly of current human attitudes concerning climate change and global degradation. Some people like graphs and data, the IPCC reports are written for them. But others connect better with concepts, imagery and storytelling, and for them FISH TANK should be compelling. It's hard not to contemplate if the human species is reaching some similar decision points, and a happy face outcome is not guaranteed.- Dr. Steven W. Running, Nobel Laureate as a member of the Intergovernmental Panel on Climate Change, Department of Ecosystem and Conservation Sciences, University of MontanaFables have been part of human history since we began sharing stories around a campfire. The modern world, with instant communication and based on facts, offers little room for creative storytelling, especially ones that have a moral or lesson attached to them. FISH TANK is a throwback to the times of Aesop with a very modern and imminently relevant message. Children and adults alike will understand the predicament of the denizens of the aquarium and the parallel to humanity as we power ourselves into the 21st century. Take it as a great story, but know that it is real. If FISH TANK gets 10 people to adjust their life style it will have made a difference.- Conrad Anker, elite mountaineer and author of THE LOST EXPLORER: FINDING MALLORY ON MOUNT EVERESTI think FISH TANK could benefit young adults in the same way LORD OF THE FLIES benefitted previous generations, helping them understand that bad things can happen when self interested people are not kept in check. It might also help some adults see our current situation with greater clarity.- Peter Cook, High School Teacher, Melbourne AustraliaThis story of life in the aquarium is eerily similar to contemporary events outside the tank. FISH TANK is a good read, but more than that, it is a story about the forces of greed against the power of determination and collaboration.- Dr. Cathy Whitlock, Director of the Montana Institute on Ecosystems, Montana State UniversityAlthough found in the fiction section, FISH TANK is truly a non-fiction story of our times with the [xxx] playing the part of the one percent. We can't be as foolish or complacent as the fishes. We can't be in denial like the fishes. Just as the \"Occupy\" movement has shouted its intolerance for corporate greed and corruption, it's time we do the same when it comes to climate. We need a revelation. FISH TANK forces you to realize just that.- Kelly Matheson, Program Manager, WITNESS, NYCFISH TANK is so much more than a fable. It is a call to action to everyone who loves life and feels compassion in their hearts. It is a call to action to the privileged and powerful to act on the good within.... It is a call to action to the experts and our climate leaders to tell it straight and spread the solutions far and wide. It is a call to action to everyone, not to bury our heads in the sand and ignore what is right in front of our eyes while hoping for that Hollywood ending. ... Scott Bischke opens floodgates of feeling for humanity and other species in this important book.- Julia Olson, mother and Executive Director, Our Children's Trust",
  "genres": [
    "Fiction"
  ],
  "author": "Scott Bischke",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/13565322-fish-tank"
}