{
  "title": "Gifted",
  "description": "Rumi Vasi is 10 years, 2 months, 13 days, 2 hours, 42 minutes, and 6 seconds old. She’s figured that the likelihood of her walking home from school with the boy she likes, John Kemble, is 0.2142, a probability severely reduced by the lacy dress and thick woolen tights her father, and Indian émigré, forces her to wear. Rumi is a gifted child, and her father, Mahesh, believes that strict discipline is the key to nurturing her genius if the family has any hope of making its mark on its adoptive country. Four years later, a teenage Rumi is at the center of an intense campaign by her parents to make her the youngest student ever to attend Oxford University, an effort that requires an unrelenting routine of study. Yet Rumi is growing up like any other normal teen: her mind often drifts to potent distractions . . . from music to love.Rumi’s parents want nothing other than to give Rumi an exceptional life. As her father outlines ever more regimented study schedules, her mother longs for India and forcefully reminds Rumi of her roots. In the end, the intense expectations of a family with everything to prove will be a combustible ingredient as an intelligent but naive girl is thrust into the adult world before she has time to grow up.In her stunningly eloquent debut novel, Nikita Lalwani pits a parent’s dream against a child’s. Deftly pondering the complexities and consequences that accompany the best intentions, Gifted explores just how far one person will push another, and how much can be endured, in the name of love.Advance praise for Gifted“A triumph . . . fluid, original, clever, glitteringly vivid, funny . . . All the conventional pieties and forms of Indian immigrant identity and trauma are so wittily preempted, and yet there’s a sure grasp, at the serious core of the novel, of the deep reverberations of politics and history. I couldn’t bear it when it ended.” –Tessa Hadley, author of The Master Bedroom“This is an outstanding piece of writing–rich, vivid, fluent, and well paced–with a wonderful cast of well-developed, engaging characters and a constantly surprising story line.”–Gerard Woodward, author of A Curious Earth",
  "genres": [
    "Fiction",
    "India",
    "Young Adult",
    "Contemporary",
    "Indian Literature",
    "Literary Fiction",
    "Book Club"
  ],
  "author": "Nikita  Lalwani",
  "average_rating": "3.24",
  "url": "https://www.goodreads.com/book/show/1356559.Gifted"
}