{
  "title": "The Way You Break",
  "description": "There are some that want to exploit my powers. There are some that want me dead. Then there is one that just wants me.A shadow world exists. One where gods that aren’t quite gods walk amongst us. One I didn’t know about when I woke up by a cold mountain river…soaked…freezing. With pain cracking my skull in two and no memory of who I was or what I was doing there. My only clue is the one man—one hulking, unearthly gorgeous man—sitting on a rock across from me with a scowl on his face and hatred simmering in his blue eyes. Aiden. A man I’m going to have to depend on if I don’t want to freeze to death.Begrudgingly, Aiden takes me to his friend’s ranch where I can stay until I get my memory back. On the secluded mountain, mystery soon engulfs me—my new friends, Aiden included, are clearly holding back a host of secrets from me. Secrets that will make or break me. Then a tragic accident occurs and I find out I can miraculously flip back time. That I belong to a shadow world of brutal people with god-like powers that keep the world in balance—people like Aiden and my new friends.With my new power, a target has been put on my back—both Aiden’s people and their heinous counterparts are determined to have my power, and they’ll do anything to get it. So Aiden has to train me—train me fast to defend myself or my new life will be over before it starts. Which is hard when we’ve been fiercely denying the fiery attraction between us. He’s desperate to protect me, and I’m desperate to remember exactly who and what I am, for if I don’t remember in time, the fate of the whole world will be in jeopardy. Scroll up and click ‘buy now’ to start this epic fated mates fantasy romance today!\nThe Way You Break\n is a reimaging mashup of mythology and demigods in a fantasy romance with forbidden love, multiple POV, myths and legends, fated mates, amazing powers, morally-grey choices, twists, cliffhangers, spice, a kick-butt heroine and a tear-the-world-down-for-her hero. Plus, let’s not forget the delicious, sexy angst.It contains mature language, graphic violence, and explicit content. This is book one of the Creatures of Scales and Savagery series and ends in a cliffhanger. Please read at your own discretion.",
  "genres": [
    "Fantasy",
    "Romance",
    "Fantasy Romance"
  ],
  "author": "K.J. Jackson",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/135680133-the-way-you-break"
}