{
  "title": "Alani Was Here",
  "description": "When Alani is taken from her family she must confront her worst fear. How will she endure the nightmare that is thrust upon her?Alani squinted through the huge double doors down the dimly lit hallway. The linoleum covered floor was streaked with grime. It lifted in places to reveal rotting floorboards.\tA window in the wall of the hallway appeared, its opening secured by metal bars. Not a word was spoken as the fat lady sitting behind the bars took the file from the officer and quickly skimmed it. Grunting she grabbed a ring of keys off the wall beside her and a bundle of drab material of a shelf as she stood up. She re-appeared in a doorway that Alani hadn’t noticed and led them down the dim hallway, unlocking and relocking barred doorways as she went deeper into the belly of the building.\t“In here,” the fat lady indicated with a jerk of her head as she stopped in front of a doorway. “This is the girls’ dormitory C, only one with a spare bed.”\tStill adjusting to the dim light, Alani’s eyes slowly took in the bare features of the room. Sunlight was trying to penetrate the dirty glass to lighten the large room, slashing its beams onto the floor as it zigzagged between the metal bars covering the windows. Through the floating dust particles she could make out the shapes of beds, many beds, lined up with their metal headboards along each wall. Every inch of space was taken up by a bed or a small wardrobe in between each bed. One small scraggly rug next to each bed was the only protection from the cool linoleum floor.Praise for Alani Was ~ Alani Was Here is very moving and very timely, due mostly to its dramatically conceived and managed plot.~ Alani Was Here is moving and troubling material.~ In all, this is a well-written account of tormented lives and the value of perseverance and rising above negative situations.~ Not a vampire to be seen in this YA novella by Australian author Kristy Taylor. The author casts light on the darker side of the human experience, conveying the experiences of abandoned and abused children with great force and empathy. The author probes some of society's worst abuses, those perpetrated on the innocent and helpless.",
  "genres": [],
  "author": "Kristy Taylor",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/13566077-alani-was-here"
}