{
  "title": "Queen of Abaddon",
  "description": "Raven shoved herself to her feet, pulling from willpower she didn’t know she had, to scramble to the railing that overlooked the remainder of the library seven floors below. Drake of Tanith stood at the base of the stairs, looking up. The gray marble flooring at his feet appeared to have been scorched; a black scar of searing evidence radiated out from his boots in a star pattern. The smell of smoke filled the air. An angry magic-formed wind ripped through his hair and tore through his cloak, and yet he remained unmoving, a statue of absolutely beautiful darkness, with glowing eyes. Those eyes imprisoned hers. Time stopped. In that new stillness, he held her fast and slowly began to climb the stairs, a predator stalking skittish prey. The rest of the world fell away, and they were alone. “Raven,” he said. His voice was that of the king of Abaddon now, and echoed with the power of his title. It was the embodiment of promise and need, that duo that tore down a strong person’s last defenses to lay them out for the slaughter. His glowing eyes flashed, his gaze intensifying as stark shadows claimed his face and his look became hungry. “I know you think you have to run from me.” Another step, smooth and slow. “You believe there to be no other way.” 'There isn’t,' she thought. 'I have to… I have to do… something.' “But some things were meant to be.” She could almost feel him upon her, his heat, his strength. She could smell the leather of his armor, and the scent of smoke was stronger now. And something else – magic. It was the aroma of dark magic, like black diamonds crushed into wine. So close. There was the faintest hint of a smile curling the corners of his sensuous lips. “You can’t change fate.” He shook his head, just once. “And fate decided on us long, long ago.”",
  "genres": [
    "Romance",
    "Paranormal",
    "Fantasy",
    "Paranormal Romance",
    "Demons",
    "Fae"
  ],
  "author": "Heather Killough-Walden",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/13568558-queen-of-abaddon"
}