{
  "title": "Davey the Detective",
  "description": "Smart Books for Smart Kids (Loving Birds Helps Too) - For Kids 3-8 Years Old~~~Davey dubs himself the luckiest crow in the entire world when he finds a wonderful, shiny object. It even has a fantastic name: “paperclip.” Wow!One dark and dreary day, Davey’s treasure goes missing, and he is beside himself with grief. Luckily, he knows just how he can find out which of the forest animals is to blame for the theft. Inspired by the torn pages of a Sherlock Holmes story that were used to fashion his nest, Davey calls on the help of Sarah the sparrow to investigate the mystery and, hopefully, retrieve his prize.Together the two birds begin to collect clues. Their trail leads them straight to Mr. Bushtail, a greedy squirrel who keeps a giant store of objects in a hollowed-out tree trunk. When Mr. Bushtail refuses to cooperate, the two birds have no choice but to break into his tree house in search of the truth.Justice will prevail and treasure will be found in this intriguing tale of mystery.~~~[Children’s Picture Books, Birds, Animals, Values, Friendship, Imagination, Adventure]~~~\"Explaining good vs. evil, truth vs. lying and why humans do the things we do to a child can be a little challenging. Thank goddness there are some excellent writers out there like Emlyn Chand who can explain with grace and beauty the huge concepts and meta-narratives of life through kid lit. This answers only one simply question about kids books, and that's why we read them at all. If you're an adult and have kids, you might do it to make them fall asleep at bed or nap-time, but you may also do it because the book helps explain something your child is currently struggling with. Whether it's sheer entertainment, or for a bigger reason, Davey the Detective should be in your library.\" ~ Naimeless Author~~~\"DAVEY THE DETECTIVE\" by Emlyn Chand (Illustrated by Sarah Shaw)~~~Evolved Publishing presents the second of the charming and colorful Bird Brain Books series. This children's picture book features full-color illustrations by artist Sarah Shaw. [DRM-Free]~~~DISCOVER THE FULL \"BIRD BRAIN BOOKS\" SERIES:Honey The HeroDavey the DetectivePoppy the ProudTommy Goes Trick-or-TreatingVicky Finds a ValentineIzzy the InventorRicky the RuntLarry the LonelySammy Steals the ShowPolly Wants to be a PirateRuby to the Rescue~~~WHAT OTHERS ARE SAYING ABOUT THE \"BIRD BRAIN BOOKS\":Poppy the Proud: \"Poppy the Proud has so many great lessons in it - including teaching children that everyone is special and beautiful in their own way. The writing is perfect for the younger age set, and the beautiful illustrations by Sarah Shaw will help keep your little one engaged. My 5 year old loved it and reading Poppy brought about a conversation about bragging, friendship, and being special.\" ~ Karen TozCourtney Saves Christmas: \"This book is so stinkin' cute. My kiddos loved it. The illustrations [by Noelle Giffin] are fun and really captivated my 4 and 5 year old. I love that Courtney's adventure began because she wanted to say, \"thank you.\" What a great message to send during the holidays. I have a feeling this book will be read long after Christmas has come and gone.\" ~ Delphina “Delphina Reads Too Much”Vicky Finds a Valentine: “This children's book is so cute and really let's young children know what being friends is all about. The illustrations, done once again by Noelle Giffin, lend a nice touch to a great book. This book is for the younger set up to about 9 years old. I highly recommend this book to be in any child's library. Both thumbs up!” ~ Naila Moon",
  "genres": [
    "Childrens",
    "Fiction",
    "Animals"
  ],
  "author": "Emlyn Chand",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/13568455-davey-the-detective"
}