{
  "title": "The Bearens' Hope",
  "description": "Those who are destined for love must still struggle to win it.The Bearens’ Hope is an extra full-length, 159,700 word, novel and is the fourth book in “The Soul-Linked Saga”. Beautiful artist Hope Strigeda, whose genetic legacy makes her precious both to the people of planet Jasan and the part reptilian, part human Brethren, is kidnapped by the Brethren and imprisoned in a remote desert compound. Sent to Earth to investigate the mysterious disappearance of other women like Hope, the Jasani Bearen brothers—shape shifters who transform into gigantic bears--discover that Hope is their Arima, their destined, eternal soul-mate. The Bearens team up with psychic Agent Ellicia Daniels to rescue Hope and the other missing women. When Hope and two other imprisoned women escape into the trackless desert that surrounds their prison, Ellicia and the Bearens must race to find her before she can be recaptured by the Brethren and transported off world by the enigmatic Xanti, aliens whose ultimate goal is nothing short of the destruction of Earth and Jasan. Hope and Ellicia must both call upon their psychic gifts and their human courage to save, not only Hope, but Ellicia’s babies who may themselves be a prophesied treasure of the Jasani race. Even if the Bearens and Hope can be brought together, and even given the volcanic sexual attraction they feel for each other, can these destined lovers overcome the light years of differences of biology and custom that separate their two planets, and their mutual resistance to compromising some of their most basic beliefs, to join in an endless love that reaches across The Thousand Worlds?The Bearens’ Hope is full of everything that has brought thousands of readers to the novels of Laura Jo Phillips: heart-stirring emotion and romance, thrilling adventure, tangled webs of intrigue, and incandescent passion. This book is not only a satisfying continuation of “The Soul-Linked Saga” for current fans, but also an addictive entre to the series for new readers.",
  "genres": [
    "Science Fiction",
    "Paranormal",
    "Aliens",
    "Reverse Harem",
    "Shapeshifters",
    "Romance",
    "Fantasy"
  ],
  "author": "Laura Jo Phillips",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/13569400-the-bearens-hope"
}