{
  "title": "Of Honest Fame",
  "description": "On a summer night in 1812, a boy sets fire to a house in Paris before escaping over the rooftops. Carrying vital intelligence about Napoleon’s Russian campaign, he heads for England. But landing in Kent, he is beaten almost to death. The Foreign Secretary, Lord Castlereagh, is desperate for the boy’s information. He is even more desperate, however, to track down the boy’s assailant – a sadistic French agent who knows far too much about Castlereagh’s intelligence network. Captain George Shuster is a veteran of the Peninsula, an aide-de-camp to Wellington, now recalled from the continent and struggling to adjust to civilian life. Thomas Jesuadon is a dissolute, living on the fringes of society, but with an unrivalled knowledge of the seamy underside of the capital. Setting out to trace the boy’s attacker, they journey from the slums of London to the Scottish coast, following a trail of havoc, betrayal, official incompetence and murder. It takes an unlikely encounter with a frightened young woman to give them the breakthrough that will turn the hunter into the hunted.Meanwhile, the boy travels the breadth of Europe in the wake of the Grande Armée, witnessing at first hand the ruination they leave behind and the awful price of Napoleon’s ambition. This companion to M.M. Bennetts’s brilliant debut, May 1812, is a gripping account of deception, daring and determination, of intelligence and guile pitted against brutality. Bennetts brings to vivid life the harrowing devastation wrought on the civilian populations of Europe by Napoleon’s men, and the grit, courage and tenacity of those who stood against them.\"This book left me screaming for a sequel.\" - A Moment with Mystee\"I found myself lost in story full of page turning intrigue.... This is a thinking person's book.\" - Broken Teepee\"One of those 'can't put down' books.... Please MM Bennetts give us another\" - The Romantic Type\"The author paints a vivid picture of our mind of the slums of Paris and London, the battle ravaged landscape of Europe and the brutality of espionage and counter espionage.... The author raises our heartbeat, bringing us to an exciting and surprising climax\" - Sherri's Jubilee",
  "genres": [
    "Historical Fiction",
    "France",
    "Historical",
    "19th Century",
    "Fiction"
  ],
  "author": "M.M. Bennetts",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/13569850-of-honest-fame"
}