{
  "title": "Loving the Enemy",
  "description": "Miach Coleman can’t believe the turn his life has taken. He’d worked hard to take control of his life after being shoved into foster care when his mother died. The minute he’d turned eighteen, he’d joined the military. Learning that shape-shifters are real and what a threat they could be to humanity, he moved to the private sector, working for the Crystal Lake Corporation. He allowed the scientists to use their research to increase his agility, strength, and healing so he could combat these creatures. Now, having spent three weeks under shifter’s care, he’s begun to question everything he’s learned about them. They treat him far better than the scientists treat shifters. No experiments. No neglect. No torture.It took Nick Greely three long, sexually frustrated weeks, and a heart-to-heart with his alpha, to finally admit that Miach could be his mate. But there’s a reason Miach is their prisoner. He’s been brainwashed by the scientists to think that all shifters are abominations. Between the experiments done on him in the name of science and the fact that the wolf pack has had to keep him prisoner for so long because he’s a threat to their pack, Nick has no idea if he can reach the man, mating pull or not.Miach is amazed at the camaraderie he sees between the wolf shifters, proving that they’re not just instinct driven killing machines. And Miach can’t deny the attraction he feels for Nick, one of his sexy guards. When Nick hits on him, he takes what the wolf offers, changing his life in a single night. But Miach quickly discovers there’s no happily-ever-after written in his stars. If he wants to keep Nick, Miach will need to keep him safe from another shifter who wants him dead, get away from a fellow mercenary trying to rescue him, and prove to the wolf alpha he’s sincere, all while keeping his integrity intact.",
  "genres": [
    "M M Romance",
    "Shapeshifters",
    "Paranormal",
    "Romance",
    "M M Paranormal",
    "Fantasy",
    "Gay"
  ],
  "author": "Charlie Richards",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/13571980-loving-the-enemy"
}