{
  "title": "See",
  "description": "This edition is no longer available.Forgetting who you are, your ambitions, your passions is crippling….but remembering – embracing your purpose with a new sense of determination is more than empowering….it's life altering. Charlie Myers is on a life altering path that will cause the dammed to humble in silence.One night…just a few friends, how could it go so wrong? That was the question seventeen year old Charlie Myers was asking when she found herself in the ER. Outwardly nothing was wrong with Charlie, she was a vision of perfect heath, internally she was battling a raging headache…one the doctor told her she would overcome shortly, but Charlie knew something else was wrong …very wrong.Part of her had been stolen…she was missing memories. Those memories were sacred. They held the key to her sanity. They told her that the sinister whispers, the shadows that came to life before her were not as ominous as she felt they were. They held the bond with her late father, a famed musician. They caused her to forget the one talent that allowed her to face the darkness that haunted her every waking hour. They also masked a much deeper bond, the face of the one that had stolen her heart, long before the age of seventeen.Sitting in the ER with her angry mother she couldn’t figure out what she was missing, or even how. Her thoughts told her that she needed to protect Britain, a friend of hers, but that didn’t make any sense – Britain didn’t need to be protected from anyone, he was strong, young, and absurdly wealthy. Charlie also knew that even though her friend Bianca called Charlie her best friend, she didn’t trust her …she was almost sure she despised her, but she couldn’t figure out why, or understand how random thoughts were telling her that she adored both Britain and Bianca – that they were her saviors – that they brought silence to the unstoppable whispers, but the silence scared Charlie. In her mind anyone or anything that could bring silence to something that dark could not be good.Charlie wanted to stay in NY, figure out what she was missing, why, and who was behind it all, but her mother had other plans. Against her will, Charlie was sent to Salem to live with her sister, within that small town Charlie found her memories and so much more.Her story begins now.Ibsn: 9781301864768Word count: 104k",
  "genres": [
    "Fantasy",
    "Paranormal",
    "Young Adult",
    "Romance",
    "Paranormal Romance",
    "Amazon",
    "Fiction"
  ],
  "author": "Jamie Magee",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/13572053-see"
}