{
  "title": "Transfer Student",
  "description": "“A page-turner of a Young Adult Science Fiction love story”- The San Francisco Book ReviewStar Rating: 4.5 out of 5  A spell-binding intergalactic tale of beauty & the geek.  Two Worlds––Two Teens––One Wish  Rhoe and Ashley would never be friends. Even if they lived on the same planet. But, they’ll become so much more. They’ll transfer.  Earthling Ashley’s world revolves around winning daily popularity contests at Beverly Hills High School and surfing competitions with sweet scholarship prizes that will finally help her break free of her control-freak mother. Meanwhile on planet Retha, Rhoe misses his dad, loves his mom’s home-cooked Glechy crag with a side of ory sauce, is desperate to heal his sick brother and wants more than anything to win The Retha New Invention Competition. But Rhoe‘s invention teleports him across the universe with an unintended side effect, Ashley and Rhoe transfer. They swap lives when they make the same wish at the same time.  Popular-surfer-turned-boy-geek alien Ashley must handle life on Retha as Rhoe complete with webbed feet, low-gravity, and an obsession with Yuke, all the while being hunted by Rethan spies and resenting her hairy, flat chest. Boy-geek-turned-popular-surfer Rhoe must fit in at Beverly Hills High School as Ashley, compete in The Laguna Beach Invitational without becoming shark food, dodge boys’ affections, cool his preoccupation with Tiffany and his new body, and find the healing rocks he believes will save his brother’s life. If only it were that simple. Some wishes can't come true. Some have to.  THIS ENHANCED EBOOK CONTAINS LINKS TO THE MUSIC, STORIES, PHOTOS & VIDEOS THAT INSPIRED THE STORY.  “SPELL-BINDING JOURNEY” “a compelling sci-fi adventure that also reflects the lifestyle and dilemmas faced by today’s teens, and the world as a whole.” - KID’S BOOK CAPERS  “An interesting intergalactic tale of identity and corporeal switching reminiscent of the moviesFreaky Friday and The Hot Chick.” “surprising sub-plots” “fun and enjoyable book and i highly recommend it”- A.O. BILBLIOSPHERE ”Excellent”",
  "genres": [
    "Aliens",
    "Science Fiction",
    "Young Adult",
    "Romance"
  ],
  "author": "Laura A.H. Elliott",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/13572145-transfer-student"
}