{
  "title": "Jack of Hearts",
  "description": "Jack of Hearts is a novel of literary fiction told from the point of view of a small, aristocratic dog named Shimoni. This imaginative first novel explores themes of fidelity and honor and offers a fresh perspective of Italian culture and amore.Shimoni's passion for Italian cuisine and Elvis are rivaled only by his devotion to his masters, a Roman Count and Countess. However, his discovery that Il Conte is having an affair imperils his comfortable life and plunges Shimoni into a quest to rekindle his masters' love and preserve his home.The path to reconciliation leads Shimoni from the bustling streets of Rome to his owners' rustic villa in the Italian countryside, where he outwits man and beast to save his family, all while making time to fall in love and sample the local Chianti. Shimoni's (mis)adventures yield poignant observations about the nature of love and longing, and the soul's ability to find satisfaction.An intoxicating blend of adventure, romance, and joi de vivre, Jack of Hearts will appeal to literary devotees, Italophiles and dog-lovers. Author, Robin F. Gainey dishes up a sensuous story with plenty of heart, and empathy for the human, as well as the canine condition.“A wonderful, funny and touching novel. Shimoni is not simply a dog, he is our guide; he is our friend. Stay by his side, stay with his heart, and he will take you places you haven’t been, and show you things you haven’t after reading Jack Of Hearts you will understand the true depths of love and devotion. –Garth Stein, The Art Of Racing In The Rain“This novel has freshness, originality and a huge heart of gold. Shimoni is one of the most unforgettable narrators I’ve ever read, and does he have a story to tell! I loved everything about this book.” –Susan Wiggs, NY Times Best-Selling Romance Novelist, Just Breathe“This is a most heartfelt and extraordinary work for a first novel. Ms. Gainey moves easily out of the realities of our everyday lives into an unexpected turn of canine spirit. It is an intriguing and wonderful read.” –Lynn Andrews, NY Times Best-Selling Author of Medicine Woman",
  "genres": [],
  "author": "Robin F. Gainey",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/13572428-jack-of-hearts"
}