{
  "title": "The Khan Series: Genghis: Birth of an Empire / Genghis: Bones of the Hills / Genghis: Lords of the Bow / Khan: Empire of Silver / Conqueror",
  "description": "From the co-author of The Dangerous Book for Boys, the Khan series is a triumph of historical fiction—a bold, epic account bursting with gritty realism and exhilarating action. Now this eBook bundle assembles the entire series—Birth of an Empire, Lords of the Bow, Bones of the Hills, Empire of Silver, and Conqueror—sparing no detail, from the Great Khan’s first conquest and the heights of his unprecedented empire, to his brutal ancestral legacy and the rise of Kublai Khan.GENGHIS: BIRTH OF AN EMPIREGenghis Khan was born Temujin, the son of a khan, raised in a clan of hunters and driven by a singular fury: to survive in the face of death, to kill before being killed. Through a series of courageous raids, Temujin’s legend grew until he was chasing a vision: to unite many tribes into one, to make the earth tremble under the hoofbeats of a thousand warhorses, to subject all nations and empires to his will.GENGHIS: LORDS OF THE BOWFor centuries, primitive tribes have warred with one another. Now, under Genghis Khan, they have united as one nation to face the ultimate test: the great, slumbering walled empire of the Chin. In Yenking—modern-day Beijing—the Chin will make their final stand. But Genghis will strike with breathtaking audacity, never ceasing until the emperor himself is forced to kneel.GENGHIS: BONES OF THE HILLSAs Genghis enters a strange new land of towering mountains and arid desert, he stirs an enemy greater than any he has met before. Shah Ala-ud-Din Mohammed has under his command thousands of fierce Arab warriors, teeming cavalry, and terrifying armored elephants. But another battle is taking shape—between two of Genghis’s feuding sons. Soon the most powerful man in the world must choose a successor, touching off the most bitter conflict of all.KHAN: EMPIRE OF SILVERThe Great Khan is dead—and his vast empire, forged through raw courage, tactical brilliance, and indomitable force, hangs in the balance. Even as the sons of Genghis Khan maneuver for supremacy, the Khan’s armies extend his reach farther than ever before, into southern China and across the rugged mountains of Russia to the vulnerable heart of Europe, where the most courageous warriors the West commands await the coming onslaught.CONQUERORA succession of ruthless leaders have seized power in the wake of the Great Khan’s death—all descendants of Genghis, but none with his indomitable character. It is Kublai—refined and scholarly, always considered too thoughtful to take power—who will devise new ways of warfare and conquest as he builds the dream city of Xanadu. His gifts will serve him well when an epic civil war breaks out among brothers, the outcome of which will literally change the world.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Asia",
    "Collections",
    "Fantasy",
    "Novels"
  ],
  "author": "Conn Iggulden",
  "average_rating": "4.71",
  "url": "https://www.goodreads.com/book/show/13573316-the-khan-series"
}