{
  "title": "ستانلي كوبريك: سيرة حياته وأعماله",
  "description": "في 25 شباط 1996 وجه (جيم كولمان) من (باريفيل) في بينسلفينيا خطاباً إلى (والتر سكوت) الذي يعمل في مجلة (باراد) وبالتحديد إلى كاتب زاوية استعراض الشخصيات حيث أشار في خطابه إلى أن ستانلي كوبريك الذي ذاع صيته عالمياً كمخرج لأفلام \"دروب المجد\" و\"الدكتور سترينجلاف\" و\"2001: أوديسا الفضاء\" و\"البرتقالة الآلية\"، قد توقف عن صناعة الأفلام منذ أن أخرج فيلمه المعروف بـ\"طلقة بغلاف معدني\" عام 1987. كما أشار السيد (كولمان) في رسالته إلى أن الكثيرين في كافة أنحاء العالم ممن نظروا إلى هذا المخرج على أنه المسيح السينمائي المنتظر كانوا متلهفين للحصول على فرصة أخرى لمشاهدة فيلم جديد من إخراج ستانلي كوبريك. فكتب (كولمان) في رسالته مستفسراً ماذا حل بأعظم مخرج سينمائي أنجبته هذه البلاد؟ رد (سكوت) على هذا السؤال بحذاقة وعرض مباشرة آخر المشاريع التي لم تنجز بعد معبراً عن أمله في أن يبدأ كوبريك في فصل الصيف القادم بتصوير مشروع جديد كما أعلنت عن ذلك شركة (وارنر برذرز)، إلا أن سؤال (كولمان) تضمن معان أعمق من ذلك بكثير.اشتهر ستانلي كوبريك بانعزاله وانطوائه عن العالم مثل (غريتا غاربو) و(هاورد هيوز) و(ج.د. سالينغر) و(توماس بينشون). فالسمعة السيئة التي شابت السرية التي انطوت عليها أعمال كوبريك المشبوهة واستحواذه بالكمال المطلق والفترات المتباعدة بين أفلامه قد أثارت سيلاً عارماً من الروايات المشكوك في صحتها مما أدى إلى النظر إليه كميثولوجيا أكثر من كونه إنساناً عادياً.إن أسطورة ستانلي كوبريك تصوره على أنه عبقري سينمائي حاد التركيز هادئ مبغض للبشر وشديد العناية بالتفاصيل، يعيش حالة وجودية اعتكافية وقلما يسافر وتستحوذ عليه المخاوف العصبية الرهابية. لذلك استهل هذا الكتاب صفحاته بمحاولة لفهم ستانلي كوبريك الذي قد يعتبر أعظم مخرج سينمائي ما زال على قيد الحياة.إن هذا الكتاب هو السيرة الأولى الشاملة عن حياة ستانلي كوبريك. وينصب هدفه على تفنيد هذا الغموض والأساطير المحاكة حول كوبريك من خلال سرد حياته بدءاً من ولادته في مقاطعة (برونكس) بنيويورك عبر عقود من إنجازاته السينمائية إلى المفهوم الحالي المبالغ به حول اعتباره مخرجاً مبدعاً معتكفاً يعيش في حالة من النسيان.",
  "genres": [
    "Biography",
    "Film",
    "Nonfiction",
    "Media Tie In",
    "Art"
  ],
  "author": "Vincent Lobrutto",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/10049862"
}