{
  "title": "The Nexus",
  "description": "When Aleria Hayes gets swept into the world of the Watchers her fate is tied to the end of the world. Will anyone survive? “Sometimes series fizzle out by the second book. Yet, The Watcher Series manages to skip that and get better and better.” ★★★★★ —The Indie Shelf ReviewSometimes the most frightening secrets are those we keep from ourselves.With her eyes now open to the world of immortals, Ali Hayes realizes that there is more to the ancient power struggle between Vampires and Watchers than she ever thought possible. When a surprise informant reveals the French Coven is closing in on her and those she loves, she also learns things about herself that she cannot fully explain.Will the secrets she uncovers change the balance of power—or simply awaken things that should have been left undisturbed?The simple beginning of The Unintended gives way to the fast-paced sequel, The Nexus. Journey into the shadow world of vampires, fallen angels, and the Watchers.This series is great for anyone who loves the romance of Stephenie Meyer’s Twilight Saga, the world building of Cassandra Clare's Mortal Instruments Series, and the high stakes of Suzanne Collins' Hunger Games. When you get to book two, fasten your seatbelt, each book is faster, darker, and sexier.“Woods continues to grow her characters while adding more danger and emotion to the mix .” —Author Tamar Hela“ I love kick ass heroines .” —The Indie Shelf Review“ I made excuses to read —even going to the laundromat to wash bulky rugs!” —Judi on Goodreads“It thrusts the urgency of the story forward at a break-neck pace .” —Lauren on Goodreads“It is so much more than a love story (although, let's be real, the love story part is really hot) .” —Amazon Review“I found that i t surprised me with each new chapter, in a good way . The ending is much like Allure, and will definitely leave you shell-shocked.” —Hailey on GoodreadsIf you want maximum suspense, this is the recommended",
  "genres": [
    "Young Adult",
    "Vampires",
    "Paranormal"
  ],
  "author": "Robin  Woods",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/13573764-the-nexus"
}