{
  "title": "Amara cunoaștere",
  "description": "Într-o cameră de hotel din Paris, un bărbat scrie un roman întemeiat pe amintiri din călătoriile sale anterioare. Totul începe la Paris, cu douăzeci și cinci de ani în urmă, dar amintirile și imaginația îl poartă pe scriitor către Milano, Lisabona, Bruges, Marsilia… Ce caută acest om? Cine este el? Poate să se împace cu el însuși, omul în care s-a transformat în acest timp? Fugă literară în sensul termenului muzical, carte de călătorii, eseu despre depresie, căutarea de sine și căutarea reperelor, roman al introvertirii și introspecției, Amara cunoaștere este toate acestea la un loc. Pentru scriitorul Enis Batur, considerat alături de Orhan Pamuk cel mai mare autor turc contemporan, scrisul este, ca și călătoria, o manieră de a „trece dincolo”. Născut în 1952, Enis Batur este un autor prolific care a scris peste o sută de cărți, treizeci dintre ele traduse în mai multe limbi (engleză, franceză, italiană, arabă, persană, română). A studiat sociologia la Ankara, apoi a făcut studii de literatură la Sorbona. Mai târziu va evoca întâlnirile sale cu Michel Butor, Samuel Beckett sau Nathalie Sarraute, care i-au marcat tinerețea și i-au influențat scrisul. Dintre cărțile sale, în limba română a mai fost publicat romanul Mărul, o carte pe jumătate ficțiune, pe jumătate eseu, care pleacă de la mult controversata pictură a lui Gustave Courbet, Originea lumii.Amara cunoaștere este primul text autoficțional dintr-un triptic care include Mărul și Alte drumuri (D’autres chemins).Marc Semo, redactor șef și director executiv la departamentul de știri externe a ziarului Libération, care timp de câțiva ani a fost reporter în Turcia, afirma: „Enis Batur...[și] Orhan Pamuk sunt cele două figuri importante ale noii literaturi turce, care au eliberat-o de toate legăturile ei arhaice și folclorice”.",
  "genres": [
    "Turkish",
    "Art"
  ],
  "author": "Enis Batur",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/13573867-amara-cunoa-tere"
}