{
  "title": "The Grammar of Rock: Art and Artlessness in 20th Century Pop Lyrics",
  "description": "National Book Award nominee, critic and one of America’s least compromising satirists, Alexander Theroux takes a comprehensive look at the colorful language of pop lyrics and the realm of rock music in general in The Grammar of Rock: silly song titles; maddening instrumentals; shrieking divas; clunker lines; the worst (and best) songs ever written; geniuses of the art; movie stars who should never have raised their voice in song but who were too shameless to refuse a mic; and the excesses of awful Christmas recordings. Praising (and critiquing) the gems of lyricists both highbrow and low, Theroux does due reverence to classic word-masters like Ira Gershwin, Jimmy Van Heusen, Cole Porter, and Sammy Cahn, lyricists as diverse as Hank Williams, Buck Ram, the Moody Blues, and Randy Newman, Dylan and the Beatles, of course, and more outré ones like the Sex Pistols, the Clash, Patti Smith, the Fall (even Ghostface Killah), but he considers stupid rhymes, as well — nonsense lyrics, chop logic, the uses and abuses of irony, country music macho, verbal howlers, how voices sound alike and why, and much more.In a way that no one else has ever done, with his usual encyclopedic insights into the state of the modern lyric, Theroux focuses on the state of language — the power of words and the nature of syntax — in The Grammar of Rock. He analyzes its assaults on listeners’ impulses by investigating singers’ styles, pondering illogical lunacies in lyrics, and deconstructing the nature of diction and presentation in the language. This is that rare book of discernment and probing wit (and not exclusively one that is a critical defense of quality) that positively evaluates the very nature of a pop song, and why one over another has an effect on the listener.",
  "genres": [
    "Music",
    "Nonfiction",
    "Essays"
  ],
  "author": "Alexander Theroux",
  "average_rating": "3.15",
  "url": "https://www.goodreads.com/book/show/13574454-the-grammar-of-rock"
}