{
  "title": "From The Dog's Mouth: Barks, Yelps & Growls about Politics, Jackasses and Blowhards, Religion, Christians and Jews, My Chosen People, Gays, Straights, ... Behar and Anything Else I Want to Yak about",
  "description": "When a 70-something astrologer, well-known for his razor-sharp intuition and celestial insights, decides to get his first dog, he is in for the surprise of his life. You see, this Fox Terrier turns out to be a healer and a mind reader. And the dog talks to his owner.Join the journey of Mr. Darby and his owner whom he calls a lot of descriptive names as they both make major adjustments to each other.Like how to get Mr. Darby not to poo and pee in the house; fights about eating schedules — but most stand-offs are about control and manipulation.Just when you think you've heard everything, this 3 year-old terrier will have you laughing at yourself, crying in some parts, and you might even get rip-roaring mad with his political bias.You'll meet Scott and his dog, Riggs, who becomes Mr. Darby's best friend.Mr. D. will tell you who he thinks is going to be the next President of the United States and why.This Wire Fox Terrier has the solution for the economic problems around the world.He'll tell you about his past lives and why he chose his present owner.Although his Dada (yes, another name he calls his owner) has written many books and has a well-respected career as a counselor and media personality, Mr. Darby wants you to know that From the Dog's Mouth is his book and not Mister G.'s.Let me be upfront from first I refer to my lord and master as Daddy or Dada because although he has never had a pet or raised two-legged kids, he has done his best to whip me into shape, make me abide by his rules, and do what I am told. Sometimes I call him mon père or il mio papà, even simply Mister G. He and I have become co-healers in his practice as a therapist. He counsels thousands of men, women, and children as an intuitive, using Carl Jung and astrology to wring the truth out of them, and to tell them what the world looks like through his lens.Thank God Dada learned how to read my mind, or as his momma, Maggie, would say, \"listen to me,\" so he could channel my thoughts for this book.",
  "genres": [],
  "author": "Mr. Darby",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/13574516-from-the-dog-s-mouth"
}