{
  "title": "Among the Cloud Dwellers",
  "description": "In this compelling and hauntingly vivid novel, Porzia Amard, an epicurean globetrotter, has left her French-Italian roots and her beloved wine-making family behind in Tuscany to pursue her journalistic studies in the USA, eventually settling in Florida; Pensacola, to be exact, where hurricanes abound. And it is on the forceful tail end of one such hurricane that her life suddenly takes a mystical turn and the story begins.When she unexpectedly inherits the legacy of unusual powers at her beloved grandmother’s deathbed, she embarks on an unforgettable journey of self-discovery. From the winding hills of Tuscany to the perilous landscape of South Australia to the salt-scented beaches of western Florida, Porzia abandons the straightforward path after a past life regression introduces a distant soul mate, revealing a love so intense it has resisted the tarnishing of time.Narrated in vibrant prose, infused with mouthwatering aromas of delicious recipes paired with inebriating wines, Porzia’s life intertwines with captivating characters. She finds herself embroiled in a world of esoteric secrets and swept up in heated passion when she meets famed off-road racer Gabe Miller. As they experience a love only few of us can imagine, let alone have ever savored, she finds herself believing Gabe to be her lost soul mate reincarnated. Further complicating matters for the pair is Gabe’s elusive past and a private promise, which lies at the heart of the book's mystery.This unique and extraordinary novel is an irresistible recipe for lovers of romance, food and wine, and the mystical realm. This book promises freedom from earthly boundaries; it blurs the lines between safety and the unconventional, between love and fear, and between us and the gods.",
  "genres": [
    "Romance",
    "Fantasy"
  ],
  "author": "Giuliana Sica",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/13574568-among-the-cloud-dwellers"
}