{
  "title": "It's Not Easy Bein' Me: A Lifetime of No Respect but Plenty of Sex and Drugs",
  "description": "An American comic icon tells the story of his second–act rise from obscurity to multimedia stardom. \"When I was a kid,\" writes Rodney Dangerfield, \"I worked tough places in show business––places like Fonzo's Knuckle Room. Or Aldo's, formerly Vito's, formerly Nunzio's. That was a tough joint. I looked at the menu. They had broken leg of lamb.\" For once, one of America's most beloved comic icons isn't kidding. Dangerfield has seen every aspect of the entertainment industry: the rough–and–tumble nightclubs, the backstage gag–writing sessions, the drugs, the hookers, the lousy day jobs – and the red–carpet star treatment. As he traces his route from a poor childhood on Long Island to his enshrinement as a comedy legend, he takes readers on a roller–coaster ride through a life that has been alternately touching, sordid, funny, raunchy, and uplifting – equal parts \"Little Orphan Annie\" and \"Caligula.\" And unlike most celebrity autobiographers, he seems to have no qualms about delivering the unfiltered whole story, warts and all. Dangerfield's personal story is also a rollicking show business tale, full of marquee name–droppings (Adam Sandler, Sam Kinison, Jim Carrey, Johnny Carson, Jerry Seinfeld) and good stories about same. Defying the old saws about the fleeting nature of fame and the dearth of second acts in American life, Dangerfield transformed himself from a debt–ridden aluminium–siding salesman named Jack Roy to a multimedia superstar – and stayed an icon for decades. His catchphrase – \"I get no respect\" – has entered the lexicon, and he remains a visible cultural presence and perennial talk–show guest. Dangerfield's hilarious and inspiring musings should thrill comedy fans and pop–culture watchers, and his second–act comeback will strike a chord with readers of all stripes. Maybe he'll even get some respect.",
  "genres": [
    "Biography",
    "Humor",
    "Comedy",
    "Nonfiction",
    "Memoir",
    "Autobiography",
    "Biography Memoir"
  ],
  "author": "Rodney Dangerfield",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/135747.It_s_Not_Easy_Bein_Me"
}