{
  "title": "Sating the Wolves",
  "description": "Sating the Wolves is the second volume of the Wolf Mountain werewolf sex series. The first volume is Thrown to the Wolves, available now.Emily is under the sensual spell of the alpha male. Aylen has escaped the pack with the young, female runt. Both are in more danger than they know.In this second installment of the Wolf Mountain series Emily and Aylen are hunted across the mountains by the werewolf pack. Will they learn the secret of the pack in time?The man walked silently through the cave, confidently, as if he could see every inch of the darkness. He paused beside her, and Emily could see steam rise from his skin, his sweat evaporating from his naked skin in the cold air. His long, dark hair was covered in a fine dusting of snow that glittered in the moonlight.Emily spread her legs in anticipation, inviting him into her once again. She reached out and gripped his calf, digging her fingernails into his thick, muscular leg, pulling him down towards her. She felt his calf tense as he crouched, and in the half light she saw his intention. Her lips opened wide, and she allowed him to slide himself into her mouth.The heat struck her first. His thick, hard penis felt like it was on fire. Emily felt each beat of his heart pulse through the shaft, throbbing on her tongue as he slid his length past her lips. She moved her hand up to his thigh and felt him squat easily on the balls of his feet, suspended above her so she could hold him in her mouth. His large, strong hand wrapped around the back of her head and he pulled her further onto his cock.Emily pulled away, leaving a long, thin line of saliva and pre-cum suspended between her lips and the tip of the throbbing penis. She dipped her head beneath the shaft and took his large, heavy balls in her mouth, savoring the strong, musky taste of his sweat. As she licked him she felt even more lightheaded, intoxicated by his scent. She felt as if she were drunk.Emily felt the wolf's muscles tense, and he leaned forward to straddle her. She felt his hard, wet cock slide down her body, running over the curve of her breasts and down across her smooth, flat belly. The man's head came down to her neck and she felt his hot, sharp breath on her skin, his thick stubble scratching at her collarbone, and moments later she gasped as he pressed the thick head of his cock against her slick, throbbing clit.",
  "genres": [],
  "author": "Aya Fukunishi",
  "average_rating": "3.12",
  "url": "https://www.goodreads.com/book/show/13575104-sating-the-wolves"
}