{
  "title": "Excavations: A City Cycle",
  "description": "\"The excavations that take place in this book are literal and metaphorical. As the speaker moves through Europe, the Middle East, and the American Southwest, she's undertaking a serious study of the brick and mortar composition of cities such as Vienna, Berlin, San Diego, and Baghdad. But each city is, as the speaker notes, 'a city within a city,' that is, a story within a story, the layers of which come to light as the speaker soaks up each environment—its textures, its temperatures, its temperaments—its past offenses, its present troubles, and its future possibilities.\"—Rigoberto Gonzalez, author of Butterfly Boy: Memories of a Chicano Mariposa, from the foreword.Selected by Rigoberto Gonzales as the winner of the South Carolina Poetry Book Prize, Excavations is the first collection of poetry from Jennifer R. Pournelle. Set in different cities over fifteen years of peace and war, the collection explores the hidden similarities of these locations' seemingly different landscapes and cultures. She begins in Vienna with the renovation of Saint Michael's Square, then to a just-reunified Berlin, onward to Spanish-influenced San Diego, ending in the midst of the sectarian conflicts of Baghdad. Through vivid explorations of place, Pournelle's narratives bring to the surface defining historical events from these sites and their host cultures as the poems reveal how events rooted in these locations ripple outward to affect the world beyond. A career soldier turned environmental anthropologist and archeologist, Pournelle is deeply attuned to visions of loss and destruction as well as the promise of rebirth and rediscovery. Her poems voice her individual experiences abroad as she sifts—literally and metaphorically—through layers of turbulent history and harsh present circumstances in search of promise of future recovery for all that has been lost.",
  "genres": [],
  "author": "Jennifer R. Pournelle",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/13576537-excavations"
}