{
  "title": "The Tale of Emma Ott",
  "description": "Emma Ott is a quirky girl, who lives a simple life with her family in London, a recent move from her American upbringing. While wandering thru a London booksellers, a mysterious book draws her in, where the enchantments and spells are directed at her. Quickly pulled through time, to a place she could never have imagined, Camelot, but this Camelot is not the one of legend. In searching for the author of her book, Emma is taken on a journey, which is more like a nightmare; at least it feels that way, until Thomas comes along. She finds the author of her book, claiming to be her many times over great grandfather, the wizard Merlin. He wants to prove the existence of King Arthur, and Emma’s task is to bring forth this proof, in an item of King Arthurs, to present-day. The old wizard, vowing to right a wrong, is determined fix a mistake in history, but in trying to do so, history itself is changed. Merlin understands too late that he has altered history, and now Camelot is not as anyone remembers. Spells go awry, and they find themselves trapped in the seventh century, in a world that holds unique challenges for them, and for a much younger Merlin. Now evil rules and death reigns, where not every fairy tale has a happy ending and there is always another monster. In Camelot, a usurper occupies the throne, a resurrected being, one who is tyrant and evil sorcerer, wielding black magic to control and rule. As plans proceed to right history, Emma and Thomas explore magic, develop strategy, and hunt clues that guide them closer to home, even if home may be unreachable. Friendships grow, as does the dawn of love, but love cannot bloom if it further pollutes the timeline, and only time will tell if the path they walk is the right one.",
  "genres": [
    "Fantasy",
    "Time Travel",
    "Young Adult",
    "Paranormal"
  ],
  "author": "Wynema Taylor",
  "average_rating": "2.90",
  "url": "https://www.goodreads.com/book/show/13576639-the-tale-of-emma-ott"
}