{
  "title": "Lunch in Brooklyn",
  "description": "Kate likes Harry and Harry likes Kate, but what does that mean? Lunch in Brooklyn is a vivid, funny portrait of an eighth grader caught between her fraught school social life in Brooklyn and her embarrassing artist parents in Greenwich Village. When Harry catches Kate’s eye at the start of the school year, she wonders if the wrong boyfriend might be social suicide. Is his love worth the risk? Does she really care what her friends think? Are they even her friends? Maybe she should just leave them all behind for a new school, as her parents believe she must.Set over the course of one school year, at the tail end of the 1970s, Kate and her friends sneak cigs, organize sleepovers and parties when parents are away, all the while struggling with the shifting sands of friendship, loyalty and popularity.Kate’s parents want her to switch schools, hoping for something a bit preppier than her progressive Brooklyn school with its self-directed learning and ample opportunities for goofing off. Kate struggles to define herself as she prepares for a new school and considers a fresh start.Eighth grade is no one’s favorite year nor is it exactly the end of the world. Rebecca Moore nails the ways middle schoolers are in turns hilarious, savage and in need of one of their social studies teacher’s “compassion chips.” Filled with the kind of stuff that kept you laughing in the back row of algebra, Moore combines a fine ear for authentic kid dialogue with empathy for the plight of the 14-year-old caught in a maze of expectations.Originally serialized in Sassy magazine, this is the full version of the story many readers have been waiting to finish since 1994. If you are an eighth grader, this book will make you glad to know other people have been there. If you are a former eighth grader, you’ll enjoy the trip.",
  "genres": [],
  "author": "Rebecca  Moore",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/13576688-lunch-in-brooklyn"
}