{
  "title": "ألسنة اللهب",
  "description": "من جديد، تعود الروائية الأميركية \"سوزان كولنز \" برواية ثانية من ثلاثية \"مباريات الجوع\" وهذه المرة جاءت بعنوان \"ألسنة اللهب\" حيث سنخوض مع بطلتها الجريئة \"كاتنيس إيفردين\" امتحانات واختبارات قاسية في مباراة يتعين على أفرادها أن يتقاتلوا حتى الموت. أما الفائز منهم وبحسب قوانين اللعبة، فهو آخر مجالد يبقى على قيد الحياة. وفي \"ألسنة اللهب\" تضعنا كولنز أمام موضوعتا \"التمرد\" و\"الثورة\" فالرواية ظاهرياً تدين سلطة البلد المفترض، كونها تصدر قرارات ملزمة على أبناءها للدخول في مباريات بشعة فرضتها \"الكابيتول\"، \"... لو كان الأمر بيدي لحاولت نسيان كل ما يتعلق بمباريات الجوع (...) لكن فيكتوري تور تجعل من ذلك أمراً مستحيلاً. فقد عمد الكابيتول إلى إبقاء الرعب حياً ومستمراً في أذهاننا، وذلك من خلال قراره الذكي لموعد الرحلة الذي يتوسط مواعيد المباريات السنوية (...) هذه السنة أنا إحدى نجوم هذا الاستعراض، وسيتحتم عليّ التنقل من مقاطعة إلى أخرى كي أقف أمام الجماهير المبتهجة التي تكرهني في سرّها، وسأنظر مضطرة إلى وجوه العائلات التي قتلتُ أولادها...\". وهنا تجد كاتنيس نفسها أمام امتحان قاسٍ، فإذا أرادت النجاة بحياتها فسيتعين عليها أن تنظر إلى خيارات توازن ما بين البقاء وبين المشاعر الإنسانية. وكذلك ما بين الحياة والحب. \"… كان دفاعي الوحيد هو التظاهر أنني فقدت صوابي بتأثير الحب الجامح الذي شعرت به نحو بيتا. سمحوا لنا بالبقاء نحن الاثنين على قيد الحياة لهذا السبب، وسمحوا لنا أن نتوّج فائزين، وأن نعود إلى موطننا كي نحتفل ونلوّح لآلات التصوير قبل أن يتركونا وشأننا. أعني حتى الآن...\". وعندئذ شعرت \".. كاتنيس بالمسؤولية عن عدم الاستقرار الذي أشعل شرارات النار وجعل ألسنة اللهب تنتشر ما دفع الكابيتول إلى طلب الثأر. لقد تحولت حياتها إلى دوامة لأنها غير قادرة على إيقاف هذه الثورة، بينما تشعر في قرارة نفسها بضرورة استمرارها. وبينما ترتفع الرهانات إلى مستويات قصوى مع اقتراب موعد القيام بجولة النصر في الضواحي ضمن مسيرة النصر القاسية مع بيتا. فإنهما إذا لم يتمكنا من إثبات أنهما تائهين في حبهما دون أي شك، فإن العواقب ستكون كارثية..\". رواية مذهلة، فهي بقدر ما تحمل من خيال، وهلع، وتشويق، بقدر ما تحمل بين ثناياها شبهاً كبيراً بحاضرنا المقلق الذي نحياه، حيث التمرد، والثورة، وقبضة الكابيتول الفولاذية على المقاطعات، تعني أننا أمام سيطرة ذات طابع شرعي \"فعقوبة الضعفاء والجائعين أصبح لها قوانين ومباريات للقتل\".",
  "genres": [
    "Young Adult",
    "Fiction",
    "Fantasy",
    "Science Fiction",
    "Romance",
    "Audiobook",
    "Teen"
  ],
  "author": "Suzanne Collins",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/13577338"
}