{
  "title": "The Last Great Ape: A Journey Through Africa and a Fight for the Heart of the Continent",
  "description": "An epic journey through Africa by a man who fell in love with a magical and disappearing world and then transformed himself into a warrior on the front lines to protect it. Staging heart-pounding, espionage-style raids, Ofir Drori and his organization, The Last Great Ape (LAGA), have put countless poachers and traffickers of endangered species behind bars, and they have fought back against a Kafkaesque culture of corruption.  Before Ofir arrived in Cameroon, no one had ever even tried.The Last Great Ape follows a young Ofir on fantastical adventures as he crosses remote African lands by camel, on a horse, and in dug-out canoes, while living with exotic tribes and struggling against nature at its charging elephants and hyenas, flash floods, and the need to eat river algae and snails to stay alive.  The story moves from places of extreme beauty to those of the darkest the war zones of Sierra Leone and Liberia.  Ofir begins to work as a photojournalist in order to expose his shocking encounter with war victims and child soldiers.  His experiences forge in him a resolution to become an activist and to fight for justice.The search for a cause eventually leads him to Cameroon.  When Ofir discovers that no one is fighting to disprove Jane Goodall's dark prophesy that apes in the wild will be extinct in twenty years, he decides that he is the man to step in; because he knows he can make a difference, he sees it as his responsibility.  And LAGA is born.The Last Great Ape is a story of the fight against extinction and the tragedy of endangered worlds, not just of animals but of people struggling to hold onto their culture.  The book reveals the intense beauty and strife that exist side by side in Africa, and Ofir makes the case that activism and dedication to a cause are still relevant in a cynical modern world.  This dramatic story is one of courage and hope and, most importantly, a search for meaning.",
  "genres": [
    "Africa",
    "Nonfiction",
    "Animals",
    "Travel",
    "Cameroon",
    "Conservation",
    "Audiobook"
  ],
  "author": "Ofir Drori",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/13577196-the-last-great-ape"
}