{
  "title": "The Kingdom and the Crown Set",
  "description": "In an ancient land in a time foretold by prophets, a babe was born beneath a shining star. Thirty years later, Jesus of Nazareth began teaching a message of hope, peace, and love. He claimed to be the Son of God, and his words - and his life - would change the world. In Fishers of Men, the first volume in the new series The Kingdom and the Crown, best-selling author Gerald N. Lund transports us to the days of Christ's mortal ministry and invites us to experience the emotions and events of those extraordinary times. Reports of Jesus of Nazareth have reached the ears of David ben Joseph, a merchant in Capernaum, who has waited and watched for the Messiah ever since a special, starlit night thirty years ago. He and his family decide to see for themselves whether or not the rumors are true and journey to hear Jesus. Though David is quick to accept Jesus as the Messiah, the rest of his family is more cautious. His wife, Deborah, and his son, Simeon, leaders in the rebellious Zealot movement, look for a Messiah that will crush the Romans with power and the sword, not one preaching a message of love and forgiveness. Meanwhile, reports of Jesus have reached into the very heart of Jerusalem, and both the powerful Sadducee Mordechai ben Uzziel and the Pharisee Azariah are growing uneasy with the news. Though they hold opposing political views, both agree that something must be done to stop this man from Nazareth before he gets out of hand. However, in Mordechai's own household the influence of the carpenter from Nazareth begins to create conflict. Fishers of Men is a sweeping epic filled with memorable characters who bring to life an extraordinary time in the history of the world. It is a story about the importance of family, the power of faith, the miracle of forgiveness, and the strength needed to follow your heart.",
  "genres": [
    "Historical Fiction",
    "Religion",
    "Lds Fiction",
    "Lds",
    "Fiction",
    "Church",
    "Spirituality"
  ],
  "author": "Gerald N. Lund",
  "average_rating": "4.61",
  "url": "https://www.goodreads.com/book/show/1357824.The_Kingdom_and_the_Crown_Set"
}