{
  "title": "Saison brune",
  "description": "\"Une société vraiment libre, une société autonome, doit savoir s'autolimiter, savoir qu'il y a des choses qu'on ne peut pas faire ou qu'il ne faut même pas essayer de faire ou qu'il ne faut pas désirer.\" Cornelius CastoriadisÉté 2006. Philippe Squarzoni finalise son album politique Dol, mais il lui reste un passage à traiter, celui de l'écologie. Peu connaisseur, il veut maîtriser son sujet et parler en détail du changement climatique. Déstabilisé par l'ampleur du problème, il s'interroge, s'informe, se trouve confronté à des impasses, ou renvoyé à de nouveaux questionnements. S'ensuivent six ans de recherches...__________________________________Le titre de l'album fait référence à cette cinquième saison qualifiée de \"brune\" dans le Montana, période d'indécision entre l'hiver et le printemps.Dans Saison brune, Philippe Squarzoni tisse un récit inédit, qui entremêle analyses scientifiques et interviews de spécialistes, considérations personnelles et hommages au cinéma, enquête politique et essai engagé.Le livre est découpé en six chapitres. Les trois premiers sont précédés de trois interludes portant sur les commencements d'une oeuvre. Les trois derniers sont suivis de trois interludes sur les fins.Les deux premiers chapitres sont consacrés aux aspects scientifiques du réchauffement : le fonctionnement du climat, la description de l'effet de serre, l'augmentation des gaz à effet de serre dans l'atmosphère durant l'époque moderne. Mais aussi l'expertise menée par le GIEC, l'attribution du réchauffement aux activités humaines, les différents scénarios d'augmentation des températures à venir, les risques d'effets de seuil, les risques de rétroactions positives.Dans les deux chapitres suivants, Philippe Squarzoni alterne entre l'examen des conséquences à venir du réchauffement climatique (fonte des glaciers, montée des eaux, multiplication des tempêtes, risques de sécheresse dans certaines régions...) et les questionnements du narrateur et de sa compagne face à cette situation inédite. Que faire à un niveau individuel ? Que faire quand ce qui est en cause est la production d'énergie, l'industrie, les transports, le bâtiment, l'agriculture ? Par où, par quoi commencer ? Nécessaire mais dérisoire, sans proportion par rapport à l'ampleur de ce qu'il faudrait accomplir, le niveau individuel semble largement insuffisant.Dans les deux derniers chapitres, Squarzoni élargit son questionnement et examine les possibilités de réduction des émissions et les différents scénarios énergétiques qui s'offrent à nos sociétés (énergies renouvelables, nucléaire, progrès technologiques, maîtrise de l'énergie...). Entre les insuffisances des unes, et les faux espoirs des autres, il décrit une alternative possible qui permettrait d'éviter les conséquences les plus graves du réchauffement climatique. Et les choix politiques, les modèles de société, que ces scénarios impliquent. Une porte s'ouvre. Saurons-nous la franchir ?Saurons-nous inventer une civilisation plus sobre capable de prendre en compte les questions écologiques ? Nos sociétés sauront-elles éviter les conséquences les plus graves du réchauffement climatique, tout en préservant la liberté et la démocratie ?Dans un album chargé de nostalgie, qui est probablement le plus personnel de ses livres politiques, Philippe Squarzoni livre un essai qui donne à espérer, mais reste très pessimiste sur la réalisation de cet espoir au vu de la nature de la crise, de l'ampleur des changements à accomplir, et du fonctionnement de nos sociétés.",
  "genres": [
    "Graphic Novels",
    "Nonfiction",
    "Science",
    "Comics",
    "Climate Change",
    "Environment",
    "Bande Dessinée"
  ],
  "author": "Philippe Squarzoni",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/13578356-saison-brune"
}