{
  "title": "Please Understand Me II: Temperament, Character, Intelligence",
  "description": "Phenomenon: Keirsey and Bates's Please Understand Me, first published in 1978, sold nearly 2 million copies in its first 20 years, becoming a perennial best seller all over the world. Advertised only by word of mouth, the book became a favorite training and counseling guide in many institutions -- government, church, business -- and colleges across the nation adopted it as an auxiliary text in a dozen different departments. Why? Perhaps it was the user-friendly way that Please Understand Me helped people find their personality style. Perhaps it was the simple accuracy of Keirsey's portraits of temperament and character types. Or perhaps it was the book's essential message: that members of families and institutions are OK, even though they are fundamentally different from each other, and that they would all do well to appreciate their differences and give up trying to change others into copies of themselves.Now: Please Understand Me IIFor the past twenty years Keirsey has continued to investigate personality differences -- to refine his theory of the four temperaments and to define the facets of character that distinguish one from another. His findings form the basis of Please Understand Me II, an updated and greatly expanded edition of the book, far more comprehensive and coherent than the original, and yet with much of the same easy accessibility. One major addition is Keirsey's view of how the temperaments differ in the intelligent roles they are most likely to develop. Each of us, he says, has four kinds of intelligence -- tactical, logistical, diplomatic, strategic -- though one of the four interests us far more than the others, and thus gets far more practice than the rest. Like four suits in a hand of cards, we each have a long suit and a short suit in what interests us and what we do well, and fortunate indeed are those whose work matches their skills. As in the original book, Please Understand Me II begins with The Keirsey Temperament Sorter, the most used personality inventory in the world. But also included is The Keirsey Four-Types Sorter, a new short questionnaire that identifies one's basic temperament and then ranks one's second, third, and fourth choices. Share this new sorter with friends and family, and get set for a lively and fascinating discussion of personal styles.",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Self Help",
    "Reference",
    "Business",
    "Philosophy",
    "Relationships"
  ],
  "author": "David Keirsey",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/104190.Please_Understand_Me_II"
}