{
  "title": "لا غبار عليكِ",
  "description": "في هذهِ المجموعة لا يتوقَّف لقمان ديركي عن مشروع كتابة اليوميّ , يستمر في الكتابة دونَ توقف عن التفاصيل اليوميّة , إضافةً إلى حِسّ الفُكَاهة الذي يُضفي على النص رونَقاً يُنْقِذُ القارئ من التنمُّق الجاري في شِعْر الرّاهن :تدخلين..فيهلعُ المكانيهلعُ الرجالوتهلعُ النسوة على الرجالأنتِ لست امرأةأنتِ جيشٌ من النساء .في كُل ماكتبه لقمان ديركي ومَا يكتبهُ يتجاوز مُجَايليه من الشّعراء في سوريا , هوَ خَطّ لنفسهِ دربَ التميُّز كتابةً ونمط حياة ( نمط الحياة التي يعيشها لقمان ديركي هي الطريقة المُثلى و اللائقة بروح شاعر متمرّد )إن ما يُلفِت الإنتباه في تَجربة هذا الصعلوك قدرتُهُ البارعة على التعبير بِحِرَفيَةٍ ودقّة عن الألم الشخصيِّ ومن ثمّ إرتدادهُ وسخريتهُ منَ الألَمِ ذاته وبنفس درَجَة الدقّة , غَوصٌ في , وانتقادٌ لِ تَفَاَهة الرّاهن من الحياة والماضي على حَدٍ سَواء , في كل أعمالهِ ما من مورثاتٍ فكريّة أو مرجعيّاتٍ إلهيّة شعريّة , أضف الى ذلك إتّسَام شِعره بالمرونَة وعَدَم إستساغَة التأطير , إذاً هُنا لا نَمْذَجَة أو تَمذهُب مَقيت أو نخبويّة دائِخَة ومُدَوِِّّخة , إنّما العَكس تَماماً , هوَ أحياناً يَلْجَأ الى المحكيّة ربمّا ليَقينٍ تامٍّ أنّهُ لو دوّن النص بالفصحى لن يصل إلى القارئ إلّا ناقِصَاً مُشَوَّشَاً ومُشَوِّشَاً , لحظاتٌ مُعيّنَة تَشعُر من خلال القراءة أن ماكتَبَهُ لقمان ديركي يَتَحوّل ببساطَة سحريّة الى أدوات تفكير يتكئ عليها المُتَلَقي , هوَ دون إرث فكري يقدِّم للمُتلقي إرثاً فكرياً \\ مُعادَلَةٌ صَعبَة التحقّق إلا عندَ لقمان ديركي \\في ( لا غُبار عليكِ) يعتمد لقمان على قصيدة الومضة تلك القصيدة المكثّفة التي تُعْتَبَر مِن النوع الكتابيّ الصّعب : أجلسُ معكِ , وأكتفي .إن انشغال لقمان ديركي بالحياة اليومية ( وهذا صوابٌ بالنسبة لشخص شاعر , مَهلاً , بل لنا جميعاً , حيث أن الحياة اليومية تَِهبنا أفكاراً مُتَفوّقة على أفكار الكتب ) , وابتعاده عن القراءة على الأقلّ كما يقول الشاعر سعدي يوسف في تقديمه للأعمال الشعرية الكاملة للقمان ديركي ,ذلكَ يضيف الى نصه نكهة يومية فريدة , ولقمان ديركي في شعره لا يحكم بالعقل إنما بالعاطفة يسيطر على العقل ويضحك على ذقنه ( شعرياً ) ويصبح حاكماً متغطرساً وفق مقابلاته الحسّية المُعَتَمِدَة على كفاءة النظر وطَرد التخيُّل الغَير مُسْتَسِاغ بالنسبة له .إن لقمان كثيراً ما يخدش لصدقهِ إلا أنّ خَدشه ذاك ليس إلا ضربةً على الذهن قويّة مُجبراً إياه _ أي الذهن _ على القراءة المرة تلوَ الأخرى وإعادة رسم التصوّر عن الشّعر في سوريا , متعةٌ أن تقرأ شِْعراً متحرراً من الأوهام , من الأفكار الضخمة والغير واضحة , من الإتجاهات المؤلِمة لسير عََمل الذهن , إنه لقمان ديركي الصّعلوك الوفيّ للحِسّ وللرصيف وللشارع و الأهمّ من كل ذلك لِنَفْسِهْ .",
  "genres": [
    "Poetry"
  ],
  "author": "لقمان ديركي",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/13580083"
}