{
  "title": "Hot Lava",
  "description": "“Rob Rosen knows his Hawaii better than any tour guide, and doesn’t hesitate to mix the good, the bad and the steamy in this funny, sexy romp through the dark side of an island paradise.” -- Neil Plakcy, author of the Mahu mystery series“Set in scenic Hawaii, Hot Lava, Rob Rosen’s latest campy adventure, is true beach reading of the highest order, full of drinks, drag, daring adventure and dishy repartee.”-- Jim Provenzano, author of PINS, Monkey Suits and Cyclizen “Rob Rosen has crafted a story that you just don’t want to stop reading. There was \"Thelma and Louise\" for the girls and for us guys there is \"Hot Lava\". So pour yourself a cocktail, make yourself comfortable and come along for the ride. You'll love it.” -- Wayne Mansfield, author of Highway Patrol and The Collection “Hot Lava, a funny, sexy mystery novel with a tropical twist, is a who-done-it with a healthy dose of who-done-who. I laughed from beginning to end, and then looked for tickets to Oahu. Just to see if I could get into half as much mischief as Rosen's heroes.” -- Michael Luongo, editor of Looking for Love in Faraway Places “Make yourself a killer Mai Tai and settle in for another travel adventure from Rob Rosen. You can almost smell the plumeria blossoms and feel the trade winds in the air – a perfect book to take along on your summer vacation this year… or to read while you dream of taking one.”-- Mark Abramson, author of the Beach Reading series“Hot Lava” is sexy, sultry…and scalding to the bad guys. Rosen’s Chase and Brandon are like male incarnations of Edina and Patsy from the BBC’s “Absolutely Fabulous” – dropped in Hawaii, looking for cocktails, shopping, and men. -- Greg Lilly, author of the Derek Mason Mystery series“Pour yourself a Mai Tai…or three…and escape to the islands for a mystery you’ll never find on Hawaii 5-0. This is more like 5-ooooooooooh! Sex, drag queens, sex, hot dudes, sex…and did I mention the sex? With Hot Lava Rob Rosen has once again created a wholly-entertaining romp that should adorn every beach blanket from P-Town to Key West and beyond.”-- Kemble Scott, author of the bestselling novels SoMa and The Sower***Multiple double-crosses and scams are afoot involving two scheming pimps, several rogue cops, dangerous Japanese businessmen, a cross-dressing lawyer, Mormon bad guys, and incarcerated drug dealers, all under the watchful surveillance of our heroes, Chase and Brandon, not to mention their drag alter-egos, Liza and Judy.“Hot Lava” is a romantic comedy/murder mystery, as well as a laugh-out-loud funny and often deadly romp from one end of Oahu to the other. This heart-pounding thriller is about a dream vacation that quickly turns awry, with escaped convicts washing up on shore, bad guys scheming to do harm to our heroes, and sexy romps in unusual settings. It’s chock-full of witty banter and outlandish escapades, death and depravity, and friends, lovers, and other assorted crazy characters that fairly jump off the page. Take a vacation with Chase and Brandon and get yourself into Hot Lava!",
  "genres": [
    "M M Romance",
    "Mystery",
    "Contemporary",
    "Comedy",
    "Suspense"
  ],
  "author": "Rob Rosen",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/10419380-hot-lava"
}