{
  "title": "We Will Soar Into The Air As If Lured By The Sun",
  "description": "In New York the Jazz Age of the 1920s is in a mad fever of illegal booze and fast money when Scott Longmartin arrives from the Midwest to be a journalist at a famous Manhattan gossip tabloid. Scott believes that New York will take him up and transform him into a great novelist. It will make him into someone new. Someone cosmopolitan. Someone who has never been poor.  Soon Scott meets a world famous jazz musician and his infamously wild flapper sister Lolly, and he is welcomed into their fast crowd of wealthy jazz babies. The bootleg gin flows, the hot jazz horns wail and the loose girls shimmy madly. The booming world of Manhattan glows with promise. It is everything that Scott has ever dreamed. And so is Lolly.. The blue skies of the Jazz Age seem limitless. It is a world of sheer becoming. Nothing can prevent Scott from grasping his perfect dream..   According to Lee  This is an authentic dramatization of the Jazz Age of the 1920s and the city of New York at its peak of wealth and greatness. An exploration of the real world out of which F. Scott Fitzgerald created The Great Gatsby. It is a love story about the value of love, of ambition. About what we dare to dream.. And what those dreams can costs us.  The Jazz Age of the 1920s was a world of alcoholism and reckless parties, of rootlessness and debauchery, of money and sex. It was a revolution to destroy the past and make it modern at any cost.  They were young and drunk for a decade. By the time the hangover had cleared they were already old before their time and their lives were wasted. The economy had crashed and fascism was already upon them.   Many more reviews of Lee Vidor's books can be seen   An extensive opening sample of the book is available on this Amazon page.  According to  'An authentic portrait of a world gone mad with money and fevered youth.. They fizzed like mad bubbles rising in a champagne glass.. In 1920s Jazz Age New York the wildest generation in history are boozing themselves into a crazy fever to the rushing tempo of the hot new jazz music.’  'Romantic and sexy.. Witty and exhilarating.. Evocative and surprising..'  'The flappers lived as if it was already 100 years in their future. They shocked, they seduced and they danced.. This is a beautiful story well told with elegance and wit.. '  'After reading this book I finally understand the world of Scott and Zelda Fitzgerald.. The psyche of the times is fearlessly laid bare, feverish and wild and drunken..'  'The story of the Jazz Age made real.. It tells the things which Fitzgerald dared not report..'  'The madness of the age of flappers and Charleston.. Of romantic young men dying of too much success, too much bootleg gin and too much easy living.'   Regarding 20th Century Bohemians and  This is the second published book of the 20th Century Bohemians and Angels novel cycle. The first, Love Is A Simple Thing, is an authentic fictional portrait of the artists, bohemians and exiles of 1920s Paris. The entire novel cycle explores and dramatizes the developing Modernist Renaissance of the 20th Century. Each novel is an independent story concerning different artists, periods and milieus of the 20th Century. The books of the cycle may be read in any order.  Together the cycle forms a thematically unified portrait of the entire artistic Modernist Renaissance of the 20th Century. LeeVidor.",
  "genres": [],
  "author": "Lee Vidor",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/13581143-we-will-soar-into-the-air-as-if-lured-by-the-sun"
}