{
  "title": "Eternal Spring",
  "description": "Flowers, vacation, baseball, prom…what does spring mean to you? From unicorn hunters and teenage exorcists to Egyptian princesses and aspiring ballerinas, this collection of thirteen stories by some of the most exciting authors in Young Adult fiction explores young love and new beginnings during the most beautiful time of the year. “Camp Cauldron” by Juli Alexander Forced to spend Spring Break as a counselor at a camp for troublesome young witches instead of drooling over hotties at the beach, Emma relinquishes her hopes for romance. Could the perfect guy be waiting in the midst of poison ivy, s'mores, elephant trunks, and kangaroo feet? “Barre Hopping at Midnight” by Amanda Brice How can aspiring ballerina Dani Spevak concentrate on performing at a spring arts festival when her not-quite-boyfriend is in town filming the lead in a hot new vampire movie and he was seen kissing his costar? “The Vanishing Spring” by Carey Corp More than a century earlier, Eleanor Quimby tumbled into the water to escape an arranged marriage and disappeared. But was that the tragic end or a brave new beginning? “The Princess of Egypt Must Die” by Stephanie Dray A lonely Princess of Egypt is tempted by a forbidden love and forced to make a heartbreaking choice that will upend a kingdom and change her forever. “Spring Perfection” by Leslie DuBois Star athlete Scott Kincaid is about to make history and pitch a perfect game. But when he realizes that true perfection lies in the relationship he has with his best friend, Reyna, will he risk everything in order to keep a promise to her? “Picture Not Perfect” by Lois Lavrisa Seventeen-year old Tim wants to go to senior prom. Why doesn't his girlfriend Gabrielle want to go with him? Is she not who she says she is? “Potionate Love” by P.R. Mason Math geek, Tina, has found a way to get the popular jock, Ronny, to fall for a love potion. It'll work unless her best friend Nathan gets in the way. “1:30, Tour Eiffel” by Jennifer McAndrews A kiss in the dark will ruin Spring Break and lifelong friendships unless Rachel Healey can prove she is a pawn in someone else's game. “Off Balance” by Renee Pace Jennifer’s secret is big, but she loves Charlie enough to know ending their teenage relationship will set him free and enable him to join the Army. When Charlie discovers the truth, it’s up to him to convince Jen their young love was meant to be. “On a Field, Sable” by Diana Peterfreund After the shocking events of Ascendant, what awaits the unicorn hunter Melissende Holtz on the mountaintop where she watched her comrades fall? “The Language of Flowers” by Rhonda Stapleton Chrissy, a clerk at her aunt's flower shop, starts getting her own romantic surprises -- flowers with a special secret meaning. Can she bury her longstanding unrequited crush on her best friend’s brother to take a chance on mysterious love? “Dating After Dark (With Clowns)” by Tawny Stokes All teenage exorcist Caden Butcher wants is a demon-free night to take his new girl to the spring fair. Is that too much to ask for? “Sometime” by Alicia Street Sixteen-year-old mythology buff Terry Conn finally gets the after-school museum job she wanted so badly, but who knew those ancient dragon figures would dredge up images of a past she only half-remembered? Or that drool-worthy Jerrod Pierce would be part of it? Collectively, the thirteen authors in Eternal Spring have published over 90 books, and have received or have been nominated for several prestigious awards, including the RITA,® the Golden Heart,® the Daphne du Maurier Award of Excellence in Mystery and Suspense, the Jasmine, the Maggie, PASIC’s Book of Your Heart contest, the Amazon Breakthrough Novel Award, the Cybil Award for Best Young Adult Fiction, the EPIC e-book Award, the Romantic Times Reviewers Choice Award, and the New York Public Library’s Books for the Teen Age list.",
  "genres": [
    "Young Adult",
    "Fantasy",
    "Anthologies",
    "Fiction",
    "Romance",
    "Short Stories",
    "Novella"
  ],
  "author": "Amanda Brice",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/13581423-eternal-spring"
}