{
  "title": "City of Darkness",
  "description": "City of Darkness takes place in 1888 London, where Jack the Ripper roams the streets with impunity and Scotland Yard seems helpless to stop him. The science of forensics is in its infancy but a few detectives – Trevor Welles among them – recognize that they are dealing with a different sort of killer, a “modern criminal” who chooses his victims at random. If Jack is to be caught, he won’t be caught with Scotland Yard’s normal methods of deduction for there is no logic to this madness. The question is no longer “Why was the victim killed?” but rather “How was the victim killed?” For the first time in the history of detection, science is trumping deductive reasoning.When a twist of fate puts Trevor in charge of the case, he hastily assembles Scotland Yard’s first forensics team: Davy Mabrey, the first bobby on the scene of the grisliest of the murders, whose working class common sense proves an invaluable asset, Rayley Abrams, a cautious intellectual whose future at the Yard is marginalized due to his Jewish heritage, Tom Bainbridge, a medical student with aristocratic connections and a secret drinking problem, and Emma Kelly, sister of the Ripper’s last victim who has a troubled past and a gift for linguistics. The team finds an unlikely ally in the form of Queen Victoria herself, who takes an unusual level of interest in the Ripper case and secretly funds the unit. But will they stop Jack in time to spare Leanna Bainbridge, the young heiress with whom Trevor has fallen madly and improbably in love?While City of Darkness takes place in London, its sequel, City of Light, will travel to Paris on the eve of the Exposition Universalle, the ultimate World’s Fair which debuted Edison’s phonograph, Buffalo Bill’s Wild West Show, and the Eiffel Tower The third book, City of Silence, will take place in St. Petersburg where Victoria’s beloved granddaughter Alexandria is on the verge of marrying the young czar Nicolas, much to her grandmother’s dismay. Throughout the series the Scotland Yard forensics team, which serves as a sort of Victorian-era CSI, will circle the world to investigate high-profile cases, most often at the urging of the Queen.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Fiction",
    "Thriller",
    "Historical",
    "Historical Mystery",
    "19th Century"
  ],
  "author": "Kim   Wright",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/13582781-city-of-darkness"
}