{
  "title": "True Colours",
  "description": "Can you ever forget your first love? Successful interior designer Alex Ryan knows going back to Dublin will be difficult, but she has no idea of the hidden dangers that await her. With her father in hospital after a mysterious accident and a new design client demanding her attention, when Alex finds herself in the offices of Venture Capital Ireland the last person she expects to meet is Sebastian Wingfield, heir to the Wingfield fortune - the one man in Ireland she is desperate to avoid. And the last thing on Sebastian's mind is interior decoration. But Sebastian is to marry his best friend’s sister, Caroline Audiguet-O'Reilly, in eight weeks time. And as the wedding plans unfold, unknown to any of them, someone is set on ruining him - whatever it takes. There is no escaping the past, and the night Alex meets Sebastian at Kilfenora House, more than just their TRUE COLOURS are finally revealed. Praise for TRUE “A masterful tale of secrets and romance, wrapped in intrigue and tied with love” Amazon bestseller Sally Clements \"This is how romance novel should be written - the characters are sexy, interesting, independent, and believable and don't even start me on the setting... !\" M Scott \"Loved it, couldn't put it down. This is a wonderful mystery romance and you don't find out the major \"What?\" until the very end of the book.\" Addicted to Books \"True Colours is an intelligent romance with pace, plot and oh so much passion. Sexy and sassy, it is one of those books that once you get started you can't put down, and yearn for your bed all day so you can pick it up again when you turn in for the night...The last time I enjoyed a book this much was when I read one of Jilly Cooper's doorstops, and True Colours has all the raunchy (but none of the racehorses) page-turning qualities...\" KTK \"I absolutely loved everything about this book. In fact with so many five star reviews you are all going to think the author is paying us. It's just a really enjoyable story. I found myself rooting for both of the main characters. It's rare to find a book where their is conflict between two characters yet you can be rooting for both of them to have happiness. Their love story is very romantic. I was expecting a typical romance storyline, but this book weaves in a bit of suspense. Nothing too scary which is perfect for me. It is truly a beautiful story. I even enjoyed reading about the other not-so-nice characters in the book. This author knows how to paint pictures with words. I will be looking for more from her in the future.\" Sue Sells Stuff, Longwood, Florida",
  "genres": [
    "Contemporary",
    "Contemporary Romance",
    "Mystery",
    "Fiction",
    "Romantic Suspense",
    "Suspense",
    "Ireland"
  ],
  "author": "Vanessa  Fox",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/13583561-true-colours"
}