{
  "title": "The Magic Songs of the Finns",
  "description": "The largest collection of Finnish folk magic ever assembled. Since the time immemorial the Finns have used incantations, or Magic Songs. It’s unknown when or how this tradition of magic first came to be, but already in pre-historical times they were widely used in all areas of life.The 639 spells and charms contained in this book were collected in the 19th century from the rural areas of Finland and Karelia, shortly after which this old esoteric tradition became extinct.They were first published in year 1880, and translated into English in 1896 as a part of larger folkloristic study, but have never before been published as an independent work.♣ The book has a hundred woodcuts designed by Akseli Gallen-Kallela, a turn-of-the-century artist famous for his illustrations of Finnish folklore.♣ I have also used typefaces and ornaments designed by William Morris for the book.♣ The book is bound in quality artificial leather and decorated with foil stamping and blind embossing.♣ This is the first book of the Pagan Archive series, which will contain books on paganism, witchcraft, folklore and esoteric traditions. FINNISH:Salakirjojen kauan valmisteltu englanninkielinen kustannusprojekti alkaa Muinaisten Loitsurunojen käännöksen julkaisulla. Kirjan sisältämät 639 loitsua kattavat valtaosan alkuteoksen aineistosta, ja ne ovat käännetyt vuonna 1896 osana laajempaa suomensukuisten kansojen kansatieteellistä tutkimusta. Kirja on sidottu kokotekonahkakansiin ja koristeltu kulta- ja sokeapainatuksella. Kirja on kuvitettu Akseli Gallen-Kallelan puupiirroksin, ja siinä on käytetty William Morriksen suunnittelemia koriste- ja kirjasinmalleja.Pagan Archive -sarjassa tullaan julkaisemaan keskeisten vanhojen kansanperinteen ja muinaisuskon teosten kuvitettuja painoksia. Myöhemmässä vaiheessa kustannamme myös käännösteoksia osaksi sarjaa.Salakirjat / Pagan Archive, 2011",
  "genres": [
    "Nonfiction",
    "Witchcraft",
    "Folklore",
    "History"
  ],
  "author": "Elias Lönnrot",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/13583837-the-magic-songs-of-the-finns"
}