{
  "title": "Dr. Aa's Pennyroyal Tabules",
  "description": "‘Dr. Aa’s Pennyroyal Tabules’ is an uneasy story set in the easy-going summertime of Alston Island, on the coast of South Carolina in the 1920s.There, the unnamed narrator and her beautiful college friend Pennington Collins are joined by the three raucous Collins brothers, Dinah a young school teacher, a neighboring prude, a sweet-potato eating dog, and a tall, wise, doomed woman named Romola. Beach house parties are attended, biscuits are eaten, a mourners’ procession is watched, news articles are read aloud, contraception is sought, speculation of cave men’s lives is attempted, and the nature of lust is tested in theory, in practice, and beyond the bureaucratic boundaries of jurisprudence and healthcare systems.Enter the snake-oily Dr. Aa, blackmailing Dinah in regards to “obstinate obstruction” newly in her “female system,” and her related order for his illegal remedy. The Collins brothers confront Dr. Aa, which leads to a good thrashing of the villain, giving the narrator the opportunity to take a box of letters from the many women he is blackmailing.The friends understand they need to push back against the crooks and authorities who are proving detrimental to their health, and they write to all the women, despite the fact that the contents of their letters are in violation of Comstock “Be ware of sham operations which profit from terrorizing women via corrupted laws,” they advise.As a result, the postmaster from Savannah arrives at their house, and the friends decide to leave early for their trip to New York City, to attend the first American birth control conference— Pennington’s essay “Why I Shall Have It” already having been chosen for presentation during the conference organized by Margaret Sanger. The exploring they do in the big city, and the tragedy they endure at the end of the book, is a hopeful launching point to the rest of their lives.The novella features a prologue and a five-part epilogue, revealing five different points of view, from the 1920s to 2031. Newspaper articles, letters, and quotes give the first person narrative a multimedia aspect.This carefully researched and creative story explores the common and eternal dilemnas of kissing, childbearing, and the amazing circumstances that arise from love and consequences and more love.Lisa Annelouise Rentz lives on the South Carolina coast. Her short stories, essays, and illustrations have been published by the Oxford American, Liars' League London, Versal, Salon.com, Alternet.org, Skirt!, They Draw and Cook, Art from Art (Modernist Press), undefined, Etchings of Australia, You Are Here of the U. of Arizona, paysans sans peur press of Philadelphia, and more. Her arts education app, \"Pencils, Words & Kids\" was published by Sutro Media of San Francisco.",
  "genres": [],
  "author": "Lisa Annelouise Rentz",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/13583904-dr-aa-s-pennyroyal-tabules"
}