{
  "title": "And Live Rejoicing: Chapters from a Charmed Life: Personal Encounters with Spiritual Mavericks, Remarkable Seekers, and the World's Great Religious Leaders",
  "description": "Spiritual trailblazer Huston Smith has written comprehensive books about religion and a memoir of his own life, but nowhere has he merged the two elements of seeking and experience with such storytelling flair as he has in these pages. Few have done as much as Smith to explore and illuminate the world’s religions and spiritual traditions, and none have done it with such accessibility, wonder, and delight. In this joyous volume, he looks back on his extraordinary life, describing riveting scenes with unforgettable characters in India, Africa, Tibet, and Japan. Smith’s charm and exuberance come through on every page.Praise for And Live Rejoicing:“When I think of Huston Smith, the word radiance comes to mind. And that generous radiance shines through this extraordinary book — a tribute to his delight in the joy at the heart of things. He has had a reverence for and a delight in everyone he has met. Someone once wrote of Shakespeare’s immense intelligent charity. That’s Huston. His unique gift to us is the generous radiance of the joining of his sharp intellect with his universal spirit. At the same time, this book reveals the richness of the great spiritual traditions, which call us to be generously human. A healing and hilarious book for our time.”— Alan Jones, dean emeritus of Grace Cathedral, San Francisco, and honorary canon of the Cathedral of Our Lady of Chartres“One loves what Huston Smith brings to us as one loves an unfailing source of light and warmth. A book — a life — that nourishes the spirit as it opens the heart.” — Jacob Needleman, author of An Unknown World: Notes on the Meaning of the Earth“An enthusiastic discourse on authentic joy, and Smith’s joy resonates from every page. His missionary lineage and childhood in rural China...positioned him to look at life through a different lens. As he matured, he made a decision to use that lens to find the humanity at the heart of what he perceived. Humble, kind, and nonconforming, Smith gives readers the gift of observing through the obvious to the core of existence and the eternal spirit that is our birthright.”— Anna Jedrziewski, Retailing Insight",
  "genres": [
    "Nonfiction",
    "Religion"
  ],
  "author": "Huston Smith",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/13584781-and-live-rejoicing"
}