{
  "title": "The Emperor's Knife",
  "description": "There is a cancer at the heart of the mighty Cerani a plague that attacks young and old, rich and poor alike. Geometric patterns spread across the skin, until you die in agony, or become a Carrier, doing the bidding of an evil intelligence, the Pattern Master. Anyone showing the tell-tale marks is put to death; that is Emperor Beyon's law...but now the pattern is running over the Emperor's own arms. His body servants have been executed, he ignores his wives, but he is doomed, for soon the pattern will reach his face. While Beyon's agents scour the land for a cure, Sarmin, the Emperor's only surviving brother, awaits his bride, Mesema, a windreader from the northern plains. Unused to the Imperial Court's stifling protocols and deadly intrigues, Mesema has no one to turn to but an aging imperial assassin, the Emperor's Knife.As long-planned conspiracies boil over into open violence, the invincible Pattern Master appears from the deep desert. Only three people stand in his a lost prince, a world-weary killer, and a young girl from the steppes who once saw a path in a pattern — a path that might save them all.Skyhorse Publishing, under our Night Shade and Talos imprints, is proud to publish a broad range of titles for readers interested in science fiction (space opera, time travel, hard SF, alien invasion, near-future dystopia), fantasy (grimdark, sword and sorcery, contemporary urban fantasy, steampunk, alternative history), and horror (zombies, vampires, and the occult and supernatural), and much more. While not every title we publish becomes a New York Times bestseller, a national bestseller, or a Hugo or Nebula award-winner, we are committed to publishing quality books from a diverse group of authors.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Magic",
    "Epic Fantasy",
    "High Fantasy",
    "Epic",
    "Adult"
  ],
  "author": "Mazarkis Williams",
  "average_rating": "3.30",
  "url": "https://www.goodreads.com/book/show/13584817-the-emperor-s-knife"
}