{
  "title": "More Than Human",
  "description": "The year is 2190, and the first starship of Earth, the Gilgamesh, is plying between the homeworlds and the new world of Eidolon, a five-year flight at near-lightspeed. The \"starshippers\" have been idolized for many decades, since the first landing on Eidolon. They're \"augmented\" humans ... they've been modified for the work and for the new world. The public has envied them and emulated them -- and perhaps they have been emulated too much, too often. Eventually, perhaps inevitably, a political movement has begun back on Earth. Calling itself The Pure Light, its campaign is to \"Keep Humanity Human\" ... to stem the tide of the genetic modification that was steadily remaking humans into more and more different forms.Twenty years ago, The Pure Light rode into office on this ticket, and their policies have made the augmented humans illegal. They're now categorized as borgs, or cyborgs -- artificial life forms who do not have full human rights. The more augmented the individual, the less rights he or she has, and by the time one is a \"fifty\" -- one whose body is fifty percent modified -- one is registered, licensed, and control-chipped, in the possession of the government, and assigned to the military, industry or the lab.It's been more than twenty years since the Gilgamesh cruised into Earth space. At home on Eidolon, the crew are free -- many of them were bred and born there, designed for the new world and thriving there. Now, they're entering space where they're perceived as unwelcome aliens...And it's the job of Civil Representative Adrian Balfour to journey out to Titan Central, meet Captain Dirk Vanderhoven and his Executive Officer, Jason Erickson, and inform them that the crew of the Gilgamesh is to be taken into custody -- registered, licensed, control-chipped, and reassigned for the battlefield, the mines, the lab.But Adrian is nursing a secret agenda of his own, and everything in his cosmos changes the moment he sets eyes on young Jason Erickson. Almost before he knows what he's doing, he's lying to the Titan Central commander and life is set to become a race against time.Because Adrian is a \"twenty,\" and unwelcome even at home, while among the fifties of the starshipper crew he's respected, cherished -- and desired by at least one of them. Romance explodes between Adrian and Jason, white-hot and filled with the piquancy of exploration, as Adrian discovers how the humans of Eidolon are different in every way from the Earthborns, most of all in their sensuality.For Adrian, the next days are critical. He'll be \"tested\" by the big, beautiful fifty with whom he's fallen deeply in love, and he'll risk everything in the desperate attempt to get the Gilgamesh out of Earth space before warships can run her down, and The Pure Light will turn starshippers into control-chipped drones.",
  "genres": [
    "Science Fiction",
    "M M Romance",
    "M M Science Fiction",
    "LGBT",
    "Romance",
    "Science Fiction Fantasy",
    "Gay"
  ],
  "author": "Mel Keegan",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/13586540-more-than-human"
}