{
  "title": "Never Look a Polar Bear in the Eye: A Family Field Trip to the Arctic's Edge in Search of Adventure, Truth, and Mini-Marshmallows",
  "description": "\"I like to go out for walks, but it's a little awkward to push the baby stroller and carry a shotgun at the same time.\"--housewife from Churchill, Manitoba Yes, welcome to Churchill, Manitoba. Year-round human population: 943. Yet despite the isolation and the searing cold here at the arctic's edge, visitors from around the globe flock to the town every fall, driven by a single purpose: to see polar bears in the wild.Churchill is \"The Polar Bear Capital of the World,\" and for one unforgettable \"bear season,\" Zac Unger, his wife, and his three children moved from Oakland, California, to make it their temporary home. But they soon discovered that it's really the polar bears who are at home in Churchill, roaming past the coffee shop on the main drag, peering into garbage cans, languorously scratching their backs against fence posts and front doorways. Where kids in other towns receive admonitions about talking to strangers, Churchill schoolchildren get \"Let's All Be Bear Aware\" booklets to bring home. (Lesson number 8: Never explore bad-smelling areas.)Zac Unger takes readers on a spirited and often wildly funny journey to a place as unique as it is remote, a place where natives, tourists, scientists, conservationists, and the most ferocious predators on the planet converge. In the process he becomes embroiled in the controversy surrounding \"polar bear science\"--and finds out that some of what we've been led to believe about the bears' imminent extinction may not be quite the case. But mostly what he learns is about human behavior in extreme situations . . . and also why you should never even think of looking a polar bear in the eye.",
  "genres": [
    "Nonfiction",
    "Animals",
    "Memoir",
    "Travel",
    "Wildlife",
    "Environment",
    "Adventure"
  ],
  "author": "Zac Unger",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/13587159-never-look-a-polar-bear-in-the-eye"
}