{
  "title": "The Child Catchers: Rescue, Trafficking, and the New Gospel of Adoption",
  "description": "When Jessie Hawkins’ adopted daughter told her she had another mom back in Ethiopia, Jessie didn’t, at first, know what to think. She’d wanted her adoption to be great story about a child who needed a home and got one, and a family led by God to adopt. Instead, she felt like she’d done something wrong.Adoption has long been enmeshed in the politics of reproductive rights, pitched as a “win-win” compromise in the never-ending abortion debate. But as Kathryn Joyce makes clear in The Child Catchers, adoption has lately become even more entangled in the conservative Christian agenda.To tens of millions of evangelicals, adoption is a new front in the culture wars: a test of “pro-life” bona fides, a way for born again Christians to reinvent compassionate conservatism on the global stage, and a means to fulfill the “Great Commission” mandate to evangelize the nations. Influential leaders fervently promote a new “orphan theology,” urging followers to adopt en masse, with little thought for the families these “orphans” may already have.Conservative evangelicals control much of that industry through an infrastructure of adoption agencies, ministries, political lobbying groups, and publicly-supported “crisis pregnancy centers,” which convince women not just to “choose life,” but to choose adoption. Overseas, conservative Christians preside over a spiraling boom-bust adoption market in countries where people are poor and regulations weak, and where hefty adoption fees provide lots of incentive to increase the “supply” of adoptable children, recruiting “orphans” from intact but vulnerable families.The Child Catchers is a shocking exposé of what the adoption industry has become and how it got there, told through deep investigative reporting and the heartbreaking stories of individuals who became collateral damage in a market driven by profit and, now, pulpit command.Anyone who seeks to adopt—of whatever faith or no faith, and however well-meaning—is affected by the evangelical adoption movement, whether they know it or not. The movement has shaped the way we think about adoption, the language we use to discuss it, the places we seek to adopt from, and the policies and laws that govern the process. In The Child Catchers, Kathryn Joyce reveals with great sensitivity and empathy why, if we truly care for children, we need to see more clearly.",
  "genres": [
    "Nonfiction",
    "Adoption",
    "Religion",
    "Politics",
    "History",
    "Parenting",
    "Sociology"
  ],
  "author": "Kathryn Joyce",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/13587133-the-child-catchers"
}