{
  "title": "Permanent Present Tense: The Unforgettable Life of the Amnesic Patient, H. M.",
  "description": "In 1953, 27-year-old Henry Gustave Molaison underwent an \"experimental psychosurgical\" procedure—a targeted lobotomy—in an effort to alleviate his debilitating epilepsy. The outcome was unexpected—when Henry awoke, he could no longer form new memories, and for the rest of his life would be trapped in the moment. But Henry’s tragedy would prove a gift to humanity. As renowned neuroscientist Suzanne Corkin explains in Permanent Present Tense, she and her colleagues brought to light the sharp contrast between Henry’s crippling memory impairment and his preserved intellect. This new insight that the capacity for remembering is housed in a specific brain area revolutionized the science of memory. The case of Henry—known only by his initials H. M. until his death in 2008—stands as one of the most consequential and widely referenced in the spiraling field of neuroscience. Corkin and her collaborators worked closely with Henry for nearly fifty years, and in Permanent Present Tense she tells the incredible story of the life and legacy of this intelligent, quiet, and remarkably good-humored man. Henry never remembered Corkin from one meeting to the next and had only a dim conception of the importance of the work they were doing together, yet he was consistently happy to see her and always willing to participate in her research. His case afforded untold advances in the study of memory, including the discovery that even profound amnesia spares some kinds of learning, and that different memory processes are localized to separate circuits in the human brain. Henry taught us that learning can occur without conscious awareness, that short-term and long-term memory are distinct capacities, and that the effects of aging-related disease are detectable in an already damaged brain.Undergirded by rich details about the functions of the human brain, Permanent Present Tense pulls back the curtain on the man whose misfortune propelled a half-century of exciting research. With great clarity, sensitivity, and grace, Corkin brings readers to the cutting edge of neuroscience in this deeply felt elegy for her patient and friend.",
  "genres": [
    "Nonfiction",
    "Science",
    "Psychology",
    "Biography",
    "Neuroscience",
    "Medicine",
    "Medical"
  ],
  "author": "Suzanne Corkin",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/13587193-permanent-present-tense"
}