{
  "title": "Martha Stewart's Baking Handbook",
  "description": "Every new book from Martha Stewart is cause for celebration, and with Martha Stewart s Baking Handbook, she returns to bring the pleasures of baking to readers at every level, from beginner to expert and beyond. A culinary compendium packed with more than 200 foolproof recipes for the best baked goods, Martha Stewart s Baking Handbook takes readers by the hand and guides them through the process of creating an irresistible variety of cakes, cookies, pies, tarts, breads, and much more. This essential addition to every cook s library is rich with tips, techniques, and the mouthwatering and stunning recipes for which Martha Stewart is so well known. Covering a delectable array of topics from simple to sophisticated, including biscuits, muffins, scones, cookies, layer cakes, specialty cakes, sweet and savory pies and tarts, and pastries and breads, she provides a dazzlingly delicious yet crystal-clear, vividly illustrated repertoire of recipes. There are cakes that are elegant enough for formal occasions, such as showers, weddings, and dinner parties, and basic favorites meant to be enjoyed every day and then passed down through the generations. Every chapter includes indispensable visual equipment glossaries and features vital make-ahead information and storage techniques. Organized for maximum clarity and practicality, the handbook also offers step-by-step how-to photographs that demystify even the most complex and nuanced techniques. These culinary building blocks will turn good bakers into great bakers, and make great bakers even better. Filled with time-honored classics, such as Marble Cake with White-Chocolate Glaze, Apple Pie, Challah, Baba au Rhum, and Croissants, as well as lots of new surprises,  Martha Stewart s Baking Handbook will be reached for again and again, no matter the season or occasion. Here, you will find the recipes and how-tos for the popovers you dream about, and for the simple crumb cake that you always want to whip up on Sunday morning, and for the double-chocolate brownie cookies that will make you a bigger hero with the after-school crowd, and for the citrus bars that you could only find in that little bakery that s no longer under the same management. . . . Baking offers comfort and joy and something tangible to taste and savor. We all hope that these recipes provide you with years of pleasure.  Martha Stewart\"",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction",
    "Reference",
    "Foodie",
    "Culinary"
  ],
  "author": "Martha Stewart",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/135875.Martha_Stewart_s_Baking_Handbook"
}