{
  "title": "Dead Stars",
  "description": "Dead Stars is Bruce Wagner’s ( I'm Losing You) most lavish and remarkable translation yet of the national post-privacy porn culture, a Kardashianworld of rapid-cycling, disposable narrative where reality-show triumph is the new American narcotic. At age thirteen, Telma is famous as the world’s youngest breast cancer survivor until threatened with obscurity by a four-year-old Canadian who’s just undergone a mastectomy … Reeyonna believes that auditioning for pregnant-teen porn online will help fulfill her dream of befriending Jennifer Lawrence and Kanye West … Biggie, the neurologically impaired adolescent son of a billionaire, spends his days Google Map-searching his mother-who abandoned home and family for a new love … Jacquie, a photographer once celebrated for taking arty nudes of her young daughter, is broke and working at Sears Family Portrait Boutique … Tom-Tom, a singer/drug dealer thrown off the third season of American Idol for concocting a hard-luck story, is hell-bent on creating her own TV series in the Hollywood Hills, peopled by other reality-show losers … Jerzy, her sometime lover, is a speed-freak paparazzo who “specializes” in capturing images of dying movie and television stars … And Oscar-winning Michael Douglas searches for meaning in his time of remission. While his wife, Catherine, guest-stars on Glee , the actor plans a bold, artistic, go-for-broke to star in and direct a remake of Bob Fosse’s All That Jazz… There is nothing quite like a Bruce Wagner novel. His prose is captivating and exuberant, and surprises with profound truths on spirituality, human nature, and redemption.  Dead Stars moves forward with the inexorable force of a tsunami, sweeping everyone in its fateful path. With its mix of imaginary and real-life characters, it is certain to be the most challenging, knowing, and controversial book of the year.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Media Tie In",
    "Novels",
    "Unfinished",
    "Modern"
  ],
  "author": "Bruce Wagner",
  "average_rating": "3.13",
  "url": "https://www.goodreads.com/book/show/13588121-dead-stars"
}