{
  "title": "This Indian Country: American Indian Activists and the Place They Made",
  "description": "Frederick E. Hoxie, one of our most prominent and celebrated academic historians of Native American history, has for years asked his undergraduate students at the beginning of each semester to write down the names of three American Indians. Almost without exception, year after year, the names are Geronimo, Sitting Bull and Crazy Horse. The general conclusion is inescapable: Most Americans instinctively view Indians as people of the past who occupy a position outside the central narrative of American history. These three individuals were warriors, men who fought violently against American expansion, lost, and died. It’s taken as given that Native history has no particular relationship to what is conventionally presented as the story of America. Indians had a history too; but theirs was short and sad, and it ended a long time ago.  In This Indian Country, Hoxie has created a bold and sweeping counter-narrative to our conventional understanding. Native American history, he argues, is also a story of political activism, its victories hard-won in courts and campaigns rather than on the battlefield. For more than two hundred years, Indian activists—some famous, many unknown beyond their own communities—have sought to bridge the distance between indigenous cultures and the republican democracy of the United States through legal and political debate. Over time their struggle defined a new language of “Indian rights” and created a vision of American Indian identity. In the process, they entered a dialogue with other activist movements, from African American civil rights to women’s rights and other progressive organizations. Hoxie weaves a powerful narrative that connects the individual to the tribe, the tribe to the nation, and the nation to broader historical processes. He asks readers to think deeply about how a country based on the values of liberty and equality managed to adapt to the complex cultural and political demands of people who refused to be overrun or ignored. As we grapple with contemporary challenges to national institutions, from inside and outside our borders, and as we reflect on the array of shifting national and cultural identities across the globe, This Indian Country provides a context and a language for understanding our present dilemmas.",
  "genres": [
    "History",
    "Native American",
    "Native Americans",
    "Native American History",
    "American History",
    "Nonfiction",
    "Politics"
  ],
  "author": "Frederick E. Hoxie",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/13588393-this-indian-country"
}