{
  "title": "Netflixed: The Epic Battle for America's Eyeballs",
  "description": "Netflix has come a long way since 1997, when two Silicon Valley entrepreneurs, Marc Ran足dolph and Reed Hastings, decided to start an online DVD store before most people owned a DVD player. They were surprised and elated when launch-day traffic in April 1998 crashed their server and resulted in 150 sales. Today, Netflix has more than 25 million subscribers and annual revenues above $3 billion. Yet long- term success-or even survival-is still far from guaranteed. Journalist Gina Keating recounts the absorbing, fast-paced drama of the company's turbulent rise to the top and its attempt to invent two new kinds of business. First it engaged in a grueling war against video-store behemoth Blockbuster, transforming movie rental forever. Then it jumped into an even bigger battle for online video streaming against Google, Hulu, Amazon, and the big cable companies. Netflix ushered in such innovations as DVD rental by mail, a patented online queue of upcom足ing rentals, and a recommendation algorithm called Cinematch that proved crucial in its struggle against bigger rivals. Yet for all its success, Netflix is still a polariz足ing company. Hastings is often heralded as a visionary-he was named Business Person of the Year in 2010 by Fortune-even as he has been called the nation's worst CEO. Netflix also faces disgruntled customers after price increases and other stumbles that could tarnish the brand forever. The quest to become the world's portal for pre足mium video on demand will determine nothing less than the future of entertainment and the Internet. Drawing on extensive new interviews and her years covering Netflix as a financial and entertainment reporter, Keating makes this tale as absorbing as it is important.",
  "genres": [
    "Business",
    "Nonfiction",
    "Technology",
    "History",
    "Management",
    "Film",
    "Biography"
  ],
  "author": "Gina Keating",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/13588384-netflixed"
}