{
  "title": "The Chemistry Between Us: Love, Sex, and the Science of Attraction",
  "description": "How much control do we have over love? Much less than we like to think. All that mystery, all that poetry, all those complex behaviors sur­rounding human bonding leading to the most life-changing decisions we’ll ever make, are unconsciously driven by a few molecules in our brain. How does love begin? How can two strangers come to the conclusion that it would not only be pleasant to share their lives, but that they must share them? How can a man say he loves his wife, yet still cheat on her? Why do others stay in relationships even after the ro­mance fades? How is it possible to fall in love with the “wrong” person? How do people come to have a “type”? Physical attraction, jealousy, infidelity, mother-infant bonding—all the behaviors that so often leave us befuddled—are now being teased out of the fog of mystery thanks to today’s social neuroscience. Larry Young, one of the world’s leading experts in the field, and journalist Brian Alexander explain how those findings apply to you. Drawing on real human stories and research from labs around the world, The Chemistry Between Us is a bold attempt to create a “grand unified theory” of love. Some of the mind-blowing insights include:Love can get such a grip on us because it is, literally, an addiction. To a woman falling in love, a man is like her baby. Why it’s false to say society makes gender, and how it’s possible to have the body of one gender and the brain of another.Why some people are more likely to cheat than others. Why we sometimes truly can’t resist temptation.  Young and Alexander place their revelations into historical, political, and social contexts. In the pro­cess, they touch on everything from gay marriage to why single-mother households might not be good for society. The Chemistry Between Us offers powerful in­sights into love, sex, gender, sexual orientation, and family life that will prove to be enlightening, contro­versial, and thought provoking.",
  "genres": [
    "Nonfiction",
    "Science",
    "Psychology",
    "Relationships",
    "Sexuality",
    "Biology",
    "Audiobook"
  ],
  "author": "Larry Young",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/13588415-the-chemistry-between-us"
}