{
  "title": "There Was a Country: A Personal History of Biafra",
  "description": "From the legendary author of Things Fall Apart comes a longawaited memoir about coming of age with a fragile new nation, then watching it torn asunder in a tragic civil warThe defining experience of Chinua Achebe’s life was the Nigerian civil war, also known as the Biafran War, of 1967–1970. The conflict was infamous for its savage impact on the Biafran people, Chinua Achebe’s people, many of whom were starved to death after the Nigerian government blockaded their borders. By then, Chinua Achebe was already a world-renowned novelist, with a young family to protect. He took the Biafran side in the conflict and served his government as a roving cultural ambassador, from which vantage he absorbed the war’s full horror. Immediately after, Achebe took refuge in an academic post in the United States, and for more than forty years he has maintained a considered silence on the events of those terrible years, addressing them only obliquely through his poetry. Now, decades in the making, comes a towering reckoning with one of modern Africa’s most fateful events, from a writer whose words and courage have left an enduring stamp on world literature.Achebe masterfully relates his experience, both as he lived it and how he has come to understand it. He begins his story with Nigeria’s birth pangs and the story of his own upbringing as a man and as a writer so that we might come to understand the country’s promise, which turned to horror when the hot winds of hatred began to stir. To read There Was a Country is to be powerfully reminded that artists have a particular obligation, especially during a time of war. All writers, Achebe argues, should be committed writers—they should speak for their history, their beliefs, and their people.Marrying history and memoir, poetry and prose, There Was a Country is a distillation of vivid firsthand observation and forty years of research and reflection. Wise, humane, and authoritative, it will stand as definitive and reinforce Achebe’s place as one of the most vital literary and moral voices of our age.",
  "genres": [
    "Nonfiction",
    "History",
    "Africa",
    "Nigeria",
    "Memoir",
    "Biography",
    "African Literature"
  ],
  "author": "Chinua Achebe",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/13588385-there-was-a-country"
}