{
  "title": "Improvising Medicine: An African Oncology Ward in an Emerging Cancer Epidemic",
  "description": "In Improvising Medicine, Julie Livingston tells the story of Botswana's only dedicated cancer ward, located in its capital city of Gaborone. This affecting ethnography follows patients, their relatives, and ward staff as a cancer epidemic emerged in Botswana. The epidemic is part of an ongoing surge in cancers across the global south; the stories of Botswana's oncology ward dramatize the human stakes and intellectual and institutional challenges of an epidemic that will shape the future of global health. They convey the contingencies of high-tech medicine in a hospital where vital machines are often broken, drugs go in and out of stock, and bed-space is always at a premium. They also reveal cancer as something that happens between people. Serious illness, care, pain, disfigurement, and even death emerge as deeply social experiences. Livingston describes the cancer ward in terms of the bureaucracy, vulnerability, power, biomedical science, mortality, and hope that shape contemporary experience in southern Africa. Her ethnography is a profound reflection on the social orchestration of hope and futility in an African hospital, the politics and economics of healthcare in Africa, and palliation and disfigurement across the global south.Julie Livingston is Associate Professor of History at Rutgers University. She is the author of Debility and the Moral Imagination in Botswana and a coeditor of Three Shots at Prevention: The HPV Vaccine and the Politics of Medicine's Simple Solutions and A Death Retold: Jesica Santillan, the Bungled Transplant, and Paradoxes of Medical Citizenship.\"Improvising Medicine is as good as it gets. It is a book that will be read for decades to come. I have always thought that great ethnography transcends the specificities of time and place, of the particular, to offer a glimpse of the universal. This gripping book does just that, and the subtle and grounded way that it speaks to global health and debates in medical anthropology makes it a major addition to both fields.\"—Vinh-Kim Nguyen, M.D., author of The Republic of Therapy: Triage and Sovereignty in West Africa's Time of AIDS“Improvising Medicine is a luminous book by a highly respected Africanist whose work creatively bridges anthropology and history. A product of intense listening and observation, deep care, and superb analytical work, it will become a canonical ethnography of medicine in the global south and will have a big impact across the social sciences and medical humanities.”—João Biehl, author of Will to Live: AIDS Therapies and the Politics of Survival and Vita: Life in a Zone of Social Abandonment",
  "genres": [
    "Anthropology",
    "Nonfiction",
    "Medicine",
    "Africa",
    "School",
    "Medical",
    "History Of Medicine"
  ],
  "author": "Julie Livingston",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/13588707-improvising-medicine"
}