{
  "title": "A Working Theory of Love",
  "description": "Settled back into the San Francisco singles scene following the implosion of his young marriage just months after the honeymoon, Neill Bassett is going through the motions. His carefully modulated routine, however, is soon disrupted in ways he can’t dismiss with his usual nonchalance.When Neill’s father committed suicide ten years ago, he left behind thousands of pages of secret journals, journals that are stunning in their detail, and, it must be said, their complete banality. But their spectacularly quotidian details, were exactly what artificial intelligence company Amiante Systems was looking for, and Neill was able to parlay them into a job, despite a useless degree in business marketing and absolutely no experience in computer science. He has spent the last two years inputting the diaries into what everyone hopes will become the world’s first sentient computer. Essentially, he has been giving it language—using his father’s words. Alarming to Neill—if not to the other employees of Amiante—the experiment seems to be working. The computer actually appears to be gaining awareness and, most disconcerting of all, has started asking questions about Neill’s childhood.Amid this psychological turmoil, Neill meets Rachel. She was meant to be a one-night stand, but Neill is unexpectedly taken with her and the possibilities she holds. At the same time, he remains preoccupied by unresolved feelings for his ex-wife, who has a talent for appearing at the most unlikely and unfortunate times. When Neill discovers a missing year in the diaries—a year that must hold some secret to his parents’ marriage and perhaps even his father’s suicide—everything Neill thought he knew about his past comes into question, and every move forward feels impossible to make.With a lightness of touch that belies pitch-perfect emotional control, Scott Hutchins takes us on an odyssey of love, grief, and reconciliation that shows us how, once we let go of the idea that we’re trapped by our own sad histories—our childhoods, our bad decisions, our miscommunications with those we love—we have the chance to truly be free. A Working Theory of Love marks the electrifying debut of a prodigious new talent.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Romance",
    "Science Fiction",
    "Literary Fiction",
    "Novels",
    "Adult Fiction"
  ],
  "author": "Scott Hutchins",
  "average_rating": "3.28",
  "url": "https://www.goodreads.com/book/show/13588444-a-working-theory-of-love"
}