{
  "title": "The Generals: American Military Command from World War II to Today",
  "description": "From the #1 bestselling author of Fiasco and The Gamble , an epic history of the decline of American military leadership from World War II to IraqHistory has been kind to the American generals of World War II—Marshall, Eisenhower, Patton, and Bradley—and less kind to the generals of the wars that followed. In The Generals , Thomas E. Ricks sets out to explain why that is. In part it is the story of a widening gulf between performance and accountability. During the Second World War, scores of American generals were relieved of command simply for not being good enough. Today, as one American colonel said bitterly during the Iraq War, “As matters stand now, a private who loses a rifle suffers far greater consequences than a general who loses a war.” In The Generals we meet great leaders and suspect ones, generals who rose to the occasion and those who failed themselves and their soldiers. Marshall and Eisenhower cast long shadows over this story, as does the less familiar Marine General O. P. Smith, whose fighting retreat from the Chinese onslaught into Korea in the winter of 1950 snatched a kind of victory from the jaws of annihilation.But Korea also showed the first signs of an army leadership culture that neither punished mediocrity nor particularly rewarded daring. In the Vietnam War, the problem grew worse until, finally, American military leadership bottomed out. The My Lai massacre, Ricks shows us, is the emblematic event of this dark chapter of our history. In the wake of Vietnam a battle for the soul of the U.S. Army was waged with impressive success. It became a transformed institution, reinvigorated from the bottom up. But if the body was highly toned, its head still suffered from familiar problems, resulting in tactically savvy but strategically obtuse leadership that would win battles but end wars badly from the first Iraq War of 1990 through to the present.Ricks has made a close study of America’s military leaders for three decades, and in his hands this story resounds with larger meaning: about the transmission of values, about strategic thinking, and about the difference between an organization that learns and one that fails.",
  "genres": [
    "History",
    "Military Fiction",
    "Nonfiction",
    "Military History",
    "War",
    "Leadership",
    "American History"
  ],
  "author": "Thomas E. Ricks",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/13588432-the-generals"
}