{
  "title": "China Road: A Journey into the Future of a Rising Power",
  "description": "Route 312 is the Chinese Route 66. It flows three thousand miles from east to west, passing through the factory towns of the coastal areas, through the rural heart of China, then up into the Gobi Desert, where it merges with the Old Silk Road. The highway witnesses every part of the social and economic revolution that is turning China upside down.In this utterly surprising and deeply personal book, acclaimed National Public Radio reporter Rob Gifford, a fluent Mandarin speaker, takes the dramatic journey along Route 312 from its start in the boomtown of Shanghai to its end on the border with Kazakhstan. Gifford reveals the rich mosaic of modern Chinese life in all its contradictions, as he poses the crucial questions that all of us are asking about Will it really be the next global superpower? Is it as solid and as powerful as it looks from the outside? And who are the ordinary Chinese people, to whom the twenty-first century is supposed to belong?Gifford is not alone on his journey. The largest migration in human history is taking place along highways such as Route 312, as tens of millions of people leave their homes in search of work. He sees signs of the booming urban economy everywhere, but he also uncovers many of the country’s frailties, and some of the deep-seated problems that could derail China’s rise.The whole compelling adventure is told through the cast of colorful characters Gifford garrulous talk-show hosts and ambitious yuppies, impoverished peasants and tragic prostitutes, cell-phone salesmen, AIDS patients, and Tibetan monks. He rides with members of a Shanghai jeep club, hitchhikes across the Gobi desert, and sings karaoke with migrant workers at truck stops along the way.As he recounts his travels along Route 312, Rob Gifford gives a face to what has historically, for Westerners, been a faceless country and breathes life into a nation that is so often reduced to economic statistics. Finally, he sounds a warning that all is not well in the Chinese heartlands, that serious problems lie ahead, and that the future of the West has become inextricably linked with the fate of 1.3 billion Chinese people.“Informative, delightful, and powerfully moving . . . Rob Gifford’s acute powers of observation, his sense of humor and adventure, and his determination to explore the wrenching dilemmas of China’s explosive development open readers’ eyes and reward their minds.”–Robert A. Kapp, president, U.S.-China Business Council, 1994-2004",
  "genres": [
    "China",
    "Nonfiction",
    "Travel",
    "History",
    "Asia",
    "Politics",
    "Audiobook"
  ],
  "author": "Rob Gifford",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/1042203.China_Road"
}