{
  "title": "Nekhet",
  "description": "In Nekhet, the sequel to the critically-acclaimed Reswyt, Sabine Jahn’s finally asleep – and finding that things in the dreaming realm have changed for the worse. The war has settled into an uneasy stalemate, with the Jager now in a defensive posture behind the great chasm created by Brummbar to protect them from the Queen’s armies. Dylan, now among the horses, finds their mysterious leader steadfastly unwilling to enter into the conflict on either side – and without their aid, the Jager are unable to break out from their positions. Suspecting that the Queen’s Artifex is designing even more destructive weapons for the Queen’s army, Dylan encourages Sabine to remove him from the Queen's employ by any means necessary. But while Sabine, Josh, and Dylan join forces to awaken the Queen’s Artifex, Sabine is unaware that one of the Queen’s agents is hunting her here on Earth – setting up a breathtaking race against time that will keep readers turning pages to the very end.\"Unafraid to challenge the reader from time to time, Nekhet is a smart, crisply-written work, with a serpentine plot sure to delight intelligent readers, and characters that once again benefit from Mayer’s commitment to backstory. It’s the work of an author discovering the joy of taking a premise to its full potential, and it’s a spine-tingling, breathless read. Highly recommended.\" - Rebecca Hardy, Bibliotica“From the opening chapter, Nekhet announces that it is far superior to the current publisher-driven YA offerings. The series departs from fantasy cliché, into much fresher and more fascinating areas — such as the conflicts and complexities inherent in the meeting of technology and magic. You’ll find here more finely crafted writing, more baroquely rich world-building, all woven around ideas about dreams and Egyptology…this is a beautiful and dense work which clearly shows why novels can play more glitteringly in the mind than any of the baubles offered by Hollywood or videogames.” - David Haden, KindleBlog",
  "genres": [],
  "author": "David  Mayer",
  "average_rating": "4.73",
  "url": "https://www.goodreads.com/book/show/13589904-nekhet"
}