{
  "title": "Confessions of a Cake Addict",
  "description": "Londoner Kate Pickles has hit rock bottom. She's funny, kind, and talented but totally unaware about all the great things she has going for her. Day in and day out, she sits back and whines to her sister Laurie in Sydney, Australia, as her boss walks all over her and her best friend Eva bags the hot guys while Kate ends up dating whack jobs and comfort eating cake. Pouring out her heart to Laurie in a series of letters and emails, Kate longs for her sister to confirm she really is the loser in love she fears she is.Abruptly, Kate's life is turned upside down when, on a trip to Vienna with her glamorous pal, Eva, Kate falls for a sexy Austrian and gets sucked into making a Bollywood film.CHARACTERSThe story unfolds in a series of letters and emails between overweight, insecure Gherkin (Kate) who lives in London, is tortured by her boss The Haddock at the advertising agency she works at and whos life has generally hit the skids since she split up with her long term boyfriend and has started dating a string of losers. Whenever things go wrong she muffles her feelings with cake.Her sister Egg (Laurie) lives a perfect life in Sydney, Australia, is happily married and has two perfect, high achieving kids. However, the kids do leave her frazzled so she enjoys dipping into Kate's messy life and living vicariously through her romantic disasters but can't resist giving her dollops of sisterly advice. Laurie pulls no punches when commenting on Kate's bad life choices and echoes the reader's sentiments that zany, kooky Kate really needs to get a life. Laurie is a refreshing burst of reality, cutting through Kate's delusions and encouraging her to lose weight and go for it with Count Alex von Pappenberg when she's scared to be vulnerable.Alex von Pappenberg, is a handsome but sensitive Austrian Count who is similarly disillusioned with life and love as Kate and lying low in the Austrian sticks in his Schloss. Like Kate he is stuck in life - his once successful vineyard has gone bankrupt and he's too unmotivated to start it up again. When Kate arrives at his Schloss as part of the entourage making a Bollywood movie Alex is determined to win her love but scared to make a move himself. Readers will enjoy seeing two insecure people grow to the point where they can take a chance on finding love again and facing the challenges of the future together!SELECTED QUOTES“Instead of leaning forward and brushing his lips against mine, he says, \"I know we got off to a bad start but I've thought about you a lot. I think you're very sweet.\" Sweet? I'm not sure I want to be called sweet. Sexy, bawdy, horny, hell, I'll even take voluptuous at a pinch. But sweet, it makes me feel like I'm a little girl who he wants to look after.”\"A half naked man, trousers rolled up to his knees, is ankle deep in water, which he’s scooping into a bucket before pouring down the sink.I take a few steps back, and bump into Eva who’s busy watching him. Sweat is dripping down his back, due to his hearty exertions.\"IDEAL READERIf you enjoy stories about hot holiday romances you'll enjoy this. It's aimed at women aged about 20-40 who are adventurous and full of fun who are tired of romance 'bodice-rippers' with their formulaic plots and unrealistic heros. If you're looking to be entertained by a romantic comedy that's chock full of quirky characters and hilarious situations then you'll love Confessions of a Cake Addict!People who like Authors such as Marian Keyes, Sophie Kinsella, Jenny Colgan & Lisa Jewell will find this 'just their cup of tea' and a cake to go with it.NB. This book is targetted towards adults. There are occasional words that may be considered as bad language.",
  "genres": [
    "Chick Lit",
    "Humor",
    "Romance",
    "Fiction",
    "Contemporary"
  ],
  "author": "Emma Kaufmann",
  "average_rating": "3.08",
  "url": "https://www.goodreads.com/book/show/13589811-confessions-of-a-cake-addict"
}