{
  "title": "Kill the Company",
  "description": "In the ever-changing world of business, we’ve arrived at a point where process has trumped culture, where the race toward efficiency has made us complacent and unable to reach our potential. Stuck in the land of status quo, we’ve forgotten how to think. And the very structures put in place to help businesses grow are now holding them back. It’s time to Kill the Company.This book is a call to arms: to start a revolution in how we think and work. But instead of more one-size-fits-all change initiatives forced upon employees, we need to embrace smaller, positive behavioral changes that create ripple effects throughout the organization. Thinking can no longer be exclusive to the creative team or lead strategists. Rather, a culture of curiosity must be fostered among the ranks to shake up our standard practices, from unproductive meetings to go-nowhere strategic planning. This revolution can and will awaken our ability to think, and ultimately, to innovate and grow.In Kill the Company, innovation specialist Lisa Bodell urges companies to shift the mindset from business as usual to the company of the future, to move from what she calls “Zombies, Inc.” to “Think, Inc.” This involves both risk and trust: to allow all employees the opportunity and environment to be curious and inquisitive—even challenging and provocative when the situation calls for it. Too often, this type of behavior is seen as threatening, says Bodell, who has actually been told by CEOs that they discourage employees from thinking. In step with the call to Kill the Company, is a plea to kill fear, complacency, and the all-too-familiar answer from our leaders: “I can’t be bothered with your (perhaps brilliant) idea.”Bodell also looks at how we got to Zombies, Inc., exploring how our educational system contributes to the lack of inquiry and problem-solving skills, showing how conformity is rewarded early on. She also draws from the work of such education luminaries as Sir Ken Robinson and the groundbreaking Blue School (founded by members of the Blue Man Group).In the end, readers of Kill the Company will have a full sense of how much riskier it is to stay here in the status quo than to break out and think.",
  "genres": [
    "Business",
    "Nonfiction",
    "Leadership",
    "Management",
    "Buisness"
  ],
  "author": "Lisa Bodell",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/13590437-kill-the-company"
}