{
  "title": "Stella!: A Treasury",
  "description": "Marie-Louise Gay published Stella, Star of the Sea more than ten years ago. It was an immediate hit, and since then she has written and illustrated four more books featuring the engaging, red-headed heroine Stella and her little brother, Sam — Stella, Queen of the Snow ; Stella, Fairy of the Forest ; Stella, Princess of the Sky and, most recently, When Stella Was Very, Very Small . With gentle humor, freshness, a sense of whimsy and exquisite watercolors, Marie-Louise Gay gives us stories about two young siblings discovering their world. Here at last are all five books bound into one delightful volume.When Stella Was Very, Very Small“When Stella was very, very small, she thought she was a turtle. She also thought that trees could talk and that words were like ants running off the pages of her books.”This is the story of a lovely tiny Stella, whose world is full of small adventures and slivers of magic. And she delights in sharing it all with Sam when he comes along.Stella, Star of the SeaStella and Sam are spending the day at the sea. Stella has been to the sea before and knows all its secrets, but Sam has many questions...and Stella has an answer for them all. The only thing she isn’t sure of, and neither are we, is whether Sam will ever come into the water.Stella, Queen of the SnowWinter was never so magical as in this marvelous book about Stella and Sam discovering a familiar landscape transformed by a heavy snowfall. Stella delights in showing Sam the many pleasures of a beautiful winter’s day, from skating and sledding to making snow angels in a fluffy, white magical world.Stella, Fairy of the ForestLittle brother Sam wonders whether fairies are invisible. Stella assures him that she has seen hundreds of them and says that if she and Sam venture across the meadow and into the forest, they are likely to find some. But Sam surprises Stella and himself by having a few ideas of his own — ideas that ensure a wonderful end to a perfect day in the woods.Stella, Princess of the SkyStella and Sam explore the wonders of the natural world. A vast luminous sky, the sun, the stars and the rising moon form the backdrop for their nocturnal expedition. As they encounter raccoons, fireflies, tree frogs and bats, Sam wonders if the moon can swim, if the sun wears pajamas or if he can catch shooting stars with his butterfly net. Stella, as always, has an answer for every question.",
  "genres": [
    "Childrens",
    "Picture Books",
    "Canada"
  ],
  "author": "Marie-Louise Gay",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/13590681-stella"
}