{
  "title": "Economix: How and Why Our Economy Works (and Doesn't Work), in Words and Pictures",
  "description": "Stimulus plans: good or bad? Free markets: How free are they? Jobs: Can we afford them? Occupy Wall Street . . . worldwideEverybody's talking about the economy, but how can we, the people, understand what Wall Street or Washington knows--or say they know? Read \"Economix.\"With clear, witty writing and quirky, accessible art, this important and timely graphic novel transforms \"the dismal science\" of economics into a fun, fact-filled story about human nature and our attempts to make the most of what we've got . . . and sometimes what our neighbors have got. \"Economix \"explains it all, from the beginning of Western economic thought, to markets free and otherwise, to economic failures, successes, limitations, and future possibilities. It's the essential, accessible guide to understanding the economy and economic practices. A must-read for every citizen and every voter.PRAISE FOR \"ECONOMIX\"\"It's simply phenomenal. You could read ten books on the subject and not glean as much information.\"-- David Bach founder of FinishRich Media; author of nine \"New York Times\" bestsellers, including \"Debt Free for Life\" and \"The Automatic Millionaire\" \"Goodwin has done the seemingly impossible--he has made economics comprehensible \"and\" funny.\"-- Joel Bakan, author of \"The Corporation\" \"The Pathological Pursuit of Profit and Power\" \"An amazing lesson in true-world economics Delightfully presented, powerful, insightful, and important information What a fun way to fathom a deep and often dark subject \"-- John Perkins, author of \"Hoodwinked\" and the \"New York Times\" bestseller \"Confessions of an Economic Hit Man\" \"Smart, insightful, clear, and as close to the truth as economics can get. The bonus: Who would have guessed that economics could be fun, and--here's the joy--really accessible? Goodwin roots us in history and fills us with common sense understanding. As he puts it early on, economics seems horribly complicated mostly because we're looking at it all at once. Broken down into its component pieces, it's relatively easy to understand. And a good understanding of economics is critical to maneuvering in the world today. If I were compiling a list of the 100 most important books you can read in a lifetime, this would be on it.\"--Stephen Petranek, editor-in-chief, Weider History magazines, former editor-in-chief of \"Discover\" magazine \"Through a potent mix of comics and punchy, concise, accessible prose, Goodwin takes us on a provocative, exhaustively researched, and exceedingly engaging trip through our history and present day, creating an alternately hilarious and scary picture of where we are today as an economy-- and what it all means. More than that, Goodwin makes the arcane, understandable. If your mind either spins or slumbers at the thought of economics, read Goodwin's \"Economix\" and all will become clear. --Nomi Prins, author of \"It Takes a Pillage: An Epic Tale of Power, Deceit, and Untold Trillions\" \"\"Economix\" is a lively, cheerfully opinionated romp through the historical and intellectual foundations of our current economy and our current economic problems. Goodwin has a knack for distilling complex ideas and events in ways that invite the reader to follow the big picture without losing track of what actually happened. Any reader wondering how our economy got to where it is today will find this a refreshing overview.\"--Timothy W. Guinnane, Philip Golden Bartlett Professor of Economic History, Yale University",
  "genres": [
    "Economics",
    "Nonfiction",
    "Graphic Novels",
    "Comics",
    "History",
    "Politics",
    "Bande Dessinée"
  ],
  "author": "Michael    Goodwin",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/13591145-economix"
}