{
  "title": "The Innocence of Objects",
  "description": "The culmination of decades of omnivorous collecting, Orhan Pamuk’s Museum of Innocence in Istanbul uses his novel of lost love, The Museum of Innocence , as a departure point to explore the city of his youth. In The Innocence of Objects , Pamuk’s catalog of this remarkable museum, he writes about things that matter deeply to the psychology of the collector, the proper role of the museum, the photography of old Istanbul (illustrated with Pamuk’s superb collection of haunting photographs and movie stills), and of course the customs and traditions of his beloved city. The book’s imagery is equally evocative, ranging from the ephemera of everyday life to the superb photographs of Turkish photographer Ara Güler. Combining compelling art and writing, The Innocence of Objects is an original work of art and literature.Praise for The Innocence of \"[A] most audacious and provocative take on the history of Turkish culture and politics by Turkey's best-known dissenter.\" — Publishers Weekly“Orhan Pamuk’s The Innocence of Objects makes me want to stand up and shout! It is a triumph of intimacy over sterility, depth over superficiality, and humanity over inhumanity. It is also the most perfect intersection of art and literature that I have ever encountered.” — The Huffington Post“I bought the Turkish edition of The Innocence of Objects , a richly illustrated book about the museum, and have been waiting for Abrams’ English translation. It’s just come out, and Pamuk’s text about the project is as illuminating as it promised to be.” – The Design Observer“—Pamuk’s tour de force and mind-benderabout museums, art, artifice, and the place of fiction and the writer in theworld—is a nonfiction narrative unlike most you will encounter.” —“[A] squarish volume, filled with gorgeous photographs of the museum’s interior. . . . The exhibition photos are accompanied by Pamuk’s lively, sometimes dazzling commentary, which ranges freely from personal anecdotes to meditations on aesthetics to whimsical ‘memories’ of his fictional protagonist. . . .” — The American Reader“ The Innocence of Objects —Pamuk’s tour de force and mind-bender about museums, art, artifice, and the place of fiction and the writer in the world—is a nonfiction narrative unlike most you will encounter.” — Virginian Pilot",
  "genres": [
    "Art",
    "Nonfiction",
    "Turkish Literature",
    "Turkish",
    "History",
    "Literature",
    "Photography"
  ],
  "author": "Orhan Pamuk",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/13591240-the-innocence-of-objects"
}