{
  "title": "Sweet Ruin",
  "description": "Tony Hoagland captures the recognizably American landscape of a man of his   sex, friendship, rock and roll, cars, high optimism, and disillusion.  With what Robert Pinsky has called “the saving vulgarity of American poetry,”  Hoagland’s small biographies of destruction reveal that defeat is a natural prelude to grace and loss a kind of threshold to freedom.“A remarkable book.  Without any rhetorical straining, with a disarming witty directness, these poems manage to transform every subject they touch, from love to politics, reaching out from the local and the personal to place the largest issues in the context of feeling.  It’s hard to think of a recent book that succeeds with equal grace in fusing the truth-telling and the lyric impulse, clarity and song, in a way that produces such consistent pleasure and surprise.”—Carl Dennis“This is wonderful   exuberant, self-assured, instinct with wisdom and passion.”—Carolyn Kizer“There is a fine strong sense in these poems of real lives being lived in a real world.  This is something I greatly prize.  And it is all colored, sometimes brightly, by the poet’s own highly romantic vision of things, so that what we may think we already know ends up seeming rich and strange.”—Donald Justice“In Sweet Ruin, we’re banging along the Baja of our little American lives, spritzing truth from our lapels, elbowing our compadres, the Seven Deadly Sins.  Maybe we’re unhappy in a less than tragic way, but our ruin requires of us a love and understanding and loyalty just as deep and sweet as any tragic hero’s.  And it’s all the more poignant in a sad and funny way because the purpose of this forced spiritual march, Hoagland seems to be saying, is to leave ourselves behind.  Undoubtedly, you will recognize among the body count many of your selves.”—Jack Myers",
  "genres": [
    "Poetry"
  ],
  "author": "Tony Hoagland",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/135915.Sweet_Ruin"
}