{
  "title": "Errantry: Strange Stories",
  "description": "No one is innocent, no one unexamined in award-winner Elizabeth Hand's new collection. From the summer isles to the mysterious people next door all the way to the odd guy one cubicle over, Hand teases apart the dark strangenesses of everyday life to show us the impossibilities, broken dreams, and improbable dreams that surely can never come true.“Ten evocative novellas and stories whisper of hidden mysteries carved on the bruised consciousness of victims and victimizers. Memories and love are as dangerous as the supernatural, and Hand often denies readers neat conclusions, preferring disturbing ambiguity. The Hugo-nominated “The Maiden Flight of McCauley’s Bellerophon” marries science fiction and magical realism as three men recreate a legendary aircraft’s doomed flight for a dying woman. A grieving widower in “Near Zennor” unearths a secret of spectral kidnapping in an ancient countryside. “Hungerford Bridge,” a lesser piece, shares a secret that can only be enjoyed twice in one’s life. Celtic myth and human frailty entangle in the darkly romantic “The Far Shore.” The vicious nature of romantic love is dissected with expressionistic abandon in the dreamlike “Summerteeth.” Hand’s outsiders haunt themselves, the forces of darkness answering to the calls of their battered souls. Yet strange hope clings to these surreal elegies, insisting on the power of human emotion even in the shadow of despair. Elegant nightmares, sensuously told.”—Publishers WeeklyTable of ContentsThe Maiden Flight of McCauley’s BellerophonNear Zennor (a Shirley Jackson Award winner)Hungerford BridgeThe Far ShoreWinter’s WifeCruel Up NorthSummerteethThe Return of the Fire WitchUncle LouErrantryElizabeth Hand's novels include Shirley Jackson Award–winner Generation Loss, Mortal Love, and Available Dark.",
  "genres": [
    "Short Stories",
    "Fantasy",
    "Fiction",
    "Horror",
    "Magical Realism",
    "Weird Fiction",
    "Speculative Fiction"
  ],
  "author": "Elizabeth Hand",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/13591876-errantry"
}