{
  "title": "Sister Spit: Writing, Rants and Reminiscence from the Road",
  "description": "\"Heartbreakingly beautiful writing; sometimes funny, sometimes shattering—always revolutionary. Truly amazing collection!\"—Margaret Cho\"Sister Spit is like the underground railroad for burgeoning queer writers. Not only in the van, but in the audiences trapped in the hinterlands of America and looking to escape. Sister Spit saves lives.\"—Justin Vivian Bond, author of TANGO: My Childhood, Backwards and in High HeelsA collection of writing and artwork from the irreverent, flagrantly queer, hilariously feminist, tough-talking, genre-busting ruffians who have toured with the legendary Sister Spit. Co-founded in 1997 by award-winning writer Michelle Tea, Sister Spit is an underground cultural institution, a gender-bending writers' cabaret that brings a changing roster of both emerging writers and some of the most important queer and counterculture artists of the day to universities, art galleries, community spaces, and other venues across the country and worldwide.Sister Spit: Writing, Rants and Reminiscence from the Road captures the provocative, politicized, and risk-taking elements that characterize the Sister Spit aesthetic, stamping the raw energy and signature style of the live show onto the page. Bratty poets and failed priestesses, punk angst and tough love, too much to drink and tattooed timelines—this anthology captures it all in a collection of poetry, personal narrative, fiction, and artwork. Featuring a who's who of queer and queer-centric writers and artists, the collection functions as a travelog, a historical document, and a yearbook from irreverent graduates of the school of hard knocks.Includes contributions by Eileen Myles, Beth Lisick, Michelle Tea, MariNaomi, Cristy Road, Ali Liebegott, Blake Nelson, Lenelle Moise, and many more!",
  "genres": [
    "Queer",
    "Poetry",
    "Nonfiction",
    "Anthologies",
    "Feminism",
    "LGBT",
    "Essays"
  ],
  "author": "Michelle Tea",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/13591832-sister-spit"
}