{
  "title": "Democracy at Work: A Cure for Capitalism",
  "description": "\"Richard Wolff is the leading socialist economist in the country. This book is required reading for anyone concerned about a fundamental transformation of the ailing capitalist economy.\"—Cornel West“Richard Wolff’s constructive and innovative ideas suggest new and promising foundations for a much more authentic democracy and sustainable and equitable development, ideas that can be implemented directly and carried forward. A very valuable contribution in troubled times.”—Noam Chomsky\"Probably America's most prominent Marxist economist.\"—The New York TimesCapitalism as a system has spawned deepening economic crisis alongside its bought-and-paid-for political establishment. Neither serves the needs of our society. Whether it is secure, well-paid, and meaningful jobs or a sustainable relationship with the natural environment that we depend on, our society is not delivering the results people need and deserve.One key cause for this intolerable state of affairs is the lack of genuine democracy in our economy as well as in our politics. The solution requires the institution of genuine economic democracy, starting with workers directing their own workplaces, as the basis for a genuine political democracy.Here Richard D. Wolff lays out a hopeful and concrete vision of how to make that possible, addressing the many people who have concluded economic inequality and politics as usual can no longer be tolerated and are looking for a concrete program of action.Richard D. Wolff is professor of economics emeritus at the University of Massachusetts, Amherst. He is currently a visiting professor at the New School for Social Research in New York. Wolff is the author of many books, including Capitalism Hits the Fan: The Global Economic Meltdown and What to Do About It. He hosts the weekly hour-long radio program Economic Update on WBAI (Pacifica Radio) and writes regularly for The Guardian, Truthout.org, and MRZine.",
  "genres": [
    "Economics",
    "Politics",
    "Nonfiction",
    "Philosophy",
    "History",
    "Theory",
    "Social Science"
  ],
  "author": "Richard D. Wolff",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/13591849-democracy-at-work"
}