{
  "title": "Read This!: Handpicked Favorites from America's Indie Bookstores",
  "description": "“There is no greater joy for a bookseller than introducing a reader to a book they will love for the rest of their lives. Those of us in this business are, after all, matchmakers at heart. So consider this little book you now hold in your hands a sort of catalog of matchmakers.”—Ann Patchett\"If I were still a bookseller, I'd be thrilled to share this wealth with my customers. As a reader, I'm deeply intrigued by the range of selections. . . . Do yourself a favor. Add Micawber's Top 50 project to your must-read list.\"—Robert Gray, Shelf AwarenessThis book offers lists of favorites that have flown under the radar, but off of bookstore shelves. First published on Hans Weyandt's blog for Micawber's Books, each list includes a bookseller's top fifty books, anecdotes, and interviews about the life of being a bookseller, reader, and engaged citizen. All proceeds will go to American Booksellers Foundation for Free Expression (ABFFE).Contributing bookstores include Book Passage, Tattered Cover Book Store, Three Lives & Company, Boswell Books, City Lights Bookstore, BookCourt, Harvard Book Store, Carmichael's Bookstore, Prairie Lights, The King's English Bookshop, Square Books, Magers & Quinn, Micawber's Books, Unabridged Bookstore, Regulator Bookshop, Subterranean Books, Faulkner House Books, Skylight Books, Maria's Bookshop, Inkwood Books, Rakestraw Books, RiverRun Bookstore, Sherman's Books and Stationary, Iowa Book, and Fireside Books.Hans Weyandt is a co-owner at Micawber's Books, an independent bookstore in St. Paul, Minnesota.Ann Patchett is the best-selling author of five novels, including Run, Bel Canto, and most recently, State of Wonder. She owns Parnassus Bookstore in Nashville, Tennnessee.",
  "genres": [
    "Books About Books",
    "Nonfiction",
    "Reference",
    "Writing"
  ],
  "author": "Hans Weyandt",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/13591795-read-this"
}