{
  "title": "American Honor Killings: Desire and Rage Among Men",
  "description": "In American Honor Killings, straight and gay guys cross paths, and the result is murder. But what really happened? What role did hatred play? What were the men involved really like, and what was going on between them when the murder occurred? American Honor Killings explores the truth behind squeamish reporting and uninformed political rants of the far right or fringe left. David McConnell, a New York based novelist, researched cases from small-town Alabama to San Quentin's death row. The book recounts some of the most notorious crimes of our era.Beginning in 1999 and lasting until the 2011 conviction of a youth in Queens, New York, the book shows how some murderers think they're cleaning up society. Surprisingly, other killings feel almost preordained, not a matter of the victim's personality or actions so much as a twisted display of a young man's will to compete or dominate. We want to think these stories involve simple sexual conflict, either the killer's internal struggle over his own identity or a fatally miscalculated proposition. They're almost never that simple.Together, the cases form a secret American history of rage and desire. McConnell cuts through cant and political special pleading to turn these cases into enduring literature. In each story, victims, murderers, friends, and relatives come breathtakingly alive. The result is more soulful, more sensitive, more artful than the sort of \"true crime” writing the book was modeled on. A wealth of new detail has been woven into old cases, while new cases are plumbed for the first time. The resulting stories play out exactly as they happened, an inexorable sequence of events—grisly, touching, disturbing, sometimes even with moments of levity.It has been awarded the Stonewall Book Award-Israel Fishman Non-Fiction Award for 2014.\"Utilizing an empathetic narrative nonfiction approach, novelist McConnell, co-chair of the Lambda Literary Foundation, casts a humanizing eye upon monstrous deeds…a journalistic tour de force made all the more impressive by jailhouse interviews…McConnell's unquestionable skill as a writer gives both literary helot and immediacy to the narratives.\"--\nPublishers Weekly\n\"McConnell convincingly shows how fluid terms like 'gay' and 'straight' can actually be… The author's case studies reflect an intensive investigation into the economic and cultural backgrounds of a wide variety of extremist cultures, research that involved interviews with law enforcement officials, families of victims and the convicted criminals themselves. A shocking look at the subculture of violent crime, not for the fainthearted.\"--\nKirkus Reviews\nA masterpiece of reportage . . . Homophobia is not accepted as a mitigating circumstance in murder, but there is no doubt that men are still murdered for being gay. From Jon Schmitz ('The Jenny Jones Killer’) to John Katehis (the teenage hustler who murdered radio personality George Weber), novelist McConnell . . . has compiled a number of these cases and looks into the culture of masculinity for clues to the dynamics behind these killings . . . with no clear answers, but some very intriguing questions, these vignettes of masculine pride and rage will appeal to those interested in gender politics and gay studies as well as true crime fans.”--\nLibrary Journal\n\"McConnell, who is gay, is convinced he has written a book that no straight man could have written, and he's probably right. Navigating the depressing world of these horrific murders would discourage all but the most determined, passionate writers. Finding the humanity in these killers and the nuance in these most inhumane killings would challenge all but the most compassionate of writers.\"--\nLA Weekly\n\"American Honor Killings is a strong addition to any criminology or true crime collection with a side focus on gay issues, very much recommended.\"--\nMidwest Book Review",
  "genres": [
    "Nonfiction",
    "True Crime",
    "Crime",
    "LGBT",
    "History",
    "Sociology",
    "Feminism"
  ],
  "author": "David McConnell",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/13592202-american-honor-killings"
}