{
  "title": "Earth and Air",
  "description": "In these collection, you will find stories that range from the mythic to contemporary fantasy to science fiction. You will find a troll, gryphons, a beloved dog, the Land of the Dead, an owl, a minotaur, and a very alien Cat. Earth and Air is the third and final book in a trilogy of shared collections connected by the four classical elements. It follows previous volumes Water: Tales of Elemental Spirits and Fire: Tales of Elemental Spirits, written by both Peter Dickinson and Robin McKinley.Ridiki is Steff’s beloved dog, named after Eurydice, whom the poet Orpheus tried to bring back from the dead. When, like her namesake, Ridiki is bitten by a snake and dies, Steff decides that he too should journey to the Underworld to ask the King of the Land of the Dead for his dog back.Mari is the seventh child of a family in which troll blood still runs. When her husband goes missing in a Scottish loch, she must draw upon the power of her blood to rescue him. Sophie, a young girl, fashions a witch’s broomstick out of an ash sapling, and gets more than she bargained for. An escaped slave, Varro, must kill a gryphon, in order to survive. A boy named Yanni allies himself with an owl and a goddess in order to fight an ancient evil. A group of mind-bonded space travelers must face an unknown threat and solve the murder of a companion before time runs out.All of these stories are about, in one way or another, the contrary and magical pull of two elements, Earth and Air. Each story showcases the manifold talents of a master storyteller and craftsman who has twice won the Carnegie Medal and the Whitbread Award, as well as the Guardian Children’s Fiction Prize.A Junior Library Guild Selection\"These unusual, memorable tales from a much-admired writer should appeal both to teens and Dickinson’s adult fans.\"—Publishers Weekly\"Strange, sometimes beautiful tales.\"—Kirkus ReviewsPraise for Water: Tales of Elemental SpiritsWorld Fantasy Award finalist\"There is plenty here to excite, enthrall, and move even the pickiest readers.\"—School Library Journal\"... a collection of enchanting tales.\"—Publishers WeeklyPraise for Fire: Tales of Elemental Spirits\"This collection of beautifully crafted tales will find a warm welcome.\"—School Library Journal\"Dickinson’s offerings are notable for their sophisticated magical thinking and subtlety of expression.\"—The Horn Book\"Dickinson’s stories are told with a storyteller’s cadence.\"—Booklist“This collection ... offers something for every fantasy fan.”—Library Media ConnectionPraise for Peter Dickinson's children's books:\"One of the real masters of children's literature.\"—Philip Pullman\"Peter Dickinson is a national treasure.\"—The Guardian\"Magnificent. Peter Dickinson is the past-master story-teller of our day.\"—The Times Literary SupplementPeter Dickinson is the author of over fifty books including Eva, Emma Tupper's Dairy, and the Michael L. Printz Honor Book The Ropemaker. He has twice received the Crime Writers' Association's Gold Dagger as well as the Guardian Award and Whitbread Prize. He lives in England and is married to the novelist Robin McKinley.",
  "genres": [
    "Fantasy",
    "Short Stories",
    "Fiction",
    "Anthologies",
    "Young Adult",
    "Science Fiction Fantasy",
    "Science Fiction"
  ],
  "author": "Peter Dickinson",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/13592378-earth-and-air"
}