{
  "title": "The Hemingway Book Club of Kosovo",
  "description": "\"Gripping, heartbreaking reading...The interweaving of Hemingway's story, the students' narratives of terror and Huntley's own tales of discovery make for a book that is stirring and nearly impossible to put down.\"In August 2000, Paula Huntley's husband took a leave of absence from his teaching post at a law school, and she resigned from her marketing job of thirteen years. Huntley's husband had signed on with the American Bar Association to help rebuild Kosovo's legal system. Not quite sure how she could be of any service in a country that had suffered so much, Huntley found a position at a private school teaching English to a group of Kosovo Albanians. In this inspiring diary of her experiences in Kosovo, Huntley describes the deep friendships she formed with her students and the remarkable book club that they created . . .One day in a bookstore in Prishtina, Huntley stumbled upon a copy of Hemingway's Old Man and the Sea and--judging that it was just the right reading level and length--she made copies of it for the group. Despite lingering concerns that this quintessential American writer so notorious for his machismo might not resonate, the story of the old man's struggle to bring in his big fish touched them deeply. So deeply in fact that, though the group went on to read other great American writers, a name for their club was born: The Hemingway Book Club of Kosova.This book reveals both the fragility and strength of the human spirit. Neither a journalist nor a historian, Huntley describes her students' experiences during the war and the intimacy of the bond that she formed with them with a rare purity and directness. A vision of great hope, The Hemingway Book Club of Kosovo reveals the power of human connection to bring about healing in even the most war-torn circumstances.",
  "genres": [
    "Nonfiction",
    "Book Club",
    "Memoir",
    "Books About Books",
    "History",
    "Biography",
    "War"
  ],
  "author": "Paula Huntley",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/104231.The_Hemingway_Book_Club_of_Kosovo"
}