{
  "title": "Chronotherapy: Resetting Your Inner Clock to Boost Mood, Alertness, and Quality Sleep",
  "description": "An enlightened approach to insomnia, depressed mood, fatigue, and other sleep-related problems of everyday life, harnessing the power of light therapy to reset the natural clock.Sleep problems and depressed mood often go hand in hand, forming a frustrating cycle. Michael Terman, PhD, has devoted his career to studying the brain functions that feed these disorders. His discoveries in chronotherapy have been widely recognized as game-changers by the medical establishment, and his 2010 New York Times op-ed, “Sleeping (or Not) by the Wrong Clock,” shot to number one on the paper’s list of most-forwarded online articles. In Chronotherapy , Terman and McMahan reveal the heart of his findings, a powerful program that recalibrates our internal clocks—our exquisitely designed, natural sensitivity to the timing and brightness of light exposure. These delicate mechanisms are often decimated by the modern demands of a 24/7 lifestyle.Beginning with a questionnaire that pinpoints the problem areas, Terman helps readers decipher when their natural internal night begins and ends. The treatment process can then start, incorporating the power of natural light and, when necessary, supplemental light therapy. His approach has brought relief to thousands of sleep sufferers, as well as those burdened by bipolar disorder, seasonal affective disorder, depression, sleep disorders due to around-the-clock work schedules, and other impediments to vibrant health. For the first time, his findings are now available for a general audience, sharing the essential elements of chronobiology in clear, authoritative, scientifically grounded chapters that are easy to apply to a variety of situations. Chronotherapy chapters include:PART ONE: TIME, SLEEP, AND RHYTHMS Chapter 1: External vs. Internal TimeThe clock on the wall measures twenty-four hours every day, but the clock in your brain runs a little different. How can you help them work together? Chapter 2: The Pressure to SleepThe longer you stay awake, the more pressure you feel to sleep. But what if your inner clock says it is not yet ready for sleep? Chapter 3: Owls, Larks, and HummingbirdsWhat kind of “bird” are you? And once you know, how can that help you figure out when best to get stuff done? PART TWO: TIME, LIGHT, AND THE BRAINChapter 4: Getting Light into the BrainHow do your eyes pass signals to your inner clock, and what makes those signals so important? Chapter 5: Getting Light WrongSeeing light and being in darkness are basic daily experiences. But what happens when they come at the wrong times, and why does that have such negative consequences for mood, alertness, and sleep? Chapter 6: Geography and TimeEast or west, south or north, how can where you live have such a huge impact on your mood and sleep? PART THREE: INTERVENTIONSChapter 7: Healing LightHow can light help you solve your sleep problems, have more energy, and feel more positive about life? Why do the details matter so much? Chapter 8: Nighttime Meds and MelatoninDo you rely on pills to get to sleep? They may not work, and they may be bad for you. But a new approach based on the brain’s inner clock holds great promise. Chapter 9: Hospitalized with DepressionWhen someone becomes so depressed they need to go to the hospital, what promise does chronotherapy offer for a quick turnaround and continued improvement? Chapter 10: Beyond Light: The Charge in the AirWhat is it about spending a day at the beach that gives you such a lift? And how can you use new technology to bring that feeling of wellbeing into your home? PART FOUR: STAGES OF LIFEChapter 11: The Promise of PregnancyYou are going to have a baby! You are thrilled, but a little apprehensive too. How can chronotherapy help you through the next nine months? Chapter 12: Strategies for Babies and ChildrenWhen your baby or child sleeps well and feels good, you feel better too. How can chronotherapy help you reach this goal? Chapter 13: The Challenges of AdolescenceAs a teen, why do you feel the need to stay up so late and sleep so late? What are the consequences for your mood, health, and schoolwork? What simple steps can you take to put your life on a smoother course? Chapter 14: In Later YearsDoes getting older have to mean being tired, sleeping badly, and feeling down? How can you or someone you care about reverse these trends by using light? PART FIVE: CHRONOTHERAPY IN YOUR LIFEChapter 15: Coping with Shift WorkWhat if your job puts you on duty when your inner clock says you should be asleep? How can chronotherapy help you stay awake, alert, and in a decent mood? Chapter 16: Racing the Clock, Racing the SunYou are traveling across the world and you need to be in high gear tomorrow. How can chronotherapy prepare you for the trip and help you recover from jet lag as quickly as possible? Chapter 17: Chronobiology in the Home and WorkplaceHow will the collaboration of chronobiologists and architects transform the places you live, work, and learn? Chapter 18: Dawn of a Circadian ScienceWhy is mainstream medicine so slow to put the insights of chronotherapy into practice?",
  "genres": [
    "Nonfiction",
    "Self Help",
    "Health",
    "Psychology",
    "Science"
  ],
  "author": "Michael Terman",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/13593534-chronotherapy"
}