{
  "title": "Severe Clear",
  "description": "Stone Barrington is called to Bel-Air in Los Angeles to oversee an exclusive event that will gather the top echelons of the beau monde: Hollywood starlets, socialites, politicos, and billionaires from overseas. It’s a task in which Stone has a personal stake, and one that is made all the more pleasurable—though somewhat more complicated—with the arrivals of two beautiful women with whom he’s intimately acquainted.But the grand occasion has also attracted a dangerous criminal group with sinister plans. The hunt to find them leads Stone into a complex web of deceit and misdirection, in a world where the intrigues of government intelligence collide with the clandestine machinations of the upper crust. As he draws nearer to his quarry, he realizes that the stakes are higher than anybody could ever imagine . . . and that the enemies he’s seeking might just be hiding in plain sight.With guest appearances by President Will Lee and First Lady Kate Rule, Holy Barker, Mike Freeman, Felicity Devonshire, Peter Barrington, and many more, this one is sure to please!Librarian's note: the characters, settings and other information are complete as best possible (corrections are welcome!) for: #1, New York Dead, 1991; #2, Dirt, 1996; #3, Dead in the Water, 1997; #4, Swimming to Catalina, 1998; #5, Worst Fears Realized, 1999; #6, L.A. Dead, 2000; #7, Cold Paradise, 2001; #8, The Short Forever, 2002; #9, Dirty Work, 2003; #10, Reckless Abandon, 2004; #11, Two Dollar Bill, 2004; #12. Dark Harbor, 2006; #13, Fresh Disasters, 2007; #14, Shoot Him if He Runs, 2007; #15, Hot Mahogany, 2008; #16, Loitering with Intent, 2009; #17, Kisser, 2009; #18, Lucid Intervals, 2010; #19, Strategic Moves, 2010; #20, Bel-Air Dead, 2011; #21, Son of Stone, 2011; #22, D.C. Dead, 2011; #23, Unnatural Acts, 2012; #24, Severe Clear, 2012; and #25, Collateral Damage, 2012.",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Suspense",
    "Crime",
    "Mystery Thriller",
    "Detective"
  ],
  "author": "Stuart Woods",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/13593568-severe-clear"
}