{
  "title": "Running with the Bulls: My Years with the Hemingways",
  "description": "A chance encounter in Spain in 1959 brought young Irish reporter Valerie Danby-Smith face to face with Ernest Hemingway. The interview was awkward and brief, but before it ended something had clicked into place. For the next two years, Valerie devoted her life to Hemingway and his wife, Mary, traveling with them through beloved old haunts in Spain and France and living with them during the tumultuous final months in Cuba. In name a personal secretary, but in reality a confidante and sharer of the great man’s secrets and sorrows, Valerie literally came of age in the company of one of the greatest literary lions of the twentieth century.Five years after his death, Valerie became a Hemingway herself when she married the writer’s estranged son Gregory. Now, at last, she tells the story of the incredible years she spent with this extravagantly talented and tragically doomed family.In prose of brilliant clarity and stinging candor, Valerie evokes the magic and the pathos of Papa Hemingway’s last years. Swept up in the wild revelry that always exploded around Hemingway, Valerie found herself dancing in the streets of Pamplona, cheering bullfighters at Valencia, careening around hairpin turns in Provence, and savoring the panorama of Paris from her attic room in the Ritz. But it was only when Hemingway threatened to commit suicide if she left that she realized how troubled the aging writer was–and how dependent he had become on her.In Cuba, Valerie spent idyllic days and nights typing the final draft of A Moveable Feast , even as Castro’s revolution closed in. After Hemingway shot himself, Valerie returned to Cuba with his widow, Mary, to sort through thousands of manuscript pages and smuggle out priceless works of art. It was at Ernest’s funeral that Valerie, then a researcher for Newsweek , met Hemingway’s son Gregory–and again a chance encounter drastically altered the course of her life. Their twenty-one-year marriage finally unraveled as Valerie helplessly watched her husband succumb to the demons that had plagued him since childhood.From lunches with Orson Welles to midnight serenades by mysterious troubadours, from a rooftop encounter with Castro to numbing hospital vigils, Valerie Hemingway played an intimate, indispensable role in the lives of two generations of Hemingways. This memoir, by turns luminous, enthralling, and devastating, is the account of what she enjoyed, and what she endured, during her astonishing years of living as a Hemingway.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "History",
    "Audiobook",
    "Biography Memoir",
    "Autobiography"
  ],
  "author": "Valerie Hemingway",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/104232.Running_with_the_Bulls"
}