{
  "title": "A Stranger's Knowledge: Statesmanship, Philosophy, and Law in Plato's Statesman",
  "description": "The Statesman is a difficult and puzzling Platonic dialogue. In A Stranger's Knowledge Marquez argues that Plato abandons here the classic idea, prominent in the Republic, that the philosopher, qua philosopher, is qualified to rule. Instead, the dialogue presents the statesman as different from the philosopher, the possessor of a specialist expertise that cannot be reduced to philosophy. The expertise is of how to make a city resilient against internal and external conflict in light of the imperfect sociality of human beings and the poverty of their reason. This expertise, however, cannot be produced on demand: one cannot train statesmen like one might train carpenters. Worse, it cannot be made acceptable to the citizens, or operate in ways that are not deeply destructive to the city’s stability. Even as the political community requires his knowledge for its preservation, the genuine statesman must remain a stranger to the city.Marquez shows how this impasse is the key to understanding the ambiguous reevaluation of the rule of law that is the most striking feature of the political philosophy of the Statesman. The law appears here as a mere approximation of the expertise of the inevitably absent statesman, dim images and static snapshots of the clear and dynamic expertise required to steer the ship of state across the storms of the political world. Yet such laws, even when they are not created by genuine statesmen, can often provide the city with a limited form of cognitive capital that enables it to preserve itself in the long run, so long as citizens, and especially leaders, retain a “philosophical” attitude towards them. It is only when rulers know that they do not know better than the laws what is just or good (and yet want to know what is just and good) that the city can be preserved. The dialogue is thus, in a sense, the vindication of the philosopher-king in the absence of genuine political knowledge.",
  "genres": [
    "Philosophy"
  ],
  "author": "Xavier Márquez",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/13593850-a-stranger-s-knowledge"
}