{
  "title": "The Legacy of David Foster Wallace",
  "description": "“The Legacy of David Foster Wallace is a necessary book—it will find a place in virtually every university and college library across the land. Surely it will be among the first critical works consulted by any scholar or student venturing into the work of Wallace and will interest the more ordinary, if unusually ambitious, reader as well.”—Mark McGurl, author, The Program Era“This is a collection whose character is faithful to the spirit of Wallace's work: considerate, intelligent, funny, even self-deprecating—an excellent addition to both the fan’s and the critic’s library.”—Lydia Millet, Pulitzer Prize finalist for Love in Infant MonkeysConsidered by many to be the greatest writer of his generation, David Foster Wallace was at the height of his creative powers when he committed suicide in 2008. In a sweeping portrait of Wallace’s writing and thought and as a measure of his importance in literary history, The Legacy of David Foster Wallace gathers cutting-edge, field-defining scholarship by critics alongside remembrances by many of his writer friends, who include some of the world’s most influential authors.In this elegant volume, literary critics scrutinize the existing Wallace scholarship and at the same time pioneer new ways of understanding Wallace’s fiction and journalism. In critical essays exploring a variety of topics—including Wallace’s relationship to American literary history, his place in literary journalism, his complicated relationship to his postmodernist predecessors, the formal difficulties of his 1996 magnum opus Infinite Jest, his environmental imagination, and the “social life” of his fiction and nonfiction—contributors plumb sources as diverse as Amazon reader recommendations, professional book reviews, the 2009 Infinite Summer project, and the David Foster Wallace archive at the University of Texas’s Harry Ransom Center.The creative writers—including Don DeLillo, Jonathan Franzen, George Saunders, Rick Moody, Dave Eggers, and David Lipsky—and Wallace’s Little, Brown editor, Michael Pietsch, reflect on the person behind the volumes of fiction and nonfiction created during the author’s too-short life.All of the essays, critical and creative alike, are written in an accessible style that does not presume any background in Wallace criticism. Whether the reader is an expert in all things David Foster Wallace, a casual fan of his fiction and nonfiction, or completely new to Wallace, The Legacy of David Foster Wallace will reveal the power and innovation that defined his contribution to literary life and to self-understanding. This illuminating volume is destined to shape our understanding of Wallace, his writing, and his place in history.",
  "genres": [
    "Nonfiction",
    "Essays",
    "Literary Criticism",
    "American",
    "Writing"
  ],
  "author": "Samuel Cohen",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/13593842-the-legacy-of-david-foster-wallace"
}