{
  "title": "Turquoise and Terrorists",
  "description": "The news hit Allison like a blow to the stomach. A helicopter carrying her kidnapped husband, Bart, had crashed into the side of a mountain. â Iâ m sorry, Mrs. Alexander . . .there were no survivors,â the secret service agent said. Was it true? Could she be a widow after only weeks of marriage to the man she had loved for a lifetime? They had come to the high desert of New Mexico because international terrorists had threatened to kidnap three famous celebrities and hold them for ransom. But now Bart and her father had been abducted by those same evil anarchists, and their getaway had gone terribly wrong. Had it all ended in a fiery explosion against a desolate mountainside? From the opening sentence of this riveting adventure, Allisonâ s gifts of intellect, communication and discernment are tested to their limits. She must over come almost insurmountable obstacles to discover the truth about Bartâ s and her fatherâ s disappearance . . . yet, if there is still a chance they might be alive, she must spare no effort to find them. In the two months since they foiled a major diamond theft in San Francisco, Bart and Allison have been separated by their Bart in Europe recruiting additional agents for Anastasia, the anti-terrorist branch of Interpol, and Allison winding up her job as an interpreter at the United Nations in New York City. Because Allison nearly lost her life on more than one occasion in San Francisco, and was lucky to escape with only a serious compound fracture of her arm, Bart is adamant that sheâ ll have no part in Anastasiaâ s dangerous business of stopping terrorists before they strike. Allison, on the other hand, is determined to work alongside her agent husband â just as her mother has worked side by side with her father in the elite organization. Who could have foreseen, when this war of wills began, the unbelievable outcome of one womanâ s determination?",
  "genres": [
    "Lds Fiction",
    "Mystery",
    "Lds",
    "Romance",
    "Suspense",
    "Adventure",
    "Christian Fiction"
  ],
  "author": "Lynn Gardner",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/1359425.Turquoise_and_Terrorists"
}