{
  "title": "For a Song and a Hundred Songs: A Poet's Journey Through a Chinese Prison",
  "description": "In June 1989, news of the Tiananmen Square protests and its bloody resolution reverberated throughout the world. A young poet named Liao Yiwu, who had until then led an apolitical bohemian existence, found his voice in that moment. Like the solitary man who stood firmly in front of a line of tanks, Liao proclaimed his outrage—and his words would be his weapon. For a Song and a Hundred Songs captures the four brutal years Liao spent in jail for writing the incendiary poem “Massacre.” Through the power and beauty of his prose, he reveals the bleak reality of crowded Chinese prisons—the harassment from guards and fellow prisoners, the torture, the conflicts among human beings in close confinement, and the boredom of everyday life. But even in his darkest hours, Liao manages to unearth the fundamental humanity in his cell mates: he writes of how they listen with rapt attention to each other’s stories of criminal endeavors gone wrong and of how one night, ravenous with hunger, they dream up an “imaginary feast,” with each inmate trying to one-up the next by describing a more elaborate dish. In this important book, Liao presents a stark and devastating portrait of a nation in flux, exposing a side of China that outsiders rarely get to see. In the wake of 2011’s Arab Spring, the world has witnessed for a second time China’s crackdown on those citizens who would speak their mind, like artist Ai Weiwei and legal activist Chen Guangcheng. Liao stands squarely among them and gives voice to not only his own story, but to the stories of those individuals who can no longer speak for themselves. For a Song and a Hundred Songs bears witness to history and will forever change the way you view the rising superpower of China.",
  "genres": [
    "China",
    "Nonfiction",
    "Memoir",
    "History",
    "Poetry",
    "Biography",
    "Biography Memoir"
  ],
  "author": "Liao Yiwu",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/13594582-for-a-song-and-a-hundred-songs"
}