{
  "title": "I Am Spartacus!: Making a Film, Breaking the Blacklist",
  "description": "From Kirk Douglas, Hollywood royalty and bestselling author of  The Ragman’s Son and My Stroke of Luck,  comes the candid story of the making of  Spartacus , the blockbuster film that broke the blacklistOne of the world’s most iconic movie stars, Kirk Douglas has distinguished himself as a producer, philanthropist, and author of ten works of fiction and memoir. Now, more than fifty years after the release of his enduring epic Spartacus , Douglas reveals the riveting drama behind the making of the legendary gladiator film. Douglas began producing the movie in the midst of the politically charged era when Hollywood’s moguls refused to hire anyone accused of Communist sympathies. In a risky move, Douglas chose Dalton Trumbo, a blacklisted screenwriter, to write Spartacus . Trumbo was one of the “Unfriendly Ten,” men who had gone to prison rather than testify before the House Un-American Activities Committee about their political affiliations. Douglas’s source material was already a hot property, as the novel Spartacus was written by Howard Fast while he was in jail for defying HUAC. With the financial future of his young family at stake, Douglas plunged into a tumultuous production both on- and off-screen. As both producer and star of the film, he faced explosive moments with young director Stanley Kubrick, struggles with a leading lady, and negotiations with giant personalities, including Sir Laurence Olivier, Charles Laughton, Peter Ustinov, and Lew Wasserman. Writing from his heart and from his own meticulously researched archives, Kirk Douglas, at ninety-five, looks back at his audacious decisions. He made the most expensive film of its era—but more importantly, his moral courage in giving public credit to Trumbo effectively ended the notorious Hollywood blacklist. A master storyteller, Douglas paints a vivid and often humorous portrait in I Am Spartacus! The book is enhanced by newly discovered period photography of the stars and filmmakers both on and off the set.",
  "genres": [
    "Biography",
    "Nonfiction",
    "History",
    "Memoir",
    "Film",
    "Media Tie In",
    "Politics"
  ],
  "author": "Kirk Douglas",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/13594480-i-am-spartacus"
}