{
  "title": "Love Looks Not with the Eyes: Thirteen Years with Lee Alexander McQueen",
  "description": "Lee Alexander McQueen (1969–2010), whose design combined visionary aesthetics, emotional power, and extraordinary craft, was known for staging provocative shows that were as much performances as venues to display his couture creations. Charged with energy, informed by history and culture, and filled with fresh concepts, McQueen’s shows have become legends not only of fashion but also of art. Anne Deniau was the only photographer allowed backstage by McQueen for 13 years, beginning in September 1997 and ending with the final show in March 2010. She captured McQueen working with his close circle of collaborators―including designer Sarah Burton, milliner Philip Treacy, jewelry designer Shaun Leane, and model Kate Moss―to create his meticulously produced spectacles. Her book offers an inspiring homage, through the art of photography, to the work of a great artist.Praise for Love Looks Not With the Thirteen Years With Lee Alexander McQueen :The pictures are evocative of the torture, the toughness and, most of all, the tenderness of Mr. McQueen.” ― New York Times“Deniau’s close connection to McQueen and her appreciation for his formidable talent is like many of the pieces he breathtaking.” ― San Francisco Chronicle“Thekinetic color and black-and-white photographs document the fantastical,shocking spectacle of a McQueen show in hairdos trussed up with birdsof prey; hubcaps strapped to foreheads; faces enhanced by extraterrestrialcheek prostheses. The images are sensual, spooky, and whimsical, playing up thedrama of McQueen’s vision; like one of the designer’s fabulous garments, thephotographs transform fashion into high art. The book is both an homage and amemorial; this celebration of McQueen’s vast, unique talent is also a eulogyfor his tragic loss.” ― “Haute couture has a reputation for spectacle, but Anne Deniau’s photographs remind us that it’s also the last bastion of craftsmanship in fashion―or it was, as practiced by designer Alexander McQueen (1969–2010).” ― Wall Street Journal“Lush, previously unpublished backstage photographs from many of the late designer’s provocative fashion shows.”― The Los Angeles Times“The kinetic color and black-and-white photographs document the fantastical, shocking spectacle of a McQueen show in hairdos trussed up with birds of prey; hubcaps strapped to foreheads; faces enhanced by extraterrestrial cheek prostheses. The images are sensual, spooky, and whimsical, playing up the drama of McQueen’s vision; like one of the designer’s fabulous garments, the photographs transform fashion into high art. The book is both an homage and a memorial; this celebration of McQueen’s vast, unique talent is also a eulogy for his tragic loss.” ― Publishers Weekly“ Love Looks Not with the Eyes document[s] the intense work and equally intense emotions that played out behind the scenes of McQueen’s poetic, passionate, and provocative shows. . . . The intimacy is evident in the pictures.” ― Vogue“The haunting images offer a rarefied glimpse into the designer’s inner world.” ― Harper’s Bazaar“Deniau, in the process of documenting 26 McQueen presentations, captured images which, too, transcend photography―matching the decadent and grand world created by the hands of McQueen.” ―Time.com“Haute couture has a reputation for spectacle, but Anne Deniau’s photographs remind us that it’s also the last bastion of craftsmanship in fashion―or it was, as practiced by designer Alexander McQueen (1969–2010).” ― Wall Street Journal",
  "genres": [
    "Fashion",
    "Nonfiction",
    "Art",
    "Photography",
    "Biography",
    "Memoir",
    "Art and Photography"
  ],
  "author": "Anne Deniau",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/13594589-love-looks-not-with-the-eyes"
}