{
  "title": "Safe as Houses",
  "description": "Safe as Houses, the debut story collection of Marie-Helene Bertino, proves that not all homes are shelters. The titular story revolves around an aging English professor who, mourning the loss of his wife, robs other people's homes of their sentimental knick-knacks. In \"Free Ham,\" a young dropout wins a ham after her house burns down and refuses to accept it. “Has my ham done anything wrong?” she asks when the grocery store manager demands that she claim it.In \"Carry Me Home, Sisters of Saint Joseph,\" a failed commercial writer moves into the basement of a convent and inadvertently discovers the secrets of the Sisters of Saint Joseph. A girl, hoping to talk her brother out of enlisting in the army, brings Bob Dylan home for Thanksgiving dinner in the quiet, dreamy \"North Of.\" In “The Idea of Marcel,” Emily, a conservative, elegant girl, has dinner with the idea of her ex-boyfriend, Marcel. In a night filled with baffling coincidences, including Marcel having dinner with his idea of Emily, she wonders why we tend to be more in love with ideas than with reality. In and out of the rooms of these gritty, whimsical stories roam troubled, funny people struggling to reconcile their circumstances to some kind of American Ideal and failing, over and over. The stories of Safe as Houses are magical and original and help answer such universal and existential questions How far will we go to stay loyal to our friends? Can we love a man even though he is inches shorter than our ideal? Why doesn’t Bob Dylan ever have his own smokes? And are there patron saints for everything, even lost socks and bad movies?All homes are not shelters. But then again, some are. Welcome to the home of Marie-Helene Bertino.",
  "genres": [
    "Short Stories",
    "Fiction",
    "Literary Fiction",
    "Contemporary",
    "Anthologies",
    "Short Story Collection",
    "Collections"
  ],
  "author": "Marie-Helene Bertino",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/13594628-safe-as-houses"
}