{
  "title": "Tell Everyone I Said Hi",
  "description": "The world of Tell Everyone I Said Hi is geographically small but far from provincial in its portrayal of emotionally complicated lives. With all the heartbreaking earnestness of a Wilco song, these eighteen stories by Chad Simpson roam the small-town playgrounds, blue-collar neighborhoods, and rural highways of Illinois, Indiana, and Kentucky to find people who’ve lost someone or something they love and have not yet found ways to move forward. Simpson’s remarkable voice masterfully moves between male and female and adolescent and adult characters. He embraces their helplessness and shares their sad, strange, and sometimes creepy slices of life with grace, humor, and mounds of empathy. In “Peloma,” a steelworker grapples with his preteen daughter’s feeble suicide attempts while the aftermath of his wife’s death and the politics of factory life vie to hem him in.  The narrator of “Fostering” struggles to determine the ramifications of his foster child’s past now that he and his wife are expecting their first biological child. In just two pages, “Let x ” negotiates the yearnings and regrets of childhood through mathematical variables and the summertime interactions of two fifth-graders. Poignant, fresh, and convincing, these are stories of women who smell of hairspray and beer and of landscapers who worry about their livers, of flooded basements and loud trucks, of bad exes and horrible jobs, of people who remain loyal to sports teams that always lose. Displaced by circumstances both in and out of their control, the characters who populate Tell Everyone I Said Hi are lost in their own surroundings, thwarted by misguided aspirations and long-buried disappointments, but fully open to the possibility that they will again find their way.",
  "genres": [
    "Short Stories",
    "Fiction",
    "Literature",
    "American"
  ],
  "author": "Chad Simpson",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/13594640-tell-everyone-i-said-hi"
}