{
  "title": "Priestess, Mother, Sacred Sister: Religions Dominated by Women",
  "description": "Religion is often denounced as one of the tools used by patriarchal societies to maintain the status quo, and especially to persuade women to accept subordinate roles. This does not explain, however, the existence of many religious groups in which women are both leaders and the majority of participants. How are these women's religions different from those dominated by men? What can we learn from them about the special ways in which women experience their unique reality? In this fascinating and pathbreaking work--the first comparative study of women's religions--Susan Starr Sered seeks answers to these compelling questions.Looking for common threads linking groups as diverse as the ancestral cults of the Black Caribs of Belize, Korean shamanism, Christian Science, and the Feminist Spirituality movement, Sered finds that motherhood and motherly concerns play a vital role in these female-dominated groups. Nurturing and concern for others are at the center, as are healing arts and ways of dealing with illness and the death of children. Religion not only enables women to find sacred meaning in their daily lives, from the preparation of food to caring for their families, but an offer intense and personal relationships with deities and spirits--often through ecstatic possession trance--as well as opportunities to celebrate and mourn with other women.By examining the shared experiences of women across great cultural divides, Priestess, Mother, Sacred Sister offers a new understanding of the role gender plays in determining how individuals grapple with the ultimate questions of existence. In the process, it not only highlights the profound differences between men and women, but the equally important ways in which we are all alike.",
  "genres": [
    "Nonfiction",
    "Religion",
    "Spirituality",
    "Feminism"
  ],
  "author": "Susan Starr Sered",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/1005031.Priestess_Mother_Sacred_Sister"
}