{
  "title": "Silk Stockings",
  "description": "Three passionate novellas from The Secret Library range that offer essiential, sensual reading. Silk Stockings - Constance Munday When Michael Levenstein meets Imogen, an exotic dancer at aBerlinnightclub, a passionate and intense love story develops. Michael becomes obsessed by mysterious Imogen and falls into a world of intense sexual fantasy and desire. But Imogen is determined to protect a personal, dark secret at all costs and because of this she has forbidden herself love. With Imogen afraid of committing and afraid of losing what she has fought for so desperately, can Michael break down her barriers and discover a solution to his lover's deep dark secret, thus freeing the enigmatic Imogen to truly love him? The Lord of Summer - Jenna Bright Banished to the back of beyond, in the middle of a long, hot summer, Gem and Dan Parker find their marriage filling up with secrets. As they work to reopen the Green Man pub, tensions and unacknowledged desires come between them. From their first night, when Gem sees someone watching them make love from the edge of the woods, her fantasies of having two men at once start to grow and consume her. As the temperature rises, she becomes fixated by her imaginings of an impossible, gorgeous, otherworldly man in the forest. A man who could make her dreams come true - and maybe save her marriage. Off the Shelf - Lucy Felthouse At 35, travel writer Annalise is fed up with insensitive comments about being left \"on the shelf.\" It's not as if she doesn't want a man, but her busy career doesn't leave her much time for relationships. Sexy liaisons with passing acquaintances give Annalise physical satisfaction but she needs more than that. She wants a man who will satisfy her mind as well as her body. But where will she find someone like that? It seems Annalise may be in luck when a new member of staff starts working in the bookshop at the airport she regularly travels through. Damien appears to tick all the boxes - he's gorgeous, funny and intelligent, and he shares Annalise's love of books and travel. The trouble is, Damien's shy and Annalise is terrified of rejection. Can they overcome their fears and admit their feelings, or are they doomed to remain on the shelf?",
  "genres": [],
  "author": "Constance Munday",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/13595785-silk-stockings"
}