{
  "title": "Pulling Home",
  "description": "It’s all about that second chance… Sometimes we’re lucky enough to get that second chance—in life and in love. That Second Chance Series are stories of strong women who battle heartache and loss with courage and determination to find new paths and true love. These books are standalones and are NOT related. Therefore, the characters from one story will not appear in another. What ties them together? A common theme—belief in the beauty of that second chance. Pulling Home is Book One in That Second Chance Series. She'll risk anything to save her child…even the truth It’s taken nine years and a cross-country move, but Audra Valentine Wheyton has kept her secrets safe. She’s created the perfect life—a husband who loves her, a daughter she adores, and a position as head writer for an award-winning daytime soap. When her husband dies suddenly, Audra returns to her hometown for the funeral and faces a community that has not forgotten her meager beginnings and a man who has never forgiven her for marrying his brother. Jack Wheyton is a successful pediatric neurosurgeon who is about to become engaged when Audra walks back into his life with her daughter. He forgave his brother long ago for taking something that had been his, something he hadn’t even realized he wanted until it was gone. But forgiving Audra is another story…and forgetting her? Near impossible. When a shattering illness strikes Audra’s daughter, she turns to Jack to save her child and risks exposing a secret that will change their lives forever. That Second Chance Series Book One: Pulling Home - She'll risk anything to save her child...even the truth Book Two: The Way They Were - Tragedy tore them apart, destiny will bring them back together Book Three: Simple Riches - What is real weath? Book Four: Paradise Found - How does one see truly? With the heart or with the eyes? Book Five: Not Your Everyday Housewife Book Six: The Butterfly Garden",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Fiction",
    "Second Chance",
    "Amazon",
    "Chick Lit"
  ],
  "author": "Mary Campisi",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/13595760-pulling-home"
}