{
  "title": "Once Upon A Second Chance",
  "description": "What happens to your Happily-Ever-After when your Fairy Godmother doesn't show up for work?Julia Basham’s life was perfect. She was finally done with school, about to start an internship with a prestigious financial company which would lead to a great job and, best of all, she’d just become engaged to her very own Prince Charming, Nicholas Kerkley. Unfortunately, while Nick was warm, intelligent, and completely devoted to Julia, he was also a college dropout, with no job to speak of, and almost completely broke. While none of his shortcomings were a problem for Julia, they were a big problem for her older sister Lisa, who told her that a guy like Nick wasn’t proper marriage material for a girl on the fast track to success, Julia began to reconsider the relationship. Although she didn’t wholeheartedly agree with Lisa, after some thought Julia decided that she would take her sister’s advice and end her engagement with Nick, convincing herself that it was the right thing to do. Only after breaking Nick’s heart, and her own in the process, did Julia realize what a horrible mistake it was. As the story opens nearly a decade later, Julia is the quiet shadow of the woman everyone thought she’d be, who’s once fulfilling life has fallen into a stale and safe existence. Her shell of a world is thrown into upheaval when she finds out that the financial planning team she works for has taken on a new client; a now successful and very rich Nick Kerkley. Stuck in a horribly awkward situation, Julia makes a decision–take charge, step up, and find her own happy ending. However, she quickly realizes that fairy tales aren’t as straight forward as we’ve been brought up to believe. Sometimes, to get to happily ever after, you have to stop waiting for fate, strap on a pair of wings, and be your own fairy godmother.Once Upon A Second Chance, is a modern yet whimsical take on Austen’s classic love story, Persuasion.",
  "genres": [
    "Romance",
    "Contemporary",
    "Chick Lit",
    "Retellings",
    "Contemporary Romance",
    "Realistic Fiction"
  ],
  "author": "Marian Vere",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/13596547-once-upon-a-second-chance"
}