{
  "title": "Thoughts Without Cigarettes",
  "description": "The beloved Pulitzer Prize-winning novelist turns his pen to the real people and places that have influenced his life and, in turn, his literature. Growing up in 1950's working-class New York City to Cuban immigrants, Hijuelos journey to literary acclaim is the evolution of an unlikely writer.Oscar Hijuelos has enchanted readers with vibrant characters who hunger for success, love, and self-acceptance. In his first work of nonfiction, Hijuelos writes from the heart about the people and places that inspired his international bestselling novels.Born in Manhattan's Morningside Heights to Cuban immigrants in 1951, Hijuelos introduces readers to the colorful circumstances of his upbringing. The son of a Cuban hotel worker and exuberant poetry- writing mother, his story, played out against the backdrop of an often prejudiced working-class neighborhood, takes on an even richer dimension when his relationship to his family and culture changes forever. During a sojourn in pre-Castro Cuba with his mother, he catches a disease that sends him into a Dickensian home for terminally ill children. The yearlong stay estranges him from the very language and people he had so loved.With a cast of characters whose stories are both funny and tragic, Thoughts Without Cigarettes follows Hijuelos's subsequent quest for his true identity into adulthood, through college and beyond-a mystery whose resolution he eventually discovers hidden away in the trappings of his fiction, and which finds its most glorious expression in his best-known book, The Mambo Kings Play Songs of Love . Illuminating the most dazzling scenes from his novels, Thoughts Without Cigarettes reveals the true stories and indelible memories that shaped a literary genius.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "New York",
    "Autobiography",
    "Biography Memoir",
    "Humor",
    "Biography"
  ],
  "author": "Oscar Hijuelos",
  "average_rating": "3.39",
  "url": "https://www.goodreads.com/book/show/10424369-thoughts-without-cigarettes"
}