{
  "title": "The War of the End of the World",
  "description": "The astonishing events described by Mario Vargas Llosa in The War of the End of the World are based on a real struggle in Brazil that took place at the end of the 19th century. A messianic preacher and ascetic, Antônio Conselheiro, gathered a large band of followers drawn from the poor who lived in the backlands of the state of Bahia. They established a Utopian community at Canudos, but the settlement was seen as a challenge to the authority of the new Republic, who sent several military expeditions, culminating in an invasion by an army of over 8,000 soldiers with heavy artillery. The final destruction of the community was almost total; no more than 150 survived out of an estimated 25,000 people. A journalist who accompanied the army, Euclides da Cunha, wrote a book on the conflict. He finds new life as a character in The War of the End of the World, along with a teeming multitude created by Vargas Llosa: the revolutionary enthusiast Galileo Gall; the crippled boy known as the Lion of Natuba; the ex-brigand Satan João now called ‘Abbot’; a bearded lady and a dwarf from the Gypsy circus … When Vargas Llosa was awarded the Nobel Prize in Literature in 2010, the committee noted ‘his cartography of structures of power and his trenchant images of the individual’s resistance, revolt and defeat’. Nowhere is that statement more true than in this searing account, first published in 1981, of the dangers of fanaticism – whether political or religious.For this edition, The Folio Society has translated a foreword by the author, never previously published in English. It offers us a glimpse into his researches in the villages where the Counselor preached. This is a novel in which place is essential, so we have commissioned two maps: one of Brazil and one of Bahia and the villages around Canudos. We have also commissioned a glossary which includes a section on Brazilian botany, compiled by Stephen Harris from the Department of Plant Sciences, Oxford University. The illustrations are by Ben Cain, whose sense of dramatic composition and colouring complements Vargas Llosa’s magnificent, epic tale.[Source: http://www.foliosociety.com/book/WEW/...]",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Literature",
    "Novels",
    "Latin American",
    "Nobel Prize",
    "Classics"
  ],
  "author": "Mario Vargas Llosa",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/13596647-the-war-of-the-end-of-the-world"
}