{
  "title": "A Measured Risk",
  "description": "Erotica Romance ~ Light BDSM ~ Rubenesque/BBW ~ Regency Historical ~ Novel Length 313 Pages / 78,000 Words Book one in the Regency Risks Series He is her most dangerous temptation, and now he is demanding her submission. Dare she take the risk?Emotionally scarred in the horrific accident that took her husband’s life, Lady Cranfield is imprisoned by her lingering terror of horses and carriages. Lady Cranfield longed to be closer to the fascinating Earl of Ruel. She sensed intuitively that he could teach her how to overcome the terrors that held her in bondage.And now she’s willing to risk almost anything-her reputation, even her virtue-to find out. But what he proposes startles her.When the shy, studious and socially awkward young widow approached him, Ruel instantly sensed she would be the sweetest, most submissive experience of a lifetime-if only he can gain her total and complete trust. He makes her a non-negotiable offer. His help in return for her submission and obedience.But Lady Cranfield grew up neglected by her ducal parents, raised by servants and then later ignored by her handsome, charming husband. She’s learnt to protect her heart at all costs and she trusts no one but herself.How can the jaded Earl of Ruel break through her self-protective defences and show her how to love when he has spent his lifetime avoiding that tender trap?Reader Advisory: This is a work of historical fiction, it is not meant to be an accurate portrayal of or guide to how people recover from Post Traumatic Stress Disorder. It is also not meant to be an accurate portrayal of modern BDSM or D/s lifestyles.This is a work of EROTIC Historical Romance and it uses the graphic language and situations of Erotic Romance. A Measured Risk is published in British English and contains British spelling.**** A MEASURED RISK is definitely NOT a polite \"Austen-like\" romance of manners about members of the gentry. The majority of characters in A MEASURED RISK are wealthy, powerful and jaded aristocrats who are unconventional and do things many others would consider scandalous in their time. The heroine was raised in isolation, away from her own class. She's not quite socialized to fit into society. She has a different set of priorities than other ladies of her time.A MEASURED RISK contains scenes of wild private gentleman’s parties in the country with drinking and sexual licentiousness. If this kind of scenario is offensive to you, you probably would not enjoy A MEASURED RISK.There are no fully consummated scenes of ménage in A MEASURED RISK. No MFM or MMF. Brief FF touching only.",
  "genres": [
    "Historical Romance",
    "Historical",
    "Regency Romance",
    "Erotica",
    "Erotic Romance",
    "Regency",
    "BDSM"
  ],
  "author": "Natasha Blackthorne",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/13596892-a-measured-risk"
}