{
  "title": "All The Little Graces",
  "description": "All The Little Graces is a story of redemption; a colorful tapestry reflecting the lives of a fisherman, a Greek island and her sea, locals and travelers and a lively young girl … all stitched together by a single thread, a homely little stray dog.Set on an Aegean isle in the early 1990′s, All the Little Graces is the Elysian odyssey of a street dog and the American family she adopts. Margarita, the little stray, shatters the peace at the very beginnings of the family’s four month long holiday, drawing the attentions of 12 year old Lily, who hears only a mysterious Siren song in the dog’s incessant barking. What follows in the wake of their first encounter is a long, deeply revealing and sometimes painful journey toward recognizing and rectifying the plight of the island’s stray animals. From knowing and caring for Margarita, Lily and her parents, Eleni and Harry, are drawn into island life and subsequently into the hearts of the colorful but haunted fisherman, Vassili; those voiceless ones, the unwanted animals who live in the shadows and into the hearts of a people, and the elders who line the bougainvillea draped alleyways in the neighborhoods that become home …This testament to compassion follows Margarita through the olive orchards and over sea to sun drenched beaches, it follows Vassili through his pain into the light of his peace and it follows the family on an educational journey pieced together by their caring for the little dog. Through their love of the island, and the lessons in humanity and humility learned from an enigmatic culture, they learn how they can best help bring it’s people and the neglected animals together. Surrounded by the endless sea, the intense peace and the timeless magic that is Greece, All The Little Graces bears witness to goodness brought to light by all of the stories and all of the hearts drawn together by little Margarita. Eventually, it’s through those stories and her tender little graces that hopeful changes begin to emerge from the shadows, as people gain a new and kinder understanding about the unwanted, homeless animals of Greece’s streets.",
  "genres": [],
  "author": "Eleanore MacDonald",
  "average_rating": "4.68",
  "url": "https://www.goodreads.com/book/show/13596929-all-the-little-graces"
}