{
  "title": "Somewhere Over the Rainbow, I've Lost My Damn Mind: A Manic's Mood Chart",
  "description": "I figure that if I have to endure the worst parts of bipolar disorder, like psychosis, I get to laugh as much as possible along the way. Somewhere Over the Rainbow, I've Lost My Damn Mind: A Manic's Mood Chart is the story of one Millennial's bipolar life, with moments ranging from the ridiculous to the terrifying to the hilarious. Blending pop culture references and cyberspeak with psychiatric terms, it combines the funny, conversational tone of Sh*t My Dad Says with a nonlinear narrative structure similar to that of Manic. The book began as a blog: if you had a delusional relationship with Britney Spears, wouldn't you brag about it to the entire world? To create the book, I organized the blog entries like a mood chart, a therapeutic tool which assigns colors of the rainbow to states of mind. The entries are divided into three sections, Depressed, Normal and Elevated, and cover the past three years: my psych ward getaways, my vision of fighting alongside Jesus at Armageddon, my attempts to find a woman who accepts that I sometimes lose my mind. Therapy \"sessions\" with a fictional psychiatrist provide my present-day reflections on each entry. (I had to create my ideal shrink because I tend to fight with the real ones.) Somewhere Over the Rainbow will be the first humorous memoir about bipolar by a member of the Millennial Generation-today's young adults. Because it doesn't follow the usual narrative format, the reader can flip through at random or take the traditional cover-to-cover route. My book's humor, pop culture references and Internet origins will appeal to Millennials, now entering their twenties and thirties, as well as younger Gen Xers. More than an account of coming to terms with a mental health condition, it's a story of being young and feeling lost, dealing with heartbreak and still finding plenty to laugh about, no matter what happens.",
  "genres": [
    "Nonfiction",
    "Mental Health",
    "Psychology",
    "Memoir"
  ],
  "author": "Derek    Thompson",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/13598322-somewhere-over-the-rainbow-i-ve-lost-my-damn-mind"
}