{
  "title": "Conditioned Response",
  "description": "Shayla didn't ask to be a Councillor. She's Phoenician. There's no good reason for Phoenicians to live among the humans. None, except that the Seven Chiefs had ordered her to do it. They'd entrusted her safety to a human Proctor named Raif. They'd said it was all part of the Plan. Well, the Seven Chiefs could keep their Plan. Shayla had plans of her own now and they didn't include the Seven Chiefs or the World Council.     Raif had never intended for things to go this far. A few months, maybe a year, and he could send the little Phoenician girl home again, back where she belonged. After more than a decade, she was not a little girl anymore and he couldn't bring himself to let her go. He had no idea why he'd never seen her like this before but now she was all he could think about. A Proctor shouldn't think, certainly not about his Councillor that way.    As Raif finds himself in competition with his own progenitor for control over his Heir (and future) Shayla discovers Raif's past. He was never meant to be a Proctor. Is this what the Seven Chiefs had intended from the start?~#~    Baldwin hooks you into her world and pulls you along with her characters. You'll think about this book even when you're not reading it. You'll wonder if that was the Plan all along. The only bad thing to say about this book is that it ends, but it's a series book so at least the story will continue--or will it?(This book contains strong language, explicit sexual situations and some graphic violence; therefore, it may not be suitable for all audiences.)A portion (10%) of the net proceeds from the sale of this book will be donated (by the Author after Amazon pays out royalties) to a non-profit organization supporting our Wounded Warriors. Please visit Friday's \"Read a Book, Make a Difference\" page at bit.ly/fridayRABMAD to learn more.",
  "genres": [
    "Science Fiction",
    "Romance",
    "Thriller",
    "Dystopia"
  ],
  "author": "Marjorie F. Baldwin",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/13598337-conditioned-response"
}