{
  "title": "GAMELAND: Season One",
  "description": "SERIES DESCRIPTION:In the center of Long Island's forbidden wasteland, overseen by a large and powerful corporation known as Arc Properties, is GAMELAND, a virtual reality arcade where the rich and privileged act out their base fantasies using zombies as avatars. Connected to their Infected Players via neural implants (government-mandated in the event of an outbreak), Operators pit the Undead against one another using remote gaming controllers in a high stakes game of money, violence, and power. For the poor, the televised action on state-controlled Media streams is horrifying yet powerfully addictive. Volunteering to become an Undead Player is strictly forbidden, but fame and money lure some to The Game.On a whim, a small group of computer hackers and gamers decides to sneak onto the island, hoping to catch a glimpse of the uncontrolled Infecteds, unimplanted victims of an outbreak that took place there over a decade earlier. But while breaking in turns out to be a lot easier than any of them could have ever imagined, getting back out is one a hell of a killer. As they soon discover, when you play, you play to win. Because, if you die, you become part of The Game. The series consists of eight episodes publishing monthly through December 2012. Also available in paperback.EPISODE 1: Deep Into the GameZpocalypto gamer Jessica Daniels and her gang of code jackers decide to break into Long Island's Gameland hoping to catch a glimpse of some of the Infected Undead, risking arrest and an extension to their Life Service Commitment (a civil or military obligation fulfilled after death). But getting past the EM field, the wall surrounding the island, the mined waters, requires the addition of a stranger to their fold. Tensions within the group rise. So do the risks. After a near-fatal accident during preparation nearly takes the life of one of their members, emotions run dangerously high. They press on and find an abandoned wasteland like nothing they ever expected. Excitement quickly turns to dread as the dangers become all too clear.Approximately 50,000 words (~185 pages)EPISODE 2: FailsafeJessie and Kelly clash after one of their group gets stranded among the Infected Undead, forcing Kelly to make a rash decision which will ultimately deliver them into the hands of those who would turn them all into mindless players in The Game.Approximately 50,000 words (~185 pages)EPISODE 3: Deadman's SwitchUnable to escape from Long Island because of the failsafe device implanted inside their brains, the group digs in until they can devise a way to neutralize it. Jessie is anointed as their leader despite Jake's claims that she is unfit. A final desperate attempt is made to leave, setting into motion a sequence of events that will result in one of them dead, another infected, and all of them running for their lives.Approximately 52,000 words (~192 pages)EPISODE 4: Sunder the Hollow OnesA mutiny in the group splits the members, leaving Jessie out in the cold. As she continues to struggle to fulfill her promise to bring everyone safely home, a chance encounter with one of Gameland's residents dredges up deeply buried memories, leaving her feeling haunted and doubtful about her future.Approximately 44,000 words (~160 pages)EPISODE 5: Prometheus WeptAfter one member of their group is infected, Jessie makes a decision to hand over another to a mysterious group of Undead sympathizers in exchange for a promised antidote. But will she be able to collect the medicine and return before it's too late? Will the medicine work? And will she be able to get them all back home again?Approximately 41,000 words (~150 pages)EPISODE 6: Kingdom of PlayersArmed with a potential antiserum to the reanimation virus, Jessica races back to Gameland to save her infected friend. Waylaid along the way, she must fight for her life to save another. Will she make it back in time? Or will her friend die and return as one of the Undead?Approximately 41,000 words (~150 pages)EPISODE 7: Tag, You're DeadTorn between rescuing Ashley from the homicidal Ben and staying with Jake, who's been infected, Jessie, Kelly and Reggie must carefully plan their next move. But Reggie falls ill and the Undead break into their stronghold. Soon they're fighting for their lives in a battle that will lead all of the group to their darkest hour.Approximately 47,000 words (~170 pages)EPISODE 8: Jacker's CodeThe shocking conclusion to the high-tech horror thriller, GAMELAND. Jessie and the remaining gamers and hackers struggle against all odds to escape Gameland and Long Island, even though some of them have been infected with the zombie virus. Determined to do whatever is necessary to get home, they will have to face some of the most difficult decisions of their lives. But even if they're successful, will they ever be able to go back to the lives they so recklessly left behind?The world is suddenly a very different place from the one they left behind, and not all monsters live behind walls.Approximately 54,000 words (~196 pages)",
  "genres": [
    "Zombies",
    "Horror",
    "Science Fiction",
    "Cyberpunk",
    "Fiction",
    "Dystopia",
    "Apocalyptic"
  ],
  "author": "Saul W. Tanpepper",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/13598429-gameland"
}