{
  "title": "The Prince and Betty",
  "description": "Royal Romance—Prince Weds American Girl—Love at First Sight—Picturesque Wedding!These are the headlines American businessman Benjamin Scobell envisions when he pieces together his latest scheme: a publicity stunt designed to attract customers to his newly built casino on the Mediterranean island of Mervo. If only he had a few royals running around making headlines he knows his little rock could compete with the likes of Monte Carlo. Mervo hasn’t had a prince in years, but that doesn’t dissuade Benjamin from tracking down the long-lost heir to the throne, and when he finds him, he’s going to introduce him to the perfect girl for him, his stepdaughter Betty.Betty Silver has it all. She’s pretty, popular, and thanks to her stepfather, she’s filthy rich. She’s also lonely. Her friends in New York are starting to find love and get married, and Betty’s starting to think love isn’t in the cards for her. Every man she meets can’t see past her stepfather’s millions. Every man but one, that is, and she’ll probably never see him again. So when her stepfather summons her to Mervo, she’s ready for a change of scenery.But things don’t go quite as Benjamin planned. Turns out his new prince and his stepdaughter have a history together and Benjamin’s meddling schemes are about to blow up in his face and send Betty running back to New York to nurse a broken heart. But her prince is determined to win her back and prove to her he is the man she thought him to be after all, and sets off to track her down. A series of circumstances and coincidences in New York work to keep the lovers separated, but neither gangsters, nor unscrupulous businessmen, nor demanding newspaper editors can turn their hearts, and you’ll never guess how they finally end up reuniting!The Prince and Betty is a delightful read that sweeps the reader from a Mediterranean paradise to the seedy underbelly of the Big Apple, with plenty of excitement, humor, and love to help it along its way to a heartwarming conclusion.Bonus Content: Introduction, Glossary, Image GalleryLegacy Vintage Collection Enhanced eBooks have been professionally edited for readability and professionally formatted for your favorite e-reader! View more on The Vintage Reader.",
  "genres": [
    "Fiction",
    "Humor",
    "Romance",
    "Classics",
    "Comedy",
    "20th Century",
    "Historical Fiction"
  ],
  "author": "P.G. Wodehouse",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/13599010-the-prince-and-betty"
}