{
  "title": "Kat Fight",
  "description": "The seriously funny, fabulously flawed Kat Porter has arrived, and she may just steal your heart—not to mention your boyfriend. Readers everywhere will revel in this sharp-witted, well-meaning whirlwind in author Dina Silver’s hilarious new novel, Kat Fight. In her quest for love, Kat makes every wrong turn, juggling two men, one best friend, and her own deeply confused heart’s desires.Kat Porter is a consummate romantic, eager for her chance to find love and commitment. But after her boyfriend of four years, Marc, begins to grow apathetic and sends her calls straight to voicemail one too many times, Kat finally musters the courage to confront her so-called sweetheart, who seems more interested in dodging her than courting her. Though she’s no fan of ultimatums, Kat is at the end of her considerable wits, and lobs a massive one his way, completely confident that he'll make the right decision when faced with losing her. He doesn't. With radio silence from Marc, Kat’s lifelong dream of finding a husband and forging a family is decidedly on the skids. That’s when her childhood friend Julie steps in, forcing Kat on a blind date to help her move beyond the break-up. Not only does Kat botch the setup, she instead finds herself in hot pursuit of Julie’s love interest, Ryan Sullivan. A man who, in addition to literally taking her breath away, is the living, breathing personification of everything Kat wants in a husband.Can Kat connect with the man of her dreams without hurting two of the people she cares most about? At the same time, she must also contend with the quips of her beloved catty coworker Adam, her bi-polar boss Brooke, and a string of comic, unpredictable plot twists. All the while, Kat’s cheeky perspective and generous heart will leave readers adoring every moment of her journey while chuckling and cheering for the ever cute, razor-sharp Kat as she fights to land the love of a lifetime.",
  "genres": [
    "Chick Lit",
    "Romance",
    "Contemporary",
    "New Adult",
    "Humor",
    "Young Adult",
    "Romantic Comedy"
  ],
  "author": "Dina Silver",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/13599220-kat-fight"
}