{
  "title": "Beat Your A-Fib: The Essential Guide to Finding Your Cure",
  "description": "Atrial Fibrillation (A-Fib) is the most common cardiac arrhythmia (abnormal heart rhythm) seen by physicians. Many patients suffering from Atrial Fibrillation have three strikes against them:1. Their “quality of life” has deteriorated; they are scared or frightened.2. Many experience side effects from the common drug therapies or simply do not want to live on medication; a cure for their A-Fib hasn’t been discussed.3. Patient information is often out-of-date, incomplete or biased toward a specific pharmaceutical or treatment; much information about new treatment options is written in the language of scientists and doctors. The author, Dr. Steve Ryan, PhD, a former A-Fib patient, addresses all these issues. His book is written for the newly diagnosed patient and any A-Fib patient who doesn't want to wade through medical texts and research journals to understand their disease. Beat Your A-Fib helps patients and their families look beyond the commonly prescribed drug therapies that only manage the disease, but do not cure it. Beat Your A-Fib: The Essential Guide to Finding Your Cure offers: • Unbiased, up-to-date information and best practices • Medical terms and concepts translated into everyday language• Non-drug treatment options including Cardioversion, RF catheter ablation, Pulmonary Vein Isolation, CryoBalloon, Cox-Maze and Mini-Maze surgeries, and AV Node Ablation with Pacemaker• Research-based content with a bibliography of over 150 medical references• ‘Lessons learned’ from A-Fib patients now enjoying lives free of the burden of A-Fib• Recommended Resources and Website Links• Patient tools to become their own best healthcare advocateThis unique book helps patients research their best treatment options, steps through how to find the right doctor for their type of A-Fib and treatment goals, gives patients hope and empowers them to develop a plan for finding their A-Fib cure or best outcome.Dr. Walter Kerwin, MD, of Cedars-Sinai Medical Center Los Angeles, California, wrote the Foreword for the book. Dr. Steven C. Hao, MD, of California Pacific Medical Center, San Francisco, California, penned the Introduction. Dr. Steve Ryan, PhD, is a noted healthcare educator and advocate for patients with Atrial Fibrillation, and former A-Fib patient. He earned his Ph.D. in Educational Communications from the Ohio State University.",
  "genres": [
    "Medicine",
    "Health",
    "Nonfiction"
  ],
  "author": "Steve S. Ryan",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/13599762-beat-your-a-fib"
}