{
  "title": "Particle Horizon",
  "description": "Semifinalist in the Kindle Book Reviews 'Best Indie Books of 2012' Competition. From the blood and dust of New Jerusalem, the Legion of the LightBringer wages a galactic war against those who would replace their god. Now, the time has come for the Union of Free Worlds to make a stand. The front line is the idyllic asteroid world of Angelhaven, where the greatest mind in human history has discovered an elemental power with far-reaching implications. A power that both sides will do anything to harness. Marine commander Gomes leads the crack Union task force. An unrelenting warrior driven by revenge and a need for answers, he hides a strange ability neither science nor religion can explain. On the other side of the war, Aja is forced to fight for a cause she doesn't believe in to protect her own secret. Caught between them is Una, a living machine who battles for her humanity as her world falls apart. Outnumbered ten to one and stalked by a mysterious nemesis, all three will play a role in unraveling Angelhaven's enigma. As the Legion invasion begins, unknown eyes watch with interest... Semi Finalist in the Kindle Book Reviews Best Indie Books of 2012 Competition. Particle Horizon is a fast-paced, gritty and action-packed space opera. For more information or to leave comments for the author, selsoxisto.wordpress.com \"Particle Horizon is not only a riveting science fiction novel but this deeply engaging story also touches on morality, religious expression, love, and what it means to be human. Selso Xisto has combined fantastic science fiction with truly heartfelt existential yearning to create a story that is hard to put down... There is a lot more to this work than simple entertainment. Particle Horizon is an exceptional book that provides many levels of interest for a wide range of readers beyond the regular sci-fi fan.\" - Melinda Hills, Readers’ Favorite \"...In my opinion mainstream science fiction publishers should read this as for me it is as good as most of the mainstream authors out there and I would happily add him to my list of must purchase...I just hope that this is the first of many. I highly recommend this book! 5 Stars!\" - Darkissreads \"If you pick up this novel, then expect a fast-paced tale of heroism, sacrifice, megalomania, fanaticism combined with building new relationships and coming into your own, free of the oppressive influences of others. In short, this was fantastic!...9/10\" - The Founding Fields \"Particle Horizon is a surprisingly entertaining, well written and fast-paced science fiction book. I'm sure that readers, who aren't used to reading to science fiction, will be delighted to read this book, because the plot moves fast forward and the characters are interesting. I think that experienced readers will also enjoy this book, because the story is entertaining \" - Risingshadow",
  "genres": [
    "Science Fiction",
    "Amazon"
  ],
  "author": "Selso Xisto",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/13599904-particle-horizon"
}