{
  "title": "Clive Worth's Internet Dating Seduction Guide",
  "description": "Clive Worth is, without doubt, the master of internet dating. If you ever wanted to know the fastest, easiest and best way to seduce someone through an internet dating site then Clive Worth’s Internet Dating Seduction Guide is all you will ever need. When it comes to dating success then you can forget going to Salsa classes to pick someone up and also forget astrological compatibility charts – they are a little long-winded and time consuming. Read what the internet dating king has to offer you, his guidance is out of this world. This is the sort of book that you can mark up and highlight, and you will keep delving into it for the best dating advice there is.Meshed with real life dates that Clive personally has had success with he will show you exactly what to do and what not to do. A very adult-like and sexually candid book, this is recommended for an adult readership only. If you are not broadminded then please do not read this book, as it is has graphic sexual narration.Intertwined with Clive’s own dating success stories is his advice and guidance, from how to tell the size of a woman’s vagina by just looking at her to how to instantly know if they will sleep with you through just one simple action. See the exact advert copy used by Clive to attract interest from potential online dates. Find out the methods to make them change their mind when you think your date has gone off you. All of this and more is within this book that is guaranteed to liven up your dating success and even your sex life!Although Clive is heterosexual, this book’s content could even be used to attract and seduce either sex by using the exact same methods for both. There are no long-winded instructions or pick up lines to remember. It’s all so simple, and no one can guide you into seduction success like Clive Worth can. THE AUTHOR SAYSInternet dating could be your greatest dream or your worst nightmare. You’ve got the chance to meet people who you would never normally meet. I just love finding love on the internet, especially casual love. Too many people disguise their real intent by going on these internet dating sites, posing as ‘first timers’ wanting long term love, when all they want is a f***. Don’t let them tell you anything else!AUTHOR BIOGRAPHYClive Worth was born in 1949 in a little village in west Wales called Pontyates. Clive now lives in Drefach, Carmarthenshire, where he carries out his hobby of internet dating and writing. In 1967, aged seventeen, he went to train in an old colliery in Gorseinon and worked for what was then the National Coal Board. Since retiring on a miner’s pension, Clive has authored numerous books about internet dating and has starred in many TV documentaries on the same subject which have all aired globally. His internet dating success has been attributed to the special methods he uses to secure regular dates, and has resulted in him bedding over 1,000 women. Clive still offers advice and has numerous social networking profiles including his YouTube channel of worthalot2.",
  "genres": [],
  "author": "Clive Worth",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/13600628-clive-worth-s-internet-dating-seduction-guide"
}