{
  "title": "Erotic Sex Stories of a Serial Internet Dating Lover",
  "description": "Clive Worth, the master of internet dating and sex, swiftly takes you to his bedroom and beyond as he applies his expert techniques on some of the world's most stunning women, some even less than half his age! His erotic stories of internet dating encounters bring this no holes barred subject matter to life. If you are seeking an uninspiring book with endless lists of tips and tricks to be used by internet sex seekers then forget this book. For those seeking to become highly successful at the bedroom stage of internet dating then you will find this book is a whole plethora of sexual content that is thicker than creme fraiche.Continuing on from his books “A Serial Shagger's Guide to Internet Dating” and “Internet Dating King's Diaries”, Clive graphically reveals what people used to do in bars and with classified ads are now doing through internet dating. If want more sex through internet encounters then you’re looking in the right place, this book is filled with more steamy erotica than on the top shelf at your local newsagent!Some may say this is tasteless drivel and simply aimed at those seeking an internet date that leads to sex and internet hook-ups. Certainly the reader gets a true account of what really goes on with internet dating and plenty of graphic and exciting erotic frissons that will have you panting for more. Forget the endless lists of tips and tricks for successful seduction ... this lands on its feet running. Clive spills over with unbridled sex stories, lays bare the secret sex fantasies of his on-line dates along with his most shockingly intimate secrets. These stories directly from the Internet Dating King’s own sexploits will keep you hooked and shouting out for more.Only read this if you have an open mind. If you want wit then read Stephen Fry, if you want hot internet dating sex stories then read this! This is not old, re-hashed sexless material. If you want to enhance your sexual desires then you will certainly learn a thing or two from this book about online dating success. This is an honest account of one man's desires and consequent success in making them happen. There is also plenty of advice and tips for better sexual technique and enjoyment for both sexes.About the AuthorNobody knows more about internet dating than Clive Worth. He is the most prolific internet dater ever, leads a very colourful love life and is the subject of numerous TV internet dating documentaries aired around the world. From being an illiterate miner he has clawed his way up through the seedy world of online dating to become the man TV companies’ chase for their numerous TV documentaries on internet dating. Star of TV’s “Love Rat and Proud”, “My 100,000 Lovers” and “Studs of Suburbia”. The slimy nature of the press paints a gory picture of self-confessed love rat Clive Worth. But in reality the Welsh lothario from the sleepy Welsh village of Pontyates has a real story to tell of his search for the love and affection he never got as a child. The Chris de Burgh look-a-like has dated over 1001 women through internet agencies. Now banned from one agency for being too successful Clive says, \"Women who meet men over the Internet don't want people to know what they are doing.\"",
  "genres": [],
  "author": "Clive Worth",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/13600620-erotic-sex-stories-of-a-serial-internet-dating-lover"
}