{
  "title": "A Sting in the Tale",
  "description": "The only and fully authorised memoir of Sting and Jim Berryman’s time together is, indeed, a hilariously, eye-wateringly funny read. Just imagine a P.G. Wodehouse book, and substitute Jeeves and Bertie Wooster with Sting and Jim and you'll have the right picture! Imagine Sting grabbing at one of the Beatles’ hair in a desperate attempt to get a piece of one of them! (It really happened!) A Sting in the Tale is the sort of book to read if you appreciate humour. The author is included in most of the stories, this interaction sees Jim Berryman as the stooge to Sting's alter-ego ... his real self. The frankly hilarious book cover stories of misadventure that takes an episodic approach to presenting a decidedly more down-to-earth view of Sting than read or seen elsewhere.Sting and his best friend Jim Berryman are caught in various real-life situations that happened to them from when they first went to school together right up until Sting became one of the most successful superstars in rock history! Despite the gap between wealth and happiness, Jim and Sting have remained best friends to this day. It was at Sting’s prompting that Jim penned this biography, which tracks their friendship through thick and thin from the school playing fields to their days as trainee warehousemen. This oblique look at his friendship with Sting will hold your attention through the short, succinct and often very funny chapters of this book.Although there’s always been a sense of mystery around Sting, this book will soon have you laughing your socks off at how the-boy-who-would-be-Sting reveals, through his friendship with the author, a side to the singer that has never been seen before. Every chapter, all forty-one of them, has something to make you laugh. Jim Berryman might stand accused of patronising Sting, but he pulls no punches when he says he’s the better singer between the two. The rainforest-loving Sting is also accused of pampering to his fans when in the past, Jim says, Sting would have had no time for such burning issues. It is entertaining and worth a read by any dedicated Sting fan, as well as those interested in a humorous read about growing up in the 1960s. This book is a piece of history and shows how Sting is human, after all!STING SAYS\"Jim Berryman once told me, after a particularly bad day at the race-track, that he felt so low he wanted to hang himself and would I lend him the money so he could buy himself the rope.\" JAMES BERRYMAN SAYS“When I meet Dustin Hoffman and Tom Hanks by the poolside at Sting’s mansion it seemed that our differing worlds were about to collide! ‘You two look like you’re ready to take the plunge?’ I said nodding towards the swimming pool. One of the yanks ‘I think he’s already married.’ “They both departed so I picked up another glass of Krug. I was more used to Newcastle Brown Ale. I lived in Newcastle upon Tyne on a housing estate and I didn’t have a brass farthing.”FROM THE PUBLISHERThis biography receives the full approval of Sting and with the foreword contributed by Sting it is a must-have for any self-respecting Sting fan. Written by Jim Berryman, Sting's friend since schooldays, it is so funny. Read of the day Jim hoodwinked Sting into attending the races with him and the promised hotel turned out to be a tent on a nearby golf course. World famous Sting sleeping in a tent, never! This book is award-winning stuff. Serialised in two UK national newspapers and featured as Night & Day magazine’s book of the week, also featured on the Richard & Judy show and featured in an Irish national Sunday newspaper.",
  "genres": [
    "Biography",
    "Music"
  ],
  "author": "James Berryman",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/13600993-a-sting-in-the-tale"
}