{
  "title": "Corporate Ninja - attract what you want and play the game to win!",
  "description": "Read and enjoy Corporate Ninja's secrets, but don’t tell anyone else about this book. Don’t consult it openly; keep it locked away in your desk drawer. Then you can look forward to a long and fruitful career, at the expense of others. Hilary believes in the traditional definition of power and money. Every other definition has simply been invented by those who have money and power, to try and convince you that you don’t want what they have already got. That’s less competition for them. Don’t fall for it.Any promising executive or CEO who wants to get to the top the sneaky learn how to get there in a Ninja-like way without appearing to trample everyone underfoot. This kind of advice would stretch the budget of even those stratospheric members of the top flight, but we have persuaded this doyen of company politics to share their knowledge, accumulated over many years, that will allow the ambitious to reach their goal in the same way that Hilary did – like a Ninja - quietly, effectively, deadly – and become the Ninja of the corporate world.An old campaigner who has already risen to the top of the tree, the author has struck fear into the heart of a few, but most never realized who it was that derailed their career, suggested a rival for a promotion, sidelined their major project into the depths of the three-year plan or engineered the plucking of their best staff into a different department. It’s only now that Hilary has retired that these secrets can be shared. You will learn how to spend as little time as possible managing your staff without anyone noticing; see how to avoid being seconded to a doomed-to-fail project; and discover how you could sleep your way to the top. This book focuses largely on the types of people that you will encounter, and how to deal with them. But in order to do this well, you need, like any Ninja, to know yourself first – what you are good at, and what you need to hide or steal from others. Shows us all how to play the game and win any way we can!There is the key section on the different types of people that you will encounter – whether they are your boss, your colleagues or your staff, you must learn how to identify them so you can outmaneuver them. There are some insightful principles on what to do, and what not to do. There are some ploys you can engage to further your career, and likewise there are some terrible mistakes lurking out there, waiting for the unwary or unwise.There are many scenarios covered in this book that focus on some of the different situations in which you might find yourself, with some of the people in context, where you are given some useful advice. This may be getting a new job in a new company or a new job in the same company.A list of definitions within gives the true meaning of misused words and phrases; some indoor games for when you are bored; some appraisal terms to stop you from giving HR a collective coronary; and notes on upgrading job descriptions to boost your role (or your staff’s, if you are feeling magnanimous).",
  "genres": [
    "Self Help"
  ],
  "author": "Hilary Wilson-Savage",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/13601041-corporate-ninja---attract-what-you-want-and-play-the-game-to-win"
}