{
  "title": "Blue Bunny & Snoopy: How their Love Got Me through  my Daughter’s Gap Year!",
  "description": "The powerful, very personal and deeply moving true story of how two cuddly characters, Blue Bunny and Snoopy, kept the love going between daughter and mother during a very intense time. This is the text and e-mail diary of how one mother, Fiona Fridd, coped (or didn’t) during her daughter’s her gap year! After the farewell hugs and tears, the story moves on to the how these two cute, loveable characters from her daughter’s childhood days helped keep the dialogue of love going between mother and daughter. The amazing story of how Blue Bunny and Snoopy eased the emotional pain that any mother would go through after being parted from someone as precious as an only daughter. Contact between mother and daughter was chiefly maintained by text and email, which are transcribed word-for-word. These build up into a fascinating picture of the realities of backpacker life ‘down under’ in Australia, Bali and Hong Kong.Fiona “I’m not ashamed to say that I cried myself to sleep that first night. I thought I’d feel better if I cuddled Snoopy, Lottie’s most precious cuddly toy. I thought again that that would be silly of me, but the next moment I found myself slipping out of bed. Five steps later I was standing in front of the large easy chair where Lottie had placed him before she left. ‘Oh Snoopy!’ I stammered, ‘Lottie’s gone!’ “He felt so very small and vulnerable. So did I. I could smell Lottie on him. I breathed in deeply; feeling Snoopy so close made Lottie seem not quite so far away, not quite so untouchable. My sobs eased a little and I got back into bed, curling my body up tightly.”E-mail extract from Fiona to her Lot! Great to hear from you! Hope the freebies keep coming! Can’t get phone signal – will try tomorrow. Just off into Wells. Loads of love & hugs etc. Snoopy says Hi! He’s very happily cuddled up with Blue Bunny inside Daddy’s top hat!Fiona’s daughter Lottie (e-mail extract):I’ve quit the Oxfam job. It turned out that working for them basically means you’re a glorified promotions girl and to get people to sign up they tell you to make guys think they can sleep with you! I was told to say stupid stuff like ‘Hey guys, why don’t you come and talk to me, I’ll make it worth your while’. Anyway, must dash as almost run out of internet credit! Missing you all lots and lots! XoxAbridged extracts - Fiona “It wasn’t until months later that I discovered just how badly affected Lottie had been by the Oxfam job. At the end of her second day of standing on street corners she had phoned David in floods of tears. He and Stu hotfooted it into Sydney and found her in a dreadful state. All she wanted to do was come home there and then and quit the remainder of her gap year.” “At long last, my family was back together again. Life without Lottie had finally ended for us all. That evening, when I went up to bed, Nick’s top hat was empty. Both Snoopy and Blue Bunny were gone. I asked Lottie about them the following morning. With a broad grin on her beautiful little face, she said ‘…they slept with me last night’.”Fiona Fridd, the only daughter of a GP/Surgeon, was born in Banbury, Oxfordshire in 1955. Having boarded at The Ladies’ College, Cheltenham for five years, she then completed her education in Oxford before going on to work in London for several years as a pensions analyst. In 1985 she married Nick, a barrister. In January 1988, their daughter, Lottie was born and, 22 months later, their son, John. In 1993 the family moved to Somerset where Fiona runs a successful B&B business from a 15th century farmhouse.",
  "genres": [],
  "author": "Fiona Fridd",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/13601062-blue-bunny-snoopy"
}