{
  "title": "The Dark Victorian: Risen",
  "description": "“Way will open.”   She is Artifice. A resurrected criminal and agent of HRH Prince Albert’s Secret Commission. An artificial ghost. A Quaker.   He is Jim Dastard. The oldest surviving agent of the Secret Commission. An animated skull. A mentor to newly resurrected agents.   In a mechanical and supernatural London, agents of Prince Albert’s Secret Commission, their criminal pasts wiped from their memories, are resurrected to fight the eldritch evils that threaten England. Amidst this turmoil, Jim Dastard and his new partner Artifice must stop a re-animationist raising murderous dead children. As Art and Jim pursue their quarry, Art discovers clues about her past self, and through meeting various intriguing women—a journalist, a medium, a prostitute, and a mysterious woman in black—where her heart lies. Yet the question What sort of criminal was she? A new beginning, a new identity, and new dangers await Art as she fights for the Secret Commission and for her second life. Experience female detective mysteries with a Victorian A gaslamp fantasy in a steampunk, paranormal London, follow the dangerous adventures of an uncanny female sleuth and her senior skull partner set in the same alternate world as Elizabeth Watasin's Victorian Gothic series, The Elle Black Penny Dreads.Enjoy a bonus Art The paperback version of Dark Risen contains a small gallery of illustrations by Elizabeth Watasin.Learn more about the debut of this intriguing, steampunk lesbian It is 1880; black arts sorcery had its time to grow in England and to battle the eldritch evils threatening, HRH Prince Albert's Secret Commission is born. Executed criminals are brought back to life without memories to fight as agents, and among those resurrected is Artifice, a six foot tall strongwoman, Quaker, and artificial ghost, guided by her senior partner, Jim Dastard, the animated skull.Once awakened, Art knows only that she has risen with one to protect and serve England.  Her first mission is to track down a re-animationist who has raised murderous dead animals and children to take revenge upon the living. To do so she must quickly learn more about her past, her new ghostly powers, and especially how she must face threats when her Quaker nature interferes with the needs of battle.But as the re-animationist rallies for a final confrontation, Jim, Art's skeptical partner and the most senior, surviving agent of the Secret Commission, learns what Art will do, and more.The Dark Victorian series, a unique take on lesbian historical Set eighteen years before words like 'homosexual' and 'lesbian' had yet to be invented, the world of the Dark Victorian series continues the 19th century tradition of British female marriage and romance into a future where same-sex unions thrive. Into this world, Artifice is reborn and while only four days living, quickly learns–from her encounters with a madwoman journalist, a mysterious woman in black, and a French prostitute–where her heart lies . . .Dark Risen is the debut paranormal steampunk tale from speculative fiction storyteller Elizabeth Watasin, who delights in bringing you shilling shockers immersed in Gothic Victorian mystery, women sleuths, and the eldritch vestiges of an otherworldly London. Enjoy the deadly battles of a Victorian superheroine and her skull partner as Artifice and Jim Dastard rid the world of threats and monsters.\"Risen is only the first of what promises to be a thoroughly enjoyable (if delightfully disturbing) series.",
  "genres": [
    "Steampunk",
    "Fantasy",
    "Mystery",
    "LGBT",
    "Historical",
    "Paranormal",
    "Lesbian"
  ],
  "author": "Elizabeth Watasin",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/13601210-the-dark-victorian"
}