{
  "title": "Stil novo: La rivoluzione della bellezza tra Dante e Twitter",
  "description": "Forse non avete mai pensato al granduca Cosimo come a un rottamatore ante litteram. Considerare Dante un modello per la sinistra probabilmente vi stupirà, e di sicuro stupirebbe lui. Qualcuno troverà fuori luogo il paragone tra il “tecnico” Machiavelli e Mario Monti o tra la burocrazia ai tempi del Vasari e quella di oggi. Ma la storia di Firenze ha molto da insegnare alla politica contemporanea. I fiorentini realizzarono un miracolo chiamato Rinascimento investendo bene la montagna di soldi che erano stati capaci di guadagnare, e con quei soldi finanziarono opere utili e belle. Costruirono orfanotrofi e ospedali. Sovvenzionarono gli artisti ma si preoccuparono di accogliere i bisognosi. E non ebbero paura di mettere a confronto Leonardo e Michelangelo, con un sistema davvero meritocratico. Era un altro mondo, allora le banche salvavano gli Stati, come accadde con la corona inglese. Oggi invece succede il contrario: gli Stati salvano le banche. E dopo averle salvate non mettono nemmeno in discussione gli stipendi ultramilionari dei manager responsabili dei fallimenti. Anche i politici hanno le proprie colpe: rinunciano all’idea forte, preoccupati solo per la propria poltrona. E poi, umiliati e sconfitti, lasciano spazio ai tecnici, chiamati a costruire sulle macerie della loro pavidità. Ma non usciremo dalle difficoltà solo con una manovra finanziaria. La politica ha bisogno di uno stile nuovo, che sappia coinvolgere le persone, emozionarle. Per parlare una lingua comprensibile a tutti, e per renderci di nuovo patria della bellezza e non regno della volgarità. Matteo Renzi ce lo dimostra in questo libro che intreccia storia e attualità alla ricerca di soluzioni per il nostro Paese. E lancia una provocazione alla classe dirigente: l’Italia ha ancora un’anima?",
  "genres": [],
  "author": "Matteo Renzi",
  "average_rating": "3.11",
  "url": "https://www.goodreads.com/book/show/13601399-stil-novo"
}