{
  "title": "Lean Thinking: Banish Waste and Create Wealth in Your Corporation",
  "description": "In the revised and updated edition of Lean Thinking: Banish Waste and Create Wealth in Your Corporation, authors James P. Womack and Daniel T. Jones provide a thoughtful expansion upon their value-based business system based on the Toyota model. Along the way they update their action plan in light of new research and the increasing globalization of manufacturing, and they revisit some of their key case studies (most of which still derive, however, from the automotive, aerospace, and other manufacturing industries).  The core of the lean model remains the same in the new edition. All businesses must define the \"value\" that they produce as the product that best suits customer needs. The leaders must then identify and clarify the \"value stream,\" the nexus of actions to bring the product through problems solving, information management, and physical transformation tasks. Next, \"lean enterprise\" lines up suppliers with this value stream. \"Flow\" traces the product across departments. \"Pull\" then activates the flow as the business re-orients towards the pull of the customer's needs. Finally, with the company reengineered towards its core value in a flow process, the business re-orients towards \"perfection,\" rooting out all the remaining muda (Japanese for \"waste\") in the system.  Despite the authors' claims to \"actionable principles for creating lasting value in any business during any business conditions,\" the lean model is not demonstrated with broad applications in the service or retail industries. But those manager's whose needs resonate with those described in the Lean Thinking case studies will find a host of practical guidelines for streamlining their processes and achieving manufacturing efficiencies. --Patrick O'Kelley",
  "genres": [
    "Business",
    "Nonfiction",
    "Management",
    "Leadership",
    "Buisness",
    "Productivity",
    "Entrepreneurship"
  ],
  "author": "James P. Womack",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/13601716-lean-thinking"
}