{
  "title": "Bitterroot Crossing",
  "description": "**Newly edited version with brand new bonus prologue**     A love triangle that crosses centuries . . .     For Nick Crush, the only thing cool about his town, Bitterroot Crossing, is the gang of outlaw ghosts that rise occasionally from the town's swamp. But when he finds himself competing with the most notorious spirit and his own ancestor, Zedekiah Crush, for the affections of Jessie Sterling, suddenly the whole ghost thing isn't so cool.     Jessie Sterling inherited her great-great-grandma's shorter left leg and incredible beauty, a beauty that a century and a half earlier sparked a love triangle that ended in tragedy. Now Jessie leaves the safety of her grandma's farm to attend high school in town . . . and Bitterroot Crossing will never be the same.**Contains some strong language**     The uneven buzz of a motorcycle grew closer. The sound of it helped to lift my mind from the blackness surrounding it. I turned. Nick Crush stood straddling his dirt bike, his long hair blowing in the ghostly breeze, and his dark blue eyes staring in disbelief at his ancestor. Then his gaze moved to me. \"Are you O.K, Jessie?\"     His question stunned me at first. Had he come up here to help me? The thought of it lifted the bleakness that had crept inside even more. The sky seemed to brighten as if he'd brought some of his own light with him.      \"I'm fine.\"     \"Who are you, boy?\" Zedekiah's voice had deepened to a menacing growl.     \"I'm Nick Crush, your great-great-grandson.\"     \"I have no descendants. I gave my only son away.\"     \"Well, pops, I've got news for you. Even if you gave him away, you still ended up with descendants. And I'm one of them.\"     Zedekiah's fluid expression morphed between puzzled and angered.     I glanced over toward Nick. \"Your great-great-grandfather doesn't have a terrific knowledge of science. The descendant idea seems to be somewhat confusing to him.\"     \"Enough!\" The roar of Zedekiah's voice shattered the grayness above and a steamy mist fell in heavy droplets around us. Suddenly Nick and his bike flew off the ground. He hovered at least ten feet up in the air.      Nick clung to the handlebars. \"What the hell are you doing?\" The warm droplets clung to his hair and bike. I could taste their acidity on my lips.     \"I'm keeping you away from her,\" Zedekiah answered then glanced at me. \"I don't like the way you look at her.\"     \"Me? The way you're gawking at her is not exactly innocent.\" The bike lifted higher.      He floated precariously a good twelve feet above ground but he showed no fear.     \"Please be careful, Nick.\" I yelled up to him. I wasn't sure how to reason with Zedekiah, but it occurred to me that the thick-headed ghost still believed me to be Rebecca. I used my firmest tone. \"Zedekiah Crush, you put that boy down instantly.\" Again, I should have chosen my words more carefully. The bike came down fast. Obviously deciding mid fall to distance himself from his bike, Nick pushed it out of his path and smacked the grassy ground with his body, several feet from his bike.      I ran to him. \"I'm so sorry. That was my fault.",
  "genres": [
    "Young Adult",
    "Ghosts",
    "Paranormal",
    "Romance",
    "Fantasy",
    "High School",
    "Novels"
  ],
  "author": "Tess Oliver",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/10426130-bitterroot-crossing"
}