{
  "title": "Alice in Realityland",
  "description": "(YA, grades 7 and up) \"Someone asked me once ... If I could have one gift, just one, and it could be mine forever to share with whomever I wanted ... what would I want? I didn't even have to think beyond a second about it. I want happiness. Just to be happy. Happy being me. Yeah, that's the gift I'd like.Like the year I started school. All the other kids had friends. All the other kids played together, shared treats with each other while I sat by myself.At least that's the way it was until Lexie Bealman sat next to me one day. She smiled and told me how she wanted to be my friend. 'Because you look so lonely. And I feel sorry for you, you know. I'm doing you a favor.' Then, she grabbed my lunch, pulled out the homemade brownies and smiled between bites as she handed me her apple in exchange. And that's the way it remained. She was the sweet, gooey dessert that everybody wanted and I was the fruit. Every day for the rest of that school year. And I didn't care because I had a friend. She could have taken my whole lunch and I wouldn't have cared. Nobody else bothered to talk to me, other than calling me names like shrimp, or midget, or whatever equates with being almost a foot shorter than everyone else in class.\" Alice Patelli is too tall, too clumsy, too shy, too weirdly everything that's unpopular. She has one good friend and lots of optimism. But is that enough to turn life around and make her happy? It takes getting hit in the head with a ball and dreaming of a strangely scary and wonderful world to give Alice the chance for an adventure to make life and love what it should be. Perfectly happy. Her subconscious mind bounces between the two worlds of fantasy and reality in her journey to try and find the key to happiness. Entertwining her fears, her loves, her insecurities in a way that only Alice can experience, through this adventure she discovers life can be better than she ever dreamed possible, if she can only wake up and get back to living again and enjoy it.Alice in Realityland is part of a series on modern fairytales. Jennkrist is the pen name for author Kathryn Long. Other titles in the fairytale series are Cinderella Geek and Not So Snow White.",
  "genres": [
    "Retellings",
    "Fantasy"
  ],
  "author": "K. Sean Jennkrist",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/13602408-alice-in-realityland"
}