{
  "title": "I Am the Most Interesting Book of All: The Diary of Marie Bashkirtseff, Volume 1",
  "description": "Marie Bashkirtseff's diary is one of the great journals of all time: a Russian girl, transplanted to France, begins a little diary at the age of fourteen. Eleven years later, upon her death, she has written thousands and thousands of pages, creating an obsessively detailed monument to her own life. .\"..because I hope that I will be read...I am absolutely sincere. If this hook is not the exact, absolute, strict truth, it has no reason to be.\" But Bashkirtseff was betrayed by her own family. The diary, published posthumously in 1887, was expurgated, sanitized, and denuded. Marie's mother made sure that none of her daughter's more radical opinions - and more importantly, their strange family history - appeared in the diary's pages. Even so, it was hailed as the true portrait of a woman by the French press, and Bashkirtseff was alternately canonized as a misunderstood genius and damned as a self-absorbed misfit. Now, in this new translation, Phyllis Howard Kernberger has returned to the original text - Marie's notebooks, held in the Bibliotheque Nationale. Her scrupulous, decades-long research has unearthed the true self-portrait that Marie Bashkirtseff hoped to reveal. Marie was enraptured with her own beauty, enraged by the constraints of society (especially for women), and determined to achieve success and fame at any cost, and her diary is a vivid portrait of a free-thinking woman born before her time. Working straight from the source, Kernberger has revived the honest image of Marie - in a seductively funny, warmly personal, and thoroughly mesmerizing account of a life lived to its fullest.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Memoir",
    "Art",
    "Russia",
    "Diary",
    "Autobiography"
  ],
  "author": "Marie Bashkirtseff",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/1042645.I_Am_the_Most_Interesting_Book_of_All"
}