{
  "title": "The Beckoning West",
  "description": "In 1800 Jonathan Williams dreamed of a life in the new world while working in his masters print shop. The new world a place he had read about, where a man could make his own way. A new land where trapping was a profitable and adventurous way to advance ones wealth. That year he boarded a Yankee ship and worked his way across to New York. Outfitted as best he could he trekked off toward the Canadian territory in search of his dream. Along the way to that dream he met new friends, faced his own fears, and grew into a man. Together with his partner Jacques they travel to the shores of Lake Superior to establish their trade business and trapping headquarters. But the rugged forbidding hills hide the dangers of the forest. As the men carve out a future while fighting the elements,Indians, and for Jonathan, his own fears.Here is an excerpt from the book. When they reached the top there were eight of the war party closing on them. This time it was Johnathan's turn and he fired and traded rifles with Jacques. But before he could fire the second shot a ball ripped into his left shoulder. Grimacing in pain he raised the rifle and fired as Hawk pushed him aside and fired. Jacques grabbed a handful of his hide shirt and pulled him away. After dragging him a safe distance away from the top Jacques went back to help Hawk. Hawk in the meantime had dropped his rifle and was forcing them back as he fought with his tomahawk in one hand and knife in the other. As Jacques again started firing the Huron turned and retreated down the trail. Laughing Jacques said “they will be back but not that way ehh? Then walking over to Jonathan he pulled the neck of the hide shirt over so he could look at the wound. You bleed good Englishman, how about Jacques make it stop ehh? Carefully he poured powder into the wound then he said, turn your face away my friend. Then he dry fired the rifle holding the lock near the powder. There was a flash as the smell of burning flesh and powder filled the air along with Jonathan's scream of agony. I am sorry mon ami, but it had to be done, he said as Jonathan passed out. As Jonathan lay there Hawk took a look over the top and scouted behind them. Jacques watched the front where he could see them regrouping below amongst the trees at the rivers edge. There had to be at least fifteen maybe twenty not counting those guarding the prisoners. The only thing in their favor at the moment was several hours of sunlight. If the Chippewa failed to catch up by evening they would have to give up the fight and sneak out of there. A shot came from the other side and Jacques gabbed his rifle and ran to help Hawk. It had only taken the Huron a few minutes to do just as Jonathan thought they would. As rifle fire erupted behind the ledge Jonathan slowly swam out of unconsciousness. As he did so he grabbed his rifle and reloaded it. The pain from his shoulder was intense, but the will to live was stronger. As he finished reloading he saw a Huron warrior carefully coming to the top of the trail. Seeing Jonathan down on the ground he and the two with him screamed and lunged forward. Jonathan pulled the hammer back and fired, dropping the first man in front of his party. Undeterred the others kept coming. Jonathan stood though his head spun, and fired point blank at the nearest man with his pistol, hitting him in the forehead. Then he switched hands with the pistol holding it by the barrel and took his knife in his right hand. The last Huron paused a second realizing the wounded man had just easily killed two of his brothers. Then he let out a wild cry and charged forward. But he fell as if tripped. Then Jonathan saw the tomahawk lodged in his back, as Jacques ran back onto the ledge. “Are you okay mon ami”, Jacques asked as he pulled the tomahawk from the mans back then took a quick look down the trail? Smiling Johnathan said, “never felt better”, as he passed out again.",
  "genres": [],
  "author": "T.R. Wallace",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/13603006-the-beckoning-west"
}