{
  "title": "Discovery",
  "description": "Please note that Book Two, Conspiracy, is now available for your Kindle!Author Kate Gordon   \"When a woman says she loves a man more than her own life, it's understood she's speaking metaphorically. But then, she just might be serious.\"Reagan Sullivan is a thoroughly modern woman. She's thirty-one, an honors graduate of Yale, and a six year veteran of the Secret Service, sworn to protect the vice president of the United States--who happens to be a widower. A good looking widower. Despite these accolades--and distractions--Agent Sullivan is a no-nonsense woman in every respect.Her younger sister, Heather, currently a Rhodes Scholar PhD. candidate and an Olympic rowing medalist, is also a product of the twenty-first century. Together they're an unbeatable combination ... and not bad on the eyes either.When Reagan meets two Irish elves--one of whom kidnaps her from a ladies bathroom in Oslo, Norway--her world changes dramatically. These elves are nothing like you imagine. Both are well over six feet and strikingly handsome. And both think Reagan is quite fetching herself. And they're not guarding a pot of gold at the end of the rainbow, but they do have a twinkle in their eyes and romance in their hearts. And coursing through Reagan's blood is . . . an Elven ancestry???If that wasn't enough to ruin a girl's day, when Reagan meets her fifth great grandmother, Eimile, born in Ireland in 1630 ... and she turns out to be the current-day queen of the Western Realm ... and she puts Reagan's life in danger to save the kingdom ... well, things get a little more than airy-faerie. They get downright terrifying!Despite an outward appearance of tranquility in the Western Realm, not everything is as it appears. A Civil War is brewing, the vice president of the United States is in danger, and Reagan has to come to grips with a discovery that changes her life forever.Humor and light-hearted romance, yes, but a serious story about corruption, power, deception and the length to which men - and women - will go to achieve their ends. Elf or human.Ninth Discovery is a 61,350 word novel. Book two, Conspiracy will be released in September, 2012.Kate Gordon is the pen name of established authors Gordon Ryan and Kate Armitage .",
  "genres": [
    "Romance",
    "Fantasy",
    "Paranormal",
    "Paranormal Romance",
    "Fae",
    "Fiction",
    "Time Travel"
  ],
  "author": "Kate Gordon",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/13603602-discovery"
}