{
  "title": "The Fake Boyfriend Experiment",
  "description": "Rafe Turner has a tattoo running from his wrist to his shoulder. His hair is a little too long. He doesn't need to rebel, because owning his life is already in his blood. He's way out of her league, for sure, but when Lily Gardner accidentally face plants through the window of his band's practice room, a connection is formed between Rafe and Lily that can't be shaken. When Rafe invites her to jam with his band, Lily knows the mega-talented drummer is exactly what she needs to fix her life. The fact that Rafe already has a girlfriend? No problem. It'll be enough if people simply think she's dating him…won't it? Lily is about to discover that finding her passion is a whole lot more complicated than a fake boyfriend…or two. \"Stop, drop and rock-n-roll....Stephanie Rowe has created the new teen queen with Lily Gardner! THE FAKE BOYFRIEND EXPERIMENT gets under your skin, like a pop song on the radio, you find yourself wanting to go back to it over and over!\" ~Guilty Indulgence Book Club Books in the Mapleville High The Truth About Thongs How to Date a Bad Boy Pedicures Don't Like Dirt Geeks Can Be Hot ) The Fake Boyfriend Experiment Ice Cream, Jealousy & Other Dating Tips ABOUT THE New York Times and USA Today bestselling author Stephanie Rowe is the author of more than 40 novels. Stephanie is a four-time nominee of the RITA Award, the highest award in romance fiction. She has won many awards for her novels, including the prestigious Golden Heart Award. She has received coveted starred reviews from Booklist, and Publishers Weekly has called her work \"[a] genre-twister that will make readers...rabid for more.\" Her books have been selected as YALSA Quick Picks for Reluctant Readers. Author's This novel was originally published in paperback in 2006 by HarperCollins with the title THE BOYFRIEND TRICK under the author's pen name of Stephie Davis. The current edition has been extensively revised and expanded. There are excerpts from other books by the author in the back of the book.",
  "genres": [
    "Young Adult",
    "Romance",
    "Contemporary",
    "Young Adult Contemporary",
    "Realistic Fiction",
    "High School",
    "Young Adult Romance"
  ],
  "author": "Stephanie Rowe",
  "average_rating": "3.40",
  "url": "https://www.goodreads.com/book/show/13603896-the-fake-boyfriend-experiment"
}