{
  "title": "The Day We Delay",
  "description": "The Day We Delay is ambitious, challenging, and intensely cerebral. Michael J Seidlinger writes for the aspiring rat in all of us, building mysterious and puzzling catacombs of language. You never know what the next page is going to look like, where the next corridor is going to lead you, or how disoriented you're going to get, but you will not forget this utterly unique experience. Make sure you apply deodorant. – Nick Antosca, author of Midnight Picnic.Michael J Seidlinger writes, “It begins with the debut – the courageous must tear down the preceding blockades with a crippling catastrophe.” To which I respond: It begins here, with this debut novel – the author courageously tearing down the preceding traditions with a formally crippling and linguistically catastrophical adventure. – Lily Hoang, author of Parabola.Seidlinger's novel reminds us what it is to write with a blade. While so many other readers are clustering round the hind of books to make a gravity well of contempt for bold adventurism in writing, The Day We Delay is both vertiginous and visceral, a scorching indictment of contemporary mores in that computer prompt domain where the poetic is sundered by a Cuisinart of literary static. – Kane X. Faucher, author of The Infinite Library. The Day We Delay dares the reader to understand it, and by doing so urges a reevaluation of the traditional understanding of narrative as a vehicle for empathy. Seidlinger's fiction is instead a vehicle by which we search for the basis of our assumed need for human connection. The Day We Delay is a coded manifesto as labyrinthine and full of possibilities as the empty high-rise that anchors the book's opening pages. – Caleb J Ross, author of Stranger Will.The Day We Delay is a character sketch of our generation—a meditation on consumerism revealing not just the failings of the system itself, but the extent to which it dehumanizes and destroys the real people involved. Seidlinger’s writing, as ever, is impossibly virtuosic and absolutely inimitable. The result is an ode to the murder of capitalism both unnerving and eerily familiar, “the insistence that there was something to find once... and there will be again, if there is time. – Kyle Muntz, author of Sunshine in the Valley.In The Day We Delay, a sprawling philosophical fable on how to live (or not) as a 21st century Man of (in)Action, Michael J. Seidlinger maps the “what” and “why” of every waking moment. There’s an urgency here to be, i.e. to do—something, anything—with the (over)thinking mind (hyper)focused on status and the legend of legacy as frontline means of (dis)engagement. And who will you be today? The beautiful, the courageous, the majority, the reticent? Either/and/or, we’re all extras in the end. How then to be viable in body and soul? There is only go(ne). – Jesús Ángel García, author of badbadbad.",
  "genres": [],
  "author": "Michael J. Seidlinger",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/10426766-the-day-we-delay"
}