{
  "title": "How to Think about the Great Ideas: From the Great Books of Western Civilization",
  "description": "Philosophy of everybody's business. As human beings, we all have the ability, and even the proclivity, to philosophize. We all engage in philosphical thought in the course of our daily live. What is philosophy? Why is it important? The importance of philosophy can be summed up in two words: Great Ideas. Great Ideas are the ideas that have been captured and developed in what are often called the Great Books of Western Civilization. They are common concepts that are a part of everyone's vocabulary and ordinary conversation and important, basic ideas that we think about throughout our lives - as children, adolescents and adults. What does it mean to be Good? How do we decide the Right thing to do? What is Love? The same question may appear to have different answers; the journey through the conflicting answers to a resolution is called philosophy. The Great Ideas are Art, Beauty, Change, Democracy, Emotion, Freedom, God, Good and Evil, Government, Justice, Labour, Language, Law, Learning, Love, Man, Opinion, Philosophy, Progress, Punishment, Truth, and War and Peace. Although everyone has a basic grasp of these Great Ideas, not everyone understands them as well as he or she could or should. In \"How to Think About the Great Ideas\", renowned philosopher Mortimer J. Adler guides readers to an understanding of these fundamental ideas and their practical applications to our daily lives. Not only does he clarify what the Great Ideas are, he helps readers understand the immediate role/application and importance of these ideas in our lives. These essays are based on the famous television lecture series by Mortimer Adler.",
  "genres": [
    "Philosophy",
    "Nonfiction",
    "Education",
    "Classics",
    "History",
    "Literature",
    "Books About Books"
  ],
  "author": "Mortimer J. Adler",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/136043.How_to_Think_about_the_Great_Ideas"
}