{
  "title": "The Love That Is True",
  "description": "“The Love That Is True” (www.TheLoveThatIsTrue.com) by Paul Chilson powerfully shows God’s love to children ages four and up with full-page illustrations and rhyme:Before the beginning of all that we see,There was only God, as a family of three.And the love that flowed between the ThreeWas the truest love that could ever be.Watch the video dramatization at www.TheLoveThatIsTrue.com.Mr. Chilson loves to read stories to his three children. As a Christian, he is always looking for ways to teach them about God’s love.“The Love That Is True” is a 40 page full-color, hard cover, 7.5” x 11” book which takes each child on an adventure with God from before time, to creation, the angel rebellion, sin, Jesus’ birth and death, redemption, the church, life as a Christian, and finally to heaven, showing how much God loves us. This book teaches the fundamentals of Christianity in an exciting way, and places the Christmas story into God’s plan.“The Love That Is True” is beautifully illustrated in vivid colors by award-winning illustrator Ruslan Sivachov. The book contains discussion questions and Bible references, and each verse can be sung to the included piano music.The author, Paul Chilson, lives in Colorado and is available to speak to groups about “The Love That Is True”. His goal is to blow our minds on the topics of God, True Love, ourselves, and eternity. He’ll tell of how there are ten thousand stars in the universe for each grain of sand on the Earth, that True Love is very different than our love for hot buttered popcorn, how amazing a single cell in the human body is, and that our life here is only a blink compared to eternity.The book is available for purchase at Amazon.com or direct from the publisher at www.TheLoveThatIsTrue.com (for signed copies and free shipping).“The Love That Is True” is published by 2 Roads Publishing www.2RoadsPublishing.com, a ministry dedicated to sharing God’s love with children of all ages. For more information, to request a review copy, or to schedule an interview, contact Kari Chilson by phone 303-485-6059, or by email Kari@2RoadsPublishing.com",
  "genres": [],
  "author": "Paul Chilson",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/10426986-the-love-that-is-true"
}