{
  "title": "The Third Scroll",
  "description": "REISSUED under the title RELUCTANT CONCUBINE. Full trilogy is now available. --RELUCTANT CONCUBINE --ACCIDENTAL SORCERESS --GUARDIAN QUEEN\"A terrific epic fantasy ~ magical, compelling, and romantic!\" Susan Mallery, NEW YORK TIMES bestselling author\"It's impressively easy to become immersed in Marton's fantasy world. Readers will find it impossible not to care what happens next...\" Kirkus ReviewAn ambitious, vividly imagined epic fantasy. Marton has created apromising and immersive world that is, at the same time, darklybrutal... the splendor of the author's vision cannot be overlooked.\" RTBook ReviewsTHE THIRD SCROLLA maiden healer sold to barbarians.A world of savage warlords and cruel concubines.When ancient powers collide, can the slave save the realm and the high lord's heart?\"I ADORED.. (the hero). From his initial appearance and those gentle words of promise that no harm would come to...(the heroine), to his accepting manner of all that was her, to his tenderness shown when a barrier forwhich he waited so patiently to fold was finally crossed. He has to beone of my favourite male counterparts I've read in a while. LOVE him.\"Bookaroo-Ju Review\"The writing is just beautiful. It flowssometimes like water. I don't know how else to describe it other than to say i enjoyed how it felt reading it.\" 5 out of 5 Modokker Book PickStarsFor anyone who enjoyed the fantasy worlds of GeorgeMartin's Game of Thrones, C.L. Wilson's Lord of the Fading Lands,Elizabeth Vaughan's Warprize, or the memorably crafted healer heroinesin Jean Auel's Clan of the Cave Bear and Diana Gabaldon's Outlanderseries, THE THIRD SCROLL is the next epic adventure to get lost in.",
  "genres": [
    "Fantasy",
    "Romance",
    "Magic",
    "Fantasy Romance",
    "Young Adult",
    "Epic Fantasy",
    "Paranormal"
  ],
  "author": "Dana Marton",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/13604997-the-third-scroll"
}