{
  "title": "Deadly Addiction",
  "description": "From Night Owl Reviews\"This is a read that will have you staying up late to not only enjoy Alyssa and Remi's out of this world chemistry, but so see what lengths some will go to in order to preserve what they feel is right.\" ~ 4.5 Stars, Top Pick From RT Book Reviews \"...Cayne creates an entertaining tale, packed with distinctive characters and a suspenseful storyline.\" From Laura Taylor, author of Intimate Strangers\"Kristine Cayne will dazzle readers yet again with Deadly Addiction, a compelling, beautifully crafted, powerhouse of a romantic suspense novel. Truly a 5-star read! Bravo, Author!\"A violent clash of cultures and nations tests the forbidden love between a Native American man and a white female cop. When beautiful police sergeant Alyssa Morgan enters his life, Rémi Whitedeer never expects her to upend it. Not only does she have his hormones in an uproar, she’s also threatening to take the position he wants—Chief of Police for the Iroquois Blackriver Reservation. But Alyssa is more than a Barbie cop. Her ends-justifies-the-means philosophy, so different from his own, challenges Rémi on every level. With her sharp investigative skills and her fearlessness, she leads Rémi to confront bitter truths about his family and his standing as a man of mixed race within his tribe.Tall hunky Rémi Whitedeer, of the panty-melting grin and the smoldering green eyes, flips Alyssa’s world ass over teakettle. She’s always had a laser-like focus on the job, but Rémi proves a constant distraction. His inner strength and sense of purpose strip away the winner-take-all attitude Alyssa wears like armor. Soon she’s longing for more—a more that terrifies and intrigues her. If he finds out the fine line she’d walked while undercover, will he still want her? And will she ever find the courage to let him—or anyone—that far in?When Alyssa and Rémi uncover a drug-fueled scheme involving a biker gang from Alyssa’s past and a militant sovereigntist group led by Rémi’s cousin, they are forced to choose between their growing love for each other and the lives they've worked so hard to build. Will Rémi and Alyssa have to leave everything behind—even their identities—for the chance of a futuretogether?",
  "genres": [
    "Romantic Suspense",
    "Suspense",
    "Native American",
    "Contemporary Romance",
    "Mystery Thriller",
    "Contemporary",
    "Mystery"
  ],
  "author": "Kristine Cayne",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/13605901-deadly-addiction"
}