{
  "title": "The Lost Gospel of Judas Iscariot: A New Look at Betrayer and Betrayed",
  "description": "The recent National Geographic special on the Gospel of Judas was a major media event, introducing to millions of viewers one of the most important biblical discoveries of modern times. Now, a leading historian of the early church, Bart Ehrman, offers a comprehensive account of the newly discovered Gospel of Judas, revealing what this legendary lost gospel contains and why it's so important for our understanding of Christianity. Ehrman, a featured commentator in the National Geographic special, describes how he first saw the Gospel of Judas—surprisingly, in a small room above a pizza parlor in a Swiss town near Lake Geneva—and he recounts the fascinating story of where and how this ancient papyrus document was discovered, how it moved around among antiquities dealers in Egypt, the USA, & Switzerland, and how it came to be restored & translated. More important, Ehrman gives a complete and clear account of what the book teaches and he shows how it relates to other Gospel texts—both those inside the New Testament & those outside of it, most notably, the Gnostic texts of early Christianity. Finally, he describes what we now can say about the historical Judas himself as well as his relationship with Jesus, suggesting that one needs to read between the lines of the early Gospels to see exactly what Judas did & why he did it. The Gospel of Judas presents an entirely new view of Jesus, his disciples and the man who allegedly betrayed him. It raises many questions and Ehrman provides illuminating and authoritative answers, in a book that will interest anyone curious about the New Testament, the life of Jesus and the history of Christianity after his death.",
  "genres": [
    "Religion",
    "History",
    "Nonfiction",
    "Christianity",
    "Theology",
    "Audiobook",
    "Philosophy"
  ],
  "author": "Bart D. Ehrman",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/104279.The_Lost_Gospel_of_Judas_Iscariot"
}