{
  "title": "Columbus Avenue Boys",
  "description": "Hollywood Book Festival Honorable Mention (2012). Highly Recommended by Midwest Reviews. Recommended review from Kirkus Reviews. Designated \"Editors Choice\" by iUniverse Review Board. iUniverse \"Hollywood Coverage\" recommendation to consider the story for screenplay adaption.Salvatore Esposito, Anthony Albanese, and Christopher Cameron—the Columbus Avenue Boys—are somewhat related, as they share lineage back to before the turn of century. Having grown up together in a small community north of New York City, each became successful in his own right. Chris moved to Dallas to be a portfolio manager with a financial firm while Sal and Tony earn their living the hard way—by being enforcers and major earners for the mob.Tony’s grandfather, Pops Scala, tells them a horrific secret from the Scalamarri Family past: twelve members of their family were massacred at the hands of Bugsy Siegel and his ruthless gang from Murder Inc. in 1935. Pops was the sole witness and lone survivor, and he was more than happy to pull the trigger and end Bugsy’s murderous life.Now fifty years later, Pops convinces the Columbus Avenue Boys they must leave the underworld life for good. Since one cannot just give two weeks’ notice to the Gambino crime family, the three blood brothers devise a plan to infiltrate the inner workings of the Mafia in the 1990s to avenge the massacre in their family tree.Columbus Avenue Boys chronicles the Scalamarri family tree throughout the twentieth century and presents a historical perspective of the life and struggles of an Italian immigrant family as well as that of America’s organized crime.iUniverse Hollywood Coverage comments...David Carraturo’s Columbus Avenue Boys is an authentic-feeling and compelling gangster drama told from the perspective of its musclemen soldiers, opposed to its cunning bosses. With the novel’s juxtaposed storylines of immigrants and their sons, much of the plot harkens The Godfather Part II; likewise, its portrayal of soldiers and FBI informants is reminiscent of more contemporary gangster films such as Donnie Brasco and Goodfellas. Carraturo writes this world with authority, making dynamic characters that have often been relegated to filmic clichés, while at the same time offering a proud and historic sense of Italian immigration and community.",
  "genres": [
    "Fiction",
    "Crime",
    "Suspense"
  ],
  "author": "David Carraturo",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/13606150-columbus-avenue-boys"
}