{
  "title": "20 Tips for Power Chicks",
  "description": "20 Tips for Power Chicks is an in-depth look at how women sabotage themselves in the business world and how they can become more professional, efficient, and increase their productivity. Women are powerful, intelligent, and incredibly talented people by nature. When they develop a deeper understanding of what it takes to succeed in business and in life, they are unstoppable. With cover art by Denise Duke and edited by Jennifer-Crystal Johnson, this book is a must-read for any woman who wants to increase her success. This book is published in association with Broken Publications and The Women's Broadcast Network. Here's some advance praise for 20 Tips : “Sarah Zink's book, 20 Tips for Power Chicks , is a good investment of time. And speaking of time, Zink's chapter on time management is my favorite one in this well-crafted and smart book. I plan on giving a copy to each of my daughters who will benefit greatly from Zink's insight and tips.” “20 Tips for Power Chicks provides great strategies that every woman can implement to succeed and thrive, not just in business but in life. You now have the tools to get from where you are to where you want to be!” “Sarah’s message gets to the heart of how and why women sabotage themselves in the workplace. This book is a must-read for all professional women. Even if you think you have nothing to learn about communicating, you do!” “An inspirational book that provides new life lessons for moving forward. Sarah Zink shares her insight into knowing there is a difference between striving for excellence and the pursuit of perfection. By following her advice, you can move to the next level of your life with commitment and confidence. 20 Tips for Power Chicks is thought-provoking and a must-read!” “This is the book I wish I'd had a decade ago. If you're looking to advance your career or grow a business, you can learn these lessons the hard way. Or you can read Sarah's book and apply the strategies and tactics. Your future self will thank you.” “A must-read, ultimate guide for Power Chicks and Power Chicks-to-be who want to unite and conquer the business world!”",
  "genres": [
    "Business"
  ],
  "author": "Sarah Zink",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/13606328-20-tips-for-power-chicks"
}