{
  "title": "Awakening: Ava Delaney Vol. 1",
  "description": "From Book 1: Awakening - Volume 1 contains the first three stories in the Ava Delaney series so far.  Thirst:  Ava Delaney calls herself a hybrid - a living, breathing human who happens to have vampire poison running through her veins. The only thing greater than her thirst for human blood is her capacity for guilt. She does her best to avoid the human world, for everyone's sake.  When Ava accidentally enslaves a human while saving him from a vampire, she realises she has to look for help setting him free. Despite her misgivings, she expands her world but finds herself dragged into a possible vampire civil war. With the help of some new friends with ambiguous loyalties, she tries to find a way to keep her human, and herself, alive.  Taunt:  All Ava wants to do is forget about the vampires, but they won’t leave her alone. Between her failing business, angry landlord, disloyal friends, and vampire stalkers, life is starting to feel pretty stressful. When Ava finally deals with her biggest problem, she is caught up in the chain of events it triggers and taken along a path she can’t escape from.  Ava has to figure out what exactly is her biggest threat: the humans, the vampires, the Council—or her true heritage.  Tempt:  There’s a monster running around Dublin, and it’s up to Ava to catch it. The pressure’s on, and she’s becoming as cynical as Peter. But when a demon marks her friend, and a possible threat from England spells war, Ava’s left with a huge choice to make. The lives of one or many.  With a little help, Ava has the chance to win all of her battles… if the darkness doesn’t take her over first.  Volume one contains approx. 170,000 words.",
  "genres": [
    "Vampires",
    "Fantasy",
    "Urban Fantasy",
    "Supernatural",
    "Young Adult",
    "Collections",
    "Paranormal"
  ],
  "author": "Claire Farrell",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/13606989-awakening"
}