{
  "title": "Deep in the Heart",
  "description": "Just out of college and completely alone in the world, Maggie Montgomery has one shot left to save her life from an abyss of poverty and hopelessness. Clinging to the last shred of fuel and hope, she arrives at the mansion of Texas billionaire Conrad Ayer. Although Maggie is clearly not what Mr. Ayer and his wife have in mind for a nanny, they agree to hire her temporarily until they can find someone more appropriate to fill the position. However, Maggie's whole world is about to be up-ended by two way-over-scheduled children and one incredibly handsome hired hand. As she struggles to fit into a world she was never made to fit in, Maggie wonders if she can ever learn to become a perfect version of herself so she can keep the job, or is she doomed to always be searching for a life she can never quite grasp?Keith Ayer despises his life. As the son of Texas billionaire Conrad Ayer and the fiance to a Senator from Texas' daughter, everything looks great on the outside, but inside, he is dying. He would vastly prefer to manage and train his father's racehorses. However, everyone else thinks that is beneath him. He needs to get into industry and build on his father's success. Suffocating under the constrictions of his life, he meets Maggie who begins to teach him that wealth and power is not everything in this life. But can Keith defy the most powerful men in Texas to follow his heart? One of the most inspiring Contemporary Christian Romance novels available, Deep in the Heart is an Amazon #1 Best Seller. It is truly Christian romance at its very best. Filled with faith, hope, and love, Christian romance kindle books aim to inspire women and men alike while giving them an exceptional romantic love story they will not soon forget. This is one book that will surely find its way onto your most inspirational books list!",
  "genres": [
    "Romance",
    "Christian Fiction",
    "Christian",
    "Fiction",
    "Christian Romance",
    "Contemporary Romance",
    "Westerns"
  ],
  "author": "Staci Stallings",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/13607002-deep-in-the-heart"
}