{
  "title": "The Barefoot Warrior: The Journey of a Young Adult In Search of His True Nature",
  "description": "To dream a life... Or live a dream? \"This is the end of my life as I've known it. I can't spend another day playing the sidekick in other people's stories. I can't keep trusting the advice and expectations of adults who lack the time and interest to see me for who I am and what I care about. I will not argue anymore about why my dreams are valid. Today, I step forward on my own path into the unknown without a backward thought. If I get crushed, so be it. At least I'll know what it means to be the keeper of my own destiny.\" With these thoughts, 16 year-old Kyle Weaver breaks free from foster care and public education to set out on the path of his own greatness. What follows are the trials of a modern-day hero's journey. Along the way, Kyle awakens several inner capacities, including his own unique brand of brilliance, willpower, intuition, authenticity and presence. The more he develops these capacities, the more he finds that they are much like personal superpowers. They enable him to turn his entire world around in less than two weeks. Inspired by his unusual adventures and the people who touch his life, Kyle takes a stand to empower young adults near and far. The Barefoot Warrior explores a universal human yearning for liberation and fulfillment that is shared by people young and old throughout the world. This book offers a fresh and youthful perspective on the social and educational problems that society faces today. Kyle wrote this book as a young adult, establishing himself as the fictional protagonist in an attempt to clarify his own dreams for the future. He went on to serve as an educator and school developer, contributing to the educational reform movement in The United States. One of the public schools that he co-created received the 2009 Hart Vision award for \"Best Charter School of the Year\" in California, bestowed by the California Charter Schools Association. He is an avid hiker, daydreamer and thinker, and finds deep fulfillment in collaborating with others.",
  "genres": [],
  "author": "Kyle Weaver",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/13607642-the-barefoot-warrior"
}