{
  "title": "White Heat",
  "description": "He had to make things right... He had to find the killer.P.I. Duke Rogers finds himself in a combustible situation in this racially charged thriller. His case might have to wait... The immediate getting out of South Central Los Angeles in one piece during the 1992 \"Rodney King\" riots and that's just the beginning of his problems.For a quick couple hundred bucks, private investigator Duke Rogers finds an old \"friend\" for a client.The client's \"friend,\" an up and coming African-American actress, is brutally murdered. Duke knows his client did it. And he knows he helped, however unwittingly.Wracked with guilt, Duke must find the killer.His mission begins with a trip to the dead actress' family in South Central L.A. – just as the \"Rodney King\" riots ignite.While Duke tracks down the killer he must also deal with the racism of his partner, Jack, and from Warren, the dead actress' brother.And he must also confront his own possible latent racism – even as he's in an interracial relationship with the murder victim's sister.Relentlessly pursuing the case, Duke's mission takes him from L.A. to Calexico on the Mexican border, up to Reno, Nevada and back to L.A. Along the way he crosses paths with gang bangers, hoods and thugs of all stripes in his quest to find the killer and find redemption for himself before coming to the volatile and poignant conclusion.WHITE HEAT – CHAPTER 1 (EXCERPT):My father always said I was a fuckup, that the only reason we get along is 'cause he keeps his mouth shut. Maybe he's I fucked up high school.Fucked up college.Fucked up my marriage.Fucked up my life by leaving the service.And now I've fucked up a case.Fucked it up real bad.Teddie Matson was different. She had a golden life, until her path had the misfortune of crossing mine. I sat staring out the window of my office, k.d. lang playing in the background. It was a while till the sun would set, that golden hour when everything takes on a gilded glow.Golden hour is the time when the light hits just right in the early morning or late afternoon. The time when movie cinematographers most like to shoot. The light is tawny and warm. Gentle. It makes the stars shine brighter.Golden hour is the time when Teddie Matson was killed.",
  "genres": [
    "Mystery",
    "Thriller",
    "Fiction"
  ],
  "author": "Paul D. Marks",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/13608110-white-heat"
}