{
  "title": "I Can Hear Them Singing Now",
  "description": "This book is now published under the title: \"Hobson's Choice.\" The reason is I wish to offer it as a \"Pay want you want\" model and this is not possible on Amazon.When you click on the download links you will be taken to a page for Hobson's Choice. This is the same book as \"I can hear them singing now\"! Templeton Ngubane has been a black cop in the apartheid police for 17 years. The banned ANC liberation movement is doing everything possible -- sometimes brutally -- to mobilise the black townships and make the country ungovernable. Ngubane is trapped in two worlds. On one hand he has a sense of loyalty to the organisation he serves and he believes, if the crunch comes, it will stand by and support him and his family... on the other he questions some of the laws in place and knows he is considered by many in his community, an instrument of an unjust system. As the ANC turns up the heat in the townships, policemen and municipal councillors are considered government collaborators and are targeted for attack. When Templeton’s house is set alight and destroyed by residents from his neighbourhood, a chain of events with consequences beyond anything he can imagine, and seemingly destined to destroy his family, is set in motion. And when he is betrayed by the very organisation he serves, he must make a terrible choice to save his only son. Hobson’s Choice will shake you to your core. It is a story you will never forget.Pay what you want! I believe so strongly that you will be blown away by Hobson’s Choice that I am prepared to put my money where my mouth is. In addition, I want to make the process as simple and easy as possible so I’ve set up a facility where you decide what you want to pay for Hobson’s Choice -- anything from $0.01 upwards! Now there’s a deal that can’t be beat.  Transactions are via secure credit card facilities and are processed by Stripe, one of the world’s largest payment gateways. It does not matter where in the world you live, the process is seamless, absolutely secure and only takes a moment. Once you’ve made your payment -- whatever the amount you decide -- you will automatically be taken to the download page where you can download Hobson’s Choice and enjoy a novel I guarantee, you will never forget!Download links:Epubhttps://gumroad.com/l/JlcMMobihttps://gum.co/tITgePDFhttps://gum.co/WjhMHTMLhttps://gum.co/QswBa",
  "genres": [],
  "author": "Hilton Hamann",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/13608734-i-can-hear-them-singing-now"
}