{
  "title": "The Devil's Match",
  "description": "LIBRARY JOURNAL BEST E-BOOK ROMANCEOnce burned twice shy…but when old flames come together…passion reignitesWhen burned once … Arriving in London as her goddaughter's chaperone, Baroness Diana Palmerston-Wriothesley wants to avoid her erstwhile lover at all costs. Once nearly consumed by passion, four years has reduced the former inferno to bitterness and ashes.By an old flame… A world-weary master of seduction, Ludovic \"The Devil\" DeVere is bored with his life of debauchery. He also recognizes with self-annoyance that the marks of his discontent have only increased upon a certain person's arrival in London. When Diana makes her appearance in his den of iniquity in all of her glorious self-righteous fury, he suddenly feels alive again.Fire is best fought with fire… When Vesta mysteriously disappears, Diana has little choice but to appeal to DeVere for help. The moment she and DeVere reunite in the devil's lair., their mutual desire reignites with undeniable ferocity. While DeVere is hell-bent to have her back for keeps, Diana is equally determined to bring him to his knees…by acquiring some sensual secrets of her own.\"Damn you to hell, DeVere!\" she cried, jerking out of his hold. \"Yes, I want you now, but I would despise myself for it the moment we finished.\"\"Why?\" he asked, confounded.\"Why? Because I once confused passion for deeper feeling. I won't make that mistake again.\"\"But don't you remember how it was between us? I can bring you rapture. You know that. What harm is there?\"She scoffed, \"Surely the same words the serpent whispered to Eve.\"THE DEVIL DEVERE SERIES:A Wild Night's Bride #1The Virgin Huntress#2The Devil You Know #3The Devil's Match #4A Devil's Touch #4.5Jewel Of the East #5PREQUEL VIGNETTES:Devil in the Making #1The Trouble With Sin #2Ned's Folly#3(less)",
  "genres": [
    "Historical Romance",
    "Historical",
    "Romance",
    "Erotica",
    "Historical Fiction",
    "Novella",
    "Regency Romance"
  ],
  "author": "Victoria Vane",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/13609626-the-devil-s-match"
}