{
  "title": "Untie My Heart",
  "description": "Stuart Aysgarth, the new Viscount Mount Villiars, doesn't know he's playing with fire when he inadvertently runs afoul of Emma Hotchkiss. True, the exquisite Yorkshire lady is a mere sheep farmer, but she also guards a most colorful past that makes her only more appealing to the handsome, haunted lord. Emma has come to him seeking justice—and Stuart is determined that she will not leave until she has shared her secrets...and his bed. Her clever revenge scheme must fail in the face of his soft words and tender caress—and then he turns the tables on his bewitching adversary, seducing her into a daring deception of his own...(alternative description)Set against the colorful backdrop of Victorian Britain, Ivory's (The Indiscretion, etc.) sensual tale begins when the handsome and exotic Stuart Aysgarth, Lord Mount Villiars, returns from Russia to claim his inheritance from a dissolute father, only to find that his shady Uncle Leonard is stealing from the estate. While Stuart attempts to untie the resulting financial tangles, his coach accidentally kills a valuable lamb owned by luscious young widow Emma Hotchkiss, a former confidence woman now living a quiet life in Yorkshire. Emma tries to recoup her financial loss by means both fair and, eventually, foul; Stuart turns the discovery that she has cooked his books to his own advantage, threatening her with exposure if she doesn't help him double-cross the oily Leonard. As their schemes mature, the two engage in a series of sexual games. The delightfully complex con that forms the story's liveliest element isn't introduced until halfway through the narrative, and the novel's sparkle is occasionally dimmed by expository and noticeably anachronistic prose. Still, the playful roguishness of both protagonists adds a wickedly welcome twist to the familiar historical romance formula, while Ivory's gift for creating passionate sexual interludes is sure to please readers who prefer their romances warmly spiced.",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Regency",
    "Victorian",
    "Historical Fiction",
    "Enemies To Lovers"
  ],
  "author": "Judith Ivory",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/1361045.Untie_My_Heart"
}