{
  "title": "The Boy who Lit up the Sky",
  "description": "Librarian note: This is an alternate cover edition for asin B007B77U8A  Lydia Kalila, the Princess Royal of Mishnah is forced into marriage with the son of her country's mortal enemy for the sole purpose of producing an heir. Duty comes before personal choice for a princess especially when her country has been at war for more than a thousand years. Lydia's pregnancy removes her brother and new husband from their respective lines of succession placing her yet unborn infant at the head of the both queues. No one is happy about this, especially Lydia who dies during childbirth from wounds caused by the talon-like toenails of her very strange newborn son.Grief stricken at the loss of his daughter, the Mishnese King hastily sends Senya, his infant grandson off to a decrepit inner city orphanage with the intent to retrieve him much later when things got sorted out. At the orphanage, Senya is protected by the invalid Sister Meri who instantly falls in love with the little fellow. She's not bothered at all by his strange telekinetic and telepathic powers, flickering pupil-less silver eyes or wicked clawed toenails. The House Father takes a shine to the lad too and when Senya is six years old, he is summoned to the Father's chamber. The Father ends up in flames forcing Meri and Senya out into a snow storm running for their lives. Thus begins the tale of Senya, a prince created to be king of a planet but then tossed aside until his twelfth birthday when Lt. Taner, a Royal Guard detective is sent to retrieve him. It is unclear to all whether Senya is the product of something good or something evil but in either case, it is very apparent that he is something more than just Lydia Kalila's son.Note to readers - This title contains graphic language, violence and sexual situations. It is not intended for children or young teens.",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Amazon",
    "Fiction",
    "Magic",
    "Paranormal",
    "Young Adult"
  ],
  "author": "J. Naomi Ay",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/13610579-the-boy-who-lit-up-the-sky"
}