{
  "title": "Victorie!",
  "description": "In ‘Victorie!’ staan verhalen uit de geschiedenis van Alkmaar vanaf de 13e tot de 19e eeuw. Ieder verhaal speelt zich in een andere eeuw af, zodat je een goed beeld krijgt van de ontwikkeling van de stad.Storm op komst! (Simone van der Vlugt)Het is 1254 en de zee heeft vrij spel op de onbeschermde kust. Alkmaar wordt regelmatig bedreigd door een stormvloed. Florian wordt voor een boodschap naar de abdij in Egmond gestuurd en komt in grote problemen als de zee het land weer eens overspoelt. Tegelijk dreigt er gevaar uit een andere hoek: de Friezen zijn van plan om voor de zoveelste keer Alkmaar te overvallen. Het is de hoogste tijd voor een tegenactie… Blinde woede (Theo Hoogstraaten)In 1491 zorgen armoede en misoogsten voor grote problemen in Alkmaar en omgeving. Pepijns ouders kunnen de belasting niet betalen en dat komt ze te duur te staan. Boeren en stedelingen besluiten zich tegen de wreedheid van de belastinggaarders te verweren. Tijdens deze opstand van het Kaas- en Broodvolk neemt Pepijn wraak voor wat zijn familie is aangedaan. Maar of hij daar gelukkiger van wordt… Victorie! (Simone van der Vlugt)1573: De Tachtigjarige Oorlog is in volle gang en de Spanjaarden komen naar de Nederlanden om de bevolking te onderwerpen en het protestantse geloof uit te roeien. Diverse steden worden belegerd en uitgemoord. Ook Alkmaar wordt bedreigd. Jorden glipt ’s morgens vroeg de stadspoort uit om kruiden te zoeken voor zijn zieke moeder. Juist die ochtend arriveren de Spanjaarden en omsingelen Alkmaar. Lukt het Jorden om uit hun handen te blijven, en kan hij met zijn kruiden de stad inkomen? De schildersleerlinge (Simone van der Vlugt)In 1639 heb je het als meisje niet altijd even gemakkelijk. Isabella Bardezius is een getalenteerd schilderes maar mag alleen schilderen als liefhebberij. Je vestigen als meesterschilder is slechts voor mannen weggelegd. Haar moeder wil Isabella uithuwelijken, maar zo gemakkelijk geeft Isabella haar droom niet op. Een man van eer (Theo Hoogstraaten)1799: Nederland zucht onder het juk van de Fransen. In Noord-Holland probeert de Prins van Oranje met de hulp van Engelse en Russische troepen de Fransen te verdrijven. Dirk, die wil weten wat er met zijn vader is gebeurd, reist als verstekeling in een munitiewagen mee naar Alkmaar. Dan stuiten de soldaten die de wagen begeleiden op een Engels legerpatrouille… De Blauwe Dood (Theo Hoogstraaten)1800: Guurtje komt uit een arme familie maar heeft het geluk een dienstje te vinden bij een rijke weduwnaar en zijn dochtertje. Het is haar grote kans om aan een leven in armoede te ontkomen. Maar de gevreesde cholera is in aantocht. Deze ‘Blauwe Dood’ maakt geen onderscheid tussen rijk of arm…",
  "genres": [
    "Historical Fiction"
  ],
  "author": "Theo Hoogstraaten",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/13611796-victorie"
}