{
  "title": "The Churning Cauldron",
  "description": "Ron went to the coffee pot and poured a fresh cup. As he stood there pondering the state of America today, it dawned on him that he knew the answer. He loudly proclaimed \"I am not a damn lamb, nor will I act like one!\" With that said he threw his coffee cup into the wall. Mary Jane, Ron's \"girl Friday\", came running in to see if there was a problem, as he was storming out. One look at him and she realized that while, yes, there was definitely a problem; it was likely a place best not visited right now. Realizing that he was well along in his life and didn't have anything to lose, he made the conscious decision to bring the Deacon back, a demon he had left deep in the jungles of Southeast Asia forty plus years before. Ron knew there was a price tag attached to this, as the Deacon had a take no prisoners' philosophy. The Deacon had a daunting task ahead of him- to replace the entire US Congress. It wasn't too long after beginning the detailed planning phase of his venture when the Deacon realized that as much as he would like to go this alone, the scope of what he wanted to do far exceeded the ability of one person to accomplish. True, he could take out select individuals, but it would take forever for one person to effect the widespread change needed at all levels. It was then when he selected his band of what he later named \"The Geriatric Warriors\" a group of friends Ron had served and fought beside years ago. They ranged in age from 52 to 70, all fit, all mentally sharp, and they all possessed specific skills that Ron knew he would need. In essence he created an \"A\" Team of senior citizens who had nothing to lose and were ready to give their all to safeguard the Freedoms and Liberty America was founded upon, and they fought for. In their quest for this goal they all realized there were no sacred cows at any level in the government. \"LaGuardia tower suddenly came alive as they lost the sight of the two aircraft. They had heard the beginning of a Mayday from Iran Air 626 but it went dead. Ron smiled and started the Zodiac. He had no idea what the long term ramifications of their actions tonight would be but in his heart he knew that generally the world and specifically America was now a better place to be.\"",
  "genres": [],
  "author": "Ronald Dahle",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/13611904-the-churning-cauldron"
}