{
  "title": "Models and Lovers",
  "description": "Have you ever had love slip between your fingers? When was the last time you had a hero and heroine that you could really pull for?This is a love story blossoming inside the world of modeling. In spite of the glamor and intrigue of this high fashion world, love is really about one guy and one girl finding each other. But wait, there is one more condition--they have to admit it to each other.Thomas (Tommy) Conseco, the frightfully delicious owner of one of the top modeling agencies in New York City, demands respect which he has so rightfully earned. Aspiring models from around the world would sacrifice anything to become one of Tommy’s “girls” fully knowing he can make them a legend, or send them home crying. Tommy has one rule he has followed without exception. He never gets personally involved with anyone in the modeling industry, and as far as sex with his models and employees is concerned, it’s strictly off limits. As a result, his heart is immune to even the most beautiful women in the world. This rule has served him well in business, but has left his personal life and bed cold and empty.Enter Balarie Danson, the woman who is about to turn his carefully constructed world upside down. Balarie may not have the glamorous looks of a super model, but she’s bright, attractive and terrific at her job booking talent for the agency, especially the male models. Yielding to her charms, Tommy invites her to go on a business trip to Milan with more than business on his mind. When she turns him down, saying she’d prefer to concentrate all her energies in the New York market, Tommy assumes she’s refusing him and the possible chance at romance. The truth—Balarie is secretly terrified of flying and a long cross-Atlantic flight is more than she can face, despite her ambition in business and her secret attraction to her enigmatic boss. She’s heard the rumors, but the sparks flying between them are telling her Tommy’s looking for more than her talent as a booking agent. But Balarie is also looking for more than a one-night stand. So if Tommy intends to break his long-standing rule and seduce this woman into his bed, he’ll also have to let her into his heart because Balarie won’t settle for anything less than a love that lasts forever, and a hero who can help her conquer her fear of flying.This book is sold exclusively on Amazon at http://www.amazon.com/MODELS-LOVERS-M...",
  "genres": [
    "Romance"
  ],
  "author": "Johnny Ray",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/13612099-models-and-lovers"
}