{
  "title": "Loving David",
  "description": "What would you do if someone like Ryan Reynolds or Robert Pattinson jumped into your car? All David King wants is to enjoy a private escape from his celebrity status as a prominent and successful Hollywood actor. After a zealous fan detects David’s presence, he immediately seeks refuge in a most unconventional and comical place. Charlotte, a romance writer, simply wants to enjoy a private retreat with her friends. She is eager to begin her quiet, secluded vacation in picturesque Lake Arrowhead with her fellow authors. Never did she expect to have a strikingly handsome celebrity accompany her on her trip as a surprise stow-away. Soon, Charlotte and David begin a friendship that develops into a loving relationship. Although to some their love may seem effortless and perfect, their journey is not without obstacles. Olivia, a beautiful Hollywood actress and former lover of David’s, wants David back in her arms and her bed. Although David tries to reassure Charlotte of his feelings for her, Charlotte’s insecurities continue to resurface and threaten their relationship. David and Charlotte continue to overcome many struggles until they are faced with one of life’s most bitter trials. As the story unfolds, their tale becomes something different, with much higher stakes. Will love be worth the risk of heartache? Loving David is a tender story about taking risks in love and discovering beauty in tragedy. Gina Hummer writes with brilliant intensity about how bittersweet life and love can be. Her pronounced message carries a powerful lesson about the joy that comes when we offer ourselves a chance to love. The result is a deeply moving account of the tender moments in life that affect us all. Refined with a beauty that is rarely found in today’s contemporary fiction, Loving David establishes Gina Hummer as a classic author with a brilliant insight into the emotions of her audience, while connecting them to the only emotion that ever really matters.Kathryn – www.romanticreadingescapes.com",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Chick Lit"
  ],
  "author": "Gina Hummer",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/13612745-loving-david"
}