{
  "title": "Pataphysical Essays",
  "description": "Pataphysics: the science of imaginary solutions, of laws governing exceptions and of the laws describing the universe supplementary to this one. Alfred Jarry's posthumous novel, Exploits and Opinions of Dr. Faustroll, Pataphysician, first appeared in 1911, and over the next 100 years, his pataphysical supersession of metaphysics would influence everyone from Marcel Duchamp and Boris Vian to Umberto Eco and Jean Baudrillard. In 1948 in Paris, a group of writers and thinkers would found the College of 'Pataphysics, still going strong today. The iconoclastic René Daumal was the first to elaborate upon Jarry's unique and humorous philosophy. Though Daumal is better known for his unfinished novel Mount Analogue and his refusal to be adopted by the Surrealist movement, this newly translated volume of writings offers a glimpse of often overlooked Daumal: Daumal the pataphysician. Pataphysical Essays collects Daumal's overtly pataphysical writings from 1929 to 1941, from his landmark exposition on pataphysics and laughter to his late essay, \"The Pataphysics of Ghosts.\" Daumal's \"Treatise on Patagrams\" offers the reader everything from a recipe for the disintegration of a photographer to instructions on how to drill a fount of knowledge in a public urinal. This volume also includes Daumal's column for the Nouvelle Revue Francaise, \"Pataphysics This Month.\" Reading like a deranged encyclopedia, \"Pataphysics This Month\" describes a new mythology for the field of science, and amply demonstrates that the twentieth century had been a distinctly pataphysical era.Poet, philosopher, and self-taught Sanskrit scholar René Daumal (1908–1944) devoted himself to a lifelong attempt to think through death by means of what he called “experimental metaphysics”: an attempt to address metaphysical questions through scientific methodology. After co-founding the iconoclastic journal Le Grand Jeu and rejecting overtures from the Surrealist movement, he abandoned the literary path to become a disciple of the spiritual teacher George Gurdjieff.",
  "genres": [
    "Philosophy",
    "Essays",
    "Nonfiction",
    "France",
    "Art",
    "French Literature",
    "Science"
  ],
  "author": "René Daumal",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/13612949-pataphysical-essays"
}