{
  "title": "Intimate Worlds",
  "description": "\"Scarf knows the intricacies of the family structure and, even better, knows how to write well about them. In Intimate Worlds, as in most of our lives, family is riveting, white-knuckle stuff.\"--The Washington Post Book WorldIn Intimate Worlds, bestselling author Maggie Scarf takes on the most important, and most universal, subject of her distinguished the family. As the first social organization that we each encounter, the family is where we learn the most fundamental and enduring lessons of our lives. Yet for too many, those lessons turn out to be painful, perplexing, and emotionally crippling. In this luminous, beautifully written book, Scarf brilliantly examines the complex ways in which families create their own intimate rules and patterns of interaction, and how by understanding these dynamics we can each improve the quality of our own family life.At the book's core are the stories of four fascinating families and the very different ways they enact the central issues of family power and intimacy; conflict and love; individuality and group identification. Spanning the spectrum of family health from dysfunctional through optimal, these families grapple with serious substance abuse, sexual problems, difficulties with attachment and nurturance, eating disorders, and buried resentments that surface generation after generation. As Maggie Scarf probes the motives and meanings of these compelling dramas, she reveals the essential truths of how families shape human identity. Combining lucid analysis with warm human understanding, Intimate Worlds is a major work that both clarifies and deepens our knowledge of family relationships.\"Wrought with care and commitment, it is meticulously researched and will, I think, serve as a valuable resource for families struggling to understand themselves.\"--Los Angeles TimesFrom the Trade Paperback edition.",
  "genres": [
    "Nonfiction",
    "Psychology"
  ],
  "author": "Maggie Scarf",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/10051334-intimate-worlds"
}