{
  "title": "Indian Maidens Bust Loose",
  "description": "Nisha Desai is a young Indian woman who pines for romance in a country where love is in the same class as malaria, and where mates are selected using a calculator.Normally deluged with ghastly suitors of her father's choosing, she suddenly finds herself on the short list for a bride-seeing tour by a rich and handsome nephew of a neighbor. This is the stuff of which dreams are made.A nightmare materializes when a very un-Indian ruffian moves in next door, complete with beard and obnoxious Harley motorcycle. He might play the bad boy in one of Nisha's beloved romance novels, but in real life, he terrifies her.So she tries to ignore the thundering engine of the bike while anxiously awaiting the arrival of Prince Charming--or at least, Prince Rich. But arriving first are a long-lost black-sheep American aunt and her trouble-magnet teenage daughters. The aunt proves to be a New Age space case, while the cousins’ appetite for disasters threatens to level the city of Ahmedabad. In short order, the demented cousins instigate an elopement, a public protest, and a riot that gets Nisha thrown in jail. Nisha’s family comes to the conclusion that while East and West may meet, sometimes they shouldn't. The guests are seen as an invading force, equipped with weapons of mass corruption.While Nisha wonders how she can hide her now corroded reputation from the dream suitor's family, insanity marches on. Nisha's father adopts a pet cow and convinces half the city it's the reincarnation of a Hindu deity. The two families are finally united in a common to bilk thousands. The result is Madison Avenue's idea of a religious experience, which is not a controllable situation.Indian Maidens Bust Loose is a hilarious romantic comedy set in the land of cows, curry, and the Kama Sutra.",
  "genres": [
    "India",
    "Humor",
    "Chick Lit",
    "Contemporary Romance",
    "Fiction",
    "Contemporary",
    "Romance"
  ],
  "author": "Vidya Samson",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/13613315-indian-maidens-bust-loose"
}