{
  "title": "Infected",
  "description": "Across America a mysterious disease is turning ordinary people into raving, paranoid murderers who inflict brutal horrors on strangers, themselves, and even their own families.Working under the government's shroud of secrecy, CIA operative Dew Phillips crisscrosses the country trying in vain to capture a live victim. With only decomposing corpses for clues, CDC epidemiologist Margaret Montoya races to analyze the science behind this deadly contagion. She discovers that these killers all have one thing in common - they've been contaminated by a bioengineered parasite, shaped by a complexity far beyond the limits of known science.Meanwhile Perry Dawsey - a hulking former football star now resigned to life as a cubicle-bound desk jockey - awakens one morning to find several mysterious welts growing on his body. Soon Perry finds himself acting and thinking strangely, hearing voices . . . he is infected.The fate of the human race may well depend on the bloody war Perry must wage with his own body, because the parasites want something from him, something that goes beyond mere murder. Infected is the first major print release from Internet phenom Scott Sigler, whose podcast-only audiobooks have drawn an immense cult following, with more than three million individual episodes downloaded. Now Sigler storms the bookstore shelves with this cinematic, relentlessly paced novel that mixes and matches genres, combining horror, technothriller, and suspense in a heady mix that is equal parts Chuck Palahniuk, Michael Crichton, and Stephen King. Infected will crawl beneath your skin and leave fresh blood on every page.  \"Part Stephen King, part Chuck Palahniuk, Infected blends science fiction and horror into a pulpy masterpiece of action, terror, and suspense. Three don't read it at night, or just after you've eaten a full meal, or if you're weak of heart. You've been warned!\" --James Rollins, New York Times bestselling author of The Judas Strain and Black Order \"Sigler is masterful at grabbing the reader by the throat and refusing to let go. Just when I thought I knew what abyss he was leading me across, he knocked the bridge out from under... I think I screamed the whole way down... Infected is a marvel of gonzo, in-your-face, up-to-the-minute terror.\" --Lincoln Child, New York Times bestselling author of Deep Storm and Death Match \"Sigler is the Richard Matheson of the 21st Century...smart and creepy, Infected is a flawless thinking-person's thriller. Bravo to a bold new talent!\" --Jonathan Maberry, Bram Stoker Award-winning author of Bad Moon Rising and Ghost Road Blues \"Horror mavens rejoice! Infected is a revelation -- a novel that lives up to its hype. From page one, the story of a mysterious smart-virus that turns its hosts into deadly drooling drones creeps up on a reader like the ratchet of a roller coaster climbing toward its inevitable crest. Sigler brings the folksy character detail of Stephen King, the conceptual panache of Clive Barker, and the oozing, shuddery pathologies of a David Cronenberg movie. Zombies, spies, conspiracies, and gallons of goo make this the fastest read in the west! Highest recommendation!\" -- Jay Bonansinga, national bestselling author of Shattered, Twisted, Frozen, and The Sinking of the Eastland \"Sigler has a unique talent for keeping readers on the edge of their seats; I absolutely had to know what was going to happen next. Infected is full of mayhem, action, and gore--and you won't be able to put it down.\" -- Dave Wellington, author of 13 Bullets and the Monster Island trilogy \"Scott Sigler's Infected is a bucking pulp pony that throws you this way and that, and just when you think you've got your balance, that ole pony bucks the other way. All in all, one hell of an exhilarating ride, and highly recommended.\" --Joe R. Lansdale, World Horror Convention Grand Master and six-time Bram Stoker Award-winning author of Bubba Ho-Tep and Lost Echoes",
  "genres": [
    "Horror",
    "Science Fiction",
    "Fiction",
    "Thriller",
    "Zombies",
    "Audiobook",
    "Aliens"
  ],
  "author": "Scott Sigler",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/13614034-infected"
}