{
  "title": "The Duke's Undoing",
  "description": "Meet the Duke of Ruisdell, the unlikely hero of my new Regency Romance.The duke has just returned from the Napoleonic wars on the Iberian Peninsula with a wound in his shin, where a musket ball was lodged. He is weary, cynical, and very bored. Known as the worst rake in England, he finds he has no interest in upholding that distinction, when his friend, the Marquis of Somerset, proposes a bet: “Five thousand guineas says that seducing Miss Elise Edwards will cure your ennui.” Because his friend has just lost a packet to him, he agrees that the bet be posted in White’s famous Betting Book.The following day, he has a most unsettling experience. Walking in Green Park, he spies a mysterious young woman, veiled, and obviously grieving. A disembodied voice, sounding strangely like that of his late adjutant, informs him, “The jig is up. That is the girl you are going to marry!” He scoffs, but is nevertheless intrigued by something about the slight figure. He even sketches her and asks if he can be of assistance to her. She declines his offer kindly.At the opera that evening, he is again intrigued by a beauty across the Opera Hall. He hears the same voice, saying the same thing. The marquis informs him that the woman in question is Miss Elise Edwards. When he meets her, he recognizes her voice as that of the woman in the park. Now she is surrounded by a surfeit of ex-fiance’s, one of them dangerously unbalanced. Ruisdell discovers an actual bond between them which makes him honor bound to protect her.Thus begins a train of unstoppable events–dangerous, humorous, devilish, and amorous–that carry his life along at such a pace that the duke soon knows not whether he is on his head or his heels. And then there is that bet . . .",
  "genres": [
    "Romance",
    "Historical Romance",
    "Regency",
    "Historical",
    "Regency Romance",
    "Historical Fiction",
    "Fiction"
  ],
  "author": "G.G. Vandagriff",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/13614434-the-duke-s-undoing"
}