{
  "title": "She Wants Her",
  "description": "Getting women into her bed is easy. Getting them out is hard. Women love Cleopatra Giovanni and she loves them back – in ways they’ll never forget. The masculine but very pretty butch radiates charisma and a magnetism that attracts flocks of women – some are random strangers, and some show up because they’ve heard of her infamous skills as a lover (and her “snake”). But those single-minded women are short-term. Cleopatra enjoys their bodies, all the while hoping that the one who will make her believe in forever will come along. The womanizing ways of this successful New York City real estate executive come to a sudden halt the moment she meets the incredibly gorgeous Jacqueline Tripp. Jacqueline, a naïve but determined closeted lesbian, has been watching Cleopatra for some time, and goes above and beyond to possess her in a way no one ever has. Theirs is a passionate love affair, and life is beautiful as they pleasure each other in ways both wild and sweet. No one has ever had such power over Cleopatra. In the clutches of this beautiful liar, will she be conquered by obsessive love? Secrets, reckless ways, ghosts of the past, deceptions, and destroyed dreams complicate their love and lead Cleopatra back to old behaviors that feed her desire, but will never make her happy. Ultimately – Jacqueline wants her. The question is – how far will she go? Accompanied by a captivating cast of characters ranging from loving family members around the Thanksgiving table to famous porn stars in the bedroom, from best friends and ex-lovers to Brooklyn strippers and African princesses, the struggle for love and the drama and humor that ensue will win readers’ hearts as Cleopatra and Jacqueline wrestle with the way things are in order to create the way things should be.",
  "genres": [
    "Lesbian",
    "LGBT",
    "Lesbian Romance",
    "Erotica",
    "Contemporary",
    "Erotic Romance"
  ],
  "author": "Tasha C. Miller",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/13615047-she-wants-her"
}