{
  "title": "What If..",
  "description": "“Katie, are you listening to me?” Chris demanded with a stomp of his feet, like a child. “Chris, I don’t believe you, I know what I saw. Don’t treat me like a fool I’m… ” Just then a mixed color of lights were projected onto the house and Katie turned to see a sheriff car pulling into the driveway, headlights on with red and white lights flashing but no sound. When the deputy got out of the car, her knees gave out and she just about hit the deck. He was here for her, she could feel it down the pit of her stomach. Chris had been right behind her and caught Katie before she fell to the ground. Katie was screaming stop, go away, and in her head but nothing was coming out of her mouth. She closed her eyes, willing the scene to be different when she opened them again. She felt like a small child hiding from the boogieman, if she couldn’t see the deputy then he couldn’t see her, right? She would open her eyes to find him gone in five, four, three, two… “Katie, are you ok?” Chris was yelling at her, for how long she couldn’t be sure. She opened her eyes and there was the deputy, almost right in front of her now. Her mouth wasn’t working; her throat felt dry and closed up, swollen like a bad sore throat but with no pain. Numb. Sometimes in life we know things. Instantly. A sound, a smell, or just a feeling in the pit of our stomachs alert us to changes in life’s vibrations that we cannot understand on an intellectual they are intuitions. For Katie, this means she knows exactly what’s happened to her father before the deputy tells her, knows he’s been in an accident, and knows it’s not okay. In fact, she knows it’s far from okay. After her visit to his bedside at the hospital that night, she will never see him alive again—the first man she ever loved. And after her father’s funeral she is determined to never again see Chris Staller either—the first boy she ever loved. Fast-forward ten years and Katie is now a beautiful, successful, and driven woman in her late-twenties. But her father’s death and Chris’ betrayal have clouded every relationship she has had since that night. From potential romantic partners to her closest friends, she has kept everyone around her from getting too close. Working through these intimacy issues while maintaining a stellar career reputation, however, has been a challenge—but challenges are Katie’s lifeblood. She rises to every occasion and always comes out on top. When Katie pays a visit to her old high school, however, she runs into Chris, now a dedicated PE teacher who pines for the one he let get her. An upstanding member of the community and a much better man than he was a boy, Chris is determined to win Katie back at all cost. But Katie is less than receptive to the idea, and when he lays down a challenge, she is determined to come out on top again. A fun, funny, and poignant journey from first love through finding life’s path, Kelly Rae’s debut is a sweet love story that serves as a reminder to the healing power of forgiveness. Learning to follow the heart is a lesson everyone must learn, and her unadorned prose underscores the emotional terrain of that passage with powerful simplicity. Full of extraordinary grace and warmth, What If…will fill your life with hope and an inner knowing of life’s positive force.",
  "genres": [
    "Romance",
    "Contemporary Romance"
  ],
  "author": "Kelly Rae",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/13615580-what-if"
}