{
  "title": "A Sea Story: The Untold Story of the U.S. Navy Response to 9/11",
  "description": "BASED ON TRUE EVENTS:The U.S. Navy was among the first responders on 9/11. Entrusted with the iconic Ground Zero flag, the Roosevelt battlegroup took to the seas searching out those responsible, and to bring justice to a nation in mourning. On 1145 September 2001, the U.S.S. Leyte Gulf deployed within hours of the attack on the W.T.C. with orders to shoot down and destroy any \"birds not squawking\" over New York City. We were entrusted with the Ground Zero flag raised by the NYFD. We flew that flag with pride and determination from our mast on our important mission. After two days we were then redirected to the gulf and given orders to destroy the Taliban with the Tomahawk missiles onboard. During transit, we were told by our Captain that the Taliban would be waiting for us in the narrow Suez canal. So narrow in fact, only a single ship can go through at any one time. If the first and last ship were to be hit by surface to air missiles, there would be no way out. The aircraft carrier U.S.S Roosevelt, would be trapped in the middle and defenseless. There they were, waiting for us on horseback atop the sandy Suez dunes...following us. Just a bunch of scared kids manning the ships 50 cal guns, wondering what was to happen next. One late night in the gulf, Bush declared war. It was our task to launch the first Tomahawk missiles and kick off the war on terror. We were cut off from the outside world. Email and any other means of communication had been banned for security reasons. Television reports of Anthrax gripping the country with fear and WW3 rumors scuttling through the ships decks. A six man boarding party manned up to routinely search an unresponding suspect Iraqi tanker...what was found would change our lives forever.This is our sea story.",
  "genres": [
    "Nonfiction",
    "History",
    "Military Fiction",
    "Biography"
  ],
  "author": "Joseph Pignataro",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/13616004-a-sea-story"
}