{
  "title": "30 Things Every Woman Should Have and Should Know by the Time She's 30",
  "description": "Featuring advice, wisdom, and observations from an array of prominent and beloved women, 30 Things is an essential guide (and perfect gift) for women on the brink of thirty—and for those who are already there!Fifteen years ago, Glamour published a list of distinctive yet universally true must-haves and must-knows for women on the cusp of and beyond the age of thirty titled, “30 Things Every Woman Should Have and Should Know by the Time She’s 30.” It became a phenomenon.Originally penned by Glamour columnist Pamela Redmond Satran, The List found a second life when women began to forward it to one another online, millions of times. It became a viral sensation, misattributed to everyone from Maya Angelou to Hillary Clinton—but there’s only one original list, and it stands the test of time. Quirky and profound, The List defines the absolute must-haves (#11: “A set of screwdrivers, a cordless drill, and a black lace bra”) and must-knows (#1: “How to fall in love without losing yourself”) for grown-up female happiness.Now, Glamour magazine has gathered together its editors and an incredible group of notable women to expand on each of the items on The List in wise, thoughtful, and intimate essays. Kathy Griffin meditates on knowing when to try harder and when to walk away. Lisa Ling explores the idea that your childhood may not have been perfect, but it’s over, and Lauren Conrad shares what she has learned about what she would and wouldn’t do for money or love. Other personal insights come from Maya Angelou, Rachel Zoe, Taylor Swift, Katie Couric, Portia de Rossi, Kelly Corrigan, ZZ Packer, Bobbi Brown, Padma Lakshmi, Angie Harmon, and many more.Along with essays based on The List, writers share their feelings about what the milestone of turning thirty meant to them. 30 Things is the one book women of all ages will turn to for timely and timeless wisdom.",
  "genres": [
    "Nonfiction",
    "Self Help",
    "Personal Development",
    "Feminism",
    "Womens",
    "Chick Lit",
    "Essays"
  ],
  "author": "Pamela Redmond Satran",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/13616559-30-things-every-woman-should-have-and-should-know-by-the-time-she-s-30"
}