{
  "title": "Proyecto Alfa Centauri",
  "description": "Prólogo José Luis Cordeiro, “Conozca Más” Nikola Danaylov - Nuestro futuro. Tres seres humanos, inteligencias artificiales y almas, estas últimas obtenidas mediante la digitalización del cerebro después de la muerte. Profundas diferencias entre las poblaciones en busca de una identidad. Los personajes principales se mueven en escenarios sorprendentes de un mundo transformado casi más allá, de todo reconocimiento por la tecnología. Surge una poderosa comparación con nuestra civilización actual, que quitando capa tras capa de convenciones y prejuicios, nos deja finalmente, con tan sólo los valores básicos y la fragilidad del ser humano. Cara a cara con los hábitos y las costumbres de un mundo que un día incluso podríamos compartir. Mientras tanto, la inteligencia artificial se revela como el medio para el progreso evolutivo, hacia estados superiores de conciencia compartiendo.Siglo XXIV. Los seres humanos viven en la Tierra y en la Luna, últimos bastiones de su pasado poder. Marte y Net están habitados por inteligencias artificiales y las almas. Estas últimas obtenidas mediante la digitalización del cerebro después de la muerte. La realidad virtual permite la comunicación entre ambas razas, sin embargo, sus diferencias son profundas.Gracias a la digitalización, los seres humanos han aplazado la muerte real a un tiempo indeterminado en el futuro, no obstante, ellos no están satisfechos. Sienten admiración por los seres virtuales, pero también envidia y inferioridad.En cambio las criaturas digitales no pueden resignarse al hecho de estar relegadas en un mundo demasiado pequeño para sus desmedidas ambiciones. Sus experiencias en Marte les han permitido desarrollar la habilidad necesaria para desenvolverse en entornos extraterrestres. Sobre todo han adquirido la confianza indispensable para llevar a cabo la colonización de otros sistemas estelares.El proyecto Alfa Centauri tiene el apoyo de los humanos a cambio de la renuncia de cualquier expansión sobre la Tierra. Justo antes de salir, Seguridad en la Tierra intercepta un mensaje sospechoso de la Agencia Espacial. ¿Terrorismo? La evidencia señala a los Elegidos, una secta que entró en Net cincuenta años antes mediante un suicidio colectivo…El Proyecto Alfa Centauri está disponible en inglés, español, francés e italiano.",
  "genres": [],
  "author": "Marco Santini",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/13616811-proyecto-alfa-centauri"
}