{
  "title": "Bad Moon Rising",
  "description": "Superstition abounds where the moon is concerned. It can bring love, luck, madness, misfortune, pleasure, and pain. Of all the myths and legends, superstitions and old wives tales, no lunar legend is as well known as those surrounding the wolves...Moon Dogs by Erica Kealey—FBI Agent Grant has had enough of his partner Cary's running and hiding. He knows what he saw, he's okay with what he saw. Now all he has to do is convince Cary of that.The Wolf and the Moon by Kayla Bain-Vrba—Dag's life is an endless series of battles, as he fights Game after Game for the amusement of others, his interest in life lost when he killed his own lover. But then, in the middle of a Game, he encounters a familiar face ...A Kind of Remedy by Ashley Shaw—Enticed by gold to participate in an experiment, Nicolaus finds himself regretting it almost immediately. When he comes out of it unscathed, he considers himself lucky. Then the headaches begin ...The Were Curse by Sasha L. Miller—When Innot is abruptly escorted to the royal palace he expects nothing good to come of it. But even his worst imaginings did not involve a journal stolen from him years ago, and incomplete spell cast upon the crown prince.Runaway Prince by May Ridge—On the run from his family and a life he hates, Astin reluctantly stops to rest at a trashy motel for the night. The very last thing he expects is Delaney, a bold, beautiful rentboy—and Astin's mate.The Wolf's Moor by Lupin Drake—Seamus enjoys his life as a bartender in a Scottish town; it's a far better life than the one he led two hundred years ago. The only shadows in his life are the curse that afflicts him and a handsome, determined investigator.Moonwitch by M.J. Willow—Prince Athanes arrives in Kamare to solve the mystery of several soldiers attacked by wolves. But the more he learns of the attacks, the more he realizes there is far more going on than a simple matter of hunger and sickness ...Coming Home by Elizah J. Davis—With his parents dead, Caleb is alone in the world. Having no reason to stay, and nowhere to go, he wanders aimlessly around the country. Then, one night, he turns into a wolf, and the most frightening thing about it is that it doesn't feel strange at all ...The Werewolf of Grey Lake Inn by Megan Derr—Astor is good at telling it like it is, a trait that annoys everyone who knows him, but makes his ghost debunking books a raging success. But even he isn't right about everything, a fact made clear when a simple research trip proves to be anything but.",
  "genres": [
    "Anthologies",
    "Fantasy",
    "M M Romance",
    "Romance",
    "Paranormal",
    "Shapeshifters",
    "LGBT"
  ],
  "author": "Samantha M. Derr",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/13617079-bad-moon-rising"
}