{
  "title": "The Templar Agenda",
  "description": "UK Top 20 - #16UK Top 3 - ThrillersUK #1 - Religious FictionUS Top 5 - Historical ThrillersUS Top 20 - Religious FictionFrom the Bestselling Author of The Plantagenet Vendetta and The Larmenius InheritanceReviewsCan't wait for the new one! - RICHARD DOETSCH, international bestselling author of Thieves of Heaven, Half Past Dawn, and The 13th HourJohn Paul Davis clearly owns the genre of historical thrillers. The Templar Agenda is a fast paced and absorbing tale that takes the reader on an exhilarating adventure from the first page to the last. This tantalizing story is intricately woven and stretches from the ancient secrets of the world's most powerful society to the modern behind-the-scenes brotherhood that still wields power on a global level. - STEVEN SORA, author of The Lost Treasure of the Knights Templar, The Lost Colony of the Templars, Secret Societies of America's EliteA well-researched, original and fascinating work - a real page-turner. - GRAHAM PHILLIPS, bestselling author of The End of Eden, Merlin and the Discovery of Avalon, The Templars and the Ark of the Covenant, Alexander the Great, The Moses Legacy, The Marian Conspiracy, Act of GodA clever, absorbing tale...The Templar Agenda grabs you right from the murderous beginning and takes you on a fast-paced, thoroughly researched thrill-ride... - DAVID LEADBEATER, UK #1 bestselling thriller author of The Bones of OdinTold at a pace that leaves the reader breathless, Davis has constructed a plot that flies across the planet...We follow the novel's protagonists, Swiss Guard Mikael (Mike) Frei and Gabrielle Leoni, daughter of a murdered banker, as they race against time to uncover the hidden secret that has already led to a series of assassinations, could wreak havoc in the world's banking capitals, and threatens the stability and integrity of the Catholic Church itself.... Davis is adept at managing several storylines, moving swiftly from one group of characters to another, as the novel progresses. But he is equally skilled at ensuring that the reader remains gripped by the central plot to its dramatic and surprising conclusion... - JOHN ALCOCK, author, prize winning poet, and former Director of Open Studies Creative Writing, University of Warwick, and Exchange Professor in Dramatic Literature, Eastern Michigan UniversityFROM THE BACK PAGEA Swiss banker is found murdered, the latest in a string of murders whose victims had connections to the Vatican. Their a secret society whose members include some of the most influential men on the planet. They are the inheritors of the Knights an ancient brotherhood of warrior monks who once fought for the preservation of the Church in dangerous times.But in whose name do they act now?Back in Rome, the Vatican Police make a chilling discovery. All of the victims have one thing in common. And the Camerlengo's great-niece is their next target.When Swiss Guard Mikael (Mike) Frei is sent to St. Gallen to act as temporary bodyguard for Gabrielle Leoni, daughter of the murdered banker and great-niece of the Camerlengo, he is completely unprepared for what awaits him. Mike and Gabrielle fail to take to one another but following the discovery of a 14th century diary left behind by Gabrielle's father which provides a dramatic insight into the cause of recent deaths, both of their lives are endangered.A disturbing trail is emerging and an explosive secret is waiting to be a secret someone wants to remain hidden. With Gabrielle intent on discovering the truth behind her father's murder, Mike's position is compromised, forcing him to embark on a dangerous mission across Europe and the Atlantic to ensure Gabrielle's safety and in doing so attempt to uncover the identity of the murderers before they strike again. Something serious is about to happen...",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Thriller",
    "Mystery"
  ],
  "author": "John Paul Davis",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/13617361-the-templar-agenda"
}