{
  "title": "Tipping Point",
  "description": "ASIN B00540VB86 moved to the most recent edition hereTipping Point: There will be no return...  1903: The Arctic's fabled Northwest Passage is navigated for the first time. 2012: An eminent climatologist is found dead in his London apartment. For Robert Spire, an environmental lawyer, what seems like a standard executor's appointment in his client's will, turns out to be anything but, as he is thrust into an international conspiracy involving a terrorist plan to push the Arctic to its tipping point, and the world to disaster...  TIPPING POINT is a fast-paced disaster-fiction action-thriller with a perfect blend of suspense, action, adventure and thrills to keep you turning the pages until the very end.  TWO DEAD CLIMATOLOGISTS... AN INTERNATIONAL CONSPIRACY... A LOOMING ECOLOGICAL DISASTER...  When eminent climatologist Dr Dale Stanton - in the process of studying the Atlantic Ocean's Thermohaline Circulation - is found dead in his London apartment, environmental lawyer, Robert Spire, is given the task to administer a large legacy left by him to global warming organisations. The job should have been straightforward, until a second climatologist, Dr Jack Bannister drops dead on the other side of the Atlantic.  AN INTERNATIONAL CONSPIRACY  Spire's client - suspicious of her son's death - asks him to travel to San Francisco to investigate Dr Jack Bannister's death. Whilst there, Spire learns of a plan to seed the Arctic Ocean with an experimental substance - the aim, to prevent, or at least slow the Arctic's melting ice. A Russian female assassin is tracking Spire's every move however, suggesting that someone clearly has other plans for the region, and wants the climatologists dead at all costs.  A LOOMING ECOLOGICAL DISASTER  As evidence of increased glacial melt in Greenland and reduction in the Arctic ice mounts, Spire becomes determined to join the joint US/French expedition to seed the Arctic. He soon finds however, that the lives of all on board are in peril as he discovers a plan that threatens to push the Arctic to its tipping point and the Earth to disaster...",
  "genres": [
    "Thriller",
    "Mystery",
    "Fiction",
    "Amazon",
    "Environment",
    "Adventure",
    "Mystery Thriller"
  ],
  "author": "Simon Rosser",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/13617561-tipping-point"
}