{
  "title": "Murder in the Red Chamber",
  "description": "Murder in the Red Chamber, first published in Japanese by Bungei Shunjū as part of its \"Mystery Masters\" series, is set in the world of the original Dream of the Red Chamber, the masterwork of eighteenth-century Chinese fiction by Cao Xueqin. Building skillfully on that famous background, Ashibe plays out a most formidable murder mystery set in Peking during the late Qing dynasty. The tale opens with the visitation of Jia Yuan-chun, esteemed daughter of the prosperous Jia family and newly instated concubine to the emperor.In preparation for her arrival, the Jias have constructed a magnificent homage in land known as Prospect Garden. After an all too brief celebration, as a parting gift to her beloved family Yuan-chun decrees that her sisters and closest female cousins relocate from their homes to the Garden proper, along with her brother Bao-yu.Little do they know what horrors await them.During an evening gathering, one of the young maidens of the Garden is brutally murdered in plain sight. This spectacle sets off a series of mysterious deaths. Lai Shang-rong, a local magistrate and Chief Inspector in service to the Jias, is specially commissioned to investigate the goings on and get to the root of the evil that has darkened this otherwise idyllic setting.Bao-yu, however, has designs of his own. As the only male inhabitant of Prospect Garden, and with the pressure of success breathing down his neck as the next in line to the Jia throne, Bao-yu feels obliged to protect those dearest to him and decides to launch a private investigation. Bao-yu's methods confuse Shang-rong, who is certain that a more orthodox approach will flush out the killer in due course. As luck would have it, Bao-yu is soon assigned as an assistant to Shang-rong, who is content to work alone. In spite of the inconvenience, Shang-rong knows that Bao-yu's status as an insider might prove helpful.Yet as time goes on and more murders are committed right under his nose, Shang-rong begins to suspect that Bao-yu may in fact be behind them all. Shang-rong is expected to cooperate with Bao-yu all the same, and so he must face a difficult choice: point the finger at his exalted sidekick, or crack the case before imminent dangers destroy him.Ashibe's tragic conclusion leaves us with a heavy moral question while presenting even the most seasoned mystery fan with a refreshing and innovative take on the detective novel formula.",
  "genres": [
    "Fiction",
    "Japanese Literature",
    "Japan",
    "Mystery",
    "Asia",
    "Mystery Thriller",
    "Crime"
  ],
  "author": "Taku Ashibe",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/13618093-murder-in-the-red-chamber"
}