{
  "title": "Apostasy",
  "description": "Born of the same bloodline and destined to destroy one another finds two souls without a way, still searching for choice. One’s view seen from above the earth as a powerful being of Heaven’s highest winged ministry and the celestial scry’s mighty sentry. The other’s station shown from a world below as the superior witch and princely lord of the damned. The passing of their time as brothers has long since gone, but their connection remains unceasingly strong. As one a part of the other, which the other is not, the angelic one of their make has settled into a vessel possessing the supreme nature of God’s goodness and the might and valor of a champion Knight. A savior of lost souls vested and collared in the revered position of a Roman Catholic Priest. A man of God committed and destined to bring an end to the cursed evil, which has root itself inside his family tree, and taken the lives of all his ancestors and cherished loved ones. The path of one will be tested by the seductive trappings of a witch and a previous born of the flesh existence that will pull into question the true quest of the guardian of the moonlit sky. Book II in The Moon God Trilogy has the divided sons of the bloodline at odds with each other and within themselves by a bond felt to last throughout infinity. Will these sworn enemies find a way to unite and end the conflict that threatens all in existence? Or will bringing the two together open the gates of eternal Hell and create a new and more powerful God? One man of the cloth has been birthed with the faith and fortitude to see evil undone, but the truth as to its exact origination and seemingly indestructible existence may lie elsewhere and guide the heart of an anointed hero away from a world he never truly knew. Apostasy is a renunciation of a religious faith. Abandonment of a previous loyalty. Deflection… This novel contains Extreme Adult sexual subject matter and violence.",
  "genres": [],
  "author": "Marlene K. Slade",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/13618450-apostasy"
}