{
  "title": "Bringing Adam Home: The Abduction That Changed America",
  "description": "Before Adam Walsh there were no faces on milk cartons, no Amber Alerts, no National Center for Missing and Exploited Children, no federal databases of crimes against children, no pedophile registry. His 1981 abduction and murder—unsolved for over a quarter of a century—forever changed America.One sunny July morning in 1981, RevÉ Walsh and her six-year-old son Adam stopped by the local Sears to pick up some new lamps. Enchanted by a video game at the store's entrance, Adam begged RevÉ to let him try it out while she shopped. When she returned a few minutes later, Adam was gone.The shock of Adam's murder, and of the inability of the police and the FBI to find his killer, radically altered American innocence and our ideas about childhood. Gone forever were the days when parents would allow their kids out of the house with the casual instruction \"Be home by dark!\"RevÉ and John Walsh—who would go on to create America's Most Wanted—became advocates for the transformation of law enforcement's response to and handling of such cases. Prompted by the Walshes' activism, Congress passed the Missing Children Act in 1982, and the National Center for Missing and Exploited Children was founded in 1984.While our lives have been significantly altered by Adam Walsh's case, few of us know the whole story—how, after more than twenty-seven years of relentless investigation, decorated Miami Beach homicide detective Joe Matthews finally identified Adam's killer.Bringing Adam Home is the definitive account of this horrifying crime—which, like the Lindbergh kidnapping fifty years earlier, captured public attention—and its aftermath, a true story of tragedy, love, faith, and dedication. It reveals the pain and tenacity of a family determined to find justice, the failed police work that allowed a killer to remain uncharged, and the determined efforts of one cop who accomplished what an entire legal system could not. As harrowing as In Cold Blood, yet ultimately uplifting, Bringing Adam Home is the riveting story of a triumph of justice and the enduring power of love.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Crime",
    "Biography",
    "Audiobook",
    "Mystery",
    "History"
  ],
  "author": "Les Standiford",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/13621442-bringing-adam-home"
}