{
  "title": "And When She Was Good",
  "description": "When Hector Lewis told his daughter that she had a nothing face, it was just another bit of tossed-off cruelty from a man who specialized in harsh words and harsher deeds. But twenty years later, Heloise considers it a blessing to be a person who knows how to avoid attention. In the comfortable suburb where she lives, she's just a mom, the youngish widow with a forgettable job who somehow never misses a soccer game or a school play. In the state capitol, she's the redheaded lobbyist with a good cause and a mediocre track record.But in discreet hotel rooms throughout the area, she's the woman of your dreams—if you can afford her hourly fee.For more than a decade, Heloise has believed she is safe. She has created a rigidly compartmentalized life, maintaining no real friendships, trusting few confidantes. Only now her secret life, a life she was forced to build after the legitimate world turned its back on her, is under siege. Her once oblivious accountant is asking loaded questions. Her longtime protector is hinting at new, mysterious dangers. Her employees can't be trusted. One county over, another so-called suburban madam has been found dead in her car, a suicide. Or is it?Nothing is as it seems as Heloise faces a midlife crisis with much higher stakes than most will ever know.And then she learns that her son's father might be released from prison, which is problematic because he doesn't know he has a son. The killer and former pimp also doesn't realize that he's serving a life sentence because Heloise betrayed him. But he's clearly beginning to suspect that Heloise has been holding something back all these years.With no formal education, no real family, and no friends, Heloise has to remake her life—again. Disappearing will be the easy part. She's done it before and she can do it again. A new name and a new place aren't hard to come by if you know the right people. The trick will be living long enough to start a new life.",
  "genres": [
    "Fiction",
    "Mystery",
    "Thriller",
    "Suspense",
    "Audiobook",
    "Mystery Thriller",
    "Crime"
  ],
  "author": "Laura Lippman",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/13623815-and-when-she-was-good"
}