{
  "title": "The Things They Cannot Say: Stories Soldiers Won't Tell You About What They've Seen, Done or Failed to Do in War",
  "description": "“The harrowing accounts detail the experiencesof 11 US soldiers and Marines who have been ravaged by modern warfare and its psychological aftermath. What makes Kevin’s reporting unique and essential is that it didn’t stop on the battlefield—he followed his subjects home.” — Vice An important look at the unspoken and unknown truths of war and its impact, told through the personal stories of those who have been there. In The Things They Cannot Say, eleven soldiers and Marines display a courage that transcends battlefield heroics—they share the truth about their wars. For each it means something one struggles to recover from a head injury he believes has stolen his ability to love, another attempts to make amends for the killing of an innocent man, while yet another finds respect for the enemy fighter who tried to kill him. Award-winning journalist and author Kevin Sites asks the difficult questions of these combatants, many of whom he first met while in Afghanistan and Iraq and others he sought out from different What is it like to kill? What is it like to be under fire? How do you know what’s right? What can you never forget? Sites compiles the accounts of soldiers, Marines, their families and friends, and also shares the narrative of his own failures during war (including complicity in a murder) and the redemptive powers of storytelling in arresting a spiraling path of self-destruction. He learns that war both gives and takes from those most involved in it. Some struggle in disequilibrium, while others find balance, usually with the help of communities who have learned to listen, without judgment, to the real stories of the men and women it has sent to fight its battles.",
  "genres": [
    "Nonfiction",
    "War",
    "History",
    "Military Fiction",
    "Psychology",
    "Politics",
    "Biography"
  ],
  "author": "Kevin Sites",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/13623884-the-things-they-cannot-say"
}