{
  "title": "The Hollow Man",
  "description": "The first in a series of gritty and original thrillers following cunning detective Nick Belsey from a rising voice in British crime fiction \"A twisting spiral of lies and corruption, a pitch-perfect portrait of contemporary London and a beguiling bastard of a hero-what a recipe for a great read.\" - Val McDermidWaking up on Hampstead Heath in a crashed squad car, still drunk, with no wallet, no phone, and only a Masonic candlestick to remind him of the events of the night before, London police detective Nick Belsey has hit rock bottom. At dawn he checks in at the station to collect his things on what should be the last day of his career, but something in the overnight files catches his interest-a missing person report from Bishops Avenue, London's richest street. Alex Devereux-worth a fortune, never seen, lived alone-has vanished, leaving his Porsche in the garage and a suicide note on his desk. In Devereux's disappearance, Belsey sees a way out for himself: the opportunity for a new start by stealing the man's identity. It's a pity, however, that so many other people are looking for Devereux as well. Belsey quickly realizes that his would-be scam is about to be outclassed by a far more ambitious fraud, as the race to get to the elusive oligarch's fortune becomes a game with life and death stakes.The Hollow Man is a tour de force of pace and plotting, and a vividly evocative love-letter to London. Oliver Harris is a sharp and stylish writer who has created a seductive, worldly, and cunning anti-hero. Nick Belsey is amoral and cynical but nonetheless deeply serious about his investigation, about a police officer's vision of the world, and about the quest for truth that haunts any good detective.",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Crime",
    "Mystery Thriller",
    "Detective",
    "British Literature"
  ],
  "author": "Oliver Harris",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/13623915-the-hollow-man"
}