{
  "title": "Bad Habits: Confessions of a Recovering Catholic",
  "description": "Jenny McCarthy--actress, comedian, activist, and New York Times bestselling author--candidly recounts her humorous Catholic upbringing, from her childhood dream of becoming a nun to her Playmate of the Year centerfold, and all of the Hail Mary's in between.In keeping with the theme of her comedic New York Times bestsellers, from Belly Laughs to Love, Lust & Faking It, McCarthy brings her trademark honesty, humility, and humor to bear as she chronicles her often embarrassing, occasionally outlandish, and always entertaining life as a born-and-raised Catholic girl.Jenny attended one of the most prestigious all-girl Catholic schools in Chicago. While most young girls in Jenny's neighborhood were playing with Cabbage Patch dolls for fun, Jenny was playing with Jesus, Mary, and Joseph dolls. She had every intention of growing up and becoming a nun, but a few hilarious speed bumps and blinking red lights along the way changed her mind. Jenny never did accept Sister Mary's reasoning that she could avoid purgatory if she just bought a string necklace for $10. The fact that two of her aunts are simultaneously nuns and cops-yes, they carry guns and shoot people while wearing a habit-never made complete sense to her. And neither does her mother's insistence that Jenny bury certain religious statues in the front lawns of her houses before she sells them. But then again, Jenny does have four of them buried across Southern California.This book tells the story of what went wrong during Jenny's Catholic upbringing, or, as Jenny puts it now, what went right. Chapters include: \"I Knew I Should Have Worn Underwear to Church\", \"Jesus' Baby Mama\", \"Can Someone Kill Our Dog, Please?\", and \"Oh No, My Mom is Going to Hell.\"BAD HABITS is a brutally honest, hilarious memoir that will delight the legions of Jenny McCarthy fans.",
  "genres": [
    "Nonfiction",
    "Humor",
    "Memoir",
    "Biography",
    "Religion",
    "Comedy",
    "Adult"
  ],
  "author": "Jenny McCarthy",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/13624101-bad-habits"
}