{
  "title": "The Flipside of Feminism: What Conservative Women Know—and Men Can't Say",
  "description": "What if everything you've been told about women in America is wrong? What if what your college professors taught you - along with television, movies, books, magazine articles, and even news reports - have all been lies or distortions?Since the 1960s, American feminists have set themselves up as the arbiters of all things female. Their policies have dominated the social and political landscape. The \"spin sisters\" in the media (aptly named by Myrna Blyth in her book of the same name) and their cohorts in academia are committed feminists. Consequently, everything Americans know  or think they know  about marriage, kids, sex, education, politics, gender roles, and work/family balance, has been filtered through a left-wing lens.But what if conservative women are in the best position to empower American women? Forty years have passed since the so-called women's movement claimed to liberate women from preconceived notions of what it means to be female  and the results are in. The latest statistics from the National Bureau of Economic Research show that as women have gained more freedom, more education, and more power, they have become less happy.Enough, say Suzanne Venker, an emerging young author, and veteran warrior Phyllis Schlafly. It's time to liberate America from feminism's dead-end road. Cast off the ideology that preaches faux empowerment and liberation from men and marriage. While modern women enjoy unprecedented freedom and opportunities, Venker and Schlafly argue that this progress is not the result of feminism.Women's progress has been a natural evolution - due in large part to men's contributions. American men are not a patriarchal bunch, as feminists claim. They have, in fact, aided women's progress. And like women, they have been just as harmed by the feminist movement.In The Flipside of Feminism, Venker and Schlafly provide readers with a new view of women in America  one that runs counter to what Americans have been besieged with for decades. Their book demonstrates that conservative women are, in fact, the most liberated women in America and the folks to whom young people should be turning for advice. Their confident and rational approach to the battle of the sexes is precisely what America needs.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Feminism",
    "Sociology",
    "Gender Studies",
    "Research",
    "Social Issues"
  ],
  "author": "Suzanne Venker",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/10432892-the-flipside-of-feminism"
}