{
  "title": "Rome: An Empire's Story",
  "description": "The very idea of empire was created in ancient Rome and even today traces of its monuments, literature, and institutions can be found across Europe, the Near East, and North Africa--and sometimes even further afield.In Rome , historian Greg Woolf expertly recounts how this mammoth empire was created, how it was sustained in crisis, and how it shaped the world of its rulers and subjects--a story spanning a millennium and a half of history. The personalities and events of Roman history have become part of the West's cultural lexicon, and Woolf provides brilliant retellings of each of these, from the war with Carthage to Octavian's victory over Cleopatra, from the height of territorial expansion under the emperors Trajan and Hadrian to the founding of Constantinople and the barbarian invasions which resulted in Rome's ultimate collapse. Throughout, Woolf carefully considers the conditions that made Rome's success possible and so durable, covering topics as diverse as ecology, slavery, and religion. Woolf also compares Rome to other ancient empires and to its many later imitators, bringing into vivid relief the Empire's most distinctive and enduring features.As Woolf demonstrates, nobody ever planned to create a state that would last more than a millennium and a half, yet Rome was able, in the end, to survive barbarian migrations, economic collapse and even the conflicts between a series of world religions that had grown up within its borders, in the process generating an image and a myth of empire that is apparently indestructible. Based on new research and compellingly told, this sweeping account promises to eclipse all previously published histories of the empire.",
  "genres": [
    "History",
    "Nonfiction",
    "Ancient History",
    "Classics",
    "Italy",
    "Classical Studies",
    "Ancient"
  ],
  "author": "Greg Woolf",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/13625837-rome"
}