{
  "title": "A Requiem For Dead Flies",
  "description": "After their mother’s miscarriage, Lester and Gordon MacAuley were sent to Battle View Farm to stay with their grandmother for the summer. But the house on Battle View Farm has a haunting secret. As Grandma Vivian slowly slipped into madness, the brothers’ lives became entangled in mortal danger. That summer of terror left them scarred and plagued by the family’s dark secret.Now, years later, the MacAuley brothers have returned with dreams of breathing new life into Battle View Farm. But living in the house on Battle View Farm, they are forced to face their past and solve the mystery that began generations ago. And to face the ghosts that still haunt their family’s legacy.A legacy written in dead flies.\"Peter N. Dudar has just made me a fan. A Requiem for Dead Flies is beautifully eerie. There are very few horror authors working today who have Dudar's skill at putting ordinary people into such terrifying situations. The dark descent into memory and family secrets waiting for the MacAuley brothers is almost too much - it would be too much, too like a nightmare you just can't wake up from - if it weren't for Dudar's smooth eloquence. Seriously, the pages go down as easily as a fine bourbon. Just don't let your guard down, because like a fine bourbon, this book's got a bite to it. A first class chiller!\" -Joe McKinney, Bram Stoker Award-winning author of Flesh Eaters and Dead City\"Peter Dudar's A REQUIEM FOR DEAD FLIES is an original twist on the modern ghost story. In rural New York on a lonesome family farm, Dudar layers on the tension in a perfectly paced narrative, leading to a surprising and horrific ending. A REQUIEM is an outstanding first novel and I highly recommend it.\" -Holly Newstein, co-author of ASHES and THE EPICURE, as H.R. Howland.“Peter N. Dudar is a natural born storyteller who brings his characters to vivid life. In A REQUIEM FOR DEAD FLIES, he gives us the tale of the MacAuley brothers who, in trying to get a fresh start, instead collide with a wall of grief, built from the debris of tragic family secrets. A bright new voice in the horror genre, and a book not to be missed.” -L.L. Soares, Author of LIFE RAGE and IN SICKNESS",
  "genres": [
    "Horror",
    "Paranormal",
    "Fantasy",
    "Fiction"
  ],
  "author": "Peter N. Dudar",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/13626304-a-requiem-for-dead-flies"
}