{
  "title": "Midnight in Peking: How the Murder of a Young Englishwoman Haunted the Last Days of Old China",
  "description": "Midnight in Peking is a gripping true murder mystery by Paul FrenchTHE INTERNATIONAL BESTSELLER - AS HEARD ON BBC RADIO 4'A first-rate murder story, a thrilling narrative. Hurtles along from one cliffhanger to the next' SpectatorPeking, 1937:The teenage daughter of a British consul is brutally slaughtered. The police investigation is botched; as war looms British and Chinese authorities close ranks. A grieving father vows to uncover the truth - alone.Seventy-five years later, historian Paul French uncovers a stash of forgotten documents revealing the killer's identity . . .For those who loved The Suspicions of Mr Whicher and Midnight in the Garden of Good and Evil this is a riveting and evocative true crime classic.'Gripping, spellbinding . . . drawing the reader from the very first pages into an unwholesome, macabre world' Guardian'Part historical docudrama, part tragic opera . . . it is French's enormous achievement that he pieces together the puzzle. He tells this tale with the skill of an Agatha Christie' Financial Times'Fascinating and irresistible. I couldn't put it down'John Berendt, author of Midnight in the Garden of Good and Evil'Vivid, pulsating, riveting. It is the storytelling flair that marks Midnight in Peking so with its false leads and twists . . . it sucks the reader in like the best fiction' ScotsmanBorn in London, Paul French has lived in China for more than 10 years. He is a widely published analyst and commentator on China; his books include a history of North Korea, a biography of Shanghai adman and adventurer Carl Crow, and a history of foreign correspondents in China.",
  "genres": [
    "Nonfiction",
    "History",
    "True Crime",
    "China",
    "Mystery",
    "Crime",
    "Asia"
  ],
  "author": "Paul   French",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/13627330-midnight-in-peking"
}