{
  "title": "24 Hours Between Dream & Reality",
  "description": "The story is about a boy who takes an eye-opening journey to Tehran, the Capital of Iran to learn lessons of tolerance, aiming high and following one’s dreams. During the few months he lives on the streets, Latif learns more life lessons than he would have done with many years of education. He experiences harsh living conditions, discrimination and humiliation. At this young age, he has a lot of confusion and cannot figure out what is wrong with a system that sanctions such a life for children. The experiences by five of his friends add more depth to the story. Latif’s fragile soul almost crashes witnessing elements of poverty and helplessness and observing that no matter how hard his father and many others try, they still remain poor and powerless.At the beginning the writer, Samad Behrangi, gives a detailed description of the material world surrounding his hero, the behaviors, conversations and conducts of all players, as he believes the material environment plays a major role in building up the characters of the people. But as soon as the story kicks off, it moves forward with a fast pace of the power and strength of life itself, taking the reader along with it.Readers meet people of different social strata, with voices of each adding depth and excellent character development. Latif spends a great deal of time outside a toy store wishing to have toys to play with and has a fascination about one particular camel who later becomes his mentor and takes him on an imaginary tour to see the other side of the society, gives him awareness as to how the system functions. The real awakening however, is more of a wake-up call. Latif goes beyond setting a goal for his own happiness and success, as he realizes that he must find a way to identify the causes of those social problems and find solutions for them.",
  "genres": [
    "Fiction",
    "Short Stories",
    "Novels",
    "Literature",
    "Childrens"
  ],
  "author": "Samad Behrangi",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/13628362-24-hours-between-dream-reality"
}