{
  "title": "Ethan's Mate",
  "description": "Ethan Hale is a vampire with a mission. Together with his three brothers and a few other unmated members, he fights with The Vampire Coalition to protect humans from fallen vampires. His life is fairly simple. If he has a problem... he solves it. If it's an evil problem... he kills it. But his uncomplicated life is about to end when his mate unexpectedly calls him to her.Brianna Cole is weak, her life force fading away. She thinks she is suffering from a rare form of leukemia. Little does she knows that her illness is much more complicated. She's dying because she has not united with her vampire mate and given him his soul that she has been guarding since birth.Ethan finds Brianna and knows he needs to convince her to mate or watch her die. He's waited for her for five hundred years and he has no intention of letting her go, but she is not in any shape for the dominate, volatile mating ceremony with a vampire. He will have to win the race against time to strengthen Brianna and a battle with a stalking fallen to claim his mate. He is also at war with his mating instincts that make him burn to dominate and conquer her. But Ethan is determined, and the stubborn vampire will do whatever is necessary to possess his soul bonded mate... forever.18+ ONLY - This book contains graphic sex, graphic language, rough sex, domination, bondage and other subjects that are intended for adults only. This is a romance but contains very erotic content. It is not a true BDSM novella, so if you prefer the SM element you won't find it here. There's no real pain inflicted. It is more romance with alpha male domination being part of the vampire nature and mating instincts. However, it does contain all of the above sexual content in the 18+ warning. Download only if you love a little (or maybe a lot) of kink and heat in you alpha male vampires romances. : )",
  "genres": [
    "Paranormal",
    "Vampires",
    "Romance",
    "Paranormal Romance",
    "Erotica",
    "Fantasy",
    "Novella"
  ],
  "author": "J.S. Scott",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/13628983-ethan-s-mate"
}