{
  "title": "Deadly Affair",
  "description": "Autumn 1763. Career diplomat Alec Halsey has been elevated to a marquessate he doesn't want and Polite Society believes he doesn't deserve. And with the suspicion he murdered his brother still lingering in London drawing rooms, returning to London after seven months in seclusion might well be a mistake. So when a nobody vicar drops dead beside him at a party-political dinner, and his rabble-rousing uncle Plantagenet is bashed and left for dead in a laneway, Alec’s foreboding deepens. Uncovering the vicar's true identity, Alec suspects the man was poisoned. But who would want a seemingly harmless man of God murdered, and why?2016 Goethe International Novel Writing Competition Finalist for Outstanding Works in Post-1750s Historical Fiction2012 Romance Writers of Australia Romantic Book of the Year FinalistFull-length novel (114,000 words, about 450 standard printed pages)Non explicit (mild sensuality, mild violence)Character-driven amateur sleuth\"Descriptions are so vivid I felt as if I were there, experiencing the sights and sounds of Georgian London. Lucinda Brant gets five stars from me, and I can't wait to read the other books in the Alec Halsey series” — Anne Boling, Readers’ Favorite, rated 5 STARS“Lucinda Brant has crafted a clever and intriguing mystery in [Deadly Affair] which very skilfully pulls together seemingly disparate plot threads to reach a thoroughly satisfying conclusion with a couple of plot twists I most definitely did not see coming. [I am] hooked and eager for more.” — Caz Owens All About Romance, rated a DESERT ISLE KEEPERConnecting BooksMany readers enjoy Lucinda Brant's books as part of a wider series since her characters inhabit the same meticulously-researched 18th Century world with people and events cross-referenced throughout. You can explore the details and delve deeper into the history within each book by visiting LucindaBrantAuthor on Pinterest. Should you wish to read each series in chronological order, here is the sequence:Alec Halsey MysteriesSpring 1763 DEADLY ENGAGEMENT (Country house murder and mayhem)Autumn 1763 DEADLY AFFAIR (A poisoned vicar and the mysterious Miranda)Winter 1763 DEADLY PERIL (Bloody intrigue abroad)Summer 1764 DEADLY KIN (Evil lurks in Edinburgh) In progressSalt Hendon Series1763 SALT BRIDE (Magnus and Jane)1767 SALT REDUX (Antony and Caroline)SALT HENDON COLLECTION — boxed set with bonus novella SALT ANGELRoxton Family Saga1740s NOBLE SATYR (Renard and Antonia)1760s MIDNIGHT MARRIAGE (Julian and Deb)1770s AUTUMN DUCHESS (Antonia and Jonathon)1770s DAIR DEVIL (Dair and Rory)1770s PROUD MARY (Mary and Christopher) In progress1780s SATYR’S SON (Henri-Antoine and Lisa) In progress",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Historical Mystery",
    "Historical",
    "Romance",
    "Historical Romance",
    "Audiobook"
  ],
  "author": "Lucinda Brant",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/13629299-deadly-affair"
}