{
  "title": "The Pyramid Builders",
  "description": "Dr. Christopher Connor has discovered a way to view the past. His invention collects light and focuses it such that events that occurred on Earth years ago can be viewed. All one need do is travel one light year away and one can see what was happening on the planet a year earlier by capturing and focusing the reflected light that left Earth a year ago. There’s only one problem: no ship exists that can travel faster than the speed of light, so his device cannot be conclusively demonstrated to function as advertised. That’s fine with Christopher, who would much rather party and have a good time rather than defend his creation against critics and governmental bureaucrats. Besides, who would pay to view the past anyway?Jillian Gordon, an Egyptologist with a PhD in Quantum Physics, has discovered that the survival of Earth depends on viewing what happened at the building of the Great Pyramid of Khufu five thousand years in the past. Christopher’s device would allow her to do just that and she intends to draft him into the project. Christopher is about to discover that the organization Jillian works for has engineered a starship with a faster-than-light drive, which will now allow his device to be field tested. The stardrive for that ship was developed from diagrams carved on the back of an ancient stone tablet excavated at the site of the Great Pyramid.Life for Christopher is about to make a radical departure from his party, happy-go-lucky lifestyle. Getting Christopher to focus on what needs to be done is a problem Jillian hadn’t counted on in her quest to save humanity. The predicted destruction of Earth, which is carved on the front of the tablet, doesn’t leave her much time and Christopher isn’t cooperating.What neither of them know is that the answer to survival is more than sixty five million light years away in light that left Earth just before the mass extinction of the dinosaurs.",
  "genres": [
    "Science Fiction",
    "Time Travel"
  ],
  "author": "Saxon Andrew",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/13629616-the-pyramid-builders"
}