{
  "title": "Wuthering Frights",
  "description": "From New York Times And USA Today Bestselling Paranormal Romance Series Author, HP Mallory, Comes The Dulcie O’Neil Series!“H.P. Mallory has a quick wit, a fresh voice, and a clever way with words. If you like Charlaine Harris, you’ll love H.P. Mallory!” ~ Larissa Ione, New York Times Bestselling AuthorIf you like your books steamy (this is a paranormal romance series for adults, not for kids or teens!) and you appreciate a butt-kicking, take no prisoners heroine, read on!WUTHERING FRIGHTS is the fourth book in the Dulcie O’Neil A father she never knew existed,An impossible decision that had to be made,A lie she must keep to herself at all costs,And the realization that every choice she makes has consequences.Fairy and law enforcement agent, Dulcie O'Neil, has just discovered that her father is the Head of the Netherworld, and a double-dealing, illegal potions importer. Worse yet, she's now working for him.Knight Vander, Dulcie's boyfriend and Head of the Association of Netherworld Creatures, is on to her father, but, in the process, will he discover Dulcie's secret? And if he does, will it mean his life?ALSO BY HP THE JOLIE WILKINS Fire Burn and Cauldron BubbleToil and TroubleBe Witched (Novella)Witchful ThinkingThe Witch Is BackSomething Witchy This Way ComesTHE DULCIE O’NEIL To Kill A WarlockA Tale Of Two GoblinsGreat HexpectationsWuthering FrightsMalice In WonderlandFor Whom The Spell TollsEleven Snipers Sniping (Short Story)THE LILY HARPER Better Off DeadThe Underground CityTo Hell And BackPersephoneThe Bladesmith (Novella)THE PEYTON CLARK Ghouls Rush InOnce Haunted, Twice ShyBig Easy Murder (Novella)THE BRYN AND SINJIN SinjinThe ScentBlood Lust (Novella)",
  "genres": [
    "Paranormal",
    "Fantasy",
    "Urban Fantasy",
    "Paranormal Romance",
    "Romance",
    "Fae",
    "Magic"
  ],
  "author": "H.P. Mallory",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/13629951-wuthering-frights"
}