{
  "title": "Modern Disciples Volume 2",
  "description": "Jane Dotter has spent the last few months in Las Vegas trailing a man who may be in league with the Titans. He is a well-known mobster who controls more than half the drug trade in the city. She is joined by Lisa Mikoto, a fellow disciple she met on her previous journey. Her suspicions are confirmed when she has an encounter with the spawn. Jane and Lisa soon learn that Ryan Hunter is gathering their group back together in Vegas. They are soon joined not only by Ryan, but Angie, Sajaad, and Armand. Jane's mother Freya appears and confronts Jane with a new task. Not only does Jane receive a new mission from her mother, but she must also deal with her developing feelings for Ryan. When an encounter with an old enemy brings a new sense of urgency, Ryan decides to split the group up into three teams. Jane and Ryan embark on a mission to investigate the mobster's camp in the middle of the desert. Jane will soon not only have to confront her feelings for Ryan, but an impending catastrophe that will surely mean her death. Volume 2 of Modern Disciples continues the story of six disciples who fight their patron's cold war against the Titans and their spawn. The story is told from the perspective of a different character that has been hailed as many readers' favorite. Through her eyes you will see her love unfold as well as her fears. New spawn enter the fray as well as some familiar ones. Battles will rage, drama will ignite, and a goal will be set for the disciples that will determine the fate of far more than just their world. The Titan's plan begins to take shape as we see how it affects the mortals and takes advantage of their weaknesses. Monsters from Norse Mythology, from Dark Elves to Fire Giants, make an appearance in this story, as well as new gods and disciples. Once again, the reader will be tempted to skip ahead to see how the disciples escape their peril. From the scorching sands of the Las Vegas desert, to the turbulent waters of the Florida Keys, the disciples will be tested even harder than they were in the previous story. No longer do they have a simple task of slaying a monster. They must learn to see that humanity can be found in the most dangerous of adversaries, especially if one is related to them.",
  "genres": [],
  "author": "I.S. Anderson",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/13630443-modern-disciples-volume-2"
}