{
  "title": "What a Texas Girl Wants",
  "description": "“Kristina Knight doesn’t hold back on the sass, emotion, and passion, keeping her readers riveted right up until they reach The End.” — Aimee Carson, author of Secret History of a Good Girl and How to Win the Dating War“Kristina Knight delivers a fun romp from Mexico, through Texas, and straight into true love” —Kelsey Browning, author and cofounder of Romance UniversityKathleen Witte is a down-to-earth girl. She has to be, with the family ranch on the verge of success. After seven months of keeping it all together by swearing off men, however, Kathleen needs a bit of fun in the sun. Waking up with a husband she can’t remember isn’t how she planned to blow off steam.The last thing Jackson Taylor wants in his life is a down-to-earth girl. He has four weeks of freedom in which to find his birth mother. He’s done well avoiding commitment until now, so when he wakes up on a Mexican beach with Kathleen his first reaction is curiosity. When he spies the matching wedding rings on their left hands curiosity turns to concern.Neither Jackson nor Kathleen want to stay married, but when her family shows up, they have no choice. Once back in Texas, however, can they keep this all-business marriage from turning into an all-consuming love?Sensuality Level: SensualOnce upon a time, Kristina Knight spent her days running from car crash to fire to meetings with local police—no, she wasn't a troublemaker, she was a journalist. When the opportunity to focus a bit of energy on the stories in her head, she jumped at it. And she’s never looked back. Now she writes magazine articles by day and romance novels with spice by night. She lives on Lake Erie with her husband, three-year-old daughter, and twenty-year-old fur-kid. Happily ever after.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Westerns",
    "Fiction"
  ],
  "author": "Kristina Knight",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/13630530-what-a-texas-girl-wants"
}