{
  "title": "Here Comes Everybody: The Story of the Pogues",
  "description": "Here Comes Everybody: The Story of the Pogues, by James Fearnley, contains all the highs, lows, successes and excesses, in a definitive and honest account of the Pogues and their exuberant frontman Shane MacGowan.'One of the best books I've read so far this year . . . Naturally, Shane MacGowan is the book's focus and fascination, a mixture of personal awfulness and great charm, but this isn't a biography of Shane (though his quote on the front is worth the money alone - 'It's just how I'd imagine I'd remember it') . . . Fearnely also makes sure that this is his book, with great honesty . . . In the end it is the I-was-there insights that make Here Comes Everybody such a good book . . . not just an essential purchase for Pogues fans, but for anyone interested in the reality of being in a band. And what a band.' - David Quantick, Word magazine'Fearnley's descriptions of Shane MacGowan, the front man of the Irish folk-rock band the Pogues, suppurate with pure deliciousness . . . By 1991, Fearnley 'had ended up hating' the 'Miss Havisham' figure who sat in a darkened hotel room, painting his face silver and refusing to go on stage - and yet his memoir is funny and affectionate, a cackling expectoration of a mad decade as part of the band . . . In his own way, MacGowan is the ideal protagonist - talented, inspired, and halitotic, but flawed. 'My dreams have featured Shane more often than my dad for some time now,' writes Fearnely, touchingly. Read it, and exhale.' --Camilla Long, Sunday Times'Fearnley is brilliant at conjuring the milieu from which the Pogues sprang, a lost, down-at-heel demimonde of King's Cross squats and housing association flats. If he can't or won't tell you why MacGowan's decline occurred, he describes it in harrowing detail: the screaming fits, the vomiting, his skin 'the colour of grout' . . .Fearnley's book fits perfectly with the Pogues: for all their earthiness, they were a band concerned with myths, from the Irish legends MacGowan's lyrics relocated to the back streets and pubs of north London to the persistent rock'n'roll fable of the damned, beautiful loser. There's nothing romantic about alcoholic self-destruction, as Here Comes Everybody makes clear, but a song as beautiful as A Pair of Brown Eyes can make you believe there is at least while it's playing. In the process, MacGowan became a mythic figure himself: a myth, despite the unsparing detail that Fearnley ends up burnishing.' --Alexis Petridis'If you think all rock-music memoirs are a mixture of PR fluff, second-hand observations and strategically selected memories, then Here Comes Everybody: The Story of The Pogues is the book to make you change your mind . . . That Fearnley hasn t been quarantined for writing such a warts-and-all tale says much about the band and the bond formed across 30 fractious years. A band of brothers to the very end, then, and with a fine, salty memoir to raise a glass to.' -- Irish Times'An enjoyable and charming read ... The book whizzes by in a blur of more gigs, more hits, more alcohol-fuelled triumphs and disasters. Fearnely is especially good on the band's eventful 1985 US tour ... Like the Pogue's best work, Here Comes Everybody is anything but streamlined and orderly, and its endless twists and turns pack a mightly wallop.' -- Sunday Business Post'A frank and funny account of wild times and shattered friendships by the folk-punk outfit's accordion player, James Fearnely. It kicks off as the rest of the group agree to throw out their shambolic frontman.' --Metro",
  "genres": [
    "Music",
    "Nonfiction",
    "Biography",
    "Memoir",
    "Ireland",
    "Autobiography",
    "Audiobook"
  ],
  "author": "James Fearnley",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/13630716-here-comes-everybody"
}