{
  "title": "Golden Apples in Silver Settings",
  "description": "New Book for Christian Audiences Features Nuggets of Hope and Encouragement Overtaxed schedules, increasing responsibilities and multiple demands often result in Christians being unable to attend church or retreats, and they become concerned about what they may have missed. That concern should be dispelled by “Golden Apples in Silver Settings” which invites persons to experience God in a variety of locations without leaving the comfort of their favourite chair. One can attend a conference without taking time off work or paying registration fees. Susan Harris, the author, is a speaker, teacher and writer whose spiritual and educational background in Theology, Management, Education, Human Resources and Sales, enables her to inspire and encourage thousands through the messages she shares. While some of them aren’t thought of as new topics, the practical empowerment and Biblical insights are key factors for success in encouraging the reader. For •The person who fears the night can take comfort from the knowledge that God keeps the night watch. •The woman who needs to be restored can model on Rahab, who in spite of her past, occupied a place of prominence, and her name is written in the Hall of Fame in a place called Eternity. •The man who desires the peace of his Christian neighbour can know the gospel of Jesus. Many of the messages can be understood by persons with or without a biblical background or church affiliation. Some – for example, Dream Big, or Turning Dreams Into Reality – is relevant to anyone. Some readers may be motivated to forgive, pray or increase faith. Others may experience healing. Most of the principles can be springboards for discussions and study, or transferable concepts to encourage others. As Harris unfolds each message, readers •Learn strategies for restoration and hope •Be empowered to dream and live those dreams •Engage through the object lessons conversational style of \"Dear Friend” •Understand the Christian faith in a clear and simple manner •Be able to imagine themselves in the audience or location where the message was given. In the pages, readers will be transported to silver settings in the Caribbean and Canada, and be energized with truth as timeless as golden apples. Themes tailored to specific areas including passion, favour, breakthrough, freedom, victory, prayer, thanksgiving, healing, seasons, restoration, love, salvation and joy, enable readers in identifying the most relevant ones that would have would have greatest impact on their immediate need. The title was inspired from Proverbs 25:11. While there are many books providing faith and encouragement, Harris gives fresh meaning to the term “Christian Author and Speaker,” demonstrating that a trained professional’s knowledge, experience and dependence on God offers valued treasure to those who are also dependent on God.",
  "genres": [],
  "author": "Susan   Harris",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/13631424-golden-apples-in-silver-settings"
}