{
  "title": "Last Man Standing",
  "description": "Please note: This book was written way back in 2012 as a prologue - a proof of concept, if you will - to a full length zombie novel. It took a long time to come to fruition but I eventually found the time to write, and you can now find the Last Man Standing series on sale at Amazon, beginning with Hunger. I guess what I'm saying it that if you find this book on sale anywhere there's no need to buy it. Just grab Hunger and Cordyceps instead :)---------------------------Paul McQueen is a global celebrity. The only man to survive the zombie outbreak of Bangkok, he's been making the rounds of the morning talk shows and newscasts. Three months later he's a depressed, suicidal alcoholic. His wife and friends are dead, and it's time to tell the real story about what happened in the city. Why has he been lying all these months? What does the military junta have to hide? What could possibly be worse than the terror of the undead?Excerpt:“You want to know why people took a few seconds to get the picture? There was no biting, not for a while. We've seen too many zombie movies. We think these things are just teeth on legs, groaning and biting strips of flesh out of anything with a heartbeat. Zombies – yeah, I know I shouldn't be calling them that – they only bite when they're hungry. That's why most of Bangkok ended up dead rather than turned. Zombies will sooner beat you to death than eat you for lunch. \"I tell you, George Romero should be shot. People got taken by surprise, acting like they were up against movie monsters. I saw a lot of people try to stand their ground with improvised weapons, expecting to give these fuckers a crack to the head when they lumbered in. They must have had the fright of their lives when the undead came sprinting, throwing their fists just as hard as they had when they were alive.”“So how did they attack at first?” I knew the answer already. I'd seen the snatches of video a few people around the city had managed to upload before it got out of hand. “The truth is, they're not so different from us. Hell, these first ones were probably still alive, for all I know. They didn't have any visible injuries, and there's no reason their hearts weren't still beating in their chests. You know they're still catching a few with heartbeats, right? “These fuckers attacked like they were on PCP. Fucking vicious, like a beaten wife who's had enough after years of taking the belt. They used everything they had. Fists. Feet. Fingernails. By the time they were finished with the cop there wasn't much left. Even his eyes were gouged out. Nobody was eating him, though. I guess they weren't hungry.”",
  "genres": [],
  "author": "Keith Taylor",
  "average_rating": "3.31",
  "url": "https://www.goodreads.com/book/show/13632486-last-man-standing"
}