{
  "title": "Shepherd's Fall",
  "description": "Will Shepherd had it all -- beautiful wife, a loving young daughter, and now the job of his dreams that promises to fulfill his every professional and financial ambition. This prize includes relocating his family to a stately old Victorian mansion set on the scenic, remote banks of the Susquehanna River in Pennsylvania. But his dream is about to become a nightmare.What Will doesn’t know is that the home’s shadowy inhabitants have ambitions of their own, plans that have been brewing in the bowels of acres poisoned by a history of violence and bloodshed. Will finds himself the focus of otherworldly forces bent on making the Shepherd family into another chapter in the home’s dark tale of misery and pain. Drawing power from land infused with centuries of evil, the apparitions plunge Will into a living nightmare, where he experiences what he prays are hallucinations. But the horror becomes all too real when he witnesses a ghastly death on moving day. He never saw anyone die before, now as the eerie episodes increase, can Will keep his tenuous grip on reality and solve the ancient mystery to save his family, his sanity, his life and his very soul? Or will the denizens of the shadows succeed in bringing about Shepherd’s Fall?Praise for Shepherd's Fall“Shepherd’s Fall is a clever, creepy and inventive tale that puts a disturbing new spin on the classic haunted house story. This one will catch you totally off guard.” — Jonathan Maberry, New York Times bestselling author of Assassin’s Code and Dust & Decay “Fans of The Amityville Horror will devour this debut novel by George Appelt. If you dream of owning a big, old country house, Shepherd’s Fall may change your mind. The nonstop action and chilling scenes will keep you reading into the dark of night and frighten you into wishing for the light of day.” — Dennis Royer, author of Earthburst “Appelt’s fast-paced, debut novel grabs your spine in a death grip from the first chapter, and doesn’t let loose. I simply couldn’t stop reading!”— Ralph W. Bieber II, Bram Stoker Award nominated bestselling author of Ashes and The Epicure",
  "genres": [],
  "author": "George R. Appelt Jr.",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/13633567-shepherd-s-fall"
}