{
  "title": "Timbuctoo",
  "description": "For centuries, the greatest explorers of their age were dispatched from the power-houses of Europe London, Paris and Berlin on a quest unlike any To be the first white Christian to visit, and then to sack, the fabled metropolis of Timbuctoo. Most of them never returned alive. At the height of the Timbuctoo mania, two hundred years ago, it was widely believed that the elusive Saharan city was fashioned in entirety from the purest gold everything from the buildings to the cobble-stones, from the buckets to the bedsteads was said to be made from it. One winter night in 1815, a young illiterate American seaman named Robert Adams was discovered half-naked and starving on the snow-bound streets of London. His skin seared from years in the African desert, he claimed to have been a guest of the King of Timbuctoo. Thought of an American claiming anything let alone the greatest prize in exploration was abhorrent in the extreme. Closing ranks against their unwelcome American guest, the British Establishment lampooned his tale, and began a campaign of discrediting him, one that continues even today. An astonishing tale based on true-life endurance, Tahir Shah s epic novel Timbuctoo brilliantly recreates the obsessions of the time, as a backdrop for one of the greatest love stories ever told. Timbuctoo will be released on June 28, 2012. This is a limited edition hardback, very very high spec, and designed along the lines of the travel books of two centuries ago. It weighs 2 kilos (almost 4.5 lbs), has fabulous marbled endpapers, a silk bookmark, a pouch at the rear with inserts, and six huge fold-out maps. The paper is wood-free, and the cover embossed with raised gold type. In addition, each copy contains the clues needed to begin a treasure hunt that could result in locating one of four golden treasures of Timbuctoo. The book is a thing of extraordinary beauty, and the kind of book that will last two hundred years or more.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Africa",
    "Travel",
    "Mystery Thriller",
    "Literature"
  ],
  "author": "Tahir Shah",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/13633596-timbuctoo"
}