{
  "title": "Action: Pulse Pounding Tales Volume 1",
  "description": "\"This book should not be purchased by asthmatics or heavy smokers as it leaves a fit person breathless with excitement.\" ***** Crimesquad.com37 Action-packed Pulse Pounding Tales!That's exactly what you get in this collection of action stories from top thriller authors Stephen Leather, Matt Hilton, Zoë Sharp, Adrian Magson, Steven Savile and many more, including stories from exciting up-and-comers.Think back to the days when heroes were heroes and the action was furious and full-blooded. When often as not, the hero was quite the opposite: an anti-hero - but he needed to be, to bring the kind of violent justice to villains worse than him. When political correctness took a back seat, even as the bullets and karate chops were flying. Basically it was good old harmless fun. It was a case of disengaging your moral compass and getting down with the hero as they took on all comers, and they did it with balletic grace and uncompromising violence. Gratuitous? Mostly. Realistic? Not always. Great fun? You betcha!!!Then fast forward to the here and now: What if the current action and thriller authors set their minds to bringing back the action genres of old?Well, that question is answered here.Within these pages you will find secret agents, vigilantes (both just and insane), cops, villains, soldiers, veterans, gangsters, swordsmen, privateers, Ninja and even a crypto-zoological beast you might recognise. Some of the tales are delivered with shocking realism, some as lighter entertainment, some on the grittier side, but each and every tale included in Action: Pulse Pounding Tales Volume 1 is sure to get your heart racing.Kick back and enjoy the ride!Contents:Introduction by Matt HiltonStrangers on a Train by Stephen LeatherSatisfaction Guaranteed by Matt HiltonValley of Death by I S PatonThe Real Deal by James Oliver HiltonJingle Bells by Adrian MagsonDeath By Licence by Joe McCoubreyThe Night Butterflies by Zoë SharpGallance by Col BuryBattle For Baghlan by Matt HaydenThe Stranger by David BarberExpiry Date by Gavin BellA Most Honorable Death by Jochem VandersteenJack Be Nimble by Steven Savile & Steve LockleyAt Close Range by Ian GrahamCutter's Law by James HopwoodAngel Tough by Absolutely KateOn Her Majesty's Bloody Service by Iain PurdieThe Legend of Jimmy-The-Gimp by Keith GingellBlood Moon of 1931 by Terrence P. McCauleySkinner Alive by Daniel Moses LuftJobs Taken by Asher WismerThe Handler by Gavin HuntBlood on Their Hands by Les MorrisIssa's Island Prison by Graham SmithEastern Fury by Andrew ScorahThe Liberator by Paul D. BrazillThe Tower of Marnir by Paul GrzegorzekBit Part Player by Theresa DerwinThe Judgment of Jean Lafitte by Evan LewisAvenged: Sixfold by Natasha Marie ThomasMan or Mouse by Mark Dark",
  "genres": [],
  "author": "Matt Hilton",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/13634296-action"
}