{
  "title": "Few Are Angels",
  "description": "After a fatal hit and run accident, Ella Monroe fears that she’s lost more than her beloved parents. Horrifying visions of a past life and a disturbing voice in her head have psychiatric professionals convinced that she’s lost her sanity as well. But when Kale—a dark and handsome stranger with a mysterious pastreveals the true meaning of her visions and the tremendous power she wields through them, Ella must come to terms with the devastating truths of her own past, while eluding an ancient Dark Prince who seeks to control not only her future, but all of mankind’s, by means of abilities that Ella is only beginning to understand.Enter the shrouded world of an age old battle between an ancient race known as the Immortals and their bitter enemy Laurent, the so-called Dark Prince, who commands an army of half-breed vampires known as Chorý. Both sides have been desperately searching for the prophesied emergence of the Arc, a clairvoyant with unparalleled power to recall the past and a soothsayer with clear vision into the future. The Council of Immortals has sworn to protect the Arc, whom they have identified as young Ella Monroe, a college freshman from Virginia living quietly and unaware of her powers or her past. But a renegade Chorý has other plans for the protection of a girl he has loved through the ages. Can Kale convince Ella of who she is, what she is destined to become, and what he once meant to her? Is he truly the best protector to shield the world from the devastating misuse of her powers that Laurent is bent on controlling? Or will the forbidden love they share and Kale’s cursed condition as a retched and hated Chorý be used against them both?This paranormal romance told from the heroine’s perspective builds in intensity and intrigue to a finale you won’t see coming. Heart pounding action mixed with heartwarming friendships and heartbreaking romance will leave you breathless and begging for more.This is an alternate-cover edition for ASIN B0086Z2KT0.",
  "genres": [
    "Paranormal",
    "Young Adult",
    "Vampires",
    "Angels",
    "Romance",
    "Paranormal Romance",
    "Fantasy"
  ],
  "author": "Inger Iversen",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/13634791-few-are-angels"
}