{
  "title": "Sins of the Father",
  "description": "Bowen is an orphaned child in feudal England whose first appearance in this novel is having been bound hands and feet and whipped mercilessly by the monks in a monastery in an excess of bloodlust. He’s realistically of an indeterminate age but no more than about seven years old and the monks are very sadistic. He’s punished repeatedly for any number of minor and inconsequential infractions.Bowen’s father and mother and sister are dead. His sister was the victim of a brutal rape in which she became pregnant and died shortly after giving birth though she had been returned to her parents’ home in a beaten and catatonic state. His father drowned and his mother burned to death in the family home.Aaron is a minister in present day Midwest America who takes a short sabbatical after he has a fainting episode while experiencing the marks of the stigmata immediately preceding a sermon that he’s supposed to deliver about Faith Unending, a concept with which he’s struggling himself.Lucian is a severely autistic child in the present day who’s found homeless and taken to a mental health center after a fire in an abandoned building in which he’s sleeping. He’s horribly scarred and disfigured and bears a striking resemblance to Bowen and Aaron. He takes a liking of a sort to Aaron, who has eyes of the same amethyst color as his. He also bears a mark on his chest which looks like a brand and is the mark of the Celtic war god Rudianos.A minister losing touch with his faith…A severely autistic child with no past, no present and no real future…An evil older than time itself…When the boy Lucian is thrown into Aaron’s life with nowhere else to go all hell breaks loose and Aaron confronts things he never actually imagined could really exist in an effort to save one small, tortured child.",
  "genres": [
    "Paranormal",
    "Mystery",
    "Fantasy"
  ],
  "author": "R.J.  Palmer",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/13635238-sins-of-the-father"
}