{
  "title": "Killer Kisses",
  "description": "This professionally edited, full novel sized collection of short stories and novellas contains *kisses* that range from contemporary, short and chaste to long, paranormal and spicy.In A Peck on the Cheek: Hurricane Jason, a female private investigator searches for a two-timing husband, but lands in an hurricane shelter. Does she get her man? In Cat Nips: Catastrophe, a crazy cat lady is evicted by her drunken landlord and the lives of her cats are at stake. Will she and her rescues wind up on the street? Or will a secret admirer find a better home for everyone?In Hot Lips: Lake Placid Cure, a woman finds her husband in a compromising position--again. Looking to recover her dignity, she sets out for a medi-spa, encounters a murder mystery and discovers that miracles still happen in Lake Placid.In French Kiss: Pigmalion, a speech pathology graduate student needs one more subject for her research project to graduate. She runs into a hot guy with a heavy accent and tries to recruit him into her study. Will she teach him the language of love?In Sizzling Smooch: Bonded for Life, a Mexican artist runs for her life to hide in the little town where she graduated from high school. She's convinced no one will find her there. But a boy with a high school crush on her grew up to be a hunky cop--and he has her in his cross hairs.In Delectable and Delicious: An Inn Decent Proposal, a chef and a hotelier join forces at a foreclosure auction on an old inn and outbid a small time hood. The thug doesn't like being on the losing end of the deal. Things heat up outside and in the bedroom. Can the couple make a go of it? Or will the hood destroy their dream?In Release Your Inner Wild Women: Kiss of the Silver Wolf, a young woman searches for the truth about her brother's debilitating disease. An intriguing man with silver hair and a penchant for long night runs insists she's his life mate. How does this sexy man figure into her family secrets?",
  "genres": [],
  "author": "Sharon Buchbinder",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/13635415-killer-kisses"
}