{
  "title": "Travel To the G-Spot -- The Guide Book",
  "description": "Danny Gladstone is a travel writer with a problem; he’s dying. Determined to make sense out of what just happened to his life, he looks back through some of his stories from around the world to figure out how he reached this disturbing closing chapter. Along the way, he recounts a childhood of coddled captivity in the suburbs and not being allowed to cross the big streets alone, to exotic tales of intrigue, indulgence and debauchery in places from Thailand to Tonga to Times Square. He confesses that he considers travel writing an addiction that he must overcome, and admits that he’s only done it to confront his self-loathing and fear of everything. He also manages to blow the lid off a secretive world of free trips and professional perks that exposes the dirty underbelly of a filthy business that is obviously not a problem to anyone but himself.It’s the humorous, dark and oddly hopeful story of a character who was raised to always do his best, learns that’s often not required, and, instead of just getting on with his life like everyone else, continually sabotages his own best efforts by actually questioning why that's okay? It's a line of inquiry he deeply believes more people should be exploring, and though time’s running out for Danny, he can still remember Nana Belle, his grandmother, who made his childhood bed and cooked his soft-boiled eggs, saying, \"It's never too late.\"How much of the book is realistic? According to the author, \"All of it, I hope. It's a fictional memoir of a guy in our world. He's a writer. He has a family and friends. He travels to some pretty exotic places and writes about it, but he's not a werewolf or a hobbit. It has to seem real, I think. The thing is, I've been a travel writer for a long time. It's a great life, and worth sharing. Although I always strive for the truth, there's a deeper level of truth that isn't wanted in stories that are published. This book is an effort to get closer to those deeper truths by telling a story about what really happens to a writer on one fantastic trip after another that most people can only dream about. There's a dark side to it, sure, but overall it's just supposed to be funny. I hope it resonates for readers who grew up in the 50s, 60s and 70s, and for those who wonder why all those folks are the way they are.\"  “...combines gritty realism, sharp social satire, hilarious comedy and a smooth, confident writing style.” -Goodreads\" …kinda like a little Paul Theroux, mixed with some Hunter S. Thompson. Stir in a tad of Philip Roth and shake vigorously.” -Taos Cowboy “…a very, very funny book.”-The OklahomanIt’s a must read for anyone who travels, wants to, or ever dreamed of being a travel writer.",
  "genres": [
    "Travel",
    "Humor"
  ],
  "author": "Steve  Cohen",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/13635466-travel-to-the-g-spot----the-guide-book"
}