{
  "title": "White Walls",
  "description": "Adelaide Carmichael knows that she's lost her mind.She's aware that she's being sent to The Oakhill Institution, but she's been told that she's being sent there to get better. She's been told that the staff is there to help.And it doesn't take Adelaide long to discover that she was very, very wrong about The Oakhill Institution. Patients roam the halls like zombies. Electric currents vibrate through the plaster walls. Patients are fed sedatives like mashed potatoes and now Adelaide knows one thing for sure, she wants out.And she'll do whatever she can to escape.Excerpt~I used to climb the giant willow tree in my back yard. It was like a game for me and mommy because she'd always come looking for me. The funny thing is that she always knew where I was but she played along anyway. I was perched above her head in the tree, trying to contain my laughter and she was below, her forearm positioned against her forehead. She squinted out into the field full of yellowed, dead grass. Then she said, “Little bird! Where did you fly to?”The orderlies’ footsteps thunder in my ears and sound off in sync with my hammering heartbeat.I've never pushed myself so hard in my entire life. I'm winded. Starting to feel exhausted. Don't stop now.Don't stop now. It's just a few more feet.I am almost there.I feel the orderlies’ breath down the back of my neck and feel the tug as his fingertips grasp the edge of my hospital gown. I wrench away though, finding a second wind when I'm at the edge of the forest. Busting through the thicket at the entrance to the forest, I hear Aurora's frantic shouts in my head.Run, Adelaide! Run!The sound of her voice is the only thing that keeps me going. Knowing that she wanted me to escape, and get out even if she couldn't is the only thing keeping the burning sensation inside of my lungs from spreading and dousing the rest of my body in flames.Run, Adelaide! Run!I will run, Aurora, I will.I will run for you.And me. I won't stop.I promise.I'll keep going just like you wanted me to.I'll keep running until I can't anymore.",
  "genres": [
    "New Adult",
    "Romance",
    "Young Adult",
    "Abuse",
    "Dark",
    "Mental Illness",
    "Contemporary"
  ],
  "author": "Lauren Hammond",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/13636313-white-walls"
}