{
  "title": "The Wager",
  "description": "When love and war make a little wager, what could possibly go wrong?I am Hephaestus. God of inventions, blacksmiths, and volcanoes. Sounds like I'm awesome right? Well, I'm not. In fact, I'm the loser of Olympus and a new bachelor to boot. Living the single life had been great until a decade past and if my divorce from the Goddess of Love wasn't bad enough, I was still being rejected by the other women of my home.Because of an incessant need to make me a pawn in his game, my brother, Ares convinces Eros to make a little bet. A wager that puts my lack of love life to the test. Sent to Earth, I'm skeptical, when suddenly I lose myself in the sensual scent and beauty of the full bodied Vanessa. She is my everything, my perfection.Sadly, from a single caress upon her silky flesh, I send our lives into a downward spiral of hell. The Touch of the Gods curse. To save her, I must believe that I am not the nobody I was raised to think. And to save me, she will have to decide if I'm worth giving up everything for.HOT EROTIC EXCERPT:Without a word, she took her hands, her delicate fingers opening her folds, displaying the one place I was truly welcomed and digging my fingertips into her fleshy pelvis, I plunged back into her heat. No longer gentle, my hips swiveled, my other hand taking hold of her, stopping her own hips from arching up. I wanted to control how deep, how fast, and how much she would get. Despite not being able to fit all of my length inside her, I became familiar to how much she could take and pushed past that limit, until only half an inch of my skin was left without the cocoon of her sweet tender flesh. It was a small sacrifice, one that was lost as my power pulsed through my veins, the climax I’d held back, roaring to life, as the magma of a volcano before eruption.Both our bodies were coated from our exertions and stretching my abilities, I pushed into every exposed orifice she had, metaphysical fingers, probing and teasing. I heard her deep gasp, seconds before she shrieked out expletives with a “sweet Jesus and Mary”, as her body convulsed, and her head thrashed from side to side on her pillow. A desperate delight filled Vanessa’s pleading screams and helpless moans with an ecstasy that she may have believed brought her to a little bit of erotic orientated death.*Full Novel/ Professionally Edited",
  "genres": [
    "Fantasy",
    "Mythology",
    "Gods",
    "Romance",
    "Erotica"
  ],
  "author": "D.X. Luc",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/13636743-the-wager"
}