{
  "title": "The 2012 Book Blogger's Cookbook (The Book Blogger's Cookbook)",
  "description": "\"This genuinely unique and creative cookbook delivers delicious recipe ideas inspired by some of the hottest novels released in recent years to create a mouthwatering feast for the eyes and the mouth\"~BookBub.comGreat books, bloggers, and recipes meet in this second volume of a fresh and unique cookbook that helps you experience books, not just read them.Books were selected from the author’s book review blog and paired with delectable recipes like “Caramel Crack” from Shatter Me, by Tahereh Mafi, \"Everliving Soup\" from Brodi Ashton's Everneath, and \"Jagged Ham\" from Elana Johnson's Possession. ***Mouthwatering photos complement every recipe*** The 2012 Book Blogger’s Cookbook includes a foreword by David Farland, award winning, New York Times Bestselling author, and showcases more than one hundred reviews with links to book review blogs and author websites. The 2011 Book Blogger’s Cookbook includes a foreword by Amanda Hocking, author of the USA Today Bestselling Trylle Trilogy.\"A surprisingly large number of recipes from this collection caught my attention. Even better each one I tried out turned out great. I definitely recommend downloading this unusual collection. You'll get access to recipes worthy of repeat usage and might even find some interesting new reads if you're lucky.\" ~Heidi Sue Roth, Midwest Book Review\"The Book Blogger's Cookbook is a beautiful blend of a cookbook about books. It's worth reading straight through if only to find new books to add to your \"to-read\" shelf.\" ~Lisa Mangum, author of award winning The Hourglass Door series.\"The Book Blogger's Cookbook is more than a mere cookbook. It contains review bits of bloggers stating what they loved about the featured books. The blogger testaments make you want to read the novels and the photos make your mouth water. Perfect combination!\" ~Stella from Ex Libris book reviews \"The Book Blogger's Cookbook has the best combination of two of my favorite food and books. Overall, it's sort of a dream book for readers who love cooking.\" ~Elani at La Femme Readers book reviews***If you love young adult books, you'll love the cookbook***Whether you're a food lover, an avid reader or a book blogger, there’s something for you in The 2011 Book Blogger’s Cookbook.",
  "genres": [
    "Cookbooks",
    "Nonfiction",
    "Cooking"
  ],
  "author": "Christy Dorrity",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/13637096-the-2012-book-blogger-s-cookbook-the-book-blogger-s-cookbook"
}