{
  "title": "Legacy",
  "description": "In McElhaney’s first book of the groundbreaking Mystic Saga “Indentured”, the Colonial Establishment Cruiser “Pioneer” discovered a major fault in their experimental Jump Drive. Though it served its purpose by sending the ship across 24 light years in what felt like a mere instant, its failures were a little less noticeable.Indentured was the prequel, and now, in his second book of bestselling serial, the USSC sends a follow-up ship to the Beta-Hydri system in order to investigate what happened to their missing cruiser, the USSC Pioneer. The investigation brings them to a planet named Legacy where an Earth colony appears to have been thriving for hundreds of years – much longer than the few decades they expected if it indeed was the Pioneer Colony. To add to the confusion, the colony appears to have forgotten their roots over the centuries, so the shuttles of the USSC Foothold aren’t welcomed in the way they’d expect.The crew of the Foothold is about to learn that a lot can change when you’re forced to adapt to a different environment. But could the changes involve the development of the unusual electrical defense mechanism of the Mystics? Why are there two human civilizations on Legacy and why does one group of people have the ability to throw lightning?A serial novel published in the tradition of 50's sci-fi pulp brought to you by the Xulon Award winning author of Mommy's Choice, One Crazy Summer, Indentured, and Dominion. Now Scott McElhaney is making most of his novels available to Kindle readers at the very accessible price of only 99 cents. Book three of the Mystic Saga \"Violation\" is now available at the same low price as all the rest!Editorial Reviews\"McElhaney's story telling is deft, well-paced, and with an ear for conversation\" ~ Beacon Journal Book Review\"The author does a good job of sucking you into the moment and feeling as if you are the main character. The technology and scenarios are realistic enough for this sci fi fan and if you like a good storyteller Mr. McElhaney knows how to do it.\" ~Top 50 Amazon Reviewer and Vine Voice Michael Gallagher",
  "genres": [
    "Science Fiction"
  ],
  "author": "Scott McElhaney",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/13637207-legacy"
}