{
  "title": "Accidentally Married to... a Vampire?",
  "description": "“If you love her, set her free. If she comes back, she’s yours. If she doesn’t…Christ! Stubborn woman! Hunt her down, and bring her the hell back; she’s still yours according to vampire law.”- Niccolo DiConti, General of the Vampire Queen’s Army.THE DETERMINED VAMPIRE: Niccolo DiConti has faithfully served as leader of Her Majesty’s army for over a millennium, but he’d rather sunbathe in the Sahara than spend another grueling day under his demented queen’s command. However, no one has ever left her side and lived to tell. So when a powerful goddess prophesies he will meet his salvation—a human woman he must turn into a vampire with her consent—he eagerly rises to the challenge. After all, how hard could it be to seduce a human female into taking the immortal plunge? Harder than he thinks. Because his mate won’t be born for another three centuries, and when he wakes up in the goddess’ tomb, not only is his life a mess, but his destined female isn’t about to settle for a coldhearted vampire. Can he win her over before it’s too late? Not if his enemies have anything to do with it. AN UNWILLING BRIDE: On the night Helena Strauss meets the fierce, devastatingly handsome vampire who saves her life in the jungles of Mexico, she knows her world will be forever changed. Because an attraction this mind blowing only comes along once in a lifetime—or existence. And when he claims she is his one true mate, destined to be his for all eternity, it’s a fairytale come true. So what if her knight in shining armor is a vampire? Nobody’s perfect. But discovering the powerful, overbearing immortal doesn’t “do love”? Deal breaker. Helena will flee and set out to accomplish the impossible…sever the otherworldly bond between them. And it turns out, Helena is just the leverage Niccolo’s enemies need to break the mighty warrior and wipe out his people.",
  "genres": [
    "Paranormal",
    "Vampires",
    "Romance",
    "Paranormal Romance",
    "Fantasy",
    "Gods",
    "Mythology"
  ],
  "author": "Mimi Jean Pamfiloff",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/13637312-accidentally-married-to-a-vampire"
}