{
  "title": "Sand Dollar: A Story of Undying Love",
  "description": "DESCRIPTIONNoah Hartman has it all, or so it seems. Groomed since childhood to inherit the family fortune and business empire, the effect of living the life set down for him by controlling parents has left Noah out of touch with his inner self. Enter Robin, who -- in direct contrast to Noah -- is a vivacious, free spirit with no material possessions to speak of. Robin's love saves Noah by inspiring him to stand up to his parents and reclaim his true identity at all costs. But Robin harbors a secret that could devastate their lives forever. Is it enough for two soul mates to find each other, or are the forces that would tear them apart too great to overcome?Many years later, Noah lies in a hospital bed recounting his life of love and loss, only to discover a far greater truth about the past, present, and future. And the one certainty that remains unchanged in Noah's heart -- true love never dies.Looking for the next great love story? Look no further: read Sand Dollar: A Story of Undying Love!From the AuthorSand Dollar is a story about a love gained, a love lost, and through it all, a love that just won’t die. Although it’s considered to be a romantic fantasy — a kind of cross between The Notebook and The Sixth Sense – the book distinguishes itself from other romance novels in its genre by its honest portrayal of life as a recurring tragedy, a roller coaster ride of sorts between joy and heartache, and the faith needed to overcome it. Sand Dollar is a thought-provoking, emotional read that, among other things, might even have you yelling at the main characters at times. And not only is it filled with plenty of twists and turns, but the surprise ending will knock your socks off!BACK COVERWhat if you lost your true soul mate, the one person in life you were meant to be with? Would your love ever truly die? Not if you’re Noah Hartman, who refuses to let go of Robin after she inexplicably abandons their love and disappears from his life seemingly forever, her hidden secret yet to be discovered.And when you finally accept your fate and do your best to move on with your life, what do you say when the unthinkable happens: your true love Robin reappears as your wedding ceremony to another woman is about to commence, looks deep into your soul with her loving, tear-filled eyes, and tells you the one thing you’ve desperately longed to hear for all of these years?But the ending to this heart-wrenching love story has yet to be written, as Noah, old and sick in a hospital bed, tells his story of love and loss to Josh, a wise orderly at Mount Sinai Hospital. As his family members arrive to bid him goodbye, Noah discovers a far greater truth about the past, present, and future. Things are definitely not as they appear as the pieces of a shattered love are put back together in the remarkable final chapter of Noah’s life.PLOTThe story opens with Noah Hartman, eighty years old, lying on his deathbed recounting his life of love and loss to Josh, a compassionate orderly at the hospital. As Noah’s loved ones arrive one by one, they listen in on his story, and we’re transported back in time to Noah’s younger years.Though outwardly seeming to have it all, Noah, now thirty-five, is actually an empty, lost, and broken man running on automatic pilot. He has no true identity due to having allowed his powerful, wealthy parents to manipulate, control, and brainwash him from a young age. With the threat of disinheritance and withholding love and approval if he doesn’t comply with the plan they have for his life, Noah is lured in by the reward of great wealth and the illusion of running the family business empire some day.Enter Robin, twenty-five years old, who — in direct contrast to Noah — is a vivacious, free spirit. Full of life and always living in the moment, Robin’s love saves Noah by inspiring him to stand up to his parents and live his own life at all costs, reclaiming his true self.They get married, and while snorkeling in the Caribbean, the captain of the boat warns them not to disturb anything in the sea. Ignoring the exhortation, Noah dives down and snags a sand dollar from the ocean floor, whereupon it explodes in his hand. With the fragile sand dollar taking on new significance, Robin inexplicably leaves Noah shortly after returning from their honeymoon. Like a passing breeze, she disappears out of his life without a trace, seemingly forever.Years pass, and Noah still can’t get Robin out of his mind and out of his heart. After all, the one he loved the most would forever be the one who got away. That’s when he finds out about her hidden secret, the underlying condition responsible for her leaving. Noah has no choice but to move on with his life without her, meeting Sarah at the premiere of SAND DOLLAR, the movie he wrote about his time with Robin.Years later, it’s Noah and Sarah’s wedding day, and Robin discovers a clue that Noah had surreptitiously inserted into the movie, inspiring her to race to the wedding to try to stop it. With the wedding in shambles, the scene jumps back to present day, with both Robin and Sarah placed in Noah’s hospital room. But which one did he choose?As Noah wraps up his story, he discovers a far greater truth about the past, present, and future. Things are definitely not as they appear as the pieces of a shattered love are put back together in the remarkable final chapter of Noah’s life.LOGLINEA man on his deathbed describes his life of love and loss to a compassionate orderly, only to discover a far greater truth about the past, present, and future.For more information, please visit http://sebastiancoleauthor.com",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Chick Lit",
    "Adult",
    "Fiction",
    "Love"
  ],
  "author": "Sebastian Cole",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/13638204-sand-dollar"
}