{
  "title": "mBraining: Using your multiple brains to do cool stuff",
  "description": "The latest scientific research shows you have three brains - three complex and fully functional brains in your heart, your gut and your head! In this groundbreaking book, you’ll discover the latest neuroscience findings about your multiple brains (head, heart and gut brains) and what they have to offer for increasing intuitive abilities and for immediately generating wiser decision-making in your daily life. Providing you with numerous practical and easy to learn methods, this book shows how to communicate with and tap into the innate intelligence of your multiple brains. mBraining coaches you in aligning your three brains to achieve greater wisdom, success and happiness in a world of massive change. Utilizing the powerful and practical methodologies of NLP, Cognitive Linguistics and Behavioral Modeling, the authors have synthesized a remarkably wide range of research findings into an integrated approach that is practical, potent, and immediate in its results. Now scientific knowledge is finally catching up with deep insights from esoteric and spiritual traditions informing us for thousands of years about these three powerful intelligences. This is not a popular science book, nor is it a typical self-help book. This is a book that both breaks new ground as well as complementing many other spiritual and self-development practises. In this book, you’ll learn the process of ‘mBraining’ - the process of aligning and harnessing the power of your multiple brains. The suite of practical methods it provides is part of an amazing new field called ‘mBIT’ - multiple Brain Integration Techniques. This is a book that changes lives by giving you a real ‘how’. Written in an easy to read and entertaining style, this is a highly accessible guide to understanding the scientific basis behind your gut intuitions, your heart-felt emotions, and your head-based creative powers. The lessons in this book can transform your relationship to yourself, to others, and to the world in which you live. If you are serious about your self-evolution, this book is a must read! Learn to use your multiple brains to do cool and amazing things in your life!",
  "genres": [
    "Nonfiction",
    "Science",
    "Health",
    "Personal Development",
    "Business",
    "Self Help"
  ],
  "author": "Grant soosalu",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/13638475-mbraining"
}