{
  "title": "Dirty Words on Clean Skin",
  "description": "Why do so few women occupy seats of power? This shocking exposé travels beyond Hillary Clinton's historic 2008 presidential run to reveal a biased media's troubling influence over our electoral process and the sexist brainwashing that does damage to us all. Dirty Words on Clean Skin is the book big media does not want you to see -- an eye-opening journey that chronicles both Hillary Clinton's sexism-plagued historic run and the rampant denigration of women that rages on today with impunity. Dirty Words on Clean Skin transcends party politics. It is less about the treatment of one woman than the ramifications of denying equal respect to all women. This first person narrative will resonate with many who feel a burning frustration with the state of our political dialogue today. In 2008, Hillary Clinton and Barack Obama waged an epic battle for the presidential nomination that captured the imagination and hopes of millions, but the joy of watching a qualified woman vie for the presidency was marred by newsmen and pundits calling Hillary Clinton a hellish housewife, Nurse Ratched, she-devil and bitch. DIRTY WORDS ON CLEAN SKIN examines the tactics that do damage to the credibility of powerful women and the cost to those watching from the ground. Anita Finlay’s shocking political odyssey travels beyond Hillary Clinton’s historic candidacy to investigate the media’s troubling influence over our electoral process and the behavior of a society not as evolved as advertised. Whether the subject is Michelle Obama, Sarah Palin or Sonia Sotomayor, no woman is immune. The facts speak for themselves and drive this carefully researched, explosive and conversational exposé. For sixteen years, polls have named Hillary Clinton America’s most admired woman, yet when it counted, the media depicted her as a vile harpy standing in the way of history. Today, articles from The New York Times to the Huffington Post are encouraging her to once again stand for the Presidency, yet any prescription offered to a woman attempting to break the “highest, hardest glass ceiling” will be worthless without an honest discussion of the culprits and their methods. That discussion has yet to take place.",
  "genres": [
    "Politics"
  ],
  "author": "Anita Finlay",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/13639600-dirty-words-on-clean-skin"
}