{
  "title": "Sandcastle and Other Stories: The Complete Edition",
  "description": "The Complete Edition of Justin Bog's First Collection of Dark Psychological Suspense Tales.In the old incarnation, the book was a Finalist for the 2014 Ohioana Book Award, and picked as one of Suspense Magazine's Best of 2013 Books!An award-winning collection, Sandcastle and Other Stories reveals twisted secrets that are mined like plutonium. These twelve literary tales are nothing short of an adventure through a roiling sea of emotion. With authenticity and eloquence, author Justin Bog holds a provocative and compelling mirror on the human condition. \"The stories are those of everyday people who might live next door or in the walk-up across the street . . . A man with a personal crisis takes a singles cruise –-- a woman leaves her toddler girl at the beach while having a romantic tryst –-- a B-list actor’s character is killed off –-- a girl is sucked below the sand into an underwater chamber . . . an old gardener who has dark secrets interacts with the bosses daughter in a most unforeseen way. The only commonality in these tight, little stories is they are unexpected. Having this book is like having a string of black pearls –-- each one slightly different, but each a perfect, dark, little gem . . . Bog paints pictures with words as Titian did with oil paints – startlingly detailed with deep perspective and rich complexity.\" ---Rosi Hollenbeck, San Francisco Book ReviewSandcastle and Other Stories details: These twelve literary, psychological, and suspense tales are nothing short of an adventure through a roiling sea of emotion. Meet: an old man twisted by fate and a lost love . . . a young girl playing on the ocean shore who becomes entangled in nets of a mercurial god . . . a divorced man mired in troubles who's coerced into taking a singles cruise . . . a Hollywood actor in a television drama who's always typecast as the bad boy . . . a child kept awake by night terrors, and a woman who hides her secretive personality from everyone on the beach one sunny day. Genuine voices of the characters, mixed with a clear-eyed tonal directness, make this a series with mesmerizing psychological interaction. Stories span a broad depth of human understanding and build a bridge between deepest chasms of pain and high portals of joy. Read these dark tales and stand witness to unspeakable hate sitting with cozy wile, right beside unconditional love --- a provocative and compelling mirror on the human condition.",
  "genres": [
    "Short Stories",
    "Fiction",
    "Anthologies"
  ],
  "author": "Justin Bog",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/13640184-sandcastle-and-other-stories"
}