{
  "title": "Rise of the Black Serial Killer: Documenting a Startling Trend",
  "description": "In Rise of the Black Serial Killers: Documenting a Startling Trend, Justin Cottrell expels the myth that serial killers in America are predominantly white. On the contrary, after sifting through a myriad of newspaper records and books, he's compiled a list of murderers that is equal to or greater than the number of white serial killers from 1860 to present. Few if any have ever heard any of their names or stories, until now. Based on his findings, white serial killers have been underrepresented throughout American history when compared to the percentage of the population they represent by a factor of 1.79 on average. On the other hand, black serial killers have been overrepresented 2.68 to 7 times their portion of the population, with a 150-year average of 4.18. Another startling trend he uncovered is that black serial killers have never represented less than 26.83% of the number of serial killers in a given decade, despite their overall percentage of the population never exceeding 13.1%. This trend has steadily increased to the point that in our current decade that they represent 88.24% of the number of serial killers apprehended since 2010, yet only account for 12.6% of the populace. Aside from trends, this book offers reasons most people assume black serial killers don't exist--from the media prohibition on the subject, to general misunderstandings. Coupled with this is a look into the various factors that breed serial killers, with a look into why black serial killers are on the rise, while white serial killers are on the decline. To prove his research is valid, a full list of every black serial killer is provided, along with a brief description of their crimes. In addition to this, the biographies of 35 of these killers are given, with detailed information about their crimes.",
  "genres": [],
  "author": "Justin Cottrell",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/13640985-rise-of-the-black-serial-killer"
}