{
  "title": "Parlor Games",
  "description": "A sweeping historical novel based on the true story of a beautiful con artist whose turn-of-the-century escapades take her—and her Pinkerton detective pursuer—around the world. The novel opens in 1917 with our cunning protagonist, May Dugas, standing trial for extortion. As the trial unfolds, May tells her version of events. In 1887, at the tender age of eighteen, May ventures to Chicago in hopes of earning enough money to support her family. Circumstances force her to take up residence at the city’s most infamous bordello, but May soon learns to employ her considerable feminine wiles to extract not only sidelong glances but also large sums of money from the men she encounters.  Insinuating herself into Chicago’s high society, May lands a well-to-do fiancé—until Pinkerton Agency detective Reed Doherty intervenes and summarily foils the engagement.  Unflappable, May quickly rebounds, elevating seduction and social climbing to an art form as she travels the world, eventually marrying a wealthy Dutch Baron. Unfortunately, Reed Doherty is never far behind and continues to track May in a delicious cat-and-mouse game as the newly-minted Baroness’s misadventures take her from San Francisco to Shanghai to London and points in between. For the most part, May manages to stay one step ahead of the law, waltzing and hoodwinking her way through the Gilded Age and into the twentieth century. But now it's 1917 and she's being sued for draining a friend's sizable inheritance—a charge she adamantly denies. As the story jumps back and forth between the ongoing trial and her devious but undeniably entertaining path to the courtroom the reader is left wondering what fate ultimately has in store for May Dugas.  Based on an extraordinary true story, Parlor Games spans nearly thirty years and May's saga coincides with some of the greatest events in history. This historical romp takes us from Queen Victoria's Jubilee to McKinley's assassination, from the Gilded Age’s opulence to the rise of the automobile. May's lifestyle was considered decadent even in an age of excess. She indulged every whim—in gowns, jewels, caviar, and champagne. Even her bulldog's collar was made of platinum and lined with glistening diamonds.  The Pinkertons labeled May Dugas \"the most dangerous woman in the world” and considered her a crafty blackmailer and ruthless seductress. To many, though, she was the most glamorous woman to grace high society. Was the real May Dugas a coldhearted swindler or simply a resourceful provider for her poor family?",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Mystery",
    "Book Club",
    "Adventure",
    "Crime"
  ],
  "author": "Maryka Biaggio",
  "average_rating": "3.47",
  "url": "https://www.goodreads.com/book/show/13641352-parlor-games"
}