{
  "title": "Fringe-ology: How I Tried to Explain Away the Unexplainable-And Couldn't",
  "description": "More than seventy percent of Americans believe in paranormal activity. But even with a family-ghost story lurking in his own background, seasoned journalist Steve Volk has been like most of those millions of Americans—reticent to talk about his experience in polite company. If so many of us have similar stories to tell, why are we so reluctant to take them seriously?Paranormal claims don’t traditionally sit well with reporters, but Volk decided to focus his gimlet-eyed tenacity on a new beat: the world of psychics, UFOs, and things that go bump in the night. It’s a rollicking ride as Volk introduces us to all sorts of fringe-dwellers, many of them reluctant to admit to their paranormal experiences: a NASA astronaut-turned-mystic, a world-famous psychologist who taught us about dying and then decided death may not exist at all, and brave scientists attempting to verify what mystics have been reporting for millennia. Volk investigates what happens in the brains of people undergoing religious experiences, learns how to control his own dreams, and goes hunting for specters in his family’s old haunted house.From his journey into the bizarre, Volk returns with a compelling argument that we need to allow for a middle space, a place where paranormal phenomena can be weird and compelling; raise crucial questions; and, quite possibly, remain unexplainable. He rejects the polarized options the twenty-first century seems to offer us: to passionately embrace or hotly reject, to revere only science or only spirituality. And he underscores, again and again, that by raising our most existential questions—why are we here, are we alone in the universe, and what happens when we die?—paranormal stories are in fact a crucial point of connection. It turns out that these “fringe” experiences strike at the core of what it means to be human.",
  "genres": [
    "Nonfiction",
    "Science",
    "Paranormal",
    "Psychology",
    "Spirituality",
    "History",
    "Supernatural"
  ],
  "author": "Steve Volk",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/10437310-fringe-ology"
}