{
  "title": "Origin",
  "description": "When linguist Andrew Dennison is yanked from his bed by the Secret Service and taken to a top secret facility in the desert , he has no idea he's been brought there to translate the words of an ancient demon. He joins pretty but cold veterinarian Sun Jones, eccentric molecular biologist Dr. Frank Belgium, and a hodge-podge of religious, military, and science personnel to try and figure out if the creature is, indeed, Satan.But things quickly go bad, and very soon Andy isn't just fighting for his life, but the lives of everyone on earth... ORIGIN by J.A. KonrathAll hell is about the break loose. For real.ORIGIN is approximately 76,000 words long. This ebook also contains bonus material:An excerpt of DISTURB by J.A. Konrath, an excerpt of BENEATH by Jeremy Robinson, and an excerpt of Crack-Up by Eric Christopherson.Praise for JA Konrath's thriller FUZZY NAVEL:\"FUZZY NAVEL is Konrath at his best – a hilariously heartstopping thriller.\" — Linda Fairstein\"This gripping novel is an adrenalin rush.\" — Library Journal\"This book moves so fast it was like having the words fired into my head by a machine gun.\" — CrimespreePraise for AFRAID (JA Konrath writing as Jack Kilborn):\"AFRAID is a masterpiece of unrelenting horror. And I'm not exaggerating. Masterpiece. It's the best piece of fiction I've read in several years. It simply NEVER lets up.\" — James Rollins, author of The Judas Strain\"A bloody, terrifying, hurtling assault across a landscape of non-stop mayhem. A guilty, guilty pleasure.\" — F. Paul Wilson, creator of Repairman Jack“AFRAID is a true page turner, a novel that offers a million mile a minute action and suspense. Definitely, a must have with constant thrills and chills.\" — Heather Graham, author of Deadly Gift\"Never have I read a novel so gruesome and simultaneously relentless. This book throbs with unmitigated, inexorable. sheer friggin’ TERROR. You’ll probably need a shrink when you’re done.” — Edward Lee, author of Brides of the Impaler\"Fast and ferocious, this is a dangerous thriller that will take a bite out of you. An absolute must read for anyone who loves the adrenaline rush of a shocking story told with style, speed and savage grace.\" — Jonathan Maberry, author of Patient Zero",
  "genres": [
    "Horror",
    "Thriller",
    "Fiction",
    "Science Fiction",
    "Fantasy",
    "Suspense",
    "Paranormal"
  ],
  "author": "J.A. Konrath",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/10437348-origin"
}