{
  "title": "Prairie Silence: A Memoir",
  "description": "A rural expatriate’s struggle to reconcile family, home, love, and faith with the silence of the prairie land and its people Melanie Hoffert longs for her North Dakota childhood home, with its grain trucks and empty main streets. A land where she imagines standing at the bottom of the ancient lake that preceded the crop rows become the patterned sand ripples of the lake floor; trees are the large alien plants reaching for the light; and the sky is the water’s vast surface, reflecting the sun. Like most rural kids, she followed the out-migration pattern to a better life. The prairie is a hard place to stay—particularly if you are gay, and your home state is the last to know. For Hoffert, returning home has not been easy. When the farmers ask if she’s found a “fella,” rather than explain that— actually— she dates women, she stops breathing and changes the subject. Meanwhile, as time passes, her hometown continues to lose more buildings to decay, growing to resemble the mouth of an old woman missing teeth. This loss prompts Hoffert to take a break from the city and spend a harvest season at her family’s farm. While home, working alongside her dad in the shop and listening to her mom warn, “Honey, you do not want to be a farmer,” Hoffert meets the people of the prairie. Her stories about returning home and exploring abandoned towns are woven into a coming-of-age tale about falling in love, making peace with faith, and belonging to a place where neighbors are as close as blood but are often unable to share their deepest truths. In this evocative memoir, Hoffert offers a deeply personal and poignant meditation on land and community, taking readers on a journey of self-acceptance and reconciliation.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "LGBT",
    "Queer",
    "Lesbian",
    "Biography",
    "Book Club"
  ],
  "author": "Melanie Hoffert",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/13641970-prairie-silence"
}