{
  "title": "The Uncommon Appeal of Clouds",
  "description": "ISABEL DALHOUSIE - Book 9\n\nNothing captures the charm of Edinburgh like the bestselling Isabel Dalhousie series of novels featuring the insatiably curious philosopher and woman detective.  Whether investigating a case or a problem of philosophy, the indefatigable Isabel Dalhousie, one of fiction’s most richly developed amateur detectives, is always ready to pursue the answers to all of life’s questions, large and small.\n\nIn this latest installment of Alexander McCall Smith’s endearing Isabel Dalhousie series, the Edinburgh philosopher and amateur sleuth answers an unexpected appeal from a wealthy Scottish collector who has been robbed of a valuable painting.One afternoon over coffee at Cat’s delicatessen, a friend of Isabel’s shares a call for help from Duncan Munrowe. Crafty thieves have stolen a prized painting from his collection, a work by the celebrated French artist Nicolas Poussin that was earmarked for donation to the Scottish National Gallery. Munrowe has been approached by the thieves and hopes that Isabel will assist him in recovering the painting. Never one to refuse an appeal, she agrees, and discovers that the thieves may be closer to the owner than he ever would have expected.Against the backdrop of this intriguing case, Isabel copes with life’s issues, large and small. She and Jamie have begun to suspect that their three-year-old son, Charlie, might be a budding mathematical genius. What should be done about it? Then there is the question of whether Isabel should help a young couple who want to move in together—against the wishes of the girl’s parents. The boyfriend is hoping Isabel might intercede. As she wrestles with these problems, Isabel finds herself tested as a parent, a philosopher and a friend. But, as always, she manages to use the right combination of good sense, quick wits and a kind heart to come to the right solution, proving once again why Isabel Dalhousie has become one of Alexander McCall Smith’s most beloved characters.",
  "genres": [
    "Fiction",
    "Mystery",
    "Scotland",
    "Philosophy",
    "Audiobook",
    "Contemporary",
    "Cozy"
  ],
  "author": "Alexander McCall Smith",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/13642130-the-uncommon-appeal-of-clouds"
}