{
  "title": "Good Prose: The Art of Nonfiction",
  "description": "Good Prose is an inspiring book about writing—about the creation of good prose—and the record of a warm and productive literary friendship. The story begins in 1973, in the offices of The Atlantic Monthly, in Boston, where a young freelance writer named Tracy Kidder came looking for an assignment. Richard Todd was the editor who encouraged him. From that article grew a lifelong association. Before long, Kidder’s The Soul of a New Machine, the first book the two worked on together, had won the Pulitzer Prize. It was a heady moment, but for Kidder and Todd it was only the beginning of an education in the art of nonfiction.Good Prose explores three major nonfiction forms: narratives, essays, and memoirs. Kidder and Todd draw candidly, sometimes comically, on their own experience—their mistakes as well as accomplishments—to demonstrate the pragmatic ways in which creative problems get solved. They also turn to the works of a wide range of writers, novelists as well as nonfiction writers, for models and instruction. They talk about narrative strategies (and about how to find a story, sometimes in surprising places), about the ethical challenges of nonfiction, and about the realities of making a living as a writer. They offer some tart and emphatic opinions on the current state of language. And they take a clear stand against playing loose with the facts. Their advice is always grounded in the practical world of writing and publishing.Good Prose—like Strunk and White’s The Elements of Style—is a succinct, authoritative, and entertaining arbiter of standards in contemporary writing, offering guidance for the professional writer and the beginner alike. This wise and useful book is the perfect companion for anyone who loves to read good books and longs to write one.",
  "genres": [
    "Writing",
    "Nonfiction",
    "Memoir",
    "Reference",
    "Books About Books",
    "Language",
    "Essays"
  ],
  "author": "Tracy Kidder",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/13641974-good-prose"
}