{
  "title": "Act of Congress: How America's Essential Institution Works, and How It Doesn't",
  "description": "An eye-opening account of how Congress today really works—and doesn’t—that follows the dramatic journey of the sweeping financial reform bill enacted in response to the Great Crash of 2008.The founding fathers expected Congress to be the most important branch of government and gave it the most power. When Congress is broken—as its justifiably dismal approval ratings suggest—so is our democracy. Here, Robert G. Kaiser, whose long and distinguished career at The Washington Post has made him as keen and knowledgeable an observer of Congress as we have, takes us behind the sound bites to expose the protocols, players, and politics of the House and Senate—revealing both the triumphs of the system and (more often) its fundamental flaws. Act of Congress tells the story of the Dodd-Frank Act, named for the two men who made it Congressman Barney Frank, brilliant and sometimes abrasive, who mastered the details of financial reform, and Senator Chris Dodd, who worked patiently for months to fulfill his vision of a Senate that could still work on a bipartisan basis. Both Frank and Dodd collaborated with Kaiser throughout their legislative efforts and allowed their staffs to share every step of the drafting and deal making that produced the 1,500-page law that transformed America’s financial sector.Kaiser explains how lobbying affects a bill—or fails to. We follow staff members more influential than most senators and congressmen. We see how Congress members protect their own turf, often without regard for what might best serve the country—more eager to court television cameras than legislate on complicated issues about which many of them remain ignorant. Kaiser shows how ferocious partisanship regularly overwhelms all other considerations, though occasionally individual integrity prevails.Act of Congress , as entertaining as it is enlightening, is an indispensable guide to a vital piece of our political system desperately in need of reform.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Government",
    "American History",
    "Finance",
    "Economics"
  ],
  "author": "Robert G. Kaiser",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/13642930-act-of-congress"
}