{
  "title": "An Unquenchable Thirst: A Memoir",
  "description": "NAMED ONE OF THE BEST BOOKS OF THE YEAR BY KIRKUS REVIEWS“A candid, generous, and profound spiritual memoir that deserves a great deal of thoughtful discussion.”—Anne Rice   At seventeen, Mary Johnson experienced her calling when she saw a photo of Mother Teresa on the cover of Time magazine; eighteen months later she began her training as a Missionary of Charity, a nun in Mother Teresa’s order. Not without difficulty, this boisterous, independent-minded teenager eventually adapted to the sisters’ austere life of poverty and devotion, but beneath the white-and-blue sari beat the heart of an ordinary young woman who faced daily the simple and profound struggles we all share, the same desires for love and connection. Eventually, after twenty years of service, Johnson left the church to find her own path, but her magnificently told story holds universal truths about the mysteries of faith and how a woman discovers herself.  Includes new material: Two reading group guides—for groups that wish to take different approaches to the book; a conversation between Mary Johnson and Mira Bartók, author of The Memory Palace; and Mary Johnson’s recommended reading list   “A wonderful achievement . . . Johnson opens the window on a horizon of spiritual questions [and] takes an unflinching look inside her own heart.”—The Christian Science Monitor  “An incredible coming-of-age story . . . [It] has everything a memoir needs: an inside look at a way of life that most of us will never see, a physical and emotional journey, and suspense.”—Slate “Reads like a novel . . . an exacting account of a woman growing into her own soul.”—More magazine   “Engaging, heartfelt and entertaining . . . [Johnson] articulates her struggles with her God in words that will hit home.”—Los Angeles Times   “An inspiration that transcends any particular religious belief . . . An Unquenchable Thirst is a journey that captivates, but its resonance lies in the life examined.”—The Denver Post",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Religion",
    "Biography",
    "Spirituality",
    "Book Club",
    "Autobiography"
  ],
  "author": "Mary  Johnson",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/13642983-an-unquenchable-thirst"
}