{
  "title": "The Alpine Xanadu",
  "description": "A new exhilarating installment in Mary Daheim’s beloved and long-running small-town murder mystery series set in Alpine, Washington, and featuring unforgettable newspaper editor Emma Lord. Winter in the small mountain aerie of Alpine should be as quiet as new-fallen snow on the Cascades, but from the Grocery Basket to the Venison Inn, the town is humming. At the Alpine Advocate, editor Emma Lord and her staff are on deadline with a feature about the opening of RestHaven, a new rehab and mental health facility. Front Street is buzzing with gossip about Emma’s recent engagement to Sheriff Milo Dodge. And now that fool Wayne Eriks has climbed an electric pole in the middle of a storm and got himself electrocuted. Sheriff Dodge doesn’t buy the idea that Wayne’s death is an accident. But how—and, more important, why—he died is only one of the conundrums that keep the sheriff and Emma working overtime. Why is RestHaven giving Alpine so many restless nights? What to make of allegations that someone’s trying to kill the richest man in town . . . or whispers of a rash of indecent behavior at the local high school? After Vida Runkel, the Advocate ’s stalwart House & Home editor, disappears into thin air, Milo and Emma suddenly have too many loose ends to solve before they can even think about tying the knot. Featuring beloved characters from the series alongside some sinister new ones—not to mention a mystery that will shake Alpine to its core— The Alpine Xanadu may be Mary Daheim’s most delicious novel yet. Praise for Mary Daheim and her Emma Lord mysteries “Always entertaining.”— The Seattle Times “Mary Daheim writes with wit, wisdom, and a big heart. I love her books.”—Carolyn Hart “Daheim writes . . . with dry wit, a butter-smooth style, and obvious wicked enjoyment.”— The Oregonian “The characters are great, and the plots always attention-getting.”—King Features Syndicate “Even the most seasoned mystery fans are caught off-guard by [Daheim’s] clever plot twists.”—BookLoons Reviews “Witty one-liners and amusing characterizations.”— Publishers Weekly",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "Audiobook",
    "Romance"
  ],
  "author": "Mary Daheim",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/13642957-the-alpine-xanadu"
}