{
  "title": "Frontiers: The Epic of South Africa's Creation and the Tragedy of the Xhosa People",
  "description": "This book masterfully reinterprets the founding era of South Africa, especially the 19th century, to emphasize not the Afrikaners but the conflict between British colonials and the indigenous Xhosa people. Drawing on virtually forgotten government records and vivifying little-known people, Mostert ( Supership ) has done for South Africa what Robert Hughes did for Australia in The Fatal Shore. Mostert places South Africa in the framework, both geographical and moral, of world colonial expansion; Britain's Cape Colony, site of an experiment in political liberalism, illustrates the era's tension \"between high-minded conscience and self-interest.\" To reconstruct this \"crucible of modern South African society,\" the author conjures up multiple worlds in passages often intricate and lyrical, though the depth of detail may deter readers. He draws on historiography, geography, linguistics and archeology to portray the European scramble for Africa, the cosmology of the indigenous Bushmen and the lives of the Afrikaners and the Zulus but eventually focuses on the British settlers and the Cape Xhosas, a proud people with traditions of democratic debate, communal land and welcoming of strangers. Their interactions animate a dramatic narrative: the British began \"probably the most callous act of mass settlement in the entire history of empire;\" the Cape was the first society to attempt to legislate an interracial state; and the Xhosas, being decimated by the frontier wars and vulnerable to prophecy, decided that killing their cattle would rid them of the white man, which only starved themselves to death instead--\"probably the greatest self-inflicted immolation of a people in all history.\" Mostert concludes that the Cape Colony, where the nonracial franchise continued to contract until it vanished under 20th-century apartheid, \"represents one of the greatest of lost ideals within human society.\"",
  "genres": [
    "History",
    "Africa",
    "South Africa",
    "Nonfiction",
    "World History",
    "War"
  ],
  "author": "Noel Mostert",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/13643775-frontiers"
}