{
  "title": "The War at the End of the World",
  "description": "September, 1941.War correspondent Joseph Byrne has been cheating death all his life, ever since he spent two years in an iron lung as a boy diagnosed with polio. In the years since, the Fetch, a strange being charged by Death with collecting Joseph and transporting him into the unknown, has been condemned to watch and wait. Now, with Joseph working in a Finland caught in a tug of war between Nazi and Soviet forces, it seems a foregone conclusion that the Fetch's sentence is at its end and Death will have Joseph for her own at last. Joseph, an openly Jewish American, has no doubt where his allegiance lies, no matter the danger. But after all these years at Joseph's side, watching him overcome adversity to grow into a brave and principled young man, the Fetch has come to realize that there are forces stronger and so much sweeter than even the purpose you were made for.Original Prompt:Dear Author,I could feel him slipping away from me, his pulse was weak and thready, his skin ash white. He was so young, and gorgeous. I'd sworn not to use my power any more. I knew what healing took from me. I'd even come to believe that it wasn't my place to save those whom the spirit had called over. But his hand was strong in mine, his fingers long and elegant, the nails a little ragged, a callus just there... I closed my eyes and pushed into him, finding the breaks, the torn vessels, the pooling blood. I let healing pour out from me into him. Not too much, just enough to keep him alive. His eyes opened and they were storm-grey and brilliant. He looked up at me and whispered, \"I know what you are.\"This story was written as a part of the M/M Romance Group's \"Love is Always Write\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story.Also read the story here or find it in Love Is Always Write: Volume 10.",
  "genres": [
    "M M Romance",
    "Historical",
    "Paranormal",
    "Short Stories",
    "Romance",
    "Fantasy",
    "Military Fiction"
  ],
  "author": "Heidi Belleau",
  "average_rating": "3.19",
  "url": "https://www.goodreads.com/book/show/13643818-the-war-at-the-end-of-the-world"
}