{
  "title": "the molecules that surround us",
  "description": "35-year old Jill Treadwell has her bipolar under control until she is laid off from her job at a Contemporary Art museum losing her health insurance and medications. After her unemployment benefit amount is determined she has no choice but to pack up her apartment and move in with her mother and her mother’s new husband. As her medications dwindle away she begins to head down a dark path of depression and mania that leads to self-medication with drugs and alcohol. The description of the symptoms of mental illness is rendered with alarming accuracy as she hits bottom with a life changing DUI. After her arrest her depression carries her into an inhumane place of despair and hopelessness. After a thwarted attempt at suicide we follow her tragic and comedic struggles to find health insurance with her pre-existing bipolar disorder meeting a motley crew of her friends and supporters along the way.Her \"journey\" starts with the vivid and wild friends she has when she is not mentally well. As she begins to repair her mind we meet her therapist, counselors and friends in recovery. Jill's mother plays an important roll by keeping things light with her humor and naivety. Her father’s gruff, uneducated deportment leads to some laughs as well, with his strong spirit and fumbling dedication to his daughter.Fortunately the COBRA subsidy is granted to those who have lost their jobs in this nightmare economy. Jill is back in business, seeing her doctors and resuming her medications. Therapy and counseling are helping her see there is a way out of her challenging circumstances if she can just hold on and trust the help that is being provided to her by friends and professionals. Court appointed trips to AA and group therapy are another outlet for humor and parody. Things are starting to take form for Jill as her head begins to clear and she starts to understand the sobering reality of her multiple court dates and related obligations.On the road back to mental health an old boyfriend resurfaces with issues of his own. Russ is also an alcoholic who has been diagnosed as bipolar. Jill feels she can help him with his struggles as she has just emerged from the worst four months of her life. Jill and Russ attended film school together and he never could get her out of his mind after they separated. He made a film about her and it is this film that brings the two together. This bizarre coupling of two psychologically challenged individuals leads to an endearing romance built on creativity and an understanding that surpasses the conventional boundaries of romantic love. We join them through their whirlwind courtship and last minute wedding that is both comic and touching. All Jill ever wanted was a life to call her own and the couples' love brings them to a place of super absorbent paper towels and environmentally friendly cleaning products.Breaking through the challenges of finding health insurance and subsequent recovery from alcoholism, The Molecules That Surround Us chronicles a journey resulting in love, sanity and a “real life.”",
  "genres": [
    "Mental Illness"
  ],
  "author": "Jill Treadwell",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/13644439-the-molecules-that-surround-us"
}