{
  "title": "Timeslingers: Season 1",
  "description": "Writer's Digest Self-Published Book Awards Judge Timeslingers Season 1 by Jay Sherer and Nathan Scheck is a series of episodes written in an unorthodox but riveting manner. Fast pacing and powerful hooks will keep the attention of readers from the first page to the last in this genre blend filled with adventure, technology, and science. It seems to be one of those trailblazing pieces of work that will eventually have plenty of copycats, giving it a place in literary history. Although this is classified as genre (and I agree that it is), I think it can also be considered mainstream.“Timeslingers draws you in from the first word, and then rockets along at a breakneck pace. It will be hard not to read this book in one sitting…”– Bobby Nash, author of Deadly Games, Evil Ways, Lance Sky Ranger, and more “Timeslingers is an innovative and entertaining series that takes me to times and places I love. Be careful. It will lure you in.”–Joseph Bentz, author of A Son Comes Home “An awesome throwback to the sci-fi adventure serials that have been missing from the world lately.”– Kaleb, Timeslingers Facebook FanA formula stolen.A president murdered.A future threatened. The Xi’an Liberation Society (XLS) banks on chaos. They exist to usurp the global Union government’s power. Their methods toe the line between rebellion and terrorism…and they have just discovered a top secret Union project. Led by Marcus Kline, the XLS launches a calculated assault on history in order to annihilate the Union’s future. The only thing standing in their way is an elite team of time travel The Union Subdivision. But as the Subdivision attempts to preserve the past, they will reach their breaking point, and the clash of “timeslingers” will resound across centuries. Season 1 is a compilation of twenty-five episodes from the online time travel adventure series. A throwback to classic newspaper serials of the past, it is an easy-to-read, fast-paced story that starts out with a bang and keeps firing. From Los Alamos National Laboratories and the Apollo Program, to 2019 Moscow and 2147 New London, no part of history is safe.",
  "genres": [
    "Science Fiction"
  ],
  "author": "Jay Sherer",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/13645213-timeslingers"
}