{
  "title": "SPOON: Soup, Stew & Chowder Recipes (Spring)",
  "description": "Soup, Chowder, & Stew Recipes (Spring) : A seasonal collection of gourmet recipes that can be made in one pot.*Over 50,000 Copies Downloaded - That's a lot of fans!*Book #1 in the Soup, Chowder, & Stew Recipes Cooking in Season .*If you love cooking and want to use fresh local ingredients -- this is your book.\"The Spoon cookbook provides you with some realistic and easy reasons whyyou might want to start eating fresh, local and organic (when possible)without intimidating the reader. So not only do they include greatrecipes, but a little inspiration for why you would want to make eachand every one of them. The recipes are delicious and varied andHEALTHY. They are easy and fun to make, and cover a wide range ofethnic and cultural foods as well.\" - Jennifer Towert  (Amazon Reviewer)\"The soups in this recipe book consistently hit the mark with taste -flavourful with the right balance of delicacy and rich body. To balancethis with the variety is really useful (and yummy!) - you can easilyfind an appropriate soup for the occasion.\" - Rochelle (Amazon Reviewer)This SPOON cookbook collectioncontains favourites from the farmers' market.Cooking with foods that are in season helps to keep your grocery billdown, and you can take advantage of the selection at your local farmers'market! Most of the recipes in this book can be prepared in one pot in less than30 minutes, and will leave you enough to freeze the extra for anothertime. Soup, Stew & Chowder Recipes will show you how to make these delicious Spring In addition to the recipes, Soup, Chowder, & Stew Recipes (Spring) \"I really enjoyed the tips on which foods were in season,because I feelprice is what mostly keeps me away from eating fresh foods(broke collegestudent),but with these tips I can shop in season,and within my budget.\" Crystal Burns (Amazon Reviewer)\"At an Easter party, someone handed me a shot glass of chilled strawberrysoup that knocked my socks off! I went home and bought this kindlebook and am now a 'convert' that rhubarb can again have a place in mykitchen!! Until now, I wondered what I would do with the existing patchgrowing in the garden that 'came' with our new house -- my winterstores of lentils are fast disappearing with fresh lentil & rhubarbstew! As a busy mum, simple and fast minted pea soup is a hit with myfamily, and the coconut carrot soup was a welcome change from my boringold winter standard. I can't wait for summer / fall / winter spooningsuggestions from this duo!\" - MT (AmazonReviewer)Get your copy today, and start cooking in season.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Nonfiction"
  ],
  "author": "Dana Hay",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/13645336-spoon"
}