{
  "title": "To the Princess Bound",
  "description": "TO THE PRINCESS A haunted princess chained to a terrifyingly powerful slave, a free man taken from his home and forced into servitude to save her… Six years ago, Victory’s mind and body were brutally shattered by those she trusted. The betrayal has left her with a closed and tortured heart and an innate fear of the men around her. Her father, a cold, compassionless emperor who rules Victory’s life the same way he has ruled Mercy, has an inhuman Chain her to a massive native man from the war-torn planet that kidnapped her to prove to her there’s nothing to fear. Yet when the huge and gentle native shows himself to be something more than anyone expects, will Victory open her heart and allow this handsome and powerful healer to help her flower, or will she turn him over to the Imperium that hunts him? Bound to an Imperial princess, their bodies lashed together by a cruel decree, Dragomir is tired of helplessly watching Victory’s past overtake her. He has the power to fix her, and if she doesn’t like it, she can kill him after he is finished. He is a healer—he will mend her broken spirit, or die trying. Yet, in healing her, he must reveal his secret to her, and in doing so, Dragomir must also trust her with his life, for those with his special talents are feared and hunted by the Imperium. What Dragomir doesn’t foresee at the outset is his own She’s his soul-mate, their lives entwined throughout the ages, and her mere presence sparks a fire within him that he’s tried for years to ignore. He finds himself fighting his body’s deepest urges every time he looks upon her graceful form, struggling for the control she needs of him, warring with inner desires and an ancient need that could make her abandon him forever… “Trust me, Victory,” Dragomir said softly. “There’s something between us…” He swallowed and glanced at his hands, where they touched hers. “We’re…connected…in a way that most people could only dream.” He seemed to be struggling for words, and settled with, “You were always safe with me, as I was with you.” Victory peered into his eyes, wanting to ask him what he meant by that, yet not finding the courage. When she said nothing, he gingerly reached down and… To the Princess Bound is a heart-pounding adventure for people who crave a little science fiction in their romance, who don't mind a bit of dystopian thriller sprinkled on top, and who like to read something totally unique and new. Shamelessly written for lovers of Paranormal & Urban Fantasy Romance! PARASITE PUBLICATIONS ~ Science Fiction Romance",
  "genres": [
    "Romance",
    "Fantasy",
    "Science Fiction",
    "Paranormal",
    "Paranormal Romance",
    "Magic",
    "Science Fiction Romance"
  ],
  "author": "Sara  King",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/13645588-to-the-princess-bound"
}