{
  "title": "Callsign: King III - Blackout (Jack Sigler)",
  "description": "Twice before, Jack Sigler— King—has stopped the mysterious ‘Brainstorm’ from destroying all life on earth. Twice before, he’s survived Brainstorm’s assassins. So when the mastermind behind Brainstorm surfaces in Paris, King goes on the offensive. As the final showdown unfolds in the legendary City of Lights, the villain’s scheme to plunge the world into literal darkness is revealed. But even Brainstorm isn’t ready for the destructive force that has been unleashed…an entity of darkness imprisoned for more than a thousand years, set free now to devour...everything. The blackout has begun… When the sun rises, the world will end.THE CALLSIGN King - Blackout (53,600 words) is part of a series of Chess Team novellas and is the third book in \"The Brainstorm Trilogy\" that follows the team's leader, King. Each of the Callsign books follows a single member of the team and are titled for them; Queen, Knight, etc, and are co-authored by Jeremy Robinson and five other fantastic authors. The stories take place after the events of THRESHOLD, the third Jack Sigler thriller, but are designed to introduce readers to the series. If you haven't read the novels, no worries. Enjoy the ride!PRAISE FOR \"Rocket-boosted action, brilliant speculation, and the recreation of a horror out of the mythologic past, all seamlessly blend into a rollercoaster ride of suspense and adventure.\" -- James Rollins, New York Times bestselling author of JAKE RANSOM AND THE SKULL KING'S SHADOW\"With THRESHOLD Jeremy Robinson goes pedal to the metal into very dark territory. Fast-paced, action-packed and wonderfully creepy! Highly recommended!\" --Jonathan Maberry, NY Times bestselling author of ROT & RUIN\"Jeremy Robinson is the next James Rollins\" -- Chris Kuzneski, NY Times bestselling author of THE SECRET CROWN\"If you like thrillers original, unpredictable and chock-full of action, you are going to love Jeremy Robinson...\"-- Stephen Coonts, NY Times bestselling author of DEEP ARCTIC GOLD\"How do you find an original story idea in the crowded action-thriller genre? Two Jeremy Robinson.\" -- Scott Sigler, NY Times Bestselling author of ANCESTOR\"There's nothing timid about Robinson as he drops his readers off the cliff without a parachute and somehow manages to catch us an inch or two from doom.\" -- Jeff Long, New York Times bestselling author of THE DESCENTPRAISE FOR \"Some books are just plain unbridled fun, others are edge of the seat gripping entertainment, some make you think, a few open your eyes, Sean Ellis is a magician, doing it all with a deftness that pulls you in and draws you along from page one breathlessly to the end of the book.\" -- Steven Savile, author of the international bestseller, SILVER\"Sean Ellis delivers another high-octane romp, exploring mythical lost civilizations and alternative histories, with the unrelenting pace of your favorite summer blockbuster.\" --Stel Pavlou, bestselling author of DECIPHERABOUT THE JEREMY ROBINSON is the author of eleven novels including PULSE, INSTINCT, and THRESHOLD the first three books in his exciting Jack Sigler series. His novels have been translated into nine languages. He lives in New Hampshire with his wife and three children.SEAN ELLIS is the author of several novels. He is a veteran of Operation Enduring Freedom, and has a Bachelor of Science degree in Natural Resources Policy from Oregon State University.",
  "genres": [
    "Thriller",
    "Fiction",
    "Adventure",
    "Action",
    "Science Fiction",
    "Military Fiction",
    "Audiobook"
  ],
  "author": "Jeremy Robinson",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/13645601-callsign"
}