{
  "title": "The Game Plan",
  "description": "From the age of eight, Cassandra Johnson fought against ever being loved for fear of being abandoned again following her father’s cruel and abrupt departure. When her mother married ex-Dolphins quarterback Big Bill Johnson, a new stepdad and three new stepbrothers entered Cassie’s life. After the passing of her mother Cassie grows tired of living under the thumb of her three stepbrothers, and she decides to press for independence, asserting her obstinate and willful disposition and defying all rules laid out for her. When Bill goes to Japan for three months on business, Cassie’s eldest stepbrother, Rob, is left in charge. He decides that a change to the \"Game Plan\" is in order and that it will start with a trip over his knee for a bare bottom spanking! Rob’s interest in Cassie goes far beyond just curbing her naughty behavior, however. He wants much, much more from her. Cassie’s fantasy of having a life free from control is soon shattered. Bryon, her second oldest stepbrother, adds some firm-handed discipline of his own, and Cassie soon discovers the secret shared by the two brothers. Both are involved in the D&S scene, and both want to make Cassie part of their lifestyle. The stubborn young woman soon finds herself facing more than just an old-fashioned, over the knee, bare-bottom spanking. She quickly learns that humiliation and submission can lead to the healing of a long-broken and hardened heart. Publisher’s Note: The Game Plan is an erotic novel that includes non-consensual spankings, punishment enemas and anal play, mouth soaping, exhibitionism, STRONG & SEXUAL AGE PLAY ELEMENTS, and more. Very hot! If such material offends you, don’t buy this book.Book Length: 10 chapters / 29,744 words",
  "genres": [
    "BDSM",
    "Erotica",
    "Romance",
    "Menage",
    "M F Romance",
    "Contemporary Romance",
    "Adult"
  ],
  "author": "Breanna Hayse",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/13646427-the-game-plan"
}