{
  "title": "James Madison and the Struggle for the Bill of Rights",
  "description": "Today we hold the Constitution in such high regard that we can hardly imagine how hotly contested was its adoption. In fact, many of the thirteen states saw fierce debate over the document, and ratification was by no means certain. Virginia, the largest and most influential state, approved the Constitution by the barest of margins, and only after an epic political battle between James Madison and Patrick Henry. Now Richard Labunski offers a dramatic account of a time when the entire American experiment hung in the balance, only to be saved by the most unlikely of heroes--the diminutive and exceedingly shy Madison. Here is a vividly written account of not one but several major political struggles which changed the course of American history. Labunski takes us inside the sweltering converted theater in Richmond, where for three grueling weeks, the soft-spoken Madison and the charismatic Patrick Henry fought over whether Virginia should ratify the Constitution. The stakes were enormous. If Virginia voted no, George Washington could not become president, New York might follow suit and reject the Constitution, and the young nation would be thrust into political chaos. But Madison won the day by a handful of votes, mollifying Anti-Federalist fears by promising to add a bill of rights to the Constitution. To do this, Madison would have to win a seat in the First Congress. Labunski shows how the vengeful Henry prevented Madison's appointment to the Senate and then used his political power to ensure that Madison would run against his good friend, Revolutionary War hero James Monroe, in a House district teeming with political enemies. Overcoming great odds, Madison won by a few hundred votes, allowing him to attend the First Congress and sponsor the Bill of Rights. Packed with colorful details about life in early America, this compelling and important narrative is the first serious book about Madison written in many years. It will return this under-appreciated patriot to his rightful place among the Founding Fathers and shed new light on a key turning point in our nation's history.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "Politics",
    "Presidents",
    "American History",
    "Audiobook"
  ],
  "author": "Richard Labunski",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/10438775-james-madison-and-the-struggle-for-the-bill-of-rights"
}