{
  "title": "Cartas a quien pretende enseñar",
  "description": "En este libro Paulo Freire muestra uno de sus mejores momentos de producción, discutiendo con claridad política, radicalismo y buen gusto lo concreto de \"ser maestro\". Problemas relevantes de lo cotidiano de la disciplina, relación entre teoría y práctica, una nueva comprensión de lo que es enseñar y aprender, el artificio ideológico de la denominación tía-maestra, son discutidos en el marco del gusto por una escuela democrática y del compromiso con la transformación social. Las cartas son un desafío para \"pensar la práctica\" y un testimonio de que esto es posible y necesario. Educadores e investigadores encontrarán, en la lectura de este libro, una invitación para que se vuelvan productores de comprensión de las palabras del autor. Es, además, un bien cuidado ejemplo del uso de la dialéctica en la producción escrita. ANA MARÍA SAUL Barthes decía que la vida de un maestro se divide en tres etapas. En la primera enseña lo que sabe. En la segunda, lo que no sabe. Y, en la tercera, se entrega al aprendizaje de desaprender. Los maestros del taoísmo ya habían percibido que el camino para la sabiduría pasa por el olvido de lo aprendido. Alberto Caeiro también sentía lo mismo y hablaba de la necesidad de despojarse de lo que le había sido enseñado para reencontrarse consigo mismo. Al final de tal proceso, posiblemente con la llegada de la vejez, Barthes se sentía portador de un nuevo saber, al que daba el nombre de el saber sabroso. Y, sin el menor embarazo, admitía ser sabio. Sabio, por sus raíces etimológicas, significa \"el que degusta\". Ser sabio no es tener acumulados conocimientos en grado es haber desarrollado la capacidad erótica de sentir el gusto por la vida. Como él mismo dice, sapiencia es \"nada de poder, una pizca de saber, y el máximo posible de sabor\". Estas cartas de Paulo Freire son textos de sabiduría. ÉI mismo lo confiesa al hablar del placer enorme que tuvo al prepararlas. Y si son textos de placer, sus palabras no son ofrecidas sólo a la inteligencia, como objetos de pensamiento, son ofrecidas al cuerpo entero, para ser degustadas y comidas... Y al lector se le puede decir lo que el ángel del Apocalipsis dijo al apóstol \"Toma el librito y cómelo.\" RUBEM ALVES",
  "genres": [
    "Education",
    "Nonfiction",
    "Teaching"
  ],
  "author": "Paulo Freire",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/13646196-cartas-a-quien-pretende-ense-ar"
}