{
  "title": "His Wife Leaves Him",
  "description": "Stephen Dixon, one of America’s great literary treasures, has completed his first novel in five years — His Wife Leaves Him, a long, intimate exploration of the interior life of a husband who has lost his wife. His Wife Leaves Him is as achingly simple as its title: A man, Martin, thinks about the loss of his wife, Gwen. In Dixon’s hands, however, this straightforward premise becomes a work of such complexity that it no longer appears to be words on pages so much as life itself. Dixon, like all great writers, captures consciousness. Stories matter here, and the writer understands how people tell them and why they go on retelling them, for stories, finally, may be all that Martin has of Gwen. Reminders of their shared past, some painful, some hilarious, others blissful and sensual, appear and reappear in the present. Stories made from memories merge with dreams of an impossible future they’ll never get to share. Memories and details grow fuzzy, get corrected, and then wriggle away, out of reach again. Martin holds all these stories dear. They leaven grief so that he may again experience some joy. Story by story then, he accounts for himself, good and bad, moments of grace, occasions for disappointment, promises and arguments. From these things are their lives made. In His Wife Leaves Him, Stephen Dixon has achieved nothing short of the resurrection of a life through words. When asked to describe his latest work, the author said that “it’s about a bunch of nouns: love, guilt, sickness, death, remorse, loss, family, matrimony, sex, children, parenting, aging, mistakes, incidents, minutiae, birth, music, writing, jobs, affairs, memory, remembering, reminiscences, forgetting, repression, dreams, reverie, nightmares, meeting, dating, conceiving, imagining, delaying, loving.” His Wife Leaves Him is Dixon’s most important and ambitious novel, his tenderest and funniest writing to date, and the stylistic and thematic summation of his writing life.",
  "genres": [
    "Fiction",
    "Literature",
    "Novels",
    "American",
    "Literary Fiction"
  ],
  "author": "Stephen Dixon",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/13646720-his-wife-leaves-him"
}