{
  "title": "First You Write: The Worst Way to Become an Almost Famous Author And The Best Advice I Got While Doing It",
  "description": "In her critically acclaimed, bestselling memoir, BALD IN THE LAND OF BIG HAIR (HarperCollins 2001), Joni Rodgers invited readers along on her family's harrowing (but hilarious) journey through the Badlands of cancer and self-discovery. In this mini-memoir, Rodgers expands on how events before, during and after her stint in chemo led to her becoming a New York Times bestselling author and celebrity ghostwriter. Peppered with laughter and enriched with wisdom from friends and mentors, FIRST YOU WRITE challenges aspiring writers to reflect on what compels us to create and shares an optimistic but controversial take on where the publishing industry is headed.\"A lot of people ask me why a New York Times bestselling author repped by William Morris Endeavor would choose to indie publish,\" says Rodgers. \"This is the answer. It isn’t perfect, but I tried to be true. And it's a quick read. I kept it short, because the best piece of writing advice I ever received was delivered to me by the late, great Rue McClanahan: Stop kvelling and get back to work.\"The Center For Fiction lists FIRST YOU WRITE as an Essential Book For Writers, saying, \"Rodgers’ writes with wit and candor not only about her circuitous route to becoming a New York Times bestselling memoirist and a critically acclaimed small-press novelist... Rodgers’ willingness to experiment (isn’t that what artists do?) and to turn preconceived publishing notions on their ear is wonderfully refreshing, and her whip-smart observations will keep you turning (virtual) pages.\" KUDOS FOR AUTHOR JONI RODGERS:\"Rodgers is a pure storyteller. She writes with a wit, lyricism, humanity and joy that make her books impossible to put down.\" Oscar-winning screenwriter Aaron Sorkin\"Alternately wrenching and humorous...Rodgers' strength is a womanly wise, laugh-through-tears appreciation of life.\"Publishers Weekly“Rodgers lives, loves and writes without a safety net… managing the rare literary feat of being painful and funny in one urgent breath.”Entertainment Weekly",
  "genres": [
    "Writing"
  ],
  "author": "Joni Rodgers",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/13646771-first-you-write"
}