{
  "title": "How Julian and Nigel Turned Each Other Gay (Inadvertently), or So They Both Claim",
  "description": "Julian Morris was not quite happy about his first year at St. Widifroth's-on-Quinapoxet, the school for the blameworthy rich. He had two obnoxious roommates, whom he had grown somewhat used to; semi-interesting classes, or rather classes he hadn't yet managed to fall asleep in; and two parents who apparently couldn't read a school prospectus properly. Why else would they have sent him to St. Widifroth's? Well, it might have had something to do with one D too many on his last report card. But who cared about igneous rocks and isosceles triangles anyway? Then he met Nigel Higginson, who turned him gay, only to have Julian return the favor. After classes that day, Julian went back to the dorm and discovered a pensive Nigel sitting with several ells of rope draped across his lap. He was tapping a legal pad with a pen, and beside him was a Butterfinger bar on a paper plate. The candy had been carefully sliced up as if to make it last for the longest possible time. “Let me guess. Suicide note, last meal, and hanging yourself? Not in our room! Yuck.” “Julian, do you believe in the scientific method? Hypothesis, thesis, and testing your theories?” “Of course.” “Good. You're almost my best friend, and I need help.” Julian didn't like the sound of this. “What sort of help? I'm not pushing you off the windowsill once you've tied the rope around your neck.” “My hypothesis is that I could possibly, just possibly, use some improvement in my kissing technique.” “So?” Nigel smiled an evil, predatory smile. Fifteen minutes later, a feebly thrashing Julian was trussed to his bed, and Nigel was sitting on his chest. Julian had been howling for succor, but the door was locked and their room was isolated from the others. As Nigel drew lines on his legal pad, he explained. “You give me a one to ten rating for each kiss, and I'll reward you with a bite of candy bar. I'm delivering each kiss with a different technique.” “Why don't you torture some girl instead of me?” Julian whined. “Because I want objective, truthful feedback. A girl I'm dating won't be honest. If you think a kiss is good, it probably is.” “Oh, my God,” wailed Julian as Nigel's maw approached. Something horrible and prolonged happened, though Julian wasn't sure what. “Minus five.” “You're not allowed to use negative numbers. Impressions?” “Pea soup.” “Dammit.” They'd had pea soup for dinner, and Nigel went off to brush his teeth. “Floss, scrape your tongue, and do a mint rinse,” Julian yelled after him. “I don't want to experience that again!”",
  "genres": [
    "M M Romance"
  ],
  "author": "Avis Black",
  "average_rating": "2.76",
  "url": "https://www.goodreads.com/book/show/13647696-how-julian-and-nigel-turned-each-other-gay-inadvertently-or-so-they-b"
}