{
  "title": "Reign of Coins",
  "description": "For William Barrow, two thousand years is a very long time…too long, when it is a perpetual punishment for betraying Jesus Christ.The man originally known as Judas Iscariot is on a mission to recover thirty silver shekels once paid to him for his ultimate treachery. Twenty-two coins have been recovered, leaving just eight to go. But when his Russian nemesis, Viktor Kaslow, also becomes immortal, the stakes are immediately raised. Kaslow has followed William and his son, Alistair, to Hong Kong in search of a ‘blood coin’ passed down through Genghis Khan. The coin presently belongs to an esteemed Chinese collection. But along with the coin are other cursed items from the famed Mongol Emperor. William soon learns he can’t have the ‘one’ without the others.William has waited eight hundred years for a second chance to reclaim this particular coin that inspired the Mongolian Empire’s bloody violence it was once famous for. While Kaslow closes in, seeking his own vengeance, William and Alistair race against the CIA and an unscrupulous American businessman intent on reaching the cursed ‘treasure trove’ before them.Much is at stake for the Barrows and the world, as a deadly weapon unseen for centuries lies in wait alongside blood coin number twenty-three….****This new edition of Reign of Coins comes to you after a thorough tightening of the story, following constructive feedback during the past year. I would like to thank Alisa Gus, of Curiosity Quills Press, for her invaluable editing assistance in preparing this book for re-release. Peace to all, Aiden James ~ April 16th, 2013****Acclaim for the novels of Aiden James:“The intense writing style of Aiden James kept my eyes glued to the story and the pages seemed to fly by at warp speed. …Twists, turns, and surprises pop up at random times to keep the reader off balance. It all blends together to create one of the best stories I have read all year.”—Detra Fitch, Huntress Reviews for “The Devil’s Paradise”“Aiden James has written a deeply psychological, gripping tale that keeps the readers hooked from page one.”—Bookfinds review for “The Forgotten Eden”“Not only is Aiden James a storyteller par excellence, but his material for his story is riveting.”—Huntress Reviews for “The Forgotten Eden”“The hook to this excellent suspense thriller is the twists that will keep readers wondering what is going on as nothing is quite what it seems. Adding to the excitement is that the audience will wonder whether the terror is an evil supernatural creature or an amoral human…Aiden James provides a dark thriller that grips fans from the opening.”—Harriet Klausner for “The Forgotten Eden”“Aiden James writing style flows very easily and I found that “Cades Cove” snowballed into a very gripping tale. Clearly the strengths in the piece were as the spirit’s interaction became prevalent with the family… The Indian lore and ceremonies and the flashbacks to Allie Mae’s (earthly) demise were very powerful. I think those aspects separated the work from what we’ve seen before in horror and ghost tales.”—Evelyn Klebert, author of “A Ghost of a Chance” and “Dragonflies”“Aiden James has a keen eye for detail and an uncanny knack for scaring the hell out of me. We are watching a master at work. “The Raven Mocker” is a nearly perfect thriller. Ghost stories don't get any better than this.”—J.R. Rain, Bestselling author of the “Vampire for Hire” series“As with the previous titles I have read by this author, I found the author's writing style to be silky smooth and the main plot line to be extremely creative. The fertile imagination of Aiden James definitely knows what today's readers want to see in their stories.”—Detra Fitch, Huntress Reviews for “The Vampires’ Last Lover”",
  "genres": [
    "Fantasy",
    "Fiction",
    "Historical Fiction",
    "Paranormal",
    "Adventure",
    "Thriller",
    "Action"
  ],
  "author": "Aiden James",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/13648847-reign-of-coins"
}