{
  "title": "On and Off Bass",
  "description": "The New Yorker calls it “unusual and beautiful.” The LA Weekly raves, “the photos are strikingly inventive, revealing yet another side of this modern-day Renaissance man.” MTV calls it “a charming, well-shot document of a the legendary punk rocker’s photographic dabbling.” Detroit “A unique insight into Watt’s mind.”“Mike On and Off Bass” is getting a lot of buzz. And for good reason, considering the author and photographer is the legendary punk bassist himself.Mike Watt got his musical start thumping the bass with legendary San Pedro punk trio, The Minutemen in 1980 and he has been at it ever since. Over the years, he’s toured with Dos, fIREHOSE, his own The Black Gang, The Secondmen, The Missingmen, and others, and he has worked bass as a sideman for Porno for Pyros, J Mascis and the Fog, as well as punk godfathers The Stooges.Off the road, at his beloved San Pedro, CA home base, Watt developed a deep interest in photography. In Spring 2010, Track 16 Gallery in Santa Monica, CA hosted an exhibit of his “Mike Eye-Gifts from Pedro.” According to Track 16 executive director Laurie Steelink, who curated the exhibit, “He has this knack for finding the early morning sweet spots when venturing out alone on his bike or kayak. The resulting photographs never seem to light, flight, salt, rust, and tide commingle in fiery sunrises, endless heavens, roiling waves and fog.” The photos offer another side of Watt that fans of his punk rock music may not be familiar While seemingly serene, many have an underlying tension and that often shows the sharp contrast between industry and nature.In “Mike On and Off Bass,” photographs that appeared in the exhibit are punctuated by Watt’s poetry and snippets selected from 10 years of his diaries. Watt’s writing is insightful, funny, intimate and honest, as he explores topics like John Coltrane, long hauls and overcoming performance fears. “Mike On and Off Bass” exposes Watt’s vision as a photographer, diarist and poet, taking its readers on a trip. And when you stop turning the pages of Watt’s story, you start turning the pages of yours, re-ignited.“ Mike Watt’s photos are the poetry of San Pedro...every time he goes out on that kayak he comes back with gold. These gorgeous images paired with the raw reflections of three decades on the road are sure to blow the minds of all who love punk rock and our beloved vision questing troubadour.” - Jack Black“ Here is the last stand of the fruited earth and the ship-freighted sea. How lovely America was. God bless San Pedro and Mike Watt.” - Iggy Pop\" The heart and mind and EYES of Michael Watt, half-brother of us all, in black/white and color. No blue-eyed beatnik Buddhist ever breathed such humility; no jackleg science-fictioneer ever oozed such enchantment. That's right!\" - Richard Meltzer\"Watt covers the waterfront.\" - Raymond Pettibon\" Susan Sontag wrote that photographs of people are haunted by death. There aren't many people in Mike Watt's photographs so maybe that's why they seem haunted rather by life — the large operations of man around the harbor and the smaller scale activity of wildlife that puts up with them. Mike is out at sun-up and getting to see SoCal's lands end from his kayak is an unearned privilege, the best kind a book can deliver. Paired with excerpts from his journal which catch him rolling across the continents as a working musician gives a ­precise idea what besides exercise Mike gets out of it.\" - Joe Carducci\" Mike Watt is poetry. He's like one half of a metaphor. Watt can only be matched in poetry. When you mix pirate, Pedro pix, music, d. boon forever, hard work, weird sincerity, good will, curiosity, love, and an adult moustache, what do you have? Poetry is the answer. ­Poetry poetry poetry. Watt Watt Watt!\" - Richard HellReviewsThe LA Review of Books‘ Craig Hubert offers a keen and insightful review of “Mike On and Off Bass” in this week’s edition. Hubert notes, “[Watt] has a keen eye for capturing unexpected disruptions within seemingly normal, even mundane situations. . . Loss is prevalent throughout “On and Off Bass,” but it is undercut with hope; there is always the sustaining reservoir of inspiration — from Boon, from music, from San Pedro itself — to dip back into. It’s the same reservoir that John Coltrane described in a 1966 interview with Nat ‘There is never any end. There are always new sounds to imagine, new feelings to get at.’”Rick Moody‘s extensive interview with Mike Watt on TheRumpus.Net is an essential read for fans of the legendary punk rock bass player, photographer, poet and writer. It starts with major props for the Three Rooms Press book “Mike On and Bass,” which Moody notes, “As with everything that Watt has turned his attention to since he began making art in 1980, On and Off Base is sincere, funny, handmade, beautiful, totally idiosyncratic, and entirely original.”MTV Hive writer Austin L. Ray is impressed with the econo nature of the new Three Rooms Press book, “Mike On and Off Bass” by the legendary punk bassist. The book features photos from Watt’s gallery show at Track 16 in Santa Monica, juxtaposed with poetry, reflections and diary snippet from Watt’s massive 1,500 page collection of musings on Hootpage.com. The article features Watt discussing the origins of some of the photos in the book.The New Yorker loves “Mike On and Off Bass”, calling it an “unusual and beautiful photographic memoir.”LA Weekly writer Nicholas Pell interviews Mike Watt, revealing exclusive photos from the new book “Mike On and Off Bass.” Pell raves, “His skill lies not in classical composition — although photo nerds will nonetheless find plenty to like in the book. Rather, Watt’s strength comes from his ability to capture everyday scenes. His pictures make the mundane into the sublime.”Rockerzine writer Katy Dang raves about “Mike On and Off Bass,” noting that through the photos and text, “Watt brings his world and his experiences into focus, sharing them unabashedly with whoever chooses to come on board. He brings the past into the present, never merely resting on his laurels and always missing D. Boon, his missing friend.”Greg Barbrick, on blogcritics.com says it’s a “collection that rewards repeated viewings and is very well crafted.”",
  "genres": [
    "Photography",
    "Music",
    "Nonfiction"
  ],
  "author": "Mike Watt",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/13649072-on-and-off-bass"
}