{
  "title": "An Arizona Tragedy: A Bailey Crane Mystery",
  "description": "Meet Bailey Crane, a son of the south, now firmly transplanted in Phoenix, Arizona. Bailey is six feet tall, one hundred eighty-five pounds, a ruggedly good looking guy in the mold of a young Christopher Plummer, the \"Sound of Music\" gentleman. Bailey has just enough nuance in his charming southern manners and speech to make him appealing to most, perhaps a bit flamboyant for some. He's got a soft manufacturing rep business that brings in easy money. He's an actor on the local and regional scene, doing television commercials, print modeling, and some theater. He's a private investigator for a few attorney friends in town, and, a former cop, he is an auxiliary detective for the Phoenix PD. Bailey has love, friends, golf, and a bon vivant life style. For the most part the man is a crusader without a cape and has life just about where he wants it. In \"An Arizona Tragedy\" Bailey Crane's life takes a perilous and tumultuous twist when a young lady friend is brutally murdered in the Arizona desert. The friend, a twenty-six year old single mother and model, goes missing for weeks, is then found in a desert arroyo just northeast of Scottsdale, her skull crushed, her body ravaged and unrecognizable. Working privately on an estate matter for one of his attorney friends, Bailey finds the name of his lady friend's boyfriend. The discovery does not necessarily have great significance but it does start the wheels turning in the mind of our southern sleuth. Bailey becomes a target for an unknown pursuer and ends up battered, bruised, and angry. His strong feeling of hostility pushes him deeper into his friend's murder, and, finding a possible connecting link, he travels to Washington, D. C., to the hallowed halls and offices of the nation's lawmakers. At his hotel across the Potomac the unknown assassin strikes again, this time wounding our noble protagonist. The bad guy gets away, and Bailey has a temporary stay in a Reston, Virginia hospital. Through more ironic turns and twists Bailey goes on to solve not only his friend's homicide but another brutal slaying in the nation's capital. With the help of his PPD buddies, and, one very special female cop, the bad guy behind the gruesome killings is caught. The climatic ending scene in this Bailey Crane caper is nail biting tense and will keep the readers riveted to their seats of choice. \"An Arizona Tragedy\" was inspired by two actual homicides. The Phoenix slaying of the young mother and model has never been solved. With the decomposition of the body, accelerated by the desert's extreme heat and denizens of the habitat, evidence was scarce. This Phoenix murder was also very personal for the author … he was a friend of the real murder victim. While \"An Arizona Tragedy\" was written to be commercially acceptable and successful, the author also wanted it to be a token of remembrance.",
  "genres": [
    "Mystery"
  ],
  "author": "Billy Ray Chitwood",
  "average_rating": "4.73",
  "url": "https://www.goodreads.com/book/show/13649282-an-arizona-tragedy"
}