{
  "title": "The Little Lame Prince",
  "description": "This is a pre-1923 historical reproduction that was curated for quality. Quality assurance was conducted on each of these books in an attempt to remove books with imperfections introduced by the digitization process. Though we have made best efforts - the books may have occasional errors that do not impede the reading experience. We believe this work is culturally important and have elected to bring the book back into print as part of our continuing commitment to the preservation of printed works worldwide.Yes, he was the most beautiful Prince that ever was born. Of course, being a prince, people said that; but it was true besides.The Prince's christening was to be a grand affair. By six in the morning all the royal household had dressed itself in its very best; and then the little Prince was dressed in his best - his magnificent christening-robe; which proceeding his Royal Highness did not like at all, but kicked and screamed like any common baby.In truth, though very few knew, the Prince in coming to the chapel had met with a slight disaster. His nurse - not his ordinary one, but the state nurse-maid - an elegant and fashionable young lady of rank, whose duty it was to carry him to and from the chapel, had been so occupied in arranging her train with one hand, while she held the baby with the other, that she stumbled and let him fall, just at the foot of the marble staircase. To be sure, she contrived to pick him up again the next minute; and the accident was so slight it seemed hardly worth speaking of. Consequently nobody did speak of it. The baby had turned deadly pale, but did not cry, so no person a step or two behind could discover anything wrong; afterward, even if he had moaned, the silver trumpets were loud enough to drown his voice. It would have been a pity to let anything trouble such a day of felicity.",
  "genres": [
    "Fantasy",
    "Classics",
    "Fiction",
    "Childrens",
    "Young Adult",
    "Middle Grade",
    "Fairy Tales"
  ],
  "author": "Dinah Maria Mulock Craik",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/136508.The_Little_Lame_Prince"
}