{
  "title": "The Silver Spoon",
  "description": "The Silver Spoon is the most influential and successful cookbook in Italy. Originally published in 1950, it became an instant classic. Considered to be essential in every household, it is still one of the most popular wedding presents today. The Silver Spoon was conceived and published by Domus, the design and architectural magazine famously directed by Giò Ponti from the 1920's to the 1970's. A group of cooking experts was commissioned to collect hundreds of traditional recipes from the different Italian regions and make them available for the first time to a wider audience. In the process, they updated ingredients, quantities and methods to suit contemporary tastes and customs, at the same time preserving the memory of ancient recipes for future generations. They also included modern recipes from some of the most famous Italian chefs, resulting in a style of cooking that appeals to the gourmet as well as the occasional cook A comprehensive and lively book, its simple and user-friendly format makes it both accessible and a pleasure to read. It provides an introduction to every course, and an explanation of the main type of ingredients. Never translated before, The Silver Spoon has now been adapted to an international market, with every recipe checked for suitability, measurements converted and methods rewritten to accommodate cultural differences, yet maintaining the authenticity of real Italian cooking. The new layout emphasizes its contemporary appeal and the colour coding of each section simplifies the process of cross-referencing ingredients and methods. A section with original menus from the 15 most famous Italian chefs of the last 50 years has been expanded to include original menus from Italian celebrity chefs working outside Italy. This is a substantial and prestigious cookbook that will share the bookshelves with other titles such as The Joy of Cooking and Larousse Gastronomique, another classic of national cuisine. With over 2,000 recipes illustrated with specially commissioned artwork and photography, the book is destined to become a classic in the Italian cooking booklist for the international market.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction",
    "Reference",
    "Culinary",
    "Italian Literature"
  ],
  "author": "Clelia D'Onofrio",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/136599.The_Silver_Spoon"
}