{
  "title": "Rich Pickings for Ravens",
  "description": "Set in an askew, but modern-day London, Rich Pickings for Ravens is Part One of The Afterlife Crisis Trilogy. This quirky, humorous and philosophical tale centres on the afterlife journey of one Midnight Merlot, a ghost who really doesn’t believe in ghosts, at least until becoming one. In fact, our leading ghoul soon has all manner of concerns to contend with, as in the classic detective mould the rather forgetful phantom must tackle two cases of inquiry; namely, his questionable relationship past and the even more mysterious circumstances surrounding his somewhat curious death. In doing so, all the big questions are addressed: What awaits us in the hereafter? Is there a God up above? What allows a ghost to fall through a bed, yet not the very Earth? What songs would you play at your own “humanist” funeral? Would your ex-girlfriends see fit to attend your “humanist” funeral? And what exactly happens at a bukkake party?!What others have to say...?(Mike Robinson, author of Skunk Ape Semester)“What might've happened had P.G. Wodehouse written with the sensibilities of Edgar Allen Poe? Or vice versa? We might've gotten something like \"Rich Pickings for Ravens\", a dry-wit \"tour\" of the afterlife that confirms simultaneously our hopes as well as our fears: yes, there is an afterlife, but also, yes, it's still this life. Just with considerably less meat.” (Becky Shepherd, writer for The Indie Pedant)\"Midnight Merlot is dead, yet how he came to be wandering the streets of London as a ghost, he's somewhat unsure about. As it turns out, he's rather unsure of a lot of other things about his past life too. Meanwhile, Detective Eccles is being hassled from his nitwit superior, but something doesn't feel right about a so-called accidental death... Cue lots of amusing and rather touching attempts to find out exactly how and why a young not-so-man-about-town found himself on the wrong end of a... banana skin?\"",
  "genres": [],
  "author": "Tom Conrad",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/13665237-rich-pickings-for-ravens"
}