{
  "title": "Also sprach Zarathustra. Ein Buch für Alle und Keinen",
  "description": "Gott ist tot. Und die Menschen haben es noch nicht bemerkt? Die Religion? Ein Götzendienst in einer sinnentleerten Welt. Was ist schon gut und böse, wenn das oberste Ziel des Lebens in der Relativität der Werte versinkt? Zarathustra ist der Verkünder des neuen Heils: \"Ich will die Menschen den Sinn ihres Seins lehren -- welcher ist der Übermensch.\" Jenes vollkommene Wesen, \"rechtwinklig an Geist und Seele\", das die Kranken und Schwachen verachtet, die moralinsauren Spießbürger, deren neuer Götze der Staat ist, die Asketen, die ihren Leidenschaften nur das Deckmäntelchen der Tugend überstreifen. Wie Blitze lässt Zarathustra seine Wut, seine Provokation und seine Polemik hernieder fahren auf das Volk.Reden sind dazu gemacht, gehört zu werden. In der Rede erlangen die Worte, die Nietzsche dem Weltverbesserer Zarathustra in den Mund legt, ihre ganze Kraft. Peter Wapnewski, Professor der Deutschen Literatur -- ein Könner wahrlich in der Kunst des Rezitierens -- lässt sich ein auf die Dichte des Textes. Ein zweifelndes Zögern, ein Schneiden der Stimme, ein Moment atemloser Stille, bevor ein neues Gewitter aus Zorn und Begeisterung gleichermaßen auf den Hörer hernieder fährt. Eindringlich und lebendig ist die Vertonung der drei ersten und wichtigsten Reden Zarathustras aus Nietzsches zentralem Werk.Doch was gilt schon der Prophet im eigenen Land? \"Damals trugst du deine Asche zu Berge, willst du heute dein Feuer in die Täler tragen\", ruft der Gläubige Zarathustra zu, als der nach 10-jähriger Einsiedelei zu den Menschen zurückkehren will, \"fürchtest Du nicht des Brandstifters Strafen?\" Nietzsche ist nicht Zarathustra und doch hat auch er vom geistigen Brandstifter über den Jugendverderber bis zum geisteskranken Wirrkopf fast jeden Titel getragen. Der geistige Missbrauch durch die Nationalsozialisten hat seine Spuren hinterlassen. Trotz allem lohnt sich die Wiederentdeckung Nietzsches. Die Vertonung von Peter Wapnewski eröffnet Kennern eine neue Dimension und bringt Ersthörer auf einen guten Weg. --Cornelia Eulitz --",
  "genres": [
    "Philosophy",
    "Classics",
    "Nonfiction",
    "German Literature",
    "Literature",
    "Psychology",
    "Religion"
  ],
  "author": "Friedrich Nietzsche",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/1366908.Also_sprach_Zarathustra_Ein_Buch_f_r_Alle_und_Keinen"
}