{
  "title": "The Last Flight of the Scarlet Macaw: One Woman's Fight to Save the World's Most Beautiful Bird",
  "description": "“The first time we came here I didn’t know what to expect,” she told me as we paddled upstream. “What we found just blew me away. Jaguars, pumas, river otters, howler monkeys. The place was like a Noah’s Ark for all the endangered species driven out of the rest of Central America. There was so much life! That expedition was when I first saw the macaws.”As a young woman, Sharon Matola lived many lives. She was a mushroom expert, an Air Force survival specialist, and an Iowa housewife. She hopped freight trains for fun and starred as a tiger tamer in a traveling Mexican circus. Finally she found her one true calling: caring for orphaned animals at her own zoo in the Central American country of Belize.Beloved as “the Zoo Lady” in her adopted land, Matola became one of Central America’s greatest wildlife defenders. And when powerful outside forces conspired with the local government to build a dam that would flood the nesting ground of the last scarlet macaws in Belize, Sharon Matola was drawn into the fight of her life.In The Last Flight of the Scarlet Macaw, award-winning author Bruce Barcott chronicles Sharon Matola’s inspiring crusade to stop a multinational corporation in its tracks. Ferocious in her passion, she and her confederates–a ragtag army of courageous locals and eccentric expatriates–endure slander and reprisals and take the fight to the courtroom and the boardroom, from local village streets to protests around the world.As the dramatic story unfolds, Barcott addresses the realities of economic survival in Third World countries, explores the tension between environmental conservation and human development, and puts a human face on the battle over globalization. In this marvelous and spirited book, Barcott shows us how one unwavering woman risked her life to save the most beautiful bird in the world.",
  "genres": [
    "Nonfiction",
    "Animals",
    "Nature",
    "Birds",
    "Science",
    "Travel",
    "History"
  ],
  "author": "Bruce Barcott",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/1367587.The_Last_Flight_of_the_Scarlet_Macaw"
}