{
  "title": "The Rise of Liberal Religion: Book Culture and American Spirituality in the Twentieth Century",
  "description": "Winner of the Frank S. and Elizabeth D. Brewer Best First Book Prize of the American Society of Church HistorySociety for U. S. Intellectual History Notable Title in American Intellectual HistoryThe story of liberal religion in the twentieth century, Matthew S. Hedstrom contends, is a story of cultural ascendency. This may come as a surprise-most scholarship in American religious history, after all, equates the numerical decline of the Protestant mainline with the failure of religious liberalism. Yet a look beyond the pews, into the wider culture, reveals a more complex and fascinating story, one Hedstrom tells in The Rise of Liberal Religion .Hedstrom attends especially to the critically important yet little-studied arena of religious book culture-particularly the religious middlebrow of mid-century-as the site where religious liberalism was most effectively popularized. By looking at book weeks, book clubs, public libraries, new publishing enterprises, key authors and bestsellers, wartime reading programs, and fan mail, among other sources, Hedstrom is able to provide a rich, on-the-ground account of the men, women, and organizations that drove religious liberalism's cultural rise in the 1920s, 1930s, and 1940s. Critically, by the post-WWII period the religious middlebrow had expanded beyond its Protestant roots, using mystical and psychological spirituality as a platform for interreligious exchange. This compelling history of religion and book culture not only shows how reading and book buying were critical twentieth-century religious practices, but also provides a model for thinking about the relationship of religion toconsumer culture more broadly. In this way, The Rise of Liberal Religion offers both innovative cultural history and new ways of seeing the imprint of liberal religion in our own times.",
  "genres": [
    "Nonfiction",
    "Theology"
  ],
  "author": "Matthew S. Hedstrom",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/13687246-the-rise-of-liberal-religion"
}