{
  "title": "Bullsh*t or Fertilizer",
  "description": "Ever get tired of having the same conversation over and over again, just talking or thinking about what needs to be done instead of getting motivated to act? This book is for anyone who needs a heaping dose of momentum and focus, and who better to dish out such advice than Pierre Bennu, an award-winning filmmaker and artist who's had such conversations countless times? This page-turner is the perfect companion for those times you need a little motivation, whether you're on a bus ride or a train trip, or standing in line for four hours to audition for the second feline from the right in CATS. It tells you how to get started and shows you how to make and attain goals-and it contains some of the best advice ever on making contacts and selling yourself or your creation. Teachers, singers, writers, astrologers, actors, painters, and anyone longing to create will benefit from the conversational advice in this little book. The author and title make no You can either use the book to help you grow, or . . . you get the picture. Ever get tired of having the same conversation over and over again, just talking or thinking about what needs to be done instead of getting motivated to act? This book is for anyone who needs a heaping dose of momentum and focus, and who better to dish out such advice than Pierre Bennu, an award-winning filmmaker and artist who's had such conversations countless times? This page-turner is the perfect companion for those times you need a little motivation, whether you're on a bus ride or a train trip, or standing in line for four hours to audition for the second feline from the right in CATS. It tells you how to get started and shows you how to make and attain goals-and it contains some of the best advice ever on making contacts and selling yourself or your creation. Teachers, singers, writers, astrologers, actors, painters, and anyone longing to create will benefit from the conversational advice in this little book. The author and title make no You can either use the book to help you grow, or . . . you get the picture.",
  "genres": [
    "Reference"
  ],
  "author": "Pierre Bennu",
  "average_rating": "4.62",
  "url": "https://www.goodreads.com/book/show/1368417.Bullsh_t_or_Fertilizer"
}