{
  "title": "Tales from a Revolution: Bacon's Rebellion and the Transformation of Early America",
  "description": "In the spring of 1676, Nathaniel Bacon, a hotheaded young newcomer to Virginia, led a revolt against the colony's Indian policies. Bacon's Rebellion turned into a civil war within Virginia--and a war of extermination against the colony's Indian allies--that lasted into the following winter, sending shock waves throughout the British colonies and into England itself. James Rice offers a colorfully detailed account of the rebellion, revealing how Piscataways, English planters, slave traders, Susquehannocks, colonial officials, plunderers and intriguers were all pulled into an escalating conflict whose outcome, month by month, remained uncertain. In Rice's rich narrative, the lead characters come to life: the powerful, charismatic Governor Berkeley, the sorrowful Susquehannock warrior Monges, the wiley Indian trader and tobacco planter William Byrd, the regal Pamunkey chieftain Cockacoeske, and the rebel leader himself, Nathaniel Bacon. The dark, slender Bacon, born into a prominent family, soon earned a reputation in America as imperious, ambitious, and arrogant. But the colonial leaders did not foresee how rash and headstrong Nathaniel Bacon could be, nor how adept he would prove to be at both inciting colonists and alienating Indians. As the tense drama unfolds, it becomes apparent that the struggle between Governor Berkeley and the impetuous Bacon is nothing less than a battle over the soul of America. Bacon died in the midst of the uprising and Governor Berkeley shortly afterwards, but the profoundly important issues at the heart of the rebellion took another generation to resolve. The late seventeenth century was a pivotal moment in American history, full of upheavals and far-flung conspiracies. Tales From a Revolution brilliantly captures the swirling rumors and central events of Bacon's Rebellion and its aftermath, weaving them into a dramatic tale that is part of the founding story of America.",
  "genres": [
    "History",
    "American History",
    "Nonfiction",
    "The United States Of America"
  ],
  "author": "James D. Rice",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/13687294-tales-from-a-revolution"
}