{
  "title": "Free Will and Modern Science",
  "description": "Do humans have a free choice of which actions to perform? Three recent developments of modern science can help us to answer this question. First, new investigative tools have enabled us to study the processes in our brains which accompanying our decisions. The pioneer work of Benjamin Libet has led many neuroscientists to hold the view that our conscious intentions do not cause our bodily movements but merely accompany them. Then, Quantum Theory suggests that not all physical events are fully determined by their causes, and so opens the possibility that not all brain events may be fully determined by their causes, and so maybe - if neuroscience does not rule this out - there is a role for intentions after all. Finally, a theorem of mathematics, Godel's theory, has been interpreted to suggest that the initial conditions and laws of development of a mathematician's brain could not fully determine which mathematical conjectures he sees to be true. Papers by Patrick Haggard, TimBayne, Harald Atmanspacher and Stefan Rotter, Solomon Feferman, and John Lucas investigate these issues.The extent to which human behaviour is determined by brain events may well depend on whether conscious events, such as intentions, are themselves merely brain events, or whether they are separate events which interact with brain events (perhaps in the radical form that intentions are events in our soul, and not in our body). The papers of Frank Jackson, Richard Swinburne, and Howard Robinson investigate these issues.The remaining papers, of Galen Strawson, Helen Steward, and R.A. Duff, consider what kind of free will we need in order to be morally responsible for our actions or to be held guilty in a court of law. Is it sufficient merely that our actions are uncaused by brain events, or what?",
  "genres": [],
  "author": "Richard Swinburne",
  "average_rating": "3.40",
  "url": "https://www.goodreads.com/book/show/13687634-free-will-and-modern-science"
}