{
  "title": "Black Flame: The Revolutionary Class Politics of Anarchism and Syndicalism",
  "description": "Black Flame is the first of two volumes that reexamine anarchism’s democratic class politics, its vision of a decentralized planned economy, and its impact on popular struggles in five continents over the last 150 years. From the nineteenth century to today’s anticapitalist movements, it traces anarchism’s lineage and contemporary relevance. It outlines anarchism’s insights into questions of race, gender, class, and imperialism, significantly reframing the work of previous historians on the subject, and critiquing Marxist and nationalist approaches to those same questions.Lucien van der Walt teaches at the University of the Witwatersrand, Johannesburg.Michael Schmidt is a Johannesburg-based senior investigative journalist.Recent praise for Black Flame:“A book with a deeply impressive quality of research, analysis and writing, this very important and much-needed work is an unexpected delight and an excellent piece of work”. —Mark Leier, Simon Fraser University, author of Bakunin: the creative passion“An enjoyable read, from which I have learnt a great deal—fascinating, revealing and often startling. Thanks to both and each of you”. —Alan Lipman, anti-apartheid activist and exile, author of On the Outside Looking In: colliding with apartheid and other authorities“A useful and insightful treatment of one of the most fascinating alternatives to industrial capitalism and the modern nation state. At the heart of their scholarship is an effort to provide clarity to a much maligned and misunderstood movement and also to examine it as a social history of ideas that percolated from below as well as directed from above by intellectual giants. The authors are careful to present their analysis in a jargon-free language. Readers will be introduced to influential historical actors from across the globe. A grand work of synthesis. An excellent starting point”. —Greg Hall, Western Illinois University, author of Harvest Wobblies: The Industrial Workers of the World and Agricultural Laborers in the American West, 1905–1930, in WorkingUSA“Brilliant, a really wonderful book and an outstanding contribution to anarchist theory and history. What does Black Flame get right? Well, almost everything! It is comprehensive, discussing all important issues, people and movements, and the authors do a great job in discussing the ins and outs of our movement and theory, using history to illuminate the ideas and show how they were applied in practice. Do yourself a favour and buy it now! You won’t be disappointed”. —Iain McKay, author of The Anarchist FAQ, volume 1“Black Flame is an outstanding contribution to a modern anarchist perspective. Its view is focused on the working class but also supportive of every struggle against oppression. Besides covering the major controversies within historical anarchism in a fair way, it is particularly unique in examining anarchism from a worldwide perspective instead of looking at it only from a west European angle. I learned a good deal from reading it, and think others will also”. —Wayne Price, author of The Abolition of the State: anarchist and Marxist perspectives“This book fulfills a daunting task. Covering anarchism in all parts of the world and emphatically tying it to class struggle, the authors present a highly original and challenging account of the movement, its actions and ideas. This work is a must for everybody interested in nonauthoritarian social movements”. —Bert Altena, Rotterdam University, author of Piet Honig, Herinneringen van een Rotterdamse revolutionair",
  "genres": [
    "Politics",
    "Philosophy",
    "History",
    "Nonfiction",
    "Anarchism",
    "Political Science",
    "Race"
  ],
  "author": "Michael   Schmidt",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/1368756.Black_Flame"
}