{
  "title": "The Weight of Vengeance: The United States, the British Empire, and the War of 1812",
  "description": "In early 1815, Secretary of State James Monroe reviewed the treaty with Britain that would end the War of 1812. The United States Navy was blockaded in port; much of the army had not been paid for nearly a year; the capital had been burned. The treaty offered an unexpected escape from disaster. Yet it incensed Monroe, for the name of Great Britain and its negotiators consistently appeared before those of the United States. \"The United States have acquired a certain rank amongst nations, which is due to their population and political importance,\" he brazenly scolded the British diplomat who conveyed the treaty, \"and they do not stand in the same situation as at former periods.\"Monroe had a point, writes Troy Bickham. In The Weight of Vengeance , Bickham provides a provocative new account of America's forgotten war, underscoring its significance for both sides by placing it in global context. The Napoleonic Wars profoundly disrupted the global order, from India to Haiti to New Orleans. Spain's power slipped, allowing the United States to target the Floridas; the Haitian slave revolt contributed to the Louisiana Purchase; fears that Britain would ally with Tecumseh and disrupt the American northwest led to a pre-emptive strike on his people in 1811. This shifting balance of power provided the United States with the opportunity to challenge Britain's dominance of the Atlantic world. And it was an important conflict for Britain as well. Powerful elements in the British Empire so feared the rise of its former colonies that the British government sought to use the War of 1812 to curtail America's increasing maritime power and its aggressive territorialexpansion. And by late 1814, Britain had more men under arms in North America than it had in the Peninsular War against Napoleon, with the war with America costing about as much as its huge subsidies to European allies.Troy Bickham has given us an authoritative, lucidly written global account that transforms our understanding of this pivotal war.",
  "genres": [
    "History",
    "American History",
    "Nonfiction",
    "War",
    "Military History",
    "Naval History"
  ],
  "author": "Troy Bickham",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/13687333-the-weight-of-vengeance"
}