{
  "title": "The Emergent Multiverse: Quantum Theory according to the Everett Interpretation",
  "description": "The Emergent Multiverse presents a striking new account of the \"many worlds\" approach to quantum theory. The point of science, it is generally accepted, is to tell us how the world works and what it is like. But quantum theory seems to fail to do this: taken literally as a theory of the world, it seems to make crazy claims: particles are in two places at once; cats are alive and dead at the same time. So physicists and philosophers have often been led either to give up on the idea that quantum theory describes reality, or to modify or augment the theory. The Everett interpretation of quantum mechanics takes the apparent craziness seriously, and asks, \"what would it be like if particles really were in two places at once, if cats really were alive and dead at the same time?\" The answer, it turns out, is that if the world were like that--if it were as quantum theory claims--it would be a world that, at the macroscopic level, was constantly branching into copies--hence the more sensationalist name for the Everett interpretation, the \"many worlds theory.\" But really, the interpretation is not sensationalist at all: it simply takes quantum theory seriously, literally, as a description of the world. Once dismissed as absurd, it is now accepted by many physicists as the best way to make coherent sense of quantum theory. David Wallace offers a clear and up-to-date survey of work on the Everett interpretation in physics and in philosophy of science, and at the same time provides a self-contained and thoroughly modern account of it--an account which is accessible to readers who have previously studied quantum theory at undergraduate level, and which will shape the future direction of research by leading experts in the field.",
  "genres": [
    "Physics",
    "Science",
    "Philosophy",
    "Nonfiction",
    "Quantum Mechanics",
    "Astronomy",
    "Textbooks"
  ],
  "author": "David     Wallace",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/13688768-the-emergent-multiverse"
}