{
  "title": "Colonial America: A Very Short Introduction",
  "description": "In the traditional narrative of American colonial history, early European settlements, as well as native peoples and African slaves, were treated in passing as unfortunate aberrations in a fundamentally upbeat story of Englishmen becoming freer and more prosperous by colonizing an abundant continent of \"free land.\"Over the last generation, historians have broadened our understanding of colonial America by adopting both a trans-Atlantic and a trans-continental perspective, examining the interplay of Europe, Africa, and the Americas through the flow of goods, people, plants, animals, capital, and ideas. In this Very Short Introduction , Alan Taylor presents an engaging overview of the best of this new scholarship. He shows that American colonization derived from a global expansion of European exploration and commerce that began in the fifteenth century. The English had to share the stage with the French, Spanish, Dutch, and Russians, each of whom created alternative Americas. By comparing the diverse colonies of rival empires, Taylor recovers what was truly distinctive about the English enterprise in North America. He focuses especially on slavery as central to the economy, culture, and political thought of the colonists and restores the importance of native peoples to the colonial story. To adaptto the new land, the colonists needed the expertise, guidance, alliance, and trade of the Indians who dominated the interior. This historical approach emphasizes the ability of the diverse natives to adapt to the newcomers and to compel concessions from them.This Very Short Introduction describes an intermingling of cultures and of microbes, plants, and animals--from different continents that was unparalleled in global history.Oxford's Very Short Introductions series offers concise and original introductions to a wide range of subjects--from Islam to Sociology, Politics to Classics, Literary Theory to History, and Archaeology to the Bible. Not simply a textbook of definitions, each volume in this series provides trenchant and provocative--yet always balanced and complete--discussions of the central issues in a given discipline or field. Every Very Short Introduction gives a readable evolution of the subject in question, demonstrating how the subject has developed and how it has influenced society. Eventually, the series will encompass every major academic discipline, offering all students an accessible and abundant reference library. Whatever the area of study that one deems important or appealing, whatever the topic that fascinates the general reader, the Very Short Introductions series has a handy and affordable guide that will likely prove indispensable.",
  "genres": [
    "History",
    "American History",
    "Nonfiction",
    "Audiobook",
    "Politics",
    "College",
    "School"
  ],
  "author": "Alan Taylor",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/13689979-colonial-america"
}