{
  "title": "The Chinatown War: Chinese Los Angeles and the Massacre of 1871",
  "description": "In October 1871, a simmering, small-scale turf war involving three Chinese gangs exploded into a riot that engulfed the small but growing town of Los Angeles. A large mob of white Angelenos, spurred by racial resentment, rampaged through the city and lynched some 18 people before order was restored.In The Chinatown War , Scott Zesch offers a compelling account of this little-known event, which ranks among the worst hate crimes in American history. The story begins in the 1850s, when the first wave of Chinese immigrants arrived in Los Angeles in the wake of the 1849 California gold rush. Upon arrival, these immigrants usually took up low-wage jobs, settled in the slum neighborhood of the Calle de los Negros, and joined one of a number of Chinese community associations. Though such associations provided job placement and other services to their members, they were also involved in extortion and illicit businesses, including prostitution. In 1870 the largest of these, the See-Yup Company, imploded in an acrimonious division. The violent succession battle that ensued, as well as the highly publicized torture of Chinese prostitute Sing-Ye, eventually provided the spark for the racially motivated riot that ripped through L.A. Zesch vividly evokes the figures and events in the See-Yupdispute, deftly situates the riot within its historical and political context, and illuminates the workings of the early Chinese-American community in Los Angeles, while simultaneously exploring issues that continue to trouble Americans today.Engaging and deeply researched, The Chinatown War above all delivers a riveting story of a dominant American city and the darker side of its early days that offers powerful insights for our own time.",
  "genres": [
    "History",
    "Nonfiction",
    "True Crime",
    "China",
    "American History",
    "Social Justice",
    "Adult"
  ],
  "author": "Scott Zesch",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/13689945-the-chinatown-war"
}