{
  "title": "The Civil War at Sea",
  "description": "Continuing in the vein of his Lincoln Prize-winning book Lincoln and His Admirals, acclaimed naval historian Craig L. Symonds presents a masterful history of the Civil War navies--both Union and Confederate--and places them within the broader context of the emerging industrial age.Symonds begins with an account of the dramatic pre-war revolution in naval technology--the advent of steam propulsion, the screw propeller, and larger and more powerful rifled guns that could fire explosive shells as well as solid shot. These extraordinary changes were epitomized in the famous \"Battle of the Ironclads\"--one of the great stories of the Civil War--pitting USS Monitor against the larger and more heavily armed CSS Virginia (also known as Merrimack). Symonds also offers an overview of Lincoln's blockade of the South, a vast campaign involving as many as 500 ships and 100,000 men; discusses the fierce naval war for control of the rivers in the West; and looks at the important siege of Charleston, which would last three years and involve 40,000 men and sixty warships. Symonds concludes with three key episodes from the end of the war--the dramatic Battle of Mobile Bay, where Farragut delivered his famous cry: \"Damn the torpedoes! Full speed ahead!\"; the battle of Wilmington, where combined naval and army forces successfully overran Fort Fisher, a giant earthwork fort called by one historian \"the mightiest fortress in America\"; and the remarkable cruise of the CSS Shenandoah, a round-the-world voyage of 58,000 miles, during which she captured thirty-eight prizes--mostly after Lee had surrendered, alas.The Civil War at Sea illuminates a little-discussed and greatly undervalued aspect of America's national conflict. Concise yet comprehensive, this volume is a lively addition to the field of naval history.",
  "genres": [
    "Civil War",
    "History",
    "Nonfiction",
    "American Civil War",
    "Military Fiction",
    "American History",
    "Naval History"
  ],
  "author": "Craig L. Symonds",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/13690496-the-civil-war-at-sea"
}