{
  "title": "Perceiving Reality: Consciousness, Intentionality, and Cognition in Buddhist Philosophy",
  "description": "What turns the continuous flow of experience into perceptually distinct objects? Can our verbal descriptions unambiguously capture what it is like to see, hear, or feel? How might we reason about the testimony that perception alone discloses? Christian Coseru proposes a rigorous and highly original way to answer these questions by developing a framework for understanding perception as a mode of apprehension that is intentionally constituted, pragmatically oriented, and causally effective. By engaging with recent discussions in phenomenology and analytic philosophy of mind, but also by drawing on the work of Husserl and Merleau-Ponty, Coseru offers a sustained argument that Buddhist philosophers, in particular those who follow the tradition of inquiry initiated by Dign?ga and Dharmak?rti, have much to offer when it comes to explaining why epistemological disputes about the evidential role of perceptual experience cannot satisfactorily be resolved without taking into account thestructure of our cognitive awareness.Perceiving Reality examines the function of perception and its relation to attention, language, and discursive thought, and provides new ways of conceptualizing the Buddhist defense of the reflexivity thesis of consciousness-namely, that each cognitive event is to be understood as involving a pre-reflective implicit awareness of its own occurrence. Coseru advances an innovative approach to Buddhist philosophy of mind in the form of phenomenological naturalism, and moves beyond comparative approaches to philosophy by emphasizing the continuity of concerns between Buddhist and Western philosophical accounts of the nature of perceptual content and the character of perceptual consciousness.",
  "genres": [
    "Buddhism",
    "Philosophy",
    "Religion"
  ],
  "author": "Christian Coseru",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/13690209-perceiving-reality"
}