{
  "title": "Angst: Origins of Anxiety and Depression",
  "description": "In this path-breaking volume, engagingly written for the general public, psychiatrist Jeffrey Kahn reveals that the Angst of anxiety and depression ultimately results from our transformation, over tens of thousands of years, from biologically shaped, almost herd-like prehistoric tribes, to rational and independent individuals in modern civilization. Because of our Reason, we don't choose to act like sheep.Kahn looks at five basic types of modern-day angst--Panic Anxiety, Social Anxiety, OCD, Atypical Depression, and Melancholic Depression--and shows how each derives from primeval social instincts that once helped our ancestors survive. For instance, the \"panic disorder\" which prevents some people from flying may have originally evolved to keep our tribal ancestors from traveling dangerously far from home. Likewise, the increased emotional sensitivity to social rejection that now triggers episodes of \"atypical depression\" may have helped maintain polite behavior and social harmony in our ancestors. Our distinctly human civilization and rational consciousness lets us defy these social instincts. But those over-ridden instincts can resurface as stressful emotional disorders. Kahn notes that some of us painfully tackle this distress head-on, in ways that can advance intellectual creativity, social performance and productivity. He also describes the interplay of instinct with the advance of civilization, and on how evolutionary perspective explains why modern treatments work. Ranging from Darwin and Freud to the most cutting-edge medical and scientific findings--drawing from ancient writings, modern humor and popular lyrics, and with many amusing cartoons--Angst offers us an exciting new slant on some of the most pervasive mental health issues of our time.",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Mental Health",
    "Science",
    "Self Help",
    "Health",
    "Mental Illness"
  ],
  "author": "Jeffrey P.  Kahn",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/13690123-angst"
}