{
  "title": "Articulate While Black: Barack Obama, Language, and Race in the U.S.",
  "description": "Barack Obama is widely considered one of the most powerful and charismatic speakers of our age. Without missing a beat, he often moves between Washington insider talk and culturally Black ways of speaking--as shown in a famous YouTube clip, where Obama declined the change offered to him by a Black cashier in a Washington, D.C. restaurant with the phrase, \"Nah, we straight.\"In Articulate While Black , two renowned scholars of Black Language address language and racial politics in the U.S. through an insightful examination of President Barack Obama's language use--and America's response to it. In this eloquently written and powerfully argued book, H. Samy Alim and Geneva Smitherman provide new insights about President Obama and the relationship between language and race in contemporary society. Throughout, they analyze several racially loaded, cultural-linguistic controversies involving the President--from his use of Black Language and his \"articulateness\" to his \"Race Speech,\" the so-called \"fist-bump,\" and his relationship to Hip Hop Culture.Using their analysis of Barack Obama as a point of departure, Alim and Smitherman reveal how major debates about language, race, and educational inequality erupt into moments of racial crisis in America. In challenging American ideas about language, race, education, and power, they help take the national dialogue on race to the next level. In much the same way that Cornel West revealed nearly two decades ago that \"race matters,\" Alim and Smitherman in this groundbreaking book show how deeply \"language matters\" to the national conversation on race--and in our daily lives.",
  "genres": [
    "Nonfiction",
    "Language",
    "Linguistics",
    "Politics",
    "Sociology",
    "Race",
    "Audiobook"
  ],
  "author": "H. Samy Alim",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/13690153-articulate-while-black"
}