{
  "title": "Marijuana Legalization: What Everyone Needs to Know®",
  "description": "Should marijuana be legalized? The latest Gallup poll reports that exactly half of Americans say \"yes\"; opinion couldn't be more evenly divided.Marijuana is forbidden by international treaties and by national and local laws across the globe. But those laws are under challenge in several countries. In the U.S., there is no short-term prospect for changes in federal law, but sixteen states allow medical use and recent initiatives to legalizeproduction and non-medical use garnered more than 40% support in four states. California's Proposition 19 nearly passed in 2010, and multiple states are expected to consider similar measures in the years to come.The debate and media coverage surrounding Proposition 19 reflected profound confusion, both about the current state of the world and about the likely effects of changes in the law. In addition, not all supporters of \"legalization\" agree on what it is they want to Just using marijuana?Growing it? Selling it? Advertising it? If sales are to be legal, what regulations and taxes should apply? Different forms of legalization might have very different results.Marijuana What Everyone Needs to Know® will provide readers with a non-partisan primer about the topic, covering everything from the risks and benefits of using marijuana, to describing the current laws around the drug in the U.S. and abroad. The authors discuss the likely costs andbenefits of legalization at the state and national levels and walk readers through the \"middle ground\" of policy options between prohibition and commercialized production. The authors also consider how marijuana legalization could personally impact parents, heavy users, medical users, drugtraffickers, and employers.What Everyone Needs to Know ® is a registered trademark of Oxford University Press.",
  "genres": [
    "Politics",
    "Nonfiction"
  ],
  "author": "Jonathan P. Caulkins",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/13690383-marijuana-legalization"
}