{
  "title": "Framed: America's 51 Constitutions and the Crisis of Governance",
  "description": "In his widely acclaimed volume Our Undemocratic Constitution, Sanford Levinson boldly argued that our Constitution should not be treated with \"sanctimonious reverence,\" but as a badly flawed document deserving revision. Now Levinson takes us deeper, asking what were the original assumptions underlying our institutions, and whether we accept those assumptions 225 years later.In Framed , Levinson challenges our belief that the most important features of our constitutions concern what rights they protect. Instead, he focuses on the fundamental procedures of governance such as congressional bicameralism; the selection of the President by the electoral college, or the dimensions of the President's veto power--not to mention the near impossibility of amending the United States Constitution. These seemingly \"settled\" and \"hardwired\" structures contribute to the now almost universally recognized \"dysfunctionality\" of American politics.Levinson argues that we should stop treating the United States Constitution as uniquely exemplifying the American constitutional tradition. We should be aware of the 50 state constitutions, often interestingly different--and perhaps better--than the national model. Many states have updated their constitutions by frequent amendment or by complete replacement via state constitutional conventions. California's ungovernable condition has prompted serious calls for a constitutional convention. This constant churn indicates that basic law often reaches the point where it fails and becomes obsolete. Given the experience of so many states, he writes, surely it is reasonable to believe that the U.S. Constitution merits its own updating.Whether we are concerned about making America more genuinely democratic or only about creating a system of government that can more effectively respond to contemporary challenges, we must confront the ways our constitutions, especially the United States Constitution, must be changed in fundamental ways.",
  "genres": [
    "Law",
    "Politics",
    "History",
    "Nonfiction"
  ],
  "author": "Sanford Levinson",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/13690312-framed"
}