{
  "title": "Flyin' West and Other Plays",
  "description": "“Pearl Cleage is a passionate, challenging playwright whose concerns for the species are unmistakable and profound. As a woman, as an African-American, her artistic objectivity and sensitivity to history combine with, but do not overshadow, her capacity to dig for truth and present it flat out as she sees it – with a finger snap or a shout and sometimes with a wink. Among the most satisfying roles I’ve undertaken on stage is surely Miss Leah in Flyin’ West . She brings the bushel nuggets of drama and humor that capture the ear, the heart and the imagination. She’s devilish, too.” –Academy Award® Nominee Ruby Dee“Ms. Cleage writes with amazing grace and killer instinct.” –Alvin Klein, New York Times“Pearl Cleage is a brilliant storyteller. I am always engrossed in the drama and compassion she brings to her characters. Flyin’ West , Bourbon at the Border , Blues for an Alabama Sky , Late Bus to Mecca and Chain are marvelous examples of a playwright at the top of her form, bravely moving into the new century.” –Woodie King, Jr., Producing Director, New Federal TheatrePearl Cleage’s body of work for the stage provides us with a remarkable and penetrating look at the African-American experience over the last 100 years. This volume collects her major full-length plays and one-acts, including Flyin’ West , Blues for an Alabama Sky , Bourbon at the Border , Chain and Late Bus to Mecca .PEARL CLEAGE is an Atlanta-based writer whose recent plays have premiered at The Alliance Theatre Company with subsequent productions throughout the country. Her first novel What Looks Like Crazy on an Ordinary Day was a recent Oprah’s Book Club Selection and a national bestseller. She is a former columnist of the Atlanta Tribune and a contributor to Essence Magazine .",
  "genres": [
    "Plays",
    "Drama",
    "Fiction",
    "Classics",
    "Adult",
    "Theatre"
  ],
  "author": "Pearl Cleage",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/136925.Flyin_West_and_Other_Plays"
}