{
  "title": "Knut Hamsun Remembers America: Essays and Stories, 1885-1949",
  "description": "When Americans remember him at all, they no doubt think of Knut Hamsun (1859–1952) as the author of Hunger or as the Norwegian who, along with Vidkun Quisling, betrayed his country by supporting the Nazis during World War II. Yet Hamsun, winner of the Nobel Prize in 1920 for his novel The Growth of the Soil, was and remains one of the most important and influential novelists of his time. Knut Hamsun Remembers America is a collection of thirteen essays and stories based largely on Hamsun’s experiences during the four years he spent in the United States when he was a young man. Most of these pieces have never been published before in an English translation, and none are readily available.Hamsun’s feelings about America and American ways were complex. For the most part, they were more negative than positive, and they found expression in many of his writings—directly in his reminiscences and indirectly in his fiction. In On the Cultural Life of Modern America, his first major book, he portrayed the United States as a land of gross and greedy materialism, populated by illiterates who were utterly lacking in artistic originality or refinement. Although the pieces in this collection are not all anti-American, most of them emphasize the strangeness and unpleasantness, as the author saw it, of life in what he called Yankeeland.Arranged chronologically, the pieces fall into three categories: Critical Reporting, Memory and Fantasy, and Mellow Reminiscence. The Critical Reporting section includes articles that appeared in Norwegian or Danish newspapers soon after each of Hamsun’s two visits to America and that give his views on a variety of American subjects, and includes an essay devoted to Mark Twain. Memory and Fantasy comprises narratives of life in America, most of which are presented as personal experiences but which actually are blends of fact and fiction. Mellow Reminiscence includes later and fonder recollections and impressions of the United States.The pieces in this collection provide variations on a theme that runs through much of American history—European criticism of American ways. They give vivid, at times distorted, pictures of life as it was in the United States. They tell us something about the development of the worldview of a man who became a great writer, only to jeopardize his reputation by defending the Nazi oppressors of his own people. Knut Hamsun Remembers America will appeal to anyone interested in the history of American civilization or, more specifically, in the history of anti-Americanism.",
  "genres": [
    "Essays",
    "Short Stories"
  ],
  "author": "Knut Hamsun",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/136920.Knut_Hamsun_Remembers_America"
}