{
  "title": "Bodhisattva Mind: Teachings to Cultivate Courage and Awareness in the Midst of Suffering",
  "description": "A bodhisattva is one who seeks liberation from suffering not only for themselves, but for all beings. If you were a bodhisattva, how would you respond in the face of chaos and difficulty? Is it possible to find calm in the middle of a storm?On Bodhisattva Mind, Pema Chödrön explores timeless insights and practices from the teachings of an eighth-century Buddhist classic, Shantideva's The Way of the Bodhisattva, to reveal a powerful core truth that can move us all closer to the bodhisattva ideal.An Unlikely Voice on Living a Virtuous LifeIn the eyes of his fellow Indian scholars, Shantideva seemed lazy and uninterested in his studies and was greatly resented. So they invited the young slacker to give a prestigious talk―an honor reserved for only the most realized Buddhist masters―hoping to humiliate him and force him to leave the school. Instead, he delivered the timeless jewel known today as The Way of the Bodhisattva.Paradoxically, the key to true liberation, he taught, is in taming the mind. Like a wild elephant, the distracted mind causes emotions to escalate. But if the mind is trained to be steady and open, no matter what comes at you, you will remain solid in the immediacy of your experience.On Bodhisattva Mind, Pema Chödrön leads you through an all-new series of practices inspired by Shantideva to help you \"tether\" your thoughts and emotions―not as a limiting force, but as a means to restore yourself in the freedom of the present moment.Experience the Spaciousness Available in Every MomentIf we approach the wildness of our mind like a horse whisperer using gentleness, compassion, and kindness, we return to our natural state of expansiveness that is always available to us, says Pema Chödrön. Encompassing a rich span of insights from this gifted teacher, Bodhisattva Mind shows us how to connect with the spacious, clear, and unbiased nature of our minds, and experience the joy of complete freedom.Master recordings for Bodhisattva Mind graciously provided by Great Path Tapes.Runtime: 8 hours, 7 minutes.",
  "genres": [
    "Buddhism",
    "Nonfiction",
    "Spirituality",
    "Audiobook",
    "Self Help",
    "Philosophy",
    "Religion"
  ],
  "author": "Pema Chödrön",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/136979.Bodhisattva_Mind"
}