{
  "title": "Sérial Killer",
  "description": "Ne faites pas l’erreur de croire ce que vous voyez à la télévision. Le métier de profiler a été dénaturé par les médias, journalistes, auteurs de romans à succès ou encore scénaristes de série tv. Dans la réalitéun profiler américain ne se déplace pas sur le terrain et on ne confie pas non plus à une stagiaire du FBI comme Clarice Starlight – interprétée par Jodie Foster – un dossier aussi important que celui du célèbre serial killer Hannibal Lecter dans le « Silence des Agneaux ». Non, dans quatre-vingt-dix pour cent des cas, la logique veut qu’un profiler américain travaille dans un bureau, enfermé, avec comme seuls supports à ses recherches des rapports détaillés, des photos, et toutes les pièces nécessaires qui lui permettront d’élaborer le profil psychologique du meurtrier. Je m’appelle Sarah Leary, j’ai trente-trois ans. Rien ne laissait supposer que je travaillerais un jour dans la police. A vrai dire, j’étais journaliste au San Francisco Chronicle entre 2000 et 2005. En parallèle, je poursuivais mes études de psychologie à l’université de Stanford. A la fin de mon année, j’ai rédigé une thèse sur les Serial Killer. Celle-ci a été envoyée au directeur de la police de Los Angeles et j’ai été appelée pour les aider à résoudre une première série de meurtres. Aujourd’hui, quatre ans plus tard, je suis lieutenant et travaille officiellement avec eux. J’ai ainsi aidé à l’arrestation de neuf tueurs en série (Ronald Willams, Samuel Mooney, Quentin Shiffer, Vince Logan, Nick Neilly, Martha Dostoïevskaïa, Joseph Springs, John Abigail et Scott Tremblay). Je ne suis pas à considérer comme une intervenante ni comme un psychologue privé. J’ai été assermentée, ai un bureau au sein du commissariat central de Los Angeles et mon travail est d’assister les inspecteurs qui décideront, ou non, de suivre mes conseils afin de traquer et d’arrêter ces assassins.",
  "genres": [],
  "author": "Kyrian Malone",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/10441941-s-rial-killer"
}