{
  "title": "The Lonely Hearts Beach Club",
  "description": "ONE DECKCHAIR FOR HIRE! Must good conversation, own flask, and one tried and tested tip to help a lonely heart learn to love again…Olivia ’s heart is breaking watching her mother Hattie withdraw after her husband’s sudden death. He was Hattie’s whole world and without him, she’s never been lonelier. Every morning, Hattie pulls a pair of tired old deckchairs from her equally tired-looking beach hut and places them looking out to sea. Seeing her mother sit next to the empty chair, Olivia comes up with a plan.One deckchair for hire! Must bring good conversation and have own flask.When she places the advert in the window of a local café, responses from other lonely locals looking for company start flooding in – which only makes Hattie withdraw even further. Olivia is so busy trying to bring the light back to Hattie’s life that she doesn’t notice the darkness creeping into her own. And as news of the advert spreads, Olivia realises her long-buried secret is in danger of coming to light…Can Olivia convince Hattie to let someone fill the empty deckchair and bring a smile back to Hattie’s life? And when Olivia is confronted with the demons in her past, is this her chance to finally move on – and to re-open her heart to love…?The Lonely Hearts Beach Club is an absolutely heart-warming story about the power of the mother-daughter bond, family secrets and second chances, perfect for readers who love Jojo Moyes, Faith Hogan and Sheila O’Flanagan.What readers are saying about Amy ‘ Wonderful … I literally could not put down … I loved every minute of it and I didn’t want it to end … A heartfelt and truly wonderful read. A story that you will lose yourself in.’ By the Letter Book Reviews , ⭐⭐⭐⭐⭐‘ Brilliant … I couldn’t stop reading from the beginning to the end… I loved every page .’ NetGalley reviewer, ⭐⭐⭐⭐⭐‘Started this morning and didn’t stop until I finished! Made me tear up … Heart-warming and beautiful! Fabulous story and definitely worthy of more than 5 stars .’ Goodreads reviewer, ⭐⭐⭐⭐⭐‘ Reduced me to tears … A wonderful, heart-warming, emotional and captivating read … I knew I wouldn’t be able to put it down until I’d finished… Don’t forget to keep the tissues handy!’ Stardust Book Reviews, ⭐⭐⭐⭐⭐‘ Absolutely LOVED this book!!! ’ Goodreads reviewer, ⭐⭐⭐⭐⭐‘A beautifully written heartfelt read … Makes for a truly great story that will stay with you for a long time!’ Goodreads reviewer, ⭐⭐⭐⭐⭐‘ Genuinely heart-warming … I loved everything… I cannot recommend this book to you enough… Superb!! ’ Donna’s Book Blog , ⭐⭐⭐⭐⭐‘ Grab a cup of tea (or glass of wine), a cozy shawl and a box of tissues … I loved the whole story!’ NetGalley reviewer, ⭐⭐⭐⭐⭐",
  "genres": [
    "Romance"
  ],
  "author": "Amy Miller",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/137002715-the-lonely-hearts-beach-club"
}