{
  "title": "The Luxury of Vengeance",
  "description": "Official Description: Take no prisoner. Show no mercy. Trust no soul. And vengeance shall be yours ...Prince Chien is determined to claim his birthright — the Throne of a Thousand Swords — denied by his wicked aunt, Empress Mai. He has successfully turned her two equally wicked sons, Prince Minh and Prince Tuan, into dueling each other for the throne. Hiding a vial of EverBloody, Prince Chien attempts to poison their foods at the banquet. No matter who win the duel tomorrow, both wicked princes will die.One cut to the skin, and blood will flow relentless. Prince Chien will make his aunt suffer every second in watching her beloved sons die a slow painful death. Afterward, he will take her head and the crown that sits upon it. Only then will he have successfully eliminated all the traitors who helped kill his mother and his younger sister in the palace coup thirteen years ago.Only one person stands in his way — General Bao. Prince Chien has skirted around court intrigues, planned successful assassinations, and demurred himself as a dunce prince. But love is the one thing Prince Chien never thought he would had to face. Whoever said that those who embark on a journey of revenge should dig two graves was not wise enough to realize love could do exactly the same thing. Original Prompt:Dear Author,Take no prisoner. Show no mercy. Trust no soul. And vengeance shall be yours…Photo Description: Blonde, winged man in han-style clothing, holding swordThis story was written as a part of the M/M Romance Group's \"Love is Always Write\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story.Download the story, read it online or find it in Love Is Always Write: Volume 6.",
  "genres": [
    "M M Romance",
    "Fantasy",
    "Romance",
    "Historical",
    "Short Stories",
    "M M Fantasy",
    "Military Fiction"
  ],
  "author": "Isabella Carter",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/13701038-the-luxury-of-vengeance"
}