{
  "title": "A Competitive Edge",
  "description": "Official Blurb: Fleury has just returned from studying abroad for a semester, which means campus housing is full and leaves him stuck rooming in the Track Team House with his least favorite teammate and rival, Heath. When he arrives at the house to move back in, the room is a mess and Heath is acting very strange: he's apologetic and bashful instead of the antagonistic jerk he usually is. Heath's personality switch catches Fleury off-guard in ways he doesn't want to examine. It's also too good to be true; Heath reverts to his old ways once the other team members arrive back at the house. After that, Heath runs hot and cold throughout the semester, swinging between flirty and frustrating.Then, at the first track meet of the outdoor season, Fleury makes a huge, stupid error that ends up in a twisted ankle and Heath taking his place as the anchor leg of the 'A' relay. It doesn't help matters that Heath is the only one who saw exactly what caused Fleury's accident.Fleury can't help but wonder which Heath will greet him when they return from the track meet. Will it be the rival gloating about his stupidity? Or will Heath surprise him with kindness? If he wants more than a cold shoulder, Fleury will have to take matters into his own hands.Original Prompt:Dear Author.I'm running warm up laps around the track when the shot put throwers start their practice throws. Ogling them distracts me enough that I veer off course into the hurdles. The end result is embarrassment, a sprained ankle, and losing my chance to participate in today's meet against our biggest rival. As a senior, I don't want to give up my spot, but I especially don't want to give it up to him.Since the start, we've been rivals on the track. We run the same distances and are competing with each other for spots at the starting block. But while I'm sure what relationship we have on the field, I'm less sure what we have off of it. Being forced to share a bedroom in a house with our other teammates doesn't help any. One day he's flaying me with sarcasm and the next he's gazing soulfully at me from across the room when he thinks I can't see. What's his problem? I can't figure him out. And what will happen tonight? Will he gloat about taking my spot, or surprise me by offering comfort just when I need it most?Photo Description: Two photos, each of a young man. One is tall, skinny, and pale-skinned with straight, platinum blonde, straw-like hair. He wears black skinny jeans and a tight black shirt with a V-neck and the sleeves pushed up to his elbows. The other guy is a few inches shorter, slightly more muscular and tanned, with wavy, brown hair. He wears black jeans and an open black leather vest, showing off his body.This story was written as a part of the M/M Romance Group's \"Love is Always Write\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story.Download the story, read it at the Author's website or here or find it in Love Is Always Write: Volume 2.",
  "genres": [
    "M M Romance",
    "Romance",
    "Contemporary",
    "Sports",
    "Short Stories",
    "College",
    "Enemies To Lovers"
  ],
  "author": "Adara O’Hare",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/13701840-a-competitive-edge"
}