{
  "title": "The Measure of Manhattan: The Tumultuous Career and Surprising Legacy of John Randel, Jr., Cartographer, Surveyor, Inventor",
  "description": "John Randel Jr. (1787–1865) was an eccentric and flamboyant surveyor. Renowned for his inventiveness as well as for his bombast and irascibility, Randel was central to Manhattan’s development but died in financial ruin. Telling Randel’s engrossing and dramatic life story for the first time, this eye-opening biography introduces an unheralded pioneer of American engineering and mapmaking.Charged with “gridding” what was then an undeveloped, hilly island, Randel recorded the contours of Manhattan down to the rocks on its shores. He was obsessed with accuracy and steeped in the values of the Enlightenment, in which math and science promised dominion over nature. The result was a series of maps, astonishing in their detail and precision, which undergird our knowledge about the island today. During his varied career Randel created surveying devices, designed an early elevated subway, and proposed a controversial alternative route for the Erie Canal—winning him admirers and enemies.The Measure of Manhattan is more than just the life of an unrecognized engineer. It is about the ways in which surveying and cartography changed the ground beneath our feet. Bringing Randel’s story into the present, Holloway travels with contemporary surveyors and scientists trying to envision Manhattan as a wild island once again. Illustrated with dozens of historical images and antique maps, The Measure of Manhattan is an absorbing story of a fascinating man that captures the era when Manhattan—indeed, the entire country—still seemed new, the moment before canals and railroads helped draw a grid across the American landscape.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "New York",
    "Science",
    "American History",
    "Economics"
  ],
  "author": "Marguerite Holloway",
  "average_rating": "3.31",
  "url": "https://www.goodreads.com/book/show/13707555-the-measure-of-manhattan"
}