{
  "title": "The Violin: A Social History of the World's Most Versatile Instrument",
  "description": "The life, times, and travels of a remarkable instrument and the people who have made, sold, played, and cherished it. A 16-ounce package of polished wood, strings, and air, the violin is perhaps the most affordable, portable, and adaptable instrument ever created. As congenial to reels, ragas, Delta blues, and indie rock as it is to solo Bach and late Beethoven, it has been played standing or sitting, alone or in groups, in bars, churches, concert halls, lumber camps, even concentration camps, by pros and amateurs, adults and children, men and women, at virtually any latitude on any continent. Despite dogged attempts by musicologists worldwide to find its source, the violin’s origins remain maddeningly elusive. The instrument surfaced from nowhere in particular, in a world that Columbus had only recently left behind and Shakespeare had yet to put on paper. By the end of the violin’s first century, people were just discovering its possibilities. But it was already the instrument of choice for some of the greatest music ever composed by the end of its second. By the dawn of its fifth, it was established on five continents as an icon of globalization, modernization, and social mobility, an A-list trophy, and a potential capital gain. In The Violin , David Schoenbaum has combined the stories of its makers, dealers, and players into a global history of the past five centuries. From the earliest days, when violin makers acquired their craft from box makers, to Stradivari and the Golden Age of Cremona; Vuillaume and the Hills, who turned it into a global collectible; and incomparable performers from Paganini and Joachim to Heifetz and Oistrakh, Schoenbaum lays out the business, politics, and art of the world’s most versatile instrument. 16 pages of illustrations",
  "genres": [
    "Music",
    "History",
    "Nonfiction",
    "Historical"
  ],
  "author": "David Schoenbaum",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/13707587-the-violin"
}