{
  "title": "The Science of the Art of Psychotherapy",
  "description": "The latest work from a pioneer in the study of the development of the self. Focusing on the hottest topics in psychotherapy―attachment, developmental neuroscience, trauma, the developing brain―this book provides a window into the ideas of one of the best-known writers on these topics. Following Allan Schore’s very successful books on affect regulation and dysregulation, also published by Norton, this is the third volume of the trilogy. It offers a representative collection of essential expansions and elaborations of regulation theory, all written since 2005.As in the first two volumes of this series, each chapter represents a further development of the theory at a particular point in time, presented in chronological order. Some of the earlier chapters have been re-edited: those more recent contain a good deal of new material that has not been previously published. The first part of the book, Affect Regulation Therapy and Clinical Neuropsychoanalysis, contains chapters on the art of the craft, offering interpersonal neurobiological models of the change mechanism in the treatment of all patients, but especially in patients with a history of early relational trauma. These chapters contain contributions on “modern attachment theory” and its focus on the essential nonverbal, unconscious affective mechanisms that lie beneath the words of the patient and therapist; on clinical neuropsychoanalytic models of working with relational trauma and pathological dissociation: and on the use of affect regulation therapy (ART) in the emotionally stressful, heightened affective moments of clinical enactments. The chapters in the second part of the book on Developmental Affective Neuroscience and Developmental Neuropsychiatry address the science that underlies regulation theory’s clinical models of development and psychopathogenesis. Although most mental health practitioners are actively involved in child, adolescent, and adult psychotherapeutic treatment, a major theme of the latter chapters is that the field now needs to more seriously attend to the problem of early intervention and prevention. Praise for Allan N. Schore: \"Allan Schore reveals himself as a polymath, the depth and breadth of whose reading–bringing together neurobiology, developmental neurochemistry, behavioral neurology, evolutionary biology, developmental psychoanalysis, and infant psychiatry–is staggering.\" – British Journal of Psychiatry \"Allan Schore's...work is leading to an integrated evidence-based dynamic theory of human development that will engender a rapproachement between psychiatry and neural sciences.\"– American Journal of Psychiatry \"One cannot over-emphasize the significance of Schore's monumental creative labor...Oliver Sacks' work has made a great deal of difference to neurology, but Schore's is perhaps even more revolutionary and pivotal...His labors are Darwinian in scope and import.\"– Contemporary Psychoanalysis \"Schore's model explicates in exemplary detail the precise mechanisms in which the infant brain might internalize and structuralize the affect-regulating functions of the mother, in circumscribed neural tissues, at specifiable points in it epigenetic history.\" – Journal of the American Psychoanalytic \"Allan Schore has become a heroic figure among many psychotherapists for his massive reviews of neuroscience that center on the patient-therapist relationship.\" –Daniel Goleman, author of Social Intelligence",
  "genres": [
    "Psychology",
    "Counselling",
    "Nonfiction",
    "Psychoanalysis"
  ],
  "author": "Allan N. Schore",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/13707817-the-science-of-the-art-of-psychotherapy"
}