{
  "title": "Lead Us Not",
  "description": "Official Description: When Sam and Jess set out for New York City, they were young, deeply in love, and had big dreams for the future. Four difficult years later, some of those dreams are starting to come true—but at what cost? Jess has stumbled into a fairly successful modeling career, but it feels like a consolation prize after his failed attempt at acting. He knows too his good looks will only last so long and he wants to try something else, but Sam keeps talking him out of it. Sam just landed the lead in a Broadway revival and all of his hard work is finally paying off, but lately Jess seems to be slipping away from him. Just as strains and cracks begin to show in their relationship, temptations are dangled in front of both men, but will they take the bait or will they come back to each other?Original PromptDear Author,These guys have known each other since college. They fell in love and went to New York to follow their dreams of being models and actors. They thought nothing could break them apart, but life is filled with temptations. Can these two remain true to each other or will fame tear them apart forever (please HEA story only, and I don't approve of cheating, but if it happens I hope that two lovers can find a way to resolve things).Photo Description: Black and white photo of two nude men cuddling and kissing.This story was written as a part of the M/M Romance Group's \"Love is Always Write\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story.Download the story, read it online or find it in Love Is Always Write: Volume 5.",
  "genres": [
    "M M Romance",
    "Contemporary",
    "Short Stories",
    "Romance",
    "LGBT",
    "Gay",
    "Contemporary Romance"
  ],
  "author": "Kate McMurray",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/13709846-lead-us-not"
}