{
  "title": "Native Waters: Contemporary Indian Water Settlements and the Second Treaty Era",
  "description": "Since the beginning of the reservation era, the bitter conflict between Indians and non-Indians over water rights was largely confined to the courtroom. But in the 1980s the federal government began to emphasize negotiated settlements over lawsuits, and the settlements are changing water rights in fundamental ways—not only for tribes but also for non-Indian communities that share scarce water resources with Indians. In Native Waters, Daniel McCool describes the dramatic impact these settlements are having both on Indian country and on the American West as a whole. Viewing the settlements as a second treaty era, he considers whether they will guarantee the water future of reservations—or, like treaties of old, will require tribes to surrender vast resources in order to retain a small part of their traditional homelands. As one tribal official observed, \"It's like your neighbors have been stealing your horses for many years, and now we have to sit down and decide how many of those horses they get to keep.\" Unlike technical studies of water policy, McCool's book is a readable account that shows us real people attempting to end real disputes that have been going on for decades. He discusses specific water settlements using a combination of approaches—from personal testimony to traditional social science methodology—to capture the richness, complexity, and human texture of the water rights conflict. By explaining the processes and outcomes in plain language and grounding his presentation in relevant explanations of Indian culture, he conveys the complexity of the settlements for readers from a wide range of disciplines. Native Waters illustrates how America is coming to grips with an issue that has long been characterized by injustice and conflict, seeking to enhance our understanding of the settlements in the hope that this understanding will lead to better settlements for all parties. As one of the first assessments of a policy that will have a pervasive impact for centuries to come, it shows that how we resolve Indian water claims tells us a great deal about who we are as a nation and how we confront difficult issues involving race, culture, and the environment.",
  "genres": [],
  "author": "Daniel C. McCool",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/1371763.Native_Waters"
}