{
  "title": "Teaching Tara",
  "description": "Tara is desperate. She is failing English and absolutely has to pass. If she gets anything less than a C, she’ll lose her scholarship and get kicked out of college. Only it’s finals week, so she doesn’t have much time left. She’s had a crush on her professor through the whole semester and hasn’t been able to really concentrate, not that she could ever tell him the truth.So when she shows up at his office hours, Tara is nervous but hopeful. For his part, Professor James Emerson is simply annoyed. But he listens to her and offers her a compromise. He can’t simply pass her. Doing so would be unfair to the rest of the class, but if she agrees to tutoring—a very special kind of tutoring—then he’ll consider revising her grades. Provided she can meet all of his expectations. Tara tries to agree, but James prints a contract and tells her to read it. If she agrees to his terms, then they can begin her tutoring.Tara takes the contract back to her dorm, scans it, and decides she should agree. Before she can sign though, her roommate reads through it and warns Tara that if she agrees to the contract, then she’ll be bound to obey any and every order Professor Emerson gives her. Knowing this is her only chance to stay in school, Tara signs it.She has no idea what she has agreed to.Tara shows up at her professor’s home, and he is polite and kind. But then he explains that she needs to learn to behave. She didn’t pay attention throughout the whole semester, and now that she may fail. Well, he has agreed to give her a second chance, but she needs to learn some important lessons. The first one is simple: if she’s going to act like a baby girl, then he’ll treat her like one.First, James spanks her. At first, Tara can’t believe it, but she can’t deny the truth for long, not when she’s spread over his lap and getting paddled like a naughty girl. In short order, he diapers her since she’s been acting like a baby anyway. But her regression doesn’t stop there. Each time she tries to defy him, James disciplines her further, taking away one piece of her adulthood at a time.Before long, she’ll forget all about grades and tests. She’ll be too busy begging for a change or her pacifier.Publisher's Note: Teaching Tara is a 28,000 word novella and contains explicit sexual content, graphic language, and situations that some readers may find objectionable. Age play and BDSM themes include: diapers, forced regression, dubious consent, humiliation, spanking, orgasm denial, bondage, humiliation, and other forms of punishment. This title is intended for readers over the age of 18 only.",
  "genres": [
    "Erotica",
    "BDSM"
  ],
  "author": "Devon Shire",
  "average_rating": "3.36",
  "url": "https://www.goodreads.com/book/show/13718965-teaching-tara"
}