{
  "title": "Hoffman's Creeper and Other Disturbing Tales",
  "description": "A businessman staying in a Scottish manor makes the mistake of deciding to spend the evening in the library. A group of unpopular teenage girls uses witchcraft to pursue their aims. A rich banking tycoon has forgotten his university days when he and his friends dared to imagine a world ruled by social justice and working class ideals. The estranged family of a deceased aristocrat bicker over their inheritance. A botanist’s love for his plants is unnaturally deep-rooted.“Hoffman’s Creeper and Other Disturbing Tales” is the first short story collection from Cameron Trost. It plunges the reader into a world of mystery, suspense, obsession and greed. From the Scottish highlands and the jagged peaks of the Pyrénées to the streets of Brisbane and the Australian countryside, Cameron Trost provokes the reader by ensnaring recognisable characters in disturbingly plausible situations. His writing seeks to entertain while exploring the absurdities and peculiarities of society and the human mind.What reviewers say about Hoffman's Creeper and Other Disturbing Tales:\"Cameron Trost employs a kind of failsafe twist designed to rock readers perceptions of what came before. It’s a token technique, one that other writers aspire to but which he seems to have diligently mastered.\" - Matthew Tait, dark fiction writer and reviewer for Hellnotes\"Cameron Trost understands the most important thing about writing, something that is often forgotten by rising authors as they struggle to perfect technique and style. The bottom line is: A story should make the reader want to keep reading. It should entice them. The ending should be a tasty morsel of meat dangled before a hungry predator who wants nothing more than to devour it... Rarely do I read a collection of shorts and come away saying that I enjoyed every single story. Hoffman's Creeper is most definitely worth your while!\" - Lindsey Beth Goddard, dark fiction writer and reviewer\"Each tale is written with a clear purpose, to pull you in, tell you a story, then leave you with your thoughts about it after it has finished. If you are a lover of short stories with a bit of a twist then this collection is definitely worth checking out.\" - Sharon Syleste, fiction reviewer\"Trost's tale will leave you feeling dirty!\" (The Ritual) - Shane Jiraiya Cummings, dark fiction writer and publisher\"Trost is an emerging talent from Australia, and if this short story is anything to go by he will have a lot to offer the dark fiction genre in years to come. “Hoffman’s Creeper” is reminiscent in many ways of vintage Lovecraft and is written in such a way as to keep you hooked right to the end. This could be a name to watch in the future.\" (Hoffman's Creeper) - C.M. Saunders, author and journalist. Review from Morpheus Tales",
  "genres": [
    "Horror"
  ],
  "author": "Cameron Trost",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/13722670-hoffman-s-creeper-and-other-disturbing-tales"
}