{
  "title": "Race and Manifest Destiny: Origins of American Racial Anglo-Saxonism",
  "description": "American myths about national character tend to overshadow the historical realities. Reginald Horsman’s book is the first study to examine the origins of racialism in America and to show that the belief in white American superiority was firmly ensconced in the nation’s ideology by 1850.The author deftly chronicles the beginnings and growth of an ideology stressing race, basic stock, and attributes in the blood. He traces how this ideology shifted from the more benign views of the Founding Fathers, which embraced ideas of progress and the spread of republican institutions for all. He finds linkages between the new, racialist ideology in America and the rising European ideas of Anglo-Saxon, Teutonic, and scientific ideologies of the early nineteenth century. Most importantly, however, Horsman demonstrates that it was the merging of the Anglo-Saxon rhetoric with the experience of Americans conquering a continent that created a racialist philosophy. Two generations before the “new” immigrants began arriving in the late nineteenth century, Americans, in contact with blacks, Indians, and Mexicans, became vociferous racialists.In sum, even before the Civil War, Americans had decided that peoples of large parts of this continent were incapable of creating or sharing in efficient, prosperous, democratic governments, and that American Anglo-Saxons could achieve unprecedented prosperity and power by the outward thrust of their racialism and commercial penetration of other lands. The comparatively benevolent view of the Founders of the Republic had turned into the quite malevolent ideology that other peoples could not be “regenerated” through the spread of free institutions.",
  "genres": [
    "History",
    "Race",
    "American History",
    "Nonfiction",
    "Sociology",
    "Native American",
    "The United States Of America"
  ],
  "author": "Reginald Horsman",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/137278.Race_and_Manifest_Destiny"
}