{
  "title": "The Emancipation of Europe's Muslims: The State's Role in Minority Integration",
  "description": "The Emancipation of Europe's Muslims traces how governments across Western Europe have responded to the growing presence of Muslim immigrants in their countries over the past fifty years. Drawing on hundreds of in-depth interviews with government officials and religious leaders in France, Germany, Italy, the Netherlands, the United Kingdom, Morocco, and Turkey, Jonathan Laurence challenges the widespread notion that Europe’s Muslim minorities represent a threat to liberal democracy. He documents how European governments in the 1970s and 1980s excluded Islam from domestic institutions, instead inviting foreign powers like Saudi Arabia, Algeria, and Turkey to oversee the practice of Islam among immigrants in European host societies. But since the 1990s, amid rising integration problems and fears about terrorism, governments have aggressively stepped up efforts to reach out to their Muslim communities and incorporate them into the institutional, political, and cultural fabrics of European democracy.The Emancipation of Europe’s Muslims places these efforts--particularly the government-led creation of Islamic councils--within a broader theoretical context and gleans insights from government interactions with groups such as trade unions and Jewish communities at previous critical junctures in European state-building. By examining how state-mosque relations in Europe are linked to the ongoing struggle for religious and political authority in the Muslim-majority world, Laurence sheds light on the geopolitical implications of a religious minority’s transition from outsiders to citizens. This book offers a much-needed reassessment that foresees the continuing integration of Muslims into European civil society and politics in the coming decades.",
  "genres": [
    "Islam",
    "Grad School",
    "Nonfiction"
  ],
  "author": "Jonathan Laurence",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/13748082-the-emancipation-of-europe-s-muslims"
}