{
  "title": "New Europe",
  "description": "Michael Palin's New Europe starts with a simple idea: that only a couple of hours from home is a half of Europe that is for him as unknown and unexplored as the plateau of Tibet or the vastnesses of the Sahara. Cut off for most of his life by Cold Wars and Iron Curtains, Europe's eastern lands are now open for business.And it's as much a voyage of discovery as any of Michael's other journeys, as he finds himself in countries he'd barely heard of, many of them new names on the map, many unfamiliar and mysterious, all with tragic histories and much brighter futures.Starting in the snows of the Julian Alps, on the borders of Italy and Slovenia, Michael heads east to discover the half of Europe he never knew.Heading down the ancient trade route of the Adriatic coast he turns north into the Balkans, gingerly picking themselves up after the vicious fighting of the 1990's. Albania takes Michael into a different world of strongly eastern influence which he follows through Bulgaria, Macedonia and into Turkey, where Europe and Asia meet. Turning north to Moldova and Romania, he follows the mighty Danube into Serbia and Hungary, the very heart of Europe, and on to the Ukraine. A final sweep from north to south takes him through the Baltic States into Poland and across the Carpathian mountains into Slovakia, the Czech Republic and what was until recently East Germany.Visiting twenty countries, more than in his Himalaya and Sahara journeys combined, he encounters painful memories and exuberant celebrations. Throwing himself into local life with his usual reckless curiosity, he samples pig fat with a brandy chaser, meets Romanian lumberjacks, drives the 8.58 stopping train from Poznan to Wolsztyn, learns about mine-clearing in Bosnia, treads the catwalk at a Budapest fashion show and watches Turkish gents wrestling in olive oil.It's New Europe, but vintage Palin.",
  "genres": [
    "Travel",
    "Nonfiction",
    "Audiobook",
    "History",
    "Biography",
    "21st Century",
    "Reference"
  ],
  "author": "Michael Palin",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/1375861.New_Europe"
}