{
  "title": "Red River",
  "description": "Hailed as \"powerful,\"\"accomplished,\" and \"spellbinding,\" Lalita Tademy's first novel Cane River was a New York Times bestseller and the 2001 Oprah Book Club Summer Selection. Now with her evocative, luminous style and painstaking research, she takes her family's story even further, back to a little-chronicled, deliberately-forgotten time...and the struggle of three extraordinary generations of African-American men to forge brutal injustice and shattered promise into a limitless future for their children... RED RIVERFor the newly-freed black residents of Colfax, Louisiana, the beginning of Reconstruction promised them the right to vote, own property-and at last control their own lives.Tademy saw a chance to start a school for his children and neighbors. His friend Israel Smith was determined to start a community business and gain economic freedom. But in the space of a day, marauding whites would \"take back\" Colfax in one of the deadliest cases of racial violence in the South. In the bitter aftermath, Sam and Israel's fight to recover and build their dreams will draw on the best they and their families have to give-and the worst they couldn't have foreseen. Sam's hidden resilience will make him an unexpected leader, even as it puts his conscience and life on the line. Israel finds ironic success-and the bitterest of betrayals. And their greatest challenge will be to pass on to their sons and grandsons a proud heritage never forgotten-and the strength to meet the demands of the past and future in their own unique ways. An unforgettable achievement, a history brought to vibrant life through one of the most memorable families in fiction, RED RIVER is about fathers and sons, husbands and wives-and the hopeful, heartbreaking choices we all must make to claim the legacy that is ours.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "African American",
    "Southern",
    "Civil War",
    "Audiobook"
  ],
  "author": "Lalita Tademy",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/13766.Red_River"
}