{
  "title": "Little Boy Blue: A Puppy's Rescue from Death Row and His Owner's Journey for Truth",
  "description": "When journalist Kim Kavin decided that she wanted a puppy, she did what millions of people do every year: clicked on an online photo and submitted an application. She had no idea that the adorable brindle puppy—advertised as healthy and near her home in New Jersey—was actually a last-minute rescue from a gas-chamber shelter in North Carolina. Blue had arrived in the Northeast with at least a dozen other dogs in an RV that is just one among countless transports whose sponsors are dedicating their efforts to saving dogs by any means possible. Blue was happy and friendly, but he seemed to have endured some unusual albeit unknown ordeal. The dog’s manner prompted Kavin to trace his history all the way back to a long row of cages where Blue had been tagged to be put down in just three more days. Little Boy Blue is the true story of one sweet puppy’s journey of survival. It’s also a shocking exposé that describes a brutal ongoing reality inside some of this country’s taxpayer-funded shelters. But Little Boy Blue also tells an inspiring story of the grass-roots rescue network that has exploded across the nation in recent years. Readers will come to know and love a very special dog who now brings smiles to the faces of everyone he meets. From a single click of Kim Kavin’s computer mouse, Blue’s journey of a lifetime began. This is the story of Little Boy Blue, told with candor and a great deal of love. Readers will see Blue and other foster dogs that have been rescued by Kim Kavin in this book’s color photo insert.A portion of the proceeds from the sale of this book will donated to the Petfinder.com Foundation.From the Reviews:\"A moving call to action.\"—Kirkus Reviews",
  "genres": [
    "Animals",
    "Dogs",
    "Nonfiction",
    "Memoir"
  ],
  "author": "Kim Kavin",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/13777816-little-boy-blue"
}