{
  "title": "من او",
  "description": "در کتاب پیش رو راوی داستان جوانی است که از ۱۶ سالگی در شهر کار می‌کند. او تعمیرکار لوازم خانگی است و با درنظر گرفتن وضعیت اقتصادی آلمان پس از جنگ دوم جهانی، درآمد خوبی دارد.کل داستان مربوط به یک روز ابتدای هفته (دوشنبه) است؛ روزی تمام ناشدنی که در انتهای داستان هنوز چند ساعتی از آن باقی است! صبح روز دوشنبه تلگرامی از پدرش می‌رسد که هدویگ دختر مدیر مدرسه (همکار پدر) برای ادامه تحصیل به شهر می‌آید و فندریش می‌بایست به ایستگاه راه آهن برود و او را با رعایت ادب به آپارتمانی که قبلن برای او اجاره کرده است برساند. او با کمی نارضایتی تن به این کار می‌دهد اما مواجهه او با هدویگ تاثیر عجیبی روی او می‌گذارد به نحوی که…. در رمان من او خانواده‌ای اصیل و ایرانی در بستر تاریخ معاصر ایران با شیوه‌ای نوآورانه تصویر می‌شود. این اثر یکی از پرخواننده‌ترین رمان‌های دههٔ گذشته است.رضا امیرخانی شیوه‌های روایی مدرنی را در این رمان می‌آزماید، بی‌آنکه تجربهٔ لذت‌بخش خواندن رمان برای خواننده مختل شود. من او همچنین یکی از آثار جنجالی ادبیات داستانی فارسی در یک دههٔ گذشته است که نقدها و واکنش‌های بسیار متفاوتی را برانگیخت و البته بیشتر نقدها نگاهی ایدئواوژیک داشتند.این اثر داستان حیات یک خانواده را از سال ۱۳۱۲ تا جنگ روایت می‌کند و خطوط فرعی مختلفی را پی‌گیرد اما تم غالب آن عاشقانه است.«هر کسی عاشقم شود، من عاشقش می‌شوم و هر کس من عاشقش شوم، او را می‌کشم و خونبهایش خودم هستم.» حدیث قدسی منِ او داستان عشق است؛ داستان عشقی زمینی.عشق علی فتاح نوهٔ حاج فتاح، تاجر قند، به دختر کلفت خانه، مهتاب. منِ او، داستان عشقی است که در گام‌زدن در مرز عرفان، به عشق آسمانی پیوند می‌خورد تا دو دلداده بدون تن، شهید شوند و در آسمان‌ها به یکدیگر بپیوندند. منِ او، داستان یک تاریخ است، تاریخی که از سال ۱۳۱۲ و دوره رضاشاه آغاز می‌شود و در یکی از محله‌های پایین‌شهر تهران، یعنی خانی‌آباد روایتش را آغاز می‌کند. روایت مردم ساده گذرها و لوطی‌گری‌های اکنون دیگر فراموش‌شده.روایت درویش‌های چاووشی‌خان و حرمت نان و نمک و نقش‌آفرینی اصلی مسجد محل. روایت ارباب و رعیت‌ها؛ فقیر و غنی؛ روایتی از رنگ خاکی خانه‌های ساده تا صفای سبز دل آدم‌ها. منِ او، دقیق و بی‌نقص آدرس می‌دهد و مو لای درز نشانی‌هایش از کوچه پس کوچه‌ها نمی‌رود. سال‌ها، سال‌های از راه رسیدن ترقی‌خواهی حکومت است و چادر از سر زنان برداشتن سر یکی از همین پیچ‌های تاریخ؛ سال‌های کلاه پهلوی و اتول‌های پردود تازه از راه رسیده، و خانی‌آباد همان محله‌ای است که از روایت اربابش تا رعیت و نوکر و کلفتش دو قدم بیشتر راه نیست.منِ او، روایت سه دوره پرآشوب است؛ دوره مدرن کردن مردم، دوره شاه و انقلاب و مبارزات مردمی و دوره جنگ هشت ساله ایران و عراق. عشق کودکی اما، راه می‌گیرد در خون و رگ و می‌شود هویت روح. جهان تغییر می‌کند، آدم‌ها بزرگ و پیر می‌شوند و حوداث یکی از پی دیگری طومار زندگی آدم‌های قصه را درمی‌نوردند، زمانه رنگ و بوی دیگری می‌گیرد، قصه به شهر عشاق، یعنی پاریس جایی در قلب اروپای مدرن می‌رسد، اما عشق همان است که بود و عاشق و معشوق همانند که بودند.قصه عشق از لونی دیگر نمی‌شود، همانطور که هفت کور در پاریس هم هفت کورند، کشیش همان درویش مصطفا است و محراب کلیسا همان محراب مسجد قندی است و عشق حتی می‌تواند در ستون‌های فولادی برج ایفل هم بتپد. منِ او، دو راوی دارد: علی فتاح و نویسنده که رضا امیرخانی است. رضا امیرخانی قصه گفتن را بلد است؛ پایتخت سال ۱۳۱۲ را بازسازی می‌کند تا آدم‌هایش را یکی یکی در آن بچیند. زبان مردم کوچه و بازار بدون تصنع و باورپذیر است و قصه عشق را از نظرگاه خود تعریف می‌کند.",
  "genres": [
    "Novels",
    "Fiction",
    "Romance",
    "Unfinished",
    "Iran",
    "Literature",
    "Roman"
  ],
  "author": "Reza Amirkhani",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/137790322"
}