{
  "title": "The Welsh Girl",
  "description": "From the acclaimed writer Peter Ho Davies comes an engrossing wartime love story set in the stunning landscape of North Wales during the final, harrowing months of World War II. Young Esther Evans has lived her whole life within the confines of her remote mountain village. The daughter of a fiercely nationalistic sheep farmer, Esther yearns for a taste of the wider world that reaches her only through broadcasts on the BBC. Then, in the wake of D-day, the world comes to her in the form of a German POW camp set up on the outskirts of Esther's village. The arrival of the Germans in the camp is a source of intense curiosity in the local pub, where Esther pulls pints for both her neighbors and the unwelcome British guards. One summer evening she follows a group of schoolboys to the camp boundary. As the boys heckle the prisoners across the barbed wire fence, one soldier seems to stand apart. He is Karsten Simmering, a German corporal, only eighteen, a young man of tormented conscience struggling to maintain his honor and humanity. To Esther's astonishment, Karsten calls out to her. These two young people from worlds apart will be drawn into a perilous romance that calls into personal question the meaning of love, family, loyalty, and national identity. The consequences of their relationship resonate through the lives of a vividly imagined cast of characters: the drunken BBC comedian who befriends Esther, Esther's stubborn father, and the resentful young British \"evacuee\" who lives on the farm-even the German-Jewish interrogator investigating the most notorious German prisoner in Wales, Rudolf Hess. Peter Ho Davies has been hailed for his \"all-encompassing empathy that is without borders\" (Elle). That trancendent compassion shines through The Welsh Girl, a novel that is both thought-provoking and emotionally enthralling.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "World War II",
    "Historical",
    "War",
    "Book Club",
    "Romance"
  ],
  "author": "Peter Ho Davies",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/137796.The_Welsh_Girl"
}