{
  "title": "Misled",
  "description": "Special Task Force agent Derek Atkinson has a craving for luscious vampire Sable Taylor. But Sable is a bounty hunter, which makes him direct competition in the capture of wanted criminals. Despite the obvious attraction between them, she won't give him a chance and after two years, he's tired of waiting for her to come around. So he's got a plan to give them both what they want…each other. Sable's on a dangerous mission. She's not who Derek thinks she is, so a relationship just isn't possible. But like most master vampires, Derek's wily and used to having his way. When he traps her on his ship, she decides to indulge. Two straight days of mind-blowing sex should be enough, but it isn't, not for either of them. Her heart is involved now, but Sable can't let Derek get too close. If he finds out what she's doing, he'll never forgive her. Derek, however, refuses to let go. Now he's getting shot at and asking questions she shouldn't answer. Sable has to reveal the truth… Derek's love has been misled.Includes bonus the first chapter of KISS OF THE NIGHT( This book contains explicit sexual content and graphic language)REVIEWS\"Break out the ice-cubes... you'll need them to cool down. Hat's off to you, Ms. Day! Misled is a hot, fun, and exciting read. I mean HOT!\" - Jolie, Joyfully Reviewed\"Just when I figured there was nothing hotter than a vampire story, Ms. Day comes along and proves that two vampires are definitely better than one. Derek and Sable's explosive personalities ignite when they're around one another, and positively sizzle when they're in bed together.\" - Belle Dessler, Just Erotic Romance Reviews\"Whew! Talk about an intense, suspenseful, passionate novel! MISLED is an amazingly fascinating book. From the beginning, Sylvia Day captured my attention and had me setting on the edge of my seat until the very last word was read.\" – Nikita Steele, Erotic-Escapades\"MISLED is dark and erotic with suspenseful twists, just like the main characters. The sex scenes require availing yourself of something ice cold while following these alphas from one sector to another, chasing both bad guys and each other in their attempts to find out just who is being MISLED.\" - Belinda S. Mays, Romance Reviews Today\"From the first chase scene that opens this book and hooks the reader, to the action-packed surprise ending, MISLED is a well-written, taut thrill ride with just enough espionage and intrigue to please the suspense set, and enough extra-spicy love scenes and realistic dialogue to titillate the erotica set.\" - Gracie, Paranormal Reviews\"MISLED is hot and sexy. The attraction and chemistry between Derek and Sable is hotter than the pages could handle. I thought this book was going to melt my monitor.\" - Heather, Ecataromance\"Sylvia Day will definitely be on my must buy list in the future. From dodging bullets, hiding from one another, to hunting a traitor, and white hot seduction, MISLED is not a book to be missed.\" - Stacey Brutger, The Road to Romance\"MISLED is an engrossing, well crafted story of vampires and love. The plot moves quickly, with sizzling hot love scenes that will have you eagerly turning the pages. Sylvia Day has written an erotic explosion of secrets, love, and vampires that will leave you begging for more.\" - Karen, Romance Divas",
  "genres": [
    "Romance",
    "Paranormal",
    "Vampires",
    "Paranormal Romance",
    "Erotica",
    "Fantasy",
    "Science Fiction"
  ],
  "author": "Sylvia Day",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/10447024-misled"
}