{
  "title": "The Geographer's Library",
  "description": "The literary history suspense novel has long been a genre appreciated by a small subset of general readers. It is currently enjoying a new vogue and a wider readership with the publication of such novels as The Da Vinci Code, The Rule of Four, and Codex. What these books have in common, and what The Geographer's Library can also claim, is a set of characters in the here and now grappling with questions about things that went on a very long time ago. Another characteristic is the unearthing or explanation of objects of great value. The trick is to weave these two realities together in a compelling way, one that will keep the reader involved in both stories. Jon Fasman has taken a big chance with The Geographer's Library, his debut novel, setting out a complicated scenario in which a collection of priceless objects is stolen from the titular library and, eventually, scattered and re-collected a thousand years later--with very bad results for the final collector. The geographer is a real person, Al-Idrisi, a Spanish-Muslim philosopher, cartographer, linguist, and scholar who served in the court of King Roger of Sicily in Palermo in the year 1154. For the most part, Fasman's risk pays off, although there is a lot of meandering before we finally get to the final revelation. The \"wraparound\" story is about a young journalist, Paul Tomm, who sets out to write a simple obituary about a professor who died in his office at Paul's Alma Mater. The man is Jaan Puhapaev, an Estonian perhaps, who is a terrible teacher, fires his gun out his office window twice, is odd, unavailable, and reclusive and yet is allowed to stay on for unknown reasons. He also collects only $1.00 a year in salary and has no other visible means of support. The core narrative is a description of the provenance and travels of each of the 15 objects--some or all of which may hold the secret of eternal life--stolen from Al-Idrisi.  A professor friend of Paul's, a policemen and a curious editor all get an investigation rolling regarding what really happened to Jaan, who is he, and is he perhaps much, much older than they think? Paul meets and falls for a neighbor and putative friend of Jaan's, a music teacher named Hannah Rowe, which moves the information curve upward. This is the least believable part of the story: it's easier to accept the alchemical power of the Emerald Tablet of Hermes than Hannah. That said, Fasman does bring it all home at the end with an expository chapter and two letters. A bit of a cheat, but at least the reader is neatly taken off the literary hook he has dangled on for 380 pages. --Valerie Ryan",
  "genres": [
    "Fiction",
    "Mystery",
    "Historical Fiction",
    "Thriller",
    "Books About Books",
    "Historical",
    "Mystery Thriller"
  ],
  "author": "Jon Fasman",
  "average_rating": "3.04",
  "url": "https://www.goodreads.com/book/show/137936.The_Geographer_s_Library"
}