{
  "title": "جحيم نيوتن: تأملات ثقافية في تحولات العالم",
  "description": "يشهد العالم برمته تحولات متسارعة تدعو إلى التأمل والتجليل، إذ أنه وفي خضم هذه التحولات تتصاعد وتيرة التناحرات إن ضمن الدولة الواحد أو مع حولها من الدول، وما يطبع علاقة هذه العوالم المتناحرة في ما بينها هي ثقافة النفي والإقتصاد واللاإعتراف والعداوة، سواء حدث هذا في الشمال أم في الجنوب، وصحيح مثلاً بأن هذا التنابذ القهري كان قد حدث في الماضي في عصر الديانات وسطوة اللاهوت القديم، بأنبيائه ورسله وكهنته وشيوخه والمليورسه وحاخاماته وملاحدته، وتكرر الأمر نفسه في عصر النهضة والتنوير والحداثة البطولية غير أنه في عصر العولمة وإلى بعديات حالياً، أخذ منحىً تصعيدياً لم يسبق للبشرية أن عرفته أو جربته من قبل. فلقد كان الصراع السابق يتم بين الماضي والحاضر، بين التقليد والحداثة، أو بين العلم والدين، أو بين الخير والشر مثلاً، أما الآن فقد دخل المستقبل كطرف ثالث في الصراع، لا بوصفه حلماً يوتوبياً منشوداً تصبو إليه البشرية من أجلى خيرها وسعادتها، بل بوصفه قوة متعاظمة تسيّر العالم من أعلى وتتحكم في مصيره وتهيمن على مقدرات ماضيه وحاضره بشكل يفوق التصور، وإلى هذا، فإن هذه التغيرات أو التحولات الجديدة كما يجب أن تفهم، ليست تقليدية ولا جزئية ولا إجرائية ولا تكميلية، وإنما هي في العمق تحولات جذرية شمولية لم تكن معروفة من قبل، بحيث مسّت جميع الثوابت القديمة وتركت بصماتها على جوانب النشاط البنيوي كافة. عذا عن ذلك، فإن هذه التحولات الكلية الحضور، أخذت في صنع المستقبل على نحو لا إنعكاس فيه، أضف إلى أنها تحمل في طياتها ندور ضدها على طول الحظ، تماماً كما نجد وراء ظاهرة الهدوء والسكينة غلياناً مستتراً؛ فهذه التحولات الكبيرة، قد عصفت بمسارات العالم ومفاهيمه وقيمه ومثله، وعجلت في وتيرة تسارعه بشكل مكثف وهائل حدّ التهويش والفوضى ففي غضون العقدين الأخيرين بالذات، ولد عصر جديد مع نظامه العالمي الجديد (العولمة)، واستقبل العالم ألفيه جديد بجمولاتها الأسكاتولوجية القيامية مودعاً ألفية منصرمة، وذابت المسافات والحواجز والحدود بين العوالم، وإنهارت منظومات قديمة كبرى كالمنظومة الإشتراكية وسقوط جدار برلين، ونشأت منظومات جديدة على أنقاضها كنظام الشبكات الدولية وأيديولوجيا السوق وتقنية المعلومات وسيادة فكر المابعديان، كما أن مضاربات القبضات الإحتكارية العالمية، قد نمت بصورة مخيفة وعملاقة، بحيث أصبحت تدير لعبة الإقتصاد والسياسة وتسيطر على وسائل الإعلام الدولية وتهدد بكوارث حقيقة، كما حدث مثلاً في الأزمة الإقتصادية العالمية مؤخراً. ولعل من نتائج هذه التحولات أنها، أن تزعزت المفاهيم والمعاني والقيم، واندلعت بسببها نزاعات مسلحة نيو - كولونيالية وإرهابية وأهلية وطائفية وعقدية، راح ضحيتها الملايين من الناس، ارتفعت بذلك وتيرة العنف والتدمير والإضطراب من أنحاء العالم، كما انقلبت فيها الأوضاع والأحوال، وعمّ الفساد والتشبؤ والجريمة والإختراب والتهميش، وتضخمت أسطورة مجتمع الإستهلاك، وارتفعت عائدات فئة الأثرياء القلة على حساب إنتشار البؤس الإجتماعي والتشرد والبطالة والحرمان والفقر والسخط الحياتي لدى الأكثرية العظمى من الناس، وانفجرت حركات الأصولية المتشجنة والمتطرفة في كل مكان، وهيمن منطق العنصرية والنبذ ورهاب الآخريين الحضارات، واتسعت دائرة السيطرة والإستغلال والإحتكار وبَوْكسة البلدان، وتقوضت مقومات ومساحات هبة الطبيعة الصالحة للعيش، وولدت أمراض جديدة باتت تهدد صحة الإنسان دولياً، وتصاعدت حدة الإنتماءات والهويات الثقافية المحلية بشكل يُخشى من نكوصه وإنغلاقه وتقلصت - بالرغم من الإستخدام الهزاياني والأجوف لها - قيم الحرية والديموقراطية والعدالة والمساواة والكرامة والمحبة والسلام، أي بإختصار شديد، انقلب العالم ضدّ نفسه بين عشية وضحاها، ولم يعد بالإمكان أبداً إعادته إلى ما كان عليه سابقاً. هذه التحولات وما رافقها من أسباب ونتائج كارثية في الغالب، هي ما يعرضه المؤلف في كتابه هذا، مناقشاً بعض القضايا وخطوطها العريضة، وذلك من وجهة النظر الثقافية بالمعنى الأوسع للكلمة، وذلك من منطلق النقد والإختلاف مع الآخر، وهذه بمجملها عبارة عن مقالات ودراسات منتخبة للمؤلف تعدد إلى فترة 1988- 2010 كتبها في أزمنة شتى وظروف شتى، والتي يمكن النظر إليها كبانوراما ثقافية متعددة الأطراف والوجهات، تسعى إلى إعادة السؤال الثقافي والفكر الثقافي إلى الواجهة، والتفكير في ما يتطلبه الثقافة أصلاً من إشتراطات بنيوية وإستراتيجية وتنموية بعيدة المدى، وذلك من خلال قراءة ما يمور به المشهد العالمي من تغيرات وصراعات وتوجهات وتطاحن أفكار، وما أسفر عنه بالتالي من أحداث ونتائج، طال أوارها العالم العربي، كما طال بقية مناطق العالم.",
  "genres": [],
  "author": "عبد العزيز جاسم",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/10447579"
}