{
  "title": "The Russian Folktale by Vladimir Yakovlevich Propp",
  "description": "Vladimir Propp is the Russian folklore specialist most widely known outside Russia thanks to the impact of his 1928 book Morphology of the Folktale-but Morphology is only the first of Propp's contributions to scholarship. This volume translates into English for the first time his book The Russian Folktale, which was based on a seminar on Russian folktales that Propp taught at Leningrad State University late in his life. Edited and translated by Sibelan Forrester, this English edition contains Propp's own text and is supplemented by notes from his students.The Russian Folktale begins with Propp's description of the folktale's aesthetic qualities and the history of the term; the history of folklore studies, first in Western Europe and then in Russia and the USSR; and the place of the folktale in the matrix of folk culture and folk oral creativity. The book presents Propp's key insight into the formulaic structure of Russian wonder tales (and less schematically than in Morphology, though in abbreviated form), and it devotes one chapter to each of the main types of Russian folktales: the wonder tale, the \"novellistic\" or everyday tale, the animal tale, and the cumulative tale. Even Propp's bibliography, included here, gives useful insight into the sources accessible to and used by Soviet scholars in the third quarter of the twentieth century.Propp's scholarly authority and his human warmth both emerge from this well-balanced and carefully structured series of lectures. An accessible introduction to the Russian folktale, it will serve readers interested in folklore and fairy-tale studies in addition to Russian history and cultural studies.",
  "genres": [
    "Nonfiction",
    "Fairy Tales",
    "Folklore",
    "History",
    "Mythology",
    "Research"
  ],
  "author": "Vladimir Propp",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/13794253-the-russian-folktale-by-vladimir-yakovlevich-propp"
}