{
  "title": "Black Star, Crescent Moon: The Muslim International and Black Freedom beyond America",
  "description": "“The same rebellion, the same impatience, the same anger that exists in the hearts of the dark people in Africa and Asia,” Malcolm X declared in a 1962 speech, “is existing in the hearts and minds of 20 million black people in this country who have been just as thoroughly colonized as the people in Africa and Asia.” Four decades later, the hip-hop artist Talib Kweli gave voice to a similar Pan-African sentiment in the song “K.O.S. (Determination)”: “The African diaspora represents strength in numbers, a giant can't slumber forever.” Linking discontent and unrest in Harlem and Los Angeles to anticolonial revolution in Algeria, Egypt, and elsewhere, Black leaders in the United States have frequently looked to the anti-imperialist movements and antiracist rhetoric of the Muslim Third World for inspiration. In Black Star, Crescent Moon , Sohail Daulatzai maps the rich, shared history between Black Muslims, Black radicals, and the Muslim Third World, showing how Black artists and activists imagined themselves not as national minorities but as part of a global majority, connected to larger communities of resistance. Daulatzai traces these interactions and alliances from the Civil Rights movement and the Black Power era to the “War on Terror,” placing them within a broader framework of American imperialism, Black identity, and the global nature of white oppression. From Malcolm X and Muhammad Ali to contemporary artists and activists like Rakim and Mos Def, Black Star, Crescent Moon reveals how Muslim resistance to imperialism came to occupy a central position within the Black radical imagination, offering a new perspective on the political and cultural history of Black internationalism from the 1950s to the present.",
  "genres": [
    "Islam",
    "History",
    "Nonfiction",
    "Religion",
    "Politics",
    "Race",
    "Music"
  ],
  "author": "Sohail Daulatzai",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/13795310-black-star-crescent-moon"
}