{
  "title": "Frozen",
  "description": "Sixteen-year-old Sadie Rose hasn’t said a word in eleven years—ever since the day she was found lying in a snowbank during a howling storm. Like her voice, her memories of her mother and what happened that night were frozen.Set during the roaring 1920s in the beautiful, wild area on Rainy Lake where Minnesota meets Canada, Frozen tells the remarkable story of Sadie Rose, whose mother died under strange circumstances the same night that Sadie Rose was found, unable to speak, in a snowbank. Sadie Rose doesn’t know her last name and has only fleeting memories of her mother—and the conflicting knowledge that her mother had worked in a brothel. Taken in as a foster child by a corrupt senator, Sadie Rose spends every summer along the shores of Rainy Lake, where her silence is both a prison and a sanctuary. One day, Sadie Rose stumbles on a half dozen faded, scandalous photographs—pictures, she realizes, of her mother. They release a flood of puzzling memories, and these wisps of the past send her at last into the heart of her own life’s great who was her mother, and how did she die? Why did her mother work in a brothel—did she have a choice? What really happened that night when a five-year-old girl was found shivering in a snowbank, her voice and identity abruptly shattered? Sadie Rose’s search for her personal truth is laid against a swirling historical drama—a time of prohibition and women winning the right to vote, political corruption, and a fevered fight over the area’s wilderness between a charismatic, unyielding, powerful industrialist and a quiet man battling to save the wide, wild forests and waters of northernmost Minnesota. Frozen is a suspenseful, moving testimonial to the haves and the have-nots, to the power of family and memory, and to the extraordinary strength of a young woman who has lost her voice in nearly every way—but is utterly determined to find it again.",
  "genres": [
    "Historical Fiction",
    "Young Adult",
    "Fiction",
    "Mystery",
    "Historical",
    "Family",
    "Book Club"
  ],
  "author": "Mary Casanova",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/13795376-frozen"
}