{
  "title": "Stories from Jonestown",
  "description": "The saga of Jonestown didn’t end on the day in November 1978 when more than nine hundred Americans died in a mass murder-suicide in the Guyanese jungle. While only a handful of people present at the agricultural project survived that day in Jonestown, more than eighty members of Peoples Temple, led by Jim Jones, were elsewhere in Guyana on that day, and thousands more members of the movement still lived in California. Emmy-nominated writer Leigh Fondakowski, who is best known for her work on the play and HBO film The Laramie Project, spent three years traveling the United States to interview these survivors, many of whom have never talked publicly about the tragedy. Using more than two hundred hours of interview material, Fondakowski creates intimate portraits of these survivors as they tell their unforgettable stories.Collectively this is a record of ordinary people, stigmatized as cultists, who after the Jonestown massacre were left to deal with their grief, reassemble their lives, and try to make sense of how a movement born in a gospel of racial and social justice could have gone so horrifically wrong—taking with it the lives of their sons and daughters, husbands and wives, fathers and mothers, and brothers and sisters. As these survivors look back, we learn what led them to join the Peoples Temple movement, what life in the church was like, and how the trauma of Jonestown’s end still affects their lives decades later.What emerges are portrayals both haunting and hopeful—of unimaginable sadness, guilt, and shame but also resilience and redemption. Weaving her own artistic journey of discovery throughout the book in a compelling historical context, Fondakowski delivers, with both empathy and clarity, one of the most gripping, moving, and humanizing accounts of Jonestown ever written.",
  "genres": [
    "Nonfiction",
    "History",
    "True Crime",
    "Cults",
    "Religion",
    "Memoir",
    "Cult Classics"
  ],
  "author": "Leigh Fondakowski",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/13795336-stories-from-jonestown"
}