{
  "title": "Double Dexter",
  "description": "The dark and witty New York Times bestselling series...The inspiration for Showtime's critically acclaimed show...Double Dexter is Jeff Lindsay's completely new, wickedly entertaining novel.A witness. Such a simple concept - and yet for Dexter Morgan, the perfectly well-disguised monster, the possibility of a witness is unthinkable. But when Dexter is on a very private, very satisfying excursion one evening with a wretchedly deserving playmate, the unthinkable happens: someone sees him.Dexter is not at all pleased. As an upstanding blood-spatter analyst for the Miami Police Department, he has always managed to keep the darker side of his life out of the spotlight...the fun part, where he finds truly bad people - murderers who have escaped the reach of the justice system - and quietly gives them his very special attentions. But now that he's been seen and identified by his witness, Dexter must launch himself into a different kind of hunt.Making matters worse, a brutal cop killer is targeting Miami's police detectives, leaving behind bodies that are battered beyond recognition...and completely bloodless. As the department grows more fearful of the psychotic killer in their midst, Dexter must handle his own crisis and come to terms with the fact that his witness is not only circling him but determined to expose him. Dexter is being followed, manipulated, and mimicked...leading him to realize that no one likes to have a double, especially when his double's goal is to kill him.Double Dexter is complex and suspenseful and, as always, raucously entertaining...full of smart thrills and dark laughs that move effortlessly from a keen portrayal of Miami to Key West and beyond. Like the previous five bestselling novels in the Dexter series, this one is alive with the witty, macabre originality that has propelled Jeff Lindsay to international success.",
  "genres": [
    "Fiction",
    "Mystery",
    "Thriller",
    "Crime",
    "Horror",
    "Audiobook",
    "Mystery Thriller"
  ],
  "author": "Jeff Lindsay",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/10447839-double-dexter"
}