{
  "title": "Wendy",
  "description": "FROM BESTSELLING & AWARD-WINNING AUTHOR SELENA KITTHALF A MILLION NAUGHTY BOOKS SOLD IN 2011GUARANTEED QUALITY - THIS KITTY'S CREAM RISES TO THE TOP!------------------In this modern version of the fairy tale classic, Peter finds his Wendy while looking for a rare book on “shadow” in the library. After hearing Wendy’s tale of woe, he invites her and her two little brothers, Michael and John, to come live at his house in south Florida—a place he calls Neverland. But although a large cross-dressing blonde named Tink, who lives with Peter and his band, The Lost Boys, isn’t too happy about Wendy’s arrival, it’s Peter’s nemesis, James Hook, who proves to be the new couple’s greatest challenge.“Tink did this,” Peter said, pushing the gauze aside and sitting on the bed. He patted the place beside him but Wendy couldn’t stop looking around at the magic.“She did it for you.” Wendy smiled, taking his offered hand and stepping closer.“No, she did it for you,” he protested, slipping his arms around her waist, burying his face in her hair.“And you did it for me.”He looked at her, his gaze soft, loving. “Yes, I did.”“Why?”“Because I really, really like you, Wendy-girl.” He kissed the tip of her nose. “And I’ve never met someone so in need of a happy ending in my life.”“With all the people living in this house, how can you say that?”He chuckled. “You see, I’m the voice of experience.”His kiss broke her heart into a million pieces and put it back together, whole and beating and thick with blood, in an instant. She had never known anything like this, had never known anyone like Peter.“It really is beautiful,” she whispered as they parted, his hands in her hair.“And so are you.”She flushed. “Stop.”“I’m just getting started.”He kissed her, softly at first, and then deeper, his tongue finding hers, sending electric shocks along her skin. There was no doubt about what they were going to do, and Wendy found herself welcoming him completely. He touched her gently, but he wasn’t tentative. His motions were firm, sure—he knew just what he wanted as he pulled her onto the mattress, the gauze around the bed wrapping them in a hazy cocoon.“Oh Wendy-girl, the truth is—I’m so in love with you,” he whispered, pushing her dress up to her hips, pressing his lips against her navel.She thrilled at his words and returned them without question, without thought. “I love you, too.” It was impossible, but it was undeniable. “I want you. Please.”He lifted his head, where he was leaving kisses all over her flat, trembling belly. “Do you?”“Yes.” The word was breathless, full of longing.Smiling mischievously, he cocked his head, eyes bright. “What if I decide to tease you for a while first?”She whimpered as he traced his fingertips lightly over her skin, bringing her body alive with his touch. He explored her slowly and with relish, pulling the silk of her dress over her head and staring in wonder at her breasts as she stretched out on her back on the bed, her hands thrown over her head. She found herself giving in to whatever he wanted, letting him fondle and touch wherever he liked. He played her like an instrument, the notes rising higher, growing louder.",
  "genres": [
    "Erotica",
    "Fantasy",
    "Romance",
    "Paranormal",
    "Fairy Tales",
    "Fiction",
    "Adult"
  ],
  "author": "Selena Kitt",
  "average_rating": "3.11",
  "url": "https://www.goodreads.com/book/show/13795847-wendy"
}