{
  "title": "Laughter is Sacred Space: The Not-So-Typical Journey of a Mennonite Actor",
  "description": "A Preview from the Prologue, Scene 1: THIRTY-SEVEN PERCENT.Thirty-seven percent is a comfortable humidity level, a great batting average if you're a baseball player. If it's a grade on a test, it is not...so great.I was in seminary, training to be a pastor, and I had failed Greek Exegesis class. Not just failed, actually; obliterated might be a better description. Yes, obliterated, decimated, demolished, pulled a 37 percent on the final. Out of 100, yes.When people talk of having a calling, we occasionally lift our eyebrows, as if they are telling us they hear voices, including the voice of God, perhaps.And we mistrust them, these folks who hear voices. Because sometimes a calling is an excuse for selfishness, an abuse of power, and a sense of superiority.But it's also a powerful it can shape a career, give meaning to life, clarify direction. I had thought I had one—what happened to it...this calling to be in seminary, to be a pastor?I was thirty-two years old, married for thirteen years to my high school sweetheart; I had three beautiful sons (eight, six, and four years old), and a congregation in Pennsylvania counting on me to be a pastor. Not just counting on, but paying for five years of tuition and housing—a recognition and investment in the gifts they had discerned in me. It seemed like a well-orchestrated, God-directed plan, drenched in much prayer and great intentions. In my mind and many others, serving, ministering, pastoring a church was the highest call.Was it possible to fail a calling?I hadn't told the congregation about this semester's report card, wasn't anxious for that particular conversation. They hadn't invested thousands of hard-earned dollars for a 37 in Greek Exegesis...or a 70...or an 85, quite frankly. My wife, Sue, and I were products of the Swiss German Mennonite community of eastern Pennsylvania. One of the hallmarks of this community was hard work (neat lawns, good business sense) and God's subsequent reward for that effort. This wasn't the plan—failing Greek—and I wasn't wild about the daunting prospect of Hebrew or systematic theology, on the plate for the fall semester. Oh, and what I really wanted? To be an actor.",
  "genres": [
    "Biography",
    "Memoir",
    "Nonfiction",
    "Humor",
    "Biography Memoir",
    "Spirituality"
  ],
  "author": "Ted Swartz",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/13801533-laughter-is-sacred-space"
}