{
  "title": "The Day Donny Herbert Woke Up: A True Story",
  "description": "Donny Herbert was a hardworking Buffalo city firefighter who, in December 1995, was searching the attic of a burning house when the snow-laden roof collapsed. For six minutes he was without oxygen. A beloved husband, a father of four boys, a neighborhood fixture who was always willing to lend a helping hand, Donny fell into a vegetative state that lasted nearly a decade. His prognosis was poor, and while he could open his eyes, he was unresponsive to the world around him. Donny Herbert was, for all practical purposes, gone. Until one day, in April 2005, when he woke up and spoke almost nonstop to his family and loved ones for nearly sixteen hours.The Day Donny Herbert Woke Up is the story of this remarkable moment, which was covered by the press worldwide, from the New York Times to the AP newswire. For his wife, Linda, who had held the family together for years, who had prayed nightly for Donny’s recovery, it was a miracle. For his doctors and nurses, it was a medical mystery. For his sonsÑincluding his youngest, with whom he had never before had a conversationÑit was a blessing. After his remarkable day, Donny Herbert fell into a deep sleep and never experienced a comparable moment of clarity. He died, in February 2006, from pneumonia.Written by Linda’s cousin, The Day Donny Herbert Woke Up makes the reader Was it an experimental drug cocktail or an act of God that brought Donny back? Linda believes that each contributed to the miraculous day when he woke, but more than anything, she credits Donny himself-a man with the strength to will himself back into his family’s lives, if only to remind them one last time of how very much he loved them. This is as much Linda’s storyÑone of perseverance and faith-as it is of a remarkable husband, father, and firefighter.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Audiobook",
    "Biography"
  ],
  "author": "Rich Blake",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/1380158.The_Day_Donny_Herbert_Woke_Up"
}