{
  "title": "The Party's Over: Oil, War and the Fate of Industrial Societies",
  "description": "The world is about to run out of cheap oil and change dramatically. Within the next few years, global production will peak. Thereafter, even if industrial societies begin to switch to alternative energy sources, they will have less net energy each year to do all the work essential to the survival of complex societies. We are entering a new era, as different from the industrial era as the latter was from medieval times. In The Party’s Over , Richard Heinberg places this momentous transition in historical context, showing how industrialism arose from the harnessing of fossil fuels, how competition to control access to oil shaped the geopolitics of the twentieth century and how contention for dwindling energy resources in the twenty-first century will lead to resource wars in the Middle East, Central Asia and South America. He describes the likely impacts of oil depletion and all of the energy alternatives. Predicting chaos unless the United States—the world’s foremost oil consumer—is willing to join with other countries to implement a global program of resource conservation and sharing, he also recommends a “managed collapse” that might make way for a slower-paced, low-energy, sustainable society in the future. More readable than other accounts of this issue, with fuller discussion of the context, social implications and recommendations for personal, community, national and global action, Heinberg’s updated book is a riveting wake-up call for human-kind as the oil era winds down, and a critical tool for understanding and influencing current US foreign policy. Richard Heinberg , from Santa Rosa, California, has been writing about energy resources issues and the dynamics of cultural change for many years. A member of the core faculty at New College of California, he is an award-winning author of three previous books. His Museletter was nominated for the Best Alternative Newsletter award by Utne in 1993.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Science",
    "Peak Oil",
    "Environment",
    "Economics",
    "Sustainability"
  ],
  "author": "Richard Heinberg",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/138040.The_Party_s_Over"
}