{
  "title": "Hurricane Punch",
  "description": "Welcome to another typical summer in Florida, the season of the storms. Serge storms. That lovable, under -undermedicated dispenser of truth, justice, and trivia is back with a vengeance. And not a weirdness-laced moment too soon. His cherished home state is about to take a beating, and from far more than the way-too-routine conga line of hurricanes bearing down on the peninsula. Bodies have begun turning up at a disturbing rate, even for Florida, and it looks like a brutal serial killer is on the loose, which highly offends Serge's moral sensibilities and he vows to stop at nothing in his juggernaut to make All Things Right . . . except if he gets bored or distracted by a cool souvenir or . . . or a . . . whatever. But his path won't be obstacle free. Agent Mahoney has picked up the scent. The obsessive criminal profiler—just released from a mental hospital where he'd been sent for getting too deep inside Serge's head—is convinced there is no second killer. Serge's personality is simply splitting from decades of burning with incandescent zest for everything under the sun. Then there's Coleman, whose triathlete approach to the sport of polyabuse binging just might derail the mission more than the entire police community put together. The pace picks up. Winds howl, TV reporters fly around the beach, the Party Parrot parties on, and questions Who's stalking Tampa Bay's most sensitive journalist? Did Tom Cruise go too easy on Matt Lauer? Do multiple orgasms improve storm tracking? Why is the feeding-tube guy so quiet? Will Molly ruin our antihero's dreams of playing the electric guitar better than Clapton? . . . All of which ultimately leads to the most pressing question on everyone's new-millennium What would Serge do?",
  "genres": [
    "Mystery",
    "Fiction",
    "Humor",
    "Audiobook",
    "Crime",
    "Comedy",
    "Serial Killer"
  ],
  "author": "Tim Dorsey",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/138054.Hurricane_Punch"
}