{
  "title": "Breach of Faith: Hurricane Katrina and the Near Death of a Great American City",
  "description": "Hurricane Katrina shredded one of the great cities of the South, and as levees failed and the federal relief effort proved lethally incompetent, a natural disaster became a man-made catastrophe. As an editor of New Orleans’ daily newspaper, the Pulitzer Prize—winning Times-Picayune, Jed Horne has had a front-row seat to the unfolding drama of the city’s collapse into chaos and its continuing struggle to survive.As the Big One bore down, New Orleanians rich and poor, black and white, lurched from giddy revelry to mandatory evacuation. The thousands who couldn’t or wouldn’t leave initially congratulated themselves on once again riding out the storm. But then the unimaginable happened: Within a day 80 percent of the city was under water. The rising tides chased horrified men and women into snake-filled attics and onto the roofs of their houses. Heroes in swamp boats and helicopters braved wind and storm surge to bring survivors to dry ground. Mansions and shacks alike were swept away, and then a tidal wave of lawlessness inundated the Big Easy. Screams and gunshots echoed through the blacked-out Superdome. Police threw away their badges and joined in the looting. Corpses drifted in the streets for days, and buildings marinated for weeks in a witches’ brew of toxic chemicals that, when the floodwaters finally were pumped out, had turned vast reaches of the city into a ghost town.Horne takes readers into the private worlds and inner thoughts of storm victims from all walks of life to weave a tapestry as intricate and vivid as the city itself. Politicians, thieves, nurses, urban visionaries, grieving mothers, entrepreneurs with an eye for quick profit at public expense–all of these lives collide in a chronicle that is harrowing, angry, and often slyly ironic.Even before stranded survivors had been plucked from their roofs, government officials embarked on a vicious blame game that further snarled the relief operation and bedeviled scientists striving to understand the massive levee failures and build New Orleans a foolproof flood defense. As Horne makes clear, this shameless politicization set the tone for the ongoing reconstruction effort, which has been haunted by racial and class tensions from the start.Katrina was a catastrophe deeply rooted in the politics and culture of the city that care forgot and of a nation that forgot to care. In Breach of Faith, Jed Horne has created a spellbinding epic of one of the worst disasters of our time.From the Hardcover edition.",
  "genres": [
    "Nonfiction",
    "History",
    "Politics",
    "American History",
    "United States",
    "Race",
    "21st Century"
  ],
  "author": "Jed Horne",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/138058.Breach_of_Faith"
}