{
  "title": "Ranger: the Adventurous Life of Robert Rogers of the Rangers",
  "description": "The most famous ranger-and the father of covert warfare As the 'age of sail' progressed the great nations of Europe understood that the lands and wealth of the globe were within the grasp of their imperial ambitions. Which nation would win most became a race that, inevitably, would culminate in a struggle to establish who could gain-and hold-most. The principal contestants were France and Britain and their bitter, age-old rivalry would lead to a final conflict in the middle years of the 18th century-the Seven Years War, which would be fought on bloody fields in Europe, Asia and significantly in the New World of the Americas. There colonists of each nation struggled to build lives among the indigenous Indian tribes of the eastern woodlands. Here was a war, subject to the severest weather conditions, fought among deep forests, on lakes and in huge tracts of unmapped wilderness. Regular troops of both nations were engaged, together with militias raised among local populations combined with the savage element of Iroquois and Huron Indian allies. 'Cometh the moment, cometh the man' and the man for that moment was Robert Rogers. This was not the place for the formal battle lines of uniformed regulars. Here the principal advantage lay in stealthily gained intelligence, surprise and the hit and run tactics of the ambuscade. So the 'special forces' fighter was born and the men who shared his skills were bonded together as units in the form of independent companies of rangers who could melt into the forest, subsist on it, do their silent work and reappear as silently. This is a biography of their most famous and successful commander. Rogers was no two dimensional hero, he was a man suited to his time and his war; tough, resourceful, ruthless and allegedly dishonest and unscrupulous. His successes were often marred by reverses of the most disastrous kinds. His career spanned two wars and in the second of them whilst he remained true to his allegiances the fact that he was on the losing side contributed much to his downfall. This book, a record of the life of a man whose influence on the nature of warfare to the present day is immense, makes riveting reading for all those interested in the French and Indian War and American War of Independence.Leonaur editions are newly typeset and are not facsimiles; each title is available in softcover and hardback with dustjacket.",
  "genres": [],
  "author": "Allan Nevins",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/13808965-ranger"
}