{
  "title": "The Three-Pound Enigma: The Human Brain and the Quest to Unlock Its Mysteries",
  "description": "The average human brain weighs three pounds―80 percent of which is water―and yet it's capable of outstripping the computational and storage capacities of the most complex computer. But how the mind works remains one of humankind's greatest mysteries.With boundless curiosity and enthusiasm, Shannon Moffett, a Stanford medical student, takes us down the halls of neuroscience to the front lines of cutting-edge research and medicine to meet some of today's most extraordinary scientists and thinkers, all grappling with provocative Why do we dream? How does memory work? How do we see? What happens when we think?Each chapter delves into a different aspect of the brain, following the experts as they chart new ground. Moffett takes us to a lab where fMRI scans reveal the multitude of stimuli that our brains unconsciously take in; inside an operating room where a neurosurgeon removes a bullet from a patient's skull; to the lab of Christof Koch, a neuroscientist tracking individual neurons in order to crack the code of consciousness; and to a research lab where scientists are investigating the relationship between dreams and waking life. She also takes us beyond the scientific world―to a Zen monk's zendo, where she explores the effects of meditation on the brain; inside the home of a woman suffering from dissociative identity disorder; to a conference with the philosopher Daniel Dennett, who uses illusions, magic, tricks, and logic to challenge our assumptions about the mind; and to the home of the late Nobel Laureate Francis Crick, co-discoverer with James Watson of DNA's double-helix structure.Filled with fascinating case studies and featuring a timeline that tracks the development of the brain from conception to death, The Three Pound Enigma is a remarkable exploration of what it means to be human.",
  "genres": [
    "Science",
    "Nonfiction",
    "Neuroscience",
    "Psychology",
    "Biology",
    "Medical",
    "Brain"
  ],
  "author": "Shannon Moffett",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/138160.The_Three_Pound_Enigma"
}