{
  "title": "Impact Point",
  "description": "June 30th 1908: A massive air blast occurs over Tunguska in Siberia - the Tunguska event - believed to have been caused by a meteorite or comet fragment. The blast releases the same amount of energy as 185 Hiroshima nuclear bombs. The object is thought to have been around 120 feet in diameter. It happened then and will happen again, it's just a question of where and when... Robert Spire, environmental lawyer, newly recruited to the UK's GLENCOM - Global Environmental Command Unit is propelled into a roller coaster adventure through London, America and the Bahamas as he searches for the cause of some mysterious whale deaths. As the clues unfold, nothing can prepare him or the world, for the cataclysm that is about to unfold. Robert Spire's greatest adventure may be the world's last...MYSTERIOUS WHALE DEATHS...When the World's largest ever creature - a blue whale - dies in front of Robert Spire on his local Welsh beach, the UK's Department of the Environment and local population are ill prepared. When a second whale washes up dead on Myrtle Beach on the opposite side of the Atlantic, the scientific community starts asking questions.A QUEST FOR METEORITE FRAGMENTS...Environmental lawyer Robert Spire; newly recruited to the UK's Global Environmental Command Unit - GLENCOM, flies over to South Carolina to investigate. Whilst there, he teams up with marine biologist Dr Sally Rivea, also assigned to the case. Meanwhile, ex-marine Travis Dexter is on the run in Nevada after he discovers the body of his employer - philanthropist Julian Smithies - murdered in his home. The only object missing; a recently discovered, rare and valuable meteorite.A FUTURE GLOBAL CATACLYSM...On the island of Exuma In the Bahamas, four sport divers make a startling discovery at the bottom of Mystery Cave blue hole. Sixty miles offshore in the Caribbean Sea, drilling on the Proteus oil rig turns to disaster as the drill penetrates something hard on the ocean floor. Dr Rivea, at a loss to explain the high levels of the mineral olivine discovered in the whale's tissue samples, accompanies Spire to the Caribbean in search of answers, but what they discover doesn't bear thinking about...\"Si Rosser's new novel IMPACT POINT is an outstandingly good and enjoyable read. It welds mystery and adventure into a very well-written thriller. I recommend it 100%\" - Author, TV presenter and Priest Lionel Fanthorpe",
  "genres": [
    "Thriller",
    "Fiction",
    "Adventure",
    "Suspense",
    "Science Fiction"
  ],
  "author": "Simon Rosser",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/13818157-impact-point"
}