{
  "title": "Murder in LaMut",
  "description": "The second novel of a major new Feist acquisition, returning to his best-loved series. Written with Joel Rosenberg. The second Riftwar collaboration, Murder in LaMut, written by masters of fantasy Raymond E. Feist and Joel Rosenburg. The heavy action was supposedly at Crydee these days which meant that the one place they could be sure the three of them were not going was Crydee. Come spring, the privateer Melanie was due in Ylith, and its captain could be counted on for a swift conveyance away for sure, and likely not to murder them in their sleep. That would be bad for business. But away where? That wasn't Durine's worry. Kethol would surely be able to find the three of them somebody who needed men who knew which part of the sword you used to cut with and which part you used to butter your bread, and Pirojil would be able to negotiate a price at least half again what the employer was ready to pay. All Durine would have to do was kill people. That was fine with him. Durine, Kethol and Pirojil are three mercenaries who have spent twenty years fighting other people's against the Tsurani and the Bugs and the goblins, and now it seems they've run out of Tsurani, Bugs and goblins to kill. The prospect of a few months of garrison duty offers a welcome respite; but then they are given an assignment that seems, on the surface, like cushy work -- to protect a lady and her husband and deliver them safely to the city of Lamut. It should all have been so simple! Raymond E. Feist is the author of the bestselling and critically acclaimed Riftwar Saga, the Serpentwar Saga and the epic Krondor series. Joel Rosenberg is best-known for The Guardian of the Flame sequence. His other fantasy work includes D'Shai novels and the Keeper of the Hidden Ways series.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Epic Fantasy",
    "High Fantasy",
    "Science Fiction",
    "Science Fiction Fantasy",
    "Audiobook"
  ],
  "author": "Raymond E. Feist",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/13819.Murder_in_LaMut"
}