{
  "title": "Origins of Life. How Life Began. Abiogenesis, Astrobiology",
  "description": "How Did Life Begin? There are two scientific views on the origins of life: 1) Earthly-Abiogenesis which argues life on Earth began on Earth, and 2) Extraterrestrial Abiogenesis the position of which is life has an ancestry which predates the origins of Earth, and is pervasive throughout the cosmos. Thus, both theories embrace abiogenesis\" and both argue that life may have begun on innumerable planets via the same mechanisms. In this ground-breaking, revolutionary text, over 30 top scientists from around the world, explain how life began and if there is life on other worlds, in over 20 paradigm busting chapters. PART I: Earthly Abiogenesis & the Origins of Life 1. Why Does Life Start, What Does It Do, Where Will It Be, And How Might We Find It? Michael J. Russell, Ph.D., and Isik Kanik, Ph.D., 2. Just Like the Universe the Emergence of Life had High Enthalpy and Low Entropy Beginnings, Wolfgang Nitschke, Ph.D., and Michael J. Russell, Ph.D. 3. Polyphosphate-Peptide Synergy and the Organic Takeover at the Emergence of Life. E. James Milner-White, Ph.D., and Michael J. Russell, Ph.D. 4. The Alkaline World and the Origin of Life. Anthony Richard Mellersh, Ph.D., and Paul Michael Smith, 5. Amino Acid Homochirality and the RNA World: Necessities for Life on Earth, Koji Tamura, Ph.D., 6. The RNA World and the Origin of Life: An Ancient Protein Fold Links Metal-Based Gas Reactions with the RNA World. Anne Volbeda, Ph.D., Yvain Nicolet, Ph.D., and Juan C. Fontecilla-Camps, Ph.D. 7. Evolutionary Steps to the Origin of Life on Earth. Andrew J. Pratt, D. Phil. 8. Vesicles First and the Origin of Self-Reproductive Life: Metabolic Energy, Replication, and Catalysis. Arthur L. Koch, Ph.D., 9. Chance or Necessity? Bioenergetics and the Probability of Life. Nick Lane, Ph.D. 10. Disequilibrium First: The Origin of Life Christof B. Mast, Ph.D., Natan Osterman, Ph.D., and Dieter Braun, Ph.D. 11. Life's Origins: Potential for Radical Mediated Cyanide Production on the Early Earth, Shawn E. McGlynn, Ph.D., Trevor E. Beard, Joan B. Broderick, Ph.D., and John W. Peters, Ph.D. 12. The Emergence of Life: Thermodynamics of Chemical Free Energy Generation in Off-Axis Hydrothermal Vent Systems & Consequences for Compartmentalization & Life's Origins. Eugenio Simoncini, Ph.D., Axel Kleidon, Ph.D., Enzo Gallori, Ph.D. 13. How Life Began: The Emergence of Sparse Metabolic Networks, Shelley D. Copley, Ph.D., Eric Smith, Ph.D., and Harold J. Morowitz, Ph.D., 14. Redox Homeostasis in the Emergence of Life. On the Constant Internal Environment of Nascent Living Cells, John F. Allen, Ph.D. 15. Reconstruction of the Molecular Origin of Life. Edward N. Trifonov, Ph.D., 16. How Primordial Cells Assembled Biosynthetic Pathways, Marco Fondi, Ph.D., Giovanni Emiliani, Ph.D., Renato Fani, Ph.D., 17. On the Emergence of Pre-Genetic Information. Ernesto Di Mauro, Ph.D., 18. Implications For An RNA-Clay World: Interaction Of Cytosine With Clay Minerals, A. Pucci, Ph.D., et al. 19. Viruses and Life: Can There Be One Without the Other? Matti Jalasvuori, Ph.D., and Jaana K.H. Bamford, Ph.D., 20. The Origin of Eukaryotes: Archae, Bacteria, Viruses and Horizontal Gene Transfer, R. Joseph, Ph.D. 21. What Can the Origin of Life on Earth Tell Us About the Cosmos? Stephen Freeland, Ph.D., and Gayle K. Philip, Ph.D. PART II: Extra-Terrestrial Abiogenesis 22. 1. Biological Cosmology and the Origins of Life in the Universe, R. Joseph, Ph.D., Rudolf Schild, Ph.D 23. First Life in the Oceans of Primordial-Planets: The Biological Big Bang. C.H. Gibson, Ph.D., N.C. Wickramasinghe, Ph.D., R.E. Schild, Ph.D 24. Genetics Indicates Extra-Terrestrial Origins of Life: the First Gene. R. Joseph, Ph.D., Rudolf Schild, Ph.D., N.C. Wickramasinghe, Ph.D.,",
  "genres": [
    "Science",
    "Biology",
    "Nonfiction",
    "Evolution"
  ],
  "author": "Michael J. Russell",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/13820631-origins-of-life-how-life-began-abiogenesis-astrobiology"
}