{
  "title": "Complicity: How the North Promoted, Prolonged, and Profited from Slavery",
  "description": "Slavery in the South has been documented in volumes ranging from exhaustive histories to bestselling novels. But the North’s profit from–indeed, dependence on–slavery has mostly been a shameful and well-kept secret . . . until now. In this startling and superbly researched new book, three veteran New England journalists de-mythologize the region of America known for tolerance and liberation, revealing a place where thousands of people were held in bondage and slavery was both an economic dynamo and a necessary way of life.Complicity reveals the cruel truth about the Triangle Trade of molasses, rum, and slaves that lucratively linked the North to the West Indies and Africa; discloses the reality of Northern empires built on profits from rum, cotton, and ivory–and run, in some cases, by abolitionists; and exposes the thousand-acre plantations that existed in towns such as Salem, Connecticut. Here, too, are eye-opening accounts of the individuals who profited directly from slavery far from the Mason-Dixon line–including Nathaniel Gordon of Maine, the only slave trader sentenced to die in the United States, who even as an inmate of New York’s infamous Tombs prison was supported by a shockingly large percentage of the city; Patty Cannon, whose brutal gang kidnapped free blacks from Northern states and sold them into slavery; and the Philadelphia doctor Samuel Morton, eminent in the nineteenth-century field of “race science,” which purported to prove the inferiority of African-born black people.Culled from long-ignored documents and reports–and bolstered by rarely seen photos, publications, maps, and period drawings–Complicity is a fascinating and sobering work that actually does what so many books pretend to do: shed light on America’s past. Expanded from the celebrated Hartford Courant special report that the Connecticut Department of Education sent to every middle school and high school in the state (the original work is required readings in many college classrooms,) this new book is sure to become a must-read reference everywhere.From the Hardcover edition.",
  "genres": [
    "History",
    "Nonfiction",
    "Race",
    "Politics",
    "American History",
    "African American",
    "Social Justice"
  ],
  "author": "Anne Farrow",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/138222.Complicity"
}