{
  "title": "Love in a Dead Language",
  "description": "Love in a Dead Language is a love story, a translation of an Indian sex manual, an erotic farce, and a murder mystery rolled into one. Enticing the reader to follow both victims and celebrants of romantic love on their hypertextual voyage of folly and lust-through movie posters, upside-down pages, the Game of Love board game, and even a proposed CD-ROM, Love in a Dead Language exposes the complicities between the carnal and the intellectual, the erotic and the exotic and, in the end, is an outrageous operatic portrayal of romantic love.\"Rare is the book that makes one stop and Is this a literary masterpiece or do I need my head examined? But such is the alternately awe-inspiring and goofy thrall cast by Lee Siegel's Love in a Dead Language . . . . His work stands out as a book that is not simply a novel but its own genus of rollicking, narrative scholarship . . . it is just the cerebral aphrodisiac we need.\" —Carol Lloyd, Salon\"Immensely clever and libidinously hilarious. . . . [T]he most astonishing thing about Love in a Dead Language is its ingenious construction. Insofar as any printed volume can lay claim to being a multimedia work, this book earns that distinction.\" —Paul di Filippo, Washington Post Book World\"Now along comes Lee Siegel, who mixes a bit of Borges with some Nabokov and then adds an erotic gloss from the Kama Sutra to write Love in a Dead Language , a witty, bawdy, language-rich farce of academic life. . . . Whether it is post-modern or not, Love in a Dead Language is pulled off with such unhinged élan by Mr. Siegel that it is also plain good fun, a clever, literate satire in which almost everything is both travestied and, strangely, loved by its author.\" —Richard Bernstein, The New York Times\" Love in a Dead Language deserves space on the short, high shelf of literary wonders.\" —Tom LeClair, New York Times Book Review1999 New York Times Book Review Notable Book of the Year",
  "genres": [
    "Fiction",
    "India",
    "Novels",
    "Romance",
    "American",
    "Sexuality",
    "Literary Fiction"
  ],
  "author": "Lee A. Siegel",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/138239.Love_in_a_Dead_Language"
}