{
  "title": "Caverns, Cauldrons, and Concealed Creatures: A Study of Subterranean Mysteries in History, Folklore, and Myth",
  "description": "The most up-to-date edition is here: http://www.amazon.com/Caverns-Cauldro...The 3rd edition of the cult classic CAVERNS, CAULDRONS, AND CONCEALED CREATURES, is the first book of its kind to examine the striking similarities between folklore, religious, mythic, new age, fictional, and first-hand eyewitness and historical accounts of anomalous beings, entities, cryptids, hidden civilizations, and related anomalies.Drawing from scientific facts, folklore, comparative mythology and eyewitness/anecdotal sources, it is demonstrable that the structure of our planet, the history of our species, the underlying truths disguised as our myths, legends, folklore and \" pop culture \" imagery, are not quite what we have been led to believe. The Earth itself is much more complex in structure than we have realized, and our species has perhaps experienced, through the ages, encounters and conflicts with \"others\"— non-human intelligences or beings of various types who have seldom been our friends. Memories and accounts of these encounters have come down to us in the form of folklore and mythology, often viewed with superstitious terror or awe through the conditioned lenses of religions, religious interpretation or \"folk traditions.\" Such encounters are continuing today.The theories put forth in this book are based on two types of evidence: very strong circumstantial evidence based on folklore, mythology, religion, legends, archeology, geology, and related areas, and first-hand or witness accounts, both ancient and modern. Often these two areas of source material or even anecdotal evidence overlap.It is possible that these various phenomena and beings are in fact modern representations of those who have traditionally been considered fairies, gnomes, trolls, nagas, djinn, \"aliens\" and their \"magic\" is a technology of such antiquity, advancement and complexity that it is, to our limited understanding, \"magical.\" With UFOlogy, cryptozoology, Fortean phenomena, and all the rest, we are in fact seeing, perhaps even participating in, an ongoing contemporary \" update of \"folklore,\" which is in actuality the way our human minds attempt to gather, categorize, assimilate, comprehend and decipher (as well as \"cover up\" with terror-masking simplifications) the very REAL evidence for the existence of such beings and their ongoing yet seemingly inexplicable activities.From ancient myths to modern experiences from credible witnesses, it is ALL folklore, and ancient folk traditions may contain much more truth than has previously been believed, just as \"forteana\" and related topics do today. Once we make the leap of understanding that the creation of folklore is part of the process of comprehending these mysteries, and even may be caused by them, the whole picture of our culture, literature, fairytales, Jungian archetypes, and so on takes on an entirely different light. The creation of folklore, based on very real \" others \" and their parasitical or otherwise peripheral activities, has become an instinctive, mind-protecting function for the collective human mind.This book has been previously published in a First Edition, an expanded Second Edition, and now is offered EXCLUSIVELY in a greatly-expanded, magnum opus 3rd Edition presentation with introductions by Brad Steiger, Micha Hanks, Brian J Allen, and Dean de Lucia. Not only is this visually and textually stunning digital version more expansive and complete; it is considerably less costly than its printed predecessors. New chapters, artwork, photographs, maps, and introductions are joined by substantial data and observations added to each section of the book, as well as a greatly-expanded appendix featuring the possibly non-human-generated imagery discovered by Richard S. Shaver, recorded in solid rock, and evidence of an ancient civilization that once existed on our planet.",
  "genres": [
    "History",
    "Mythology",
    "Nonfiction",
    "Cryptozoology",
    "Monsters",
    "Folklore",
    "Historical"
  ],
  "author": "Wm. Michael Mott",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/13824848-caverns-cauldrons-and-concealed-creatures"
}