{
  "title": "Revenge of the Kudzu Debutantes",
  "description": "kud • zu \\kud-zü\\ n: a ubiquitous vine/weed found in Southern climes that, left uncontrolled, will grow over any fixed object in its path, including trees, power lines, and the entire state of Georgia. deb•u•tante \\de-byu-tänt\\ n: a young woman making a debut into society, easily spotted in white dress and pearl necklace. Common names include Muffy, Bootsy, and Bunny.Eadie Boone is no shrinking violet. An artist and former beauty queen who married into one of the first families of Ithaca, Georgia, she tackles everything with gusto and flair. But tailing her wayward husband proves to be, well, an exasperating chore. If only Trevor would just see the light, dump his twenty-two-year-old hussy, and return home, Eadie’s creative energy could be put to better use. Now all she has to do is convince him.Nita Broadwell, a good Southern girl from a good Southern family, is jolted out of complacency when she discovers condoms in her husband’s shirt pocket (“Maybe he’d found them on the ground and picked them up”). Between clinging to denial and dodging her overbearing mother-in-law, Nita is also trying to break her addiction to steamy bodice-ripper novels. Only now it appears she’s authoring her own real-life romance tale with a hunky handyman thirteen years her junior. Lavonne Zibolsky–a transplanted Yankee, bless her heart–is saddled with planning the annual Broadwell & Boone law firm party. That and her lackluster marriage have her seeking solace in the contents of her refrigerator. If she could just put down the Rocky Road ice cream and peach pie, she might get around to finding a caterer, dropping sixty pounds, and figuring out how to fall in love with her husband again. Not necessarily in that order. Bonded by years of friendship, these three women discover what else they have in common: lying, cheating spouses. So they heed their collective betrayals as a wake-up call and band together to exact sweet revenge. The take-charge trio will see to it that the punishment is just, exquisitely humiliating, and downright hilarious.Cathy Holton’s debut novel is a delicious yarn of friendship and marriage, secrets and retribution, and how nothing stays hidden for long. Against a Southern backdrop of gentility and decorum, Revenge of the Kudzu Debutantes dares to abandon Junior League social graces in ways that would make even Scarlett O’Hara blush.",
  "genres": [
    "Chick Lit",
    "Fiction",
    "Southern",
    "Audiobook",
    "Humor",
    "Womens",
    "Womens Fiction"
  ],
  "author": "Cathy Holton",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/138250.Revenge_of_the_Kudzu_Debutantes"
}