{
  "title": "Black Dahlia Avenger II: Presenting the Follow-Up Investigation and Further Evidence Linking Dr. George Hill Hodel to Los Angeles's Black Dahlia and Other 1940s LONE WOMAN MURDERS",
  "description": "Five New Investigative Chapters added to this 2014 23-LAPD Historical Society—The New EvidenceChapter 24-Odor Mortis—The Smell of DeathChapter 25-The KMEX-Univision InterviewsChapter 26-Murder as a Fine The Hodel/Man Ray NexusChapter 27- New Photo ForensicsIn Black Dahlia Avenger II bestselling author and veteran LAPD homicide detective Steve Hodel presents his eight-year follow-up investigation [2006-2014] into the Los Angeles Black Dahlia and other serially connected 1940s L.A. Lone Woman Murders. After the 2003 publication of his NYT bestseller and MWA Edgar nominated true-fact crime book, Black Dahlia A Genius for Murder, and receiving a \"CASE SOLVED\" legal opinion from many of LA's top law enforcement officials-which included a then active Head Deputy District Attorney and LAPD's Chief of Detectives-Hodel didn't stop there. In this investigative sequel he presents his careful deconstruction of the Dahlia Myth-exposing and correcting the Black Dahlia Murder's Three Greatest Urban No. 1 – “It was a standalone murder\"Myth No. 2 – “There was a Missing or Lost Week\"Myth No. 3 – “The case was never solved.2006-2014 Investigation • The obtaining of Dr. George Hodel's full DNA PROFILE which can now be made available for law enforcement testing and comparison to multiple cold case unsolved crimes.• Discovery of the Hollywood residence where the BLACK DAHLIA MURDER was committed along with physical evidence connecting the killer to the house and to the vacant lot where he later transported and posed the victim's surgically bisected body.• Identification of \"The Baron,\" George Hodel's house-guest and accomplice overheard by detectives discussing \"crimes and payoffs\" on the 1950 DA bugging tapes.• New expert medical testimony and evidence photos proving – “A Doctor did it.\"• Complete original and unabridged 1950 DA-Hodel Black Dahlia Bugging Transcripts. [146 pages]• THE HUSTON LETTERS - Personal correspondence between famed film director, John Huston and his ex-wife, Dorothy Huston Hodel [the author's mother] covering the years 1948-1957. In these private letters Dorothy shares with John the day to day personal fear and terror she was experiencing living with George Hodel, as the doctor threatened her and the children with physical harm in the months just prior to his fleeing the country.• A World Class Surrealist Photographer reveals his firsthand knowledge of the crimes.• Over 300 photographs and crime exhibits including the 1969 Sowden House 17-Photo Historical Survey.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Crime"
  ],
  "author": "Steve Hodel",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/13825252-black-dahlia-avenger-ii"
}