{
  "title": "Genesis",
  "description": "Originally published in 1988, Genesis was the first major work of fiction that addressed the idea of terraforming Mars. It not only suggested the idea, but provided a feasible solution for doing so. During its initial publication, Genesis was on the list of recommended reading at NASA, and has since gone on to enjoy cult status. Its acknowledged list of admirers includes such literary luminaries as Brian Aldiss, Amy Clampitt, Arthur C. Clarke, Thomas M. Disch, Kim Stanley Robinson, and Pulitzer Prize winning poet, James Merrill. It is with great pride that Ilium Press brings this influential and prescient work back into print.Praise for Frederick Turner's epic poetry\"The poem inspires us to go back to the epics of the past, whose roots it shows us to be so much alive after all.\" - Amy Clampitt\"Vivid, effortless narration ... such as I don't think I've ever seen in a poem since the good old days. ... This is a grand, glowing poem. ... A thousand bravos!\" - James Merrill, Pulitzer Prize winning poet \"Frederick Turner comes across in his poems as a man of impressively broad experience, intellectual brilliance, and originality. ... He's at his best when he unleashes his extraordinary powers of observation.\" - Richard Tillinghast \"Myth, religious parable, and science fiction are genetically recombined into lyrical new forms of being. Turner has taken up the most ancient challenges of the poet, delivering work as intellectually charged as formally challenging.\" - Paul Lake \"If the use of epic poetry is to be more than a conceit, it has to be in the service of a tale for which it is better suited than the novel. The epic poem...has historically enjoyed a greater ability to convey a culture's character and spirit through language. Turner uses the strengths of the epic form to good effect. His poems describe and mythologize futures which are more than just extrapolations of our present. He's written good science fiction while creating and presenting a possible future in a way that a novel could not have accomplished. It's good poetry, too.\"  - Dani Zweig \"Frederick Turner is a polymath as well as a poet and I love his work. I have his extraordinary poem Genesis in a place of honor next to those of Homer, Virgil, and Milton.\"- Martyn J. Fogg, President, British Interplanetary Society \"Fred Turner reclaims for poetry its antique privilege of heroic action, its right and, perhaps, primal compulsion to tell a story more sharply, with more economy than can that later idiom which is prose.\" --George Steiner \"Fluent and full of surprises...its sustained narrative is an enviable achievement...\" - Irving Feldman \"...verse narrative of great power.\" - Guy Davenport \"A beautiful and impressive long poem.\" - Charles Edward Eaton",
  "genres": [
    "Poetry",
    "Fiction"
  ],
  "author": "Frederick  Turner",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/13825837-genesis"
}