{
  "title": "Campfire Chillers",
  "description": "Are you sitting comfortably? Enjoy it while you can. For The Scoutmaster is about to tell you some stories...dark tales of the Great Outdoors, told over the flames of a campfire that will chill you to the bone... The Screaming \"He's so angry - so jealous - of the living...all he needs is a way through, a story to give him life, to keep his memory alive...\" - Midsummer's Eve is a bad time to tell a story about a scout taken by the spectre of his dreams...prepare yourself for a Midsummer Nightmare... Rock \"Take it easy. This mountain is always hungry...\" A name from the past leads explorer scout Steve Wilding into a cave from nowhere, where the past becomes his eternal future... House of \"Some places are defined by their past, and will do their utmost to make sure history is not only remembered, but repeated...\" A mysterious house is a beacon for a group of lost and weary travellers, but this beacon is a light that shines from Hell itself... Guess What We're Having For Supper? \"We can catch it and kill it. And we have to do it fast, before we become too weak to hunt it down...\" A lost Outward Bound group are starving, and stalked by something in the fog. The two group leaders go off to get help, but only one returns. With food... New \"No fire can warm me\"' The new boy is no ghost, however. He is a servant of something dark and terrible - and eternal, as the gift of the timepiece to Robert Moyles will show... Cross Your \"Guilt is a hungry beast.\" An act of remembrance...the memory of a terrible mistake...and a plea for forgiveness that falls on undead ears... Cold \"No, we're not lost at all. We're exactly where we need to be.\" An antique compass points two lost youths in a new direction, to a marker with grave consequences... Tooth and \"We have to have justice out here in the wild, right?\" A stolen Siberian white tiger is the quarry for five hunters - five hunters who become the quarry themselves, but for a different creature. A hunter unlike anything seen before... The Great Outdoors have never been so chilling. Sit closer by the fire. Pray for dawn.",
  "genres": [],
  "author": "Dave Jeffery",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/13826661-campfire-chillers"
}