{
  "title": "Honest Jeff and Dishonest Abe: A Southern Children's Guide to the Civil War",
  "description": "If you're a Southern parent who's fed up with the Yankee myths, distortions, lies, and anti-South propaganda your child is being taught at school about the Civil War, then Honest Jeff and Dishonest Abe is for you. Award-winning author and Southern historian Colonel Lochlainn Seabrook, one of the world's leading pro-South writers, has created an incomparable guide specifically for Southern children, one that teaches them the Truth about Lincoln's War - from the South's perspective!Written for ages 8-12 (grades 2-6), the book is conveniently divided into six sections and thirty-seven chapters, and covers all of the salient facts and events of the War. Included are chapters on the causes that led up to the conflict, the real origins of American slavery, the truth about Southern slavery, the start of the War, the secession of the Southern states, descriptions of significant battles, the Emancipation Proclamation, the Gettysburg Address, Lincoln's criminal behavior, black Confederates, Robert E. Lee's surrender, the everyday life of a Confederate soldier, and Confederate weaponry.The author also provides detailed information on the many suppressed elements of the War, including discussions on the Constitution, politics, and American history, covering politically incorrect facts that your child will never hear in school. Profusely illustrated (with black and white pictures that can be colored), this children's version of Col. Seabrook's international blockbuster Everything You Were Taught About the Civil Is Wrong, Ask a Southerner! explodes the Northern fairy tales that were created to hide the Truth about the War for Southern Independence and the countless atrocities committed by the Union.Honest Jeff and Dishonest A Southern Children's Guide to the Civil War , the result of some twenty years of study and research, will not only help educate your child about the real Civil War, it will also teach them about the traditional values that have always been so important here in a love of God, country, and family, respect for our Southern heritage, pride in our Confederate history, and a reverence for our Southern ancestors. Adults will benefit from reading Col. Seabrook's South-friendly book as well, especially non-Southerners who are interested in learning more about the Southern view of Lincoln's War. Like Seabrook's other books on the War, Honest Jeff and Dishonest Abe is destined to become a standard in American literature. Includes a comprehensive glossary, index, and bibliography. The foreword is by Al Benson Jr., publisher of The Copperhead Chronicle . Available in paperback and hardcover.Neo-Victorian historian Lochlainn Seabrook, whose literary works range from astronomy to zoology, is one of the most prolific and popular writers in the world today. A descendant of the families of Alexander H. Stephens, John S. Mosby, Edmund W. Rucker, and William Giles Harding, he is known by literary critics as the \"new Shelby Foote\" and the \"American Robert Graves,\" and by his fans as the \"Voice of the Traditional South.\" The Sons of Confederate Veterans member is a Kentucky Colonel, a recipient of the prestigious Jefferson Davis Historical Gold Medal, and the author and editor of nearly 100 scholarly books (currently). Described by his readers as \"game changers\" and \"life-altering,\" his voluminous writings have introduced hundreds of thousands to vital facts that have been left out of our mainstream books. A 7th generation Kentuckian of Appalachian heritage and the 6th great-grandson of the Earl of Oxford, Col. Seabrook has a 45-year background in American and Southern history, and is the author of the worldwide bestseller Abraham Lincoln Was a Liberal, Jefferson Davis Was a The Missing Key to Understanding the American Civil War .",
  "genres": [],
  "author": "Lochlainn Seabrook",
  "average_rating": "2.50",
  "url": "https://www.goodreads.com/book/show/13827155-honest-jeff-and-dishonest-abe"
}