{
  "title": "Jay Christian's Hollywood Celebrity Recipes",
  "description": "It’s fun! Jay Christian's Hollywood Celebrity Recipes is a simple, easy-to-read cookbook, loaded with a wonderful variety of delicious dishes from all the greatest Hollywood legends. Discover a more personal side of your favorite celebrity, as they share their favorite recipe with you!Perfect for all Hollywood aficionados, movie and television buffs and even music fans- Hollywood icons galore are in this book with full page, full-color photos of the stars. All of the recipes were personally given to Jay by the stars themselves. The celebrities appearing in this book Bob Barker, Beau Bridges, Dick Clark, Charlie Daniels, Crystal Gayle, Jeremy Irons, Jacklyn Zeman, Lynda Carter, Angie Dickinson, Mary Hart, Jerry Lee Lewis, Doris Roberts, Dee Wallace, Vanna White, Cindy Williams, Anne Archer, Ernest Borgnine, Maria Canals-Barrera, Dyan Cannon, Phyllis Diller, Bob Dylan, Elvira, Lou Ferrigno, Monty Hall, David Hasselhoff, James Earl Jones, Jay Leno, Shirley MacLaine, Donny Osmond, Cassandra Peterson, Michelle Phillips, Debbie Reynolds, Marion Ross, Tiffany Thornton, Randy Travis, Dick Van Patten, Loni Anderson, Barbara Eden, Cheryl Ladd, Angela Lansbury, Barbara Mandrell, Johnny Mathis, Dolly Parton, Willard Scott, Andy Williams. And special tribute to those who have passed- Bob Hope, Michael Landon, Janet Leigh, Carroll O' Connor, Vincent Price, Lynn Redgrave, Dale Evans Rogers, Roy Rogers & Red Skelton.With Appetizers, Sauces, Sides, Salads, Soups, Main Dishes and Desserts- you’ll never get bored and you’ll be pleased with how well these recipes turn out. Surprise someone close to you, by making a scrumptious meal from the recipes, that your favorite stars make in their own kitchens! Some of the Main dishes Chicken & Dumplings, Shrimp Santa Fe, Heavenly Eggplant, Risotto with Asparagus, Pork Chops Italiano, Chicken Enchiladas, Picadillo, Gourmet Lamb Stew, Stuffed Cabbage, Seafood Fettuccini, Pasta E Fazul Con Verdure, Coconut Shrimp, Pevronatta, Chicken and Mushrooms Mediterranean Style, etc. Accent that with a choice of salads, such Fresh Garden Salad, Potato Salad, Corn Salad or Caesar Salad. But don’t forget to leave room to indulge in simple, yet elegant desserts Red Velvet Cake, Strawberry Pie, Cheesecake, Sticky Toffee Pudding, Chocolate Cake, Apple Cake or even Lemon Ice Cream Pie! Perfect for the holidays and all-year-round enjoyment, buy one for yourself and surprise a friend, mother, grandmother, aunt or anyone that’s a foodie with this thoughtful gift!",
  "genres": [
    "Cookbooks"
  ],
  "author": "Jay   Christian",
  "average_rating": "4.82",
  "url": "https://www.goodreads.com/book/show/13828713-jay-christian-s-hollywood-celebrity-recipes"
}