{
  "title": "Burning Daylight",
  "description": "Elam Harnish has more money than he would ever need. As he accumulates wealth as a successful entrepreneur in the Alaskan Gold Rush, Harnish must face the challenges of the Yukon Territory. After he makes a fortune, Harnish finds himself still unsatisfied. In efforts to find a new challenge and make more money, Harnish decides to move down to the mainland of America, settling in California. However, after a group of money kings threaten to take his entire amassed fortune, Harnish resorts to violence to recover it, endangering him both physically and morally as he slides down a slippery slope of immorality. Realizing that he can make even more money with undercut business practices, Harnish slowly becomes corrupt, making shady business deals, cheating, and being dishonest. While it gives him more wealth, Harnish soon realizes that money is not all he wants in life. After one of his employees catch his eye, Harnish resorts to harassing her for attention. However, she is a woman of strong will and morals, and refuses his advances. Harnish realizes that she will never reciprocate his attraction if he continues his shady business dealings, but what if it is too late to redeem himself?Filled with action and suspense, Jack London's Burning Daylight  brings an exciting twist to the classic enemies to lovers storyline. Featuring two exciting settings--California and Alaska, Burning Daylight is an entertaining glimpse into the gold rush era of the United States. Through the use of amusing caricatures of hyper-masculinity and hyper-femininity, London's romance novel also provides intriguing insight on the early 20th century gender expectations. Burning Daylight  has inspired several film adaptations over the years, and was among the list of best-selling books when it was released in 1910. With adaptations and record sales, Jack London's Burning Daylight proves that it is a prolific work able to be enjoyed by audiences even in the 21st century.This edition of Burning Daylight by Jack London is now presented with a new, eye-catching cover and is printed in an easy-to-read font, making it both modern and accessible.",
  "genres": [
    "Fiction",
    "Classics",
    "Adventure",
    "Historical Fiction",
    "American",
    "Novels",
    "Audiobook"
  ],
  "author": "Jack London",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/1382939.Burning_Daylight"
}