{
  "title": "Extra Innings: He was the greatest hitter of all time. Cryonics brought him back to life in 2092. Would he use this second chance to win his first World Series or to become a better man?",
  "description": "In the year 2092, Ted Williams, the greatest baseball hitter of all time, is brought back to life through the science of cryonics. Once again playing for the Red Sox, Williams finds himself trapped in a world he hardly the corruption of the game he loves with über-juiced batters and robot pitchers; difficult love affairs clashing with his old desires; and a military conflict of the future in which he must harness the fighter pilot skills he used in his first life. Dr. Elizabeth Miles is the cryonicist who brings him back to life, initiating a dramatic sequence of medical achievements. She and her young son Johnnie are a constant reminder of what Williams lacked in his first trip around the bases, never devoting much time to love and family. But old habits die hard. With enemies and allies both on the field and off, Williams must make sense of it all and play on against a machine that he detests, pressure to take the “giddyup” he abhors, unrelenting media mania, and a dystopian world he can’t ignore. The narrative resonates with the consequences of the major issues we face in our world today—the steroids debate in sports, global warming, corporate greed, technology run rampant, and the moral ambiguity of war. Extra Innings is alternately poignant and humorous, heartbreaking and joyous. Thought-provoking throughout, it’s a rollicking ride that looks at second chances and redemption, the ability to triumph over adversity, and the search for meaning in this life and the next. Flawed in his first life, Williams must decide in the second what’s more important, the chance to win his first World Series, or the chance to be a better man? The Greatest Comeback of All Time is More Than Just a Game.",
  "genres": [
    "Baseball",
    "Fiction"
  ],
  "author": "Bruce E. Spitzer",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/13829513-extra-innings"
}