{
  "title": "The Dragon King of Beijing",
  "description": "An Ancient Prophecy. A Secret Destiny. An Incredible Magic and Fantasy Adventure. On the first day of the Year of the Dragon, Master Ming Wu, a Chinese dragon disguised as a mysterious elderly gardener, makes orphan Little Tiger his son and heir, secretly putting the fate of the world into the boy's hands. Suddenly finding his life in terrible danger, Little Tiger must flee China, indeed the Asian continent, for the safety of North America -- Tarpon Springs, Florida, to be exact -- where his destiny awaits for him. Little Tiger and the Year of the Dragon is a 3-part fantasy adventure by author D. B. Patterson and includes these sequential Author's \" Chinese dragons are kind of thin on the ground where I live in Florida, so I had to do some heavy, intense research before I began writing the story of a Chinese orphan leaving his home in Asia and coming to the United States. I spent months delving ancient Asian mythology , specifically the early legends about gods, royalty, magic, sacred beasts, and the strange dance between the worlds of the spirit, the living and the dead. As I shifted from research to world building for my Chinese orphan, I decided to make his story a modern one by bringing him over to my neck of the woods in Florida to see how things play out. \"Rooting the plot in Tarpon Springs, Florida, turned out to be very entertaining for me, as the characters are traveling the world fighting demonic forces, only to come back to a tiny coastal city on the Gulf of Mexico. Having the characters live in a place not terribly known for magic or dragons or heroes really appealed to me. It makes the action of the events that much more extraordinary, which is ultimately what sets this series apart from others similar in its scope. \"There are universal themes in the coming of age , first love, leaving home and going back there, struggling with identity, facing fear, watching loved ones die, discovering your true purpose. It's a multicultural, modern-day myth with bits about hidden ancient royalty and the supernatural (my favorite parts to write). Each character is from somewhere else in the world and has a vital part to play in shaping Little Tiger's journey.\"",
  "genres": [
    "Fantasy"
  ],
  "author": "D.B. Patterson",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/13829816-the-dragon-king-of-beijing"
}