{
  "title": "The Bodies Keep Coming: Dispatches from a Black Trauma Surgeon on Racism, Violence, and How We Heal",
  "description": "A tour de force that diagnoses the structural root of the violence that plagues us allTrauma surgeon and professor Dr. Brian H. Williams has seen it all, from gunshot wounds to stabbings to traumatic brain injuries. In The Bodies Keep Coming, Williams ushers us into the trauma bay, where the wounds of a national emergency amass. As a Harvard-trained physician, he learned to keep his head down and his scalpel ready. As a Black man, he learned to swallow the rage when patients told him to take out the trash. Just days after the tragic police shootings of two Black men, Williams tried to save the lives of police officers shot in Dallas in the deadliest incident for U.S. law enforcement since 9/11. Thrust into the spotlight in a nation that loves feel-good stories about heroism more than hard truths about racism, Williams came to rethink everything he thought he knew about medicine, injustice, and what true healing looks like. Now, in raw and intimate detail, Williams narrates not only the events of that night in 2016, but the grief and anger of a Black doctor on the front lines of trauma care. Working in the physician-writer tradition of Atul Gawande and Damon Tweedy, Williams diagnoses the roots of the violence that plagues us. He draws a through-line between white supremacy, gun violence, and the bodies he tries to revive, and he trains his surgeon's eye on the structural ills that manifest themselves in the bodies of his patients. What if racism is a feature of our healthcare system, not a bug? What if profiting from racial inequality is exactly what it was designed to do? Black and brown bodies will continue to be wracked by all types of violence, Williams argues, until something changes. Until we transform policy and law with compassion and care, the bodies will keep coming.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Medicine",
    "Audiobook",
    "Medical",
    "Social Justice",
    "Health"
  ],
  "author": "Brian H. Williams",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/138343134-the-bodies-keep-coming"
}