{
  "title": "Starlight and Storm: The Conquest of the Great North Faces of the Alps",
  "description": "“One of the great climbers of all time . . . who has discovered through the medium of mountains the true perspective of living.” —Sir John Hunt, author of The Conquest of EverestKnown for his lyrical writing and his ability to convey not only the dangers of mountaineering but the pure exaltation of the climb, Gaston Rébuffat is among the most well-known and revered Alpinists of all time. He rose to international prominence in 1950 as one of the four principal stalwarts in the first ascent of Annapurna, the highest mountain climbed at that time. Yet his finest feat as a mountaineer was to be the first man to climb all six of the legendary great north faces of the Alps—the Grandes Jorasses, the Piz Badile, the Dru, the Matterhorn, the Cima Grande di Lava-redo, and the Eiger.With this elegant book, first published in 1954, Gaston Rébuffat transformed mountain writing. His insistence on seeing a climb as an act of harmonious communion with the mountain, not a battle waged against it, seemed radical at the time, though Rébuffat’s aesthetic has since won the day. Through storms, avalanches, rock fall, unplanned bivouacs, and even the deaths of companions, we follow the Chamonix guide to the altar of his communion, on dark, icy walls that struck terror into the hearts of Europe’s finest mountaineers. Nor are these deft narratives mere recitations of dangers faced and obstacles overcome, for Rébuffat pays as keen attention to the joys of comradeship won on these faces as he does to the climbs themselves. In our own day of corporate sponsorships, online expeditions, and eco-vacations, the purity of Rébuffat’s vision of the Alps as (in the epithet of the title of another of his books) an “enchanted garden” shines forth in prose as fresh and stylish as any ever lavished on mountaineering.",
  "genres": [
    "Mountaineering",
    "Adventure",
    "Nonfiction",
    "Climbing",
    "Memoir",
    "Travel",
    "Biography"
  ],
  "author": "Gaston Rébuffat",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/1383504.Starlight_and_Storm"
}