{
  "title": "The Indian Tipi: Its History, Construction, and Use, 2nd Edition",
  "description": "When the first edition of this book was published in 1957, the art of making a tipi was almost lost, even among American Indians. Since that time a tremendous resurgence of interest in the Indian way of life has occurred, resurgence due in part, at least, to the Laubins' life-long efforts at preservation and interpretation of Indian culture. As The Indian Tipi makes obvious, the American Indian is both a practical person and a natural artist. Indian inventions are commonly both serviceable and beautiful. Other tents are hard to pitch, hot in summer, cold in winter, poorly lighted, unventilated, easily blown down, and ugly to boot. The conical tipi of the Plains Indian has none of these faults. It can be pitched by one person. It is roomy, well ventilated at all times, cool in summer, well lighted, proof against high winds and heavy downpours, and, with its cheerful fire inside, snug in the severest winter weather. Moreover, its tilted cone, trim smoke flaps, and crown of poles, presenting a different silhouette from every angle, form a shapely, stately dwelling even without decoration. In this new edition the Laubins have retained all the invaluable aspects of the first edition, and have added a tremendous amount of new material on day-to-day living in the the section on Indian cooking has been expanded to include a large number and range of Indian foods and recipes, as well as methods of cooking over an open fire, with a reflector oven, and with a ground oven; there are new sections on making buckskin, making moccasins, and making cradle boards; there is a whole new section on child care and general household hints. Shoshoni, Cree, and Assiniboine designs have been added to the long list of tribal tipi types discussed. This new edition is richly illustrated with color and black and white photographs, and drawings to aid in constructing and living in the tipi. It is written primarily for the interested amateur, and will appeal to anyone who likes camping, the out-of-doors, and American Indian lore.",
  "genres": [
    "Nonfiction",
    "Native American"
  ],
  "author": "Reginald Laubin",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/1045238.The_Indian_Tipi"
}