{
  "title": "What Women Want Men to Know: The Ultimate Book About Love, Sex, and Relationships for You and the Man You Love",
  "description": "FINALLY -- THE BOOK ON RELATIONSHIPS WOMEN HAVE BEEN WAITING TO READ -- AND GIVE TO THE MAN THEY LOVE!You've seen her on TV. You've read her advice on relationships. Now, in her most powerful and provocative book yet, best-selling author and renowned human relations expert Barbara De Angelis, Ph.D., reveals everything women want men to know about loving and understanding the women in their life. This is the book women have always hoped someone would write -- one that women will read to understand themselves better, and can give to their mate, confident that it will explain everything women feel about love, communication, sex, and intimacy that they've always wished men would know.WOMEN AND MEN WILL IF YOU'RE A Read this book to learn what you can do to be a woman's dream come true.IF YOU'RE A Read this book to learn why you are the way you are, and give it to the man you love so you can have the relationship you've always wanted.Ever since Barbara De Angelis wrote the #1 New York Times bestseller Secrets About Men Every Woman Should Know , her readers have been begging her to write its counterparts book for both sexes that explains what women want men to know about understanding and loving the woman in their life. Delivered in her signature frank, provocative and down-to-earth style, this new book does just that, and is an insightful guide that women will read to learn more about themselves, and that they will be excited to give to the man they love.HELPING MEN TO UNDERSTAND WOMENBarbara includes groundbreaking information on the nature of women that will make you feel better about yourself than ever before, and will help men understand the real you.",
  "genres": [
    "Psychology",
    "Self Help",
    "Nonfiction",
    "Relationships",
    "Personal Development",
    "Marriage",
    "Audiobook"
  ],
  "author": "Barbara De Angelis",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/138366.What_Women_Want_Men_to_Know"
}