{
  "title": "The Diamond of London",
  "description": "Born into an illustrious family of swashbuckling war heroes and brilliant political leaders, Lady Hester Stanhope was a Regency-era adventuress who lived on her own terms and refused to conform.Fans of Shana Abé, Theresa Ann Fowler, and Fiona Davis will be captivated by the unforgettable spirit at the heart of USA Today bestselling author Andrea Penrose’s dazzling new historical novel based on the real life of Lady Hester Stanhope (1776-1839), a British aristocrat, antiquarian, and adventurer who defied all conventional strictures of what a woman could and couldn’t do during the Regency era.Even with her privileged life, Lady Hester Stanhope knows that claiming the adventurous life she truly wants will not be easy, thanks to her eccentric father’s stifling grip. With the help of her renowned statesman uncle William Pitt the Younger, she takes on the glittering, treacherous heights of London Society. Her formidable intelligence, outspoken opinions, and headstrong determination gain the favor of the beau monde’s leading taste-maker Beau Brummell—and she quickly learns to bend the rules of the ton to her own advantage. And as her uncle’s hostess, she astutely uses her skills to preside over—and give advice to—the most influential figures of her day, rising to a position unequaled in society . . .But when it comes to holy matrimony, Hester will settle for no less than a passionate match of equals—a search marked by challenges and heartbreak. Her affair with a charismatic naval officer tempts her with forbidden pleasures—even as it threatens her reputation. Her love for a sophisticated, brilliant diplomat offers the marriage of her dreams . . . and unsuspected betrayal. And as England is plunged into war, Hester’s world changes forever, causing her to find courage and strength amid loss, chart a completely unexpected future—and make a glorious legacy forever hers . . .",
  "genres": [
    "Historical Fiction",
    "Historical",
    "Fiction",
    "Book Club",
    "Novels",
    "Drama",
    "Romance"
  ],
  "author": "Andrea Penrose",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/138378623-the-diamond-of-london"
}