{
  "title": "Formal and Transcendental Logic",
  "description": "\"What we today call science, in our pregnant sense of the word, is not science in the historically oldest sense, that of a naively straightforwardly effected work of theoretical reason. Only in aloose sense do we still refer to the philosophies of the pre-Platonic age, or similar cultural formations of other peoples and times, as sciences. Only as preliminary forms, as stages preliminary to science, do we accept them. Science in a new sense arises in the first instance from Plato's establishing of logic, as a place for exploring the essential requirements of \"genuine\" knowledge and \"genuine\" science and thus discovering norms, in conformity with which a science consciously aiming at thorough justness, a science consciously justifying its method and theory by norms, might be built. In intention this logical justification is a justification deriving entirely from pure principles. Science in the Platonic sense intends, then, to be no longer a merely naive activity prompted by a purely theoretical interest. Every step that it takes, it also demands to justify as genuine, as necessarily valid, according to principles. Thus the original sense here is that logical insight into principles, the insight drawn from the pure idea of any possible cognition and method of cognition whatever, precedes the method factually employed and the factual shaping of science, and guides them in practice; whereas the fact of a method and of a science, which have grown up somehow in nalvete must not pass itself off as a norm for rightly shaping scientific production.Plato's logic arose from the reaction against the universal denial of science by sophistic skepticism. If skepticism denied the essential possibility of any such thing as \"philosophy\", as science, then Plato had to weigh, and establish by criticism, precisely the essential possibility of such a thing. If all science was called in question, then naturally no fact, science, could be presupposed. Thus Plato was set on the path to the pure idea. Not gathered from the de facto sciences but formative of pure norms, his dialectic of pure ideas — as we say, his logic or his theory of science — was called on to make genuine science possible now for the first time, to guide its practice. And precisely in fulfilling this vocation the Platonic dialectic actually helped create sciences in the pregnant sense, sciences that were consciously sustained by the idea of logical science and sought to actualize it so far as possible. Such were the strict mathematics and natural science whose further developments at higher stages are our modern sciences.But the original relationship between logic and science has undergone a remarkable reversal in modern times. The sciences made themselves independent. Without being able to satisfy completely the spirit of critical self-justification, they fashioned extremely differentiated methods, whose fruitfulness, it is true, was practically certain, but whose productivity was not clarified by ultimate insight. They fashioned these methods, not indeed with the everyday man's naivete, but still with a naivete of a higher level, which abandoned the appeal to the pure idea, the justifying of method by pure principles, according to ultimate apriori possibilities and necessities. In other words: logic, which was originally the torchbearer for method and claimed to be the theory of the pure principles of possible cognition and science, lost this historical vocation and lagged far behind in its development.\" - from Husserl's Introduction",
  "genres": [
    "Philosophy",
    "Logic",
    "German Literature"
  ],
  "author": "Edmund Husserl",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/1384027.Formal_and_Transcendental_Logic"
}