{
  "title": "Guard of Honor",
  "description": "Guard of Honor is a neglected masterpiece that stands comparison with the greatest novels of the Second World War--essayist Noel Perrin deemed it \"probably the best war novel of the twentieth century.\"----James Gould Cozzens's Guard of Honor won the Pulitzer Prize in 1949. The novel balances a vast cast of intricately enmeshed characters as they react over the course of three tense days in September 1943 to a racial incident on a U.S. Army airbase in Florida. The reader is acutely aware of the war raging abroad and the effect it has had, or will have, on the multitude of servicemen who populate Cozzens's immense canvas. As Noel Perrin commented in The Washington Post Book \"There is material for two or three hundred movies in Guard of Honor.\"----\"No other American novelist of our time writes with such profound understanding of the wellsprings of human character and of the social pressures that help to form it,\" said Orville Prescott in The New York Times. As Brendan Gill observed in The New \"Every page of Guard of Honor gives the impression of a writer at the very top of his powers setting out to accomplish nothing less than his masterwork.\"The Modern Library has played a significant role in American cultural life for the better part of a century. The series was founded in 1917 by the publishers Boni and Liveright and eight years later acquired by Bennett Cerf and Donald Klopfer. It provided the foun-dation for their next publishing venture, Random House. The Modern Library has been a staple of the American book trade, providing readers with affordable hardbound editions of important works of literature and thought. For the Modern Library's seventy-fifth anniversary, Random House redesigned the series, restoring as its emblem the running torchbearer created by Lucian Bernhard in 1925 and refurbishing jackets, bindings, and type, as well as inaugurating a new program of selecting titles. The Modern Library continues to provide the world's best books, at the best prices.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "War",
    "Classics",
    "Literature",
    "World War II",
    "Historical"
  ],
  "author": "James Gould Cozzens",
  "average_rating": "3.47",
  "url": "https://www.goodreads.com/book/show/1045278.Guard_of_Honor"
}