{
  "title": "The Skin",
  "description": "Una terribile peste dilaga a Napoli dal giorno in cui, nell’ottobre del 1943, gli eserciti alleati vi sono entrati come liberatori: una peste che corrompe non il corpo ma l’anima, spingendo le donne a vendersi e gli uomini a calpestare il rispetto di sé. Trasformata in un inferno di abiezione, la città offre visioni di un osceno, straziante orrore: la ragazza che in un tugurio, aprendo «lentamente la rosea e nera tenaglia delle gambe», lascia che i soldati, per un dollaro, verifichino la sua verginità; le «parrucche» bionde o ruggine o tizianesche di cui donne con i capelli ossigenati e la pelle bianca di cipria si coprono il pube, perché; i bambini seminudi e pieni di terrore che megere dal viso incrostato di belletto vendono ai soldati marocchini, dimentiche del fatto che a Napoli i bambini sono la sola cosa sacra. La peste – è questa l’indicibile verità – è nella mano pietosa e fraterna dei liberatori, nella loro incapacità di scorgere le forze misteriose e oscure che a Napoli governano gli uomini e i fatti della vita, nella loro convinzione che un popolo vinto non possa che essere un popolo di colpevoli. Null’altro rimane allora se non la lotta per salvare la pelle: non l’anima, come un tempo, o l’onore, la libertà, la giustizia, ma la «schifosa pelle». E, forse, la pietà: quella che in uno dei più bei capitoli di questo insostenibile e splendido romanzo – uno dei pochi che negli anni successivi alla guerra abbiano lasciato un solco indelebile nel mondo intero – spinge Consuelo Caracciolo a denudarsi per rivestire del suo abito di raso, delle calze, degli scarpini di seta la giovane del Pallonetto morta in un bombardamento, trasformandola in Principessa delle Fate o in una statua della Madonna. Come ha scritto Milan Kundera, nella Pelle Malaparte «con le sue parole fa male a se stesso e agli altri; chi parla è un uomo che soffre. Non uno scrittore impegnato. Un poeta».",
  "genres": [
    "Fiction",
    "Italy",
    "Italian Literature",
    "War",
    "Literature",
    "Historical Fiction",
    "Classics"
  ],
  "author": "Curzio Malaparte",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/138456.The_Skin"
}