{
  "title": "Doppelganger: A Trip into the Mirror World",
  "description": "What if you woke up one morning and found you’d acquired another self―a double who was almost you and yet not you at all? What if that double shared many of your preoccupations but, in a twisted, upside-down way, furthered the very causes you’d devoted your life to fighting against?Not long ago, the celebrated activist and public intellectual Naomi Klein had just such an experience―she was confronted with a doppelganger whose views she found abhorrent but whose name and public persona were sufficiently similar to her own that many people got confused about who was who. Destabilized, she lost her bearings, until she began to understand the experience as one manifestation of a strangeness many of us have come to know but struggle to define: AI-generated text is blurring the line between genuine and spurious communication; New Age wellness entrepreneurs turned anti-vaxxers are scrambling familiar political allegiances of left and right; and liberal democracies are teetering on the edge of absurdist authoritarianism, even as the oceans rise. Under such conditions, reality itself seems to have become unmoored. Is there a cure for our moment of collective vertigo?Naomi Klein is one of our most trenchant and influential social critics, an essential analyst of what branding, austerity, and climate profiteering have done to our societies and souls. Here she turns her gaze inward to our psychic landscapes, and outward to the possibilities for building hope amid intersecting economic, medical, and political crises. With the assistance of Sigmund Freud, Jordan Peele, Alfred Hitchcock, and bell hooks, among other accomplices, Klein uses wry humor and a keen sense of the ridiculous to face the strange doubles that haunt us―and that have come to feel as intimate and proximate as a warped reflection in the mirror.Combining comic memoir with chilling reportage and cobweb-clearing analysis, Klein seeks to smash that mirror and chart a path beyond despair. Doppelganger What do we neglect as we polish and perfect our digital reflections? Is it possible to dispose of our doubles and overcome the pathologies of a culture of multiplication? Can we create a politics of collective care and undertake a true reckoning with historical crimes? The result is a revelatory treatment of the way many of us think and feel now―and an intellectual adventure story for our times.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Memoir",
    "Audiobook",
    "Sociology",
    "Psychology",
    "Philosophy"
  ],
  "author": "Naomi Klein",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/138505710-doppelganger"
}