{
  "title": "The World of the Pharaohs: A Complete Guide to Ancient Egypt",
  "description": "Author Christine El Mahdy, formerly Christine Hobson. Here, for everyone intrigued by the ancient land of the pyramids, is a comprehensive record of civilization along the Nile and an in-depth account of Egyptian archaeology from its beginnings.With the decipherment of hieroglyphics in the early nineteenth century, many of the secrets of the pharaohs and their culture were revealed for the first time to the modern world. Adventurers and fortune hunters as well as scholars flocked to Egypt, thus initiating the plunder of priceless relics that had lain virtually untouched for thousands of years. The destruction of much that would have yielded valuable clues about ancient Egypt alerted concerned individuals, and gradually the new field of Egyptology was born.Christine Hobson takes the reader on a tour of the pharaohs' world, surveying the work of the pioneer archaeologists, from Flinders Petrie at Amarna and Howard Carter in the Valley of the Kings to Geoffrey Martin at Saqqara, where his remarkable new excavations have revealed the tomb of Tutankhamun's treasurer, Maya.Specially designed features give at-a-glance information on every aspect of the Egyptian achievement, from temples, tombs, and pyramids to mummies and hieroglyphs. In addition, the author examines the mysteries of Egyptian religion, explains clearly and entertainingly the complexities of Egyptian kingship, and brings to life the daily routine of the common worker. The main part of this invaluable book is backed up by a gazetteer of sites to visit, as well as a king-list and a comparative chronology of ancient civilizations.A work of reference and a sourcebook of ideas and information, this is above all a book to enjoy for its highly readable text and marvelousillustrations.",
  "genres": [
    "History",
    "Nonfiction",
    "Egypt",
    "Archaeology",
    "Childrens"
  ],
  "author": "Christine Hobson",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/1385377.The_World_of_the_Pharaohs"
}