{
  "title": "Moosewood Restaurant Simple Suppers: Fresh Ideas for the Weeknight Table",
  "description": "The Moosewood Collective goes back to basics with Moosewood Restaurant Simple Suppers to deliver more than 175 fresh, imaginative, and quickly prepared dishes for the weeknight table that are also delicious and reliable.Whole grains. Fresh fruits and vegetables. Lean, nutrient-rich fish. We all know the virtues of a well-balanced diet—of choosing foods that nourish our bodies and respect the environment—but as the world around us gets busier and more complicated, we also know how difficult it can be to prepare a wholesome, satisfying supper. With an emphasis on healthful natural foods, Moosewood Restaurant has operated successfully for more than thirty years and has been acclaimed as a driving force in the world of creative vegetarian cuisine.Shortcut Chili. Creamy Lemon Pasta. Warm French Lentil Salad. Pine Nut–Crusted Fish. Mocha Sorbet. From soups and pastas made with just a few pantry essentials to crisp salads, stir-fries, sandwiches, and desserts, these easy-to-prepare recipes are brilliant as is. However, the folks at Moosewood realize that flexibility is the cornerstone of weeknight cooking, so you’ll find clever ingredient substitutions, alternative cooking methods, and serving suggestions alongside the recipes in Simple Suppers —it all depends on what’s in the fridge and what sounds appetizing at the moment. Make extra Fresh Tomato and Mozzarella Salad on Monday and toss leftovers with hot pasta for Tuesday’s supper. No onions for Black Beans with Pickled Red Onions? Try the beans over rice with Quick Avocado and Corn Salsa instead. The 175-plus recipes in Moosewood Restaurant Simple Suppers are as flexible as they are flavorful—the perfect go-to for a quick, healthy meal any day of the week, any time of year.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction",
    "Reference",
    "Vegetarian",
    "Vegan"
  ],
  "author": "The Moosewood Collective",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/138534.Moosewood_Restaurant_Simple_Suppers"
}