{
  "title": "Rites of Peace: The Fall of Napoleon and the Congress of Vienna",
  "description": "In the wake of Napoleon's disastrous Russian campaign of 1812, the French emperor's imperious grip on Europe began to weaken, raising the question of how the continent was to be reconstructed after his defeat. While the Treaty of Paris that followed Napoleon's exile in 1814 put an end to a quarter century of revolution and war in Europe, it left the future of the continent hanging in the balance.Eager to negotiate a workable and lasting peace, the major powers—Britain, Austria, Prussia, and Russia—along with a host of lesser nations, began a series of committee sessions in Vienna: an eight-month-long carnival that combined political negotiations with balls, dinners, artistic performances, hunts, tournaments, picnics, and other sundry forms of entertainment for the thousands of aristocrats who had gathered in the Austrian capital. Although the Congress of Vienna resulted in an unprecedented level of stability in Europe, the price of peace would be high. Many of the crucial questions were decided on the battlefield or in squalid roadside cottages amid the vagaries of war. And the proceedings in Vienna itself were not as decorous as is usually represented.Internationally bestselling author Adam Zamoyski draws on a wide range of original sources, which include not only official documents, private letters, diaries, and firsthand accounts, but also the reports of police spies and informers, to reveal the steamy atmosphere of greed and lust in which the new Europe was forged. Meticulously researched, masterfully told, and featuring a cast of some of the most influential and powerful figures in history, including Tsar Alexander, Metternich, Talleyrand, and the Duke of Wellington, Rites of Peace tells the story of these extraordinary events and their profound historical consequences.",
  "genres": [
    "History",
    "Nonfiction",
    "European History",
    "France",
    "Politics",
    "19th Century",
    "Germany"
  ],
  "author": "Adam Zamoyski",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/138831.Rites_of_Peace"
}