{
  "title": "The Object of Love",
  "description": "In Sharon Cullars' dazzling new novel, two unlikely lovers give in to explosive desire. But guilt and long-buried secrets could destroy their future before it begins . . . It's been five years since Lacey Burnham saw Sean Logan, and in that time her son Calvin's best friend has turned from a surly youth into a handsome, self-assured young man. Crushed with grief over Cal's sudden death, Lacey offers Sean a place to stay while he's in town-an innocent proposal that quickly becomes anything but. Lacey is stunned and confused by the yearning he ignites with a single kiss . . . Beautiful, warmhearted Lacey Burnham was a haven of comfort in Sean's troubled youth. Now, against every shred of logic she possesses, Lacey is falling hard for Sean and for a heady carnal bliss she's never experienced before. But the ghosts of the past are waiting. And sooner or later, every shadow must face the light of day . . . \"Chilling and deliciously erotic by turns, an absorbing rollercoaster ride of a book\" -Angela Knight on Again Sharon Cullars lives in Chicago where she works as a research analyst for a professional association. In her spare time, she reads whatever she can lay her hands on, but particularly loves works that allow her to make an emotional connection to the characters. She does not limit herself to any one genre and is a lover of mystery, romance, horror and sci-fi. She also enjoys various types of music, but generally gravitates toward soft jazz. She has written several short stories, one of which is due to be published in Masques V, an anthology of horror literature. In addition to writing, she hosts the Short Stories section of Bella Online, a comprehensive site for women. When she feels in the mood, she also dabbles in 3D art or just enjoys the wonderful attractions of the city of Chicago.",
  "genres": [
    "Romance",
    "Interracial Romance",
    "Paranormal",
    "Contemporary",
    "Contemporary Romance",
    "Suspense",
    "Erotica"
  ],
  "author": "Sharon Cullars",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/1388799.The_Object_of_Love"
}