{
  "title": "Set Her on a Throne",
  "description": "Anne Neville was born into the wealthiest and most politically powerful family of England. Devoid of rights and yet loyal to the family into which she was born, Anne became the pawn of three men who were determined to make her queen. When she was just fourteen years old, Anne was thrust into the middle of the war between the Lancasters and the Yorks. Her father, Richard Neville, 16th Earl of Warwick, made a treasonous alliance with the exiled queen of Lancaster, Margaret of Anjou and ordered Anne to marry Margaret’s son, Edward of Lancaster, Prince of Wales. When her marriage to Prince Edward ended a year later, her father dead and tagged a traitor, Anne found herself at the mercy of the Yorks and the King's brother Richard. Possibly judging that no one could protect her from the greed and jealousy of the House of York except Richard, she bravely consented to marriage. Anne's marriage to Richard was soon followed by the King's death and Richard's ascent to the throne. A triumph cloaked in controversy and murder. Anne Neville was Queen of England for such a brief period that not much beyond the principal facts have been recorded. Customarily the lives of women were chronicled by the accomplishments of their families and spouses, and Anne was no exception. It is only through the eyes of authors such as Jan Westcott that the reader can view the life of women such as Anne Neville and imagine what it was like to walk in the shoes of a 15th century girl born into a noble family. Portrayed as beautiful and ruggedly independent, Anne was barely out of childhood when faced with the harsh realities of a dangerous world and she rose to the challenges with great spirit and courage. Talented Jan Westcott skillfully and succinctly unravels the account of Anne's brief life in this romantic and readable story a young girl's role in a race for the most coveted prize of all ― the English crown.",
  "genres": [
    "Historical Fiction",
    "Fiction"
  ],
  "author": "Jan Westcott",
  "average_rating": "3.24",
  "url": "https://www.goodreads.com/book/show/1389138.Set_Her_on_a_Throne"
}