{
  "title": "A woman of quality",
  "description": "When a beautiful young aristocrat living in Amsterdam chooses to marry Nicolas Theros, a man born on an island in Greece with a lust for life and the power of the ancients in his blood, the city is rocked by scandal. Twenty years later, Nico Theros is once again the subject of gossip. Although he is now a rich man and the Greek Consulate General, he must soon stand on trial for cheating the Dutch government -- and a most unforgiving judge of foreigners who dare to break Dutch laws.The Theros family lives in a tall double house on one of the most coveted streets of nineteenth century Amsterdam. Anna Bakels, Nico's steadfast and still stunningly beautiful wife, runs the household along with her mother, a shrewd business woman in her own right who continues to contribute to the dwindling Theros fortune and upon whom their survival may rest. She and Anna supervise the proper upbringing of the seven Theros children (the three oldest are away at school) as well as an extensive household staff -- a cook, a governess, the children's nurse, housemaids, parlor maids, seamstresses, barbers, and a brawny chauffeur.Among the staff is Kaatje, the first parlormaid, who falls in love with Nico's younger brother, Edward -- handsome and charming, but afflicted with a fatal disease. As Edward's health declines and as the court's verdict is announced, both women find themselves facing lives bereft of the men they love, and with challenges to test their strength and define their futures.Author Jan Westcott's father was born in Holland and her portrayal of the lives of the Theros family reflects her father's love of Holland. Written with great authenticity and detail, A Woman of Quality is a sweeping and sizzling historical romance about nineteenth century Dutch aristocracy with its ties of loyalty and illicit love that bind the members of a great family and the men and women who serve them.",
  "genres": [],
  "author": "Jan Vlachos Westcott",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/1389137.A_woman_of_quality"
}