{
  "title": "Mondo Desperado",
  "description": "Patrick McCabe has long been recognized as a writer of rare talent and unique voice, whose vision of the world is so distinctive that \"McCabesque\" has become an adjective with multiple meanings, including \"exquisitely, beautifully, mad in the head!\" He was a Booker Prize finalist for The Butcher Boy, which won the Irish Times Aer Lingus/Irish Literature Prize for Fiction and was made into a motion picture directed by Neil Jordan and cowritten by McCabe and Jordan. He was again a Booker Prize finalist for Breakfast on Pluto, which won the Spirit of Life Arts/Sunday Independent Irish Literature Award and was a number one international bestseller. McCabe has been described as \"the lodestone of new Irish fiction\" (Wall Street Journal), \"a dark. genius of incongruity and the grotesque\" (Sunday Observer) and \"one of Ireland's finest living writers\" (New York Times Book Review). The Minneapolis Star-Tribune commented on McCabe's \"remarkable...ability to induce compassion for the unlikeliest people,\" and in Mondo A Serial Novel, that ability and the full range of his \"grotesque genius\" (Marie Claire) combine to produce a brilliant, macabre' dementedly funny and surreally imagined fiction of intertwined narratives set in a small Irish town. McCabe himself has described Mondo Desperado as being \"like Sherwood Anderson's Winesburg, Ohio -- on drugs.\" In his mondo tales of the insular town of Barntrosna, McCabe assembles a distinctly Irish crew of odd and unusual inhabitants who live on and regularly cross, often unconsciously, the border between fantasy and reality. In \"Hot Nights at the Go-Go Lounge,\" Larry Bunyan is certain his demure wife is secretly out at night with deadbeat swingers, shooting drugs and having wild sex, while in \"I Ordained the Devil,\" the Bishop of Barntrosna confesses that his ordination of Father Packie Cooley was really an ordination of His Satanic Majesty. Another Barntrosna resident, Dr. John Joe Parkes, discovers \"The Valley of the Flying Jennets,\" the secret place in the mountains created by his Dr. Frankenstein -- type medical ancestor where his horrible, mutated genetic failures live. In the concluding \"Forbidden Love of Noreen Tiernan,\" Noreen escapes Barntrosna, goes to London for nursing school, finds a lesbian lover, and teams up with her to rob and terrorize London until her mother, boyfriend and parish priest bring Noreen back home. With sly wit, characteristic, brilliant blending of sadness and humor and macabre genius, Mondo Desperado is a wonderfully imagined work of fiction -- McCabe's most dazzling yet -- rom a truly original literary talent.",
  "genres": [
    "Fiction",
    "Short Stories",
    "Irish Literature",
    "Ireland",
    "Contemporary"
  ],
  "author": "Patrick McCabe",
  "average_rating": "3.17",
  "url": "https://www.goodreads.com/book/show/138972.Mondo_Desperado"
}