{
  "title": "The Wonder Clock; or, Four and Twenty Marvelous Tales, Being One for Each Hour of the Day",
  "description": "It is rare indeed when a writer's original stories are regarded as masterpieces on a par with the great folkloristic fairy tales that have been handed down through the ages. But Howard Pyle's absorbing tales have for generations enjoyed such overwhelming popularity with boys and girls that they have earned this unique distinction. This collection includes some of his most entertaining and imaginative works—24 delightful fairy tales, one for each hour of the day.When the Wonder Clock strikes one, a story unfolds that reveals how a youth raised by bears and fed on bear milk grew up to be the strongest man in the land and was able to kill the fiery dragon with three heads and rescue the princess. The two o-clock adventure tells of the faithful servant's search for a cup of the Water of Life. Other tales deal with giants and ogres, kings and princesses, wicked stepmothers, three-eyed witches and three-headed dragons, talking animals and talking trees. Among the remaining stories are \"How Boots Befooled the King,\" \"Cousin Greylegs, the Great Red Fox, and Grandfather Mole,\" and \"The Three Little Pigs and the Ogre.\"A large measure of Howard Pyle's amazing success with youngsters is his genius as an illustrator. Accompanying this collection are some of his most unforgettable illustrations, drawings which capture all of the magical splendor of Wonderland and its inhabitants. Each story is preceded by a delightful verse by Katharine Pyle that indicates the hour of the day and sets the stage for the tale which is to follow. This is a collection of fairy tales that no growing boy or girl should be without. Parents, too, will look forward to reading these stories to their children. 148 illustrations.",
  "genres": [
    "Fantasy",
    "Short Stories",
    "Fiction",
    "Fairy Tales",
    "Classics",
    "Childrens",
    "Young Adult"
  ],
  "author": "Howard Pyle",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/1390255.The_Wonder_Clock_or_Four_and_Twenty_Marvelous_Tales_Being_One_for_Each_Hour_of_the_Day"
}