{
  "title": "A Cache of Jewels: And Other Collective Nouns",
  "description": "\"Highly informative and lushly illustrated. An unbeatable combination for pleasure and learning.\" — Children's Book Review Service\" The illustrations and the vocabulary will delight small eyes and ears.\" — School Library JournalQ&A - Ruth Heller - A Paperstar Profile Ruth Heller - ProfileHow did you become interested in writing books for children?I loved reading to my own children, and when they started school, I became the P.T.A. library chairman. I was the one who got to pick and choose and spend a nice fat budget for the elementary school library. I feel as though I?ve been surrounded by children?s books for years.I suppose this and my strong art background are what prompted my trying to write.What is the biggest influence in your style of writing, and how has it changed since you first began?Hillaire Belloc, Gilbert and Sullivan, Edward Lear?I grew up reading all of them. I love their rhythm, and I loved reading Dr. Seuss to my children. No question, these were my influences.I think I?ve become wordier, not quite as minimal and succinct as I used to be.What made you decide to write a series on the parts of speech?Take a peek at the back end paper of the hardcover edition of A Cache of Jewels. You?ll see that I committed myself, in print, to writing a book for each part of speech.Here I am, ten years later, thankfully completing the very last book in this series. It will be published in 1998.Do you begin with the words or pictures when you are developing a book? How does the second part come together?The first step is to decide what I am going to say on each page. Then I can begin to visualize my illustrations. The words dictate what the illustration will be, but that still gives me many options.Sometimes the two come together easily, sometimes not. If not, I pursue new research material until something clicks.Did you learn anything new about the parts of speech while writing these books?I learned many things I had forgotten, and some new information and rules that I had never known. I also learned that the textbooks that I used for research were difficult to understand and somewhat boring, and that I am guilty of frequent misuse of the English language.How do you choose the images in your book?An art teacher once told me to fall in love with whatever I was drawing. So I choose images that I candy, ice cream, butterflies, sea creatures, carousels, jewels, etc.",
  "genres": [
    "Picture Books",
    "Nonfiction",
    "Childrens",
    "Language",
    "Writing",
    "School",
    "Poetry"
  ],
  "author": "Ruth Heller",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/139086.A_Cache_of_Jewels"
}