{
  "title": "The War Poems",
  "description": "Siegfried Sassoon, who lived through World War One and who died in 1967, was, as the introduction to this book tells us, irritated in his later years at always being thought of as a \"war poet\". Understandable perhaps from the point of view of the poet: readers on the other hand might wish to demur. The poems gathered here and chronologically ordered, thereby tracing the course of the war, are an extraordinary testimony to the almost unimaginable experiences of a combatant in that bitter conflict. Moving from the patriotic optimism of the first few poems (\" ... fighting for our freedom, we are free\") to the anguish and anger of the later work (where \"hope, with furtive eyes and grappling fists / Flounders in mud ... \"), there comes a point when the reality of trench-warfare and its aftershocks move beyond comprehension: Sassoon knows this, and it becomes a powerful element in his art. As a book, the images have a cumulative relentlessness that make it almost impossible to read more than a few poems in one sitting.  Unlike the avant-garde experiments developing in Europe in the first decades of this century, Sassoon's verse is formally conservative--but this was perhaps necessary, for as one reads the poems, one feels that the form, the classically inflected tropes, the metre and rhyme, apart from ironising the rhetoric of glory and battle were necessary techniques for containing the emotion (and indeed, a tone of barely controlled irony may have been the only means by which these angry observations would have been considered publishable at the time). When Sassoon's line begins to fragment, as it does in several of the later poems, it is under the extreme pressure to express the inexpressible. Compassion and sympathy are omnipresent here, in their full etymological sense of suffering with or alongside others--something the higher echelons of command (those \" ... old men who died / Slow, natural deaths--old men with ugly souls\") were never able or willing to contemplate. But Sassoon intuited the future of warfare, could sense that this was not \"the war to end all wars\": the mock-religious invocation of the final poem prefigures the vicious euphemisms of more recent conflicts: \"Grant us the power to prove, by poison gases, / The needlessness of shedding human blood.\" Sassoon's bile-black irony signals a deep-felt pessimism: it was with good reason. --Burhan Tufail",
  "genres": [
    "Poetry",
    "War",
    "Classics",
    "World War I",
    "Fiction",
    "British Literature",
    "Politics"
  ],
  "author": "Siegfried Sassoon",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/1391333.The_War_Poems"
}