{
  "title": "In Search of Destiny",
  "description": "In Search of Destiny is set in the disparate realms of the Outlands; Sher Point, the metropolis of the Freelands, and the mystical kingdom of Narayana in the East.It tells the story of Conrad Harper, who sets out one day to search for his destiny and heart's true desire; of the help offered him by a mysterious organization known simply as the Network; his journeys with the Master of the Tradition, Tenzing Jangbu Rinchen, and of his finding romance, ancient knowledge, unfettered awareness and wholeness of being.And it shows how ordinary and everyday experiences, which we tend to take for granted and often do not value, can be brought into service and woven together into a rich tapestry with an altogether higher purpose.In Search of Destiny is the fourth book of the Shadowlands series, in the genre of mystical or psychological faction. You don't have to read the prequels or Escape from the Shadowlands first, you can begin by reading this book. This book has been revised, edited, reformatted and republished for the Kindle on 14 April 2019.THE A little background It's no coincidence that Sher Point, the metropolis of the Freelands, is an anagram of 'the prison', nor is the name 'the Freelands' itself free from a certain irony. The Sirians, who had originally helped instigate the Eden Project, had a hand in this and they were not without a sense of humour, albeit slightly twisted.Nor is it coincidental that the words contain within them 'psion', which is associated with faculties such as telepathy. Such faculties did indeed play a part in the original project when people, though some stages removed from Unity or Reality, were nevertheless still able to benefit from it. However with the catastrophic loss of the Link to the Source, though vestiges of such abilities remained as a kind of by-product of spiritual development (incorrectly prized by some), they were largely lost to the masses.Decay slowly but surely spread through the Eden Project, to the point that the experiment was largely abandoned and the realm ultimately came to be known more fittingly as the Shadowlands ... a mere shadow of the Real World.In spite of these difficulties, and in spite of appearances, help is at-hand, however. There have always been those who have kept alive the tradition and the knowledge of the Hidden World that surrounds us and co-mingles with the everyday, and who help those in real need. There is, for example, the Master Tenzing Jangbu Rinchen, who heads an esoteric organization known simply as the Network, which plays a prominent, if necessarily secretive, role in such activities.All the books (including the soft scifi written as H.M. Forester) have this one surprising thing in the largely unsuspected presence of the Hidden World and of the \"Secret Friends\".",
  "genres": [],
  "author": "Etienne de L'Amour",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/13916864-in-search-of-destiny"
}