{
  "title": "Undressing Emmanuelle: A Memoir",
  "description": "1974: After a year of wrangling with the censors, the erotic film, Emmanuelle, is a blockbuster sensation on release in France and a box office triumph around the world from Japan to the States. The image that adorned cinemas across the world was of an unknown 20 year old posing naked, innocent and vulnerable on a wicker chair. Overnight Sylvia Kristel was propelled into international superstardom (at the height of her fame she was invited to address the Brazilian parliament) and turned into an icon of sexual liberation. Sylvia Kristel was born of a dysfunctional family and an impossibly strict religious education. But having won the Miss TV Europe competition in 1973 she was driven by her own ambition to be an actress on the world stage and auditioned for the part of the innocent seductress in Emmanuelle. Through the phenomenal success of the three Emmanuelle films she starred in, she became the darling of Hollywood, as she seduced and was seduced by the rich and the beautiful of the golden age of cinema. But she found herself typecast as Emmanuelle and often played roles that capitalized upon that image, most notably starring in an adaptation of 'Lady Chatterly's Lover', and a nudity-filled biopic of World War I spy, Mata Hari, in which she played the title role. Almost inevitably she became the victim of her own innocence as it was Emmanuelle people wanted, not Sylvia. The price that she paid for her meteoric rise was an equally rapid descent into an excess of alcohol and drugs as her tempestuous family life threatened to fall apart all together. Naked, candid and heart-breakingly honest, 'Undressing Emmanuelle' tells the story of one of Europe's most celebrated cinema icons and the price she paid for her beauty and innocence. • The heart-breakingly honest memoir of 1970’s cinema sensation Sylvia Kristel – the actress who starred in the phenomenally successful Emmanuelle films.• ‘Undressing Emmanuelle’ reveals the real personality behind the famous sexual icon – from her great height of fame to her tempestuous family life and her battle with alcoholism, drugs and cancer.",
  "genres": [
    "Biography",
    "Memoir",
    "Nonfiction",
    "Media Tie In",
    "Film",
    "Autobiography"
  ],
  "author": "Sylvia Kristel",
  "average_rating": "3.40",
  "url": "https://www.goodreads.com/book/show/1391679.Undressing_Emmanuelle"
}