{
  "title": "The Americans at D-Day: The American Experience at the Normandy Invasion",
  "description": "Impressively researched, engrossing, lightning quick, and filled with human sorrow and elation, John C. McManus's The Americans at D-Day honors those Americans who lost their lives on D-Day, as well as those who were fortunate enough to survive.June 6, 1944 was a pivotal moment in the history of World War II in Europe. On that day the climactic and decisive phase of the war began. Those who survived the intense fighting on the Normandy beaches found their lives irreversibly changed. The day ushered in a great change for the United States as well, because on D-Day, America began its march to the forefront of the Western world.By the end of the Battle of Normandy, almost one of every two soldiers involved was an American, and without American weapons, supplies, and leadership, the outcome of the invasion and ensuing battle could have been very different.In the first of two volumes on the American contribution to the Allied victory at Normandy, John C. McManus ( Deadly Brotherhood, Deadly Sky ) examines, with great intensity and thoroughness, the American experience in the weeks leading up to D-Day and on the great day itself. From the build up in England to the night drops of airborne forces behind German lines and the landings on the beaches at dawn, from the famed figures of Eisenhower, Bradley, and Lightin' Joe Collins to the courageous, but little-known privates who fought so bravely, and under terrifying conditions, this is the story of the American experience at D-Day. What were the battles really like for the Americans at Utah and Omaha? What drove them to fight despite all adversity? How and why did they triumph? Thanks to extensive archival research, and the use of hundreds of first hand accounts, McManus answers these questions and many more.In The Americans at D-Day, a gripping narrative history reminiscent of Cornelius Ryan's The Longest Day , McManus takes readers into the minds of American strategists, into the hearts of the infantry, into hell on earth.",
  "genres": [
    "History",
    "World War II",
    "American History",
    "Nonfiction",
    "Military History",
    "War",
    "Military Fiction"
  ],
  "author": "John C. McManus",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/1391917.The_Americans_at_D_Day"
}