{
  "title": "The Wisdom of Yoga: A Seeker's Guide to Extraordinary Living",
  "description": "For modern spiritual seekers and yoga students alike, here is an irreverent yet profound guide to the most sophisticated teachings of the yoga wisdom tradition–now brought to contemporary life by a celebrated author, psychotherapist, and leading American yoga instructor.While many Westerners still think of yoga as an invigorating series of postures and breathing exercises, these physical practices are only part of a vast and ancient spiritual science. For more than three millennia, yoga sages systematically explored the essential questions of our human existence: What are the root causes of suffering, and how can we achieve freedom and happiness? What would it be like to function at the maximum potential of our minds, bodies, and spirits? What is an optimal human life?Nowhere have their discoveries been more brilliantly distilled than in a short–but famously difficult–treatise called the Yogasutra. This revered text lays out the entire path of inner development in remarkable detail–ranging from practices that build character and mental power to the highest reaches of spiritual realization. Now Stephen Cope unlocks the teachings of the Yogasutra by showing them at work in the lives of a group of friends and fellow yoga students who are confronting the full modern catastrophe of careers, relationships, and dysfunctional family dynamics. Interweaving their daily dilemmas with insights from modern psychology, neuroscience, religion, and philosophy, he shows the astonishing relevance and practicality of this timeless psychology of awakening.Leavened with wit and passion, The Wisdom of Yoga is a superb companion and guide for anyone seeking enhanced creativity, better relationships, and a more ethical and graceful way of living in the world.",
  "genres": [
    "Nonfiction",
    "Spirituality",
    "Philosophy",
    "Health",
    "Psychology",
    "Self Help",
    "Buddhism"
  ],
  "author": "Stephen Cope",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/139359.The_Wisdom_of_Yoga"
}