{
  "title": "Magellan",
  "description": "C'est sur un paquebot trop confortable, en route pour l'Amérique du Sud, que Stefan Zweig eut l'idée de cette odyssée biographique. Il songea aux conditions épouvantables des voyages d'autrefois, au parfum de mort salée qui flottait sur les bougres et les héros, à leur solitude. Il songea à Magellan, qui entreprit, le 20 septembre 1519, à 39 ans, le premier voyage autour du monde. Un destin exceptionnel... Sept ans de campagne militaire en Inde n'avaient rapporté à Magellan le Portugais qu'indifférence dans sa patrie. Il convainc alors le roi d'Espagne, Charles-Quint, d'un projet fou ; \" Il existe un passage conduisant de l'océan Atlantique à l'océan Indien. Donnez-moi une flotte et je vous le montrerai et je ferai le tour de la terre en allant de l'est à l'ouest \" (C'était compter sans l'océan Pacifique, inconnu à l'époque..). Jalousies espagnoles, erreurs cartographiques, rivalités, mutineries, désertions de ses seconds pendant la traversée, froids polaires, faim et maladies, rien ne viendra à bout de la détermination de Magellan, qui trouvera à l'extrême sud du continent américain le détroit qui porte aujourd'hui son nom. Partie de Séville avec cinq cotres et 265 hommes, l'expédition reviendra trois ans plus tard, réduite à 18 hommes sur un raffiot. Epuisée, glorieuse. Sans Magellan qui trouva une mort absurde lors d'une rixe avec des sauvages aux Philippines, son exploit accompli. Dans ce formidable roman d'aventures, Zweig exalte la volonté héroïque de Magellan, qui prouve qu'\" une idée animée par le génie et portée par la passion est plus forte que tous les éléments réunis et que toujours un homme, avec sa petite vie périssable, peut faire de ce qui a paru un rêve à des centaines de générations une réalité et une vérité impérissables \".",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "Travel",
    "Classics",
    "Adventure",
    "German Literature"
  ],
  "author": "Stefan Zweig",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/1393716.Magellan"
}