{
  "title": "Blue at the Mizzen",
  "description": "Almost three decades after commencing his maritime epic with Master and Commander, Patrick O'Brian is still at it. The 20th episode, Blue at the Mizzen, is another swashbuckling adventure on the high seas, complete with romantic escapades from smoggy London to Sierra Leone, diplomacy, espionage, the intricacies of warfare, and imperial brinksmanship. As always, these events are bound up in the ongoing friendship between two officers of the Royal Navy. Jack Aubrey is the naval captain, bold yet compassionate, innovative yet cautious, as fearless in war as he is bumbling in affairs of the heart and household. His boon companion Stephen Maturin is the ship's surgeon - and additionally a spy for the British government, a wealthy Catalonian aristocrat, a doting Irish father, and an avid naturalist.That may sound like a lot to keep track of. However, it's not necessary to carry around a scorecard or ship's roster while reading Blue at the Mizzen. The ostensible issue is whether Jack will finally be promoted to Admiral of the Blue. But long before he hears any word from the Napoleonic era's equivalent of Personnel, he loses half his crew to desertion, his ship undergoes a disastrous collision, and the entire company comes close to perishing in the ice-choked seas off Cape Horn. Meanwhile, the widowed Maturin issues a surprising proposal of marriage to a beautiful, mud-bespattered fellow naturalist while trekking through an African mangrove swamp. (The two lovebirds happen to be searching for a rare variant of 'Caprimulgus longipennis', the long-tailed nightjar, which they hope to surprise in full mating plumage.)Still, this is hardly a plot-driven novel. O'Brian takes time to get anywhere, and invariably enjoys the journey more than the arrival. So even as we get constant hints of the climax to come - Jack's spectacular naval action on behalf of the infant Republic of Chile - we don't mind hearing about the nuances of shipboard existence or the secret life of the white-faced tree duck. We're treated, for example, to this snippet about managed care, circa 1816: \"Poll, Maggie and a horse-leech from the starboard watch have been administering enemas to the many, many cases of gross surfeit that have now replaced the frostbites, torsions, and debility of the recent past, the very recent past. Strong, fresh, seal-meat has not its equal for upsetting the seaman's metabolism: he is much better kept on biscuits, Essex cheese, and a very little well-seethed salt pork--kept on short commons.\"And we're grateful! We can only hope that the elderly author will favor us with at least one more novel, so that his avid followers can avoid their own form of short commons. Life without Aubrey and Maturin would be a deprivation indeed. - Andrew Himes",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Adventure",
    "Audiobook",
    "War",
    "Military Fiction"
  ],
  "author": "Patrick O'Brian",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/1393912.Blue_at_the_Mizzen"
}