{
  "title": "Erased: Vanishing Traces of Jewish Galicia in Present-Day Ukraine",
  "description": "In Erased, Omer Bartov uncovers the rapidly disappearing vestiges of the Jews of western Ukraine, who were rounded up and murdered by the Nazis during World War II with help from the local populace. What begins as a deeply personal chronicle of the Holocaust in his mother's hometown of Buchach - in former Eastern Galicia - carries him on a journey across the region and back through history. This poignant travelogue reveals the complete erasure of the Jews and their removal from public memory, a blatant act of forgetting done in the service of a fiercely aggressive Ukrainian nationalism.Bartov, a leading Holocaust scholar, discovers that to make sense of the heartbreaking events of the war, he must first grapple with the complex interethnic relationships and conflicts that have existed there for centuries. Visiting twenty Ukrainian towns, he recreates the histories of the vibrant Jewish and Polish communities who once lived there-and describes what is left today following their brutal and complete destruction. Bartov encounters Jewish cemeteries turned into marketplaces, synagogues made into garbage dumps, and unmarked burial pits from the mass killings. He bears witness to the hastily erected monuments following Ukraine's independence in 1991, memorials that glorify leaders who collaborated with the Nazis in the murder of Jews. He finds that the newly independent Ukraine - with its ethnically cleansed and deeply anti-Semitic population - has recreated its past by suppressing all memory of its victims. Illustrated with dozens of hauntingly beautiful photographs from Bartov's travels, Erased forces us to recognize the shocking intimacy of genocide.-- \"Jewish Book World\"",
  "genres": [
    "History",
    "Holocaust",
    "Jewish",
    "Ukraine",
    "Nonfiction",
    "Judaism",
    "World War II"
  ],
  "author": "Omer Bartov",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/1393996.Erased"
}