{
  "title": "Nightingales: The Extraordinary Upbringing and Curious Life of Miss Florence Nightingale",
  "description": "Florence Nightingale was for a time the most famous woman in Britain–if not the world. We know her today primarily as a saintly character, perhaps as a heroic reformer of Britain’s health-care system. The reality is more involved and far more fascinating. In an utterly beguiling narrative that reads like the best Victorian fiction, acclaimed author Gillian Gill tells the story of this richly complex woman and her extraordinary family.Born to an adoring wealthy, cultivated father and a mother whose conventional facade concealed a surprisingly unfettered intelligence, Florence was connected by kinship or friendship to the cream of Victorian England’s intellectual aristocracy. Though moving in a world of ease and privilege, the Nightingales came from solidly middle-class stock with deep traditions of hard work, natural curiosity, and moral clarity. So it should have come as no surprise to William Edward and Fanny Nightingale when their younger daughter, Florence, showed an early passion for helping others combined with a precocious bent for power.Far more problematic was Florence’s inexplicable refusal to marry the well-connected Richard Monckton Milnes. As Gill so brilliantly shows, this matrimonial refusal was at once an act of religious dedication and a cry for her freedom–as a woman and as a leader. Florence’s later insistence on traveling to the Crimea at the height of war to tend to wounded soldiers was all but incendiary–especially for her older sister, Parthenope, whose frustration at being in the shade of her more charismatic sibling often led to illness.Florence succeeded beyond her wildest dreams. But at the height of her celebrity, at the age of thirty-seven, she retired to her bedroom and remained there for most of the rest of her life, allowing visitors only by appointment.Combining biography, politics, social history, and consummate storytelling, Nightingales is a dazzling portrait of an amazing woman, her difficult but loving family, and the high Victorian era they so perfectly epitomized. Beautifully written, witty, and irresistible, Nightingales is truly a tour de force.",
  "genres": [
    "Biography",
    "History",
    "Nonfiction",
    "Biography Memoir",
    "Feminism",
    "Medicine",
    "Medical"
  ],
  "author": "Gillian Gill",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/139487.Nightingales"
}