{
  "title": "Bratva Devil",
  "description": "He loves the chase.Turns out I love to get caught.The world’s worst meet cute—I walk in on him slitting a throat.I run like hell, but he really loves the chase…judging by my body’s reaction, so do I.He kidnaps me, thinking I’m someone else, but when he finds out the truth, I manage to convince him to hire me as his maid instead of offing my ass.He’s dangerous, deadly, and the man never cracks a smile.He’s also gorgeous, sinfully sexy, and ridiculously protective.I shouldn’t want him.I shouldn’t love the dark, raw hunger I see in his eyes.And I definitely shouldn’t taunt and tease him.The truth is Volodya is more beast than man, and I want to see him lose control.I want to be the one to send him to his knees.As a Bratva boss, I’m not allowed to make mistakes.But I make a big one when I kidnap the wrong damn woman.It’s not safe to let her go, so instead I take her up on her offer and hire her to work for me.Under my watchful eye, I make sure she does what she’s supposed to and upholds our agreement.But as much as I try to keep her at arm’s length, she keeps getting under my skin.All the possessive and protective instincts that I never knew I had come out with MaddieShe likes to tease me and taunt me, trying to get me to claim her.But she has no idea how much I enjoy the hunt, how much I enjoy seeing her squirm.When my little kiska starts to run, I’m more than happy to give chase.Because I will be claiming her, all of her , and when I do catch her, she’s going to scream who she belongs to loud enough for the whole damn world to hear. This is a very steamy dark Bratva romance, and it does contain triggering content. Please see trigger warning at beginning of novel and read responsibly.This is the second book in the Medvedev Bratva series, an interconnected series that can be read as standalones, but it’s more enjoyable if you read them in order. No cliffhangers, no cheating, and an HEA is always guaranteed!",
  "genres": [
    "Dark Romance",
    "Mafia Romance",
    "Romance",
    "Dark",
    "Crime",
    "Contemporary",
    "Audiobook"
  ],
  "author": "Sonja Grey",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/139577910-bratva-devil"
}