{
  "title": "Diary and Autobiography of John Adams, Volumes 1-4: Diary (1755-1804) and Autobiography",
  "description": "These four volumes begin the publication of the Adams archives, a collection which Edward Everett Hale called a \"manuscript history of America in the diaries and correspondence\" of a single family. The Diary , partially published in the 1850's, has proved a quarry of information on the rise of Revolutionary resistance in New England, the debates in the early Continental Congresses, and the diplomacy and financing of the American Revolution; but it has remained unfamiliar to the wider public. \"It is an American classic,\" Mr. Zoltán Haraszti said recently, about which Americans know next to nothing.\" Actually the Diary 's historical value may well prove secondary to its literary and human interest. Now that it is presented in full, we have for the first time a proper basis for comprehending John Adams--an extraordinary human being, a master of robust, idiomatic language, a diarist in the great tradition. From none of the other founders of the Republic do we have anything like a record at once so copious and so intimate. The Autobiography , intended for John Adams' family but never finished, consists of three large sections. The first records his boyhood, his legal and political career, and the movement that culminated in American independence. The second and third parts deal with his diplomatic experiences, and serve among other things as a retrospective commentary on the they are studded with sketches of Adams' associates which are as scintillating as they are prejudiced. Parts and in some cases all of these sketches were omitted from Charles Francis Adams' nineteenth-century edition. In 1779 John Adams wrote, \"I am but an ordinary Man. The Times alone have destined me to Fame--and even these have not been able to give me, much.\" Then he added, \"Yet some great Events, some cutting Expressions, some mean Hypocrisies, have at Times, thrown this Assemblage of Sloth, Sleep, and littleness into Rage a little like a Lion.\" Both the ordinary Man and the Lion live on in these volumes.",
  "genres": [
    "History",
    "Nonfiction",
    "American Revolution",
    "Politics",
    "Biography"
  ],
  "author": "John  Adams",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/1395820.Diary_and_Autobiography_of_John_Adams_Volumes_1_4"
}