{
  "title": "A Covert Affair: Julia Child and Paul Child in the OSS",
  "description": "Bestselling author Jennet Conant brings us a stunning account of Julia and Paul Child’s experiences as members of the Office of Strategic Services (OSS) in the Far East during World War II and the tumultuous years when they were caught up in the McCarthy Red spy hunt in the 1950s and behaved with bravery and honor. It is the fascinating portrait of a group of idealistic men and women who were recruited by the citizen spy service, slapped into uniform, and dispatched to wage political warfare in remote outposts in Ceylon, India, and China. The eager, inexperienced 6 foot 2 inch Julia springs to life in these pages, a gangly golf-playing California girl who had never been farther abroad than Tijuana. Single and thirty years old when she joined the staff of Colonel William Donovan, Julia volunteered to be part of the OSS’s ambitious mission to develop a secret intelligence network across Southeast Asia. Her first post took her to the mountaintop idyll of Kandy, the headquarters of Admiral Lord Louis Mountbatten, the supreme commander of combined operations. Julia reveled in the glamour and intrigue of her overseas assignment and lifealtering romance with the much older and more sophisticated Paul Child, who took her on trips into the jungle, introduced her to the joys of curry, and insisted on educating both her mind and palate. A painter drafted to build war rooms, Paul was a colorful, complex personality. Conant uses extracts from his letters in which his sharp eye and droll wit capture the day-to-day confusion, excitement, and improbability of being part of a cloak- and-dagger operation. When Julia and Paul were transferred to Kunming, a rugged outpost at the foot of the Burma Road, they witnessed the chaotic end of the war in China and the beginnings of the Communist revolution that would shake the world. A Covert Affair chronicles their friendship with a brilliant and eccentric array of OSS agents, including Jane Foster, a wealthy, free-spirited artist, and Elizabeth MacDonald, an adventurous young reporter. In Paris after the war, Julia and Paul remained close to their intelligence colleagues as they struggled to start new lives, only to find themselves drawn into a far more terrifying spy drama. Relying on recently unclassified OSS and FBI documents, as well as previously unpublished letters and diaries, Conant vividly depicts a dangerous time in American history, when those who served their country suddenly found themselves called to account for their unpopular opinions and personal relationships.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "World War II",
    "Book Club",
    "Espionage",
    "Historical"
  ],
  "author": "Jennet Conant",
  "average_rating": "3.18",
  "url": "https://www.goodreads.com/book/show/10456005-a-covert-affair"
}