{
  "title": "Ironic Hearts",
  "description": "Faerie Believer Novel 02Here continues the story of Kathleen the Believer, the story of her friends, the story of King Kaevin, Faerie King of the Tempest Kingdom, and the story of those who fought to keep the fey alive and those who wished to see them dead.The K4s – Kath, Keath, Katie, and Kaevin – are learning about honesty, responsibilities, betrayal, and the differences between the Believer, faeries, half faeries, humans, and hunters.Kath has finally taken on her responsibilities as the Believer, but her best friends Katie and Keath won't let her fight the faerie hunters alone. Unfortunately Keath is half faerie so just being near a hunter can be enough to make him collapse, and Katie is only human.Keath finds it difficult to trust in his own abilities when his family and friends seem to fear for his life. The past rears up to confront him, the lies his father told him and the truth about his life begin to unravel and Keath is left troubled and confused. His father pushes him more than ever before to fight against his faerie genes and Keath has to figure out if he is strong enough to overcome his faerie weaknesses and become the weapon many people think he could be.Danger and destruction seems to follow Katie everywhere and when one of the most dangerous people she has ever crossed comes back into her life, she struggles to keep her fight her own. She has never been one to tell the truth, and the habit of lying is hard to break.Kath can't deal with her intense relationship with Kaevin. The hiding and sneaking around begins to wear down on her and she isn't sure if love is enough anymore.Kaevin is once again surrounded by the cruelty and darkness of his kingdom of Tempest, but this time he has to work harder to save his new friends from the danger threatening to destroy them all, or risk losing the only thing keeping him from the darkness of his kingdom.Don't miss out on the other Faerie Believer Novels:Faerie Believers 01 - The Emerald FaeFaerie Believers 03 - Broken Beauty",
  "genres": [],
  "author": "Kalcee Clornel",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/13974845-ironic-hearts"
}