{
  "title": "El País del Carnaval",
  "description": "O País do Carnaval.1930. Tempo de maré agitada, de ondas fortes, no Brasil. O estudante Jorge Amado já não é a criança carregada da fazenda onde nasceu para a cidade de Ilhéus; nem o jovenzito irrequieto que acabou fugindo do internato do Colégio Antonio Vieira, em Salvador, para se refugiar na casa da avó, na cidade sergipana de Itaporanga. Está morando agora no Rio de Janeiro, onde faz o curso de Direito. Mas é, ainda, um adolescente. E, aos 18 anos de idade, acaba de escrever o seu primeiro romance. No ano seguinte, o volume vem à luz. Chama-se O país do Carnaval. É a estréia literária do autor. Bem recebido pela crítica e pelo público, Jorge Amado fala, nesse livro, de uma juventude plena de inquietude, numa ansiosa e mesmo angustiada busca de verdades e caminhos. Trata-se, em suma, de um retrato geracional — tecido a partir das rondas de Paulo Rigger pelas rodas boêmias e literárias da Cidade da Bahia, em inícios do século XX. No final, insatisfeito e desencantado, marcado por uma renúncia preconceituosa à chegada do amor, Rigger embarca, no porto do Rio de Janeiro, com destino à Europa. Leva com ele as suas dores, deixando atrás de si uma cidade alucinada pelos ritmos e brilhos do carnaval.Cacau.Jorge Amado praticamente não deixou assentar a poeira da estréia. Em 1932, a segunda edição de O país do Carnaval chega às livrarias. E, logo em seguida, o romancista volta à carga, com a pólvora de Cacau. O livro, espécie de romance-reportagem composto sob o influxo das teses sobre uma “literatura socialista”, espanta. Chega a chocar - pelo tom, pelo tema, pela linguagem. A edição é imediatamente apreendida pela polícia. Mas, no dia seguinte, o livro é liberado, graças ao então ministro do Exterior, Osvaldo Aranha. Escândalo e sucesso se casam — e a edição se esgota em um mês. É o primeiro livro de Jorge Amado a ser traduzido para uma outra língua - no caso, o espanhol. Depois virão as traduções para o alemão, o coreano, o dinamarquês, o francês, o grego, o holandês, o italiano, o polonês, o russo. E assim a história da vida nos cacauais da Bahia vai principiar a correr o mundo. Cacau é a narrativa das aventuras de José Cordeiro - o Sergipano -, trabalhador numa fazenda, onde divide um casebre com alguns companheiros de labuta e sofrimento. É um homem que recusa a oportunidade de se casar com a filha do patrão, para levar adiante, \"de coração limpo e feliz\", o seu sonho revolucionário. A essa altura, como se vê, Jorge Amado já mergulhara na militância comunista. E Cacau é um livro em chamas. Um livro panfletário, escrito com o fogo da indignação.Suor.Jorge Amado continua, ainda por um bom tempo, trilhando a estrada da literatura socialista, até realizar a sua ruptura com os padrões estéticos estabelecidos pelo comunismo internacional. Assim é que, em 1934, publica Suor, seu terceiro romance, de feitio algo naturalista. Suor é saudado com entusiasmo pelo poeta Oswald de Andrade, que o define como “pequeno grande livro”, focalizando “os cortiços azedos da Bahia”. Na verdade, o que Jorge Amado tematiza é a vida miserável e promíscua da gente amontoada num velho sobrado do Pelourinho, em meio a ratos, baratas e cachorros. Velhos, prostitutas e homossexuais passam pelas páginas do livro, onde se ilumina a figura de Linda, jovem que vai se ligar a um líder operário, o mecânico Álvaro, iniciando-se, assim, em projetos de transformação social. Num comício baiano, Álvaro cai morto, atingido por uma bala disparada pela polícia. Mas Linda não abandona idéias, nem ideais. Vai em frente, distribuindo panfletos subversivos, em cumprimento de sua missão revolucionária, em busca de um mundo novo.",
  "genres": [
    "Romance",
    "Brazil",
    "Fiction",
    "Novels",
    "Classics",
    "Portuguese Literature"
  ],
  "author": "AMADO J.",
  "average_rating": "3.42",
  "url": "https://www.goodreads.com/book/show/1397676.El_Pa_s_del_Carnaval"
}