{
  "title": "Love and Limerence: The Experience of Being in Love",
  "description": "Author Dorothy Tennov, Ph.D., on Love and Limerence:It was over 35 years ago that, having become convinced through personal experience and the writings of others of the enormous significance of that aspect of the human reproductive process known as romantic love, I elected to explore the subject systematically.My journey of exploration occurred in three identifiable phases. During the first phase, the Phase of Wandering and Wondering Through Questionnaires and Testimonials, I was primarily involved in other topics, but the \"love cards\" assessments, in which students anonymously selected statements that applied to them and rejected those that did not, and the paper and pencil surveys submitted to groups continued to supply evidence of the importance of the topic, and of its prevalence, but I had not advanced beyond Shakespeare in understanding. Toward the end of that first phase, my emphasis had begun to shift from answers to questions posed by an investigator to the collection of personal testimonies, those of volunteers as well as those of published autobiographers, novelists, and historians. Transition to the second phase, the Phase of Limerence, was abrupt. It happened in the fall of 1973. Earlier that year I had presented the first formal paper on the subject at the meetings of the American Psychological Association. That paper, titled \"Sex differences in romantic love among college students,\" was based entirely on questionnaire results. There were sex differences in pencil and paper reports, but, as I was later to learn, examination of the details of the experience revealed more sex similarities than differences in the phenotypical experience. The discovery, later that year, of people who had not, did not and apparently could not imagine themselves having the experience that I was describing, marked a turning point. By the time of a second formal paper in 1977, I had arrived at the conceptions found in Love and Limerence, and had begun to write the book. The third phase began with the publication of Love and Limerence. It was the Phase of Confirmation. Love and Limerence was based largely on interviews that exposed the weakness of paper and pencil assessments. The words of love admitted of different meanings. New data in the form of voluntary written testimonials poured in from readers of the book. Many of these letters used the same words: \"What you describe is exactly what happened to me.\" Others thanked me for allowing them to know that they were not alone, that as crazy as the condition was, it was not a sign of mental ill-health, but a normal phenomenon. The state was one of madness, but the person undergoing the experience was not (necessarily) mad. In hindsight, it should not seem surprising to the human nature scientist that there should be built into us through evolution control over reproductive functioning that supercedes other motivations. According to what I refer to as Limerence Theory, limerence is an interaction between the feelings of one person and the actions of another. It appears to occur across sexual, racial, age, cultural, and other categories of humans and it endures as long as do the conditions that sustain it. When intense, it crowds other motives out of the psyche. It should be noted that Limerence is not synonymous with meanings customarily attached to the term \"infatuation.\" Furthermore, and most importantly, it is entirely absent in some relationships and in some people. Finally, in my judgment, both limerence and nonlimerence represent normal functioning. Limerence presents problems for the modern individual, causing inattention to other aspects of life, especially to responsibilities and to other relationships. Limerence for someone other than the spouse is a major cause of marital and family disruption. Furthermore, the limerent's behavior may hinder rather than enhance a relationship with the desired person if a response in kind does not occur. When frustrated, limerence may produce such severe distress as to be life threatening. People's reaction to Limerence Theory depends partly on their acquaintance with the evidence for it and partly on personal experience. People who have not experienced limerence are baffled by descriptions of it and sometimes resistant to the evidence that it exists. To such outside observers, limerence seems pathological. Although often the subject of romantic poetry and fiction, it has been called an addiction, an indication of low self-esteem, irrational, neurotic, erotomanic, and delusional. To people who are unacquainted with it first-hand, it inconceivable that any person should assign so much importance to another person. Fortunately, direct experience is not necessary to someone who reads the evidence. There are many scientifically known phenomena that are not directly perceivable. Although self-report is traditionally regarded with suspicion by scientists, reports that are as consistent with one another as these descriptions of limerence are hard to doubt. This is a scientific book. That it may not seem so is a part of the story itself. In finding limerence, a human condition distinct yet subject to obfuscation everywhere, we enter into new territory, the territory of the universal mental landscape. There is much more to be found there as others continue the exploration.",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Relationships",
    "Self Help",
    "Love",
    "Philosophy",
    "Mental Health"
  ],
  "author": "Dorothy Tennov",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/1398830.Love_and_Limerence"
}