{
  "title": "Joust",
  "description": "THE SECRET OF THE DRAGONSVetch was an Altan serf working the land which had once been his family's farm. Young and slight, Vetch would have died of overwork, exposure, and starvation if not for the anger which was his only real sustenance--anger that he had lost his home and family in a war of conquest waged by the dragon-riding Jousters of Tia. Tia had usurped nearly halt of Alta's lands and enslaved or killed many of Vetch's countrymen. Sometimes it seemed that his entire cruel fate revolved around dragons and the Jousters who rode them.But his fate changed forever the day he first saw a dragon.From its narrow, golden, large-eyed head, to its pointed emerald ears, to the magnificent blue wings, the dragon was a thing of multicolored, jeweled beauty, slim and supple and quite as large as the shed it perched on. Vetch, almost failed to notice the Jouster who stood beside him. \"I need a boy,\" the rider had said, and suddenly Vetch found himself lifted above the earth and transported by dragon-back to a different world.Vetch was to be trained as a dragon-boy, and he hardly believed his luck. The compound seemed like paradise: he could eat until he was full, and all he had to do was care for his Jouster's dragon, Kashet.It didn't take long for Vetch to realize that Kashet was special--for unlike other dragons, Kashet was gentle by nature and did not need the tranquilizing tala plant to make her tracttable. Vetch became determined to learn the secret of how Kashet had been tamed. For if Kashet could be tamed, perhaps Vetch could tame a dragon of his own. And if he could, then he might be able to escape and bring the secret of dragon-taming back to his homeland of Alta. And that secret, might prove to be the key to Alta's liberation....",
  "genres": [
    "Fantasy",
    "Dragons",
    "Fiction",
    "Science Fiction Fantasy",
    "High Fantasy",
    "Young Adult",
    "Adult"
  ],
  "author": "Mercedes Lackey",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/13993.Joust"
}