{
  "title": "Alta",
  "description": "Vetch had done the unimaginable. He had secretly raised his own baby dragon, a crimson female he named Avatre, and when she first took flight he had been on her back. Although Avatre was new to flight, with the help of his trainer and friend, the dragon Jouster Ari, he had managed to evade pursuit, escaping from the compound that housed the dragon-riding troops of Tia, his homeland's enemies. Aided by the nomadic tribes of the desert, Vetch and Avatre had crossed the vast sands heading north toward the lands still held by Alta.It was Vetch's plan to convey to his half-conquered homeland the secret which he hoped would be the key to Alta's liberation: how to tame dragons. If he imparted this secret to the Altan rulers, would it not give them the edge they needed to throw off their conquerors despite their lesser numbers? And it seemed that his good luck was holding when, after saving a young priestess of noble blood from the dangers of the Great Mother River, he was given entree into the dragon Jouster compound of Alta City.But Vetch, now calling himself by his birth name of Kiron was completely ignorant of the true forces that controlled Alta. For though the royal Great Ones sat on the Altan throne, they did not truly rule. In Alta the Magi, the all- powerful practitioners of sorcery, held the populace--royalty and commoner alike--under the sway of a mysterious weapon. The Magi claimed that the Eye of Light would forever protect their land from Tia--incinerating enemy troops as far away as the seventh canal. But were the Magi really interested in rotecting their land from outside invaders? Or would Kiron find that Alta was burdened with a far greater threat than an enemy kingdom--a threat from within its own borders?",
  "genres": [
    "Fantasy",
    "Dragons",
    "Fiction",
    "Science Fiction Fantasy",
    "High Fantasy",
    "Adult",
    "Magic"
  ],
  "author": "Mercedes Lackey",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/13996.Alta"
}