{
  "title": "Captain Flinn and the Pirate Dinosaurs",
  "description": "Giles Andreae and Russell Ayto's super-fun Captain Flinn and the Pirate Dinosaurs Flinn is at school looking in the art cupboard for some coloured pens to finish off his dinosaur drawing when he stumbles upon Captain Stubble, a real live Pirate Captain! He tells Flinn that his ship, the Acorn, has been stolen and that he needs Flinn to help him rescue it back. Stubble makes Flinn the captain and they sail away on an old pirate ship...they finally find the Acorn but, to their horror, realise it's been stolen by PIRATE DINOSAURS! Captain Flinn and his crew attack the dinosaurs and, after much fighting, seize control of the ship once more. Flinn and his friends then sail back to the harbour clambering through the boatshed door and back into the art cupboard without the teacher even noticing they've been gone! Giles Andreae is an award-winning children's author and has written both fiction titles and best-selling picture books. His picture book, The Lion Who Wanted to Dance, won The Federation of Children's Book Award in the best picture book category in 1998. However, he is probably most famous as the creator of the phenomenally successful Purple Ronnie, Britain's favourite stickman. Giles lives in Notting Hill with his wife and three young children. Russell has illustrated books by prolific children's authors such as Ian Whybrow and Cressida Cowell. The Witch's Children was shortlisted for the Greenaway last year and this year The Witch's Children and the Queen is on the Smarties shortlist. Russell lives in Penzance, Cornwall. Don't miss the other Captain Flinn picture books - they're all rip-roaring fun! Captain Flinn and the Pirate Dinosaurs; Captain Flinn and the Pirate Missing Treasure!; Captain Flinn and the Pirate Smugglers Bay!; Captain Flinn and the Pirate The Magic Cutlass And Giles Andreae's brilliant book with illustrator Korky Sir Scallywag and the Golden Underpants",
  "genres": [
    "Picture Books",
    "Dinosaurs",
    "Pirates",
    "Childrens",
    "Fantasy",
    "Fiction",
    "Adventure"
  ],
  "author": "Giles Andreae",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/1399534.Captain_Flinn_and_the_Pirate_Dinosaurs"
}