{
  "title": "Dreaming the Bull",
  "description": "The second part of the stunning fictionalization of the life of Britain’s warrior queen, Boudica, immerses us in a world of druids and dreamers, warriors and lovers, passion and courage. Originally a trilogy, this is now a four-part series.“Boudica” means “Bringer of Victory” (from the early Celtic word “boudeg”). She was the last defender of the Celtic culture; the only woman openly to lead her warriors into battle and to stand successfully against the might of Imperial Rome -- and triumph.Book one, Dreaming the Eagle , took readers from Boudica’s girlhood with the Eceni tribe to the climax of the two-day battle when she and her lover, Caradoc, faced the invading Romans. Believing her dead, Breaca’s beloved brother, Bán, joined the Roman cause.Dreaming the Bull , the second book in this compelling series, continues the intertwined stories of Boudica, and Bán, now an officer in the Roman cavalry. They stand on opposite sides in a brutal war of attrition between the occupying army and the defeated tribes, each determined to see the other dead. In a country under occupation, Caradoc, lover to Breaca, is caught and faces the ultimate penalty. Only Bán has the power to save him, and Bán has spent the past ten years denying his past. Treachery divides these two; heroism brings them together again, changed out of all recognition -- but it may not be enough to heal the wounds.Dreaming the Bull is a heart-stopping story of war and of peace; of love, passion and betrayal; of druids and warring gods, where each life is sacred and each death even more so; and where Breaca and Bán learn the terrible distances they must travel to fulfill their own destinies.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Fantasy",
    "Historical Fantasy",
    "Audiobook",
    "British Literature"
  ],
  "author": "Manda Scott",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/1400304.Dreaming_the_Bull"
}