{
  "title": "Thurber Carnival",
  "description": "After the chuckles & amidst the chortles, the 1st-time reader of The Thurber Carnival is bound to utter a discreetly voiced \"Huh?\" Like Cracker Jacks, there are surprises inside James Thurber's delicious 1945 smorgasbord of essays, stories & sketches. This festival is, surprises & all, a collection of earlier collections (mostly), including, among others, gems from My World--& Welcome to It, Let Your Mind Alone! & The Middle Aged Man on the Flying Trapeze. Needless to say, there are also numerous cartoons that, by themselves, are worth the price of admission. While redoubling Thurber's deserved reputation as a laugh-out-loud humorist & teller-of-gentle-tales, it reintroduces him as a thinker-of-thoughts. To wit: his 1933 \"Preface to a Life,\" in which he observes himself while discussing \"writers of light pieces running from a 1000 to 2000 words\": To call such persons \"humorists,\" a loose-fitting & ugly word, is to miss the nature of their dilemma & the dilemma of their nature. The little wheels of their invention are set in motion by the damp hand of melancholy. Enjoy the surprises, certainly, but revel in the candy-coated popcorn & peanuts. As in \"More Alarms at Night,\" in which a teenaged Thurber intrudes upon his sleeping father, a skittish man named Charles, because he can't recall the name Perth Amboy, NJ. Coincidentally, his father has just been frightened half to death by Thurber's brother, who had earlier stalked into his room saying coldly, \"Buck, your time has come.\" \"Listen,\" I said. \"Name some towns in New Jersey quick!\" It must have been around three in the morning. Father got up, keeping the bed between him & me, & started to pull his trousers on. \"Don't bother about dressing,\" I said. \"Just name some towns in New Jersey.\" While he hastily pulled on his clothes--I remember he left his socks off & put his shoes on his bare feet--father began to name, in a shaky voice, various New Jersey cities. I can still see him reaching for his coat without taking his eyes off me. \"Newark,\" he said, \"Jersey City, Atlantic City, Elizabeth, Paterson, Passaic, Trenton, Jersey City, Trenton, Paterson--\" \"It has two names,\" I snapped. \"Elizabeth & Paterson,\" he said. Of course, things turn out fine, as well they should. Why not? The best of Thurber, which The Thurber Carnival arguably is, is sublime; surprising insight & wry observations tossed lightly & served constantly with effortless good humor & an obvious love for all things gently eccentric.--Michael Hudson",
  "genres": [
    "Humor",
    "Fiction",
    "Short Stories",
    "Classics",
    "Essays",
    "Comedy",
    "Literature"
  ],
  "author": "James Thurber",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/1400351.Thurber_Carnival"
}