{
  "title": "Temples, Tombs & Hieroglyphs: A Popular History of Ancient Egypt",
  "description": "An eye-opening, edifying, and endlessly entertaining tour through an astonishing bygone world—the acclaimed classic history of ancient Egypt, now newly revised and updatedWriting as Elizabeth Peters, world-renowned Egyptologist Barbara Mertz is the author of the phenomenally popular New York Times bestselling mystery series featuring archaeologist Amelia Peabody. In Temples, Tombs, and Hieroglyphs, Dr. Mertz explores the breathtaking reality behind her fiction by casting a dazzling light on a remarkable civilization that, even after thousands of years, still stirs the human imagination and inspires awe with its marvelous mysteries and amazing accomplishments.A fascinating chronicle of an extraordinary epoch—from the first Stone Age settlements through the reign of Cleopatra and the Roman invasions—Temples, Tombs, and Hieroglyphs brings ancient Egypt to life as never before. Lavishly illustrated with pictures, maps, photographs, and charts, it offers tantalizing glimpses into Egyptian society and everyday life; amazing stories of the pharaohs and the rise and fall of great dynasties; religion and culture; folklore and fairy tales; stories of the explorers, scientists, and unmitigated scoundrels who sought to unravel or exploit the ageless mysteries; and breathtaking insights into the magnificent architectural wonders that rose up from the desert sands.Revised and updated to include the results of the most recent historical research and archaeological finds, Dr. Mertz's book is unhampered by stuffy prose and dry academic formality. Instead, it is a vibrant, colorful, and fun excursion for anyone who's ever fantasized about exploring the Valley of the Kings, viewing up close the treasures of the temple of Queen Hatshepsut, or sailing down the Nile on Cleopatra's royal barge.",
  "genres": [
    "History",
    "Nonfiction",
    "Egypt",
    "Ancient History",
    "Archaeology",
    "Audiobook",
    "Egyptology"
  ],
  "author": "Barbara Mertz",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/1400512.Temples_Tombs_Hieroglyphs"
}