{
  "title": "Hunting Midnight",
  "description": "From the internationally bestselling author of The Last Kabbalist of Lisbon comes a novel of incomparable scope and beauty that takes the reader on an epic journey from war-ravaged nineteenth-century Europe to antebellum America. A bereft child, a freed African slave, and the rich history of Portugal’s secret Jews collide memorably in Richard Zimler’s mesmerizing novel--a dazzling work of historical fiction played out against a backdrop of war and chaos that unforgettably mines the mysteries of devotion, betrayal, guilt, and forgiveness.Hunting MidnightAt the dawn of the nineteenth century in Portugal, John Zarco Stewart is an impish child of hotheaded emotions and playful inquisitiveness, the unwitting inheritor of a faith shrouded in three hundred years of secrecy--for the Jews of the Iberian Peninsula have been in hiding since the Inquisition. But a season of loss and bitter discovery brings his innocence to an abrupt end. It is only the ministrations of a magical stranger, brought to Porto by his seafaring father, that restore his Midnight, an African healer and freed slave, the man who will become John’s greatest friend and determine the course of his destiny.When Napoleon’s armies invade Portugal, violence again intrudes on John’s fragile peace, and seals his passage into adulthood with another devastating loss. But from the wreckage comes revelation as he uncovers truths and lies hidden by the people he loved and trusted most, and discovers the act of unspeakable betrayal that destroyed his family--and his faith. And so his shattering quest begins as he travels to America, to hunt for hope in a land shackled by unforgivable sin.With stunning insight and an eye for rich historical detail--from the colorful marketplaces of Porto to the drowsy plantations of the American South, from the Judaism John discovers as a young man to the mystical Africa that Midnight conjures from his memories--in Hunting Midnight Richard Zimler has crafted a masterpiece.From the Hardcover edition.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Portugal",
    "Jewish",
    "Romance",
    "Historical",
    "Novels"
  ],
  "author": "Richard Zimler",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/1400828.Hunting_Midnight"
}