{
  "title": "Scorched Earth: How the Fires of Yellowstone Changed America",
  "description": "In 1988, forest fires raged in Yellowstone National Park, destroying more than a million acres. As the nation watched the land around Old Faithful burn, a longstanding conflict over fire management reached a fever pitch. Should the U.S. Park and Forest Services suppress fires immediately or allow some to run their natural course? When should firefighters be sent to battle the flames and at what cost?In Scorched Earth, Barker, an environmental reporter who was on the ground and in the smoke during the 1988 fires, shows us that many of today's arguments over fire and the nature of public land began to take shape soon after the Civil War. As Barker explains, how the government responded to early fires in Yellowstone and to private investors in the region led ultimately to the protection of 600 million acres of public lands in the United States. Barker uses his considerable narrative talents to bring to life a fascinating, but often neglected, piece of American history. Scorched Earth lays a new foundation for examining current fire and environmental policies in America and the world.Our story begins when the West was yet to be won, with a colorful cast of a civil war general and his soldiers, America's first investment banker, railroad men, naturalists, and fire-fighters-all of whom left their mark on Yellowstone. As the truth behind the creation of America's first national park is revealed, we discover the remarkable role the U.S. Army played in protecting Yellowstone and shaping public lands in the West. And we see the developing efforts of conservation's great figures as they struggled to preserve our heritage. With vivid descriptions of the famous fires that have raged in Yellowstone, the heroes who have tried to protect it, and the strategies that evolved as a result, Barker draws us into the very heart of a debate over our attempts to control nature and people.This entertaining and timely book challenges the traditional views both of those who arrogantly seek full control of nature and those who naively believe we can leave it unaltered. And it demonstrates how much of our broader environmental history was shaped in the lands of Yellowstone.",
  "genres": [
    "Nonfiction",
    "Natural History",
    "History"
  ],
  "author": "Rocky Barker",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/1401840.Scorched_Earth"
}