{
  "title": "Daddy's Other Boy",
  "description": "LorenI've kept a secret from my husband. All my life I've had fantasies that I'm ashamed of. Things that I want to share with my husband, but every time I try, it's like I can barely breathe. Harrison knows that I have a daddy kink, and he's doing his best to lean into it, but I can tell that there's something missing for him. Couple that with the fact that even after all this time together, I can barely take him, and I feel like a total failure who can't even please Daddy the way he needs. And if I told Harrison what I dream about because of that... I don't know if we'd survive it.HarrisonI want to be the Daddy that Loren needs. My husband and I are happy, but I know there's more that Loren wants out of me. He wants me to be the dominant Daddy he's always fantasized about, and I've tried to be that, but I know I'm failing miserably at it. When a crisis at the art museum we built together means we have to focus on saving the biggest fundraiser in three states, it's almost a relief that we have to focus on something else. That is until the only way forward we can find is to roll the dice on a talented sous chef with almost no reputation to speak Kody Chavez. The boy that might wake Loren and I up, or ruin us forever.KodyI've played with couples before and been burned every time. When Harrison and Loren accept my desperate bid to cater the Seven Crows Gala event, the pressure is enough to kill me. It could be the key to everything I've wanted for my career. So I know I shouldn't get sucked into their lives, that I shouldn't mix business with pleasure, that I need to focus on convincing some of the wealthiest people in the Pacific Northwest that I'm worth taking a chance on and ignore everything else. But Harrison has the potential to be the perfect switch Daddy I've always wanted, and Loren craves the kind of humiliation that I rarely get to deliver. The problem is, neither of these two men knows what the other really wants. If I get in the middle of that, I could ruin their marriage, my shot at a once-in-a-lifetime career move, and get my heart broken when they decide they no longer need me to be their experiment in kink. I'm supposed to be the next top chef, not Daddy's Other Boy. But I don't know if I can help myself. And I certainly don't know if I'm making the worst decision of my life or the only one that matters.Daddy's Other Boy is an MMM age-gap romance featuring a sexy switch daddy, a sadistically dominant, bratty bottom, and a submissive cuck husband who all work together to spark a five-flame non-stop ride that will require at least one change of underpants. This book is part of the Daddies for Dollars multi-author series, where every book features a swoon-worthy Daddy, a boy he adores, and a happily ever after helped along by a fundraiser event. Each book stands alone, but with six delicious Daddy pairings to choose from, why not read them all?",
  "genres": [
    "M M M",
    "M M Romance",
    "BDSM",
    "Contemporary",
    "Queer",
    "Romance",
    "Threesome"
  ],
  "author": "Simon Strange",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/140212025-daddy-s-other-boy"
}