{
  "title": "Happy Fake Wife, Happy Fake Life",
  "description": "An enemies to lovers, fake dating romance about a surly hockey star and the feisty woman he refuses to let disappear again.“Anytime you combine enemies to lovers trope, a small town, a hottie ex-athlete and some spice, it’s going to be a 10/10 book! A quick read, be prepared to be sucked in til the very end!” Amazon ReviewNixSeven hours. That’s how long I knew her in college. But that hasn’t stopped me from thinking about her every day since.That’s why I recognize her the second she walks into my bar. The silky, honey-colored hair. The impossibly long legs that flow into her perfectly rounded butt. And that quick, sweet smile that has been burned into my brain for the better part of four years.She glances over, but it’s obvious she doesn’t recognize me. And why would she? I think she only looked at my face once that night. Most of the time, she had her head buried in my chest wailing about her idiot boyfriend.You’d think those few short hours would fade from my memory by the time I woke up the next morning, but no such luck. Even after having women almost literally hanging off me day and night during my hockey career, I haven’t been able to get her out of my mind.Now she’s ten feet from me, and I have keep her here—at least long enough to find out why she disappeared all those years ago.\nEmory\nHave you ever been kissed so hard that you almost lost consciousness?I have. Only once. And it just happened.That can be the only explanation as to why I’m apparently headed to my friend’s wedding with a fake husband in tow.Let me back up. I stopped at a bar to down a few shots so I could face my upcoming weekend from hell. Suddenly, I’m surrounded by a gang of ex-friends who I gleefully haven’t seen since I fled from college.They immediately started in about how my ex-boyfriend would be at the wedding with his perfect fiancée. As their pitiful eyes almost bore a hole into my head, I felt a hand on my shoulder. I looked up to see the bearded, hulk of a man who’d been staring at me since I walked into the bar.Without any hesitation, he pulled my face up to his and almost inhaled me with his mouth. It was so unbelievably hot that I think my brain melted right out of my body. I’m guessing it was puddled somewhere around my feet when he announced to my frenemies that I was his wife. Maybe that’s why I couldn’t seem to form a single word to refute it.Then when he wrapped his sculpted arms around me and pulled me against his stupidly muscular chest, it felt so comfortably familiar that I actually heard myself confirming his brazen lie.So that’s where I am—standing in a bar watching the mean girls’ faces flood with jealousy as they slowly scan my fake husband’s beautiful body. For the first time in years, I feel like I have the upper hand on them, and it’s absolutely intoxicating.So with my brain still pooled on the floor, I’ve decided to just roll it. I mean, it’s only for three days. What could possibly go wrong?“The perfect combination of a fun rom com with a little spice, and a little action, with lovable and funny characters. I laughed out loud so many times and had all the feels!” Amazon Review“I will rave about Donna Schwartze’s books to anyone who will listen—they are quick and easy reads, filled with a rollercoaster of emotions, and every one of her books makes you feel like you know each character persona",
  "genres": [
    "Hockey",
    "Contemporary Romance",
    "Romance",
    "Second Chance",
    "Sports",
    "He Falls First"
  ],
  "author": "Donna Schwartze",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/140214082-happy-fake-wife-happy-fake-life"
}