{
  "title": "Eureka Street",
  "description": "When your street address can either save your life or send it up the creek, there’s no telling what kind of daily challenges you’ll face in the era of the Northern Irish Troubles.“All stories are love stories,” begins Eureka Street, Robert McLiam Wilson’s big-hearted and achingly funny novel. Set in Belfast during the Troubles, Eureka Street takes us into the lives and families of Chuckie Lurgan and Jake Jackson, a Protestant and a Catholic—unlikely pals and staunch allies in an uneasy time. When a new work of graffiti begins to show up throughout the city—“OTG”—the locals are stumped. The harder they try to decipher it, the more it reflects the passions and paranoias that govern and divide them.Chuckie and Jake are as mystified as everyone else. In the meantime, they try to carve out lives for themselves in the battlefield they call home. Chuckie falls in love with an American who is living in Belfast to escape the violence in her own land; the best Jake can do is to get into a hilarious and remorseless war of insults with a beautiful but spitfire Republican whose Irish name, properly pronounced, sounds to him like someone choking.The real love story in Eureka Street involves Belfast—the city’s soul and spirit, and its will to survive the worst it can do to itself.Skyhorse Publishing, as well as our Arcade, Yucca, and Good Books imprints, are proud to publish a broad range of books for readers interested in fiction—novels, novellas, political and medical thrillers, comedy, satire, historical fiction, romance, erotic and love stories, mystery, classic literature, folklore and mythology, literary classics including Shakespeare, Dumas, Wilde, Cather, and much more. While not every title we publish becomes a New York Times bestseller or a national bestseller, we are committed to books on subjects that are sometimes overlooked and to authors whose work might not otherwise find a home.",
  "genres": [
    "Fiction",
    "Ireland",
    "Irish Literature",
    "Historical Fiction",
    "Novels",
    "Historical",
    "Contemporary"
  ],
  "author": "Robert McLiam Wilson",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/1402637.Eureka_Street"
}