{
  "title": "The Sound of Light: The History of Gospel and Christian Music",
  "description": "The Sound of Light is a sweeping overview of the history of gospel music. Powerful and incisive, it traces contemporary Christianity and Christian music to the 16th century and the Protestant Reformation after examining music in the Bible and early church music. From the psalms of the early Puritans through the hymns of human composure of Isaac Watts and the social activism of the Wesleys, gospel music was established in 18th century America. With the camp meeting songs of the Kentucky Revival, the spirituals that came from the slave culture, and the hymns from the great revival after the Civil War, gospel music advanced through the 19th century. The 20th century brought recording technology and electronic media to the table. Gospel music has developed with Christian revivals and the history of American gospel music is the history of Christianity in America. Gospel music reflects the American spirit of freedom and the free market as a Christian culture emerges in the 20th century, providing a spiritual as well as economic foundation. The Sound of Light presents gospel music as part of the history of contemporary Christianity. It is a work broad in scope that defines a music essential to understanding American culture as well as American music in the 20th century. Don Cusic is the author of ten books, including the biography Eddy I'll Hold You in My Heart and an encyclopedia of cowboys, Cowboys and the Wild An A-Z Guide from the Chisholm Trail to the Silver Screen. He joined the faculty at Middle Tennessee State University in 1982, teaching courses in the music business. He earned a Masters and Doctorate in Literature from MTSU. Since August of 1994, Cusic has been Professor of Music Business at Belmont University.",
  "genres": [
    "Music",
    "History",
    "Religion",
    "Nonfiction"
  ],
  "author": "Don Cusic",
  "average_rating": "3.38",
  "url": "https://www.goodreads.com/book/show/1403485.The_Sound_of_Light"
}