{
  "title": "National Puzzlers' League Cryptic Crosswords",
  "description": "The National Puzzlers' League (NPL) was founded in 1883 and is the oldest puzzlers' organization in the world. For over 100 years, crosswords and other word puzzles that appear in the NPL's monthly magazine, The Enigma, could be enjoyed only by NPL members. Now, for the first time, a selection of the league's favorite cryptic crosswords is available in book form for puzzle fans everywhere to enjoy.Unlike \"regular\" crossword puzzles, each clue in a cryptic crossword has two parts--one that's straightforward and one that involves one or more types of wordplay--and part of the fun is determining which part is which and what type of wordplay is involved.For example, \"Shoestring allowances lead to tears (11)\" is a cryptic clue for LACERATIONS. The straightforward part of the clue is \"tears,\" which is a definition for LACERATIONS. The wordplay part of the clue is \"Shoestring allowances\" which can be expressed as LACE + RATIONS which \"lead to\" LACERATIONS. The number in parentheses tells you the number and length of the answer words--in this case, it's one 11-letter word.Another example, with a different type of wordplay is \"Rearrange, rearrange ram's front (9)\" which is a cryptic clue for TRANSFORM. \"Rearrange\" is a straightforward definition of TRANSFORM and \"rearrange ram's front\" tells you to rearrange, or anagram, the nine letters in \"ram's front\" giving you the nine-letter word TRANSFORM.One of most fascinating things about cryptics is that the clues are a combination of tremendous creativity and imagination, on one hand, and strict, formal rules, on the other.This book contains 45 variety cryptics from members of the NPL, many of them by distinguished puzzle authors, as well as a foreword by Will Shortz, the New York Times crossword editor and the NPL's official historian[PuzzleMeter: Difficulty—Very Difficult; Style—Contemporary]",
  "genres": [],
  "author": "Joshua  Kosman",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/1403535.National_Puzzlers_League_Cryptic_Crosswords"
}