{
  "title": "Double Sin and Other Stories",
  "description": "A superb collection of treats for mystery lovers, featuring both the indomitable English gentlewoman, Miss Marple, and the inimitable Belgian detective, Hercule Poirot. The publisher has even added a few of Ms. Christie's supernatural stories to entice you.The stories are: (1) Double Sin, (2) Wasp's Nest, (3) The Theft of the Royal Ruby, (4) The Dressmaker's Doll, (5) Greenshaw's Folly, (6) The Double Clue, (7) The Last Séance, and (8) Sanctuary. Of the eight, Hercule Poirot stars in (1), (2), (3), and (6). Miss Marple is the lead in (5) and (8). And there are two Christie standalones, not part of any novel or short story series, (4) and (7).\"The Theft of the Royal Ruby\" is actually an expanded version of 1923's \"The Adventure of the Christmas Pudding.\" A young prince from the Middle East, during a visit to London, has dabbled with the wrong woman and lost a magnificent jewel which only Hercule Poirot may be able to recover. Talking of dabbling, that is what Miss Marple does in \"Sanctuary.\" She offers advice to her goddaughter on a religious matter; a man has died in the woman's church under mysterious circumstances. Readers are also sure to enjoy \"The Last Séance\" in which a young medium holds one too many.Librarian's note: this entry is for the collection of short stories, \"Double Sin and Other Stories.\" Individual entries for each of the stories, including the title story, can be found elsewhere on Goodreads. The entries for Hercule Poirot short stories can be found by searching: \"a Hercule Poirot Short Story.\" For Miss Marple, \"a Miss Marple Short Story,\" and for Christie short stories without such leading characters, \"an Agatha Christie Standalone Short Story.\"",
  "genres": [
    "Mystery",
    "Agatha Christie",
    "Short Stories",
    "Fiction",
    "Classics",
    "Audiobook",
    "Crime"
  ],
  "author": "Agatha Christie",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/140354.Double_Sin_and_Other_Stories"
}