{
  "title": "Until You",
  "description": "Sheridan Bromleigh's early life had been spent as a happy vagabond, traveling around America with her father and riding bareback on an Indian pony. But these blissful days ended abruptly when, at fourteen, she was given over to the care of a prim maiden aunt. Within six years, Sheridan went from a carefree tomboy to a young woman who epitomized dignity and restraint --- at least on the surface.Now a teacher in a school for wealthy young ladies, Sheridan is hired to accompany one of her students, heiress Charise Lancaster, to England to meet her fiance. When Charise elopes with a stranger, Sheridan continues the voyage alone, wondering how she will ever break the news to Charise's aristocratic fiance. Lord Burleton.Shaky but brave, Sharidan prepares to disembark in London and meet the man she believes is Charise's intendend. Convinced that Lord Burleton can and will charge her with negligence, or worse, she walks down the gangplank, believing she is probably bound for an English dungeon.Standing on the pier, Stephen Westmoreland, the Earl of Langord, watches Sheridan Blomleigh coming toward him and assumes she is Charise Lancaster. Before Sharidan can confess that Charise has eloped, the Earl informs her that he was inadvertently responsible for Lord Burleton's death in a carriage accident the night before. Distracted by their own concerns, neither of them notices that Sharidan has stepped into the path of a cargo net loaded with crates!Three days later, she awakens in Stephen Westmoreland's London mansion, with no memory of who she is --- the only hint of her past, the puzzling fact that everyone calls her Miss Lancaster. All she truly knows is that she has landed in the sumptuous lap of luxury and that she is falling in love with a dazzlingly handsome English earl, who is by turns charming, witty, and strangely remote ... and that the life unfolding before her seems full of wondrous possibilities ...",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Historical Fiction",
    "Regency",
    "Fiction",
    "Adult"
  ],
  "author": "Judith McNaught",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/1404764.Until_You"
}