{
  "title": "A Play of Isaac",
  "description": "THE MIDDLE AGES COME TO LIFE... TO BRING US MURDERThe year is 1434, and preparations are under way for the Corpus Christi festival in Oxford, England. Plays are a traditional part of the celebration, and Joliffe and the rest of his troupe are to perform Isaac and Abraham. Until then, their theatrical antics are in demand by a wealthy merchant who offers them an opportunity to ply their trade for room and board.But when the body of a murdered man is found outside the barn door where the troupe is lodging, Joliffe must raise the curtain on the merchant's mysterious past and uncover the startling truth behind a murder most foul...PRAISE FOR THE PLAYER JOLIFFE SERIES \"Everything I'd hoped to find: memorable characters, a meticulously detailed world, an intriguing crime, and a satisfying conclusion.\" - Roundtable Reviews\"Will entertain and confound you with its intricately plotted mystery and richly detailed writing... Ms. Frazer knows the fifteenth century and it shows...\" - Romance Readers Connection\"Deftly drawn characters acting in a stage of intricate and accurate details of medieval life.\" - Affaire de CouerCarefully and faithfully rendered, 15th-century England and France and all the political difficulties come easily to life... Medieval mystery fans will once again enjoy the clever player Joliffe and his adventures. - The Mystery ReaderPRAISE FOR MARGARET FRAZER\"Prepare to be enchanted as Margaret Frazer transports you back to the 15th century.\" - Romantic Times\"More than just a good read. The reader comes away sadder and wiser, knowing that what tehy've read is that stuff of real life. Brava!\" - Historical Novels Review\"A smooth and absorbing saga of conspiracy and treachery in 15th-century England... A tantalizing secret turns out to have stunning political implications.\" - Publishers Weekly\"Finely plotted and subtly shaded. Frazer has the detailed substance that brings an era to life, while her characters' psychological makeup is as cunningly wrought as the historical background.\" - Publishers Weekly\"Margaret Frazer has quietly claimed her place as one of the preeminent writers of historical crime fiction, delivering the whole package - a good mystery, wonderful characters, and a fascinating period of history. Her novels are a dream to read.\" - Aunt Agatha's NewsletterHerodotus Award Winner.Twice nominated for the Edgar AwardTwice nominated for the Minnesota Book AwardA Romantic Times Top Pick.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Historical Mystery",
    "Historical",
    "Medieval",
    "Fiction",
    "British Literature"
  ],
  "author": "Margaret Frazer",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/140554.A_Play_of_Isaac"
}