{
  "title": "La vera storia dei miei capelli bianchi",
  "description": "\"Esiste un prima e un dopo nella vita di un omosessuale. All'inizio giochi a nascondino con te stesso e con gli altri. Ma non è un gioco piacevole: la penitenza è la pubblica gogna, o almeno questo è quello che ti fanno credere. Poi cambi pelle. È il momento della rivelazione.\"In questo memoir aperto e appassionato, Paola Concia racconta con grande sincerità il suo percorso verso il coming out, la dolorosa doppiezza di quel \"prima\" e le difficoltà e gli ostacoli del \"dopo\", ma anche la possibilità di combattere le proprie battaglie a viso aperto. Dai Dico al disegno di legge contro l'omofobia e transfobia fino alle discusse campagne contro il razzismo e la violenza sulle donne, Paola - deputata del PD e unico parlamentare italiano dichiaratamente omosessuale - si muove in politica con una pratica orgogliosamente femminile, fatta di intuito, inventiva e capacità di dialogare anche con chi la pensa in modo molto diverso da lei. Con un obiettivo chiaro: costruire, in Parlamento ma soprattutto nel Paese, uno schieramento e un tessuto sociale disponibili a condividere le nuove, fondamentali battaglie sui diritti civili.Diritti all'amore e alla felicità che in Italia sono tutt'altro che riconosciuti, tanto che il matrimonio oltre frontiera di Paola con la sua compagna Ricarda ha fatto clamore, sollevandole contro l'aspra critica di promuovere modelli contrari alla morale e ai valori della famiglia. Eppure, nel ripercorrere gli anni che l'hanno portata alla maturità conquistata e serena dei suoi capelli bianchi, Paola ci racconta esattamente l'opposto, svelandoci un'infanzia e un'adolescenza assolutamente normali, vissute in una famiglia cattolicissima e tollerante, dove più di ogni cosa è sempre contato il rispetto delle opinioni altrui. Cresciuta a \"pane, libertà e rigore\" in una piccola cittadina di provincia dell'Abruzzo, sposatasi in gioventù con un uomo per desiderio di normalità, per poi divorziare e risposarsi lo scorso anno con Ricarda fuori dalle leggi italiane ma nel nome dell'amore, con la sua storia personale e pubblica Paola ci riporta alle contraddizioni stesse del nostro Paese, ai suoi sorprendenti spazi di libertà e autonomia di pensiero e d'azione, ma evidenzia anche quel groviglio di ipocrisia, convenienze e pregiudizi, di cui l'Italia è più che mai chiamata a spogliarsi se vuole entrare a pieno titolo nella modernità, se vuole rendersi conto che gli anni Cinquanta sono finiti da un pezzo.",
  "genres": [],
  "author": "Paola Concia",
  "average_rating": "3.18",
  "url": "https://www.goodreads.com/book/show/14058945-la-vera-storia-dei-miei-capelli-bianchi"
}