{
  "title": "Discovering Yourself",
  "description": "- John Stith Pemberton invented the formulae of Coca-Cola drink at age 50. Productive even in old age. Age was no barrier. Though sick and old, Pemberton continued his research into late nights, until he combined cola plant and kola nut. Hence the compound name Coca-Cola- Elvis Aaron Presley, the best musicians of the century (Guinness book of records) was a former truck driver before he discovered himself. Highest moneymaking celebrity even in 27 years after his death (2004), his records sold $45 million dollars.- Philip Emegwali regared as father of the internet dropped out of school because of poor parental background who couldn’t afford enough money to train all their children. Philip however studied on his own. He was nicknamed “calculus” as he mastered the subject at 14 and even out calculated his tutors. He sat for and got GCE from University of London and at 17 got scholarship to Oregon State University where he studied mathematics. After graduation he studied and got two masters degrees. He also has a master’s degree of University of Mary Land and a doctorate - Yamaha Torakusu was a cabinet maker but founded the now world largest manufacturer of a full line of musical instruments Yamaha ... EtcDon’t wait indefinitely for open doors to come, create one yourself or you may die of old age waiting. This book,\"Discovering Youself\" is an eye opening and game changer. It will help you discover your potentials. The you in you that makes you the you, you are. The real you that God created to survive in your own world and conquer. Have you watched someone so full of potentials and discover something you felt he or she would have been in life but did not? A successful footballer? A prolific writer, a potential creative actor, an accomplished academia or scholar, a moving powerful singer or a great leader? It might not be the fault of circumstances beyond their control nor circumstances under their control but theirs. It is either you describe and circumvent your problems or they will circumscribe and short-circuit you. A problem can either make you or mar you. It all depends on how you look at it. Never die with this enormous power deposit inside you unutilized. Do something now. Discover your potentials. How? Find out from this book, Discovering Yourself. Get your copy today and for your friends tooThis self-help, motivational, Inspirational and charismatic self-discovering, heartwarming book help people get more information on harnessing, developing and transforming their potentials and talents. Its unique advantage is that it is based on the author's actual life experience.\" Who are you? Why are you here? What potential deposits are you carrying? What purpose, assignment, calling, destiny, were you created to fulfill. What were you born for? You must discover who you are and how to harness your God-given potentials.This is a must read for all who want to succeed in life no matter your profession. See yourself, evaluate yourself, access yourself and draw from your natural strengths and weakness.Failure and inability is not disability.There is ability even in disability. Find out from this book, success nuggets and treasures that will translate your humble attitudes to HIGH ALTITUDES. Good Luck",
  "genres": [],
  "author": "Ikechukwu Joseph",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/14059258-discovering-yourself"
}