{
  "title": "A Dangerous Inheritance: A Novel of Tudor Rivals and the Secret of the Tower",
  "description": "In this engrossing novel of historical suspense, New York Times bestselling author Alison Weir tells the dramatic intertwined stories of two women—Katherine Grey and Kate Plantagenet—separated by time but linked by twin destinies . . . . involving the mysterious tragic fate of the young Princes in the Tower. When her older sister, Lady Jane Grey, the Nine Days Queen, is imprisoned and executed in 1553 for unlawfully accepting the English crown, Lady Katherine Grey’s world falls apart. Barely recovered from this tragic loss she risks all for love, only to incur the wrath of her formidable cousin Queen Elizabeth I, who sees Katherine as a rival for her insecure throne. Interlaced with Katherine’s story is that of her distant kinswoman Kate Plantagenet, the bastard daughter of Richard III, the last Plantagenet king. In 1483, Kate travels to London for Richard’s coronation, and her world changes forever. Kate loves her father, but before long she hears terrible rumors about him that threaten all she holds dear. Like Katherine Grey, she falls in love with a man who is forbidden to her. Then Kate embarks on what will become a perilous quest, covertly seeking the truth about what befell her cousins the Princes in the Tower, who may have been victims of Richard III’s lust for power. But time is not on Kate’s side, or on Katherine’s. Katherine finds herself a prisoner in the Tower of London, the sinister fortress that overshadowed the lives of so many royal figures, including the boy princes. Will Elizabeth demand the full penalty for treason? And what secrets will Katherine find hidden within the Tower walls? Alison Weir’s new novel is a page-turning story set within a framework of fascinating historical authenticity. In this rich and layered tapestry, Katherine and Kate discover that possessing royal blood can prove to be a dangerous inheritance.",
  "genres": [
    "Historical Fiction",
    "Historical",
    "Fiction",
    "Tudor Period",
    "British Literature",
    "Romance",
    "16th Century"
  ],
  "author": "Alison Weir",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/14059692-a-dangerous-inheritance"
}