{
  "title": "A Little Harmless Secret",
  "description": "Just because you love someone doesn't mean you can trust them.  Devon Stryker is a man with no past—not one anyone can dig up that is. His made up identity has kept him safe from everyone, except one woman. Five years earlier he let his guard down once, one night of unforgettable passion. He has yet to get her out of his mind. When he thinks he sees her in Seattle, he becomes obsessed with finding her.  Alicia Hughes hasn’t forgotten Devon either. She had been on assignment from MI-6 to find him. Since he disappeared, her life has fallen apart. When she comes face to face with the one man she loved—and the one she fears the most—she panics. When he catches up to her, he finds the woman he has always loved—and the child they made together.  As the old lovers form a tentative alliance, the feelings they both had for each other rise to the surface. They have to let those things go to protect everything they hold dear in the world because someone is intent on destroying them…by any means possible.  WARNING: This title includes secrets, guns, a sexy know-it-all hero, spies, a heroine who doesn't trust the hero, meddling inlaws, even more spies, double crosses, cool computer things, and two people who can't seem to keep their hands off each other even though they know it isn't the right thing to do. Remember, it's a Harmless book, so have ice water and towels nearby.  Harmless Series A Little Harmless Sex A Little Harmless Pleasure A Little Harmless Obsession A Little Harmless Lie A Little Harmless Addiction A Little Harmless Submission A Little Harmless Fascination A Little Harmless Fantasy A Little Harmless Ride  A Little Harmless Military Romance Infatuation Possession Surrender  Serial Only for Him  Bundles A Little Harmless Military Romance Vol 1 The Best of Both Worlds A Little Harmless Six Pack  Coming Soon The Harmless Shorts-July 2014 ALHMR: Craving-Fall 2014 ALHMR: Relentless-Fall 2014",
  "genres": [
    "Erotica",
    "BDSM",
    "Contemporary",
    "Contemporary Romance",
    "Erotic Romance"
  ],
  "author": "Melissa Schroeder",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/14059771-a-little-harmless-secret"
}