{
  "title": "التوحيد والتفسيخ بين سياسات الإسلام والكفر",
  "description": "الدكتور كليم صديقي علم بارز من شبه القارة الهندية, كان يشغل قبل و فاته – رحمه الله مدير المعهد الإسلامي بلندن و له دور جبار في تنوير و توجيه و ترشيد الصحوة الإسلامية في العالم بأسره, وفي تفعيل الإسلام بشكل حي بانجلترا و بعاصمتها لندن بالخصوص له مؤلفات عدة في هذا الخصوص. و هذا البحث موجز و لكنه مركز جدا, وهو محاولة اجتهادية لفهم و تحليل المسار التاريخي للإنسانية بين نظام الوحي الإلهي و الأنظمة الأرضية البشرية.المؤلف من إصدارات \"الزهراء للإعلام العربي\" و هي مؤسسة غراء معهود لها نشر الفكر الإسلامي الحي و المتنور.يشير المؤلف بدءا إلى التجانس المعرفي لحركة الأنبياء من آدم إلى محمد, عليهم السلام و إلى أن أحدث و آخر نمادج المعرفة الموحاة يتمثل في القرآن الكريم و سنة النبي الشريفة و سيرته الطاهرة عليه أفضل الصلاة و السلام.وفي مقارنته للأنموذج المووحى و الأنموذج البشري يشير إلى أن الأنموذج الموحى للمعرفة جزء صغير من المعرفة البشرية و لكنه الجزء الرئيسي و الأهم و الحيوي و يجب أن يمثل النواة الدائمة التي ينبغي أن تتبعها جميع جهود المعرفة البشرية من بحث و تأمل و تحديد و تجريب في كل آن. و هذا الأنموذج المعرفي الأشمل الذي ينبغي أن يتحكم في مسار الأنموذج المعرفي البشري و يوجهه, و هذا لا ينفي دور الأنموذج العلمي (البشري) في تعميق فهم الإنسان. يجمل ذلك فيما يلي :توسيع الفهم الأنموذج المعرفي الموحى الأنموذج المعرفي العلميتعميق الفهمو الاقع الحالي يسود فيه الأنموذج العلمي الغربي, الذي يعتوره الخلل حيث أنه يدعي لعمله أكثر مما ينبغي له فيزعم أنه لا وجود لحقيقة علمية خارج دائرة منجة التجريبي و يقصي الدين خارج إطار العلم. و الواقع أن رجال السياسة يتحكمون في مسار العلوم بخلاف تحكم الوحي في المعرفة و السلوك البشريين سواء للعلماء أو السياسيين أو غيرهما في الإسلام.وحين تحذث عن خصائص اتجاهي التوحيد و التفسيخ، أشار إلى أن اتجاه التوحيد قد ورثته البشرية عن الأنبياء، ثم تكال و تعزز ف الأنموذج الإسلامي الأسمى.أما اتجاه التفسيخ فقد أنتج الغرور و الانغلاق في الأنموذج العلمي الغربي. و هذا الاتجاه قد تسبب في تجزئة أوربا نفسها و في ساسلة الحروب التي شهدتها، وفي هدم المسيحية، وفي انفصام الجسد البشري عن عقله و روحه وفق ما شهده فكر الغرب وواقعه.و بهذا فإن الحضارة الأوربية اللأدينية قد عملت على تدمير العوامل التوحيدية في العالم وسعت إلى خلق و سائل تفسيخية في العالم الإسلامي على المستوى العقيدي أيضا كحالة القاديانية في المشرق الإسلامي. و استعراض حركة الاستشراق كوسيلة من الوسائل التي اعتمدها الاستعمار لغربي تجاه العالم الاسلامي في هذا المضمار.ومن مواصفات هذا الانموذج الغربي أنه نظام فوضوي : منتظم في شكله، فوضوي في جوهره، و من أمثلة ذلك الوؤسسات التعليمية، إذا اعتبرنا منها تلك التي أنشاها الغرب في بلاد الإسلام، نجد على أنها عملت على إفراز \"رجال الفكر\" ذوي الثقافة \"الهجينة\" نصف غربي و نصف إسلامي تقليدي (أنصاف المثقفين). و قد اعتمد الغرب على هذه الفئة في استغلال قيم المجتمع التقليدي و مشاعره الإسلامية لأهداف مرسومة، و قدم كمثال لذلك حزب الرابطة الإسلامية في شبه القارة الهندية.و لخلق تبعية شاملة فقد كانت الدول القومية من نتاج الحضارة الغربية التي لاسبيل لها إلا الخضوع. و تحدث عن الوعي الإسلامي الشعبي فأشار إلى أن الإسلام هو مصدر إلهام الجماهير وتوجيهها بالرغم من الجهود التفسيخية الجبارة للغرب. و انتقد علماء السنة في سيرهم وراء الحكام و غيابهم عن قيادة الجماهير، و كذلك بعض علماء الشيعة، و قدم الرابطة الإسلامية كمثال، و حضور عديد من \"علماء\" الإسلام لمؤتمر \"إسلامي\" في بغداد يشرف عليه النظام اللاديني في العراق.و عاد إلى مشكلة الأحزاب \"الإسلامية\" الحديثة، فأشار إلى الخلل الذي اعتورها منذ البداية و الانحراف الذي و سع الهوة بينها و بين الجماهير، ماجعلها تؤيد بقاء نفوذ الحضارة الغربية على المجتمعات الإسلامية، و تبحث عن الحلول الوسط و التسوية المذلة مع الحكام الجدد. فانتقذ \"الإخوان المسلمين\" في العالم العربي في مواجهة \"الوفد\" و \"الجماعة الإسلاية\" في باكستان في مواجهة \"الرابطة الإسلامية\" حيث أن هاتين الحركتين انطلقتا من توسع جماهيري يتحدى نظام ما بعد الاستعمار كتحولا إلى جماعة ضغط في شبه حزب سياسي ثم إلى تنظيمات تحبوية. و بالتالي فإنه لم يتم تحريك الأنموذج الإسلامي تحريكا كليا في حركة شعبية عارمة، و لكن المحاولات كانت جزئية.لقد قاومت الجماهير المسلمة محاولة عملاء الحضارة الغربية الانسلاخيين، وقاومت محاولة الأحزاب السياسية ذات النوايا الحسنة لكن بدون العالية المطلوبة، و يستلزم لتحريك قوة الجماهير المسلمة أن تتحول الحركة الإسلامية إلى حركة شعبية. أما لوحدة الأمة الإسلامية، فينغي الرتكاز على مقومات و حدة المسلمين رغم تشتتهم في دول قومية متعددة مع توضيح الصورة الواقعية لهذه الدول حكاما و محكومين، ثم على دور هذه المقومات في إعادة الأمور إلى نصابها و تخليص الأمة من نخبة الفساد المسيطر، و أن مصدر قوة الإسلام يكمن في الإسلام نفسه. و عن القيادة المطلوبة وشروطها فإن الانموذج الأسمى الذي مثله تاريخ الإسلام و الذي يتضمن الثقافة السياسية الجماهيرية التي قاومت كل الضغوط التي مارستها الحضارة الغربية لاخضاع مجتمعاتنا.يقدم المؤلف إيران كنموذج حالي ومن خلاله يجمل الشروط التي ينبغي أن تتحقق في القيادة لكي تستجيب لها الجماهير. ثم يعطي توضيحا بيانيا لمسيرة اتجاهي التوحيد و التفسيخ في التاريخ حيث يلتقي الاتجاهان عند الثورة الإسلامية في إيران كنتاج متطور وفعلي للثقافة السياسية للجماهير المسلمة، و كرد فعل مناسب و طبيعي لركام التفسيخ للحضارة الغربية.ومن هنا ينوه بدور قياديي الثورة من علماء و على رأسهم الإمام الخميني (رحمه الله)، ثم يقدم رسما بيانيا آخر يوضح فيه إطارين لفئتين منبثقتين عن يقسيم الأمة الإسلامية :فئة تمثل سبيل الهداية و التنوير، تمثلها الحركة الإسلامية، و في قمة عطائها الثورة الإسلامية في إيران.و فئة تمثل سبيل الضلالة و التضليل تجسدها الدول القومية و هي من صنع الاستعمار بدون شرعية كلها دكتاتوريات صفتها العلمنة و التغريب و الخضوع لسيطرة الجول الكبرى مع مواصفات أخرى....و أخيرا يختتم بكلمة تنبثق عن المنطق القوي و تبعث الأمل الواعد : \"إننا على مشارف تحول جذري تظهر فيه الحضارة الإسلامية في دور الحضارة الوحيدة الصالحة للبشرية جمعاء\".",
  "genres": [],
  "author": "Kalim Siddiqui",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/14059797"
}