{
  "title": "The Supermarket Guy II: Rise of the Market Overlord",
  "description": "Being the sequel to The Supermarket Guy, Harold finds himself with the new title as Chief Executive Officer of a once great supermarket chain. It is a humorous story of subtle espionage, and of big shot comedy. Harold is now faced with the daunting challenge of repairing the franchises near bankruptcy state. When at the helm, he finds things that are much out of place. Not only having to deal with difficult, demanding personality issues in the boardroom, he also finds that the quarterly expense and sales figures do not properly add up. Needless to say, the products that are on the shelves are, of substandard quality. With the added competition of the JoAcadou Mart, the competing CEO will not give HaroldsE1/4 supermarket chain a chance to breath from the mire of its red ink. The situation becomes perilous at times, when this rival CEO by the name of Jon Acadou, will stop at nothing to force him into selling his company. Will a free feed of bologna sandwiches be enough to sway all of the boardroom members to continue with the status quo? Can his security guard, who has only 1 out of his 9 lives left, capture the spy and bring a quick closure to a diabolic plan launched to destroy the chain forever? Growing up, my main interest was art sketching, and I got plenty of inspiration for practice through the comic books I bought locally. I became a big fan of Marvel and Archie comics. Then there was the calmness and serenity that was only offered by small-village life, with the art of fishing and wading in its rivers in the hot summer months. Being a nature lover, sometimes a thirst came to just escape into the wild where the scent of pines and fir trees abounded in massive quantities. Then the yellow colors of birches, red maple leaves, and the fall rustle of leaves on the ground provided for myself a strange sort of reflection and admiration of the cycle of nature. The solace of winter and the fresh powder base allowed us to rush out again to enjoy cross-country skiing, sliding, and downhill skiing.",
  "genres": [],
  "author": "Daren Doucet",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/14061637-the-supermarket-guy-ii"
}