{
  "title": "Carpe Noctem",
  "description": "When an ancient relic of enormous power inadvertently falls into the hands of a weak and desperate antiques dealer, hell on earth becomes more than just a cliché to the small town of Banderman Falls, Pennsylvania. Seduced into believing that the relic is his to command, Carlton Wedgemore is manipulated into serving the demonic incarnation of all evil, Zachariah Witherstone. And Banderman Falls is plunged into a nightmare of darkness from which it may never awaken.It began in Book 1: The Coming. Men and women were pitted against one another, driven by madness and controlled by Witherstone. Lethal battles erupted across the Falls and the casualties kept climbing. The Sheriff, the town doctor, a friend pressed into service as deputy, and a local B & B owner, up against an evil of such intensity, discovered that they may have little chance of defeating it and surviving.Geoffrey Dunsmore, a man with unusual powers, arrived from London to meet with his old friend, Father Gabriel Jacobs. Together, they set out to keep Witherstone from acquiring the icon and destroy him in the process. Barely surviving a brutal attack by minions of Witherstone, they discover that, without help, they too may be in over their heads.In Book 2: Carpe Noctem, the nightmare continues. The town is torn apart and destruction reigns supreme. Foul creatures, dug from the earth, will join with Witherstone, now in his demon form. Forces are drawn together on both sides … good and evil … and a final, midnight showdown in the cemetery will decide the fate of all of Banderman Falls … and beyond. Hope is all that the mortals seem to have left. In control of the icon, Witherstone stands on the edge of a victorious annihilation of all mankind. Everything will hinge on the honor of an old man, the powers of a woman who is just coming into her own, and the courage of a young boy.The only question that remains which side will Seize the Night?",
  "genres": [],
  "author": "T.A. Bradley",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/14062064-carpe-noctem"
}