{
  "title": "The Method Writers",
  "description": "Four Writers. Four Methods. One Twisted Novel. When four eager writers adopt the \"method acting\" approach to add realism to their individual writing projects, their mundane lives are replaced by the outrageous, and each is plunged into a journey they never dreamed possible. Dorian Nettle is a 29 year-old journalist who dreams of earning a Pulitzer Prize someday. She takes an undercover job at the call center of a local escort service to discover if she's anything like her late (birth) mother a New Orleans' hooker. David Hass describes himself as an unsuccessful, financially-impaired writer whose personal life is as depressing as his writing career. In an attempt to avenge his abused love interest, David is confronted with how far he ll go to personalize his fictitious vigilante character, Kenny Black. Georgie Mae Perez, is a twenty-something girl whose look on life is both fearless and foolish. Frustrated that her writing is ordinary, she picks up a gun instead of a pen and creates a whole new world of prose. Marty Pitchford is a married man caught in a world of mediocrity and melodrama. Confronted by his wife s extramarital adventures, Marty embarks on his own tantalizing escapades. When his daughter s safety falls into the wrong hands, Marty must make a decision of what he truly wants. Their adventures become dangerous to both themselves as well as others, and the way back appears bleak. Will they make important discoveries about themselves and each other that will be necessary to bring them home again? This group novel was dreamed up and written by Bridget Callaghan, Michael Ray King, Nancy Quatrano, and Jeff Swesky - the Rogues Gallery Writers. Also, check out Fictitious Fiction, the bold collection of short stories written by the actual characters from The Method Writers. \"",
  "genres": [],
  "author": "Rogues Gallery Writers",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/14062581-the-method-writers"
}