{
  "title": "L'œuf des ténèbres",
  "description": "\"Le Temps... Akbar n'est rien !... Ni le Nid... Ni Ramor !... C'est le Temps qui est tout ! Il est la cause, le principe originel... Et lorsque la tentation s'empare du mythe... lorsque l'homme s'oppose à l'univers et le bouscule, c'est au mythe de rétablir l'ordre !\" Ainsi s'exprime le Gardien du Nid lorsque Bragon, Pélisse, Bulrog et messire l'Inconnu s'enfuient du Doigt du Ciel, emportant avec eux l'?uf des Ténèbres qui y était caché. Ils sont accompagnés de Kiskill, servante des dieux qui a perdu son immortalité et ses pouvoirs en même temps que sa virginité dans les bras d'un Élu qui n'est autre que... messire l'Inconnu. C'est tous ensemble qu'ils devront parcourir la dernière étape de la Quête. Et c'est bien contre le temps que la course s'est engagée, car il ne reste plus que deux jours pour rejoindre Mara avec l'?uf. Ramor, bien que toujours enfermé dans la conque, devient de plus en plus fort, et Mara ne saurait le contenir sans l'aide de l'?uf. Bragon choisit la route la plus courte et décide de survoler la Marche Blanche, fief du prince-sorcier Tharmine et terre du noble et fier peuple Jivrain. Même ainsi, les difficultés s'amoncellent devant leurs pas. Leurs Lopvents ne sont pas assez nombreux et les Jivrains sont atteints par une épidémie de Fièvre Folle qui rend fou furieux ce peuple d'habitude si paisible. Les événements se précipitent, mais la traversée de la Marche Blanche ne constituera qu'une péripétie lorsque viendra enfin l'heure pour chacun de révéler son véritable visage. Quelles sont les vraies motivations de Mara ? Pélisse est-elle vraiment la fille de Bragon ? Ce dernier verra-t-il se réaliser la prophétie du Vieux des Bois qui, avant de mourir, lui prédisait qu'il trouverait la folie en réclamant la mort ?... Toutes les questions, les interrogations, trouvent ici leur réponse. Toutes les pistes de la Quête s'acheminent ici vers leur conclusion. Une fin digne de la \"Quête de l'Oiseau du Temps\" !",
  "genres": [
    "Bande Dessinée",
    "Comics",
    "Fantasy",
    "Graphic Novels",
    "France",
    "Graphic Novels Comics",
    "Fiction"
  ],
  "author": "Serge Le Tendre",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/1409687.L_uf_des_t_n_bres"
}