{
  "title": "Mindfulness for Beginners: Reclaiming the Present Moment―and Your Life",
  "description": "What if you could profoundly change your life just by becoming more mindful of your breathing? According to Jon Kabat-Zinn, you can. What if paying attention on purpose (and nonjudgmentally) could improve your health? Again, according to Dr. Kabat-Zinn--it can.On Mindfulness for Beginners,  this internationally known scientist, bestselling author, and teacher who brought mindfulness meditation into the mainstream of medicine and society gives you immediate access to a practice that can potentially add years to your life, and will certainly enhance the quality of your moments and your years.Join Dr. Kabat-Zinn to:Explore five guided meditations that lead you breath-by-breath into the essence of Mindfulness-Based Stress Reduction (MBSR), a program offered in medical clinics and hospitals around the world- Cultivate the Seven Key Attitudinal Factors of MBSR--qualities of heart and mind that lay the foundation for mindfulness practice and for seeing and accepting things as they are as a first step to working wisely and compassionately with stress, pain, illness, and sorrow as well as life's joys and pleasures- Free yourself from limiting perspectives, and become more intimate with your own boundless awarenessYou're already in the perfect moment for inhabiting this liberating awareness, which is always available, teaches Jon Kabat-Zinn. With Mindfulness for Beginners, he invites you to cultivate mindfulness as if your life depended on it, which it surely does, and experience the magnitude and beauty of who you already are.Course objectives: Apply an understanding of the concept of mindfulness- Utilize simple guided meditations led by Kabat-Zinn- List the ethical and attitudinal foundations necessary to cultivating mindfulness- Assess how we can choose where to focus our awareness- Plan to use mindfulness to help us develop compassion and insight into our true nature",
  "genres": [
    "Nonfiction",
    "Self Help",
    "Psychology",
    "Spirituality",
    "Audiobook",
    "Buddhism",
    "Philosophy"
  ],
  "author": "Jon Kabat-Zinn",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/14098.Mindfulness_for_Beginners"
}