{
  "title": "It's Called Work for a Reason!: Your Success Is Your Own Damn Fault",
  "description": "The #1 bestselling author of Shut Up, Stop Whining, & Get a Life reveals the only thing you need to know to succeed in business: YOUR SUCCESS IS YOUR OWN DAMN FAULT!  Some authors of business books stroke your ego by reinforcing information you already know. Others give you detailed statistical analysis of the economy, or buying trends, encouraging you to get lost in the pages of boredom until you have no idea what the book is even about. Some authors exploit the hottest buzzword and beat it to death, without giving you any real idea how to do what they suggest must be done. Some say that all you have to do is love your job in order to be successful at it. The worst of the lot tell cute little parables through inane dialogues with messages so simple and trite that we should all be insulted. In IT’S CALLED WORK FOR A REASON, Larry Winget tells the unvarnished truth about what it takes to be successful:  NOT business jargon (Forget branding! Forget thinking outside the box—you’re not in a box!) NOT parables (Who cares who moved your cheese—what cheese?)  NOT praise sandwiches (talk about cheese!)   Just the one key ingredient to success in business: Work!  Are you frustrated with a lack of results at work? Have you hit a wall? Are you uninspired, stuck in a rut, feeling underappreciated? Well, good news: your success is not up to your boss, your manager, your employees, or the economy. It’s up to YOU. Business is never bad, people are just bad at being in business. If that makes you mad, this book is for you. Larry Winget hacks through the bad advice given in most business books, explaining why  *\tTeamwork doesn’t work *\tWe are all stealing from our companies and ourselves *\tSuccess is simple *\tResults are everything *\tYou don’t have to love your job (but it helps!)   You will be surprised, you will laugh, and you will discover motivation you never knew you had. Let Larry Winget shock you out of your comfort zone, and into a whole new league.",
  "genres": [
    "Business",
    "Nonfiction",
    "Self Help",
    "Personal Development",
    "Leadership",
    "Finance",
    "Humor"
  ],
  "author": "Larry Winget",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/141062.It_s_Called_Work_for_a_Reason_"
}