{
  "title": "Vegetable Soups from Deborah Madison's Kitchen",
  "description": "In Vegetable Soups from Deborah Madison’s Kitchen , America’s favorite vegetarian cookbook author presents more than 100 inventive and straightforward soup recipes guaranteed to satisfy appetites all year long.Deborah Madison has shown millions of Americans how to turn vegetables and other healthful ingredients into culinary triumphs. In her newest collection of recipes, She serves up a selection of soups ranging from stylish first courses to substantial one-bowl meals.Madison begins with a soup-making primer and streamlined recipes for vegetable stocks and broths (such as the Hearty Mushroom Broth), which serve as the foundation for many of the recipes that follow, for those who wish to make their own. Soups like the Mexican Tomato Broth with Avocado and Lime can start a supper or stand alone as a simple, light meal. Cooks looking for heartier choices will find satisfying dishes such as Potato and Green Chile Stew with Cilantro Cream or grain-based soups like the Wild Rice Chowder. Organized by seasons, the recipes make the most of the produce–from a springtime Fennel and Almond Soup with Saffron and Ricotta Dumplings to a deeply flavorful autumnal Roasted Squash, Pear and Ginger Soup. When time just isn’t available and prepared soups take the place of home made, Madison offers a battery of suggestions for how to make them your own with simple additions from delicious oils and herbs to an invigorating Cilantro Salsa.Featuring fifty stunning full-color photographs by Laurie Smith, serving suggestions, wine notes, and a host of ideas for creative finishing touches including caramelized pear “croutons” and souffléd cheese toasts, this friendly soup lover's guide gives the reader a hundred delicious ways to enjoy the benefits and flavors of vegetables by the bowlful throughout the seasons.When I said I was working on a soup book, the response was often, “Oh, I love soup!” People enthuse about soup in a way that’s so heartwarming it makes me feel as if I’m in the right camp... The soups in this book are based on vegetables, and many of these recipes are new ones for me. But some are soup classics, by which I mean some of those that have stood the test of time in my kitchen, (Quinoa, Corn, and Spinach Chowder) and those that are classics in the culture (Boston-Style Black Bean Soup). I’ve tried to streamlined these dishes as much as possible without sacrificing goodness, so that you can easily enjoy them in your own kitchen. I hope you do enjoy making these soups and add them, one by one, to your repertoire.—from the Introduction",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Nonfiction",
    "Food",
    "Reference",
    "Vegetarian",
    "Food and Drink"
  ],
  "author": "Deborah Madison",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/141050.Vegetable_Soups_from_Deborah_Madison_s_Kitchen"
}