{
  "title": "The Joke",
  "description": "The first definitive, complete edition of the author's classic first novel presents a tale of love, politics, revenge, and the fate of individuals in contemporary society. By the author of The Unbearable Lightness of Being.Toward the end of this brilliant first novel of thwarted love and revenge miscarried, its leading character-narrator arrives at the thought that \"most people deceive themselves with a pair of faiths: they believe in eternal memory (of people, things, deeds, nations) and in redressibility (of deeds, mistakes, sins, wrongs). Both are false faiths. In reality the opposite is true: everything will be forgotten and nothing will be redressed. The task of obtaining redress (by vengeance or by forgiveness) will be taken over by forgetting. No one will redress the wrongs that have been done, but all wrongs will be forgotten.\"All too often, prophetic words like these, and indeed The Joke in its entirety, have been read for their narrowly political implications. Now, a quarter century after this novel was first published and several years after the collapse of the Soviet-imposed Czechoslovak regime, it becomes easier to put such implications into perspective in favor of valuing the book (and all of Kundera's work) as what it truly is: great, stirring literature that sheds new light on the eternal themes of human existence. The present edition provides English-language readers an important further means toward revaluation of The Joke. For reasons he describes in his Author's Note, Milan Kundera devoted much time to creating (with the assistance of his American publisher-editor) a completely revised translation that reflects his original as closely as any translation possibly can: reflects it in its fidelity not only to the words and syntax but also to the characteristic dictions and tonalities of the novel's narrators. The result is nothing less than the restoration of a classic.",
  "genres": [
    "Fiction",
    "Czech Literature",
    "Classics",
    "Literature",
    "Novels",
    "20th Century",
    "Philosophy"
  ],
  "author": "Milan Kundera",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/1410878.The_Joke"
}