{
  "title": "The Ramayana: A Shortened Modern Prose Version of the Indian Epic",
  "description": "The Ramayana - Suggested by the Tamil Version of Kamban, R. K. Narayan has done his own version of the heroic story of Prince Rama—one of India’s two great epic tales. It is believed to be composed in pre-Sanskrit, Prakriti by the poet Valmiki at a date long believed to be as early as 1500 B.C., though more recent scholarship places it nearer to 400 B.C. In these two and a half millennia, it has been so often retold and so adored that, despite its great length—originally ran to twenty-four thousand stanzas—Indians love to listen to it again and again. Narayan’s  Ramayana was inspired by a version written in the Tamil language by an eleventh-century poet called Kamban (who etched his 10,500 stanzas on palm leaves). It is less a translation than a new retelling, in terms that will help the modern reader to appreciate its rich lore. Rama’s courtship of the fourteen-year-old Sita, their exile, Sita’s abduction, the search, and the great battle with Ravana, her abductor, supply the major drama, involving a teeming pantheon of gods, heroes, and evil spirits. The  Ramayana has been a pervasive and constant element of Indian cultural life—told to children at bedtime, taken by artists and writers for creative inspiration, and studied as scripture. Narayan tells us that it could well be thought of as “a book of perennial philosophy.” Its religious aspects aside, R. K. Narayan’s  Ramayana reflects the centuries-old ethos of the Indian people in a way that is peculiarly relevant to the nature of his country today. An illuminating introduction and epilogue add to the pleasure and fascination of reading the epic itself. The decorations have been drawn from Indian temple sculptures by R. K. Laxman, the author’s brother.",
  "genres": [
    "Classics",
    "Mythology",
    "India",
    "Fiction",
    "Poetry",
    "Hinduism",
    "Spirituality"
  ],
  "author": "R.K. Narayan",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/141151.The_Ramayana"
}