{
  "title": "Beloved",
  "description": "In the troubled years following the Civil War, the spirit of a murdered child haunts the Ohio home of a former slave. This angry, destructive ghost breaks mirrors, leaves its fingerprints in cake icing, and generally makes life difficult for Sethe and her family; nevertheless, the woman finds the haunting oddly comforting for the spirit is that of her own dead baby, never named, thought of only as Beloved. A dead child, a runaway slave, a terrible secret--these are the central concerns of Toni Morrison's Pulitzer Prize-winning Beloved. Morrison, a Nobel laureate, has written many fine novels, including Song of Solomon, The Bluest Eye, and Paradise--but Beloved is arguably her best. To modern readers, antebellum slavery is a subject so familiar that it is almost impossible to render its horrors in a way that seems neither clichéd nor melodramatic. Rapes, beatings, murders, and mutilations are recounted here, but they belong to characters so precisely drawn that the tragedy remains individual, terrifying to us because it is terrifying to the sufferer. And Morrison is master of the telling detail: in the bit, for example, a punishing piece of headgear used to discipline recalcitrant slaves, she manages to encapsulate all of slavery's many cruelties into one apt symbol--a device that deprives its wearer of speech. \"Days after it was taken out, goose fat was rubbed on the corners of the mouth but nothing to soothe the tongue or take the wildness out of the eye.\" Most importantly, the language here, while often lyrical, is never overheated. Even as she recalls the cruelties visited upon her while a slave, Sethe is evocative without being overemotional: \"Add my husband to it, watching, above me in the loft--hiding close by--the one place he thought no one would look for him, looking down on what I couldn't look at at all. And not stopping them--looking and letting it happen.... And if he was that broken then, then he is also and certainly dead now.\" Even the supernatural is treated as an ordinary fact of life: \"Not a house in the country ain't packed to its rafters with some dead Negro's grief. We lucky this ghost is a baby,\" comments Sethe's mother-in-law. Beloved is a dense, complex novel that yields up its secrets one by one. As Morrison takes us deeper into Sethe's history and her memories, the horrifying circumstances of her baby's death start to make terrible sense. And as past meets present in the shape of a mysterious young woman about the same age as Sethe's daughter would have been, the narrative builds inexorably to its powerful, painful conclusion. Beloved may well be the defining novel of slavery in America, the one that all others will be measured by. --Alix Wilber",
  "genres": [
    "Fiction",
    "Classics",
    "Historical Fiction",
    "Magical Realism",
    "Historical",
    "Literature",
    "School"
  ],
  "author": "Toni Morrison",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/1411617.Beloved"
}