{
  "title": "Mr. Poppers Penguins Literature Novel Unit Study",
  "description": "This unit study offers many wonderful activities to use while having students read the book. There are between 6 and 10 lessons. Activities in this lesson include Fill in the Blank, Multiple Choice, True and False, Comprehension, Encyclopedia Skills Activity, Journal Activity, Vocabulary, Sequencing, Handwriting, Main Idea, Prediction, ComparisonLiterature Skills Activities including: Main Character, Main Setting, Main Problem, Possible Solutions, Character Traits, Character Interaction, Cause and Effect, Description, Pyramid of Importance, Villain vs. Hero.Creative Writing Activities including: Letter, Fairy Tale, Mystery, Science Fiction, Fable, Dream or Nightmare, Tall Tale, Memoir, Newberry Award, A Different Ending.Writing Skills Activities including: Description, Expository, Dialogue, Process, Point of View, Persuasion, Compare and Contrast, Sequel, Climax and Plot Analysis.Poetry Skills Activities including: Couplet, Triplet, Quinzain, Haiku, Cinquain, Tanka, Diamanté, Lantern and Shape Poem.Create a Newspaper Layout Activities including: Editorial, Travel, Advice Column, Comics, Society News, Sports, Obituary, Weddings, Book Review, Want Ads, Word Search. Poster Board Activities including: Collage, Theater Poster, Wanted Poster, Coat of Arms, Story Quilt, Chalk Art, Silhouette, Board Game Construction, Door Sign, Jeopardy.We also offer an extended version of this unit which comes in a PDF format and offers Lapbook instructions, Hands on Art and Creative Art activities. If you purchase this unit study and let us know by sending us proof of purchase, we will download the extended version of this full unit with the additional activities in PDF version to you for $1 more. We will also allow you to purchase any other units from our home site for 50% off their original price. Visit our unit study site at www.hshighlights.com.  We also offer a FREE unit study at www.hshighlights.com and a FREE ladies magazine.",
  "genres": [],
  "author": "Teresa Lilly",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/10465133-mr-poppers-penguins-literature-novel-unit-study"
}