{
  "title": "The Feast of Roses",
  "description": "The love story of Emperor Jahangir and Mehrunnisa, begun in the critically praised debut novel The Twentieth Wife, continues in Indu Sundaresan's The Feast of Roses. This lush new novel tells the story behind one of the great tributes to romantic love and one of the seven wonders of the world -- the Taj Mahal.Mehrunnisa, better known as Empress Nur Jahan, comes into Jahangir's harem as his twentieth and last wife. Almost from the beginning of her royal life she fits none of the established norms of womanhood in seventeenth-century India.Mehrunnisa is the first woman Jahangir marries for love, at the \"old\" age of thirty-four. He loves her so deeply that he eventually transfers his powers of sovereignty to her.Power and wealth do not come easily to Mehrunnisa -- she has to fight for them. She has a formidable rival in the imperial harem, Empress Jagat Gosini, who has schemed and plotted against Mehrunnisa from early on. Mehrunnisa's problems do not just lie within the harem walls, but at court, too, as she battles powerful ministers for supremacy. These ministers, who have long had Emperor Jahangir's confidence and trust, consider Mehrunnisa a mere woman who cannot have a voice in the outside world.Mehrunnisa combats all of this by forming a junta of sorts with three men she can rely on -- her father, her brother, and Jahangir's son Prince Khurram. She demonstrates great strength of character and cunning to get what she wants, sometimes at a cost of personal sorrow when she almost loses her daughter's love. But she never loses the love of the man who bestows this power upon her -- Emperor Jahangir. The Feast of Roses is a tale of this power and love, the story of power behind a veil.",
  "genres": [
    "Historical Fiction",
    "India",
    "Fiction",
    "Historical",
    "Romance",
    "Indian Literature",
    "Audiobook"
  ],
  "author": "Indu Sundaresan",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/141462.The_Feast_of_Roses"
}