{
  "title": "Daily Life in Elizabethan England",
  "description": "Students, teachers, and interested readers will find in this resource a vivid and intimate account of life in the Elizabethan age. The first book on Elizabethan England to rise out of the living history movement, it combines a unique hands-on approach with the best of current research. Organized for easy reference, it is enlivened with how-to sections―recipes, clothing patterns, songs and games, all gathered from original sources. This hands-on approach recreates the daily life of ordinary people, not just the aristocracy, and systematically covers the most basic facts of life in a readily accessible format. Clearly illustrated with 94 drawings, patterns, and diagrams, it provides a treasure trove of information for classroom and library use and for those interested in recreating Elizabethan life. The work is organized into sections on the structure of Elizabethan society, the course of life (birth, childhood, education, marriage, old age, and death), the cycles of time (daily, weekly, and yearly schedules, including a calendar of the Elizabethan year), the living environment (houses, villages, towns, and travel), clothing (including instruction for making complete Elizabethan male and female outfits), food (featuring a selection of recipes), and entertainment (songs with sheet music and instruction for authentic games and dances). A chronology of Tudor England, a glossary, appendices with information and ideas on organizing Elizabethan feasts and fairs, and lists of suggested readings, videos, and recordings complete the work. This is an indispensable resource for classrooms and school and public libraries because it gives readers a true understanding of what it would be like to live in 16th-century England.",
  "genres": [
    "History",
    "Nonfiction",
    "British Literature"
  ],
  "author": "Jeffrey L. Singman",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/1414771.Daily_Life_in_Elizabethan_England"
}