{
  "title": "Failure is Not an Option: Mission Control From Mercury to Apollo 13 and Beyond",
  "description": "This memoir of a veteran NASA flight director tells riveting stories from the early days of the Mercury program through Apollo 11 (the moon landing) and Apollo 13, for both of which Kranz was flight director.Gene Kranz was present at the creation of America’s manned space program and was a key player in it for three decades. As a flight director in NASA’s Mission Control, Kranz witnessed firsthand the making of history. He participated in the space program from the early days of the Mercury program to the last Apollo mission, and beyond. He endured the disastrous first years when rockets blew up and the United States seemed to fall further behind the Soviet Union in the space race. He helped to launch Alan Shepard and John Glenn, then assumed the flight director’s role in the Gemini program, which he guided to fruition. With his teammates, he accepted the challenge to carry out President John F. Kennedy’s commitment to land a man on the Moon before the end of the 1960s.  Kranz recounts these thrilling historic events and offers new information about the famous flights. What appeared as nearly flawless missions to the Moon were, in fact, a series of hair-raising near misses. When the space technology failed, as it sometimes did, the controllers’ only recourse was to rely on their skills and those of their teammates. He reveals behind-the-scenes details to demonstrate the leadership, discipline, trust, and teamwork that made the space program a success.  A fascinating firsthand account by a veteran mission controller of one of America’s greatest achievements, Failure is Not an Option reflects on what has happened to the space program and offers his own bold suggestions about what we ought to be doing in space now.",
  "genres": [
    "History",
    "Nonfiction",
    "Space",
    "Science",
    "Biography",
    "Memoir",
    "Audiobook"
  ],
  "author": "Gene Kranz",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/141499.Failure_is_Not_an_Option"
}