{
  "title": "Biggles Delivers the Goods",
  "description": "Rubber. This is what Biggles is asked to deliver by Air Commodore Raymond. 500,000 tons of it, to be taken from Elephant Island, off the coast of Japanese held Malaya to India, as it is vital to the British war effort. A Chinese man called Li Chi brings details of the rubber to the attention of the RAF. Biggles goes to Elephant Island with Li Chi and organises the building of a wooden runway over the lake, painted blue to disguise it from the air. This is so that supply planes can fly the rubber back to India and Biggles' squadron will fly the planes. Biggles organises a trip to Shansie to meet the reclusive Major Marling and obtain further supplies of rubber. He arrives just as the Japanese attack Marling's home and he helps to fight them off. Stealing the Japanese River patrol boat for the return journey, Biggles plans to seize a ship from the Japanese to help transport the rubber, which he later does. Meanwhile, the Japanese plan to attack the base on Elephant Island having been made aware of it by their spies. Japanese destroyers are brought into the Japanese harbour at the mouth of the river. Biggles and Ginger fly up river and blow the banks to flood the surrounding landscape, where the Japanese have an aerodrome. This has the effect of reducing the water in the river and grounding the destroyers in mud. Algy is forced to ditch his plane in the sea and is captured by the Japanese. Their leader, Admiral Tamashoa plans to have him beheaded but another raid lead by Biggles saves him in the nick of time. Just when the Japanese prepare to launch another major attack on the base at Elephant Island, Air Commodore Raymond arrives. He has organised a major air attack on the grounded destroyers and the Japanese reinforcements. With the opposition completely crushed by this attack, Biggles is left to finish delivering the goods. The dust cover shows a close up of Biggles waving.",
  "genres": [
    "Adventure",
    "Fiction",
    "War",
    "Aviation",
    "Classics"
  ],
  "author": "W.E. Johns",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/1415164.Biggles_Delivers_the_Goods"
}