{
  "title": "The Lost Boys of Sudan: An American Story of the Refugee Experience",
  "description": "In 2000 the United States began accepting 3,800 refugees from one of Africa’s longest civil wars. They were just some of the thousands of young men, known as “Lost Boys,” who had been orphaned or otherwise separated from their families in the chaos of a brutal conflict that has ravaged Sudan since 1983. The Lost Boys of Sudan focuses on four of these refugees. Theirs, however, is a typical story, one that repeated itself wherever the Lost Boys could be found across America.Jacob Magot, Peter Anyang, Daniel Khoch, and Marko Ayii were among 150 or so Lost Boys who were resettled in Atlanta. Like most of their fellow refugees, they had never before turned on a light switch, used a kitchen appliance, or ridden in a car or subway train―much less held a job or balanced a checkbook. We relive their early excitement and disorientation, their growing despondency over fruitless job searches, adjustments they faced upon finally entering the workforce, their experiences of post-9/11 xenophobia, and their undying dreams of acquiring an education.As we immerse ourselves in the Lost Boys’ daily lives, we also get to know the social services professionals and volunteers, celebrities, community leaders, and others who guided them―with occasional detours―toward self-sufficiency. Along the way author Mark Bixler looks closely at the ins and outs of U.S. refugee policy, the politics of international aid, the history of Sudan, and the radical Islamist underpinnings of its government. America is home to more foreign-born residents than ever before; the Lost Boys have repaid that gift in full through their example of unflagging resolve, hope, and faith.",
  "genres": [
    "Africa",
    "Nonfiction",
    "Sudan",
    "History",
    "War",
    "Biography",
    "Book Club"
  ],
  "author": "Mark Bixler",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/141582.The_Lost_Boys_of_Sudan"
}