{
  "title": "Under the Loving Care of the Fatherly Leader: North Korea and the Kim Dynasty",
  "description": "Under the Loving Care of the Fatherly Leader offers in-depth portraits of North Korea's two ruthless and bizarrely Orwellian leaders, Kim Il-Sung and Kim Jong-Il. Lifting North Korea's curtain of self-imposed isolation, this book will take readers inside a society, that to a Westerner, will appear to be from another planet. Subsisting on a diet short on food grains and long on lies, North Koreans have been indoctrinated from birth to follow unquestioningly a father-son team of megalomaniacs.To North Koreans, the Kims are more than just leaders. Kim Il-Sung is the country's leading novelist, philosopher, historian, educator, designer, literary critic, architect, general, farmer, and ping-pong trainer. Radios are made so they can only be tuned to the official state frequency. \"Newspapers\" are filled with endless columns of Kim speeches and propaganda. And instead of Christmas, North Koreans celebrate Kim's birthday--and he presents each child a present, just like Santa.The regime that the Kim Dynasty has built remains technically at war with the United States nearly a half century after the armistice that halted actual fighting in the Korean War. This fascinating and complete history takes full advantage of a great deal of source material that has only recently become available (some from archives in Moscow and Beijing), and brings the reader up to the tensions of the current day. For as this book will explain, North Korea appears more and more to be the greatest threat among the Axis of Evil countries--with some defector testimony warning that Kim Jong-Il has enough chemical weapons to wipe out the entire population of South Korea.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "Asia",
    "Biography",
    "Historical",
    "Dystopia"
  ],
  "author": "Bradley K. Martin",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/141655.Under_the_Loving_Care_of_the_Fatherly_Leader"
}