{
  "title": "Beyond Palomar",
  "description": "For the first half decade of Love and Rockets, Gilbert Hernandez focused on fleshing out his small Central American hamlet of Palomar. But eventually this became too restrictive for the kinds of stories he wanted to tell, and he created, in quick succession, two major standalone graphic novels. Beyond Palomar collects these two groundbreaking works, together for the first time.\"Poison River\" is a dizzying period piece often hailed as one of Hernandez's masterpieces. It traces the pre-Palomar childhood of Luba, her teenage marriage to gangster Peter Rio, the secrets behind her mysterious mother, all the way up to her subsequent escape and arrival in Palomar. This story introduces a number of characters and themes that occupied later issues of Love and Rockets (including Luba's mother Maria and her sinister guardian angel Gorgo), and is a riveting page-turner besides, with lots of sex, drugs, guns, politics, and women who can crack walnuts with their stomachs.\"Love and Rockets X,\" set in the early 1990s (in the waning years of Bush I's post-Reagan hangover, with Gulf War I in the background), takes us from plush Beverly Hills to the dangerous east side and introduces us to a dizzyingly diverse cast of characters, including a lowlife rock 'n' roll band, a \"posse\" of black youths, a ditzy Hollywood mom and her spoiled son, a gay activist filmmaker and his rebellious, half-Iraqi daughter, and a group of racist thugs whose violent attack on an older woman sets the plot in motion—as well as bringing in several older characters, including a couple of Palomar expatriates.Beyond Palomar is a wildly original diptych of graphic novels by one of the great cartooning talents of the last quarter century.",
  "genres": [
    "Comics",
    "Graphic Novels",
    "Fiction",
    "Graphic Novels Comics",
    "Sequential Art",
    "Comix",
    "Queer"
  ],
  "author": "Gilbert Hernández",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/1046551.Beyond_Palomar"
}