{
  "title": "ARROW",
  "description": "Saving lives is a deadly endeavor.When her plans to return a kidnapped child to his family are thwarted, royal detective Redwyn “Red” Deathan’s journey takes an unexpected path when she finds herself agreeing to assist Frilore’s monarchy in hunting down those responsible for poisoning their son. The prince has few days left to live, and not only must Red discover the cure and culprit, but she must also assist in dismantling a deadly trafficking ring—and neither culprit nor traffickers appreciate her interference.Ruid MacTíré is weary of war, but when it again knocks on his clan’s doorstep, he finds himself thrust into not only a captaincy he does not want, but also expected to take down one of his people’s greatest enemies. As pressure grows and the war threatens everyone he loves, Ruid finds himself not only fighting for his people, but for his heart as well.Maerin Rósach never wanted to fight, but war offers her no choice. Determined to help repel the evil her chieftain is determined to spread, she signs up to fight for her clan’s enemy. Despite the captain’s awkward, yet kind attempts to gain her friendship, Maerin resolves to remain aloof, for if anyone uncovers her secret, her life will be forfeited and her siblings will be taken away. Her heart, however, has different plans, and she soon finds herself softening toward the man who holds her life in his hands. As danger threatens countless lives and unknown enemies emerge at every turn, Red, Ruid, and Maerin must find a way to overcome evil schemes and increasing peril or risk losing everyone they hold dear. ARROW is an NA Christian fantasy fairy tale retelling.***The Redwyn Chronicles:Prequel: CROWNBook 1: IRONBook 1.5: KEYBook 2: ARROWBook 3: WOLF (Coming 2025)",
  "genres": [
    "Fantasy",
    "Fairy Tale Retellings",
    "Medieval",
    "Christian Fantasy",
    "Romance"
  ],
  "author": "Madisyn Carlin",
  "average_rating": "4.72",
  "url": "https://www.goodreads.com/book/show/141756640-arrow"
}