{
  "title": "Selected Stories of Philip K. Dick",
  "description": "Philip K. Dick was a master of science fiction, but he was also a writer whose work transcended genre to examine the nature of reality and what it means to be human. A writer of great complexity and subtle humor, his work belongs on the shelf of great twentieth-century literature, next to Kafka and Vonnegut. Collected here are twenty-one of Dick's most dazzling and resonant stories, which span his entire career and show a world-class writer working at the peak of his powers.In \"The Days of Perky Pat,\" people spend their time playing with dolls who manage to live an idyllic life no longer available to the Earth's real inhabitants. \"Adjustment Team\" looks at the fate of a man who by mistake has stepped out of his own time. In \"Autofac,\" one community must battle benign machines to take back control of their lives. And in \"I Hope I Shall Arrive Soon,\" we follow the story of one man whose very reality may be nothing more than a nightmare. The collection also includes such classic stories as \"The Minority Report,\" the basis for the Steven Spielberg movie, and \"We Can Remember It for You Wholesale,\" the basis for the film Total Recall. Selected Stories of Philip K. Dick is a magnificent distillation of one of American literature's most searching imaginations.» Introduction by Jonathan Lethem1. Beyond Lies the Wub (wikipedia)2. Roog (wikipedia)3. Paycheck (wikipedia, imdb)4. Second Variety (wikipedia, imdb)5. Imposter (wikipedia)6. The King of the Elves (wikipedia, imdb)7. Adjustment Team (wikipedia, imdb)8. Foster, You're Dead! (wikipedia)9. Upon the Dull Earth (wikipedia)10. Autofac (wikipedia)11. The Minority Report (wikipedia, imdb)12. The Days of Perky Pat (wikipedia)13. Precious Artifact14. A Game of Unchance15. We Can Remember It for You Wholesale (wikipedia, imdb)16. Faith of Our Fathers (wikipedia)17. The Electric Ant (wikipedia)18. A Little Something for Us Tempunauts (wikipedia)19. The Exit Door Leads In (wikipedia)20. Rautavaara's Case (wikipedia)21. I Hope I Shall Arrive Soon (wikipedia)",
  "genres": [
    "Science Fiction",
    "Short Stories",
    "Fiction",
    "Fantasy",
    "Classics",
    "Science Fiction Fantasy",
    "Speculative Fiction"
  ],
  "author": "Philip K. Dick",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/14180.Selected_Stories_of_Philip_K_Dick"
}