{
  "title": "Blues for a Black Cat and Other Stories",
  "description": "A cocky black cat that drinks cognac and can't stay out of holes, a hyperactive plumber who pulls out all the stops, an expiring jazzman who sells his sweat, a green soldier who moves into a terribly serious position - these are a few of the outrageous and poignant creations of Boris Vian in Blues for a Black Cat and Other Stories. Julia Older makes available for the first time in English this collection of his short fiction, which was originally published as Les Fourmis in 1949. It is a delightful introduction to the work of a much-admired French poet, playwright, and song-writer whose celebrity has continued to grow since his untimely death in 1959. These early stories, written in 1944 and 1945, reveal that Vian was already a master of black humor, wordplay, elegant understatement, and leaps of fancy. \"Blues for a Black Cat,\" bubbling with Vian's sense of mischief and evocative of his love for jazz, shows the seamier side of postwar Parisian night life. \"The Plumber\" is the nightmare of every citizen who has been incommoded by expensive repairmen. \"Pins and Needles\" conveys Vian's daring opposition to World War II (his song \"The Deserter\" later would be censored by the government for inciting sentiment against the French-Algerian conflict). The other stories - \"Cancer,\" \"Dead Fish,\" \"Journey to Khonostrov,\" \"Blue Fairy Tale,\" \"Fog,\" \"Good Students,\" and \"One-Way Street\" - are marked by the same verbal Niagaras, zany sexual encounters, and absurd situations. But, as Julia Older points out, parody only heightens the masked terrors of war, poverty, ill health, and unemployment that hound the bizarre protagonists of Vian's fablelike narratives.",
  "genres": [
    "Short Stories",
    "Fiction",
    "France",
    "French Literature",
    "Literature",
    "Classics",
    "Magical Realism"
  ],
  "author": "Boris Vian",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/141825.Blues_for_a_Black_Cat_and_Other_Stories"
}