{
  "title": "Second Sight: An Editor's Talks on Writing, Revising, and Publishing Books for Children and Young Adults",
  "description": "Whether you dream of writing a book for children or young adults, or you want to take a finished manuscript to the next level, it always helps to get a fresh point of view. Try a little Second Sight . In this collection of talks, a professional editor offers insights from the other side of the publishing desk on a wide range of writerly * Terrific first lines and how they got that way* What makes a strong picture book manuscript* Why the Harry Potter series was such a tremendous success* Finding the emotional heart of your story* Worksheets and checklists for building characters and bolstering plot* The Annotated Query Letter from Hell* And an Annotated Query Letter That Does It Right With its wit, intelligence, and practical tools for analyzing and revising your work, Second Sight will be a first resource for writers of children's and young adult fiction. If you're trying to decide between this book and Cheryl's later title, The Magic Writing Great Books for Children and Young Adults, , you should know that The Magic Words is a revised, focused, and improved version of Second Sight , and it focuses solely on middle-grade and young adult novels, walking authors through the writing process from the initial idea through deciding how to publish. Second Sight includes a talk on picture books as part of its cheerful hodgepodge of collected essays. Both of them can help you with your writing and offer insights into the publishing business, but if you're working on a novel, The Magic Words is probably the way to go. This book has not been endorsed or approved by J. K. Rowling or any of her publishers or representatives, and all thoughts expressed here on all matters, including the Harry Potter series, are solely Cheryl B. Klein's own, and should not be taken as the official opinions, intentions, or interpretations of any of the writers or publishers mentioned.",
  "genres": [
    "Writing",
    "Nonfiction",
    "Crafts",
    "Reference",
    "Books About Books",
    "Research",
    "Adult"
  ],
  "author": "Cheryl B. Klein",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/10465738-second-sight"
}