{
  "title": "The Collected Stories of Philip K. Dick 3: Second Variety",
  "description": "Many thousands of readers consider Philip K. Dick the greatest science fiction mind on any planet. Since his untimely death in 1982, interest in Dick's works has continued to mount and his reputation has been further enhanced by a growing body of critical attention. The Philip K. Dick Award is now given annually to a distinguished work of science fiction, and the Philip K. Dick Society is devoted to the study and promulgation of his works. This collection includes all of the writer's earliest short and medium-length fiction (including some previously unpublished stories) covering the years 1952-1955. These fascinating stories include Second Variety, Foster, You're Dead and The Father-Thing, and many others.\"A useful acquisition for any serious SF library or collection.\" -- Kirkus\"The collected stories of Philip K. Dick is awe inspiring.\" -- The Washington Post\"More than anyone else in the field, Mr. Dick really puts you inside people's minds.\" -- Wall Street JournalVolume 3/5. Includes stories from 1953-1959:- Fair Game- The Hanging Stranger- The Eyes Have It- The Golden Man- The Turning Wheel- The Last of the Masters- The Father-Thing- Strange Eden- Tony and the Beetles- Null-O- To Serve the Master- Exhibit Piece- The Crawlers- Sales Pitch- Shell Game- Upon the Dull Earth- Foster, You're Dead- Pay for the Printer- War Veteran- The Chromium Fence- Misadjustment- A World of Talent- Psi-Man Heal My Child!- Second VarietyOther editions of this volume are titled:- The Father-Thing,- Second Variety and Other Classic Stories [by Citadel],- Upon the Dull Earth,- Upon the Dull Earth and Other StoriesEditions published by Citadel include \"Second Variety\" into Volume 3, whereas other editions had it in Volume 2.",
  "genres": [
    "Science Fiction",
    "Short Stories",
    "Fiction",
    "American",
    "Science Fiction Fantasy",
    "Fantasy",
    "Anthologies"
  ],
  "author": "Philip K. Dick",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/14186.The_Collected_Stories_of_Philip_K_Dick_3"
}