{
  "title": "The Whole Foods Market Cookbook: A Guide to Natural Foods with 350 Recipes",
  "description": "Who else but Whole Foods Market could create a cookbook so fresh, so appealing, so full of valuable information, and so perfect for the way we are all cooking and eating today? Bursting with winning recipes, healthful cooking advice, cheerful guidance through the new language of natural foods, wine and cheese information, and a comprehensive glossary, this is a “thank goodness it’s here” kind of cookbook.The world’s largest natural and organic supermarket has created 350 contemporary recipes that are destined to become new classics. Whole Foods Market presents the most popular dishes from their prepared foods section, combined with brand-new recipes that showcase the wide variety of delicious ingredients available today. Far from “crunchy granola” fare, sophisticated recipes include Shrimp and Scallop Chalupas, Hazelnut Crusted Pork Loin, Thai-Style Green Curry Chicken, Griddled Sesame and Garlic Tofu with Wilted Bok Choy, Honey Jalapeño Barbecue Sauce, and Maple Butterscotch Macadamia Blondies. From meat and fish to tofu and vegetables, kid-friendly dishes to one-pot meals, the choices are dazzling, and with more than 200 of the recipes either vegetarian or vegan, the options are diverse.But the recipes are just the beginning. Steve Petusevsky and Whole Foods Market Team Members shed light on the confusing world of natural foods, presenting interesting, accessible information and all kinds of helpful cooking advice. The Whole Foods Market Cookbook is as welcoming and fun as a trip to one of their stores. Find out the answers to questions such How do I cook quinoa?What are the different kinds of tofu, and how do I know which to buy?How should I stock a great natural foods pantry?What are good alternatives to wheat pasta?What does “organic” mean?A glossary with more than 150 definitions provides a great reference for all of the terms and ingredients that have been edging their way into our vocabularies and kitchens. With recipe bonuses, tips from the team, variations, sidebars, and 30 menu suggestions, this is the natural foods guide that so many of us have been waiting for.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Nonfiction",
    "Food",
    "Reference"
  ],
  "author": "Steven Petusevsky",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/10466.The_Whole_Foods_Market_Cookbook"
}