{
  "title": "The Best American Short Stories 2002",
  "description": "Since its inception in 1915, the Best American series has become the premier annual showcase for the country's finest short fiction and nonfiction. For each volume, a series editor reads pieces from hundreds of periodicals, then selects between fifty and a hundred outstanding works. That selection is pared down to the twenty or so very best pieces by a guest editor who is widely recognized as a leading writer in his or her field. This unique system has helped make the Best American series the most respected -- and most popular -- of its kind.This year's Best American Short Stories features a rich mix of voices, from both intriguing new writers and established masters of the form like Michael Chabon, Edwidge Danticat, Richard Ford, Jhumpa Lahiri, and Arthur Miller. The 2002 collection includes stories about everything from illicit love affairs to family, the immigrant experience and badly behaved children -- stories varied in subject but unified in their power and humanity. In the words of this year's guest editor, the best-selling author Sue Miller, \"The American short story today [is] healthy and strong . . . These stories arrived in the nick of time . . . to teach me once more what we read fiction for.\"Foreword --Introduction / Sue Miller --Along the frontage road / Michael Chabon --The sugar-tit / Carolyn Cooke --The red ant house / Ann Cummins --Seven / Edwidge Danticat --A house on the plains / E.L. Doctorow --Puppy / Richard Ford --The heifer / Melissa Hardy --Zilkowski's theorem / Karl Iagnemma --Nobody's business / Jhumpa Lahiri --Digging / Beth Lordan --In case we're separated / Alice Mattison --Billy goats / Jill McCorkle --Watermelon days / Tom McNeal --Nachman from Los Angeles / Leonard Michaels --Bulldog / Arthur Miller --The rug / Meg Mullins --Family furnishings / Alice Munro --Surrounded by sleep / Akhil Sharma --Love and hydrogen / Jim Shepard --Aftermath / Mary Yukari Waters --Contributor's notes --100 other distinguished stories of 2001 --Editorial addresses of American and Canadian magazines publishing short stories",
  "genres": [
    "Short Stories",
    "Fiction",
    "Anthologies",
    "Collections",
    "Literature",
    "Short Story Collection",
    "Contemporary"
  ],
  "author": "Sue Miller",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/141940.The_Best_American_Short_Stories_2002"
}