{
  "title": "The Selected Journals Of L.M. Montgomery, Vol. 3: 1921-1929",
  "description": "Lucy Maud Montgomery (1874-1942), the author of the classic novel for children, Anne of Green Gables , kept extensive journals for most of her life, beginning them in 1889 when she was fourteen and continuing them until shortly before her death. An instant bestseller in Canada, the firstvolume of The Selected Journals of L.M. Montgomery covers the years up to 1910 and culminates in the publication of Anne of Green Gables . The second volume (1910-1921) portrays Montgomery in the midst of great upheaval, both in her life and in the world around her. Now, the long-awaited thirdvolume brings us through her middle years, a time when Montgomery's personal and professional lives are becoming even more complex.Ranging from 1921-1929, this revealing journal documents her efforts to juggle the demands of motherhood, parish obligations, indifferent household help, grief at the loss of older friends and family--everyday struggles to balance a woman's social and domestic duties. Here she writes of thetriumphs and trials of being a best-selling growing fame; the successful midwifery of her new heroines Emily and Marigold and a more adult novel, The Blue Castle ; the struggle to allocate time for correspondence with publishers, fans, friends--and to actually write. We trace the happyconclusion of her lawsuits against an unscrupulous publisher and the disappointing outcome of a lawsuit arising in a minor automobile accident. And we learn of her personal Ewan Macdonalds's envy of his wife's publishing and social success; the dark shadow cast by his attacks ofmelancholia; and her fear that her sons might evince similar tendencies.In these years, Lucy Maud Montgomery turned more and more to her journals to record her insights, opinions, and epiphanies. These journals will not only intrigue every fan of Anne of Green Gables and the other Anne books, but will also provide an intimate look at life as portrayed by thisremarkable writer.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Canada",
    "Journal",
    "Classics",
    "Biography Memoir",
    "Memoir"
  ],
  "author": "L.M. Montgomery",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/1420779.The_Selected_Journals_Of_L_M_Montgomery_Vol_3"
}