{
  "title": "\"My Dad Loves Me, My Dad Has a Disease\" A Child's View: Living with Addiction",
  "description": "The basic premise of this book is that chemical dependency is a disease; the alcoholic/addict is a sick person not a bad person. This disease affects not only the addicted person but those who love that person as well. This is a book that will help others affected by chemical dependency to become well. My Dad Loves Me My Dad Has A Disease was originally written as a result of Claudia Black's work with young people who had a parent in treatment for their alcoholism. These children were learning at a very young age that it was not safe for them to openly talk about their family experiences. Art therapy was a wonderful medium for them to find the words and a voice in which to talk honestly. It was also a wonderful tool in which to not only share feelings but to problem solve, lessen denial, and to put words to that which was so confusing. The original pictures were all drawn and the stories written by children age five through fourteen that had one or two alcoholic parents. After many years and thousands of children using this workbook, it has been revised to address the fact that today, if a child lives with addiction, it may not be alcohol addiction. The family member may be addicted to other drugs as well. Words have been rewritten, some pictures changed and new pictures added making it possible for more children of addiction to experience their own recovery process. Many years ago when Claudia Black was a counselor in an alcohol and drug treatment program, she asked a six-year-old daughter of a man in treatment for his addiction if she knew why her father was in this program. The girl paused and with confidence said, My Dad Loves Me, but My Dad Has a Disease. In spite of her father's addiction she knew her father loved her. That is a message Claudia would like all young people to be able to believe. Unfortunately when people are addicted they often lose the ability to act in loving ways toward those they love.Growing up in an addicted family usually means living by the it is not all right to talk about the drinking or using in your family. Having been raised in an alcoholic family herself, by the age of six Claudia shared the feelings of loneliness, fear and frustration of her family. Working through the loneliness, fear and frustration by expressing feelings is what this book is all about. This workbook gives children age 5 - 12 the opportunity to share their thoughts and feelings and to better understand addiction. Although this workbook was designed for and the illustrations created by young children, it may also hold insights for the now adult age person raised in an addictive home.",
  "genres": [
    "Nonfiction",
    "Psychology"
  ],
  "author": "Claudia Black",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/142112._My_Dad_Loves_Me_My_Dad_Has_a_Disease_A_Child_s_View"
}