{
  "title": "The Heart of Islam: Enduring Values for Humanity",
  "description": "As the specter of religious extremism has become a fact of life today, the temptation is great to allow the evil actions and perspectives of a minority to represent an entire tradition. In the case of Islam, there has been much recent confusion in the Western world centered on distorted portrayals of its core values. Born of ignorance, such confusion feeds the very problem at hand.In The Heart of Islam one of the great intellectual figures in Islamic history offers a timely presentation of the core spiritual and social values of Islam: peace, compassion, social justice, and respect for the other. Seizing this unique moment in history to reflect on the essence of his tradition, Seyyed Hossein Nasr seeks to \"open a spiritual and intellectual space for mutual understanding.\" Exploring Islamic values in scripture, traditional sources, and history, he also shows their clear counterparts in the Jewish and Christian traditions, revealing the common ground of the Abrahamic faiths.Nasr challenges members of the world's civilizations to stop demonizing others while identifying themselves with pure goodness and to turn instead to a deeper understanding of those shared values that can solve the acute problems facing humanity today. \"Muslims must ask themselves what went wrong within their own societies,\" he writes, \"but the West must also pose the same question about itself . . . whether we are Muslims, Jews, Christians, or even secularists, whether we live in the Islamic world or in the West, we are in need of meaning in our lives, of ethical norms to guide our actions, of a vision that would allow us to live at peace with each other and with the rest of God's creation.\" Such help, he believes, lies at the heart of every religion and can lead the followers of the Abrahamic religions (Judaism, Christianity, and Islam) as well as other religious and spiritual traditions to a new future of mutual respect and common global purpose.The Heart of Islam is a landmark presentation of enduring value that offers hope to humanity, and a compelling portrait of the beauty and appeal of the faith of 1.2 billion people.",
  "genres": [
    "Islam",
    "Religion",
    "Philosophy",
    "History",
    "Nonfiction",
    "Spirituality",
    "Faith"
  ],
  "author": "Seyyed Hossein Nasr",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/142124.The_Heart_of_Islam"
}