{
  "title": "Home-Alone America: The Hidden Toll of Day Care, Behavioral Drugs, and Other Parent Substitutes",
  "description": "Why are there so many troubled kids these days, diagnosed with learning disabilities or behavioral problems? Why is child obesity out of control? Why are teenagers contracting herpes and other sexually transmitted diseases at unprecedented rates?  In Home-Alone America, scholar Mary Eberstadt offers an answer that’s widely suspected but too politically incorrect to say out loud. A few decades ago, most children came home from school to a mother who monitored their diets, prevented sexual activity or delinquency by her mere presence, and provided a basic emotional safety net. Most children also lived with their biological father.  But today, most mothers work outside the home, and many fathers are divorced and living far away because society promotes adult fulfillment at the expense of our children. Too many kids now feel like just another chore to be juggled—dropped off at day care; handed over to a nanny; left in front of a television or a computer; and often simply home alone, with easy access to all kinds of trouble.  Eberstadt offers hard data proving that absent parents are the common denominator of many recent epidemics, including obesity, STDs, mental health problems of all kinds, and the increased use of psychiatric medication by even very young children. Drawing on a wide range of medical and social science literature as well as popular culture, she reopens the forbidden question of just how much children need their parents—especially their mothers. Home-Alone America issues a radical challenge to the way America’s kids are being raised. Like The Bell Curve or The Nurture Assumption, it’s a controversial book that many will disagree with, but no one can ignore.",
  "genres": [
    "Parenting",
    "Nonfiction",
    "Politics",
    "Sociology",
    "Psychology",
    "Cultural",
    "Family"
  ],
  "author": "Mary Eberstadt",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/142225.Home_Alone_America"
}