{
  "title": "A journey in the seaboard slave states: with remarks on their economy.",
  "description": "Title: A journey in the seaboard slave states: with remarks on their economy.Author: Frederick Law OlmstedPublisher: Gale, Sabin Americana Description: Based on Joseph Sabin's famed bibliography, Bibliotheca Americana, Sabin Americana, 1500--1926 contains a collection of books, pamphlets, serials and other works about the Americas, from the time of their discovery to the early 1900s. Sabin Americana is rich in original accounts of discovery and exploration, pioneering and westward expansion, the U.S. Civil War and other military actions, Native Americans, slavery and abolition, religious history and more.Sabin Americana offers an up-close perspective on life in the western hemisphere, encompassing the arrival of the Europeans on the shores of North America in the late 15th century to the first decades of the 20th century. Covering a span of over 400 years in North, Central and South America as well as the Caribbean, this collection highlights the society, politics, religious beliefs, culture, contemporary opinions and momentous events of the time. It provides access to documents from an assortment of genres, sermons, political tracts, newspapers, books, pamphlets, maps, legislation, literature and more.Now for the first time, these high-quality digital scans of original works are available via print-on-demand, making them readily accessible to libraries, students, independent scholars, and readers of all ages.++++The below data was compiled from various identification fields in the bibliographic record of this title. This data is provided as an additional tool in helping to insure edition identification: ++++SourceLibrary: Huntington LibraryDocumentID: SABCP02510400CollectionID: CTRG98-B1367PublicationDate: 18560101SourceBibCitation: Selected Americana from Sabin's Dictionary of books relating to AmericaNotes: Publisher's advertising material included in pagination. \"In the year 1853, the author of this work made a journey through the Seaboard Slave States, and gave an account of his observations in the 'New York Daily Times, ' under the signature of 'Yeoman.' Those letters excited some attention, and their publication in a book was announced; but, before preparing them for the press, the author had occasion to make a second and longer visit to the South. In the light of the experience then gathered, the letters have been revised, and, with much additional matter, are now presented to the public.\"--P. [vii]Collation: xv, 723, iv p.: ill.; 19 cm",
  "genres": [
    "History",
    "Nonfiction",
    "American",
    "American History"
  ],
  "author": "Frederick Law Olmsted",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/14227500-a-journey-in-the-seaboard-slave-states"
}