{
  "title": "Runaway Slaves: Rebels on the Plantation",
  "description": "From John Hope Franklin, America's foremost African American historian, comes this groundbreaking analysis of slave resistance and escape. A sweeping panorama of plantation life before the Civil War, this book reveals that slaves frequently rebelled against their masters and ran away from their plantations whenever they could.For generations, important aspects about slave life on the plantations of the American South have remained shrouded. Historians thought, for instance, that slaves were generally pliant and resigned to their roles as human chattel, and that racial violence on the plantation was an aberration. In this precedent setting book, John Hope Franklin and Loren Schweninger demonstrate that, contrary to popular belief, significant numbers of slaves did in fact frequently rebel against their masters and struggled to attain their freedom. By surveying a wealth of documents, such as planters' records, petitions to county courts and state legislatures, and local newspapers, this book shows how slaves resisted, when, where, and how they escaped, where they fled to, how long they remained in hiding, and how they survived away from the plantation. Of equal importance, it examines the reactions of the white slaveholding class, revealing how they marshaled considerable effort to prevent runaways,meted out severe punishments, and established patrols to hunt down escaped slaves.Reflecting a lifetime of thought by our leading authority in African American history, this book provides the key to truly understanding the relationship between slaveholders and the runaways who challenged the system--illuminating as never before the true nature of the South's \"most peculiar institution.\"",
  "genres": [
    "History",
    "American History",
    "Nonfiction",
    "Race",
    "African American",
    "Social Justice",
    "Civil War"
  ],
  "author": "John Hope Franklin",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/1046676.Runaway_Slaves"
}