{
  "title": "My Heart Laid Bare",
  "description": "Mythic in scope, ballad-like in the telling, this strikingly original historical novel represents a fresh and exciting achievement for an American masterThrough a layering of historical events beginning in Colonial times and ending in the 1930s, Joyce Carol Oates has created a new American epic in this sweeping chronicle of the fortunes and misfortunes of a family of enterprising and ingenious confidence artists.\"Honor is the subject of my story/for God is theirs; and the Game, ours\". So writes the infamous 19th century con man Abraham Licht in his memoir, My Heart Laid Bare, detailing his personal philosophy and his elaborate, highly profitable deceptions. Like a biblical patriarch, Abraham sees his eternity in his children: Thurston and Harwood, the sons who in emulating their father are led to murder; beautiful Millicent, easily her father's equal in the confidence game, but defying his absolute control; Elisha, the adopted son who is Abraham's true heir in talent and ambition -- banished from his father's affections, Elisha will strike out on his own to become a controversial Black leader in the 1920s.In 1891, Abraham establishes his clan on the marshy grounds of a deconsecrated church in rural New York. Old Muirkirk is the site of a lost colony of Dutch settlers who vanished into the swamp without a trace in the 1640s. More than a century later, a notorious outlaw and suspected murderess, alias \"Sarah Licht\", was run to ground and executed in the very place where Abraham now tutors his children on how to avoid a similar fate.As the moral consequences of crimes and transgressions resonate through the centuries, Joyce Carol Oates constructs a wholly original andcompelling new concept of American history -- and in the process creates her finest work to date.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Gothic",
    "Literary Fiction",
    "Historical",
    "Literature",
    "Mystery"
  ],
  "author": "Joyce Carol Oates",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/1425431.My_Heart_Laid_Bare"
}