{
  "title": "Black Projects, White Knights: The Company Dossiers",
  "description": "Is it possible to interfere with history in a moral way, especially if profit is the primary motivation for doing so? Is it possible to sustain any ethical standards at all when handed what amounts to unlimited power? These and other shadowy questions are raised in this book, the unofficial history of Dr Zeus, Inc -- known to its employees simply as the Company. This collection brings together the early Company stories in one volume for the first time. Also included are new stories, three previously unpublished, and one, 'The Queen in Yellow' written exclusively for this book.Science-fiction fans will follow the secret activities of the Company's field agents -- once human, now centuries-old time-travelling immortal cyborgs: Botanist Mendoza's search for the rare hallucinogenic Black Elysium grape in 1844 Spanish-held Santa Barbara, California; Facilitator Joseph's dreamlike solicitation of the ailing Robert Louis Stevenson in 1879; Marine Salvage Specialist Kalugin's recovering of an invaluable Eugene Delacroix painting from a sunken yacht off the coast of Los Angeles in 1894; and Literature Preservationist Lewis's retrieval of priceless literary artefacts, in 1914 Egypt, from the mummy case of Princess Sit-Hathor-Yunet.Contents:Introduction: The Hounds of Zeus: A brief introduction to the world of The Company.Noble Mold: Mendoza and Joseph attempt to secure a special plant from a Native American family living in 19th century Mission California.Smart Alec: On the origins of the mysteriously talented Alec Checkerfield.Facts Relating to the Arrest of Dr. Kalugin: Vasilii Kalugin has a bad week in the company of a very old Company operative.Old Flat Top: A young Cro-Magnon learns some facts about how his valley came to be settled from the Enforcer Joshua.The Dust Enclosed Here: A simulacrum of William Shakespeare encounters Alec Checkerfield and comes out of the experience changed.The Literary Agent: Robert Louis Stevenson hallucinates a strangely contemporary encounter with a Mephistophelean figure who helps him rediscover his inspiration.Lemuria Will Rise: Mendoza encounters an eccentric hermit in 19th century Pismo Beach.The Wreck of the Gladstone: Victor and Kalugin have to recover Company property from a wreck off the coast of Los Angeles without damaging the local mortals too badly.Monster Story: Young Alec Checkerfield goes to take his exams.Hanuman: Mendoza gets hit on by an augmented australopithecine with a story to tell about his tragic upbringing.Studio Dick Drowns Near Malibu: Joseph goes to shed one mortal identity and assume a new one, but first he has to resolve a complication.The Likely Lad: Alec Checkerfield and his amoral pet artificial intelligence take to the high seas.The Queen in Yellow: Literature Preservation Specialist Lewis is given a job on a dig in Egypt for which he is poorly suited.The Hotel at Harlan's Landing: A storm on the coast of California during the Great Depression where Company secrets are revealed, and more questions posed.",
  "genres": [
    "Science Fiction",
    "Time Travel",
    "Short Stories",
    "Fiction",
    "Fantasy",
    "Historical",
    "Adventure"
  ],
  "author": "Kage Baker",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/1425442.Black_Projects_White_Knights"
}