{
  "title": "Lost Boy",
  "description": "FallonBeing alone is nothing new. I’ve been abandoned by everyone. Now, I have absolutely no one. I might even prefer it that way. All I really need is a guitar and my thoughts.Just shy of my eighteenth birthday, I’m forced to move across the country to live with my uncle in California. He’s the head basketball coach at Acadia Lake Prep, the new private academy I’m attending. Ryder Cruz is his star player.He makes me question things about myself and what I want. Things I’ve never once considered. The oversized and enthusiastic jock is always around, insisting I smile and laugh with him. But it won’t work. It can’t. The painful memories and regret I carry are too strong. I’m not sure I’ll ever feel again.RyderBasketball is great. So are my friends. Dad. My little sister Sofie. I’m team captain, and I’m taking us to State.It’s easy to forget that nothing is ever as it seems. I fight my demons with smiles and awkward jokes, but things are starting to pile up. Pranks between my guys and the rival public school, issues with my mother, and a secret I can’t tell anyone. A truth that holds me in its grasp. I can’t risk the team or my college acceptance—my future . Can’t risk my dream.I’m gay. And no one can know.It wasn’t as hard to keep this close to my chest until Fallon Rivers showed up with his big, sad eyes and bright blue hair. I’m not sure I can continue hiding who I am. I need this boy to smile. To talk to me. I need to spark some life back into his soul.He doesn’t realize my dad and his uncle are partners, but he’ll find out soon enough. Sleepovers happen almost every weekend. And now that he’s here and staying for good, I guess he’ll just have to get used to my presence. Because I’m determined to make him feel again and maybe even free myself along the way.Lost Boy is a 90,000-word friends-to-lovers gay romance. It is book three in The Loyal Boys Series, a collection of standalone contemporary M/M romances. You can expect opposites attract, forced proximity, hurt/comfort, steamy first times, and a supportive found family. This novel is intended for 18+ readers and contains explicit scenes, mild violence, language, and bullying from outside sources. See Author’s Note for a full list of Content Warnings.",
  "genres": [
    "M M Romance",
    "Romance",
    "High School",
    "Friends To Lovers",
    "Sports",
    "Forced Proximity",
    "Contemporary"
  ],
  "author": "Charli Meadows",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/142561768-lost-boy"
}