{
  "title": "Thornton Brothers:  The Trilogy",
  "description": "Lose yourself in the stories of three lusciously dominant, but wonderfully caring brothers – A.J., Beau, and Cade Thornton. Opinionated and stubborn to the core – all of them – but if there’s one thing they can all agree on, it’s that their women need more than the occasional firm hand applied to their nicely rounded derrieres.Book 1: Thornton's HopeHope Granger was right- there was never anything good about a phone call that wakes you up in the middle of the night, but this one struck stark terror into the deepest realms of her heart, despite the fact that it wasn’t all that A.J. Thornton wasn’t doing well, and she was the cavalry. The only person on this green Earth that might – just might – be able to snap him out of the deep blue funk his recent disability had caused. Although she immediately agreed to fly down to Texas to help him, Hope wasn’t at all sure she’d be able to – especially not without laying her own heart – and bottom – on the line again.Book 2: Thornton's DesireBeau Thornton was going to die – especially if his larger than life, over-protective brothers continued to coddle him like a baby instead of expecting him to do as much for himself as he could. But that wasn’t what Beau Thornton wanted to hear from that little slip of a woman, Heather Dennison, even if she did think she was God’s gift to physical therapy. And darned if she didn’t get under his skin like no other woman ever had. She was strong – going toe to toe with him on more than one occasion about his older brother’s care, but still, she was a skittish thing at times – like when he pulled her close for a kiss, or took her over his lap for a long overdue spanking..Book 3: Thornton's WishSomebody was siphoning funds from the XL-17 project – and Cade Thornton was more than dismayed to find out that every bit of evidence pointed to his fiancé. The love of his life – the woman who held every part of him in her small, capable hands. He couldn’t believe it – especially when she ran from him once he’d confronted her about the situation. How much more damning could her behavior be? Gabby Andolini had never been so hurt in her life – how could he possible think that of her? Didn’t he know her better than that? But when there came a wrapping at the door of the hotel she’d escaped to on the shores of Maine, she knew exactly who it was that had come calling.Cade had come to reclaim what was his.",
  "genres": [
    "Erotica",
    "Romance",
    "BDSM"
  ],
  "author": "Carolyn Faulkner",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/10467739-thornton-brothers"
}