{
  "title": "English Passengers",
  "description": "Christopher Columbus was looking for a passage to India when he ran full-tilt into the Americas. One of the narrators of Matthew Kneale's ambitious historical novel English Passengers has more modest aspirations: Captain Illiam Quillian Kewley wants only to smuggle a little tobacco, brandy and French pornography from the Isle of Mann to a secluded beach in England. Yet somehow in the process he and his crew end up weighing anchor for Australia. Worse, they are forced to carry three temperamental Englishmen bound for Tasmania on a mission to discover the exact location of the Garden of Eden. The year is 1857, and the study of geology is beginning to make serious inroads into areas of religious doctrine; when the Reverend Geoffrey Wilson runs across a scientific treatise that puts the age of Silurian Limestone somewhere in the neighbourhood of 100,000 years, he is scandalised: \"This was despite the fact that the Bible tells, and with great clarity, that the earth was created a mere six thousand years ago\". His many attempts to prove the Bible's accuracy lead, eventually, to a scientific expedition comprising himself, Timothy Renshaw, a dilettante botanist, and Dr Thomas Potter.Now jump back 30 years, to 1828, when a revolution of sorts is stirring on the island of Tasmania. Over the years white settlers have been encroaching on aboriginal land and relations have deteriorated into violence. At the heart of the action is Peevay, a young man abandoned by his aborigine mother, who had been kidnapped and raped by a white escaped convict. Now his vengeful mother is leading a war against the whites, and Peevay, desperate to win her love, has joined her. Chapters from the past narrated by Peevay and augmented by letters and dispatches from white settlers alternate with the sections told by Kewley, Wilson, Renshaw and Potter. Eventually, of course, the two timelines intersect with momentous results.War, mutiny, shipwreck and not a little farce make English Passengers a gripping read, but it is Matthew Kneale's literary ventriloquism that renders it remarkable. In a novel with so many different points of view, the individuality of each voice stands out. There is, for instance, the mutinous Dr Potter, whose descent into paranoia and egomania results in diary entries reminiscent of a 19th-century psychotic Bridget Jones: \"Manxmen = treacherous even to v. last. Self heard Brew (lashed to mainmast as per usual) instructing helmsman to steer N.N.W. when self questioned he re. this he claiming we = carried into Bay of Biscay by difficult sea currents + must set course to avoid Breton Peninsular. He pointing to distant point of land to N.N.E. claiming this = Brittany. Self = doubtful\".Perhaps the most compelling voice in English Passengers belongs to Peevay, who paints a vivid picture of aboriginal life in a foreign tongue he nonetheless makes his own:When we sat so in the dark, after our eating, Tartoyen told us stories--secret stories that I will not say even now--about the moon and sun, and how everyone got made, from men and wallaby to seal and kangaroo rat and so. Also he told who was in those rocks and mountains and stars, and how they went there. Until, by and by, I could hear stories as we walked across the world, and divine how it got so, till I knew the world as if he was some family fellow of mine.By the close of this epic tale, the world Peevay knew has gone forever, and the lives of the Manx sailors and English passengers have been irrevocably changed. Based on real events in Tasmanian history, Matthew Kneale's novel delivers a home truth about Australia's brutal colonial past, even as it conveys the wonder and allure of the age of exploration. --Alix Wilber",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Australia",
    "Historical",
    "Travel",
    "Adventure",
    "Book Club"
  ],
  "author": "Matthew Kneale",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/14259.English_Passengers"
}