{
  "title": "Captors and Captives: The 1704 French and Indian Raid on Deerfield",
  "description": "The definitive account of a pivotal episode in colonial American history On February 29, 1704, a party of French and Indian raiders descended on the Massachusetts village of Deerfield, killing fifty residents and capturing more than a hundred others. In this masterful work of history, Evan Haefeli and Kevin Sweeney reexamine the Deerfield attack and place it within a framework stretching from the Atlantic Ocean to the Great Lakes. Drawing on previously untapped sources, they show how the assault grew out of the aspirations of New England family farmers, the ambitions of Canadian colonists, the calculations of French officials, the fears of Abenaki warriors, and the grief of Mohawk women as they all struggled to survive the ongoing confrontation of empires and cultures. Haefeli and Sweeney reconstruct events from multiple points of view, through the stories of a variety of individuals involved. These stories begin in the Native, French, and English communities of the colonial Northeast, then converge in the February 29 raid, as a force of more than two hundred Frenchmen, Abenakis, Hurons, Kahnawake Mohawks, Pennacooks, and Iroquois of the Mountain overran the northwesternmost village of the New England frontier. Although the inhabitants put up more of a fight than earlier accounts of the so-called Deerfield Massacre have suggested, the attackers took 112 men, women, and children captive. The book follows the raiders and their prisoners on the harsh three-hundred-mile trek back to Canada and into French and Native communities. Along the way the authors examine how captives and captors negotiated cultural boundaries and responded to the claims of competing faiths and empires—all against a backdrop of continuing warfare. By giving equal weight to all participants, Haefeli and Sweeney range across the fields of social, political, literary, religious, and military history, and reveal connections between cultures and histories usually seen as separate.",
  "genres": [
    "History",
    "18th Century",
    "American History"
  ],
  "author": "Evan Haefeli",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/1426836.Captors_and_Captives"
}