{
  "title": "The Shaping of America: A People's History of the Young Republic",
  "description": "The 2nd offering in Smith's People's History, this volume, like its predecessor, earns its title by being accessible to the general reader rather than by demagoguery. In telling the story of the 1st half-century of the Republic Smith does include Shays Whiskey Rebellions & looks into the conditions of women & slaves, as well as the \"lower orders\"; but he integrates these concerns into a complete historical panorama (unlike Howard Zinn's recent A People's History of the United States). Overall, he organizes the period from 1776 to 1826 around an American \"schizophrenia\" represented by two different views of people & government: on the one hand, the \"Classical-Christian\" view (represented by the Federalists) of the sinfulness & limitations of humanity; on the other, the \"Secular-Democratic\" belief (held by the Democratic-Republicans) in the perfectability & genuine equality of mortals. The 1st view is realized in the Constitution, according to Smith, & is spelled out in the Federalist Papers, while the 2nd inspired the Declaration & later became the ideology atop an essentially Classical-Christian polity. The election of 1800's defeat of the Federalists is the turning-point in the account, really marking a watershed between the two views. He uses the occasion to break his narrative with chapters on cities & the countryside, the family, religion, medicine, art, education, the west & the south, before resuming with the Presidency of Jefferson. Arguing that the period was one of growing rationalization in religion & mores, he describes \"our schizophrenia: we were to become the most powerful capitalist industrial power in the world under the banner of Jeffersonian agrarian democracy.\" The opposition here, then, is basically the familiar one between Jefferson & Adams-Hamilton, & Smith's preference is clearly for the latter pair. But even if his division is overly schematic, he manages to incorporate all the major events of the 1st half-century, from Independence to Andrew Jackson, with a social-historian's eye for the everyday, & that makes this a very valuable contribution to our historical self-understanding.--Kirkus (edited)",
  "genres": [
    "History",
    "American History",
    "Nonfiction"
  ],
  "author": "Page Smith",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/1426802.The_Shaping_of_America"
}