{
  "title": "Complete Poems",
  "description": "When she died in poverty at 31, Edith Edith Södergran had been dismissed as a mad, megalomaniac aristocrat by most of her Finnish contemporaries. Today she is regarded as Finland's greatest modern poet. Her poems - written in Swedish - are intensely visionary, and have been compared with Rimbaud's, yet they also show deep afﬁnities with Russian poetry, with the work of Blok, Mayakovsky and Severyanin in particular.Born in 1892 of a Finno-Swedish family, Edith Edith Södergran grew up in Raivola, a village on the Russian border, but was educated at a German school in St. Petersburg. Her early influences were Goethe and Heine, and she wrote first in German. The driving force of Edith Södergran's mature Swedish poetry was her struggle against TB, which she contracted in 1908. For much of her short life she was a semi-invalid in sanatoria in Finland and Switzerland. Her last years were spent amid the turmoil of the Russian Revolution and in desperate poverty in Raivola, where she died in 1923.Edith Edith Södergran saw herself as an inspired free spirit of a new order, a disciple on her own terms of Nietzsche, then of the nature mystic Rudolf Steiner, and finally of Christ. But her voice is subtle and wholly original. It transcends the limits imposed by her illness to make lyrical statements about the violence and darkness of the modern world - imagistic poems that are alarming in the surreal beauty of their fragmentary diction. David McDuff's edition is the first complete translation into English of Edith Edith Södergran's Swedish poetry. His versions adhere as closely as possible to the spirit and the letter of the Swedish original. In his introductory essay David McDuff gives a comprehensive and illuminating account of Edith Edith Södergran's life and work.",
  "genres": [
    "Poetry",
    "Classics",
    "Swedish Literature",
    "Finnish Literature",
    "20th Century",
    "Scandinavian Literature",
    "Sweden"
  ],
  "author": "Edith Södergran",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/1427974.Complete_Poems"
}