{
  "title": "Major: A Black Athlete, a White Era, and the Fight to Be the World's Fastest Human Being",
  "description": "At the turn of the 20th century, hundreds of handsome, lightning-fast racers won the hearts and minds of a bicycling-crazed public. Scientists studied them, newspapers glorified them, and millions of dollars in purse money was awarded to them. Major Taylor aimed to be the fastest of them all. A prominent black man at a time when such a thing was deemed scandalous, his mounting victories, high moral virtue, and bulletlike riding style made him a target for ridicule from the press and sabotage by the white riders who shared the track with him.Taylor’s most formidable and ruthless opponent—a man nicknamed the “Human Engine”—was Floyd McFarland. One man was white, one black; one from a storied Virginia family, the other descended from Kentucky slaves; one celebrated as a hero, one trying to secure his spot in a sport he dominated. The only thing they had in common was the desire to be named the fastest man alive. Their rivalry riveted first America, and then the world. Finally, in 1904, both men headed to Australia for a much-anticipated title match to decide, beyond dispute, who would claim the coveted title.Major is the gripping story of a superstar nobody saw coming—a classic underdog, aided by an unlikely crew: a disgraced fight promoter, a broken ex-racer, and a poor upstate girl from New York who wanted to be a queen. It is also the account of a fierce rivalry that would become an archetypal tale of white versus black in the 20th century. Most of all, it is the tale of our nation’s first black sports celebrity—a man who transcended the handicaps of race at the turn of the century to reach the stratosphere of fame.From the Hardcover edition.",
  "genres": [
    "Sports",
    "Cycling",
    "Biography",
    "History",
    "Nonfiction",
    "African American",
    "Race"
  ],
  "author": "Todd Balf",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/1428136.Major"
}