{
  "title": "Madhur Jaffrey's World-of-the-East Vegetarian Cooking: A Cookbook",
  "description": "From the “queen of Indian cooking\" ( Saveur ), an encyclopedic vegetarian cookbook, with more than 400 recipes from across Asia and the Middle East. In this magnificent collection of meatless recipes, Madhur Jaffrey, the beloved author of An Invitation to Indian Cooking , has not only tapped the rich culinary heritage of India, where the majority of the population has been vegetarian for thousands of years, but from all across Asia and the Middle East. From a seaside villa in Balli, a Buddhist temple in South Korea, street bazaars in Kuwait, and a 300-year-old inn in Kyoto to the noodle shops of Bangkok and her own mother’s kitchen in Delhi, these are the global flavors of vegetable-forward cooking. Among the marvelous • Carrots Cooked in Dashi• Very Spicy, Delicious Chickpeas• Datémaki (Japanese rolled omelette)• Bindaetuk (Mung bean pancakes)• Tomatoes Cooked in the Bengali Style• Sweet Rice with Orange Rind• Cold, Summer Noodles• Banana Pooris• Zucchini Halwa As well as directions on how to make myriad pickles; how to create the rich vegetable stock vital to a good soup; and how to cook to perfection all sorts of rices and grains. The vegetable section alone contains more than 120 recipes for everything from Cauliflower and Potatoes Cooked with Fenugreek and Fennel Seeds, Collard Greens, and Sweet-and-Sour Eggplant to Green Beans with Fresh Coconut and Sesame Seeds. Step by illustrated step, Madhur shows how to extract soy-bean milk; how to make bean curd and bean sprouts; and how to make yogurt, fresh cheeses, and wheat gluten (all rich in protein). Richly illustrated with charming—and instructive—drawings, this comprehensive cookbook will change the way you think about vegetarian cooking.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction",
    "Reference",
    "Vegetarian",
    "Culinary"
  ],
  "author": "Madhur Jaffrey",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/142850.Madhur_Jaffrey_s_World_of_the_East_Vegetarian_Cooking"
}