{
  "title": "Boundless Sea",
  "description": "An underwater kingdom. A missing queen. A modern man plunged into an ancient war...Trevain Murphy's new wife has been forcibly taken. He must do all he can to search for her without falling apart. To complicate matters, his love was Queen Aazuria, ruler of the undersea kingdom of Adlivun, and he has been burdened with all of her responsibilities. The Alaskan man is unable to cope with the political unrest of his new nation, and turns to his wife's younger sister for help. Princess Elandria is expected to assume important administrative duties, but she is overwhelmed with depression and completely useless to her endangered people.With Adlivun facing a growing threat from the foreign submarine superpower known as the Clan of Zalcan, headstrong General Visola Ramaris is focused on seeking advanced military protection. Going against the ancient mermaid tradition to remain hidden from land-dwelling societies, Visola decides to reveal herself to the American public and make an eloquent appeal for assistance. But nothing comes for free. The countries of the Pacific Rim invite Adlivun to an APEC conference where American and Russia list their conditions. The price for survival is outrageous and unexpected; if Adlivun agrees, they will play a crucial role in changing the infrastructure and economy of the world forever. But will the proud citizens of Adlivun agree to sacrifice freedom and dignity for security?Meanwhile, on a dark and desolate continent, a displaced queen has been captured and imprisoned by enemy forces. Her only concern is concealing the child she is carrying from her deranged captor. Thousands of miles from any sign of humanity, Aazuria must battle the coldest temperatures on earth in order to find her way back to her husband--but even if she lives, will she be in time to save her beloved Adlivun from itself?This is Book 3 of 6 in the Sacred Breath Series.",
  "genres": [
    "Fantasy",
    "Mermaids",
    "Romance",
    "Fiction"
  ],
  "author": "Nadia Scrieva",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/14287412-boundless-sea"
}