{
  "title": "Paraplegic Zombie Slayer",
  "description": "Never get between a man's wheelchair and his sons.\"Holy S#!% I hope I just sat in chocolate pudding.\"\"In the dust zone every man lives with a shotgun under his mattress and a bullet in his brain.\"Product Description:Life in the post apocalyptic dust zone of the Texas Panhandle can be brittle at best. Georgy Founder has already lost his wife, his daughter and his legs. But he still has three sons.With ingenuity and cunning the Founders have learned the secrets to surviving their threatening environs. But fear has governed them for too long. Survival is no longer enough. As neurotoxin-ravaged Twitchers rally for control over the region, Georgy is forced to reconcile his past in order to provide his sons a future worth living.\"If all my life's worth of reading was just to find this story, it would so totally be worth it.\"Letter from the Editor:The Truth in History Society (THS), commonly known as lost file conspiracists, have beat their drum for nearly a dozen years. I, like most, ignored them. Unlike most, I was kidnapped. While initially ticked off by this, not getting exploded (another story altogether) ultimately balanced the scales.Since then I have rigorously set about curating and editing all known Lost DMB Files while maintaining as scientific of an approach to these pulpy stories as possible. Now I count myself among the zealous believers in their authenticity, not simply as pulp fiction, but as journalistic tales preserving historic fact.My promise to the reader is to seek out these Lost DMB files and present them to you unabridged and unaltered from their original intent for as long as I am able. I also vow to do my best to allow you to draw your own conclusions as to their historical value and contemporary commentary. (I’ll refrain from my preachy tendencies as best I can!)Finally, be forewarned. Becoming lost in these “lost files” and the world they reconstruct is difficult to resist. May what once was lost be found.Professor Jim “Buck” BucknerAll known Lost DMB Files (including assumed gaps):Reefer Ranger (#9)Del Rio Con Amor (#14)Fistful of Reefer (#17)The Austin Job (#18)Hell’s Womb (#22)Get Doc Quick (#24)McCutchen’s Bones (#25)Twitch and Die! (#26)Paraplegic Zombie Slayer (#35)Fourth Horseman (#43)",
  "genres": [
    "Zombies"
  ],
  "author": "David Mark Brown",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/14288321-paraplegic-zombie-slayer"
}