{
  "title": "Good Blood Bad Blood: Science, Nature, and the Myth of the Kallikaks",
  "description": "At the vortex of the American eugenics tragedy was the seemingly sordid tale of a “degenerate” family from rural New Jersey. Published in 1912, The Kallikak Family was a pseudoscientific treatise describing generations of illiterate, poor, and purportedly immoral Kallikak family members who were chronically unemployed, “feebleminded,” criminal, and, in general, perceived as threats to “racial hygiene.” Psychologist Henry Herbert Goddard invented the pseudonym “Kallikak”—from the Greek words Kallos (beauty) and Kakos (bad)—to illustrate the eugenic belief in the role the contrasting fates of the disparate Kallikak ancestral lines reigned for decades as seemingly conclusive proof of the hereditary nature of intelligence, feeblemindedness, criminal behavior, and degeneracy. The starting point for Goddard’s moral tale was “Deborah Kallikak,” an inmate at his institution for the feeble minded. Incredibly, as revealed in detail for the first time in Good Blood, Bad Blood: Science, Nature, and the Myth of the Kallikaks, Goddard had it all wrong. No degenerate line descended from the purported Kallikak progenitor. There were only people—some of whom had resources and access to education, others of whom were poor, uneducated, and cast into the cauldron that was urban America at the dawn of the Industrial Age. The pseudonymous “Deborah Kallikak” became the poster child for societal fears regarding immigration, heredity, and racial integration, the flames of which were fanned by a select group of scientists marching under the banner of the new “science” of eugenics.Praise for Good Blood, Bad BloodGood Blood, Bad Blood is a riveting if horrifying account of an American tragedy. This is the most thorough account ever of a woeful chapter in our history. It needs to be told so that we can hear the warning to our own time: Eugenics, under whatever disguise, is a crime against humanity. —Timothy Shriver, CEO and Chairman of the Board, Special Olympics InternationalFrom the Kallikaks to the Jukes and the victims of Nazi genocide, American eugenics served humanity's worst impulses, creating a record many prefer to forget. Thanks to Wehmeyer and Smith, who won't let us. With scholarship that is both sobering and complete, Good Blood, Bad Blood sets the record straight and we're all the better for it.—Michael D'Antonio, Pulitzer Prize winning author of The State Boys RebellionI have been waiting for a book like Good Blood, Bad Blood for a very long time. Extensively researched, powerfully written, and supremely readable, this book shines a light on eugenics, one of the most influential and shameful movements of the first half of the twentieth century. This book should be read by everyone who cares about social justice, as it unveils the truth behind how our society has treated the poor, the uneducated, immigrants, and, people with disabilities. Just as importantly, it reveals why.—Rachel Simon, author of the New York Times best seller, The Story of a Beautiful GirlGood Blood, Bad Blood starts with the chilling line: “One bright October day…there came to Vineland, a little eight year-old girl.” The image is heartbreaking, as is the action throughout the book… This is a story that teaches us that we should be very careful about who gets the final word. I was riveted from the first page.—Doug Crandell, acclaimed author of Fear Came to Town and The All-American Industrial Motel",
  "genres": [
    "Nonfiction",
    "Science",
    "History"
  ],
  "author": "J. David Smith",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/14288576-good-blood-bad-blood"
}