{
  "title": "Lespada",
  "description": "The legendary sword of the House of de Winter, champions of kings, leads the charge in this dark and turbulent time between Henry III and Simon de Montfort...1264 A.D. - Davyss de Winter is the champion for King Henry III, a powerful and arrogant man that descends from a long line of powerful knights. He is also a much-sought after man and has had more than his share of female admirers, including a besotted baron's daughter who bore him bastard twins.His mother and family matriarch, the Lady Katharine de Warrenne de Winter, loses patience with her son's behavior and betroths him to a woman she hopes will tame his wild ways. She selects a young woman from a lesser noble family with no political ties or ambitions, a perfect match for her son's prideful personality. Enter Lady Devereux d'Arcy Allington.Ayoung woman of astounding beauty, Devereux wants nothing to do with Davyss. When Davyss, in protest of the marriage, sends his sword Lespada to the marriage ceremony, Devereux is beyond offended. Livid, she battles tooth and nail, refusing to marry a sword by proxy, until Lady Katharine intervenes. Cornered, Devereux is forced to marry Lespada because her groom refuses to show up for the ceremony. When Davyss gives in to his curiosity and meets his wife for the first time, he is overwhelmed with her beauty. Roughly consummating the marriage, he has set the tone for what both Davyss and Devereux believe will be a loveless, hateful marriage. But when Davyss begins to realize what he's done, he swallows his considerable pride and is determined to get to know the woman he married, a woman of grace and compassion like nothing he has ever known before.Though trials and tribulations, Davyss and Devereux's bond only strengthens. When Davyss is involved in the Battle of Evesham against Simon de Montfort, Devereux faces her own life and death situation. Lespada is a love story for the ages.Read for FREE in Kindle Unlimited!",
  "genres": [
    "Historical Romance",
    "Medieval",
    "Historical",
    "Romance",
    "Medieval Romance",
    "Historical Fiction",
    "British Literature"
  ],
  "author": "Kathryn Le Veque",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/14288670-lespada"
}