{
  "title": "Spinning Blues into Gold: The Chess Brothers and the Legendary Chess Records",
  "description": "\"Filled with facts and funk, SPINNING BLUES INTO GOLD tells a rough-and-tumble American story: how Chicago's Leonard and Phil Chess got black electric blues on wax and sent it round the world.A compelling, at times poignant book, superbly researched and sensitively written by Nadine Cohodas.\" ---Michael Lydon, author of RAY CHARLES: MAN AND MUSICMuddy Waters. Howlin' Wolf.Chuck Berry.Etta James.Bo Diddley.The greatest artists who sang the blues made their mark with Leonard and Phil Chess, whose Chess Records was synonymous with the sound that swept up from the south, embraced Chicago and spread out into mid-century America.SPINNING BLUES INTO GOLD is the impeccably researched story of the men behind the music and the remarkable company they created.Chess Records-and later Checkers, Argo and Cadet-was built by Polish immigrant Jews, brothers who saw the blues as a unique business opportunity.From their first ventures, a liquor store and then a nightclub, they promoted live entertainment.And parlayed that into the first pressings sold out of car trunks on long junkets through the midsection of the country, ultimately expanding their empire to include influential radio stations.The story of the Chess brothers is a very American story of commerce in the service of culture.Long on chutzpah, Leonard and Phil went far beyond their childhoods as the sons of a scrap-metal dealer. They changed what America listened to; the artists they promoted planted the seeds of rock 'n' roll and are still influencing music today.The story of the Chess brothers and the music they made captures the rich and volatile mix of race, Jews and music.Cohodas takes us deep into the world of independent record producers, sometimes abrasive and always aggressive men striving to succeed. Leonard and Phil worked hand-in-glove with disenfranchised black artists, the intermittent charges of exploitation balanced by the reality of a common purpose that brought them fame.From beginning to end, the lives of the Chesses were entwined with those of the artists socially, financially and creatively. From SPINNING BLUES INTO GOLD:Leonard and Phil made little distinction between office and home.Family was business and vice versa.So it was not surprising that Marshall's bar mitzvah on April 17, 1955, became something more than a traditional worship service.A centuries old ritual combined with present day business, the event became an RB convention, Hebrew chants mixed in with blues.Ahmet Ertegun and Jerry Wexler from Atlantic Records and disc jockey Alan Freed and his wife came from New York.Randy Woods of Randy's Record shop and Dot Records came from Gallatin, Tennessee; disc jockey Zenas Sears came from Atlanta, WLAC's Gene Nobles came from Nashville, Record presser Buster Williams and his wife came from Memphis, and so did a host of Chicago area music makers including prominent black disk jockeys Sam Evans, Al Benson and McKie Fitzhugh, and some of the Chess musicians.It was one of the few times blacks came to a worship service at Agudath Achem, the family's synagogue.AUTHORBIO: Nadine Cohodas is the author of Strom Thurmond and the Politics of Southern Change and The Band Played Dixie: Race and Liberal Conscience at Ole Miss.",
  "genres": [
    "Music",
    "History",
    "Biography",
    "African American",
    "Nonfiction"
  ],
  "author": "Nadine Cohodas",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/14289281-spinning-blues-into-gold"
}