{
  "title": "Blood and Matzah",
  "description": "Shira thought she knew everything and had it a comfortable life, her loving parents and their unique family business, pleasant, engaging lifelong friends, the joy of her faith, the community of her synagogue, and the love of G-d. No danger, no hardships, and certainly no nagging questions about the “why” of it all. Is that so wrong? What could be missing? Ah, there was no adventure, no lure of the unknown, no romance. This last part was a problem for Shira’s mother, Miriam. Certainly, there was very little sex. And then along came full of charisma, enigmatic, and definitely the sexiest, most alluring man she had ever encountered. One mesmerizing touch of his hand and she was undone. Completely, utterly, irrevocably. Little did she comprehend at that electrifying moment that the timeline of her placid and insignificant existence would soon spin out-of-control and turn on the proverbial dime. How could she have foreseen that this one small act would propel her into the juxtaposition of time and history, mortality and immortality, G-d and science? The upshot of which she reluctantly comes to discover, is that all of these are not necessarily mutually exclusive. This mysterious man becomes a catalyst for Shira’s self-discovery, engaging her in a topsy-turvy, rollercoaster of a ride spanning the history of her people and ultimately causing her to question everything she thought she knew about G-d, the order of the universe, and her place in it. Like the stone in David’s slingshot, she is catapulted along within the great pendulum of time, flung into the past, exposed to the seamier side of death, and thrown into the tawdry, violent underbelly of the undead. All because of Avram and his kind. This chance meeting…or was it chance? Was there a master hand at work, giving new meaning to the expression “blood sacrifice”? G-d help her. Don’t worry; He’s planning on it. Nu, you don’t have to be Jewish to understand. But it couldn’t hoit. Eh, it’s up to you. To discover more about Shira and her world, visit bloodandmatzah.com and blogandmatzah.com.",
  "genres": [
    "Fiction"
  ],
  "author": "Christine  Brown",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/14289171-blood-and-matzah"
}