{
  "title": "من شعراء بريدة : الجزء الأول",
  "description": "مقدمة المؤلف:تزخر بريدة بعدد كبير جداً، من الشعراء الشعبيين، على مدى أجيال متعاقبة، وقد أنجبت من فحول الشعراء الشعبيين أمثال: العرفج والصغير والعوني، وهؤلاء يعدون في طليعة شعراء الجزيرة العربية قاطبة.ولقد دفعني إلى اصدار هذا الديوان المتواضع، من شعراء بريدة قلة المهتمين بهذا النوع من الأدب الرفيع، وخلو المكتبة السعودية من ديوان يجمع بعض شعرائها.وقد بدأت اهتمامتي في تجميع مواده، منذ حوالي خمس عشرة سنة ثم اتخذت شكلاً أكثر جدية منذ تسع سنوات، وكنت خلالها، أجد وأجتهد في البحث والتنقيب، هنا وهناك، حتى تكونت عندي هذه الحصيلة التي ترونها بين أيديكم وسوف يتبعها بإذن الله جزء آخر وهو مجموعة من الأشعار والقصص الواقعية والأخبار وبعض الوقائع.وفي هذا الديوان، تلمس عزيزي القارئ التقصير وخلوه من بعض الشعراء الذين كان لهم صوت مدو من خلال القرنين الثالث عشر والرابع عشر وقد أهملنا ذكرهم وهذا يعود إلى أن الحصيلة الشعرية والترجمة التي استقيناها عنهم لم تكتمل بعد فإذا اكتملت فسندرجهم في الجزء الثاني إن شاء الله.أيها القراء الأعزاء:لايوجد في بريدة، مجالس أو منتديات تهتم بهذا الأدب، وتعقد له الحلقات باستثناء عدد ضئيل جداً قد تجمعهم الصدفة في مجلس أحدهم فيبرز من بينهم شخصان أو ثلاثة يهوون هذا الأدب فيأخذون يتجاذبون الحديث فيه. حيث لاحظت أن اقبال الناس، يتركز على اقتناء المدون منه دون المسموع لقراءته وحفظه في مكتباتهم الخاصة.لذا فإنه من المؤكد أن تنقرض القصيدة وأن تندثر القصة مع مرور الزمن بسبب قلة المجالس وندرة الرواة والباحثين من أجل ذلك قررت أن أركز اهتمامي على تراث الأموات غير المدون خشية أن تضيع حصيلتي المتواضعة منه إن أنا تباطأت أو تأخرت في تدوينها.أيها القراء الكرام:إن اصدار مؤلف كهذا يجمع بين القصة والقصيدة والترجمة والدراسة والخبر ليس يالأمر الهين، بل يحتاج إلى بذل مجهود، وإلى صبر وأناة وتحر للحقيقة والأخذ عن رواة لا يكذبون ولا يندفعون بفعل العواطف والأهواء.أيها القراء الأعزاء:لقد واجهتني مشاكل كثيرة أثناء بحثي وأثناء تحرير بعض المواد لوجود بعض التحريفات في بعض أبيات القصيدة القديمة التي أخذتها من أفواه رواتها حيث عملت بكل ما أوتيت من قدرة مستعينا بخبرتي على اقتلاع بعض المفردات الدخيلة التي تسببت في اختلال أوزان الأشطار لأضع مكانها مفرداتها الأصل أو مثيلاتها.كما واجهت مشكلة بعض القوافي المختلة كل هذه الأخطاء تفاديتها وتغلبت عليها اجتهاد مني دون أن أغير مجرى البيت أو ما يرمي إلبه، وهذا لا يشكل نسبة كبيرة حتى أصبحت جميع قصائد الديوان موزونة ومقفاة ومن مميزات هذا الديوان: الترجمة للشاعر وهي لا تقل أهمية عن القصيدة والبحث عن الترجمة لا يقل مشقة عن البحث عن القصيدة ذاتها.كنت أهدف وراء ذلك أن أعطي القارئ صورة مصغرة عن حياة الشاعر ليستمد منها المعاني والفكر ويقارنها في حياته الراهنة ليرى مدى الفرق وبعد المسافة بين ماضيه وحاضره.أيها القراء الكرام:تكمن ميزة الديوان بأن جميع من ورد ذكرهم فيه تحت الثرى، أناس سبقونا إلى الحياة ثم رحلوا عنها، يرحمهم الله بعد أن تكبدوا مشاق الحياة وظروفها الصعبة وذاقوا مرارة العيش ومهانة الفقر والحرمان ونغص حياتهم بتلك الأشعار التي بين أيديكم فلا أقل من أن نترحم عليهم وأن نحيي ذكرهم بهذه القصص والتراجم والأشعار التي صدرت عنهم لأنهم آباؤنا وأجدادنا ونحن فلذات أكبادهم.",
  "genres": [],
  "author": "سليمان بن محمد النقيدان",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/14290187"
}