{
  "title": "Music IS Rapid Transportation...From The Beatles to Xenakis",
  "description": "Music IS Rapid Transportation: from the Beatles to Xenakis Editor: Daniel Kernohan by Lawrence Joseph, Dan Lander, Donal McGraith, Bill Smith, Alan Stanbridge, Scott Thomson & Vern Weber photos by Gordon Bowbrick, Herb Greenslade & Bill Smith A truly alternative look at music lists, not one that merely includes the obvious but shows the connections of popular music to the avant garde, the obscure, the experimental, the quirky, and the adventurous. This book leads the curious reader towards new musical experiences hitherto unknown to them. Whether a fellow traveling musical obsessive or one to whom much of this is uncharted waters, the book maps out paths to exciting sonic adventures. The direction is not from low art to high art, but from the familiar to the unfamiliar. From musicians who are known to all, to artists who are known only to a few. Along the way, new moments of joy. This book is in three parts. The first includes seven idiosyncratic journeys from the popular to the farthest regions of music. These listening autobiographies explain the importance of artists of both international renown and almost complete obscurity. The second part has over one hundred small essays describing personal musical epiphanies, exploring not only the contributions of each artist, but also providing connections to other related artists for further listening. The final section of the book consists of seven lists of what each writer considers the most important recordings in their own listening education. While perusing these lists, one will find hundreds of routes to use in the search for a musical northwest passage. The book is lavishly illustrated with 34 fine photographs. ....from the introduction by Daniel Kernohan: \"One other very important characteristic of our musical journey is that it took us far afield, into areas where many folks do not usually go. Our trip leads from the Beatles to Xenakis. It is not a one-way trip from the popular to the avant-garde. It does not necessarily say that the 'end' of the trip is the highest ground achieved. It does not forsake Woody Guthrie for Stockhausen, as though the journey going from A to B is from lesser to greater value. While all of us have spent plenty of time investigating the farther reaches of musical vanguardism in the 20th century, we do not rest there, kick the ladder away and bask in the thin air of musical extremism. It is not progress. Neither is our trip from lowbrow to highbrow, from simplicity to complexity, from the vapid to the profound. It is a post-modern dilemma of the most typical kind, which is to say it is really the nature of modernism we are exploring (because post-modernism is just modernism in its latest moment of self-reflexivity). Because of recording, everything has become available. Pieces from the history of music, like Bach or Jannequin, were not instantly available to anyone in the 19th century. Neither was Korean farmer music, Indonesian gamelan, pygmy hocketing or Tex-Mex music. Recordings make the history of music simultaneously present and collapses any distances that would impede hearing the breadth of music in the world. It is not progress. Neither is our trip from low brow to high brow, from simplicity to complexity, from the vapid to the profound. It is a post-modern dilemma of the most typical kind, which is to say it is really the nature of modernism (because post-modernism is just modernism in its latest moment of self-reflexivity) we are exploring. Because of recording everything has become available. The history of music like Bach or Jannequin, was not instantly available to anyone in the 19 th century. Neither was Korean farmer music, Indonesian gamelan, pygmy hocketing or Tex-Mex music. Recordings make the history of music simultaneously present and collapses any distances that would impede hearing the breadth of music in the world.\"",
  "genres": [],
  "author": "Daniel Kernohan",
  "average_rating": "4.75",
  "url": "https://www.goodreads.com/book/show/14290324-music-is-rapid-transportation-from-the-beatles-to-xenakis"
}