{
  "title": "Taras Bulba",
  "description": "Nicolas Gogol (1809-1852)     \"« Voyons, tourne-toi. Dieu, que tu es drôle ! Qu’est-ce que cette robe de prêtre ? Est-ce que vous êtes tous ainsi fagotés à votre académie ? »   Voilà par quelles paroles le vieux Boulba accueillait ses deux fils qui venaient de terminer leurs études au séminaire de Kiew(1), et qui rentraient en ce moment au foyer paternel.   Ses fils venaient de descendre de cheval. C’étaient deux robustes jeunes hommes, qui avaient encore le regard en dessous, comme il convient à des séminaristes récemment sortis des bancs de l’école. Leurs visages, pleins de force et de santé, commençaient à se couvrir d’un premier duvet que n’avait jamais fauché le rasoir. L’accueil de leur père les avait fort troublés ; ils restaient immobiles, les yeux fixés à terre.   « Attendez, attendez ; laissez que je vous examine bien à mon aise. Dieu ! que vous avez de longues robes ! dit-il en les tournant et retournant en tous sens. Diables de robes ! je crois qu’on n’en a pas encore vu de pareilles dans le monde. Allons, que l’un de vous essaye un peu de courir : je verrai s’il ne se laissera pas tomber le nez par terre, en s’embarrassant dans les plis.   – Père, ne te moque pas de nous, dit enfin l’aîné.   – Voyez un peu le beau sire ! et pourquoi donc ne me moquerais-je pas de vous ?   – Mais, parce que... quoique tu sois mon père, j’en jure Dieu, si tu continues de rire, je te rosserai.   – Quoi ! fils de chien, ton père ! dit Tarass Boulba en reculant de quelques pas avec étonnement. \"     Nicolas Gogol nous fait pénétrer dans le monde belliqueux des Cosaques au XVIIe siècle. Tarass Boulba, guerrier reconnu, part en guerre contre les Polonais, avec ses deux fils, au nom de la foi orthodoxe. Seront-ils à la hauteur ? Une éventuelle défaite ne sera-t-elle pas le déclin de ces fiers Cosaques ?",
  "genres": [
    "Classics",
    "Fiction",
    "Russia",
    "Russian Literature",
    "Historical Fiction",
    "Novels",
    "Literature"
  ],
  "author": "Nikolai Gogol",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/104696.Taras_Bulba"
}