{
  "title": "Colonial Intimacies: Indian Marriage in Early New England",
  "description": "In 1668 Sarah Ahhaton, a married Native American woman of the Massachusetts Bay town of Punkapoag, confessed in an English court to having committed adultery. For this crime she was tried, found guilty, and publicly whipped and shamed; she contritely promised that if her life were spared, she would return to her husband and \"continue faithfull to him during her life yea although hee should beat her againe.\" These events, recorded in the court documents of colonial Massachusetts, may appear unexceptional; in fact, they reflect a rapidly changing world. Native American marital relations and domestic lives were anathema to English Christians; elite men frequently took more than one wife, while ordinary people could dissolve their marriages and take new partners with relative ease. Native marriage did not necessarily involve cohabitation, the formation of a new household, or mutual dependence for subsistence. Couples who wished to separate did so without social opprobrium, and when adultery occurred, the blame centered not on the \"fallen\" woman but on the interloping man. Over time, such practices changed, but the emergence of new types of \"Indian marriage\" enabled the legal, social, and cultural survival of New England's native peoples. The complex interplay between colonial power and native practice is treated with subtlety and wisdom in Colonial Intimacies . Ann Marie Plane uses travel narratives, missionary tracts, and legal records to reconstruct a previously neglected history. Plane's careful reading of fragmentary sources yields both conclusive and fittingly speculative findings, and her interpretations form an intimate picture, moving and often tragic, of the familial bonds of Native Americans in the first century and a half of European contact.",
  "genres": [
    "History",
    "Nonfiction",
    "Native American History",
    "Native Americans",
    "Sexuality",
    "Native American"
  ],
  "author": "Ann Marie Plane",
  "average_rating": "3.29",
  "url": "https://www.goodreads.com/book/show/1429499.Colonial_Intimacies"
}