{
  "title": "The Shadowy Horses",
  "description": "A brooding and atmospheric Scottish tale from a RITA and RT Reviewers Choice Award-winning and New York Times and USA Today bestselling author. The invincible ninth Roman Legion marches from York to fight the Northern tribes, and then vanishes from the pages of history. When Verity Grey goes looking for them, she may find more than she bargained for.Archaeologist Verity Grey has been drawn to the dark legends of the Scottish Borderlands in search of the truth buried in a rocky field by the sea.Her eccentric boss has spent his whole life searching for the resting place of the lost Ninth Roman Legion and is convinced he's finally found it-not because of any scientific evidence, but because a local boy has \"seen\" a Roman soldier walking in the fields, a ghostly sentinel who guards the bodies of his long-dead comrades.Here on the windswept shores, Verity may find the answer to one of the great unsolved mysteries of our time. Or she may uncover secrets someone buried for a reason.A modern gothic historical fiction with elements of mystery, ghosts, and romance from New York Times and USA Today bestselling author Susanna Kearsley.Fans of Diana Gabaldon, Mary Stewart, Kate Morton, and Daphne Du Maurier will want to join Julia and Mariana on their journeys to love, past and present.Other great books by Susanna Kearsley: The Winter Sea Winner of an RT Reviewers Choice Award, RITA finalist, finalist for the UK's Romantic Novel of the Year AwardThe Firebird RITA Winner, Paranormal RomanceThe Rose Garden Winner of an RT Reviewers Choice Award, RITA finalist  Mariana Winner of the Catherine Cookson Fiction PrizeSuzanna has had books selected for the Mystery Guild, was a finalist for the UK's Romantic Novel of the Year Award, and won a National Readers' Choice Award and a RITA.What readers are saying about The Shadowy Horses:\"A little bit ghost story and a little bit mystery with a cozy romantic element\"\"This is a tale of mysteries, of history and culture and beautiful, beautiful words.\"\"Kearsley brings the best of authors like Phyllis Whitney and Victoria Holt with excellent character development and setting.\"\"Utterly DELIGHTFUL, ENGAGING AND WHIMSICAL, I couldn't put it down.\"\"a captivating blend of GHOST STORY, MYSTERY and ROMANCE.\"What reviewers are saying about The Shadowy Horses:\"Kearsley's tale is lush with romantic and ghostly threads.\" - Kirkus \"Brooding and atmospheric... lovers of all things Scottish are going to adore this work. This poetic novel will seduce readers with its beautiful prose and lush, vivid descriptions of the Scotland shore.\" - RT Book Reviews\"intense, heartbreaking, and wonderfully satisfying\" - Luxury ReadingWhat everyone is saying about Susanna Kearsley:\"Kearsley blends history, romance and a bit of the supernatural into a glittering, BEWITCHING tale.\"-Kirkus\"A MAGICAL, not to be missed read.\" -RT Book Reviews Top Pick, 4 1/2stars\"A CREATIVE TOUR DE FORCE. Sometimes an author catches lightning in a bottle, and Susanna Kearsley has done just that.\" - New York Journal of Books\"",
  "genres": [
    "Historical Fiction",
    "Romance",
    "Fiction",
    "Mystery",
    "Paranormal",
    "Fantasy",
    "Scotland"
  ],
  "author": "Susanna Kearsley",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/14296469-the-shadowy-horses"
}