{
  "title": "1001 Comics You Must Read Before You Die: The Ultimate Guide to Comic Books, Graphic Novels, and Manga",
  "description": "Visually amazing, this critical history of comic books, manga, and graphic novels is a must-have for any comic buff or collector.  Over the centuries, comic books and their offshoots, such as graphic novels, manga, and bandes dessinées, have evolved into a phenomenally popular, influential, and unique art form with which we can express our opinions, our fantasies, our nightmares, and our dreams. In comics are emphatically no longer just for kids. This diverse, constantly evolving medium is truly coming into its own in the 21st century, from Hollywood's blockbuster adaptations of super-powered caped crusaders to the global spread of Japan's manga and its spinoffs, and from award-winning graphic novels such as Maus and Persepolis to new forms such as online webcomix. This volume is the perfect introduction to a dynamic and globally popular medium, embracing every graphic genre worldwide to assess the very best works of sequential art, graphic literature, comics, and comic strips, past and present.An international survey, this engaging volume is organized according to the year of first publication in the country of origin. An opening section acknowledges pioneering pre-1900 masterpieces, followed by sections divided by decade, creating a fascinating year-by-year chronicle of the graphic medium worldwide. The material includes the very earliest one-off albums to the latest in online comics and features some series and characters that have run for decades.Packed with fantastic reproductions of classic front covers and groundbreaking panels, this book is visually stunning as well as a trove of information--perfect for the passionate collector and casual fan alike.",
  "genres": [
    "Nonfiction",
    "Graphic Novels",
    "Art",
    "History",
    "Manga",
    "Comic Book",
    "Banned Books"
  ],
  "author": "Paul Gravett",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/10469840-1001-comics-you-must-read-before-you-die"
}