{
  "title": "Drink: A Cultural History of Alcohol",
  "description": "A spirited look at the history of alcohol from the dawn of civilization to the twenty first centuryFor better or worse, alcohol has helped shape our civilization. Throughout history, it has been consumed not just to quench our thirsts or nourish our bodies but also for cultural reasons. It has been associated since antiquity with celebration, creativity, friendship, and danger, for every drinking culture has acknowledged it possesses a dark side. In Drink, Iain Gately traces the course of humanity's 10,000 year old love affair with the substance which has been dubbed the cause of - and solution to - all of life's problems. Along the way he scrutinises the drinking habits of presidents, prophets, and barbarian hordes, and features drinkers as diverse as Homer, Hemmingway, Shakespeare, Al Capone, Benjamin Franklin, and Thomas Jefferson. Covering matters as varied as bacchanals in Imperial Rome, the gin craze in 17th century London, the rise and fall of the temperance movement, and drunk driving, Drink details the benefits and burdens alcohol has conveyed to the societies in which it is consumed. Gately's lively and provocative style brings to life the controversies, past and present, that have raged over alcohol, and uses the authentic voices of drinkers and their detractors to explode myths and reveal truths about this most equivocal of fluids.Drink further documents the contribution of alcohol to the birth and growth of the United States, taking in the war of Independence, the Pennsylvania Whiskey revolt, the slave trade, and the failed experiment of National Prohibition. Finally, it provides a history of the world's best loved drinks. Enthusiasts of craft brews and fine wines will discover the origins of their favorite tipples, and what they have in common with Greek philosophers and medieval princes every time they raise a glass.A rollicking tour through humanity's love affair with alcohol, Drink is an intoxicating history of civilization",
  "genres": [
    "History",
    "Nonfiction",
    "Food",
    "Food and Drink",
    "Alcohol",
    "Science",
    "Microhistory"
  ],
  "author": "Iain Gately",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/1430688.Drink"
}