{
  "title": "Aku-Aku: The Secret of Easter Island",
  "description": "Aku-Aku, the Secret of Easter Island is a book by Thor Heyerdahl, describing his research at Rano Raraku & Anakena on their many giant stone statues or moai. The book & a follow-up film of the same name made a major contribution to awareness, outside anthropological & archaeological communities, of both the island & the statues. Much of his evidence has now been refuted by archaeologists. His methods have been criticised. Paul Bahn wrote: \"he relied on the selective use of evidence, which resulted in a misleading conclusion\". Heyerdahl is most controversially associated with an attempt to revive the theory that the islanders stone carving technology came from South America. He argued that as well as being settled by Polynesians, Easter Island was settled by people from Peru, an area described as being \"more culturally developed\". \"Aku-aku\" refers to moving a tall, flat bottomed object by swiveling it alternatively on its corners in a \"walking\" fashion. Heyerdahl theorised the Moai (statues) of Easter Island were moved in this fashion, & tested this on a small Moai, however the test was quickly abandoned after the Moai's base was damaged. He also asserts that for the islanders, Aku Aku means a \"spiritual guide.\" Heyerdahl compared the highest quality stonework on the island to pre-Columbian Amerindian stonework such as at Tihuanaco. Seemingly unaware of Polynesian stoneworking traditions such as the Marae he said of Ahu Vinapu's retaining wall \"No Polynesian fisherman would have been capable of conceiving, much less building such a wall\". However Alfred Metraux had already pointed out that the rubble filled Rapanui walls were of a fundamentally different design to those of the Inca. Heyerdahl claimed a South American origin for a number of Easter Island plants including the Totora reeds in the islands' three crater lakes which are now recognised as a separate species to the ones in Lake Titicaca. Also the Sweet Potato, which is now reckoned to have been in Polynesia before Easter Island was settled.",
  "genres": [
    "Nonfiction",
    "History",
    "Travel",
    "Adventure",
    "Anthropology",
    "Archaeology",
    "Science"
  ],
  "author": "Thor Heyerdahl",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/1431886.Aku_Aku"
}