{
  "title": "The Landlord at Lions Head",
  "description": "The Landlord at Lion's Head is a novel by American writer William Dean Howells. The book was first published in 1897 by Harper & Brothers. Plot summary: The Durgin family, owners of a New Hampshire country house near a mountain whose peak resembles the head of a lion, plan to move to California because of a bad crop season and Mr. Durgin's ill health. As the family is packing, Mr. Westover, an artist, arrives. He pays the Durgins to stay in their home while he paints an image of the mountain. Jeff Durgin, the youngest son of the family, caters to Mr. Westover, who scolds him for scaring the nearby Whitwell children, Cynthia and Frank, with his dog. Instead of moving, Mrs. Durgin decides to change their home into a hotel; Mr. Durgin passes away in the winter before the hotel is opened. Five years later, Mr. Westovers pays another visit and is welcomed as a friend. The small country house has been renovated and expanded, and the Inn at Lion's Head is a huge success. The Whitwell family now helps run the inn. Mr. Westover catches a glimpse of Cynthia Whitwell and notices how beautiful she has become. When Jeff brings out a picnic lunch to the boarders of the hotel, Mrs. Marven, an upper class lady, does not allow him to eat with them; when Mrs. Durgin hears of this she kicks Mrs. Marven and her daughter out of the hotel. Jeff studies law at Harvard, but he is shunned by the wealthier upper-class students. He is suspended from school when he is caught with a friend who breaks a streetlight. Instead of going back to Lion's Head, he goes to Europe for the summer, and learns all about the hotels there. Once more, Mr. Westover spends the summer at Lion's head; Jeff arrives back from Europe on the same ship as wealthy Mrs. Vostrand and her daughter Genivieve. Jeff is attracted to Genivieve, but Mrs. Durgin does not allow him to associate with the upper-class boarders and sends Jeff back to Boston.The Vostrands settle in Boston, spending more and more time with Jeff Durgin. Jeff's proposes marriage to Genivieve, but she tells him that she is in love with an Italian. The Vostrands depart for Italy, leaving Jeff heartbroken. He returns to Lion's Head and is soon engaged to Cynthia, who Westover believes is far too fine for a blackguard like Jeff. Jeff tells his mother that he is content with being the Landlord at Lion's Head; she disapproves of both his low ambitions and his engagement to Cynthia. Jackson, Jeff's eldest brother, falls ill and is sent to Egypt for the winter to try to regain his health. Although Jeff no longer has plans to become a lawyer, Cynthia and Mrs. Durgin insist that he return to Harvard for his final year.Excerpt:Long after other parts of the hill country were opened to summer sojourn, the region of Lion's Head remained almost primitively solitary and savage. A stony mountain road followed the bed of the torrent that brawled through the valley at its base, and at a certain point a still rougher lane climbed from the road along the side of the opposite height to a lonely farm-house pushed back on a narrow shelf of land, with a meagre acreage of field and pasture broken out of the woods that clothed all the neighboring steeps. The farm-house level commanded the best view of Lion's Head, and the visitors always mounted to it, whether they came on foot, or arrived on buckboards or in buggies, or drove up in the Concord stages from the farther and nearer hotels. The drivers of the coaches rested their horses there, and watered them from the spring that dripped into the green log at the barn; the passengers scattered about the door-yard to look at the Lion's Head, to wonder at it and mock at it, according to their several makes and moods. They could scarcely have felt that they ever had a welcome from the stalwart, handsome woman who sold them milk, if they wanted it, and small cakes of maple sugar if they were very strenuous for something else. The ladies were not able to make much of her, from the first; but some of them asked her if it were not rather lonely there, and she said that when you heard the cat amounts scream at night, and the bears growl in the spring, it'did seem lonesome. When one of them de clared that if she should hear a catamount scream, or a bear growl, she should die, the woman answered, Well.",
  "genres": [
    "Fiction",
    "Literature",
    "Classics"
  ],
  "author": "William Dean Howells",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/14326535-the-landlord-at-lions-head"
}