{
  "title": "Brooms",
  "description": "YALSA TOP 10 GREAT GRAPHIC NOVELS FOR TEENS BEST OF THE YEAR: Booklist · Kirkus · Polygon · Chicago Public Library · New York Public Library 3 STARS ★ PW ★ Booklist ★ BCCB Mississippi, 1930s. Magic simmering beneath the surface, kept in check by unjust laws and societal expectations. But for six extraordinary women, the roar of enchanted engines and the thrill of the forbidden broom race offer a chance to rewrite their destinies. Meet Billie Mae, captain of the Night Storms racing team, and Loretta, her best friend and second-in-command. They’re determined to make enough money to move out west to a state that allows Black folks to legally use magic and take part in national races. Cheng-Kwan – doing her best to handle the delicate and dangerous double act of being the perfect “son” to her parents, and being true to herself while racing. Mattie and Emma -- Choctaw and Black -- the youngest of the group and trying to dodge government officials who want to send them and their newly-surfaced powers away to boarding school. And Luella, in love with Billie Mae. Her powers were sealed away years ago after she fought back against the government. She’ll do anything to prevent the same fate for her cousins. Brooms is a heart-pounding graphic novel soaring with magic, friendship, and rebellion. It's a Fast and the Furious with broomsticks instead of cars, a historical spotlight on struggles silenced by time, and a celebration of the indomitable spirit that dares to defy the odds. Buckle up, witches and dreamers, for this ride is about to take flight. P R A I S E“Draws on the fantastical to amplify and confront issues of both the past and the present. The result is a heartfelt, gripping, and resonant story about power—how the majority wields it, and how marginalized groups reclaim it.” —Bulletin of the Center for Children’s Books (starred) ★“Fascinating… Though readers will enjoy the dramatic racing scenes, this is truly a story about queer folk and people of color who have created a space where they can joyously and freely be themselves.” —Booklist (starred) ★“Pulse-pounding broom races and comforting domestic sequences… An evocative Fast and the Furious–flavored graphic novel.” —Publishers Weekly (starred)  ★“This is the queer, magical, broom-racing version of A League of Their Own that I didn’t know I was missing… The representation in this graphic novel is so diverse and among the best I think I’ve ever seen. It’s clear that Walls and Duvall put equal parts passion and research into this beautiful story. If you don’t read it, you’re missing out.” —Rachel Brittain, Book Riot “A sweet, entertaining found-family story that weaves magic with historical injustice; recommended for teen graphic novel shelves. —School Library Journal  “Six witches get caught up in the excitement and danger of illegal broom racing in an alternate historical Mississippi… highlights the broadly diverse experiences of folks in the South… highlighting the fact that there has always been and will always be room for queer folks in our communities.” —Kirkus  \"[A] mix of exciting racing scenes, a story about overcoming the odds, and mesmerizing depictions of magic, plus some of the not-so-pretty parts of our country’s history, and it’s done in a way that is compassionate and uplifting.\" —GeekDad “Brooms Is Your Next Favorite Fantastical LGBTQIA+ Sports Story” —The Mary Sue “Brings vivid characters (queer, broom-racing witches) to life in an equally vivid setting.” —Gizmodo (io9)",
  "genres": [
    "Graphic Novels",
    "Fantasy",
    "Young Adult",
    "LGBT",
    "Historical Fiction",
    "Queer",
    "Comics"
  ],
  "author": "Jasmine Walls",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/143330475-brooms"
}