{
  "title": "Scattershot: Life, Music, Elton and Me",
  "description": "'This is the most glorious of books. I am besotted by the life I never knew he had.' - Elton John'Orgasmic. Every page of Scattershot is a delight, a joy, a name-dropper fan's delight. Divine. I couldn't put it down.' -Pete Townshend'In Bernie Taupin's miraculous memoir Scattershot you'll meet legends, cowboys, geniuses, unforgettable faces in the night, shady purveyors of outrageous fortune, warriors of the heart, and most of all, Taupin himself. Hilarious and so emotionally true, Scattershot is like a letter from a cherished friend. You'll want to keep it close, so you can read it again and again.' -Cameron Crowe'Touching. Charming. Humble. Witty. And exquisitely written. Taupin's words need no musical accompaniment. They sing with a poets voice.' -Gary Oldman'Eloquent and inspiring, Scattershot is a freewheeling memoir that is as warm and evocative as Bernie Taupin's most memorable lyrics. A born storyteller, Taupin gives us the life of an artist whose outlook was shaped by a rare but fascinating blend of lifelong innocence and endless intellectual curiosity.' -Robert Hilburn, author of Johnny The LifeThis is the memoir music fans have been waiting for. Half of one of the greatest creative partnerships in popular music, Bernie Taupin is the man who wrote the lyrics for Elton John, who conceived the ideas that spawned countless hits, and sold millions and millions of records. Together, they were a duo, a unit, an immovable object. Their extraordinary, half-century-and-counting creative relationship has been chronicled in biopics (like 2019's Rocketman ) and even John's own autobiography, Me . But Taupin, a famously private person, has kept his own account of their adventures close to his chest, until now.Written with honesty and candour, Scatterhot allows the reader to witness events unfolding from Taupin's singular perspective, sometimes front and center, sometimes from the edge, yet always described vibrantly, with an infectious energy that only a vivid songwriter's prose could offer. From his childhood in the East Midlands of England whose imagination was sparked and forever informed by the distinctly American mythopoetics of country music and cowboys, to the glittering, star-studded fishbowl of '70s and '80s Beverly Hills, Scattershot is simultaneously a Tom Jones­- like picaresque journey across a landscape of unforgettable characters, as well as a striking, first-hand account of a creative era like no other and one man's experience at the core of it.An exciting, multi-decade whirlwind, Scattershot whizzes around the world as we ride shotgun with Bernie on his extraordinary life. We visit New York with him and Elton on the cusp of global fame. We spend time with him in Australia almost in residency at an infamous rock 'n' roll hotel in an endless blizzard of drugs. And we spend late, late night hours with John Lennon, with Bob Marley, and hanging with Frank Sinatra. And beyond the world of popular music, we witness memorable encounters with writers like Graham Greene, painters like Andy Warhol and Salvador Dali, and scores of notable misfits, miscreants, eccentrics, and geniuses, known and unknown. Even if they're not famous in their own right, they are stars on the page, and we discover how they inspired the indelible lyrics to songs such as \"Tiny Dancer,\" \"Candle in the Wind,\" \"Bennie and The Jets,\" and so many more.Unique and utterly compelling, Scattershot will transport the reader across the decades and around the globe, along the way meeting some of the greatest creative minds of the 20th century, and into the vivid imaginings of one of music's most legendary lyricists.",
  "genres": [
    "Music",
    "Nonfiction",
    "Memoir",
    "Biography",
    "Autobiography",
    "Audiobook",
    "Biography Memoir"
  ],
  "author": "Bernie Taupin",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/143382650-scattershot"
}