{
  "title": "The Dark Side of Camelot",
  "description": "If the Kennedys are America's royal family, then John F. Kennedy was the nation's crown prince. Magnetic, handsome, and charismatic, his perfectly coifed image overshadowed the successes and failures of his presidency, and his assassination cemented his near-mythological status in American culture and politics. Struck down in his prime, he represented the best and the brightest of America's future, and when he died, part of the nation's promise and innocence went with him. That, at least, is the public version of the story.The private version, according to Pulitzer Prize-winning journalist Seymour M. Hersh, is quite different. His meticulous investigation of Kennedy has revealed a wealth of indiscretions and malfeasance, ranging from frequent liaisons with prostitutes and mistresses to the attempted assassination of Fidel Castro to involvement in organized crime. Though scandals in the White House are nothing new, Hersh maintains that Kennedy's activities went beyond minor abuses of power and personal indulgences: they threatened the security of the nation--particularly in the realm of foreign policy--and the integrity of the office. Hersh believes it was only a matter of time before Kennedy's dealings were exposed, and only his popularity and charm, compounded by his premature death, spared such an investigation for so long. Exposure was further stalled by Bobby Kennedy's involvement in nefarious dealings, enabling him to bury any investigation of his brother and--by extension--himself.Based on interviews with former Kennedy administration officials, former Secret Service agents, and hundreds of Kennedy's personal friends and associates, The Dark Side of Camelot rewrites the history of John F. Kennedy and his presidency.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Politics",
    "American History",
    "Presidents",
    "United States"
  ],
  "author": "Seymour M. Hersh",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/143373.The_Dark_Side_of_Camelot"
}