{
  "title": "The Playboy of the Western World & Riders to the Sea",
  "description": "Antonio His Life and Work (Dover Books On Violin) Leading appraisers of fine musical instruments agree that in the art of making violins, no one has ever gone beyond the achievement of Antonio Stradivari. The incomparable visual beauty of his instruments and the infinite variety and magnificence of tone of which they are capable have by this time passed into the realm of legend. Collectors have paid many thousands of dollars for one of Stradivari's violins. It is strange, but true, that only one book really delves into the life and art of this famous Italian craftsman. That is the book published in 1902 by the three Hill brothers of the London violin-making firm. Expert violin-makers and critics of superior violin craftsmanship, these men had unique opportunities to examine and compare almost all of the great examples of Italian violin-making.The larger divisions of the book concern the ancestry of Stradivari; his violins, viols, and violoncellos; his aims in relation to tone; his materials; his varnish; his construction; his labels; the number of instruments he made; the growth of their reputation. Some of the topics discussed under these main headings Stradivari's apprenticeship to Amati; comparison of his work with that of Amati; the tone of the pre-1684 Stradivari violin; changes between 1684 and 1690; distinguishing characteristics of many existing violins, violas, and cellos, their specific location, etc.; erroneous views concerning Stradivari's material; his preference for the wood of certain trees in given years; the mystery of the ingredients of Stradivari's varnish; the effect of varnish on tone; the measurements of Stradivari's instruments; the time spent by Stradivari in making a violin; the years of greatest production; the largest number dating from one year; estimate of the total number made; an estimate of the actual sum he charged for an instrument; the introduction of Stradivari instruments into France and England; the first revelation of their supreme merit; and many other interesting topics.Musicologists, violinists, makers of instruments, historians of culture, and those who count themselves simply as music lovers will find this to be an extremely interesting and informative account.",
  "genres": [
    "Plays",
    "Drama",
    "Classics",
    "Theatre",
    "Irish Literature",
    "Fiction",
    "Ireland"
  ],
  "author": "J.M. Synge",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/143479.The_Playboy_of_the_Western_World_Riders_to_the_Sea"
}