{
  "title": "The Lost Worlds of Ancient America: Compelling Evidence of Ancient Immigrants, Lost Technologies, and Places of Power",
  "description": "While digging out a new basement near Los Angeles, homeowners accidentally unearth a 3,000-year-old Phoenician altar.A treasure-hunter in Ohio finds more than he expected, when his metal detector locates an Eastern Mediterranean pendant from 1000 bc.Two caches of coins minted in Imperial Rome surface along the Ohio River.A Smithsonian Institution archaeologist excavating a Native American burial mound in Tennessee removes a stone emblazoned with a second century Hebrew inscription.These are just a few of the dramatic finds described in The Lost Worlds of Ancient America. They confirm that our continent was visited and influenced by visitors from Europe and the Near East hundreds, even thousands of years before its \"official\" discovery in 1492. As such, this startling, fresh proof of their powerful impact on the pre-Columbian New World offers us a different view of American origins that threatens to re-write mainstream textbooks.More than two dozen noted academics, researchers, and writers have contributed to this myth-shattering volume, including:Scott Wolter, a university-trained geologist, construction analysis company president, and author of The Hooked X, showcased on The History Channel;Dr. John J. White, editor emeritus of the Midwestern Epigraphic Society's quarterly Journal;J.M. Allen, a former air-photo interpreter for Britain's Royal Air Force;Bruce Scofield, PhD, a world-class authority on Aztec astrology;Dr. Arlan Andrews, Sr., a registered professional engineer with a 40-year career at White Sands Missile Range, AT&T Bell Labs, and the White House Science Office;Wayne May, founder and publisher of Ancient American magazine.",
  "genres": [
    "History",
    "Ancient History",
    "Nonfiction",
    "Science",
    "Anthologies",
    "Essays",
    "American"
  ],
  "author": "Frank  Joseph",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/14348991-the-lost-worlds-of-ancient-america"
}