{
  "title": "Your Ultimate Life Plan: How to Deeply Transform Your Everyday Experience and Create Changes That Last",
  "description": "WINNER OF 12 BOOK AWARDS, * 2013 Gold Nautilus Book Award Winner ** Gold Readers' Favorite Int'l Book Award Winner ** USA Best Book Award Winner** Silver Benjamin Franklin Book Award Winner ** ForeWord Book of the Year Award Finalist ** Next Generation Indie Book Award Finalist *\" Wise, warm, illuminating and instructive : this gentle book is for anyone ready and willing to start the wondrous exploration of what it means to be whole.\"-- Guy Finley , author of The Secret of Letting Go and The Courage to Be FreeWe live in difficult and stressful times. You've read books and done workshops, but you still have to face so many stubborn obstacles. Yet it's often our pain and dissatisfaction that pushes us to seek a more conscious life.Your Ultimate Life Plan is the missing \"how to\" for getting unstuck and moving past your problems into a richer and more meaningful life. It's a roadmap to living your most happy, most authentic, most amazing life.A practical guide that will help you improve every moment of your life and create changes that last, Your Ultimate Life Plan teaches you how to build :The distillation of Dr. Howard's 20-plus years of experience as a licensed psychotherapist and spiritual teacher, this \"workshop in a book\" will help you do more than understand Wholeness -- you will experience it.Why settle for average, when the potential to live an amazing life is inside you, right now? This book will help you step boldly into your next, deeper level of happiness, wholeness, transformation, and success.\"Through her depth of experience as a therapist and spiritual practitioner, Jennifer Howard introduces skillful means for loving ourselves for who we are in this very moment, even as we cultivate deeper self-realization through powerful practices of introspection, meditation, and acceptance of our innate wholeness. Enjoy this nourishing and self-empowering book.\"-- Michael Bernard Beckwith , author of Life Visioning\"Dr. Howard offers you, through her wisdom and book, a chance to abandon your past and create the life you have been searching for. If you're ready to show up for practice, the wisdom contained here can coach and direct you on your healing journey.\"-- Bernie Siegel, MD , author of 365 Prescriptions for the Soul\"Filled with meditations and awareness-provoking exercises, this book both reassures you that your life has meaning and then helps you align with your purpose , finding that fine balance between surrender and guided action.\"--Melody Beattie , author of Codependent No More",
  "genres": [],
  "author": "Jennifer   Howard",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/14349032-your-ultimate-life-plan"
}