{
  "title": "The Canarsie Flash",
  "description": "HZar Worth's \"The Canarsie Flash\" is a gently philosophical and art-like gateway to a larger world. Gridlocke Honeycutt is a New Yorker with a flourishing career as a natural foods store owner. His success enables him to have a plush life in suburbia that seems to be on a very stable course. However, from another viewpoint, Grid’s life could easily be classified as that of an insect trapped inside the spilled molasses of a tainted and tired faith. Grid’s perfect as he sees it life as a successful married businessman and father takes an involuntary departure when he is standing in his driveway during a routine morning just about ready to head to work. Suddenly, a psychedelic drug flashback ambushes him. Like a sorcerer’s powerful enchanting spell, the psychedelic drug flashback finally felled the conspiring ceiling, corners and dusty silver cobwebs of Grid’s suburbia that chained, shackled and quarantined the hours of wanted freedom that refuse to be measured. A new courage induced by the psychedelic drug flashback pushed Grid over the edge with the same game ease used by a goat to consume a tin can. He makes a promise to his wonderful ball bearing bubble butt that he is going to forgo his pride and let the world take care of him just like how he had slaved selflessly for years taking care of others. Soon after, a modern passionate relationship with the dashing and adventuresome Dreamy takes the untraditional multicultural couple across international borders and into challenges where triumph over impossible traps seems routine. A tingling dynamic plot and storyline with the perilous medical therapist Doctor Krauroetica brings about realizations that are life changing delights. Even though her crack art film production crew contains a mist girl and camera girl right out of Doctor Krauroetica’s lustful dreams, when it comes to filming Dreamy and Grid, this is about love and there are no rules that can bind them. Following a severely botched film shoot, Doctor Krauroetica orders Dreamy and Grid to work as portable restroom operators for a year. This special assignment intended as a disciplinary measure and therapy to cure Grid of his junk and waste obsession ends with Doctor Krauroetica, Dreamy and Grid confronting Grid’s past prior to his relationship with the faux nordix ex-wife. The summit triggers a cascade of events leading Dreamy and Grid to face an Armageddon together. To find out what happens, you have to read the book, a book that came to be from a collection of notes on napkins, scraps of paper and journals kept ongoing for fifteen years. This free flowing and fast moving work of epic fantasy is intended for mature audiences, and does in fact answer the question, “what true ruler declares war on the kingdom they are meant to possess?” When you are finished reading, HZar Worth would deeply appreciate a review of “The Canarsie Flash” here on Goodreads and also on Amazon. To leave a review on Amazon, simply click on the “Orders” link in the upper right of Amazon’s main page, then just below the ‘your orders’ heading there is a link for “Digital Orders”, click this link and “The Canarsie Flash” will have a link button “Write a Product Review” just to the right of the cover pic. Thank you very much for taking the time to do this, as it allows us to continue doing what we do.",
  "genres": [],
  "author": "HZar Worth",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/14353917-the-canarsie-flash"
}