{
  "title": "My Bookstore: Writers Celebrate Their Favorite Places to Browse, Read, and Shop",
  "description": "In this enthusiastic, heartfelt, and sometimes humorous ode to bookshops and booksellers, 84 known authors pay tribute to the brick-and-mortar stores they love and often call their second homes. In \"My Bookstore\" our greatest authors write about the pleasure, guidance, and support that their favorite bookstores and booksellers have given them over the years. The relationship between a writer and his or her local store and staff can last for years or even decades. Often it's the author's local store that supported him during the early days of his career, that continues to introduce and hand-sell her work to new readers, and that serves as the anchor for the community in which he lives and works.\"My Bookstore \"collects the essays, stories, odes and words of gratitude and praise for stores across the country in 84 pieces written by our most beloved authors. It's a joyful, industry-wide celebration of our bricks-and-mortar stores and a clarion call to readers everywhere at a time when the value and importance of these stores should be shouted from the rooftops.Perfectly charming line drawings by Leif Parsons illustrate each storefront and other distinguishing features of the shops.Contributing authors and bookstores include: Fannie Flagg--Page & Palette, Fairhope, ALRick Bragg--Alabama Booksmith, Homewood, ALJohn Grisham--That Bookstore in Blytheville, Blytheville, ARRon Carlson--Changing Hands Bookstore, Tempe, AZAnn Packer--Capitola Book Cafe, Capitola, CAIsabel Allende--Book Passage, Corte Madera, CAMahbod Seraji--Kepler's Books, Menlo Park, CALisa See--Vroman's Bookstore, Pasadena, CAMeg Waite Clayton--Books Inc., San Francisco, CADaniel Handler and Lisa Brown--The Booksmith, San Francisco, CADave Eggers--Green Apple Books, San Francisco, CAPico Iyer--Chaucer's Books, Santa Barbara, CALaurie R. King--Bookshop, Santa Cruz, CAScott Lasser--Explore Booksellers, Aspen, COStephen White--Tattered Cover Book Store, Denver, COKate Niles--Maria's Bookshop, Durango, COAnn Haywood Leal--Bank Square Books, Mystic, CTFlorence and Wendell Minor--The Hickory Stick Bookshop, Washington Depot, CTRick Atkinson--Politics and Prose Bookstore, Washington, DCLes Standiford--Books & Books, Coral Gables, FLRobert Macomber--The Muse Book Shop, Deland, FLDavid Fulmer--Eagle Eye Book Shop, Decatur, GAAbraham Verghese--Prairie Lights, Iowa City, IACharlie Brandt--Chapter One Bookstore, Ketchum, IDLuis Alberto Urrea--Anderson's Bookshops, Naperville, ILMike Leonard--The Book Stall Chestnut Court, Winnetka, ILAlbert Goldbarth--Watermark Books, Wichita, KSWendell Berry--Carmichael's Bookstore, Louisville, KYTom Piazza--Octavia Books, New Orleans, LAEdith Pearlman--Brookline Booksmith, Brookline, MAMameve Medwed--Porter Square Books, Cambridge, MAHenry Louis Gates, Jr.--Harvard Book Store, Cambridge, MASimon Winchester--The Bookloft, Great Barrington, MANancy Thayer--Mitchell's Book Corner, Nantucket, MAElin Hilderbrand--Nantucket Bookworks, Nantucket, MAJeanne Birdsall--Broadside Bookshop, Northampton, MAMartha Ackmann--Odyssey Bookshop, South Hadley, MAWard Just--Bunch of Grapes Bookstore, Vineyard Haven, MARon Currie, Jr.--Longfellow Books, Portland, MEancy Shaw--Nicola's Books, Ann Arbor, MIKatrina Kittle--Saturn Booksellers, Gaylord, MIAnn Patchett--Mclean & Eakin Booksellers, Petoskey, MILouise Erdrich--Magers & Quinn Booksellers, Minneapolis, MNPeter Geye--Micawber's Books, St. Paul, MNKathleen Finneran--Left Bank Books, St. Louis, MOBarry Moser--Lemuria Books, Jackson, MSJack Pendarvis--Square Books, Oxford, MSJill McCorkle--Flyleaf Books, Chapel Hill, NCCarrie Ryan--Park Road Books, Charlotte, NCLaurent Dubois--The Regulator Bookshop, Durham, NCLee Smith--Purple Crow Books, Hillsborough, NCAngela Davis-Gardner--Quail Ridge Books & Music, Raleigh, NCRon Rash--City Lights Bookstore, Sylva, NCIan Frazier--Watchung Booksellers, Montclair, NJAudrey Vernick--Booktowne, Manasquan, NJJoan Wickersham--The Toadstool Bookshop, Peterborough, NHCarmela Ciuraru--Community Bookstore, Brooklyn, NYMatt Weiland--Greenlight Bookstore, Brooklyn, NYKate Christensen--WORD, Brooklyn, NYMick Cochrane--Talking Leaves Books, Buffalo, NYCaroline Leavitt--McNally Jackson Books, New York, NYArthur Nersesian--St. Mark's Bookshop, New York, NYFrancine Prose & Pete Hamill--Strand Bookstore, New York, NYJeff Smith--Book Loft German Village, Columbus, OHChuck Palahniuk--Powell's Books, Portland, ORLarry Kane--Chester County Book & Music Company, West Chester, PAAnn Hood--Island Books, Middletown, RIMindy Friddle--Fiction Addiction, Greenville, SCAdam Ross--Parnassus Books, Nashville, TNDouglas Brinkley--Book People, Austin, TXTerry Tempest Williams--The King's English Book Shop, Salt Lake City, UTHoward Frank Mosher--Galaxy Bookshop, Hardwick, VTJon Clinch--Northshire Bookstore, Manchester, VTJonathan Evison--Eagle Harbor Book Co., Bainbridge Island, WATom Robbins--Village Books, Bellingham, WATimothy Egan--Elliott Bay Book Company, Seattle, WAStephanie Kallos--Third Place Books, Lake Forest Park, WAIvan Doig--University Book Store, Seattle, WALesley Kagen--Next Chapter Bookshop, Mequon, WILiam Callanan--Boswell Book Company, Milwaukee, WI",
  "genres": [
    "Books About Books",
    "Nonfiction",
    "Essays",
    "Writing",
    "Memoir",
    "Travel",
    "Reference"
  ],
  "author": "Ronald Rice",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/14357459-my-bookstore"
}