{
  "title": "The Becoming",
  "description": "It had only been for fun. There couldn't really be any truth to the Ouija board myth. At least, that was what young Tim Boston had believed when he asked about his past life. But the response gave rise to more questions, the answers to which would drastically alter his life. Through the Ouija board, the Sisters of Fate told Boston that he was once the entity Death. As part of a plot to take over the heavens, two vindictive gods tricked him into promising dead souls a second chance at life. As punishment for this unforgivable act, Death was cast out of the heavens and sentenced to a mortal life. As further penalty, several of those souls, including that of an unrelenting vampire, were imprisoned in the human body with him. In the resulting turmoil, the Sisters of Fate were enslaved by the two devious gods. Having more malicious plans, one quickly betrayed the other and began abusing his newfound power to alter the past. Having removed all traces of the Sisters from history, and taking credit for all they created, the evil god became one of the most powerful beings ever. Now the Sisters need Boston's help to be freed and set things right. It's up to Boston to tip the balance of power back in favor of the Sisters by any means necessary. In order to accomplish this peacefully, he has been given half of a great power. Now he must find the girl with the other half and bring about the universe's true saviour. Should he fail to do so within eighteen months, he will die. The only other way to bring down the usurper god is to destroy all who believe in him. There would need to be an all-out war against humanity, an idea that the vampire within him finds very appealing. Can Boston find this girl before time runs out and bring about a new era of peace? Or will the vampire take over his body and bring about Armageddon?",
  "genres": [],
  "author": "David Ratliff III",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/14365684-the-becoming"
}