{
  "title": "A Path with Heart: A Guide Through the Perils and Promises of Spiritual Life",
  "description": "“This important guidebook shows in detail and with great humor and insight the way to practice the Buddha’s universal teachings here in the West. Jack Kornfield is a wonderful storyteller and a great teacher.”—Thich Nhat Hanh“Jack is helping to pave the path for American Buddhism, bringing essential basics into our crazy modern lives. And the language he uses is as simple and as lovely as our breath.”—Natalie Goldberg Perhaps the most important book yet written on meditation, the process of inner transformation, and the integration of spiritual practice into our American way of life,  A Path with Heart  brings alive one by one the challenges of spiritual living in the modern world. Written by a teacher, psychologist, and meditation master of international renown, this warm, inspiring, and expert book touches on a wide range of essential issues including many rarely addressed in spiritual books. From compassion, addiction, and psychological and emotional healing, to dealing with problems involving relationships and sexuality, to the creation of a Zen-like simplicity and balance in all facets of life, it speaks to the concerns of many modern spiritual seekers, both those beginning on the path and those with years of experience. A Path with Heart  is filled with practical techniques, guided meditations, stories, koans, and other gems of wisdom that can help ease your journey through the world. The author’s own profound—and sometimes humorous—experiences and gentle assistance will skillfully guide you through the obstacles and trials of spiritual and contemporary life to bring a clarity of perception and a sense of the sacred into your everyday experience. Reading this book will touch your heart and remind you of the promises inherent in meditation and in a life of the the blossoming of inner peace, wholeness, and understanding, and the achievement of a happiness that is not dependent on external conditions. Sure to be a classic,  A Path with Heart  shows us how we can bring our spirituality to flower every day of our lives. It is a wise and gentle guidebook for an odyssey into the soul that enables us to achieve a deeper, more satisfying life in the world.",
  "genres": [
    "Buddhism",
    "Spirituality",
    "Nonfiction",
    "Philosophy",
    "Self Help",
    "Psychology",
    "Religion"
  ],
  "author": "Jack Kornfield",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/143675.A_Path_with_Heart"
}