{
  "title": "Voices from the Gulag: Life and death in communist Bulgaria",
  "description": "One of the most terrible legacies of our century is the concentration camp. Countless men and women have passed through camps in Nazi Germany, Communist China, and the Soviet bloc countries. In Voices from the Gulag, Tzvetan Todorov singles out the experience of one country where the concentration camps were particularly brutal and emblematic of the horrors of totalitarianism--communist Bulgaria. The voices we hear in this book are mostly from Lovech, a rock quarry in Bulgaria that became the final destination for several thousand men and women during its years of operation from 1959 to 1962. The inmates, though drawn from various social, professional, and economic backgrounds, shared a common fate: they were torn from their homes by secret police, brutally beaten, charged with fictitious crimes, and shipped to Lovech. Once there, they were forced to endure backbreaking labor, inadequate clothing, shelter, and food, systematic beatings, and institutionalized torture.We also hear from guards, commandants, and bureaucrats whose lives were bound together with the inmates in an absurd drama. Regardless of their grade and duties, all agree that those responsible for these \"excesses\" were above or below them, yet never they themselves. Accountability is thereby diffused through the many strata of the state apparatus, providing legal defenses and \"clear\" consciences. Yet, as the concluding section of interviews--with the children and wives of the victims--reminds us, accountability is a moral and historical imperative.The testimonies in Voices from the Gulag were written specifically for this volume or have been published in the Bulgarian press or on Bulgarian television. Todorov compiled them for this book and has written an introductory essay--a lucid and troubling analysis of totalitarianism and the role that terror and the concentration camp play in such a world. He reflects upon his own experience living in Bulgaria during the years when Lovech was in operation. It is through that experience that Todorov has sought to understand the totalitarian horrors of our century.Although Lovech and the other camps of Soviet Russia and Eastern Europe have been closed down, concentration camps still exist in the countries whose communist regimes remain in power--Vietnam, China, North Korea, and Cuba. The voices in this book remind us that we are never completely safe from the threat of totalitarianism, a threat that we all must face. As Todorov writes, \"I cannot say that these stories do not concern me.\"",
  "genres": [
    "Bulgaria",
    "History",
    "Nonfiction",
    "Russia"
  ],
  "author": "Tzvetan Todorov",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/1436957.Voices_from_the_Gulag"
}