{
  "title": "Murder of Innocence: The Tragic Life and Final Rampage of Laurie Dann",
  "description": "Early on a May morning in 1988, Laurie Dann, a thirty-year-old, profoundly unhappy product of the wealthy North Shore suburb of Chicago, loaded her father's car with a cache of handguns, incendiary chemicals, and arsenic-laced food. Driven by fear and hate, she was going to make something terrible happen.Before the end of the day, Dann had blazed a murderous trail of poison, fire, and bullets through the unsuspecting town of Winnetka, Illinois, and other North Shore suburbs. She murdered an eight-year-old boy and critically wounded 5 other children inside an elementary school. It finally took a massed force of armed police to end the killing.The shocking story of innocence destroyed by a rich young babysitter inexplicably gone mad made headlines all across the nation and inspired at least two psychotic killers to follow her example. What lead her to do it? Could she have been stopped? The case raised a host of agonizing questions that have remained unanswered—until now. In this book, three Chicago Tribune reporters who covered the Laurie Dann tragedy have pulled together all the available police evidence, unearthed valuable psychiatric information, and interviewed at length scores of people who knew Dann, many of whom had never before spoken to the media about this case. Despite clear and ominous warning signs, a young woman of beauty and privilege was allowed to deteriorate and go slowly berserk—and no one stopped her. Her parents, her doctors, and the police officers who knew her pathological behavior all failed her at critical times. By its passivity and silence, a community comfortable and quiet on the surface, yet reluctant to admit its underlying flaws, became an unwitting accomplice to the final rampage of Laurie Dann. MURDER OF INNOCENCE is a searing portrayal of a family—and a society—unable to cope, and of a young woman who wanted all too desperately only to be loved.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Crime",
    "Audiobook",
    "Biography",
    "Mental Illness",
    "Mental Health"
  ],
  "author": "Joel Kaplan",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/1437385.Murder_of_Innocence"
}