{
  "title": "The Spell of Deception",
  "description": "A grave is being dup up in order to save Manut's aunt's life. With help of Canda, the Healing Witch, they will burn the bones of the dead so that the curse on their aunt would cease and she might live. The ritual doesn't help Char, the Coven Leader, and she passes away; but not before she turns the role of Coven Leader over to Manut. Char's son, Shanun, the rightful heir, ran off years ago to work for the Others. The mortal ones. Char has no choice but to make Manut Coven Leader. Soon the Council of Witches meets and proposes to all the other witches their rule of making Manut Coven Leader. With some negative feedback from Don, a witch who has always caused trouble for the Coven, the crowd splits it's decision in supporting Manut. After some months of being Coven Leader and doing a good job; Manut is now faced with a returning Shanun. Although Shanun has no interest in the position, Don conives and manipulates Shanun and a few more to join a band to knock Manut down from Coven Leader. Then, the perimeter guards announce that two men are approaching the hidden city. And they are the Others. Fear shakes the Coven as Manut goes up to take charge. Armed with his magick, Manut confronts the Others, trying to keep a certain amount of peace. Fueled by curiosity, Manut speaks to the Others and agrees for them to stay for a short visit. Then the drama sets in... The Others are in reality, Christian missionaries, who after hearing about the so called hidden city of witches, sought out to possibly convert them to Christianity. Now the strength of Manut will be tested by his Coven. Doubts and regrets are fueled by Don in order for Shanun to rise to his throne. Christianity and Witchcraft come head to head in this story of betrayal, murder, action, love, and disappointment. Can the two faiths learn to live together, or will someone get killed in the process of renewal?",
  "genres": [],
  "author": "Mark Miner",
  "average_rating": "1.00",
  "url": "https://www.goodreads.com/book/show/14387557-the-spell-of-deception"
}