{
  "title": "Dr. Fred's Healthcare Rescue: The Real Solution to Healthcare",
  "description": "If Not ObamaCare,Then what? Critics of ObamaCare (The Patient Protection and Affordable Care Act) have not been united in proposing a suitable alternative. The author, Dr. Fred F. Hollingsworth, has the solution. His plan is presented in Chapter 10 of his book which is reviewed below. This plan will lower costs considerably while greatly increasing the quality of healthcare. Very powerful national and international financial interests have controlled healthcare for several decades. Their motive is mainly profit. Very little money is made by getting people well and keeping them well. Much money is made by keeping people sick but alive. The term \"healthcare\" is not actually correct. It should be called \"sickness care\". Any health product or therapy, no matter how effective, is thus rejected if it is not profitable. Doctors, who attempt to use any unapproved lifesaving treatments to heal patients, face prosecution, the loss of their licenses, jail, financial bankruptcy, the loss of their health, and sometimes their actual physical safety. The above noted financial powers have long controlled the media and have built a gigantic propaganda machine to indoctrinate the public continuously to believe that various lifesaving products and therapies, are in fact fraudulent and constitute quackery. The public is, instead, led strongly but erroneously to believe that good health depends substantially upon the liberal use of expensive prescription drugs and surgeries. Furthermore the public is led to believe many untrue beliefs which are damaging to health. ______________________________________ A Review by Dr. Morton Walker 9-7-2012 Dr. Fred blows the lid off the health care scandal--the crime of the century with far more victims (believe it or not) than resulted from the terrible Nazi Holocaust. Tens of millions of people have watched precious dear loved ones suffer pain and ill health for decades ultimately dying long before reaching old age. Meanwhile many lifesaving healing therapies and products have been suppressed. A few examples Infections can be eliminated inexpensively and effectively without the use of antibiotics. Cardiovascular health can usually be restored without dangerous and expensive surgery. Dozens of effective inexpensive cancer cures are known. Type 1 (juvenile onset ) Diabetes M. can be overcome without insulin. Alzheimer's disease can even be reversed inexpensively. Furthermore, Dr. Fred exposes several popular false beliefs ,concerning health and nutrition, which have contributed to people's poor health and early death. Learn who is responsible for this outrageous and intolerable situation and how tyranny has been used to repress freedom and prevent these inexpensive and unprofitable lifesaving treatments from being used by mainstream medicine. Become aware of how government leaders attempt to address these problems while they appear not to know that government itself is the cause. Armed with the health and political information in this book, the reader should gain the opportunity to live a longer and more productive life--free of pain and illness while spending little for healthcare--and, thus, also help to prevent countless numbers of devastating government and private bankrupties. All of this and much more is explained in this 340 page easy-to-read must read book which presents a plan for far more effective healthcare at much less cost. It is available at WWW.Createspace.com/3618670 at $18.95 plus shipping. Reorders are $12.95.",
  "genres": [],
  "author": "Fred F. Hollingsworth",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/14399603-dr-fred-s-healthcare-rescue"
}