{
  "title": "Shackleton: The Polar Journeys",
  "description": "\"Men go out into the void spaces of the world for various reasons. Some are actuated simply by a love of adventure, some have the keen thirst for scientific knowledge, and others again are drawn away from the trodden paths by the lure of 'little voices,' the mysterious fascination of the unknown. I think that in my own case it was a combination of these factors that determined me to try my fortune again in the frozen south.\" -Sir Ernest Shackleton.This omnibus combines Heart of the Antarctic and South, Sir Ernest Shackleton's personal accounts of his polar expeditions.Heart of the Antarctic is the story of his expedition of 1907-09, part of his neverending quest to reach the South Pole. On this, his first expedition in sole charge, he came agonizingly close to achieving his dream. However, appalling weather conditions, together with the necessity of reaching his ship before it had to flee the advancing pack-ice, forced him to abandon his goal in a breathtaking race against time. With photographs taken on the expedition by Douglas Mawson, and numerous maps and diagrams, this is a fascinating record of one of the most daring feats of exploration of all time. This is the only complete edition available.South is Shackleton's account of a journey that began in August 1914 with high hopes of a first in exploration and ended two years later in another desperate struggle for survival, after the expedition's ship, the Endurance, was first trapped in sea-ice, then crushed. Shackleton, with a handful of his party, braved the fury of the South Atlantic as they made their desperate 800-mile journey from Elephant Island to South Georgia aboard the James Caird. This small boat-just over twenty feet long-was pitted against the fury of the southern ocean. The survival of the entire expedition was hinged on this last gamble....",
  "genres": [
    "History",
    "Nonfiction",
    "Adventure",
    "Travel",
    "Biography"
  ],
  "author": "Ernest Shackleton",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/144021.Shackleton"
}