{
  "title": "The Free:",
  "description": "one lonely, abused schoolgirl 'occupies' herself.. and sets off an explosive social and economic revolution.. Read or Download on the blog Adventure/Thriller.. Maxie rebels and runs away, with the anarcha feminists, occupiers and gays.. Set during the collapse of capitalism, amid climate chaos, we live out the social and permaculture revolution, and the dawn of a money-free world What it’s about…laughing and lamenting Accompany Linda through her hilarious, terrible day, as -escapes her useless school and abusive daddy,-changes her name to Maxie and falls in with the anarcha feminists, squatters and gays. The State is going bottoms up, the Climate is going crazy, we’re living the collapse of capitalism, blow by blow, with a rainbow. Maxie and her new friends get free of their traumas,and get into dealing subversive death blows, to a skinhead gang,a bankrupt school and the testerical special police. Next thing they flee to Ragwort CoOp Pool,in a big safe occupied working class area. We play the adventure live through their eyes, laughing and lamenting… inventing social revolution. The PIF soldiers eventually arrive, to restore capitalist chaos, Macker and Maxie are missing, the hunt begins, while the spaced out invaders get subverted, corrupted, swallowed and (burp) digested. Our odd family puzzles with the pieces.. finding a fun lifestyle,a coppice farm, and bright ideas for saving The Planet, but keep your hankies ready, folks.. click on your giant wings, for the fantastic FLYING finale! about the writer …..’here I play around with gardens and mechanics, and, um, look after children and horses. I can cook a deadly vegetarian paella and my hobbies include solar-powered internet and, er, rooting in bins’…. Thanks everyone for your help with this project. also available on Google Books, Scribd, Issuu, Anarchist Library (includes ePub version).. and HERE ON CREATESPACE !",
  "genres": [
    "Fiction",
    "Thriller",
    "Feminism",
    "Anarchism"
  ],
  "author": "M. Gilliland",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/14409783-the-free"
}