{
  "title": "The Vig",
  "description": "Part I of III in the #RectorStseries“We facilitate financial transactions for a fee. That… is what we call the Vig.” The most corrupt decade in Wall Street history. A good time to steal a little bit of money from a lot of people. Meet Frank McGinely. He’s got a penchant for vodka and the f!@k word. As an equity options specialist on the American Stock Exchange, he just happened to uncover a money skimming scam in which an algorithm pulls just a little bit from a lot of trader accounts. Forty grand up front & a little slice of greed along the way is what it takes for Frank to look the other way. It’s not long before he realizes he just stepped into the middle of a federal investigation of a Ponzi Schemer with a violent flair.Glimpse into the seamy side of the financial world, Wall Street crime; the kind that’s rarely seen by the public eye. Whatever is thought to be known about Wall Street is put into perspective upon walking across Broadway & Rector St; series of events stack up against the odds. Enter into the dangerous thrill-ride of financial crime. Chase through the night, in bars & back alleys, try to not get caught up, or like……Friedman is dead, Frank. They found his body this morning.”Frank didn’t know whether to lash out or make a run for it, but decided to sit there and keep his mouth shut, thinking about how his old life was over now. It ended ten minutes ago.“This is the preliminary coroner’s report on Mr. Friedman. Cause of death was a single gunshot wound to the head. There was an unusual twist to the killing…”Meet Carla. Carla Pugliese is the kind of woman that’ll let men’s lusty looks feed into her desire to kill them. “It was a body that made a man stupid.” They always take the bait, & she always toys with them for her own gratification, her release. A femme fatale that men don’t take for an assassin till she’s stuffing them with pieces of themselves. Now she has a new directive.Will Frank pull through on a deal caught between the crosshairs of the Feds & S.E.C? Will he survive & night of seduction & torture by a twisted, sexy assassin? Can Frank’s wit & vodka-induced tendencies fair against a maniacal criminal mastermind that’s left a body count trail for the past two decades? With bizarre, grisly killings & skin-crawling torture lurking on the page, it’s gonna take guts & grit for Frank to come out alive. Deals in this world on made in a bar, on the back of a barstool, not a boardroom. A handshake seals the deal, but these kind of deals get broken with a fist, or sometimes a gun drawn to the side of a head in a place no one’ll hear.",
  "genres": [],
  "author": "John M. Nuckel",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/14409433-the-vig"
}