{
  "title": "علل گرایش به مادی گرایی",
  "description": "فهرستِ مطالب:مقدمه : ماترياليسم در ايرانتحولات روحی مؤلفماتریالیسم در جهان اسلامشيوه‏های جديد تبليغ ماترياليسم در ايرانالف . تحريف شخصيتها :. 1 حافظ. 2 حلاجب . تحريف آيات قرآن :طرح ماركس برای مبارزه با مذهبماترياليسم اغفال شدهتنها شرط لازم و كافی برای مفسر بودن !منظور از تفسير امامتفسير قرآن بدون آشنايی با شأن نزول آيات و تاريخ صدر اسلامتفسير \" الذين يؤمنون بالغيب \" (از نظر این گروه)تفسير \" و بالآخرة هم يوقنون \" (از نظر این گروه)تفسير \" و يقيمون الصلوة \" (از نظر این گروه)تفسير \" خلود و جاودانگی \" در قرآن (از نظر این گروه)تفسير معنی \" الله \" (از نظر این گروه)معانی مادیگری (ماتریالیسم)آيا انسان بالفطره الهی است يا مادی ؟سابقه تاريخی ماديگریماديگری در دوره اسلامماترياليسم در قرون جديدنقش کلیسا در گرایش های مادیالف . نارسايی مفاهيم دينی كليسا :. 1 تصوير انسانی از خدا. 2 خدا از ديد اگوست كنت. 3 مقام الوهيت. 4 دوره‏های سه گانه اگوست كنتب . خشنوتهای كليسا :. 1 سلب آزادی عقيده و دادگاه تفتيش عقايد. 2 جنايت به عنوان مبارزه با جادوگرینارسايی مفاهيم فلسفی غربنارسايی مفاهيم فلسفی غربمشكل علت نخستينسخن هگل در علت نخستين به تقرير فلسفه اسلامیريشه ضعف فلسفه غرب در اين مسألهبنا به اصالت وجود ، ذات اشياء همان وجود آنهاستبنا به اصالت وجود ، حقيقت هستی مساوی است با وجوب ذاتیفرق \" دليل \" و \" علت \" در فلسفه هگلوحدت \" ذهن \" و \" عين \" در فلسفه هگلبی پايگی اصول هگلريشه نيازمندی اشياء به علت :نظر متكلمين : حدوث ، مناط نيازمندی به علت استنظر فلاسفه قبل از ملا صدرا : امكان ذاتی ملاك نيازمندی به علت استنظر صدرالمتألهين : تشكيك در مراتب وجودجمع بندی اين مبحثنظر راسل در اين مسألهتوحید و تکاملمتضاد پنداشتن نظريه تكامل با وجود خداپاسخ به فرض فوقنتيجه مورد نظر قرآن از ذكر داستان آدمبه فرض ضديت نظر به تكامل با ماوراء الطبيعه اين نظريه ضد دين است‏ نه ضد خداتقرير ضديت نظريه تكامل با وجود خدااصل تكامل ، برعكس بيش از پيش وجود رابطه غائی بين موجودات را بيان‏ می كندآيا علم ازلی الهی و مشيت و اراده مطلق و ازلی مخالف نظريه تكامل‏ است ؟ازليت مادهخدا يا آزادی ؟تصادف ، خدا ، عليتاصل عليت مخالف با وجود خدا !مفهوم آفرينش :آفرينش يا تحصيل حاصل است و يا تناقض ؟فرق ميان جعل بسيط و مركبقانون دوم ترموديناميك و مشكل راسلقانون عليت قانون تجربی نيستبرهان نظم :برهان نظمانتقادات ديويد هيوم بر برهان نظمخلاصه نظريات هيوم در تقرير و انتقاد از برهان نظمبررسی ايرادهای هيومآيا برهان نظم يك برهان تجربی است ؟اشتباه هيوم در اينكه برهان نظم از قبيل يافتن شباهت ميان جهان و مصنوعات انسان استفرق صنع بشری با صنع خداونداشتباه هيوم در اينكه برهان نظم را برهان اثبات همه صفات كمال الهی‏ پنداشته استاشتباه ديگر هيوم در كاربرد برهان نظمنارسايی مفاهيم اجتماعی و سياسیخدا پشتوانه استبداد سياسیآزادی سياسی و اجتماعی در اسلاماظهار نظر غیرمتخصّصاظهار نظر غیرمتخصّصضعف منطق افراد ناوارد ، يكی از موجبات گرايشهای مادیخداپرستی يا زندگی ؟ !خداپرستی یا زندگیبدبختی در دنيا يا آخرت ؟ !محيط اخلاقی و اجتماعی نامساعدمحيط اخلاقی و اجتماعی نامساعدرابطه ماديت اخلاقی با ماديگری اعتقادی و به عكسسنگر قهرمانی و پرخاشگریسنگر قهرمانی و پرخاشگریرسالت و نقش اجتماعی پيامبران و مؤمنين در قرآنروحيه عافيت طلبی در مدعيان پيشوايی دينیمفهوم تقيهكسب اعتبار ماترياليسم از سوسياليسمنتيجه اين بررسینتیجه اين بررسیروشنفكری در الهياتپيوند مسائل الهی با مسائل اجتماعی و سياسی",
  "genres": [
    "Philosophy",
    "Religion",
    "Nonfiction",
    "Islam"
  ],
  "author": "Morteza Motahhari",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/1441076._"
}