{
  "title": "Signs of Destiny",
  "description": "This exceptionally written fictional romance weaves the themes of predestination, palmistry, reincarnation, dream travel, and destiny. Narrated from the perspective of the main character, Rafael Valverde, this unique story grips the reader’s attention as he lives through relationships with his manipulative father, his deceased mother, love connections, and friendships. His authoritative father always demanded that Rafael become a financier, and assume power of his elaborate estate. But Rafael protests by following the genetically-rooted artistic talents he has inherited from his maternal side, and he chooses to study art at Penn. To further complicate their strained relationship, the father and son become estranged after Rafael’s nearly fatal car crash. When the pendulum of time again swings, it becomes evident to both of them that they are each a unique blend of genetics, worldly influences, and desires and, at times and under certain circumstances, they are one and the same. Rafael’s sketches and paintings often reflect the beautiful women of his life, including his beloved mother, Spain’s most popular actress named Gisele, and an Egyptian beauty who touched his heart by rescuing him from the rain. At an art show in Madrid, all of his paintings are sold with the exception of the portrait of Gisele, which is declared priceless. As a result, his art reputation becomes renowned and celebrated via the inclusion of Gisele on publications worldwide. The lives of Rafael’s love interests are many. Alison, whose early death is predicted by a palmist, and the attraction of Pilar to Rafael years ago as teenagers, add depth and passion to this story of romantic relationships, and how they envelop people as destiny takes its course. Predictions and forecasts of the characters’ destinies abound with compelling accuracy. The characters truly care for one another in very diverse ways. The human spirit triumphs in finding romance and pleasure, despite the often rigid and dangerous powers of destiny. The nebulous images depicted in dreams and the predictions of the chiromancy by a Spiritualist provide an intriguing paranormal element that threads its way throughout Signs of Destiny. The story blends trails of life and love, death and destiny in a dramatic, serious and sometimes, sorrowful way, but always touched by the humor that life often presents. The love experienced by the unforgettable characters in this dramatic novel authored by C. Michael Bennis is one of extremes—restrained and uncontrolled, revengeful and with abandonment, hurtful and comforting, lustful, and innocent. Follow the life, relationships, and emotions of the characters of the Signs of Destiny, especially Rafael, which parallel our lives and the lives of those who we can only imagine.",
  "genres": [
    "Romance"
  ],
  "author": "C. Michael Bennis",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/14416057-signs-of-destiny"
}