{
  "title": "Maggie the Mechanic",
  "description": "Collects the earliest, most sci-fi comics in Jaime Hernandez's Locas/Locos storyline, ripped from the pages of Love and Rockets : meet teenage mechanic Maggie, her anarchic best friend and sometimes-lover, Hopey, and their friends from the Southern Californian Hoppers 13, aka Huerta, neighborhood punk scene. This volume is the first in a comprehensive and chronological series, The Complete Love and Rockets Library , and the first that collects all of writer-artist Jaime Hernandez's \"Locas\" comic books and graphic novels. The storyline revolves around the indomitable Maggie, her anarchic best friend/occasional lover, Hopey, punk music, paramours, friends, family, and the Southern Californian neighborhood Hoppers 13, aka Huerta. Maggie the Mechanic collects the earliest and most sci-fi stories where, in addition to our heroes, we meet bombshell Penny Century, weirdo mentor Izzy, wrestler Rena Titanon, and potential love interest Rand Race. As well as seeing Hernandez develop as a cartoonist from 1981 to 1989, readers will see how he draws characters with various body types that change as they age in \"real-time.\" These stories first appeared in the seminal, long-running (and ongoing) Love and Rockets comics series, also featuring work by Jaime's brothers, Gilbert and Mario. L&R has been called \"the greatest American comic book series of all time\" by Rolling Stone and \"a great, sprawling American novel\" by GQ . It broke ground with its craft and the casual intersectionality of its huge and diverse casts of nuanced characters (many of whom are LGBQTIA+) who live and have relationships in often-naturalistic settings and situations (although L&R has SF and magical realist elements too). Along with contemporaries Chris Ware, Lynda Barry, and Daniel Clowes, the Hernandez brothers pushed the comics medium into new artistic heights. Black and white illustrations throughout",
  "genres": [
    "Comics",
    "Graphic Novels",
    "Fiction",
    "Graphic Novels Comics",
    "LGBT",
    "Science Fiction",
    "Comic Book"
  ],
  "author": "Jaime Hernández",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/144173.Maggie_the_Mechanic"
}