{
  "title": "Protect Me",
  "description": "A year ago, Anna-Marie’s world was flipped upside down. It all started outside of her apartment in downtown Wilmington one cold night in November when her boyfriend, Dylan, was savagely killed by a mysterious wild animal, one that no one had been able to find. Unfortunately, Dylan wasn’t the only victim of this shadowy creature. Once Anna-Marie sees the reports of yet another unexplained disappearance, her torturous anger and desperation pushes her forward and drives her to pull herself out of the dark grips of depression and take matters into her own hands. During her quest for justice, Anna-Marie has a chance encounter with a mysterious man; a man whom she quickly becomes friends with. Little does she know this intriguing mystery man of vampire royalty, Alessandro Pierre, has known her for quite some time. Once Alessandro and Anna-Marie’s paths cross, both of their lives would forever be changed. A year later, with Anna-Marie’s heart on the mend, she finds herself slowly falling in love with her mysterious protector, and he with her. Happiness doesn’t last long before she finds out about the mysteries of the world and the creatures that lurk in the shadows, but none is worse than finding out the truth about Dylan and the night that he supposedly died. Dylan is not only alive, but also stalking the night as one of the callous Rogue. Anna-Marie’s heart breaks with the knowledge that the man she has loved her whole life has become the worst kind of monster. And to top it off, she finds out that she is a monster as well, even if only half. What path will she choose? Will she accept what she is and follow her best friend into the darkness or will she choose the life that has been laid out for her? Will this roller coaster ride that Anna-Marie is on ever end or will it send her flying over the edge?",
  "genres": [
    "Vampires",
    "Paranormal"
  ],
  "author": "Tressa Messenger",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/14418719-protect-me"
}