{
  "title": "Merlin's Kin",
  "description": "Newly edited and illustrated...Unaware of the compulsion put upon them by the sleeping spirit of Merlin the Magician, Francis Steele and his four friends explore the subterranean chambers of an old ruin. Lost, they escape through a door to the outside only to find themselves in a new and unbelievable world where mammoths draw gigantic caravans and two great blue moons light up the night sky. Here too are primitive birds – small, sly and intelligent; unicorns and huge fighting beasts; Big Foot is here and a race of Elf-like creatures as well as the descendants of King Arthur’s knights who long ago lost the ideals of chivalry.Against this backdrop, the fifteen year old Francis and friends have to find their way back to their own world while making sense of this one and helping Merlin to keep his secret cave hidden.The story races along with caverns used as a prison, manned bird racing and slave trading all mixed in with magics rediscovered by the heroes.Welcome to Merlin’s world, explore it, enjoy it, but tread carefully.review -Everett Coles has crafted an enthralling, fast paced narrative sure to gratify the 10 – 15 age group target audience. Coles sets in place an intriguing what might take place should the Wizard Merlin need aid and call upon descendants for help, and the author then sets about spinning a tale certain to thrill the most discerning reader. Occupied with tumult, potent ingeniously interwoven plots within a plot, stratagems, snappy dialog, machination and wondrous creatures Merlin’s Kin is filled with the elements of a first rate fantasy. Forceful motivations, treachery, friction aptly determined abound against a backdrop of sights and sounds, fragrance and sensation designed to draw the reader straight into the tale. Characters are richly fleshed, acceptable and believable. Dialog is tart, at times gritty and hard hitting.This audacious account is a pleasure read awash with change and spins and awe and remarkable mythic creatures. Vocabulary used is British dialect. Younger readers will enjoy the challenge in trying to figure out various terms they have not seen before. Older readers will find the dialect only adds to the charm of the tale.Good addition to the classroom pleasure reading ‘book report’ list, personal and home library and homeschool curriculum.Enjoyed the read, happy to recommend.Molly Martin www.angelfire.com/ok4/mollymartin20+ years California classroom teacher",
  "genres": [],
  "author": "Everett Coles",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/10004862-merlin-s-kin"
}