{
  "title": "Take Back Tomorrow",
  "description": "“Raymond Chandler meets Robert Heinlein in this fun and inventive crossover SF novel from Richard Levesque.”—J. Orr, Amazon ReviewsWhat if all you had to do to make your dreams come true was violate the laws of the universe?That’s not just a philosophical question Eddie Royce has to answer. It’s a choice he has to make when the most famous science fiction writer of the 1930s goes missing and his unscrupulous publisher becomes convinced that Eddie knows all of the older writer’s secrets—not just the secret of where he’s gone, but the secret of how he’s traveled in time.Until now, Eddie’s fooled himself into thinking he’s got the system figured out, “borrowing” plots from Shakespeare and rewriting them as space operas to make a name for himself in the pulps. But when he finds out that Chester Blackwood—his idol and inspiration—has been cheating the system in ways Eddie could never have dreamed of, the hack science fiction writer finds himself in the middle of a plot that his pulp readers would never have imagined.Now he has to do all he can to save himself—and Blackwood’s beautiful daughter—from the powerful figures who all want Blackwood’s secret. And violating the laws of the universe might just be the least of Eddie’s problems.“The pace of the story is quick, and the time transitions are handled well. Overall, this is a good novel, one that even readers with little interest in sci-fi might enjoy.” — Publishers Weekly.*“Hardboiled 30′s crime thriller meets time-traveling pulp science-fiction for an original fast paced, page turner.”—S. Sager, Amazon Reviews“It has a distinctly ‘noir’ flavor as well as an old school science fiction feel. It is fast paced and clever.”—C. Pellitteri, Amazon Reviews“Apart from stopping to have something to eat I haven’t been able to tear myself away from this until I had finished it. This is good old time story telling that is well written, and definitely well worth reading.”—M. Bowden, Amazon UK Hall of Fame Reviewer*This review was of the manuscript version submitted to Amazon’s Breakout Novel Awards competition in 2012.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Time Travel",
    "Amazon",
    "Fantasy",
    "Science Fiction Fantasy"
  ],
  "author": "Richard Levesque",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/14419152-take-back-tomorrow"
}