{
  "title": "The Crown of Muirnin: Book 1 of The Muirnin Annals",
  "description": "On her twenty-second birthday, Shannon Maguire spies a leprechaun in the back yard. Intent on making contact with the leprechaun, she rushes out the back door. As she steps onto the back porch, she falls into the Devil’s Tomb. With the help of the leprechaun, they escape and land in the parallel world of Muirnin. In a day filled with surprises and frightening changes, Shannon learns she is the Crown Princess of Muirnin. Arriving at the Palace, a throng of fairies, elves, goblins, dragons, dwarves, and… there are more than she can name, greet her, cheering her escape from the Devil’s Tomb and proclaiming her their Princess. Not everyone welcomes the arrival of the Princess. Chief among the dissenters is Prince Olcán, of the Unseelie race, who believes the tradition of having a human Queen is wrong. He seeks the crown for himself and is willing to kill anyone who challenges him. The Wizard Edwulf Magusson explains to Shannon that she may stay in Muirnin for two weeks. She must then return to her home world for at least two weeks in order to maintain the balance of time that exists between the two worlds. He also tells her the Crown of Muirnin disappeared, probably stolen by Olcán. Shannon must find the crown when she returns to Muirnin if she is to become Queen. She learns that the conflict over who should rule threatens to touch off a war could destroy both Muirnin and Earth. Shannon meets the handsome Lieutenant Sean Ceallaigh, a member of the Royal Guard tasked with protecting the Princess. She is fascinated with the young soldier. At the end of the two weeks, there is a Royal Reception, complete with a banquet, the presentation of the Elves’ Summons and a ball. The Elves Summons points them to something referred to as “the last place.” No one knows where that place might be but clues in the Summons suggest some ideas of places to search. Latter, she dances a waltz with Lieutenant Ceallaigh and becomes even more charmed by the attractive officer. Shannon must put aside her personal issues and her fascination with Lieutenant Ceallaigh to find the crown. Does she have the courage and strength to defeat Olcán and claim the Throne? Can she find the crown using the clues in the Elves Summons? Will a final war destroy both of her worlds? Shannon is not certain but she knows she must try. She is willing to sacrifice her life, if necessary, to save the two worlds. She intends to wear the Crown of Muirnin.",
  "genres": [
    "Romance"
  ],
  "author": "Jim Paul",
  "average_rating": "2.67",
  "url": "https://www.goodreads.com/book/show/14428489-the-crown-of-muirnin"
}