{
  "title": "Art Held Hostage: The Battle over the Barnes Collection",
  "description": "The battle for control of America's greatest private art collection. This is the story of how a fabled art foundation―the greatest collection of impressionist and postimpressionist art in America―came to be, and why it is now, thanks to more than a decade of legal squabbling, on the brink of financial collapse. The Barnes Collection has been conservatively valued at more than $6 billion and includes some 69 Cézannes (more than in all the museums of Paris combined), 60 Matisses, 44 Picassos, 18 Rousseaus, 14 Modiglianis, and no fewer than 180 Renoirs. Yet the Barnes is in crisis. Its founder, Dr. Albert C. Barnes (1872), grew up in the slums of late-nineteenth-century Philadelphia only to become first a physician and later a pharmaceutical king. By 1920, this self-made man was already well on his way to becoming one of the great art collectors of his day. But this is also the story of Richard Glanton, who escaped poverty in rural Georgia to become a high-flying, politically powerful Philadelphia lawyer. It was Glanton who took the Barnes art on its celebrated worldwide tour, renovated the galleries-and presided over a decade of expensive litigation. The most famous of these court cases―this one in federal court―pitted the Barnes against its wealthy neighbors. The goal: A 52-car parking lot for the Barnes. The cost: more than $6 million in legal fees. Today, Glanton is no longer president of the Barnes, and the new board is seeking to move the collection into the city. Yet another court case will decide whether they can or not. The battle of the Barnes has only just begun. \"Here, at long last, is the whole truth about the Dickensian legal tug-of-war―unimaginably tangled, unsparingly vicious, unprecedentedly cynical―that threatens the survival of one of the greatest private art collections of the twentieth century. From now on, anyone who seeks to understand the desperate plight of the Barnes Collection will have to start by reading this important book.\" ―Terry Teachout, author of The Skeptic: A Life of H. L. Mencken \"John Anderson has produced a riveting account of curators, trustees, and lawyers fighting for control of the world-famous Barnes Collection of French impressionist art from the 1950s to the present. Based on hundreds of revealing interviews, Art Held Hostage reads like a superb mystery novel: This gem of investigative reporting is a sure contender for the national best-seller lists.\" ―Howard R. Lamar, Sterling Professor Emeritus of History, Yale University",
  "genres": [
    "Art",
    "Nonfiction",
    "Art History",
    "History"
  ],
  "author": "John     Anderson",
  "average_rating": "3.35",
  "url": "https://www.goodreads.com/book/show/144311.Art_Held_Hostage"
}