{
  "title": "The Genesis of Science: How the Christian Middle Ages Launched the Scientific Revolution",
  "description": "Maybe the Dark Ages Weren’t So Dark Afterall…Here are some facts you probably didn’t learn in school: People in the Middle Ages did not think the world was flat—in fact, medieval scholars could prove it wasn’tThe Inquisition never executed anyone because of their scientific ideas or discoveries (actually, the Church was the chief sponsor of scientific research and several popes were celebrated for their knowledge of the subject)It was medieval scientific discoveries, methods, and principles that made possible western civilization’s “Scientific Revolution”If you were taught that the Middle Ages were a time of intellectual stagnation, superstition, and ignorance, you were taught a myth that has been utterly refuted by modern scholarship.As a physicist and historian of science James Hannam shows in his brilliant new book, The Genesis of Science: How the Christian Middle Ages Launched the Scientific Revolution, without the scholarship of the “barbaric” Middle Ages, modern science simply would not exist.The Middle Ages were a time of one intellectual triumph after another. As Dr. Hannam writes, “The people of medieval Europe invented spectacles, the mechanical clock, the windmill, and the blast furnace by themselves. Lenses and cameras, almost all kinds of machinery, and the industrial revolution itself all owe their origins to the forgotten inventors of the Middle Ages.”In The Genesis of Science you will discoverWhy the scientific accomplishments of the Middle Ages far surpassed those of the classical worldHow medieval craftsmen and scientists not only made discoveries of their own, but seized upon Eastern inventions—printing, gunpowder, and the compass—and improved them beyond the dreams of their originatorsHow Galileo’s notorious trial before the Inquisition was about politics, not scienceWhy the theology of the Catholic Church, far from being an impediment, led directly to the development of modern scienceProvocative, engaging, and a terrific read, James Hannam’s Genesis of Science will change the way you think about our past—and our future.",
  "genres": [
    "History",
    "Science",
    "Philosophy",
    "Nonfiction",
    "Religion",
    "History Of Science",
    "Medieval History"
  ],
  "author": "James Hannam",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/10474746-the-genesis-of-science"
}