{
  "title": "For Cause and Comrades: Why Men Fought in the Civil War",
  "description": "General John A. Wickham, commander of the famous 101st Airborne Division in the 1970s and subsequently Army Chief of Staff, once visited Antietam battlefield. Gazing at Bloody Lane where, in 1862, several Union assaults were brutally repulsed before they finally broke through, he marveled, \"You couldn't get American soldiers today to make an attack like that.\" Why did those men risk certain death, over and over again, through countless bloody battles and four long, awful years ? Why did the conventional wisdom -- that soldiers become increasingly cynical and disillusioned as war progresses -- not hold true in the Civil War?It is to this question-- why did they fight --that James McPherson, America's preeminent Civil War historian, now turns his attention. He shows that, contrary to what many scholars believe, the soldiers of the Civil War remained powerfully convinced of the ideals for which they fought throughout the conflict. Motivated by duty and honor, and often by religious faith, these men wrote frequently of their firm belief in the cause for which they the principles of liberty, freedom, justice, and patriotism. Soldiers on both sides harkened back to the Founding Fathers, and the ideals of the American Revolution. They fought to defend their country, either the Union--\"the best Government ever made\"--or the Confederate states, where their very homes and families were under siege. And they fought to defend their honor and manhood. \"I should not lik to go home with the name of a couhard,\" one Massachusetts private wrote, and another private from Ohio said, \"My wife would sooner hear of mydeath than my disgrace.\" Even after three years of bloody battles, more than half of the Union soldiers reenlisted voluntarily. \"While duty calls me here and my country demands my services I should be willing to make the sacrifice,\" one man wrote to his protesting parents. And another soldier said simply, \"I still love my country.\"McPherson draws on more than 25,000 letters and nearly 250 private diaries from men on both sides. Civil War soldiers were among the most literate soldiers in history, and most of them wrote home frequently, as it was the only way for them to keep in touch with homes that many of them had left for the first time in their lives. Significantly, their letters were also uncensored by military authorities, and are uniquely frank in their criticism and detailed in their reports of marches and battles, relations between officers and men, political debates, and morale. For Cause and Comrades lets these soldiers tell their own stories in their own words to create an account that is both deeply moving and far truer than most books on war.Battle Cry of Freedom , McPherson's Pulitzer Prize-winning account of the Civil War, was a national bestseller that Hugh Brogan, in The New York Times , called \"history writing of the highest order.\" For Cause and Comrades deserves similar accolades, as McPherson's masterful prose and the soldiers' own words combine to create both an important book on an often-overlooked aspect of our bloody Civil War, and a powerfully moving account of the men who fought it.",
  "genres": [
    "History",
    "Civil War",
    "American History",
    "American Civil War",
    "Nonfiction",
    "War",
    "Military History"
  ],
  "author": "James M. McPherson",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/144338.For_Cause_and_Comrades"
}