{
  "title": "...And Sometimes The Bear Eats You: Tempting Fate on a Magic Carpet: A Helicopter Pilot's Odyssey in Alaska",
  "description": "Over the last three decades, I have had the opportunity to orally share various recollections reflective of the times, people and adventures I had while flying helicopters in the Alaskan Bush during the 1970's and 80's. The overall response has \"You really should write that down and put in a book!\" Here it is.This book does not so much concern me as it does the unique period that existed in Alaskan Aviation and American life and is no more; a time before seatbelt laws, DUI's, smoking bans and the political correctness that has become a part of everyday American life.Each chapter is a complete story, and although the main thrust is aviation, the \"Frontier Spirit,\" that is Alaska and the élan of the people, are integral parts. There are helicopter crashes and almost crashes; bear scares and wolf attacks. All of it is true.In the introduction, the reader meets a pilot, the main character, just back from a time in Southeast Asia flying for Air America; shot down in Laos, and hired as a corporate pilot for North American Rockwell. He is living large in L.A. in the late 1960's and is a part of the space aviation community when Apollo dominated. A twist of fate changed everything. Alaska called and the real adventure began.For the aviation buff; airspeeds, altitudes, and engine limits will put them in the pilots' seat experiencing the feeling one gets when over water, no land in sight, low on fuel and weather moving in. For the Alaskan enthusiast, the characters and situations parallel those from the ever popular TV shows, featuring Alaskan lore. Those readers, who feel uncomfortable with off color colloquialisms and a modicum of adult language, will probably be offended and should look elsewhere for Alaskan adventures.There has always been an interest in the Alaskan way of life, or perceived Alaskan way of life, even more so today. This may explain the fact that tourism brings more income into the state than the traditional oil, gas & fish industries. Certainly greater numbers of people visit Alaska. In the event, there is widespread interest in the \"Alaska Adventure on the Last Frontier.\" It is the object of this book to capture a bit of it.",
  "genres": [],
  "author": "Cy L. Asta",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/14436478-and-sometimes-the-bear-eats-you"
}