{
  "title": "Doppelganger: A Trip Into the Mirror World",
  "description": "Naomi Klein, author of era-defining bestsellers The Shock Doctrine, This Changes Everything and No Logo, is back with her most compulsive and personal book yet: a revelatory journey into the mirror world of our polarised ageWhen Naomi Klein discovered that a woman who shared her first name, but had radically different, harmful views, was getting chronically mistaken for her, it seemed too ridiculous to take seriously. Then suddenly it wasn't. She started to find herself grappling with a distorted sense of reality, becoming obsessed with reading the threats on social media, the endlessly scrolling insults from the followers of her doppelganger. Why had her shadowy other gone down such an extreme path? Why was identity - all we have to meet the world - so unstable?To find out, Klein decided to follow her double into a bizarre, uncanny mirror world: one of conspiracy theories, anti-vaxxers and demagogue hucksters, where soft-focus wellness influencers make common cause with fire-breathing far right propagandists (all in the name of protecting 'the children'). In doing so, she lifts the lid on our own culture during this surreal moment in history, as we turn ourselves into polished virtual brands, publicly shame our enemies, watch as deep fakes proliferate and whole nations flip from democracy to something far more sinister.This is a book for our age and for all of us; a deadly serious dark comedy which invites us to view our reflections in the looking glass. It's for anyone who has lost hours down an internet rabbit hole, who wonders why our politics has become so fatally warped, and who wants a way out of our collective vertigo and back to fighting for what really matters.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Memoir",
    "Audiobook",
    "Sociology",
    "Psychology",
    "Philosophy"
  ],
  "author": "Naomi Klein",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/144359071-doppelganger"
}