{
  "title": "The First Temptation: Tempter",
  "description": "BOOK THE FIRST TEMPTATION TEMPTER Belinda Arlane Satan's Tragic Love Affair, Ends in Suicide! BACK COVER For Satan , time, knows no bounds and his stone-cold, black heart will possess the beautiful Evianna to rule beside him in the underworld. No matter how long it takes, or who pays for his suffering! Come, take an incredible supernatural journey, woven through the very fabric of time. Travel from the beginning of human kind, to the sleepy little town of Driazhi. Venture, to the magnificence of Tombouctou and into the bowels of hell itself. Sail to the New World and be confronted with the ugliness of slavery. Enter present day, with all the chaos sin has created through the disobedience of the past. Two unlikely souls are on Satan's collision course. Their lives will be changed forever. One will find their destiny, the other redemption. A pregnant, Evianna Baxter believes she is safe in her high rise, luxury condo, until the day evil showed up at her door step. She is haunted by her mysterious past. A life, she thought had been put to rest. Evianna, is forced to make a rash decision; face the horrible past that has come to confront her, or dive off the twenty-fifth floor of her balcony? Five years of Detective Leon Caruther's life has been consumed by a serial murderer, \"The Montrose Strangler.\" Once again, he finds himself involved in another bizarre case. Eyewitness accounts swear, Satan himself paid a visit to the victim moments before her death. The evidence will not let Caruther rest and has opened old wounds from his past that will not heal. Caruther begins to question all he holds sacred and wonders about his own sanity. Along with Leon Caruther and Evianna Baxter, discover the truth Satan wants to remain hidden from us. The Truth, so powerful, it has the ability to set us all free!",
  "genres": [],
  "author": "Belinda Arlane",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/14436818-the-first-temptation"
}