{
  "title": "Me, Myself, and Us: The Science of Personality and the Art of Well-Being",
  "description": "How does your personality shape your life and what, if anything, can you do about it?Are you hardwired for happiness, or born to brood? Do you think you're in charge of your future, or do you surf the waves of unknowable fate? Would you be happier, or just less socially adept, if you were less concerned about what other people thought of you? And what about your \"Type A\" is he or she destined to have a heart attack, or just drive you to drink?In the past few decades, new scientific research has transformed old ideas about the nature of human personality. Neuroscientists, biologists, and psychological scientists have reexamined the theories of Freud and Jung as well as the humanistic psychologies of the 1960s, upending the simplistic categorizations of personality \"types,\" and developing new tools and methods for exploring who we are. Renowned professor and pioneering research psychologist Brian R. Little has been at the leading edge of this new science. In this wise and witty book he shares a wealth of new data and provocative insights about who we are, why we act the way we do, what we can -- and can't -- change, and how we can best thrive in light of our \"nature.\"Me, Myself, and Us explores questions that are rooted in the origins of human consciousness but are as commonplace as yesterday's breakfast conversation, such as whether our personality traits are \"set\" by age thirty or whether our brains and selves are more plastic. He considers what our personalities portend for our health and success, and the extent to which our well-being depends on the personal projects we pursue.Through stories, studies, personal experiences, and entertaining interactive assessments, Me, Myself, and Us provides a lively, thought-provoking, and ultimately optimistic look at the possibilities and perils of being uniquely ourselves, while illuminating the selves of the familiar strangers we encounter, work with, and love.",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Self Help",
    "Science",
    "Personal Development",
    "Business",
    "Philosophy"
  ],
  "author": "Brian Little",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/14438332-me-myself-and-us"
}