{
  "title": "Breaking Back: How I Lost Everything and Won Back My Life",
  "description": "In 2004, James Blake's life was getting more perfect by the day. A rising tennis star, with each passing year his game seemed to improve. In 2002, he was named Sexiest Male Athlete by People Magazine, and along the way he continued to gain in the rankings and earn respect on the court. Each day seemed to offer a new milestone, a new achievement; he was leading a charmed life and loving every minute of the ride.But that life came to an abrupt halt in May 2004 when Blake broke his back in a freak accident on the court. A few months later, as Blake was recovering from his injury, he suffered another tremendous setback when his father–the man who had raised him and provided the inspiration for his tennis career–lost his battle with stomach cancer. Shortly after his father's death, Blake's situation was further complicated when he contracted Zoster, a rare virus that paralyzed half of his face and threatened to end his already jeopardized tennis career.Breaking Back tells the story of the tumultuous year that followed these three devastating events, detailing how Blake persevered through hardship to become one of the best tennis players in the world. Here Blake explains how the wisdom and words that his father imparted to him over the years gave him the ability to succeed in the face of these seemingly insurmountable odds. Though these trials proved the most difficult of his life, ultimately this trifecta of tragedy became the culmination of all his father's lessons, showing Blake that even in death, his father was still teaching him how to be a man.In the spirit of Lance Armstrong's It's Not About the Bike and Joan Didion's The Year of Magical Thinking comes this remarkable tale of strength and determination from one of tennis's biggest stars. A story of passion, willpower, and the unbreakable bonds between a father and a son, Breaking Back is one athlete's account of finding hope in the bleakest of times.",
  "genres": [
    "Sports",
    "Nonfiction",
    "Biography",
    "Memoir",
    "Biography Memoir",
    "Autobiography"
  ],
  "author": "James  Blake",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/1444377.Breaking_Back"
}