{
  "title": "Way of the Wizards - New Blood",
  "description": "Book \"Way of the Wizards™\" SeriesThe story is about a group of wizards who live alone and need apprentices to pass on their knowledge before they all die out. The first problem they face is that they have not used words for a long time, instead, they use mental communication created from images, words and emotions. Therefore, they have to remember how to speak. This gave me a way to have fun how they do this and to introduce each of them and to indicate that they have lived so long and closely together that they are very similar . They send out eight wizards who each bring back an apprentice. This gives them a glimpse into the rest of the world as they each find an apprentice in different places. Eight chapters are given over to which wizard finds which apprentice and where. I have used slightly different writing styles for fun.One wizard notices that four of the apprentices are female. They then have to figure out if it is possible to teach wizardry to females. This created a way for me to look at some of the male versus female energy questions. Each apprentice has some form of communication problem, giving me a chance to look at and to play with some of the ways that communication is used in our society.One apprentice is deaf, one a very young child, one who uses her own language as a way to have some control, one was a slave and has no trust but many muscles, one is how we expect teenagers to act, one talks as he imagines knights and prophets talked, and two fall in love. The wizards use spells and energy for all of their needs and teaching how to do this becomes personal to each apprentice. This allowed me a way to look at the more social problems of today, as to how teaching could proceed. The wizards disqualify the two that fall in love from becoming apprentices. However, if the wizards send these back to where they came from neither family would accept the others choice of partner and splitting them would then be breaking the law of interference! Since they both come from farming backgrounds, the wizards spell them a farm that the wizards wrongly assume they would soon give up, as the area is so harsh. One is sent away to become a priest, and those who are left will be taught by the wizard who found them. The ex-slave girl and the deaf boy become a team instructed by one wizard, as she knows sign language and can help with communications.Each apprentice has to go before the higher council to see if each of them has the right spirit, stamina, and strength to become apprentices. As the book proceeds and each of them evolve with the new situation, the wizards and the apprentices start to change.That is where the first book ends.There is a lot of silliness such as puns, observations and it is very English and tongue in cheek, while at the same time looking at problems such as abuse, rejection, and social outcasts. I have tried to do this by using humour and the characters as well as the magic and the place itself where most things can happen.Author J. E. Honey James' ambitions as a writer are to communicate, entertain, and give something back for what he has received from the books and people that has helped him so often over the years.The author of many short stories, James has co-authored Purple Moon with Sue McCormack and offered many other story ideas to others. He has had a couple of short stories published by the Alternative Natural Philosophy Association.James is interested in other things such as painting, drawing, and carving, not to mention his studies with various healing energies. James has retired to Wales, and is devoting more time to writing the \"Way of the Wizards\" Series.Visit the wizards of Pearland and their apprentices at and interact with them!",
  "genres": [],
  "author": "J.E. Honey",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/14456092-way-of-the-wizards---new-blood"
}