{
  "title": "Queen of Ambition",
  "description": "Fiona Buckley, acclaimed for the historical accuracy and riveting storytelling of her Ursula Blanchard mysteries at the court of Queen Elizabeth I, returns with a glorious new novel set in the summer of 1564.  Ursula and her small daughter, Meg, are at their Sussex manor house, Withysham, when Ursula is summoned to court. The queen will soon set out on a Royal Progress to Cambridge, the university town known for its Protestant sympathies. Accompanied by a huge entourage and two hundred wagonloads of goods, Her Majesty will spend five nights at King's College, where she will be kept in comfort and entertained in style. Nothing must go wrong.  But Sir William Cecil, the secretary of state, is worried. Some students plan to welcome the queen to Cambridge with a farcical playlet involving kidnapping and swords. Cecil would prohibit all violence and swords near the queen's person, but she insists on letting the students have their fun. Or is it the queen who is having fun playing with her courtiers' concerns? With the spirited, thirty-year-old queen, it's always hard to tell. Or, a more serious possibility, is the playlet being used to cloak a threat to Elizabeth's safety?  Cecil can't stop the playlet but he can send Ursula as a harbinger to find out what's really happening. Her mission: dress as a cookmaid and obtain a job in Roland Jester's pie shop. The pie shop is a meeting place for students, and Roland and his brother, Cambridge tutor Giles Woodforde, may somehow be involved in the playlet.  Working in a pie shop is a new experience for Ursula, but it's not the work that's disturbing. She hears students talking. She sees people whispering. Something sinister is indeed going on, and when a young student who is himself worried about the playlet dies in a suspicious fall just before he is to meet with Ursula, she knows that Cecil's fears are justified. The queen may well be the target of a plot, and Ursula may be the only one who can save her.  Rich with historical detail, compelling characters, and an original cipher worthy of a spy agency, this fifth Ursula Blanchard novel transports us to a romantic, mysterious time in history when seemingly insignificant events changed great destinies.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Historical Mystery",
    "British Literature",
    "Crime"
  ],
  "author": "Fiona Buckley",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/1446597.Queen_of_Ambition"
}