{
  "title": "Selected Stories",
  "description": "\"Selected Stories of O. Henry,\" by O. Henry, is part of the \"Barnes & Noble Classics\"\" \"series, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of \"Barnes & Noble Classics\" New introductions commissioned from today's top writers and scholars Biographies of the authors Chronologies of contemporary historical, biographical, and cultural events Footnotes and endnotes Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work Comments by other famous authors Study questions to challenge the reader's viewpoints and expectations Bibliographies for further reading Indices & Glossaries, when appropriateAll editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. \"Barnes & Noble Classics \"pulls together a constellation of influences--biographical, historical, and literary--to enrich each reader's understanding of these enduring works. O. Henry mastered the art of the humorous, energetic tale that ends with a sudden, ironic twist. In \"After Twenty Years,\" for example, two boys agree to meet at a particular spot exactly twenty years later. Both are faithful, but in the intervening years one boy has turned into a criminal, the other into a policeman. Behind the rendezvous lurks a powerful dramatic situation with a fascinating moral dilemma--all dealt with in a few brief pages.This is just one of the many literary gems in \"Selected Stories of O. Henry,\" a collection of 45 of O. Henry's most renowned and entertaining short stories. Each one offers insights into human nature and the ways it is affected by love, hate, wealth, poverty, gentility, disguise, and crime--themes that ran through the author's own life. Born William Sidney Porter, O. Henry started writing while in prison for embezzlement. Later he moved to New York, and his tales romanticizing the commonplace, particularly the life of ordinary New Yorkers, became highly popular. The most widely read author of his time, O. Henry died penniless but left behind a wealth of short stories that endure as classics of the genre.Victoria Blakeis a freelance writer. She has worked at \"The Paris Review\" and contributed to the \"Boulder Daily Camera,\" small literary presses in the United States, and English-language publications in Bangkok, Thailand. She currently lives and works in San Diego, California.",
  "genres": [
    "Classics",
    "Short Stories",
    "Fiction",
    "Literature",
    "American",
    "Humor",
    "20th Century"
  ],
  "author": "O. Henry",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/14469.Selected_Stories"
}