{
  "title": "Perfect Nonsense: Chaotic Comics and Goofy Games of George Carlson",
  "description": "Perfect Nonsense tells the complete story behind one of the most innovative and under-rated Golden Age artists, classic children’s illustrators, and nonsense poets in American history. For more than 50 years, George Carlson created thousands of distinctive and dynamic cartoons, comics, riddles, and games that thrilled both children and adults with their fanciful spirit and nonsensical humor. There has never been a career retrospective of this startling cartoonist and illustrator — until now!Carlson’s inspired cartoons — ranging from the intellectual to the surreal — place him at home with not only acknowledged masters of American humor like George Herriman, S. J. Perelman, Milt Gross, Bill Holman, and Jack Kent, but also globally celebrated absurdists like Beckett, Pirandello, and his life-long inspiration, Lewis Carroll.Carlson also made his mark as an accomplished designer of more serious themes including magazine covers, political cartoons, advertisements, locomotive and naval illustration, and, most famously, the original book jacket for the first edition of Margaret Mitchell’s Gone With the Wind. Now, after more than 15 years of searching, compiling, and conjuring, the incredible depth of George Carlson’s artistry and ingenuity finally gets the comprehensive treatment it has so long deserved with copious full color examples of material both exquisite and obscure. Alongside plentiful cartoons, individual drawings, and comics (including Carlson’s “ghost” work on Gene Byrnes’ Reg’lar Fellers), this edition offers a meticulously researched critical introduction, rare examples of original art and unpublished projects, and a biographical timeline of Carlson’s first three decades as a commercial artist drawing on recently unearthed artifacts from the Carlson family estate.Perfect Nonsense focuses on Carlson’s prolific work as a gag cartoonist, children’s illustrator, commercial designer, and art instructor from 1907 to just before World War II. Decades before his celebrated Jingle Jangle Comics, Carlson forever altered the nature of children’s publishing during his tenure as chief artist and designer for the pioneering children’s pulp, John Martin’s Book. Carlson turned the magazine itself into a toy, filled with seasonal games, holiday cut-outs, curious crosswords, graphic exercises, puzzles, riddles, rebuses, and more.As Carlson himself once observed, his early works brim with a unique spirit of happiness and fun. We have not only captured the very best of that spirit in this collection, but also the many secrets behind its legacy. Loaded with wonder and wit, the creations of George L. Carlson will inspire cartoon and comics aficionados, teachers of children’s media, scholars of American humor, and anyone interested in the ever-evolving landscapes of image and language.",
  "genres": [
    "Comics",
    "Art",
    "Nonfiction",
    "Humor",
    "Graphic Novels"
  ],
  "author": "George Carlson",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/14475320-perfect-nonsense"
}