{
  "title": "The Joe Kubert Archives, Vol. 1: Weird Horrors and Daring Adventures",
  "description": "Joe Kubert sealed his reputation as one of the greatest American comic-book cartoonists of all time with the four-color adventures of Sgt. Rock of Easy Company, Enemy Ace, and Tarzan, all done for DC Comics during the 1960s and 1970s (themselves already the subject of archival editions)... but he had been working in comics since the 1940s. In fact, young Kubert produced an exciting, significant body of work as a freelance artist for a variety of comic book publishers in the postwar era, in a glorious variety of non-super hero genres: horror, crime, science fiction, western, romance, humor, and more. For the first time, 33 of the best of these stories have been collected in one full-color volume, with a special emphasis on horror and crime. The Kubert work in this book is that of a burgeoning talent attacking the work with tremendous panache, and in the process, developing a style that became one of the most distinctive in the medium. Since these stories were written and drawn in the pre-Comics Code era, they are more thrilling, violent and sexy (by contemporary standards) than much of his later, Code-constrained work. And just the titles of the comic books from which these stories are taken are wonderfully evocative of a bygone era of four-color fun: Cowpuncher, Abbott and Costello Comics, Three Stooges, Eerie, Planet Comics, Meet Miss Pepper, Strange Terrors, Green Hornet Comics, Whack, Jesse James, Out of This World, Crime Does Not Pay, Weird Thrillers, Police Lineup, and Hollywood Confessions. As with Fantagraphics&#8217; acclaimed Steve Ditko and Bill Everett Archives series, Weird Horrors and Daring Adventures boasts state-of-the-art restoration and retouching, and historical notes by the book&#8217;s editor Bill Schelly, author of the Art of Joe Kubert art book and Man of Rock Kubert biography.",
  "genres": [
    "Comics",
    "Graphic Novels",
    "Horror"
  ],
  "author": "Joe Kubert",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/14475440-the-joe-kubert-archives-vol-1"
}