{
  "title": "Messages in a Bottle",
  "description": "Bernard Krigstein began his career as an unremarkable journeyman cartoonist during the 1940s and finished it as a respected fine artist and illustrator but comics historians know him for his explosively creative 1950s, during which he applied all the craft, intelligence and ambition of a burgeoning serious artist to his comics work, with results that remain stunning to this day. Krigstein 's legend rests mostly on the 30 or so stories he created for the EC Comics, but dozens of stories drawn for other, lesser publishers such as Rae Herman, Hillman, and Atlas (which would become Marvel) showcase his skills and radical reinterpretation of the comics page, in particular his groundbreaking slicing and dicing of time lapses through a series of narrow, nearly animated panels. Greg Sadowski, who has previously written and designed a Harvey Award-winning biography of Krigstein, has assembled the very best of Krigstein 's comics work, starting with his earliest creative rumblings, through his glory days at EC, to his final, even more brilliantly radical stories for Atlas Comics running through every genre popular at the time, be it horror, science fiction, war, western, or romance (but no super-heroes). Legendary EC colorist Marie Severin, in her last major assignment before her retirement, has recolored 15 stories for this edition. The remainder has been taken from printed comics, digitally restored with subtlety and restraint. This edition reprints the out-of-print 2004 hardcover B. Krigstein Comics, with a number of stories re-tooled and improved in terms of reproduction, and several new stories added. It also contains an extensive set of historical and editorial notes by editor Greg Sadowski. Page stats from Krigstein 's personal archives and a comic book checklist of the artist 's entire body of work round out this substantial volume.",
  "genres": [
    "Comics",
    "Graphic Novels",
    "Horror"
  ],
  "author": "Bernard Krigstein",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/14475435-messages-in-a-bottle"
}