{
  "title": "Thrown to the Lions: Volume Two: Thrown to the Lions",
  "description": "Money. Excitement. Duty. Lust. Four men have agreed to be thrown to the local pride of werelions. Each man might have had a different motive when he first applied for the position of willing human sacrifice, but one thing is guaranteed—once a man is delivered, bound and naked, to the lions' doorstep, he’s destined to receive much more than he ever bargained for. And, as for the lions who accept their sacrifices—from the leader of the pride, all the way down to the meekest cub, they're about to find out just how much trouble humans can be. This volume contains the final two stories from the Ellery’s Duty & Cameron’s Pride. As a well respected dominant, Ellery has been watching the subs from the local leather bars disappear into the lions’ den for far too long, and he’s not convinced that everything is as fine as they all claim it is. He’s determined to find out what really happens in there. If the only way he can do that is to volunteer to be thrown to the lions himself, so be it. Kefir’s never worked out what the other lions find so interesting about the human sacrifices who visit their den, but this new man is unlike any other human he’s ever met, and Kefir’s captivated. Can the smallest lion in the pride claim a man like Ellery as his pet—is that even the way Kefir wants to think of his human mate? Franklin knows the way the game is played. It’s the man with the money who calls the shots, and Franklin has plenty of money. When he sees a beautiful lion shifter called Caramel dancing on the stage at his favourite club, he doesn’t hesitate to reach for his wallet. And, when Caramel disappears before he can even open negotiations, he’s quick to pay a fortune in order to be thrown to the only pride of werelions in the area. Cameron’s been living without a pride for years, doing whatever it takes to survive. Dancing in clubs, and doing whatever the guys who throw money at him want him to do in the alleyways behind those clubs, hasn’t given him the best opinion of human men. All he knows for sure is that the rich ones are the worst. The pride are determined to track down the lone lion that’s living in their territory and bring him safely under their care, but is it too late for Cameron to find a sense of pride—and if he does, will he be too proud to.",
  "genres": [
    "BDSM"
  ],
  "author": "Kim Dare",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/14480169-thrown-to-the-lions"
}