{
  "title": "Neolithic Shamanism: Spirit Work in the Norse Tradition",
  "description": "A step-by-step guide to working with the spirits of ancient northern Europe• Explains how to build relationships with Earth, Sun, Moon, Plants, Animals, Water, Fire, Craft, Air, and the Ancestors through 83 practical exercises• Explores the role of altered states in spirit work• Outlines the ancient cultural rules and taboos to avoid spiritual debt or offenseWe are all surrounded by spirits. Many people feel called to work with them, but few know where to begin. Enjoined by the gods and spirits to fulfill this need, Raven Kaldera and Galina Krasskova have reconstructed the indigenous spiritual traditions of northern Europe and Scandinavia extinguished more than one thousand years ago by the spread of Christianity. Arising from basic survival needs, these practical traditions are fundamentally tied to the elements found in the harsh world of the ancient North.Beginning with the skills tied to the Earth element, necessary for grounding prior to the more demanding aspects of the practice--working with Sun, Moon, Plants, Animals, Water, Fire, Craft, and Air--the authors explain, step by step, how to build relationships with each elemental spirit and the Ancestors. Offering 83 practical exercises, from cleansing with the Moon or borrowing the legs of Reindeer to making sacred space with Mugwort or creating an ancestor altar, they also explore building spirit relationships through altered states. Emphasizing the proper management of your spirit relationships to avoid spiritual debt or offense, the authors outline the ancient cultural rules and taboos that circumscribe these practices, essential knowledge for successful and fruitful spirit alliances.Detailing the beginning set of skills needed to work with the spirits of this ancient world, this comprehensive workbook offers a unique ancestral spiritual outlet for those of northern European descent as well as an accessible guide for anyone trying to fulfill their shamanic callings.",
  "genres": [
    "Paganism",
    "Nonfiction",
    "Spirituality",
    "Religion",
    "Magic",
    "Mythology",
    "Witchcraft"
  ],
  "author": "Raven Kaldera",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/14483753-neolithic-shamanism"
}