{
  "title": "The Conscious Mind: In Search of a Fundamental Theory",
  "description": "What is consciousness? How do physical processes in the brain give rise to the self-aware mind and to feelings as profoundly varied as love or hate, aesthetic pleasure or spiritual yearning? These questions today are among the most hotly debated issues among scientists and philosophers, and we have seen in recent years superb volumes by such eminent figures as Francis Crick, Daniel C. Dennett, Gerald Edelman, and Roger Penrose, all firing volleys in what has come to be called the consciousness wars. Now, in The Conscious Mind, philosopher David J. Chalmers offers a cogent analysis of this heated debate as he unveils a major new theory of consciousness, one that rejects the prevailing reductionist trend of science, while offering provocative insights into the relationship between mind and brain.Writing in a rigorous, thought-provoking style, the author takes us on a far-reaching tour through the philosophical ramifications of consciousness. Chalmers convincingly reveals how contemporary cognitive science and neurobiology have failed to explain how and why mental events emerge from physiological occurrences in the brain. He proposes instead that conscious experience must be understood in an entirely new light--as an irreducible entity (similar to such physical properties as time, mass, and space) that exists at a fundamental level and cannot be understood as the sum of its parts. And after suggesting some intriguing possibilities about the structure and laws of conscious experience, he details how his unique reinterpretation of the mind could be the focus of a new science. Throughout the book, Chalmers provides fascinating thought experiments that trenchantly illustrate his ideas. For example, in exploring the notion that consciousness could be experienced by machines as well as humans, Chalmers asks us to imagine a thinking brain in which neurons are slowly replaced by silicon chips that precisely duplicate their functions--as the neurons are replaced, will consciousness gradually fade away? The book also features thoughtful discussions of how the author's theories might be practically applied to subjects as diverse as artificial intelligence and the interpretation of quantum mechanics.All of us have pondered the nature and meaning of consciousness. Engaging and penetrating, The Conscious Mind adds a fresh new perspective to the subject that is sure to spark debate about our understanding of the mind for years to come.",
  "genres": [
    "Philosophy",
    "Psychology",
    "Science",
    "Nonfiction",
    "Neuroscience",
    "Metaphysics",
    "Artificial Intelligence"
  ],
  "author": "David J. Chalmers",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/144960.The_Conscious_Mind"
}