{
  "title": "The Dead Fish Museum",
  "description": "“In the fall, I went for walks and brought home bones. The best bones weren’t on trails—deer and moose don’t die conveniently—and soon I was wandering so far into the woods that I needed a map and compass to find my way home. When winter came and snow blew into the mountains, burying the bones, I continued to spend my days and often my nights in the woods. I vaguely understood that I was doing this because I could no longer think; I found relief in walking up hills. When the night temperatures dropped below zero, I felt visited by necessity, a baseline purpose, and I walked for miles, my only objective to remain upright, keep moving, preserve warmth. When I was lost, I told myself stories . . .”So Charles D’Ambrosio recounted his life in Philipsburg, Montana, the genesis of the brilliant stories collected here, six of which originally appeared in The New Yorker. Each of these eight burnished, terrifying, masterfully crafted stories is set against a landscape that is both deeply American and unmistakably universal. A son confronts his father’s madness and his own hunger for connection on a misguided hike in the Pacific Northwest. A screenwriter fights for his sanity in the bleak corridors of a Manhattan psych ward while lusting after a ballerina who sets herself ablaze. A Thanksgiving hunting trip in Northern Michigan becomes the scene of a haunting reckoning with marital infidelity and desperation. And in the magnificent title story, carpenters building sets for a porn movie drift dreamily beneath a surface of sexual tension toward a racial violence they will never fully comprehend. Taking place in remote cabins, asylums, Indian reservations, the backloads of Iowa and the streets of Seattle, this collection of stories, as muscular and challenging as the best novels, is about people who have been orphaned, who have lost connection, and who have exhausted the ability to generate meaning in their lives. Yet in the midst of lacerating difficulty, the sensibility at work in these fictions boldly insists on the enduring power of love. D’Ambrosio conjures a world that is fearfully inhospitable, darkly humorous, and touched by glory; here are characters, tested by every kind of failure, who struggle to remain human, whose lives have been sharpened rather than numbed by adversity, whose apprehension of truth and beauty has been deepened rather than defeated by their troubles. Many writers speak of the abyss. Charles D’Ambrosio writes as if he is inside of it, gazing upward, and the gaze itself is redemptive, a great yearning ache, poignant and wondrous, equal parts grit and grace.The high divide --Drummond & son --Screenwriter --Up north --The scheme of things --The dead fish museum --Blessing --The bone game",
  "genres": [
    "Short Stories",
    "Fiction",
    "Contemporary",
    "Literary Fiction",
    "Short Story Collection",
    "Literature",
    "Americana"
  ],
  "author": "Charles D'Ambrosio",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/145007.The_Dead_Fish_Museum"
}