{
  "title": "Adrift in the Sound",
  "description": "In 1973, frazzled Seattle street artist Lizette Karlson tries to pull herself together and turns to the Franklin Street Dogs for help. This low-life tavern softball team is a horrifying choice for a fractured spirit like Lizette, who's only trying to stay warm and make it through another rainy night. The Dogs think she’s a head case and don't realize that while Lizette’s beautiful, talented, and a bit off kilter—she’s also cunning and dangerous.Lizette wants to make it with top-Dog, Rocket. He's fixed on next door neighbor Sandy Shore, the little snake dancer who strips for soldiers coming home at the end of the Vietnam War. Everybody sleeps with everybody—whatever gets you through the night—it’s a sexual free-for-all until Sandy turns up pregnant and the scene go haywire. After witnessing a murder and getting kicked out by the Dogs, Lizette is on the run again, crisscrossing Puget Sound. She hides out on Orcas Island and paints in a secluded cabin owned by her childhood friend Marian, a gifted midwife who recently inherited her family's ranch. On the island, Lizette works with Lummi tribal leaders Poland and Abaya, who stick to their cultural values, guard their family secrets and offer her unconditional love. Along the way, Lizette sorts out crippling secrets in her own past, unwittingly makes a splash in the New York art world—and finds the only thing that really matters. If you lived through the free-love 60s, if you've ever wondered what happened the day after the music died, ADRIFT IN THE SOUND picks up the beat and offers unforgettable insights into a turbulent time in American history. It's a story about fighting the tides, surviving the storm, and swimming for shore.Readers are calling ADRIFT IN THE SOUND an important exploration of the resilience of the human spirit in a radically changing world. In both lyrical prose and gritty street language, Kate Campbell rocks our understanding of contemporary history and challenges our fiercely held beliefs. She reshapes old myths and creates new folktales to delight our imaginations.",
  "genres": [],
  "author": "Kate  Campbell",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/14514356-adrift-in-the-sound"
}