{
  "title": "On Famous Women",
  "description": "Boccaccio's \"On Famous Women\" (\"De claris mulieribus\") is a remarkable work that contains the lives of one hundred and six women in myth and history, ranging from Eve to Boccaccio's contemporary, Queen Giovanna I of Naples. It is the first collection of women's biographies ever written. Boccaccio composed it at Certaldo in 1361/62 and revised it in various stages to the end of his life in 1375. He dedicated it to Andrea Acciaiuoli, countess of Altavilla in the kingdom of Naples and sister of Niccolò Acciaiuoli, the grand seneschal of Queen Giovanna I. In his preface the author states that the biographies of illustrious men had been written often by a number of excellent writers, and he cited his hero Petrarch's \"Lives of Famous Men\" (\"De viris illustribus\") as an example. No one, however, had ever done the same for women. Boccaccio therefore presents a wide variety of women from antiquity to his own time, offering their lives as both moral \"exempla\" and entertaining reading. Boccaccio is best known as the author of the \"Decameron\" in which he portrayed women among the \"lieta brigata\" of pleasure-seeking young aristocrats and among the various characters of their tales. But in these biographies we find more serious themes that became standards of the secular and religious life; politics and private life; fame, fortune and earthly power; advantage and adversity; women's character, virtues and vices; their social roles, individual talents and achievements. \"On Famous Women\" is the earliest source of women's biography in the West and has had a long and distinguished publication career and literary influence. Its impact can be seen in Chaucer's \"Canterbury Tales,\" in Christine de Pizan's Livre de la cité des dames,\" and in the work of Spencer, Alonso de Cartagena and Thomas Elyot, among many others. Guido A. Guarino's translation is based on the edition of Mathias Apiarius, printed in Bern in 1539. This new edition includes the original woodcut illustrations of the 1539 Apiarius edition, a new bibliography and bibliographical essay. First English translation. 2nd revised edition. Introduction, new bibliography.  310 pages, 14 illustrations.",
  "genres": [
    "Classics",
    "History",
    "Biography",
    "Nonfiction",
    "Medieval",
    "Italy",
    "Philosophy"
  ],
  "author": "Giovanni Boccaccio",
  "average_rating": "3.38",
  "url": "https://www.goodreads.com/book/show/14517261-on-famous-women"
}