{
  "title": "Telzey Amberdon",
  "description": "Telzey Amberdon was only in her teens when she discovered that she was a telepath. Not only a telepath, but a xenotelepath, able to communicate mentally not just with humans, but with alien intelligences. And she turned out to be one of the most powerful telepaths in the history of the galactic civilization called the Hub.First she had to deal with an alien race that humans hadn't realized were intelligent, and who were about to eliminate those troublesome humans who thought they were colonizing an uninhabited world. Then, she had to fend off the secret psi agents of the Psychological Corps who took a dim view of any telepath, let alone one with Telzey's powers, operating outside of their control. Next, she stumbled across a telepathic serial killer, who used an unstoppable predator, under his mental control, to hunt and kill his victims -- and Telzey was to be the catch of the day.It was fortunate for the human race that she survived, since she next found herself in the middle of a secret war between two hidden races of genetically engineered humans. They called it the \"Lion Game,\" and they made the mistake of thinking that in this clash of predators, Telzey was just a harmless kitten. But when the dust settled, Telzey would be the only one purring....3 • Novice • (1962) • novelette47 • Undercurrents • (1964) • novella151 • Poltergeist • (1971) • short story169 • Goblin Night • (1965) • novelette213 • Sleep No More • (1965) • short story231 • The Lion Game • (1971) • novella by347 • Blood of Nalakia • (1953) • novelette (variant of The Vampirate)373 • The Star Hyacinths • (1961) • novelette425 • Afterword • essay by Eric Flint431 • The Federation of the Hub: An Overview • essay by Guy Gordon",
  "genres": [
    "Science Fiction",
    "Space Opera",
    "Short Stories",
    "Fantasy",
    "Anthologies",
    "Fiction",
    "Science Fiction Fantasy"
  ],
  "author": "James H. Schmitz",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/1452589.Telzey_Amberdon"
}