{
  "title": "A Call to Arms",
  "description": "A Call To Arms is the fourth novel in the award-winning historical / nautical fiction series from William C. Hammond. Along with the other novels in the Cutler Family Chronicles -most recently For Love of Country and The Power and the Glory -it features the epic saga of the seafaring Cutler family of Hingham, Massachusetts and an ever expanding cast of characters. Among these characters are real historical figures including Capt. Edward Preble, Lt. Stephen Decatur, Lt. Richard Somers, Samuel Coleridge, Bashaw Yusuf Qaramanli, and Adm. Horatio Lord Nelson. Interwoven with these historical characters is a fast-paced and gripping plot that takes the reader from Java in the Dutch East Indies to New England at the start of the nineteenth century, and on to Gibraltar, Tripoli, Malta, Sicily, Alexandria and Cairo. Historic events depicted in the novel have been subjected to intense research and have been vetted by historians. Set primarily in the Mediterranean Sea during the First Barbary War (1801-1805), A Call To Arms offers the reader intriguing and often startling insights into a young republic's struggle to promote its principles of liberty, equality and free trade in a world ravaged by the Napoleonic Wars in Europe and ruthless piracy in both the Mediterranean and Far Eastern waters. The U.S. Navy answers the call of an aroused nation, and the fate of the young republic turns on the actions of a few heroic officers, sailors and Marines. Highlighted in the novel are such historical events as the naval bombardment of Tripoli, the burning of USS Philadelphia in Tripoli Harbor, the last fateful voyage of USS Intrepid, and a Lawrence of Arabia-style overland assault on the Tripolitan city of Derne, an action supported by the U.S. Navy and immortalized in the second line of the Marines' Hymn. At the center of all the passion and excitement are the magnificent super frigates of the fledgling U.S. Navy. Also at its center is a new generation of Cutler sons and daughters eager to follow in the footsteps of Richard Cutler and his beloved English-born wife, Katherine. Theirs is a love story for the ages, but one whose future is threatened in a way that Capt. Cutler could not possibly have foreseen as he takes command of USS Portsmouth and sets sail to join the Mediterranean Squadron and his son James, serving as midshipman in USS Constitution.",
  "genres": [],
  "author": "William C. Hammond",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/14534457-a-call-to-arms"
}