{
  "title": "Virginity or Death!: And Other Social and Political Issues of Our Time",
  "description": "“As this book, which is greater than the sum of its brilliant parts makes clear, Katha Pollitt, who is famously a feminist, is also a humorist, a moralist and a most hilarious, wise, and incisive observer.”–Victor Navasky, author of A Matter of OpinionThrough presidential administrations Democratic and Republican, Katha Pollitt has observed and exposed the inconsistencies and illogic of those who stand in the way of progress solely to hold on to their power. In defense of human rights and equality, she assails the corrupt and educates the misguided with compassion, Swiftian wit, and complete literary authority.In this compelling collection, Pollitt skewers one hypocrite after another. She suggests, for example, that creationists be permitted to oppose the teaching of evolution only so long as they agree to forgo the benefits of the theory–such as flu vaccines. She gently wonders if those who denounced the decision to allow Terri Schiavo to die in peace would themselves be satisfied to be video-diagnosed by Senator Bill Frist. And in the title essay about fundamentalists’ antagonism toward sex education and STD prevention, she asks, “What is it with these right-wing Christians? Faced with a choice between sex and death, they choose death every time.”Pollitt is one of the most eloquent and persuasive voices in American political conversation of this or any other era, and Virginity or Death! Is a marvelous demonstration of her keen insight, mordant humor, and sense of justice.“Katha Pollitt has long and rightly been hailed for her brilliance, wit, and great insight into politics, social issues, and women’s rights. As with all of her work, I am enormously grateful for Virginity or Death!, and also deeply jealous.”–Anne Lamott, author of Traveling Mercies",
  "genres": [
    "Feminism",
    "Nonfiction",
    "Essays",
    "Politics",
    "Gender",
    "Social Issues",
    "Womens"
  ],
  "author": "Katha Pollitt",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/145359.Virginity_or_Death_"
}