{
  "title": "Farewell, Fred Voodoo: A Letter from Haiti",
  "description": "An account of a long, painful, ecstatic—& unreciprocated—affair with a country that has long fascinated the world. The Rainy Season, Amy Wilentz’s award-winning 1989 portrait of Haiti after the fall of Jean-Claude Duvalier, was praised in the NY Times Book Review as “a remarkable account of a journalist’s transformation by her subject.” In her relationship with the country since then, she's witnessed more than one magical transformation. Now, with Farewell, Fred Voodoo, she portrays the extraordinary people living in this stark place. She traces the country’s history from its slave plantations thru its turbulent revolutionary history, its kick-up-the-dirt guerrilla movements, its totalitarian dynasty that ruled for decades & its long, troubled relationship with the USA. Yet thru a history of hardship shines Haiti’s creative culture—its African traditions, French inheritance & uncanny resilience, a strength often confused with resignation. Haiti emerged from the 2010 earthquake like a powerful spirit. This book describes the country’s day-to-day struggle & its relationship to outsiders who come to help out. There are human-rights reporters gone awry, movie stars turned aid workers, priests & musicians running for president, doctors turned diplomats. A former US president works as a house builder & voodoo priests try to control elections. A foreign correspondent on a simple story becomes over time a lover of Haiti, pursuing the essence of this beautiful, confounding land into its darkest & brightest corners. Farewell, Fred Voodoo is a spiritual journey into the heart of the human soul. Haiti has found an author of astonishing wit, sympathy & eloquence.",
  "genres": [
    "Nonfiction",
    "History",
    "Travel",
    "Memoir",
    "Politics",
    "Biography",
    "Environment"
  ],
  "author": "Amy Wilentz",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/14546559-farewell-fred-voodoo"
}