{
  "title": "Screening Party",
  "description": "Mare's still P.O.-ed at Rob in the next scene, in which the gang shows up at St. Elmo's on Halloween night sporting Groucho Marx-style nose glasses. \"This is the one night a year where Judd Nelson feels normal,\" says Tony. In this scene, Rob's sax-synching is so powerhouse that Demi, who's newly crimped hair makes her look like an albino Pointer Sister, is compelled to dry hump the jukebox. \"I'm obsessed with this moment coming up,\" says Marcus, \"where Rob starts clapping and says,'Let's rock!' I think he looks so awkward.\" Just then, his wife traipses in looking like Pat Benatar from the \"Love Is a Battlefield\" video. When Rob notices she's with another man, all hell breaks loose. \"Get your hands off of my wife!\" threatens Rob. \"With narcissists,\" explains Dr. Beaverman, \"everything belongs to them. They see everything as an extension of themselves. They are not independent objects.\" Dr. B takes a swig of Snapple and adds, \". . . .unlike whatever Demi's got stuffed into her bra which seems to have a mind of its own.\" \"And check out that metallic lip gloss,\" says Tony. \"It looks like she just went down on C3PO in the bathroom.\"-- Screening Party on \"St. Elmo's Fire\"It started as a series of articles for the British version of \"Premiere\", and \"Instinct Magazine\", but soon took on a life of it's own. Dennis Hensley, author of the bestseller Misadventures in the (213), has been getting together with 5 friends to watch and debate, rant, criticize, and reminisce about films that are both recognized classics and guilty pleasures. Partway through this deconstruction of memorable cinema, you will encounter this musing on Armageddon: \"What girl would make out with her boyfriend in front of her dad?\" wonders Tony, as Liv straddles Ben and sucks his face off while Willis and company look on. \"She mounted him in a sundress in front of her dad.\"If you're tired of plodding through earnest studies of film's impact on society, these words alone should convince you that this book is anything but.",
  "genres": [
    "Nonfiction",
    "Humor"
  ],
  "author": "Dennis  Hensley",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/1047869.Screening_Party"
}