{
  "title": "Pushkin: A Biography",
  "description": "Pushkin is Russia’s greatest and best-loved a romantic, enigmatic figure who, during a brief but turbulent life, changed Russian literature forever with his vital and passionate verse. Many of his works—including The Bronze Horseman, The Queen of Spades, and his extraordinary novel in verse, Eugene Onegin —have become classics of world literature and are as exhilarating to read today as they were when first published. Now we have the first full biography in sixty years of this literary legend.Born in Moscow in 1799, he was descended on one side from an ancient noble family, on the other from a black African slave of Peter the Great. At the age of twenty he was expelled from St. Petersburg for his satirical writings. He remained in internal exile, under the direct supervision of the emperor, for the next seven years, and throughout his life attracted official disapproval for his political and religious beliefs—and for his many love affairs. In 1831, despite mounting debts from gambling and an insecure income, he married the eighteen-year-old Natalya Goncharova, who soon became recognized as one of the most beautiful women of St. Petersburg society. The attentions paid her by a Guards officer, the French émigré d’Anthès, roused Pushkin to fury. In the subsequent duel, fought on January 27, 1837, he was fatally wounded. He died in agony two days later.This superb, authoritative biography—winner of England’s prestigious Samuel Johnson Prize—frees the complex figure of Pushkin the man from the heroic simplicity of Pushkin the myth, making palpable the poet’s rare energy, talents, and spirit. Telling Pushkin’s story with exacting scholarship, elegant wit, and acute insight, T. J. Binyon gives us a revelation of the poet and the man.",
  "genres": [
    "Biography",
    "Nonfiction",
    "History",
    "Russia",
    "Russian Literature",
    "Literature",
    "Classics"
  ],
  "author": "T.J. Binyon",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/1047891.Pushkin"
}