{
  "title": "Starlight Tour: The Last, Lonely Night of Neil Stonechild",
  "description": "A teen’s suspicious death, a shocking police cover-up and a mother’s search for the truth.In 1990, on a November night that hit –28 degrees Celsius, seventeen-year-old Neil Stonechild disappeared only blocks from his mother’s home. His frozen body was found three days later, eight kilometres from where he was last seen in downtown Saskatoon. The police investigation was cursory — no one seemed to wonder about the abrasions on his wrists or the scrapes on his face, or the fact that he was missing a shoe. Neil was drunk and out walking, the police believed, and had died by misadventure. His mother, Stella Bignell, tried her best to push for answers, but no one in authority wanted to listen to a native woman whose sons had often been in trouble with the law.But Stella did not give up, and neither did the only witness, sixteen-year-old Jason Roy, who had seen Neil, beaten and bleeding, in the back of a Saskatoon police cruiser the night he disappeared. Starlight Tour recounts their struggle for justice in the face of indifferent officials, destroyed police files and institutionalized racism. In the decade following Neil’s death, rumours persisted that police sometimes drove natives beyond the edge of town and abandoned them. But it was only in January 2000, when two more men were found frozen to death, that the truth about Neil Stonechild’s fate began to emerge. A third man, Darrell Night, survived his “starlight tour,” and lived to tell the tale. And soon one of the country’s most prominent aboriginal lawyers, Donald Worme, was on the case.With exclusive co-operation from the Stonechild family, Worme, and other key players, and information not yet revealed in the press coverage, The Starlight Tour is an engrossing and damning portrait of rogue cops, racism, obstruction of justice and justice denied, not only to a boy and his mother but to the entire country’s native community.",
  "genres": [
    "Nonfiction",
    "True Crime",
    "Indigenous",
    "History",
    "Canada",
    "Crime",
    "Indigenous History"
  ],
  "author": "Susanne Reber",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/1455306.Starlight_Tour"
}