{
  "title": "L'Amant",
  "description": "« Dans L’Amant, Marguerite Duras reprend sur le ton de la confidence les images et les thèmes qui hantent toute son œuvre. Ses lecteurs vont pouvoir ensuite descendre ce grand fleuve aux lenteurs asiatiques et suivre la romancière danstous les méandres du delta, dans la moiteur des rizières, dans les secrets ombreux où elle a développé l’incantation répétitive et obsédante de ses livres, de ses films, de son théâtre. Au sens propre, Duras est ici remontée à ses sources, à sa “ scène fondamentale ” : ce moment où, vers 1930, sur un bac traversant un bras du Mékong, un Chinois richissime s’approche d’une petite Blanche de quinze ans qu’il va aimer. Il faut lire les plus beaux morceaux de L’Amant à haute voix. On percevra mieux ainsi le rythme, la scansion, la respiration intime de la prose, qui sont les subtils secrets de l’écrivain. Dès les premières lignes du récit éclatent l’art et le savoir-faire de Duras, ses libertés, ses défis, les conquêtes de trente années pour parvenir à écrire cette langue allégée, neutre, rapide et lancinante à la fois capable de saisir toutes les nuances, d’aller à la vitesse exacte de la pensée et des images. Un extrême réalisme (on voit le fleuve, on entend les cris de Cholon derrière les persiennes dans la garçonnière du Chinois), et en même temps une sorte de rêve éveillé, de vie rêvée, un cauchemar de vie : cette prose à nulle autre pareille est d’une formidable efficacité. À la fois la modernité, la vraie, et des singularités qui sont hors du temps, des styles, de la mode. »-- François Nourissier (Le Figaro Magazine, 20 octobre 1984)« L’histoire est sombre, à demi-muette, jamais encore racontée ni écrite, inavouable en quelque sorte. C’est l’histoire vraie, si l’expression a un sens, celle où les romans, le théâtre, les films sont venus puiser, les uns après les autres. La source donc, sans fond ni forme, insaisissable : cette histoire plus romanesque, pourrait-on dire, que toutes les fictions qui en sont dérivées, plus silencieuse, plus absolue, exemplaire.Au commencement, une fille de quinze ans et demi, presque une enfant, dans un bac sur le Mékong. Ou plutôt, au commencement, une photo qui n’a pas été prise, celle d’un moment décisif qui fonde une manière de vivre et d’écrire. Un tournant, dit-on ; ici, une traversée. La photo d’une petite blanche, pensionnaire à Saïgon, l’écrivain à quinze ans, passant d’une rive à l’autre du Mékong. Le corps est frêle, sinon chétif, les cheveux nattés, la tenue, insolite, mélange de pauvreté et d’extravagance : une robe informe, des chaussures de bal en lamé or et un chapeau d’homme, “ un feutre souple couleur bois de rose au large ruban noir. ” Sous ce chapeau, un visage enfantin et précoce “ voyant ”, prémonitoire de ce qui l’attend de l’autre côté du fleuve, la vie, la jouissance, “ l’expriment. ”Un homme est là, qui la regarde, fumant une cigarette près de sa limousine noire et de son chauffeur. II est riche, jeune. Il est chinois. Il sera L’Amant. Non pas “ un ”, parmi d’autres, ni même “ mon ”, mais “ le ”, par essence ; par définition et préfiguration. L’Amant, celui qui donne son titre au livre, comme si seule sa position était claire et désignée. Il est celui qui aime, qui donne le plaisir, qui voudrait se marier, dont le père interdit la passion ; celui qui prodigue l’argent que “ la petite ” attend de lui, qu’elle donne à sa mère en juste réparation de la ruine familiale. Elle, de son côté ne dit rien, elle ne sait pas, impuissante à qualifier ce qu’elle vit. Sans mots d’amour à l’égard de L’Amant ; muette auprès de sa famille qui ignorera la vraie nature de cette relation ; silencieuse dans la colonie blanche que son comportement scandalise. Toute entière donc du côté de cette mère et de ces frères murés dans un “ silence génial ” ; proche, déjà, de ces femmes de l’œuvre, absentes à elles-mêmes, traversées par la parole comme si elle leur était étrangère, suspendues dans l’attente, le ravissement, la folie : Lol. V. Stein, Anne-Marie Stretter, Alissa et les autres, figures contradictoires de l’ignorance et du savoir, du manque et de la puissance.Serait-ce donc parce que certains mots n’ont jamais été dits, empêchés par une passion ancienne et terrible pour la mère, qu’ils ont pris dans l’œuvre tant de force, qu’ils ont formé ces phrases détachées, posées comme des objets dans l’espace, flottant de cette manière souveraine, somnambulique, presque impersonnelle qui est la leur ? Phrases d’un poids si particulier, si matériel, qu’elles peuvent se substituer aux images d’un film. Sur l’écran noir de L’Homme atlantique, les mots seuls, parce que dans l’expérience fondamentale, eux seuls auront manquer.Ces mots, les voici dans L’Amant, retrouvés comme on le dit de sa langue. Non pas qu’il y soit dit ce qui ne peut pas l’être – je t’aime, ou, elle l’aime, selon cette oscillation entre la troisième et la première personne qui est un des propres du livre – mais parce que l’écriture a cessé de vouloir se faire “ autour ”. Et qu’en n’allant pour ainsi dire nulle part, tout à coup, comme distraitement, elle se trouve. “ J’ai beaucoup écrit de ces gens de ma famille, mais tandis que je le faisais, ils vivaient encore, la mère et les frères, et j’ai écrit autour d’eux, autour de ces choses sans aller jusqu’à elles. ” Ici, la volonté n’est plus de ressaisir. De refaire à travers la fiction le monde comme on voudrait qu’il fût. Plus de crispation, plus rien de cet acharnement familial à construire des barrages, à obtenir réparation.L’histoire est terminée, voici l’oubli qui éloigne de cette mère : “ c’est fini, je ne me souviens plus. C’est pourquoi, j’écris si facile d’elle, maintenant, si long, si étiré, elle est devenue écriture courante. ” L’écriture atteint l’abandon de l’archer qui a perdu jusqu’à l’idée du but. La main s’ouvre comme à son insu, lâchant la corde. Tir sans visée. La flèche a volé jusqu’au centre.De là vient la grâce qui donne à ce livre son évidence inimitable. Son rayonnement, cette nécessité interne qui porte les phrases, les fait apparaître dans leur torsion, leurs raccourcis, leurs mouvements inattendus, comme ce qu’elles ne peuvent être et qu’elles sont pourtant : naturelles.Les mots retrouvés, l’expérience redécouvre en effet ce qu’elle aura été, infinie, totale. Un monde. À l’écrire de cette façon magnifiquement déréglée, libre, audacieuse, disparate, fragment après fragment, avec la même “ inconvenance fondamentale ” qui porte la petite à se vouloir en chaussures de bal et feutre d’homme, tout entre peu à peu dans le livre. Les temps, les lieux, la violence familiale et sa grandeur, les méfaits du frère aîné, la mort du petit, les bruits de Saïgon derrière le store, la fournaise, les oiseaux, la pension, Hélène Lagonelle, écho anticipé de Lol. V. Stein, d’autres femmes plus tard à Paris sous l’occupation, figures déplacées dans cette histoire et pourtant à leur place puisqu’ici, dans l’écriture comme dans la jouissance, “ tout est bon, il n’y a pas de déchets, les déchets sont recouverts, tout va dans le torrent, dans la force du désir. ” Tout est là, oui, le plus complexe et le plus contradictoire, dans leur nudité, au fil d’une écriture qui paraît d’autant maîtresse d’elle qu’elle est plus abandonnée, plus ingénue. Semblable à cette fille de quinze ans qui passe le fleuve à la rencontre de ce dont son visage porte déjà la trace, l’amour. »-- Marianne Alphant (Libération, 4 septembre 1984)« On se doutait bien qu’un jour on finirait par y aborder, au cœur de la Durasie ; que cette longue navigation de Gibraltar à Hiroshima, du Square à Calcutta, de romans en films, devait nous conduire là, à la caverne mère, à la grotte première, au cœur de la Durasie. On n’était pas trop pressé d’y parvenir, parce que cette contrée centrale, on la voyait toujours de partout affleurer, on y était déjà presque. Seulement presque, pourtant. Mais même quand il s’agissait de gens, de personnages, d’autres, les descriptions géographico-sentimentales des terres de Durasie étaient constamment écrites avec un je majuscule, un je qui s’affrontait seulement aux deux ou trois protagonistes fondamentaux, la Mère, les Frères et, sur les grands chemins de la souveraine folie, à une mendiante qui fut reine, en route vers Calcutta. Il serait temps plus tard de dire “ je ” de plein fouet, de mettre toute sa mise sur la mémoire nue. En attendant ce jour (il est venu avec L’Amant), Marguerite s’en retournait en sourdine en haute Durasie, sur les bords du Mékong, et elle en rapportait de magnifiques ou déconcertantes dépouilles, les portraits-souvenirs d’une Mère Courage érigée en barrage contre le Pacifique ? I’Eden-Cinéma de la mémoire, Savannaketh-en-lndochine et Savannah-Bay-en-Jadis, et ces romans, ces pièces, ces films (quelquefois les trois à la fois) où on rencontre beaucoup de héros et d’héroïnes mais dont le personnage central est, avant tout, une certaine façon de parler, I’inimitable ton de Marguerite Duras.Cette fois-ci, plus de rôles, plus de jeux avec le je. L’auteur se dénonce actrice, et si l’imaginaire resurgit, ses pans de brumes matinales, ses mirages de midi, ses ombres du crépuscule, c’est comme dans les jours de notre mémoire, où ce que nous sommes fait parfois vaciller ce que nous fûmes, où les éclipses de passé et les derniers quartiers de lune du présent troublent souvent le ciel nocturne. Entre la fin de son enfance, son adolescence et l’orée de sa jeunesse, Marguerite Duras se raconte Marguerite Duras, avec un intérêt vorace et détaché pour Marguerite, avec cet amour-passion de soi qui a la férocité tranquille des passions sûres d’elles-mêmes, si passionnées qu’elles peuvent supporter gaiement de s’entendre se dire toutes les vérités pas bonnes à dire, se traiter de tous les noms avec une tendresse tranquille, se décrire avec “ ce visage de I’alcool que j’ai attrapé dans l’âge moyen de ma vie ”, et se regarder dans les vertiges de la démesure avec le calme artisanal du peintre qui mesure ses moyens et calcule ses effets, afin d’obtenir avec précision l’imprécise sensation du délire. Marguerite Duras aura beaucoup aimé, entre autres choses, elle-même et la prose française. Elle les soumet, l’autre et l’une, aux épreuves de l’amour, qui ne sont pas toujours douceur.Il ne faut pas raconter L’Amant, pas davantage qu’on ne doit raconter un poème, parce que cette tranche de vie, ce noyau d’autobiographie est, comme tout ce qu’écrit Duras, construit comme un poème. Qui veut résumer un poème, il lui reste dans le creux de la main la cendre d’un argument, les débris d’un sujet. L’amour-conflit, I’amour-combat de la petite Marguerite pour sa mère, cette folle de Saigon, le grand frère voyou et le petit frère mort si tôt ; I’Amant milliardaire chinois, auquel on dirait qu’elle demande d’être celui qui l’arrachera à l’engluement dans le Grand Fond Malempia de la tribu natale, Marguerite Duras traite ces revenants en sorceresse, en évocatrice-conjuratrice. Elle les chante et les enchante avec les procédés qu’elle a mis au point pour faire surgir le poème dans le tissu de la prose : répétitions et retour d’images-rimes, litanies avec refrains, construction en écho et mouvements de spirale, ellipses et ruptures méditées de ton. Insidieuse avec les mots comme peut l’être le Wagner de Tristan avec les leitmotive. Violente, des tripes à la gorge, comme peut l’être Edith Piaf avec “ Je ne regrette rien ”. Émouvante comme le tremblement dans la voix de la vérité affrontée de la détresse transmuée en musique.Elle se regarde avoir été la jeune fille qui adorait-haïssait, embrassait-repoussait sa mère, la petite “ dévergondée ” que la grande limousine noire et le chauffeur en costume de coton blanc ramenaient en pleine nuit vers le dortoir du lycée, au retour de la garçonnière de L’Amant. Elle se regarde avec un étonnement à la fois émerveillé et distant, une glorieuse gourmandise narcissique. La nuit charrie les eaux sans fin des fleuves d’Asie, la rumeur du quartier chinois monte à travers les lattes des stores. Et la petite sauvagesse émergeant de l’enfance a déjà appris ce qui sera l’irréfragable noyau de sa vision du monde : qu’il n’y a pas de corps simples, que tout est double, ambivalent, contrarié, que la Mère c’est “ la saleté, ma mère, mon amour ” que l’amour c’est “ tu me tues, tu me fais du bien ”, que dans le cœur de l’homme un adjectif appelle aussitôt son contraire, et que tout être est l’agent double de lui-même.Qui a parlé d’impudeur ? Personne ? C’est bien. Car dans sa nudité – la nudité de l’émotion à sa source –, la narratrice est strictement vêtue par la haute couture de cette langue qu’on ne parle qu’en Durasie. Une parole dont le projet est (et parfois, dirait-on, à n’importe quel prix) de ne pas donner une seule seconde le sentiment du déjà-entendu, du déjà-lu. Cette torsion constante de la phrase, cette gymnastique volontaire de rafraîchissement du style, ce passage du naturel bouleversant au charabia cérémonieux, c’est Duras tout entière à la langue attachée. Cela donne parfois, mais rarement, la chair de poule du jargon trop précieusement abstrait : “ L’ambiguïté déterminante de l’image, elle est dans ce chapeau. ” Mais cela donne aussi, et plus souvent, le beau frisson d’une simplicité inouïe : “ L’air était bleu, on le prenait dans la main. ” Ou bien cette vision d’un navire appareillant puis prenant le large : “ La terre emportait la forme du bateau dans sa courbure. ” Et encore, par exemple, ce regard d’oiseau de haut vol sur les bras du Mékong : “ Dans la platitude à perte de vue, ces fleuves, ils vont vite, ils versent comme si la terre penchait. ”Car, s’il y a un amant que jamais Marguerite Duras n’oublia ni ne trahit, c’est l’autre-passion de sa vie, son métier d’écrivain, son art, I’usage émerveillé de sa parole. »-- Claude Roy (Le Nouvel Observateur, 31 août 1984)« (…) L’écriture de Duras ressemble à celle de l’amour. Je ne parle pas de la caresse soyeuse des phrases, ni des brassées du sentimental, ni de la nostalgie bariolée (tout ce qu’a ramassé le fleuve depuis le Tonlé-Sap). Non, je parle de tout ce qui s’entend sortir de là, de ce qu’a fait sourdre d’un simple récit autobiographique l’auteur de L’Homme assis dans le couloir et de La Maladie de la mort : une tenue stridente de l’infraction. On dit d’un art qu’il est “ consommé ” alors que précisément personne n’en voulait, ce qui veut dire qu’il arrive d’un seul coup, que rien n’avait averti qu’il arrivait, et puis aussi qu’il est si subitement là, la seule chose que personne n’attend ni ne demande : I’art. Ce n’est après qu’il est art... qu’on le consomme comme si de rien n’était. Mais avant, avant qu’il soit là d’un seul coup et que tout le monde le trouve normal, non seulement il n’existe pas, pas encore, mais il est une infraction intenable. Après on le case et on dit “ Tiens ! ” en le voyant dans un musée. Le sujet de ce livre n’est évidemment pas le fait qu’une jeune fille de famille coloniale fait l’amour avec un riche Chinois et qu’elle s’en souvient quelques décennies plus tard. Le sujet c’est le rejet, le silence, le meurtre déguisé et différé de l’écriture, la mère qui n’entend pas que sa fille veut écrire, I’arrachement, I’effondrement, la mort, la fuite, la défiguration, la peur (il est fait plusieurs fois écho à La Nuit du chasseur, le film de Laughton), la punition, la mort. La mort un peu partout (“ Je suis devant la porte fermée ”), et toutes les tueries qu’elle implique avant d’être là. »-- Denis Roche (Le Matin de Paris, 4 septembre 1984)« Par je ne sais quelle générosité qui est le signe des grands, I’auteur ne nous donne pas à contempler du dehors une belle histoire dont nous serions exclus, incapables, mais nous offre l’illusion que ce pourrait être la nôtre, que la nôtre mériterait le même embellissement indécis, que ça y est, elle en est éclairée du dedans, de cette lumière sans source que diffusent les brouillards. »-- Bertrand Poirot-Delpech (Le Monde, 1984)",
  "genres": [
    "Fiction",
    "France",
    "Romance",
    "French Literature",
    "Historical Fiction",
    "Literature",
    "Novels"
  ],
  "author": "Marguerite Duras",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/145542.L_Amant"
}