{
  "title": "The Three Worlds of the Witches",
  "description": "The Fourth Notch is, most definitely, a spy novel. Dr. Bill William's challenging childhood is a link connecting Bill to a twisted journey that eventually joins the clandestine path of espionage. Bill learned very early to duck and cover in avoiding the swinging arms of his angry father but Bill remains resistant to describe himself as an abused child. Bill maintains that his dad was a good provider, didn't drink excessively and was very much the same as his buddies' dads-oil field roughnecks and rodeos. Both of bill's parents died, one month apart, when Bill was ten years old. Cancer swiftly took both and Bill's dad sucked on his Old Gold cigarettes to his last wet, rasping breath. At ten years old as Bill became a planner and observer. He knew his life was over in the small town of Duncan, Oklahoma, but his ten year old logic had a plan; hide out as long as he could and, when discovered, hitch hike to California and live with Roy Rogers and Dale Evans. This was a beginning and Bill observed and planned his path through his teenage years, military, and college. Bill threw his plan book out the window when surviving the courtship of his soon-to-be wife, Alex. Very soon, unplanned teaching opportunities for couples in Saudi Arabia were considered and accepted. This, inadvertently, led to some dabbling in covert assignments and eventually a major mishap resulting in Bill's arrest in Saudi Arabia as an Israeli spy. Seven months later, Bill activated his plan to escape Saudi Arabia in an Arab dhow. After three weeks of sailing on the Red Sea, Bill approached the Sinai peninsula, was rescued by the Israeli coast guard and eventually delivered to the Mossad Director. Thus began a series of events resulting in Bill being thrust into CIA field agent training and his first assignment, back to Israel as a liaison officer at the American embassy in Tel Aviv. Bill's adventures continued",
  "genres": [],
  "author": "Mary Seaton",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/14555395-the-three-worlds-of-the-witches"
}