{
  "title": "Evolution: What the Fossils Say and Why It Matters",
  "description": "Over the past twenty years, paleontologists have made tremendous fossil discoveries, including fossils that mark the growth of whales, manatees, and seals from land mammals and the origins of elephants, horses, and rhinos. Today there exists an amazing diversity of fossil humans, suggesting we walked upright long before we acquired large brains, and new evidence from molecules that enable scientists to decipher the tree of life as never before.The fossil record is now one of the strongest lines of evidence for evolution. In this engaging and richly illustrated book, Donald R. Prothero weaves an entertaining though intellectually rigorous history out of the transitional forms and series that dot the fossil record. Beginning with a brief discussion of the nature of science and the \"monkey business of creationism,\" Prothero tackles subjects ranging from flood geology and rock dating to neo-Darwinism and macroevolution. He covers the ingredients of the primordial soup, the effects of communal living, invertebrate transitions, the development of the backbone, the reign of the dinosaurs, the mammalian explosion, and the leap from chimpanzee to human. Prothero pays particular attention to the recent discovery of \"missing links\" that complete the fossil timeline and details the debate between biologists over the mechanisms driving the evolutionary process.Evolution is an absorbing combination of firsthand observation, scientific discovery, and trenchant analysis. With the teaching of evolution still an issue, there couldn't be a better moment for a book clarifying the nature and value of fossil evidence. Widely recognized as a leading expert in his field, Prothero demonstrates that the transformation of life on this planet is far more awe inspiring than the narrow view of extremists.",
  "genres": [
    "Science",
    "Evolution",
    "Nonfiction",
    "Biology",
    "Palaeontology",
    "Geology",
    "History"
  ],
  "author": "Donald R. Prothero",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/1455499.Evolution"
}