{
  "title": "The Rape of Nanking: An Undeniable History in Photographs",
  "description": "In more than a half-century since the end of World War II, relatively little has been published about the Japanese occupation of China, during which an estimated 30 million Chinese were killed. The Rape of Nanking, or Nanking Massacre, in which at least 369,366 people were slaughtered and 80,000 women were raped by Japanese invasion troops, has become little more than a historical footnote in the West.The horror began on the morning of December 13, 1937, when the Japanese Imperial Army captured Nanking (Nanjing), which was then China's capital. Soldiers went through the streets indiscriminately killing Chinese men, women, and children without apparent provocation or excuse until in places the streets and alleys were littered with the bodies of their victims.Thousands of women were raped by Japanese soldiers; death was frequently the penalty for the slightest resistance by a victim or members of her family. Even large numbers of young girls and old women were raped throughout the city, and many cases of abnormal and sadistic behavior in connection with these rapes were reported. Many women were killed after the act and their bodies mutilated.For the next six weeks, while horrific rape continued, wholesale murder of male civilians was conducted with the apparent sanction of the Japanese high command. Hundreds of thousands of civilians and disarmed ex-soldiers were arrayed in formation, their hands bound behind their backs, and marched outside the city wall where, in groups, they were beheaded, or buried alive, or bayoneted, or raked with machine-gun fire, or doused with gasoline and burned.This book, using more than 400 historical photographs, many of which were taken by Japanese soldiers themselves, is published to commemorate the sixtieth anniversary of the Rape of Nanking, to remind the world of the forgotten holocaust of WWII, and to honor history and answer any attempt to deny or change it.",
  "genres": [
    "History",
    "Nonfiction",
    "Gender",
    "Japan",
    "China",
    "War",
    "Gender Studies"
  ],
  "author": "James Yin",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/1455493.The_Rape_of_Nanking"
}