{
  "title": "Forks Over Knives—The Cookbook: Over 300 Simple and Delicious Plant-Based Recipes to Help You Lose Weight, Be Healthier, and Feel Better Every Day",
  "description": "\"Forks Over Knives,\" both the documentary and companion book, appeared on the scene in 2011 with an astonishing but simple claim: Following a fully plant-based diet can save your life. By avoiding meat, fish, eggs, dairy, and emphasizing whole, unrefined plant foods, millions of people have begun to notice staggering improvements to their physical fitness, weight, blood sugar and cholesterol levels, lifestyle, and overall health--including preventing, managing, or recovering from illnesses like diabetes, heart disease, and even cancer. Yes, the bestselling book \"Forks Over Knives: The Plant-Based Way to Health\" includes a solid foundation of recipes for anyone newly aware of the benefits to be gained from a plant-based diet. But home cooks are hungry for even more delicious, satisfying, from-scratch recipes full of whole plant foods like grains, legumes, fruits, and vegetables. That's what this cookbook provides: A full year's worth of meals for anyone hoping to cut out animal products, refined oils, and processed foods for the sake of their health. The recipes are eclectic, global, low fat, often gluten free, and simple to prepare, relying on common ingredients that anyone can find in their local grocery store. These recipes will take readers through an entire year with recipes that rely often on seasonal produce and always on the fundamental building blocks of a plant-based diet. Covering breakfast, lunch, dinner, and even desserts and ranging from everyday classics like Mac and Cheese and Baked Ziti to festive, holiday-ready dishes like Chard and Bean Stuffed Delicata Squash, these recipes will prepare readers to cook the plant-based way every day--starting this year and continuing through a long and healthy life.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction",
    "Health",
    "Vegan",
    "Reference"
  ],
  "author": "Del Sroufe",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/14556629-forks-over-knives-the-cookbook"
}