{
  "title": "Everyone Who Is Gone Is Here: The United States, Central America, and the Making of a Crisis",
  "description": "An epic, heartbreaking, and deeply reported history of the disastrous humanitarian crisis at the southern border told through the lives of the migrants forced to risk everything and the policymakers who determine their fate, by New Yorker staff writer Jonathan BlitzerEveryone who makes the journey faces an impossible choice. Hundreds of thousands of people who arrive every year at the US-Mexico border travel far from their homes. An overwhelming share of them come from El Salvador, Guatemala, and Honduras, although many migrants come from farther away. Some are fleeing persecution, others crime or hunger. Very often it will not be their first attempt to cross. They may have already been deported from the United States, but it remains their only hope for safety and prosperity. Their homes have become uninhabitable. They will take their chances.This vast and unremitting crisis did not spring up overnight. Indeed, as Blitzer dramatizes with forensic, unprecedented reporting, it is the result of decades of misguided policy and sweeping corruption. Brilliantly weaving the stories of Central Americans whose lives have been devastated by chronic political conflict and violence with those of American activists, government officials, and the politicians responsible for the country’s tragically tangled immigration policy, Blitzer reveals the full, layered picture for the first time.Everyone Who Is Gone Is Here is an odyssey of struggle and resilience. With astonishing nuance and detail, Blitzer tells an epic story about the people whose lives ebb and flow across the border, and in doing so, he delves into the heart of American life itself. This vital and remarkable story has shaped the nation’s turbulent politics and culture in countless ways—and will almost certainly determine its future.",
  "genres": [
    "Nonfiction",
    "History",
    "Politics",
    "Social Justice",
    "Race",
    "Audiobook",
    "American History"
  ],
  "author": "Jonathan Blitzer",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/145624514-everyone-who-is-gone-is-here"
}