{
  "title": "The Pregnant Widow",
  "description": "The 1960s, as is well known, saw the launch of the sexual revolution, which radically affected the lives of every Westerner fortunate enough to be born after the Second World War. But a revolution is a revolution - contingent and sanguinary. In the words of the Russian thinker Alexander Herzen: The death of the contemporary forms of social order ought to gladden rather than trouble the soul. Yet what is frightening is that what the departing world leaves behind it is not an heir but a pregnant widow. Between the death of the one and the birth of the other, much water will flow by, a long night of chaos and desolation will pass. In many senses, including the literal, it was a velvet revolution; but it wasn't bloodless. Nor was it complete. Even today, in 2009, the pregnancy is still in its second trimester. Martin Amis, in The Pregnant Widow, takes as his control experiment a long, hot summer holiday in a castle in Italy, where half a dozen young lives are afloat on the sea change of 1970. The result is a tragicomedy of manners, combining the wit of Money with the historical sense of Time's Arrow and House of Meetings.It was summer 1970 - a long, hot summer. In a castle in Italy, half a dozen young lives are afloat on the sea of change, trapped inside the history of the sexual revolution. The girls are acting like boys, and the boys are going on acting like boys, and Keith Nearing - twenty years old, a literature student all clogged up with the English novel - is struggling to twist feminism and the rise of women towards his own ends. The sexual revolution may have been a velvet revolution (in at least two senses), but it wasn't bloodless - and now, in the twenty-first century, the year 1970 finally catches up with Keith Nearing. \"The Pregnant Widow\" is a comedy of manners and a nightmare, brilliant, haunting and gloriously risque. It is the most eagerly anticipated novel of the year and Martin Amis at his fearless best.About the AuthorMartin Amis is the author of ten novels, the memoir Experience, two collections of stories and six collections of non-fiction, most recently The Second Plane. He lives in London.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Historical Fiction",
    "British Literature",
    "Italy",
    "Novels",
    "Literary Fiction"
  ],
  "author": "Martin Amis",
  "average_rating": "3.08",
  "url": "https://www.goodreads.com/book/show/1456757.The_Pregnant_Widow"
}