{
  "title": "France in Centrafrique: From Bokassa and Operation Barracude to the Days of EUFOR",
  "description": "France in Centrafrique explores the pre- and post-colonial history of the Republic of Central Africa as well as giving the reader a taste of the country's involvement in WWII itself. The main focus of this volume is on Central Africa's independence and the rise to power of Jean Bedel Bokassa including the Focard network and Françafrique connections, France's military links with RCA (defense agreements), the republic's post independence military, its politics and Bokassa's coup. It takes a staggering look at Central Africa under Bokassa's leadership and the ensuing break down in its relationship with France. Operation Baracuda was the natural culmination of that soured relationship and in this book de Cherisey examines \"France's last colonial expedition\", the planning of the operation, its players, a step-by-step breakdown and its outcome.To bring the reader up to speed with the RCA de Cherisey discusses the years after Bokassa, a new political rule, the effects on the army and the relationship with France all the way to Operation Almandin I, II and III. France's involvement in the RCA is deep-seated and ongoing. This book concludes with a look at Operation Boali, Bozizé's coup and the international fallout in terms of further intervention both from France and the EUFOR.Peter Baxter is an author, amateur historian and African field, mountain and heritage travel guide. Born in Kenya, Peter has lived and travelled over much of southern and central Africa. He was educated in Rhodesia (Zimbabwe), leaving the country after independence for an extended bout of travel before returning in 1989. Since then he has guided in all the major mountain ranges south of the equator, helping develop the concept of sustainable travel, and the touring of battlefield and heritage sites in East Africa. Peter lives in the United States, working on the marketing of African heritage travel as well as a variety of book projects. His interests include British Imperial history in Africa and the East Africa campaign of the First World War in particular. He is married with three children.",
  "genres": [
    "Africa",
    "History",
    "Military History"
  ],
  "author": "Peter Baxter",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/14568626-france-in-centrafrique"
}