{
  "title": "Crossing the Water: Eighteen Months on an Island Working With Troubled Boys -- A Teacher's Memoir",
  "description": "It's a rare pleasure when a new author shows not only notable talent, but the skill and chutzpah to go where no one else has gone before. Daniel Robb takes a subject that many have considered but few understood--juvenile delinquents--and writes about it with rare insight. For a year and a half, Robb was a teacher on Penikese Island, off Cape Cod, where teenage boys are sent by the courts and social services to put six months between themselves and their chaotic daily lives. During this time they experience safety, a routine, hard work, and the decency and constancy of adults better adjusted than the ones they've known. The place is less a school, Robb writes, than \"a family, or a way of life, a rhythm, a discipline, a music, with many voices of boys competing with my own for ownership of the tale.\" The boys have varied résumés: Mose shot a man who threatened him one night; Edward torched a boat for money; Alan is the king of substance abuse; Burt's parents have both been in jail since he was 7. But Robb finds that they all have a number of things in common--childhoods fraught with so many uncertainties that they never learned cause and effect, the lack of a father's guidance--the same things, it turn out, that plague Robb's own heart. Robb has a gift for evoking their natural surroundings on the island in a language that resembles poetry while capturing the cadences and tribulations of his surly yet charming students with perfect pitch and clear-eyed sympathy. Not only does the dichotomy make for compelling reading, it works on the kids as well: Ned, the longhaired metalhead, gives CPR to a mouse and actually revives it; Wyatt, who stole cars out of boredom, considers his absent father's legacy after reading a Gary Snyder poem. Robb is a literary voyager in the most unlikely of places, and, in the end, reveals that even boys such as these have a poetry all their own. --Lesley Reed",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Education",
    "Biography"
  ],
  "author": "Daniel Robb",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/1457748.Crossing_the_Water"
}