{
  "title": "Government Bullies: How Everyday  Americans Are Being Arrested, Abused, and Terrorized By the Feds",
  "description": "Government regulations are out of control. They dictate how much water goes into your commode, and how much water comes out of your showerhead. They determine how hot the water needs to be in your washing machine, and how many miles to the gallon your car must achieve. Since the Patriot Act, your banking records, your gun registration, and your phone bill are easily accessible by government snoops. Mothers are arrested for buying raw milk. Families are fined for selling bunny rabbits without a license. Home and property owners are strapped with obscene fines, entangled in costly legal messes, and sent to federal prison, all for moving dirt from one end of their land to another. Unelected bureaucrats, armed with arbitrary rules and no need to back them up, stonewall and attack American citizens at every turn. The damage can be overwhelmingly taxing -- -financially, emotionally and even physically.And who is being held accountable? Government regulation and red tape run amok in Washington, and honest, tax-paying citizens are the victims of an administration's misuse and abuse of power. Now, Senator Rand Paul of Kentucky, takes an in-depth look at the legislation that is trampling the rights of ordinary citizens, strangling their ability to conduct private, everyday activities without egregious government interference. He highlights outrageous searches, seizures and arrests, and points to thousands of regulations that have been added to the books since Obama took office. Most importantly, he charts a direction out of this mess, and toward renewed freedom for all Americans.These stories are of everyday Americans badgered and harassed by their own government -- -the very institution that is supposed to serve us all. This gross breach of our constitution is as frightening as it is real, and Goverment Bullies is a call to action against it.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History"
  ],
  "author": "Rand Paul",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/14583508-government-bullies"
}