{
  "title": "Look Away!: A History of the Confederate States of America",
  "description": "William C. Davis, one of America's best Civil War historians, here offers a definitive portrait of the Confederacy unlike any that has come before. Drawing on decades of writing and research among an unprecedented number of archives, Look Away! tells the story of the Confederate States of America not simply as a military saga (although it is that), but rather as a full portrait of a society and incipient nation. The first history of the Confederacy in decades, the culmination of a great scholar's career, Look Away! combines politics, economics, and social history to set a new standard for its subject.Previous histories have focused on familiar commanders such as Robert E. Lee and Stonewall Jackson, but Davis's canvas is much broader. From firebrand politicians like Robert Barnwell Rhett and William L. Yancey, who pushed for secession long before the public supported it; to Dr. Samuel Cartwright, who persuaded many Southerners of the natural inferiority of their slaves; to the women of Richmond, who rioted over bread shortages in 1863, Davis presents a rich new face of the Confederate nation. He recounts familiar stories of battles won and lost, but also little-known economic stories of a desperate government that socialized the salt industry, home-front stories of the rangers and marauders who preyed on their fellow Confederates, and an account of the steady breakdown of law, culminating in near anarchy in some states. Never has the Confederacy been so vividly brought to life as a full society, riven with political and economic conflicts beneath its more loudly publicized military battles.Davis's astonishingly thorough primary research has ranged across the 800-odd newspapers that were in operation during the war, but also across the personal papers of over a hundred Southern leaders and ordinary citizens. He quotes from letters and diaries throughout the narrative, revealing the Confederacy through the words of the Confederates themselves. Like any society, especially in the early stages of nation-building and the devastating stages of warfare, the Confederacy was not one thing but many things to many people. One thing, however, was shared by all: the belief that the South offered a necessary evolution of American democracy. Look Away! offers a dramatic and definitive account of one of America's most searing episodes.",
  "genres": [
    "History",
    "Civil War",
    "Nonfiction",
    "American History",
    "American Civil War",
    "Politics",
    "19th Century"
  ],
  "author": "William C. Davis",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/1458533.Look_Away_"
}