{
  "title": "The Image & Other Stories",
  "description": "“The storyteller and poet of our time, as in any other time, must be an entertainer of the spirit in the full sense of the word,” Mr. Singer stated in his Nobel Prize address. In this new collection, The Image and Other Stories, he practices what he preaches. The twenty-two entertaining stories range in time from the old days in Warsaw—as in “A Nest Egg for Paradise,” which shows how a pious soul escapes a sinful trap—to recent years in America, as in “Confused,” the comic portrait of an author pursued by admirers eager to share his bed as well as his fame.“One Day of Happiness,” the story of a young girl who writes a love letter to a Polish general, ends in unforeseen horror. “The Conference” is a satirical portrait of leftist politics and sex as practiced by Flora, the darling of opposing splinter groups. Aunt Yentl is the narrator of classics like “The Mistake,” an account of what happens to a girl who marries a fool; “Strong as Death Is Love,” an amazing tale of fidelity in marriage even after death; and “The Secret,” an incredible story of a girl who unwittingly marries her father. The events of “Loshikl” are narrated in jail by an experienced and philosophical felon, and “The Litigants” reveals how two stubborn Polish squires unexpectedly settle their lawsuit. “A Telephone Call on Yom Kippur” appears to be a story of the supernatural but isn’t, and a slap in the face serves as the theme of “The Bond.” The title story, “The Image,” shows how the memory of a unique love falls like a shadow between a newly married couple.As Joyce Carol Oates has said, “Singer is distinctive and original…One comes away from his books with their grotesque people and events, their whiff of the grave and of the diabolic, with a sense of optimism.” This new book by a storytelling genius is an impressive addition to his masterly series of short stories.",
  "genres": [
    "Short Stories",
    "Fiction"
  ],
  "author": "Isaac Bashevis Singer",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/1458743.The_Image_Other_Stories"
}