{
  "title": "Classical Living: Reconnecting with the Rituals of Ancient Rome",
  "description": "Enhance your life using the riches of the Roman tradition. An authority on ancient Roman culture, Frances Bernstein shows you how to draw on the wisdom, history, myths and ancient prayers that were a part of everyday Roman life to achieve abundance and serenity in your own. This beautiful volume combines delectable recipes such as fava bean salad for good digestion and a healthy body with rituals such as water healing in a luxurious bath to nurture oneself and to honor the deities who rule each month. As the author illustrates, \"Sexuality, fertility, nature, and spirituality were so closely interwoven in antiquity that it was difficult for the ancient pagan to imagine them apart.\"From autumn's introspective thresholds and winter's purification rituals to the warm fullness of spring and the bittersweet heat of summer, Bernstein shares stories of ancient Roman practices and festivals and offers modern rituals to help you create meaningful, new traditions of your own. In January, give gifts of warm honey cake to banish darkness, instill good will, and bring about harmonious relationships. Honor Bacchus, the god of March, and Liberalia with a rustic wine tasting, and celebrate Venus, the goddess of April, with a sensuous bath brimming with floating rose petals. Remember the fate of Adonis in July with celebrations of renewal, or design a sacred landscape in your garden with fountains, bells, altars, and blossoming flowers to please the goddess Flora.With poetry, wisdom, and historical insight, Frances Bernstein offers Roman traditions and rituals for modern spiritual practice, making Classical Living an inviting source to treasure throughout the year.",
  "genres": [
    "Mythology",
    "History",
    "Reference",
    "Paganism",
    "Religion"
  ],
  "author": "Frances Bernstein",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/1459608.Classical_Living"
}