{
  "title": "The Man Called Brown Condor: The Forgotten History of an African American Fighter Pilot",
  "description": "How did a black child, growing up in segregationist Mississippi during the early 1900s, become the commander of the Imperial Ethiopian Air Corps during the brutal Italo-Ethiopian War of 1935? In this gripping, never-before-told tale, biographerThomas E. Simmons brings to life Robinson's outstanding success in becoming a pilot, his expertise in building and assembling his own working aircraft, his influence on the establishment of a school of aviation at Tuskegee Institute (there would have been no Tuskegee Airmen without him), and his courageouswartime service in Ethiopia during the Italian invasion in 1935, for which he won international fame. It was during Robinson's service to Ethiopia that he took to the air to combat the first Fascist invasion of what would become World War II. This remarkable hero may have been the first American to oppose Fascism in combat. When Ethiopia was freed by British troops during World War II, Haile Selassie asked Robinson to return to Ethiopia to help reestablish the Ethiopian Air Force. For Robinson and the five men he picked to go with him, just getting to Ethiopia in wartime 1944 was an adventure in itself.Over the last twenty-three years, the author has performed original research on John C. Robinson when very little information on this remarkable American hero was available. 'The Man Called Brown Condor' encompasses a vast amount of information based on obscure, forgotten, and heretofore undiscovered facts.This work is more than the definitive biography of an African American pilot who became a US hero, only to be unfairly forgotten. It provides insight on racial conditions in the first half of the twentieth century and illustrates the political intrigue within a League of Nations afraid to face the rise of Fascism. The Man Called Brown Condor is a new, exciting, heroic adventure in history, and provides the reader with an unforgettable story of an incredible American hero.",
  "genres": [
    "Nonfiction",
    "History",
    "Aviation",
    "Biography",
    "Ethiopia",
    "Africa",
    "War"
  ],
  "author": "Thomas E. Simmons",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/14603166-the-man-called-brown-condor"
}