{
  "title": "On the Trail of the Assassins: One Man's Quest to Solve the Murder of President Kennedy",
  "description": "The New York Times Bestseller. about the search for the assassins of JFK. “Garrison’s book presents the most powerful detailed case yet made that President Kennedy’s assassination was the product of a conspiracy, and that the plotters and key operators came not from the Mob, but the CIA.”—Norman MailerMore than fifty years after the assassination of President John F. Kennedy, his murder continues to haunt the American psyche and stands as a turning point in our nation’s history.The Warren Commission rushed out its report in 1964, but questions continue to Was there a conspiracy? Was there a coup at the highest levels of government?On March 1, 1967, New Orleans district attorney Jim Garrison shocked the world by arresting local businessman Clay Shaw for conspiracy to murder the president. His alleged co-conspirator, David Ferrie, had been found dead a few days before. Garrison charged that elements of the United States government, in particular the CIA, were behind the crime. From the beginning, his probe was virulently attacked in the media and violently denounced from Washington. His office was infiltrated and sabotaged, and witnesses disappeared and died strangely. Eventually, Shaw was acquitted after the briefest of jury deliberation and the only prosecution ever brought for the murder of President Kennedy was over.On the Trail of the Assassins —the primary source material for Oliver Stone’s hit film JFK —is Garrison’s own account of his investigations into the background of Lee Harvey Oswald and the assassination of President Kennedy, and his prosecution of Clay Shaw in the trial that followed.",
  "genres": [
    "History",
    "Nonfiction",
    "True Crime",
    "Politics",
    "Conspiracy Theories",
    "Crime",
    "Historical"
  ],
  "author": "Jim Garrison",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/14603205-on-the-trail-of-the-assassins"
}