{
  "title": "The Great Oil Conspiracy: How the U.S. Government Hid the Nazi Discovery of Abiotic Oil from the American People",
  "description": "\"Jerry Corsi may just be the best investigative journalist working today and this incredible book proves it.\"—Roger Stone, New York Times bestselling authorAt the end of World War II, U.S. intelligence agents confiscated thousands of Nazi documents on what was known as the “Fischer-Tropsch Process”—a series of equations developed by German chemists unlocking the secrets of how oil is formed. When the Nazis took power, Germany had resolved to develop enough synthetic oil to wage war successfully, even without abundant national oil reserves. For decades, these confiscated German documents remained largely ignored in a United States where petro-geologists and petro-chemists were convinced that oil was a “fossil fuel” created by ancient decaying biological debris.Clearly, big U.S. oil companies had no financial interest in explaining to the American people that oil was a natural product made on a continual basis deep within the earth. If there were only so many fossils in geological time, there could only be so much oil. Big oil could then charge more for a finite, rapidly disappearing resource than for a natural, renewable, and probably inexhaustible one.The Great Oil Conspiracy explains how Stalin at the end of World War II demanded his petro-geologists “dig deeper” when petro-scientists in the United States had determined that the Soviet Union, like Germany, lacked national oil reserves. Russia today has challenged Saudi Arabia for the lead in oil production and exportation. Once oil is understood as an abundantly available resource, there is no reason hydro-carbon fuels cannot indefinitely propel the development and production of cheap energy reserves the United States needs to maintain its dominant position in the emerging global economy.",
  "genres": [
    "History",
    "Conspiracy Theories",
    "Nonfiction",
    "Politics"
  ],
  "author": "Jerome R. Corsi",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/14603086-the-great-oil-conspiracy"
}