{
  "title": "King Ottokar's Sceptre",
  "description": "The Adventures of Tintin (Les Aventures de Tintin) is a series of comic strips created by Belgian artist Herge the pen name of Georges Remi (1907 1983). The series first appeared in French in Le Petit Vingtieme, a children's supplement to the Belgian newspaper Le Vingtieme Siecle on 10 January 1929. Set in a painstakingly researched world closely mirroring our own, Herge's Tintin series continues to be a favorite of readers and critics alike 80 years later.The hero of the series is Tintin, a young Belgian reporter. He is aided in his adventures from the beginning by his faithful fox terrier dog Snowy (Milou in French). Later, popular additions to the cast included the brash, cynical and grumpy Captain Haddock, the bright but hearing-impaired Professor Calculus (Professeur Tournesol) and other colorful supporting characters such as the incompetent detectives Thomson and Thompson (Dupond et Dupont). Herge himself features in several of the comics as a background character; as do his assistants in some instances. The success of the series saw the serialized strips collected into a series of albums (24 in all), spun into a successful magazine and adapted for film and theatre. The series is one of the most popular European comics of the 20th century, with translations published in over 50 languages and more than 200 million copies of the books sold to date. The comic strip series has long been admired for its clean, expressive drawings in Herge's signature ligne claire style. Engaging, well-researched plots straddle a variety of swashbuckling adventures with elements of fantasy, mysteries, political thrillers, and science fiction. The stories within the Tintin series always feature slapstick humor, accompanied in later albums by sophisticated satire, and political and cultural commentary.Steven Spielberg movie of this title coming December 2011:",
  "genres": [
    "Comics",
    "Graphic Novels",
    "Bande Dessinée",
    "Adventure",
    "Fiction",
    "Childrens",
    "Graphic Novels Comics"
  ],
  "author": "Hergé",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/146108.King_Ottokar_s_Sceptre"
}