{
  "title": "From Poverty to Poverty: A Scotsman Encounters Canada",
  "description": "Raised by a single mother on welfare during the 1930's depression and World War II in the Scottish Highlands, Ian spends his childhood trying to get enough to eat and stay warm. During an adolescence apprenticed to a drunken blacksmith, he also begins a lifelong love affair with music-making while wavering between the strictures of the Salvation Army and the \"worldly pleasures\" of the outside world. Life begins to improve when Ian enters the Royal Air Force, serving five years as an aircraft engine mechanic and bandsman in the United Kingdom and then Egypt. In the latter, he experiences the consequences of the Arab \"walkouts\" that eventually led to the Suez Canal crisis. Most hilarious is his tale \"Jig-a-Jig in the Desert\" when the small military water treatment plant he supervises is invaded by Arab prostitutes. Returning to Britain, he marries his pen-pal, Mary, completes his military career and enters into civilian life, finally settling on his lifetime career as a machinist. Two daughters are born, one of whose life is saved at birth by a bottle of Scotch whisky. Despite getting established in Scotland, Ian gets \"itchy feet\" and thinks of emigrating. Misled by the inflated promises of an unscrupulous Government of Ontario official to choose Canada over Australia, Ian, Mary and the girls endure a winter sailing over the Atlantic in 1965, including a collision in the St. Lawrence Seaway. Ian and Mary struggle to adjust and to learn and speak \"Canadian.\" Their daughters, however, are sounding like Canadian children within a few weeks Misadventures in finding and keeping jobs and a suitable place to live in Canada lead Ian to conclude that he has only moved \"from poverty to poverty.\" Will he be able to survive and eventually thrive in this new land?",
  "genres": [],
  "author": "Ian Moore-Morrans",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/14609822-from-poverty-to-poverty"
}