{
  "title": "Pericles",
  "description": "Controversy has surrounded Pericles for centuries, due to the fact that critics and editors have argued that much of the play was written between 1607 and 1608 by one of Shakespeare's inferior collaborators, and that it shows in both its style and content. However, Shakespeare was clearly the driving force behind the play, and it is important to remember that it was one of the most popular plays of its time. In the Arden Shakespeare Third Series edition, Suzanne Gossett gives readers a detailed introduction to the probable circumstances by which this anomaly of the Shakespeare canon was created, but also provides a thorough critical interpretation of the text, its characters, and its themes. A doubling chart for casting is included as an appendix.The Arden Shakespeare has developed a reputation as the pre-eminent critical edition of Shakespeare for its exceptional scholarship, reflected in the thoroughness of each volume. An introduction comprehensively contextualizes the play, chronicling the history and culture that surrounded and influenced Shakespeare at the time of its writing and performance, and closely surveying critical approaches to the work. Detailed appendices address problems like dating and casting, and analyze the differing Quarto and Folio sources. A full commentary by one or more of the play's foremost contemporary scholars illuminates the text, glossing unfamiliar terms and drawing from an abundance of research and expertise to explain allusions and significant background information. Highly informative and accessible, Arden offers the fullest experience of Shakespeare available to a reader.Table of ContentsList of illustrationsGeneral Editors' preface Preface INTRODUCTION'Everyone with claps can sound': the popularity of Pericles 'Incke, and paper': text and printing history The condition of Q Proposed explanations for Q Early reprints 'To foster is not always to preserve': editing Pericles The editorial task Editing and interpretation 'Her art sisters the natural roses': the creation of Pericles 'Winged time': date and circumstances 'Fit counsellor and servant for a prince': evidence for collaboration 'From ashes ancient Gower is come': sources of Pericles 'What pageantry, what feats, what shows': the theatrical context 'The stages of our story': Gower and the structure of Pericles 'It hath been sung at festivals': production history Interpretation and critical history 'The heavens through you increase our wonder': reading Pericles ideologically 'A book of all that monarchs do': reading Pericles politically 'Hark you, sir, do you know where ye are?': reading Pericles geographically 'You not your child well-loving': reading Pericles through the family 'Make us love your goodly gifts: Pericles and the gift 'Her way to go with warrant': imperatives for a conclusion Collaboration, one last time PERICLES, PRINCE OF TYRE Longer notesAppendix on casting  Doubling chart Abbreviations and References  Abbreviations Used in Notes Works By and Partly By Shakespeare Editions of Shakespeare Collated Other Works Cited Modern Productions CitedIndex",
  "genres": [
    "Plays",
    "Classics",
    "Drama",
    "Fiction",
    "Theatre",
    "Poetry",
    "Literature"
  ],
  "author": "William Shakespeare",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/104816.Pericles"
}