{
  "title": "James Fenimore Cooper: The Leatherstocking Tales: Volume One",
  "description": "The five novels in The Leatherstocking Tales (collected in two Library of America volumes), Cooper’s great saga of the American wilderness, form a pageant of the American frontier. Cooper’s hero, Natty Bumppo, is forced ever farther into the heart of the continent by the advance of civilization that he inadvertently serves as advance scout, missionary, and critic. Praised by Balzac, Melville, and D. H. Lawrence, The Leatherstocking Tales narrates the conflict of nations (Indian, English, French, and American) amid the dense woods, desolate prairies, and transcendent landscapes of the New World.Leatherstocking first appears in The Pioneers (1823), as an aged hunter living on the fringe of settlement near Templeton (Cooperstown), New York, at the end of the eighteenth century. There he becomes caught in the struggles of party, family, and class to control the changing American land and to determine what sort of civilization will replace the rapidly vanishing wilderness. When Natty Bumppo started an American tradition by setting off into the sunset at the novel’s close, one early reader said, “I longed to go with him.”The Last of the Mohicans (1826) is a pure unabashed narrative of adventure. It looks back to the earlier time of the French and Indian Wars, when Natty and his two companions, Chingachgook and Uncas, survivors of a once-proud Indian nation, attempt a daring rescue and seek to forestall the plan of the French to unleash their Mingo allies on a wave of terror through the English settlements.The Prairie>/em> (1827) takes up Natty in his eighties, driven by the continuous march of civilization to his last refuge on the Great Plains across the Mississippi. On this vast and barren stage, the Sioux and Pawnee, the outlaw clan of Ishmael Bush, and members of the Lewis and Clark expedition enact a romantic drama of intrigue, pursuit, and biblical justice that reflects Cooper’s historical dialectic of culture and nature, of the American nation and the American continent.",
  "genres": [
    "Fiction",
    "Classics",
    "Historical Fiction",
    "American",
    "Literature",
    "Anthologies",
    "19th Century"
  ],
  "author": "James Fenimore Cooper",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/14616.James_Fenimore_Cooper"
}