{
  "title": "Military Orders",
  "description": "Matt was the solid one of his family - successful student, good husband and father, devoted missionary. The rock on which many churches would have been built.By contrast, elder brother Rafa is the troublemaker – sharp-tongued and only too well aware of his gifts, a broken marriage, estranged from his parents.But when Matt is murdered in northern India by an unknown assailant, it is Rafa who must investigate.And it is in India where he learns that the local police are claiming Matt was leader of a gang engaged in the theft and sale of precious temple artworks.Rafa knows these allegations to be false. Yet it quickly becomes apparent that Matt was involved in something much bigger than simple mission work. But what?The answer, when it comes, is chilling. For Matt was part of a clandestine project with the potential to change the future course of world religion. And now Rafa must complete the assignment.This stirring thriller, third in the Military Orders series, moves at breakneck speed from Dharamsala – northern Indian home of the Dalai Lama – to Prayer Mountain in South Korea and the sacred Australian mountain-rock of Uluru. (Cover design by Romit Berger.)Praise for Martin Roth’s thriller “Prophets and Loss”:“A thrilling ride that begins as a story of murder and revenge and ends as a reflection on loss and forgiveness....Fast-paced and edgy.” - SydneyAnglicans.net“Wow!.…When “Prophets and Loss” arrived…I certainly wasn’t expecting a meaty murder mystery cum terrorist plot. And when I realized that’s what it was, I certainly wasn’t then expecting Roth’s Johnny Ravine mystery to deliver such a fabulous gospel message….This is a great book for a Christian or as a starter for a non-Christian. A fabulous surprise.” - The Presbyterian PulsePraise for Martin Roth’s thriller “Hot Rock Dreaming” (a finalist in the 2011 Australian Christian Book of the Year awards):“Roth is a Christian author and, although spiritual warfare is crucial to the plot, this book is still a murder mystery…Thought-provoking and an enjoyable read.” – On Fire“Highly readable…You will be both entertained and educated.” – JourneyAbout the Martin Roth (www.military-orders.com) is a veteran journalist and foreign correspondent whose reports from Asia have appeared in leading publications around the world, including the Wall Street Journal, Los Angeles Times, Chicago Tribune and Baltimore Sun. He is the author of many books.The first three thrillers in his Military Orders series are “Brother Half Angel,” “The Maria Kannon” and “Military Orders.” He is also the author of the Johnny Ravine private eye series, with “Prophets and Loss,” “Hot Rock Dreaming” (a finalist in the 2011 Australian Christian Book of the Year awards) and “Burning at the Boss.” He lives in Australia with his Korean wife and three sons.",
  "genres": [
    "Fiction"
  ],
  "author": "Martin Roth",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/14622440-military-orders"
}