{
  "title": "Missing Pieces",
  "description": "Love may be only a story, but stories are the greatest things in the world.From the dawn of time to the end of everything, the Doctor has fought against evil, challenged the darkness, righted wrongs and saved the occasional planet from disaster. And now, together with his faithful companions and his trusty TARDIS, the mysterious Time Lord from Gallifrey ventures forth on an all-new campaign for truth, freedom and a hot cup of tea, in this landmark charity collection featuring contributions from four actors from the long-running series, over thirty professionally-published writers, sixty prominent fan writers and a plethora of talented artists.Join the First Doctor as he witnesses the Charge of the Light Brigade; the Seventh Doctor as he faces intrigue in ancient Antioch and injustice in Nazi-era Poland; and the Sixth Doctor's adventures in shopping malls. Be witness to the Fourth Doctor's battles against a murderous fury in modern London and a savage gangster war in 1950's Las Vegas. The Third Doctor's love/hate relationship with a clever white witch, and his perpetual game of chess with an old foe. The Second Doctor's encounters with Hollywood legends and time traveling filmmakers. The Fifth Doctor's adventures in a Florida retreat. The Eighth Doctor's sabbatical in the fine arts with Leonardo da Vinci. And the personal demons the wandering Time Lord faced before he left Gallifrey — before the mythos began....The adventures span the universe: The Master's fiendish plot against a people in Paradise. The daring quest of the rogue Tharil Time Lord, Romana. Anji Kapoor's near-miss with the Sixth Doctor. The horrific truth behind the transformation of Kamelion. The apocryphal adventures of the young handmaiden Katarina. Benny Summerfield and her forgotten loves. A very peculiar visit with Iris Wildthyme. Nyssa's brush with showbusiness. Sara Kingdom's last great adventure. The timeless relationship between Samantha Jones and the soulmate she left behind. A game of golf with the mysterious Dominie and Alice, the Doctor and Ace's enigmatic shadows. The conundrum of the savage Leela, lost among the spires of New York City. The secret life of the Whifferdill shapeshifer, Frobisher. The ancient rage that strikes against the TARDIS itself.Stories of intrigue, drama, action, suspense, and even a romance or two... all in a book featuring all eight television Doctors and nearly every companion from the television series, the novels and the audio plays. MISSING PIECES is a collection for the ages!",
  "genres": [],
  "author": "Mark Phippen",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/14623413-missing-pieces"
}