{
  "title": "দূরবীন",
  "description": "সাপ্তাহিক ‘দেশ’ পত্রিকায় দু-বছরেরও বেশি কাল ধরে ধারাবাহিকভাবে বেরিয়েছিল ‘দূরবীন, শীর্ষেন্দু মুখোপাধ্যায়ের জোরালো, সংবেদনশীল কলমে অন্যতম মহৎ সৃষ্টি। চলমান শতাব্দীর দুইয়ের দশকের শেষ ভাগ থেকে শুরু করে আটের দশক পর্যন্ত বিস্তৃত সময়ের প্ৰেক্ষাপটে সামাজিক জীবনের যাবতীয় পরিবর্তনকে এক আশ্চর্য কৌতুহলকর বিশাল কাহিনীর মধ্য দিয়ে ধরে রাখার প্রয়াসেরই অভিনন্দিত ফলশ্রুতি ‘দূরবীন উপন্যাস।তিন প্রজন্মের এই কাহিনীতে প্রথম প্রজন্মের প্রতিভূ জমিদার হেমকান্ত। এ-উপন্যাসের সূচনায় দেখা যায়, হেমকান্তের হাত থেকে কুয়োর বালতি জলে পড়ে গেছে, আর এই আপাততুচ্ছ ঘটনায় হেমকান্ত আক্রান্ত হচ্ছেন মৃত্যুচিন্তায়। বিপত্নীক হেমকান্ত ও রঙ্গময়ী নামের প্রবল ব্যক্তিত্বসম্পন্ন এক পুরোহিত্যকন্যার, গোপন প্রণয়কাহিনী ও আনুষঙ্গিক অন্যান্য পারিবারিক কাহিনী নিয়ে এ-উপন্যাসের প্রথম পর্যায়। দ্বিতীয় প্রজন্মের নায়ক কৃষ্ণকান্ত। দেবোপম রূপ ও কঠোর চরিত্রবল বালক কৃষ্ণকান্তকে দাঁড় করিয়েছে পিতা হেমকাস্তের বিপরীত মেরুতে। স্বদেশী আন্দোলনে উদ্বুদ্ধ কৃষ্ণকাস্তের ব্ৰহ্মচর্য-গ্রহণ ও দেশভাগের পর তাঁর আমূল পরিবর্তন-এই নিয়ে এ-উপন্যাসের দ্বিতীয় পর্য়ায়ের কাহিনী। তৃতীয় ও শেষ প্রজন্মের নায়ক ধ্রুব, বিশ শতকের উপান্তপর্বে এক দিগভ্ৰষ্ট, উদ্ধত বিদ্রোহী যুবা। ধ্রুবর স্ত্রী রেমি, যার সঙ্গে এক অদ্ভুত সম্পর্ক তার। কখনও ভালবাসা, কখনও উপেক্ষা, কখনও-বা প্রবল বিরাগ। অথচ রেমির ভালোবাসা শাত-আঘাতেও অবিচল। একদিকে রেমির সঙ্গে সম্পর্ক অন্যদিকে পিতা কৃষ্ণকাস্তের মধ্যে সেই ব্ৰহ্মচারী ও স্বদেশের জন্য উৎসর্গীকৃত প্রাণসত্তাটিকে খুঁজে না-পাওয়ার ব্যর্থতায় ক্ষতবিক্ষত ধ্রুবর আশ্চর্য কাহিনী নিয়েই শেষ পর্ব। শুধু তিন প্রজন্মের তিন নায়কের ব্যক্তিগত কাহিনীর জন্যই নয়, এ-উপন্যাসের বিশাল প্রেক্ষাপটে আরও বহু বিচিত্র ও কৌতুহলকর শাখা-কাহিনী, এবং এর চালচিত্রে স্বদেশী আন্দোলন, দেশভাগ ও স্বাধীনতা পরবর্তী উত্তাল দিনরাত্রির এক তাৎপর্যময় উপস্থাপনার জন্যও ‘দূরবীন’ চিহ্নিত হবে অবিস্মরণীয় সৃষ্টিরূপে।শুধুদূরকেই কাছে আনে না, উল্টো করে ধরলে কাছের জিনিসও দূরে দেখায় দূরবীন। ‘দূরবীন’ উপন্যাসের নামকরণে যেমন সূক্ষ্মতা, রচনারীতিতেও তেমনই অভিনবত্ব এনেছেন শীর্ষেন্দু মুখোপাধ্যায়। দ্বিস্তর এই উপন্যাসে সেকাল ও একাল, অতীত ও বর্তমান এক অনন্য কৌশলে একাকার।",
  "genres": [
    "Fiction",
    "Novels",
    "Historical Fiction",
    "Drama",
    "Classics",
    "Contemporary",
    "Adult"
  ],
  "author": "Shirshendu Mukhopadhyay",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/14623558"
}