{
  "title": "The Blackout",
  "description": "Alice woke up, plucked from a dream by a throbbing pain in her head. No more wine for me for a month, she thought. Dragging her hand across the sheets, she suddenly felt the urge to open her eyes. Something wasn’t right. She felt around her again and realized she was not on the soft mattress, but on wooden floor. Maybe she had a nightmare and fell down from the bed? Slowly, she sat and started to open her eyelids with a strong resolution of getting up. But once the first sunbeams touched her retinas, she froze. The wood was from a bench she was sitting on, surrounded by grass and trees – undoubtedly some park, and crowds of people. What the hell happened, she wanted to scream, but no sound came out of her mouth. The people around her looked strange, almost inhuman. She knew they were people, but their faces seemed odd and empty. Expressionless, she concluded. Their eyes looked as if they were replaced with buttons, cold and without iris, and skin porcelain-like. They were all standing perfectly straight, faces turned in her direction. None was moving. Feeling awkward and scared, Alice slowly lifted herself up, her heart still pounding. Suddenly she thought the people are situated to form some kind of a human fence and something inside her mind urged to see what was behind them. Hesitantly, she made a first step towards them. And the moment her foot touched the ground, everyone started moving. It was not some scattered, random movement, but an organized march and they were all tightening the wall around her. Scared as she was, she started running and pushing her way through the crowd. She used all her strength, but felt herself stuck between these strange, advancing creatures. As they were crushing her with their bodies, she felt a hand closing on her wrist and pulling her in some unknown direction. Alice only hoped that wherever they were going was a safer place.",
  "genres": [],
  "author": "Maja Ossowska",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/14623572-the-blackout"
}