{
  "title": "American Brutus: John Wilkes Booth and the Lincoln Conspiracies",
  "description": "It is a tale as familiar as our history A deranged actor, John Wilkes Booth, killed Abraham Lincoln in Ford’s Theatre, escaped on foot, and eluded capture for twelve days until he met his fiery end in a Virginia tobacco barn. In the national hysteria that followed, eight others were arrested and tried; four of those were executed, four imprisoned. Therein lie all the classic elements of a great thriller. But the untold tale is even more fascinating.Now, in American Brutus , Michael W. Kauffman, one of the foremost Lincoln assassination authorities, takes familiar history to a deeper level, offering an unprecedented, authoritative account of the Lincoln murder conspiracy. Working from a staggering array of archival sources and new research, Kauffman sheds new light on the background and motives of John Wilkes Booth, the mechanics of his plot to topple the Union government, and the trials and fates of the conspirators.Piece by piece, Kauffman explains and corrects common misperceptions and analyzes the political motivation behind Booth’s plan to unseat Lincoln, in whom the assassin saw a treacherous autocrat, “an American Caesar.” In preparing his study, Kauffman spared no effort getting at the He even lived in Booth’s house, and re-created key parts of Booth’s escape. Thanks to Kauffman’s discoveries, readers will have a new understanding of this defining event in our nation’s history, and they will come to see how public sentiment about Booth at the time of the assassination and ever since has made an accurate account of his actions and motives next to impossible–until now.In nearly 140 years there has been an overwhelming body of literature on the Lincoln assassination, much of it incomplete and oftentimes contradictory. In American Brutus , Kauffman finally makes sense of an incident whose causes and effects reverberate to this day. Provocative, absorbing, utterly cogent, at times controversial, this will become the definitive text on a watershed event in American history.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Civil War",
    "American History",
    "True Crime",
    "American Civil War"
  ],
  "author": "Michael W. Kauffman",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/146263.American_Brutus"
}