{
  "title": "التحدي الصيني - أثر الصعود الصيني في حياتنا",
  "description": "صدر كتاب \"التحدي الصيني\" أثر الصعود الصيني في حياتنا، ضمن سلسلة كتاب العربية التابعة للمجلة العربية العدد رقم (14) والكتاب من تأليف الصحفي الألماني: فولفجانج هيرن، وترجمة المترجم المصري: محمد رمضان حسينصدرت النسخة العربية من الكتاب في 312 صفحة تشمل إضاءة ومقدمة و12 فصلا، ومن ضمن فصول الكتاب: ظهور قوة عالمية جديدة، ملايين العقول الذكية، بناء في الشرق وانهيار في الغرب، البداية بتصنيع الأحذية والآن الصواريخ، لاعب جديد، غزو سلمي.وفي (إضاءة) قال المؤلف: تنتج الصين اليوم نصف الكاميرات الموجودة في العالم وثلث أجهزة التكييف وربع أجهزة التلفزيون، وقد ترتب على تلك النهضة الاقتصادية الصينية العديد من النتائج الهائلة التي تؤثر بشكل مباشرومؤلف الكتاب هو فولفجانج هيرن من مواليد 1954م درس الاقتصاد والعلوم السياسية في توبنجن، عمل كمحرر اقتصادي لدى كولزشتات انتشايجر ويعمل الآن كمراسل لمجلة مانجرماجستيوجاء في مقدمة الكتاب: نحن الآن على أعتاب تحول تاريخي في الاقتصاد العالمي والسياسة الدولية عندما تضع إمبراطورية كبرى كالصين أقدامها على الطريق الصحيح لتصبح قوة عالمية عظمى اقتصاديا وسياسياً وعسكرياً وللمرة الأولى في تاريخ البشرية تعود قوة عالمية سابقة للظهور مرة أخرى حيث كانت الصين حتى القرن الثامن عشر واحدة من أكثر الدول تقدماً في العالم، وها هي تستعيد وضعها من جديد لتسيطر على الاقتصاد العالمي المعاصر.وقال المؤلف: إن سرعة التغير اليوم في الصين قد أصبحت تسبق الأنفاس ولا يستطيع أحد ملاقحتها ولم يحدث من قبل أمر مماثل لما يجري الآن في تلك الأمة العظيمة عبر التاريخ.اليوم قد أصبحت الصين هي مصنع العالم وذلك من خلال العمالة الرخيصة والمتوفرة بأعداد كبيرة حيث إن ما يقارب المليون صيني يقبلون العمل مقابل تقاضي دولارين فقط كأجر عن اليوم الواحد.وهذا هو ما جذب العديد من الشركات الأجنبية العملاقة ونقل مراكز تصنيعها وإنتاجها إلى الصين على حساب أمريكا واليابان وأوروبا.وقال المؤلف: أصف في هذا الكتاب ديناميكية الصين وسرعة التغير بدون خوف.. أريد أن يفيق القارئ ويلقي نظرة على الصين تلك القوة العظمى الناشئة من أجل فهم أفضل لهم في النهاية.العنوان الأصلي للكتابHerausforderung ChinaWie der chinesische Aufstieg unser Leben verändertVon: Wolfgang HirnFischer Taschenbuch Verlag",
  "genres": [
    "China",
    "Politics"
  ],
  "author": "Wolfgang Hirn",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/14627962--"
}