{
  "title": "The Fundamental Wisdom of the Middle Way: Nāgārjuna's Mūlamadhyamakakārikā",
  "description": "The Buddhist saint Nāgārjuna, who lived in South India in approximately the second century CE, is undoubtedly the most important, influential, and widely studied Mahāyāna Buddhist philosopher. His many works include texts addressed to lay audiences, letters of advice to kings, and a set of penetrating metaphysical and epistemological treatises. His greatest philosophical work, the Mūlamadhyamakakārikā--read and studied by philosophers in all major Buddhist schools of Tibet, China, Japan, and Korea--is one of the most influential works in the history of Indian philosophy. Now, in The Fundamental Wisdom of the Middle Way, Jay L. Garfield provides a clear and eminently readable translation of Nāgārjuna's seminal work, offering those with little or no prior knowledge of Buddhist philosophy a view into the profound logic of the Mūlamadhyamakakārikā.Garfield presents a superb translation of the Tibetan text of Mūlamadhyamakakārikā in its entirety, and a commentary reflecting the Tibetan tradition through which Nāgārjuna's philosophical influence has largely been transmitted. Illuminating the systematic character of Nāgārjuna's reasoning, Garfield shows how Nāgārjuna develops his doctrine that all phenomena are empty of inherent existence, that is, than nothing exists substantially or independently. Despite lacking any essence, he argues, phenomena nonetheless exist conventionally, and that indeed conventional existence and ultimate emptiness are in fact the same thing. This represents the radical understanding of the Buddhist doctrine of the two truths, or two levels of reality. He offers a verse-by-verse commentary that explains Nāgārjuna's positions and arguments in the language of Western metaphysics and epistemology, and connects Nāgārjuna's concerns to those of Western philosophers such as Sextus, Hume, and Wittgenstein.An accessible translation of the foundational text for all Mahāyāna Buddhism, The Fundamental Wisdom of the Middle Way offers insight to all those interested in the nature of reality.",
  "genres": [
    "Philosophy",
    "Buddhism",
    "Religion",
    "Nonfiction",
    "Spirituality",
    "India",
    "Eastern Philosophy"
  ],
  "author": "Nāgārjuna",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/1048288.The_Fundamental_Wisdom_of_the_Middle_Way"
}