{
  "title": "Toward Dusk and Other Stories",
  "description": "Yoshiyuki Junnosuke was a sensual writer, whose style is reminiscent of that of novelists such as Tanizaki Jun'ichiro and Nagai Kafu. His works deal with the possibility of emotional purity in the relationships between men and women. Often, the relationship is examined through the agency of the protagonist's association with prostitutes. In the preface to New Writing in Japan, Mishima Yukio says of Yoshiyuki: \"The delicacy of Yoshiyuki's language and sensibility is probably more subtle and sophisticated than that of any Japanese writer since the war...The idee fixe of Japanese youth today-that love is impossible and impracticable-lies deep at the root of Yoshiyuki's thinking.\" His elegant prose style is often likened to that of Albert Camus. Howard Hibbett said of Yoshiyuki (in Contemporary Japanese Literature: an Anthology of Fiction, Film and Other Writing Since 1945): \"The cool, polished surface of his fiction faithfully reflects a world of mingled frivolity and futility...The urbane refinement of his astringent prose style is much admired.\"Toward Dusk, which in 1978 won the Noma Prize, Japan's highest literary award, is considered to be Yoshiyuki's best work in the rensaku form: a series of stories or chapters bound by common theme. The story ostensibly revolves around Sasa, the middle-aged protagonist, his fascination with virginity and, in particular, his obsessive quest for an emotional purity in his mistress, Sugiko. In many ways, the main theme is similar to that in The Dark Room (winner of the prestigious Tanizaki Prize; translated into English by John Bester). As the critic James Kirkup pointed out, \"The postwar mood of disillusionment made Yoshiyuki see the love lives of men and women as fragile and unreliable, fleeting, irresponsible.\" Like Nakata in The Dark Room, Sasa also lives for his assignations. And, although (unlike Nakata) he is married with a daughter, his family life is empty and meaningless and his home simply somewhere to stay when he is not seeing his mistresses. Sasa wished to keep his relationships casual, at arms' length, and he arranges them to suit himself. But, ultimately, he realizes that he and Sugiko must go their separate ways, and that nothing lasts forever.Toward Dusk is joined here by a selection of some of his finest short stories, and all of the pieces in this collection are published here for the first time in English.\"",
  "genres": [
    "Japan",
    "Japanese Literature",
    "Short Stories"
  ],
  "author": "Junnosuke Yoshiyuki",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/14647712-toward-dusk-and-other-stories"
}