{
  "title": "A Nation Forsaken: EMP: The Escalating Threat of an American Catastrophe",
  "description": "There have been warnings from scientists and other experts for years that the Nation's electrical grid system and other critical infrastructures that have almost complete dependency on electricity and electronic components are highly vulnerable to an electromagnetic pulse (EMP) event either from natural or man-made causes. However, Congress and the administrations of previous and current presidents largely have ignored those warnings. Events such as the September 11, 2001, terrorist attack on the United States and then the devastating Hurricane Katrina that revealed vulnerabilities to those infrastructures heightened that concern. Due to the lapse of time and a relatively calm period since those disasters, policymakers have been lulled back into complacency rather than take preventative action against what could be the biggest threat to US national and economic security in our lifetime.   The threat from an EMP attack on our critical infrastructures either from an impending solar storm of serious intensity – expected between 2012 and 2014 – or a high-altitude nuclear explosion are threats that could have long-term catastrophic consequences for our society and our way of life.  In 2008 a congressional commission studied the consequences of an EMP attack not only the power grid itself but also the consequences to every sector of our telecommunications, banking, transportation, food, manufacturing, construction, and energy.   While these critical infrastructures continue to face such an impending crisis, Congress has basically ignored its own commission report and instead has treated the threat of an EMP event as a political football to be punted whenever expedient for their own gain. To date, still nothing has been done to protect the nation.    Michael Maloof breaks down that threat in his book A Nation Forsaken. He even outlines how our own military is similarly vulnerable to an EMP event due to its 99 percent dependency on the nation's electrical grid system for electricity and communications, raising the high prospect that it may not be able to function to defend the nation in its time of greatest need.   While an EMP event on our civilian infrastructure could be serious, it can be managed if government at the federal, state, and local levels gives a high priority to undertake preventative action to lessen its impact to recover from such an event. Now is the time for Congress to act and stop forsaking our nation.",
  "genres": [],
  "author": "F. Michael Maloof",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/14652407-a-nation-forsaken"
}