{
  "title": "Elysian Dreams: Where the Past Meets the Present",
  "description": "Professor Collin Crowly is a popular college history teacher, carefree man-about-town, and confirmed bachelor. He seems to have it good friends, a great career, a stunning large, old mansion, and the Crowly family name and fortune. The day beautiful Angelina walked into his classroom, it all changed. Soon trapped within the very pages of the history he loves and teaches, Collin Crowly finds himself with one too many girlfriends, one too many enemies-and one too many lives. The pretty, demure student, Angelina, would love to have the professor's problems. The alluring, restless blonde is dissatisfied with her life. Seeking out the elusive pieces of her incomplete, imperfect past, she dreams of one day escaping her mundane existence. A happier, more carefree and exciting life beckons to Angelina from beyond time itself. Answering its call, what she discovers is to be very careful about what she wishes for-as it just may come true. Highly intelligent and slightly nerdy high school student, Marsha, lives an idyllic, peaceful life with her mom, Angela. Like most teens, Marsha struggles with her own feelings of being a misplaced soul, trapped in a life in which she neither understands nor feels comfortable. Lost between her dreams and a perplexing reality, she searches the heavens for answers. Longing to find her place she discovers the key to her future may lie hidden in the past. As the trio desperately seeks answers, their lives unexpectedly and repeatedly cross. Only the ageless and enigmatic Lachesis seems to understand the powers which inexplicably draw them together. But, it is Collin Crowly's family legacy and his mysterious mansion, Casa di Tempo, containing a hidden portal to the past that sets the stage for a romantic adventure across both space and time. Elysian Dreams transports the reader from the grimy, violent streets of the prohibition era Philadelphia to a peaceful Amish community-and from the visions of a young girl to the beckoning midnight skies and beyond. It is an exhilarating search for answers-to be found only in another world.",
  "genres": [],
  "author": "B.J. Neblett",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/14652752-elysian-dreams"
}