{
  "title": "The Resilience Factor: 7 Keys to Finding Your Inner Strength and Overcoming Life's Hurdles",
  "description": "Resilience is a crucial ingredient–perhaps the crucial ingredient–to a happy, healthy life. More than anything else, it's what determines how high we rise above what threatens to wear us down, from battling an illness, to bolstering a marriage, to carrying on after a national crisis. Everyone needs resilience, and now two expert psychologists share seven proven techniques for enhancing our capacity to weather even the cruelest setbacks.The science in The Resilience Factor takes an extraordinary leap from the research introduced in the bestselling Learned Optimism a decade ago. Just as hundreds of thousands of people were transformed by \"flexible optimism,\" readers of this book will flourish, thanks to their enhanced ability to overcome obstacles of any kind. Karen Reivich and Andrew Shatté are seasoned resilience coaches and, through practical methods and vivid anecdotes, they prove that resilience is not just an ability that we're born with and need to survive, but a skill that anyone can learn and improve in order to thrive.Readers will first complete the Resilience Questionnaire to determine their own innate levels of resilience. Then, the system at the heart of The Resilience Factor will teach them • Cast off harsh self-criticisms and negative self-images• Navigate through the fallout of any kind of crisis• Cope with grief and anxiety• Overcome obstacles in relationships, parenting, or on the job• Achieve greater physical health• Bolster optimism, take chances, and embrace lifeIn light of the unprecedented challenges we've recently faced, there’s never been a greater need to boost our resilience. Without resorting to feel-good pap or quick-fix clichés, The Resilience Factor is self-help at its best, destined to become a classic in the genre.",
  "genres": [
    "Self Help",
    "Psychology",
    "Nonfiction",
    "Mental Health",
    "Health",
    "Personal Development",
    "Leadership"
  ],
  "author": "Karen Reivich",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/1466276.The_Resilience_Factor"
}