{
  "title": "Cooking with Grease: Stirring the Pots in America",
  "description": "Cooking with Grease is an inspiring, behind-the-scenes memoir of the life and times of a tenacious political organizer and the first African-American woman to head a major presidential campaign.  Donna Brazile fought her first political fight at age nine -- campaigning (successfully) for a city council candidate who promised a playground in her neighborhood. The day after Martin Luther King Jr. was assassinated, she committed her heart and her future to political and social activism. By the 2000 presidential election, Brazile had become a major player in American political history -- and she remains one of the most outspoken and forceful political activists of our day.  Brazile grew up one of nine children in a working-poor family in New Orleans, a place where talking politics comes as naturally as stirring a pot of seafood gumbo -- and where the two often go hand in hand. Growing up, she learned how to cook from watching her mother, Jean, stir the pots in their family kitchen. She inherited her love of reading and politics from her grandmother Frances. Her brothers Teddy Man and Chet worked as foot soldiers in her early business schemes and in her voter registration efforts as a child.  Cooking with Grease follows Donna's rise to greater and greater political and personal accomplishments. But each new career success came with its own kind of heartache, especially in her greatest challenge: leading Al Gore's 2000 campaign, making her the first African American to lead a major presidential campaign.  Cooking with Grease is an intimate account of Donna's thirty years in politics. Her witty style and innovative political strategies have garnered her the respect and admiration of colleagues and adversaries alike -- she is as comfortable trading quips with Karl Rove as she is with her Democratic colleagues. Her story is as warm and nourishing as a bowl of Brazile family gumbo.",
  "genres": [
    "African American",
    "Nonfiction",
    "Politics",
    "Biography",
    "Memoir",
    "Biography Memoir"
  ],
  "author": "Donna Brazile",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/1005906.Cooking_with_Grease"
}