{
  "title": "Father of Lies",
  "description": "At the urging of his wife, Provost Fochs reluctantly agrees to see a therapist, Dr. Feshtig. Through the therapist's detailed notes, correspondence from the church, and the provost himself, the provost's sickness emerges and the reader is drawn into the disturbing inner workings of a violent pedophile.The provost relays his crimes in excruciating detail. 'God told me that where evil made its mark, good must follow, burning evil out and purifying the body.' Fochs describes a dream in which he sodomizes two boys from the parish in an effort to exorcise their sins. Soon thereafter, two boys come forward accusing Fochs of that very deed. In another dream he strangles and dismembers a young girl in the woods near his house, where a child from his parish is later found.As the provost's dreams are discovered to be reality and accusations against him are made public, the church is forced to respond. In an effort to protect one of its own, and, in turn, to protect itself, the Committee for the Strengthening of the church demands that Dr. Feshtig turn over his notes about Provost Fochs. This marks the beginning of the church's all-out effort to cover up for the provost -- and launches the race to the novel's final revelation of whether good, in the form of the law, or evil, in the hands of the provost (and by association the church), will prevail.Brian Evenson holds the reader to the page until the novel's fateful end. En route, he questions whether obedience to God justifies taking every possible liberty, right or wrong. And he brings to light how an institution supposed to be under divine guidance can be as eager as its worldly counterpart to soil its hands in the furthering of the cause of supposed righteousness.",
  "genres": [
    "Horror",
    "Fiction",
    "Contemporary",
    "Religion",
    "Crime",
    "Dark",
    "Literary Fiction"
  ],
  "author": "Brian Evenson",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/146773.Father_of_Lies"
}