{
  "title": "Sandkastele",
  "description": "Die lewensdriftige Kristien Muller word uit haar selfopgelegde ballingskap in Londen na die Klein Karoo teruggeroep deur 'n ramp: in 'n fantasmagoriese volstruisveerpaleis op die woestynvlak lê haar ouma na 'n brandbomaanval op sterwe.Dit is die vooraand van Suid-Afrika se eerste vrye verkieseing en Kristien beland teen haar sin in die middel van 'n gesin, 'n distrik en 'n land vol spanninge en teenstrydighede: daar is dié wat hulle op geweld beroep, dié wat hulle gereed maak vir 'n apokaplips, dié wat by voorbaat boedel oorgegee het, dié wat hoop op vernuwing en welvaart; daar is bruin en wit en swart, almal gevang in die krisisoomblik tussen verlede en toekoms.Maar boenwal is daar ouma Kristina (103 jaar oud) in haar ongelooflike paleis omring deur voëls, wat weier om te sterf voodat sy vir haar kleindogter die verlede voorspel het soos waarsêers die toekoms voorspel. Haar testament bestaan uit haar stories - geskiedenis? mites? fantasieë? - waarin 'n stamverhaal van 9 generasies vroue ontvou. Vroue wat in 'n wêreld oorheers deur mag, geweld en mans stilgemaak is en deur di eeeue op verbasende maniere moet vergoed vir 'n tong of 'n skaduwee wat van hulle gesteel is: 'n vrou wat in 'n boom verander en deur voëls weggedra word, 'n vrou wat haar man in haar hare verwurg, 'n vrou wat voor haar begrafnis uit haar doodskis verdwyn 'n vrou wat uitspattige skilderye teen die mure van haar kerker verf, 'n vrou wat met haar minnaar op 'n towertapyt na Bagdad gaan om te kyk hoe die kamele skemeraande in die palmbome klim en Latynse psalms sing, 'n vrou wat so vet word dat haar huis oor haar instort, 'n vrou wat haar hele gesin uitroei - die pitte van die verbode vrug teruggespeoeg in die gesigte van die manlike miteskeppers ...Op 'n verstommende manier trek Brink alles hier saam om met komedie en tragedie, verbeeldingsvlugte en realisme, opstand en vergiffenis te fokus op die sentrale figuur van Kristien wat gedwing word om haar pad deur werklikheid en verbeelding, sprokie en geskiedenis te vind en 'n besluit te neem waarin haar eie toekoms, en die land s'n, op die spel staan.",
  "genres": [
    "Africa",
    "Fiction",
    "South Africa",
    "Magical Realism",
    "African Literature",
    "Historical Fiction"
  ],
  "author": "André Brink",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/1467788.Sandkastele"
}