{
  "title": "The Burden of Sympathy: How Families Cope With Mental Illness",
  "description": "What are the limits of sympathy in dealing with another person's troubles? Where do we draw the line between caring for a loved one, and being swallowed up emotionally by the obligation to do so? Quite simply, what do we owe each other? In this vivid and thoughtful study, David Karp chronicles the experiences of the family members of the mentally ill, and how they draw \"boundaries of sympathy\" to avoid being engulfed by the day-to-day suffering of a loved one.Working from sixty extensive interviews, the author reveals striking similarities in the experiences of the feelings of shame, fear, guilt and powerlessness in the face of a socially stigmatized illness; the frustration of navigating the complex network of bureaucracies that govern the mental health system; and most of all, the difficulty negotiating an \"appropriate\" level of involvement with the mentally ill loved one while maintaining enough distance for personal health. Throughout the narratives, Karp sensitively explores the overarching question of how people strike an equilibrium between reason and emotion, between head and heart, when caring for a catastrophically ill person. The Burden of Sympathy concludes with a critical look at what it means to be a moral and caring person at the turn of the century in America, when powerful cultural messages spell out two contradictory pursue personal fulfillment at any cost and care for the family at anycost.An insightful, deeply caring look at mental illness and at the larger picture of contemporary values, The Burden of Sympathy is required reading for caregivers of all kinds, and for anyone seeking broader understanding of human responsibility in the postmodern world.",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Mental Health",
    "Health",
    "Mental Illness"
  ],
  "author": "David A. Karp",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/1468124.The_Burden_of_Sympathy"
}