{
  "title": "Höhenrausch",
  "description": "Höhen und Tiefen des Single-Daseins erlebt die frisch getrennte Linda in Berlin-Mitte. Auch dieses Mal schont die Bestsellerautorin Ildikó von Kürthy weder ihre Romanheldin noch das Zwerchfell der Leser. Gleich zu Anfang kommt es im Auto von Lindas Freund zum Eklat: Die Abdrücke zweier weiblicher Füße haben sich an der Innenseite der Windschutzscheibe verewigt -- da sich der tumbe Freund nicht gleich zwischen Linda und weiteren Quickies im Auto entscheiden mag, findet die Beziehung ein jähes Ende. Mit einem satten Erfahrungsschatz gerüstet (\"Ich hatte aus meinen Fehlern gelernt. Jetzt konnte ich eine ganze Menge neuer machen.\"), stolpert Linda auf Stilettos über die Schlachtfelder des Geschlechterkampfes. In einem Interview sagte Ildikó von Kürthy, dass sie sich in Hamburg einen Roman hätte ausdenken müssen, in Berlin konnte sie ihn erleben. Und so macht Linda kurzerhand einen Wohnungstausch mit einem unbekannten Berliner, der ihr als Ratgeber und innere Stimme per E-Mail zur Seite stehen wird. Und diese Stütze hat sie bitter nötig, angesichts der unrühmlichen Stationen ihrer Männersuche: Blind-Dating mit dem schwulen Erdal, Urlaub im Single-Club, Flirts im Treppenhaus, eine Affäre mit einem verheirateten Mann, und und und. Gerade bei diesen Szenen läuft von Kürthy zu Hochform auf und weiß eine Menge -- auch selbst Recherchiertes -- zu berichten. Nur so kann sie wohl auf Charaktere wie Heiner, den Lustgreis, oder das Refugium \"Ficky-Island\" im türkischen Single-Club kommen. Überstrapaziert hingegen werden Lindas Probleme mit Body-Mass-Index und Bindegewebe. \"Entweder bin ich schlank, weil ich ein Problem habe, oder ich habe ein Problem, weil ich nicht schlank bin.\" Das ist denn noch eines der originelleren Statements zu dem nur scheinbar unerschöpflichen Thema. Dabei kann und will der Roman noch mehr: nämlich auf äußerst unterhaltsame Weise über die heutigen Geschlechterbeziehungen berichten. Und er erzählt davon, dass selbst Männer, die sich mit Mitte 40 noch nicht \"reif\" für eine verbindliche Beziehung fühlen, noch nicht endgültig für die Frauenwelt verloren sind. --Henrik Flor, Literaturtest",
  "genres": [
    "Chick Lit",
    "Roman",
    "Humor",
    "Fiction",
    "Romance",
    "Audiobook",
    "Adult"
  ],
  "author": "Ildikó von Kürthy",
  "average_rating": "3.41",
  "url": "https://www.goodreads.com/book/show/1468396.H_henrausch"
}