{
  "title": "Fifty-One Tales",
  "description": "Without doubt Lord Dunsany was one of the most influential writers of fantasy fiction in twentieth century. His fiction is an acknowledged influence on entire generations of writers, ranging from H.P. Lovecraft to James Branch Cabell, from Clark Ashton Smith to Lin Carter. Although many of his most famous stories are longer in length, the miniature portraits of Fifty-One Tales (originally published in 1915 and sometimes reprinted under the title The Food of Death) are an ideal introduction to Dunsany. Nowhere is the jewel-like quality of his prose more evident than in the short tales, seminal works which runs the gamut from whimsy to fantasy to social satire.CONTENTS:\"The Assignation\" \"Charon\" \"The Death of Pan\" \"The Sphinx at Gizeh\" \"The Hen\" \"Wind and Fog\" \"The Raft Builders\" \"The Workman\" \"The Guest\" \"Death and Odysseus\" \"Death and the Orange\" \"The Prayer of the Flowers\" \"Time and the Tradesman\" \"The Little City\" \"The Unpasturable Fields\" \"The Worm and the Angel\" \"The Songless Country\" \"The Latest Thing\" \"The Demagogue and the Demi-Monde\" \"The Giant Poppy\" \"Roses\" \"The Man with the Golden Ear-rings\" \"The Dream of King Karna-Vootra\" \"The Storm\" \"A Mistaken Identity\" \"The True History of the Hare and the Tortoise\" \"Alone the Immortals\" \"A Moral Little Tale\" \"The Return of Song\" \"Spring in Town\" \"How the Enemy Came to Thlūnrāna\" \"A Losing Game\" \"Taking Up Piccadilly\" \"After the Fire\" \"The City\" \"The Food of Death\" \"The Lonely Idol\" \"The Sphinx in Thebes (Massachusetts)\" \"The Reward\" \"The Trouble in Leafy Green Street\" \"Furrow-Maker\" \"Lobster Salad\" \"The Return of the Exiles\" \"Nature and Time\" \"The Song of the Blackbird\" \"The Messengers\" \"The Three Tall Sons\" \"Compromise\" \"What We Have Come To\" \"The Tomb of Pan\" \"The Poet Speaks With Earth\" (English version only) \"The Mist\" (American version only)",
  "genres": [
    "Fantasy",
    "Short Stories",
    "Classics",
    "Fiction",
    "Horror",
    "Anthologies",
    "Short Story Collection"
  ],
  "author": "Lord Dunsany",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/14691.Fifty_One_Tales"
}