{
  "title": "Roughneck Nine-One: The Extraordinary Story of a Special Forces A-Team at War",
  "description": "On April 6, 2003, twenty-six Green Berets, including those of Sergeant 1st Class Frank Anentori's Special Forces A-Team (call sign Roughneck Nine One), led a violent battle against a vastly superior force at the remote crossroads near the village of Debecka, Iraq. In an already legendary conflict that will influence US Army doctrine for years to come, the Green Berets stopped an enemy unit that included battle tanks and more than 150 well-trained, well-equipped, and well-commanded soldiers. Any normal American light infantry unit finding itself outnumbered over five to one and outgunned on the ground by such a heavily armored force would have turned and run for cover. But Green Berets don't like to run and Nine One Don't Run was Antenori's team's motto from the very beginning. In a spectacular fight, they battled Iraqi tanks and personnel until only a handful of Iraqi survivors finally fled the battlefield.In the process, Nine One encountered hordes of news media, and at the peak of the fight, a US Navy F-14 dropped a 500-pound bomb in the middle of a group of supporting Kurdish Peshmerga fighters, killing and wounding dozens. This is the never-before-told, unsanitized, unedited story of the fight for the crossroads at Debecka, Iraq, and a unique inside look at a Special Forces A-Team as it recruits and organizes, trains for combat, and eventually fights a battle against a huge opposing force in Iraq.Roughneck Nine One is a powerful look inside a Special Forces A-Team and its dramatic and controversial battle against a huge opposing force, and a revealing story of the role of Special Forces in the ongoing war in Iraq.",
  "genres": [
    "Military Fiction",
    "Nonfiction",
    "History",
    "Military History",
    "War",
    "Audiobook",
    "Biography"
  ],
  "author": "Frank Antenori",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/147100.Roughneck_Nine_One"
}