{
  "title": "Underworld",
  "description": "~Underworld~ part 2 of the Dark Passage Series~Underworld is a gritty YA Novel that is action packed. The protagonist is a 19 year old girl named Ivy. She is strong and yet broken but she has a sense of hope that drives her to push beyond what she believes about herself. The story shows Ivy's growth as she comes to grips with who she really is and busts out the box that society has put her inside. She realizes she is so much more than just a girl from the wrong side of town and that she has it within herself to change the destiny of many. She finds herself facing not only demons from her past but also the demons beyond the veil of the underworld. The Underworld is a brutal place, with intense evil, that resonates the very worst of human nature. Sometimes to save those you love you must walk alone into the unknown and be ready to die for what you believe. In a green ocean of pine trees and twisted branches it seems impossible that light can penetrate the darkness. I find myself outside the strange house in the coolness of a pine forest with my backpack slung over my shoulder. The pine scent lingers in the air and I can hear the faint sound of music from far away. The pleasure of the light is so intense that I don’t care about anything else. All I have ever wanted is to be loved and to be held just like this. I want to stay forever and never to go back to my life. I savor the experience for a few more moments and then let my body fall out of the light. I know what I must do and slowly close the locket. “The white horses belong to the third realm. When we saw him in the field this morning Emma said he was yours. How did you ever get your hands on one? He will prove right useful to you here.”“How can I be equipped when I don’t even know what I’m supposed to do?” I feel a sudden feeling of panic rising up in me as the words tumble out. I don’t understand what I have done to deserve this and the thought of what I will have to face is terrifying. “The way you are to go will come to you. You will be led by an inner feeling and when the time is right you will know what to do. The light will find you and show you other dimensions and doorways which you may pass through”.My eyes never leave her face. She radiates warmth and looks as she had long ago, before the world had left its cruel marks on her. It’s a sliver of time I will never get back. It’s been a lifetime and I can’t forget her face, she is the one who completes me. It’s a fragment of time that I have hidden away in the inner recess of my mind. Nothing more than a promise of the reality of what could have been. We had chosen different paths and were never to see each other again. I often dream the impossible dream. Can this sliver of time, this chance meeting, ever lead to an eternity with her?",
  "genres": [
    "Fiction",
    "Romance",
    "Paranormal",
    "Demons",
    "Spirituality"
  ],
  "author": "M.L. Woolley",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/14713558-underworld"
}