{
  "title": "Clouds of Witness / The Unpleasantness at The Bellona Club",
  "description": "Lord Peter Wimsey, among the most celebrated of all fictional supersleuths-currently protrayed by Ian Carmichael on Public Broadcasting Service's critically acclaimed Masterpiece Theatre-appears here in two challenging cases which mark his television debut... In Clouds of Witness Lord Peter-amateur detective, scholar and bon vivant-learns while on vacation in France that his brother, the Duke of Denver is being held for the murder of their sister's fiance, Captain Denis Cathcart. Evidence has been given to show that Cathcart quarreled with the accused-and was subsequently shot. A pistol belonging to the Duke was found on the grounds of his estate, near the scene of the crime. The murder of an elderly member is at the cause of the Unpleasantness at the Bellona Club. The club, it has been joshingly said, resembles a morgue. Then, one night, the jest became a reality. The eminent and ancient General Fentiman thought to be napping in the wing chair by the fireplace, is sleeping his last sleep! There is no reason to suspect causes other than natural ones in the death of a man of ninety. He is duly buried and that seems to be the end of him. Soon however matters of money develop-a huge sum of money- which dempends for its disposition on exactly when the old man dies. How long had he been lying in the fireplace chair before his body was discovered? There had been an approximate estimate based on the degree of rigor mortis, but approximations are now insufficient-and Lord Peter finds himself intrigued by the unusual aspect of this particular rigor mortis. As he investigates, other peculiarities also demand answers-such as the lethal quantity of digitalin discovered post-exhumation autopsy! Book Club Edition486 pages",
  "genres": [
    "Mystery",
    "Fiction"
  ],
  "author": "Dorothy L. Sayers",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/147154.Clouds_of_Witness_The_Unpleasantness_at_The_Bellona_Club"
}