{
  "title": "Papa John: An Autobiography by John Phillips",
  "description": "Sex, drugs, and rock 'n' roll.  It was the anthem of the sixties. The psychedelic code by which many lived--and died. And John Phillips, legendary founder and songwriter of the Mamas and the Papas, experienced it all. Now Phillips takes us on a dizzying roller-coaster ride from stardom in L.A. to drug busts in the Big Apple. In an intimate, gritty, all-too-true self-portrait, he offers a startling, reflective look at the turbulent sixties and beyond. From a nightmarish, yet oddly tender childhood through a disastrous military school education in Virginia, John Edmund Andrew Phillips found music the only outlet for his brilliant, restless energy. He developed a personal sound after a rumbling journey through the clubs and honky-tonks of Greenwich Village, the Virgin Islands, Los Angeles, and the segregated South. He began to form the groups that soon brought him into the national spotlight: first the Smoothies, then the Journeyman, and finally the phenomenally successful the Mamas and the Papas. And as the hits rolled in for Papa John-- \"Creeque Alley,\" \"Monday, Monday,\" \"California Dreamin',\" \"Go Where You Wanna Go,\" \"Words of Love\" --so did fame and wealth. He paid cash for a fabulous mansion in Los Angeles. He was instrumental in staging the historic Monterrey Pop Festival, where Janis Joplin debuted and Jimi Hendrix memorably lit his guitar on fire. And he immersed himself in a bizarre world of dope, parties, and parasitic hangers-on that rapidly took over his life. Throughout the seventies and into the eighties, Phillips spent over a million dollars on drugs, his imposing six-foot-four-inch frame turning specter like as his weight dropped to 140 pounds. Drifting from his family and dropping out of society, he ended up--busted, broke, and burned out--in a New York City slammer. But though the songs no longer came easy for Papa John Phillips, the music was far from over. And with a supporting cast of superstars that includes Princess Margaret, Mick Jagger, Warren Beatty, Roman Polanski, Elvis Presley, Mia Farrow, and the Beatles, PAPA JOHN tells a fascinating saga of one remarkable and troubled man who, after everything else is a survivor.",
  "genres": [
    "Music",
    "Nonfiction",
    "Biography",
    "Autobiography",
    "Memoir",
    "Biography Memoir"
  ],
  "author": "John   Phillips",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/1471782.Papa_John"
}