{
  "title": "Desperate Networks",
  "description": "In the executive offices of the four major networks, sweeping changes are taking place and billions of dollars are at stake. Now Bill Carter, bestselling author of The Late Shift , goes behind the scenes to reveal the inner workings of the television industry, capturing the true portraits of the larger-than-life moguls and stars who make it such a cutthroat business.In a time of sweeping media change, the four major networks struggle for the attention of American viewers increasingly distracted by cable, video games, and the Internet. Behind boardroom doors, tempers flare in the search for hit shows, which often get on the air purely by accident. The fierce competition creates a pressure-cooker environment where anything can happen . . .• NBC’s fall from grace—Once the undisputed king of prime time, NBC plunged from first place to last place in the ratings in the course of a single season. What will be the price of that collapse—and who will pay it?• CBS’s slow and steady race to the top—Unlike NBC, CBS, under the leadership of CEO, Leslie Moonves, engineered one of the most spectacular turnarounds in television history. But in this ruthless world, you’re only as good as last week’s ratings . . . .• ABC’s surprising resurrection— Lost and Desperate Housewives —have brought ABC the kind of success it could only dream of in the past. So why don’t the executives responsible for those hits work there any more?• The end of the news as we know it—In a stunningly short period of time, all three of the major network news anchors—Dan Rather, Tom Brokaw, and Peter Jennings—signed off, leaving executives scrambling for a way to keep network news relevant in an era of 24/7 information.• Crazy Like Fox—They’re outrageous, unconventional, and occasionally off-putting, but more and more people are watching Fox shows. Most of all they keep watching American Idol . How did Simon Cowell snooker himself into a huge payday? Stay tuned . . .In Desperate Networks Bill Carter digs deep inside the industry, delivering utterly irresistible “dish” that you won’t find anywhere else. It’s the perfect book to read when there’s nothing on TV.",
  "genres": [
    "Nonfiction",
    "Tv",
    "Pop Culture",
    "Audiobook",
    "Business",
    "History"
  ],
  "author": "Bill  Carter",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/14720.Desperate_Networks"
}