{
  "title": "Scarecrows: A DANDY World",
  "description": "Please Note: As of 1 January 2013 \"SCARECROWS: A DANDY World\" has a new cover.******************Praise for \"SCARECROWS: A DANDY World\"“Scarecrows [A DANDY World] combines the whimsy of Mr. Data with one of the most insightful investigations of the mechanical mind since Asimov’s series. Jonathan Emrys creates some of the best SF imagery since his hero, Ray Bradbury.” -- Dan Nieuwsma, Laser Physicist and SF fan******************Seeing Humans In A Mirror Through Artificial Eyes...Humans have succeeded in creating artificial life... by accident. In a world where the future has come and gone like a whirlwind, from the technological rubble has clambered a race of artificial sentient life forms known as ‘Humes’. Now these newly created sentient beings, the survivors of a technological tempest, live amongst us under Government protection and control.Isolated to the eastern half of the United States, along with other select parts of the world, Humes long for independence. They seek to escape the confines of the Government's watchful eyes and to experience more than they are allowed; and in some cases, they succeed.On the west coast lives Lucy Barnes, a young woman who lives alone and works in the Fashion District of Los Angeles. She works hard, pays her rent on time, and enjoys her quiet moments of solitude. Sometimes she just wants to curl up with a good book and lose herself in another world. However, her carefully regimented life is thrown into turmoil when some new friends turn everything upside down.Lucy’s story examines the quest for freedom and independence. It also examines how humans view sentience, how they treat each other, and how they might be viewed by intelligent beings outside of their own species. It deals with how we treat the other or the outsider or those who are different from ourselves. It also examines humanity by turning a mirror on our own prejudices and presumptions.CONTAINS STRONG LANGUAGE . . . and a squirrel.",
  "genres": [
    "Fiction"
  ],
  "author": "Jonathan Emrys",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/14723075-scarecrows"
}