{
  "title": "Just As I Am",
  "description": "In these chaotic times, when many people who claim to be Christian are searching for “relevance” in the secular to justify their worldly aspirations, much of the Christian heritage is being ignored or discarded. But Miss Price turns time back for a moment and in these early Victorian lyrics she finds surprisingly sound, contemporary meaning that stands boldly above the ideas of today’s so-called radical thinkers. Each line of this long-favored song responds to Miss Price’s interpretation with stirring impact―whether it be in strong yet soft tones that comfort the hearts of the lonely, the troubled, and the suffering or in stunning crescendo to rouse the inattentive and careless. Through Miss Price’s weaving of the lyrics into her book, Just As I Am , the familiar music of the song accompanies the reader from page to page. Then she syncopates the theme, illuminating it for a fresh appraisal in the light of today’s burning issues. She does this by applying the song’s ethically and psychologically sound thesis both to her own life and to the lives of persons in tragically real confrontations with “fightings and fears within, without.” Each example shines like a beacon to guide the faltering to a Christian understanding and a peace unfulfilled by a secular situation ethic. How should a Christian view the war? What course to consolations for the widow and parents of a young man killed in Vietnam? What choice for the guilt-ridden man who loves his wife, his children and his mistress? Is there a “correct” way to approach God? The answers are not found in protests, trips to the psychiatrist, divorce or even death. Miss Price seeks and finds answers in the deep abiding love and faith that “has broken every barrier down.” Just As I Am will be acclaimed Eugenia Price’s finest contribution to the search for a meaningful Christian life.",
  "genres": [
    "Christianity"
  ],
  "author": "Eugenia Price",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/1472532.Just_As_I_Am"
}