{
  "title": "Kingfish: The Reign of Huey P. Long",
  "description": "From the moment he took office as governor in 1928 to the day an assassin’s bullet cut him down in 1935, Huey Long wielded all but dictatorial control over the state of Louisiana. A man of shameless ambition and ruthless vindictiveness, Long orchestrated elections, hired and fired thousands at will, and deployed the state militia as his personal police force. And yet, paradoxically, as governor and later as senator, Long did more good for the state’s poor and uneducated than any politician before or since. Outrageous demagogue or charismatic visionary? In this powerful new biography, Richard D. White, Jr., brings Huey Long to life in all his blazing, controversial glory.White taps invaluable new source material to present a fresh, vivid portrait of both the man and the Depression era that catapulted him to fame. From his boyhood in dirt-poor Winn Parish, Long knew he was destined for power–the problem was how to get it fast enough to satisfy his insatiable appetite. With cunning and crudity unheard of in Louisiana politics, Long crushed his opponents in the 1928 gubernatorial race, then immediately set about tightening his iron grip. The press attacked him viciously, the oil companies howled for his blood after he pushed through a controversial oil processing tax, but Long had the adulation of the people. In 1930, the Kingfish got himself elected senator, and then there was no stopping him.White’s account of Long’s heyday unfolds with the mesmerizing intensity of a movie. Pegged by President Roosevelt as “one of the two most dangerous men in the country,” Long organized a radical movement to redistribute money through his Share Our Wealth Society–and his gospel of pensions for all, a shorter workweek, and free college spread like wildfire. The Louisiana poor already worshiped him for building thousands of miles of roads and funding schools, hospitals, and universities; his outrageous antics on the Senate floor gained him a growing national base. By 1935, despite a barrage of corruption investigations, Huey Long announced that he was running for president.In the end, Long was a tragic hero–a power addict who squandered his genius and came close to destroying the very foundation of democratic rule. Kingfish is a balanced, lucid, and absolutely spellbinding portrait of the life and times of the most incendiary figure in the history of American politics.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "Politics",
    "American History",
    "Audiobook",
    "Biography Memoir"
  ],
  "author": "Richard D. White Jr.",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/147374.Kingfish"
}