{
  "title": "Killing Time: The Autobiography of Paul Feyerabend",
  "description": "Killing Time is the story of Paul Feyerabend's life. Finished only weeks before his death in 1994, it is the self-portrait of one of this century's most original and influential intellectuals.Trained in physics and astronomy, Feyerabend was best known as a philosopher of science. But he emphatically was not a builder of theories or a writer of rules. Rather, his fame was in powerful, plain-spoken critiques of \"big\" science and \"big\" philosophy. Feyerabend gave voice to a radically democratic \"epistemological anarchism:\" he argued forcefully that there is not one way to knowledge, but many principled paths; not one truth or one rationality but different, competing pictures of the workings of the world. \"Anything goes,\" he said about the ways of science in his most famous book, Against Method. And he meant it.Here, for the first time, Feyerabend traces the trajectory that led him from an isolated, lower-middle-class childhood in Vienna to the height of international academic success. He writes of his experience in the German army on the Russian front, where three bullets left him crippled, impotent, and in lifelong pain. He recalls his promising talent as an operatic tenor (a lifelong passion), his encounters with everyone from Martin Buber to Bertolt Brecht, innumerable love affairs, four marriages, and a career so rich he once held tenured positions at four universities at the same time.Although not written as an intellectual autobiography, Killing Time sketches the people, ideas, and conflicts of sixty years. Feyerabend writes frankly of complicated relationships with his mentor Karl Popper and his friend and frequent opponent Imre Lakatos, and his reactions to a growing reputation as the \"worst enemy of science.\"",
  "genres": [
    "Philosophy",
    "Biography",
    "Science",
    "Nonfiction",
    "Memoir",
    "History",
    "Biography Memoir"
  ],
  "author": "Paul Karl Feyerabend",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/147379.Killing_Time"
}