{
  "title": "Her Honor's Bodyguard",
  "description": "Do first loves ever really die? While reunions can take many forms, there is always one question that has to be answered sooner or later—what happened?Vance had always been extremely proud of Noella, and just because his life had been ruined, he saw no reason why she had to have the same faith. When his dad died, leaving him and his mother penniless, he dropped out of law school and ended his relationship with Noella, but in doing so, he stopped a scandal that could have ruined her family. These secrets he would never let her know. Ironically, years later, he would have never guessed she would be instrumental in ruining his career with the Tampa police force. After Noella finished law school and started pursuing her goal of working up the ranks in judgeships, she never considered inviting another guy into her life. As such, when someone attempts to threaten her into vacating her seat on the bench, and by force if necessary, she knows of no one else she really trust as much as Vance, who now has a successful bodyguard and private detective business.She knows that Vance might hate her for her part in having him dismissed from the police force, but what he will never know is that she actually saved him from going to prison. Additionally, she now thinks he was framed, and perhaps by the same people who are threatening her. She had to talk him into taking her on as a client . . . but would he agree to her request?As the number of attacks on her life increases, Vance soon has no choice but to offer her his protection, and in spite of everything, when they see each other again their old attraction for each other returns. She wants the truth. He wants the truth. However, making the ultimate sacrifice is not always easy to understand, whether given or received. Ultimately . . . could they now trust each other with these secrets? While their lives depend on discovering the truth to their past, these truths are locked in deep secrets that could also destroy them.",
  "genres": [
    "Romantic Suspense",
    "Romance",
    "Mystery",
    "Suspense",
    "Contemporary",
    "Action",
    "Fiction"
  ],
  "author": "Johnny Ray",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/14739522-her-honor-s-bodyguard"
}