{
  "title": "And the violins stopped playing: a story of the Gypsy Holocaust",
  "description": "\"I escaped from the ghetto!\" \"Ghetto! What were you doing there?\" \"There are plenty of Gypsies in the Warsaw ghetto. They are all wearing the 'Z' sign for 'Zigeuner' instead of']' for ']ude' ... You must run. Take your family and run!\" In Warsaw in 1942 Roman Mirga and his father and mother are living as Bareforytka Roma, big-town Gypsies, and working as a music trio in a night club favoured by German officers. But when this dramatic warning comes, from a cousin who has just escaped from the Germans, their hard-won way of life has to change fundamentally. They rejoin their kumpania of the Lowland Gypsies in Brest Litovsk. Perhaps back in the bosom of the tribe, and travelling, they will be safe. But the kumpania, and their leader the Shero Rom, do not see the danger, not even when the local German commandant offers them free housing in the old ghetto vacated by Jews who have been 'resettled'. After all, the Gypsies are Aryans too, as the Germans themselves tell. Events, however, suddenly move fast and dramatically, and a remarkable odyssey begins in which the Gypsies, now under a new Shero Rom, travel first in their carts, then on horseback and fmally by foot, facing hardship and hunger, hatred and destruction all along their route. Yet it is when they believe they have found security again in the Gypsies' traditional way of life that their moment of greatest danger arrives. Alexander Ramati's evocative story of the little-known Gypsy holocaust portrays the life and customs of the Lowland Gypsies with the love born of knowledge. But above all it is a story from World War II, powerfully brought to light and life, based closely on suppressed and refuted, hardly-known historical facts. AND THE VIOLINS STOPPED PLAYING is horrifying, tragic, and as unforgettable as it is moving - a story of man's inhumanity to men who are different, and the heroism of endurance that, despite it, can survive both in individuals and in nations.",
  "genres": [
    "Holocaust",
    "History",
    "Nonfiction",
    "World War II",
    "Biography",
    "War",
    "Poland"
  ],
  "author": "Alexander Ramati",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/1474003.And_the_violins_stopped_playing"
}