{
  "title": "The Magnesium Miracle",
  "description": "REVISED AND UPDATED 2014 EDITION Magnesium is an essential nutrient, indispensable to your health and well-being. By adding this mineral to your diet, you are guarding against—and helping to alleviate—such threats as heart disease, stroke, osteoporosis, diabetes, depression, arthritis, and asthma. But despite magnesium’s numerous benefits, many Americans remain dangerously deficient. Updated and revised throughout with the latest research, featuring an all-new Introduction, this amazing guide explains the vital role that magnesium plays in your body and life. Inside you will discover • newly available magnesium supplements that the body absorbs more efficiently• how calcium can increase the risk of heart disease—and how magnesium can lower it• a magnesium-rich eating plan as delicious as it is healthy• information on the link between magnesium and obesity• vitamins and minerals that work with magnesium to treat specific ailments• why paleo, raw food, and green juice diets can lead to magnesium deficiency• recent breakthroughs in magnesium’s medical and public perception The Magnesium Miracle, now more than ever, is the ultimate guide to a mineral that is truly miraculous.Praise for The Magnesium Miracle “Dr. Carolyn Dean has the best credentials for bringing solutions to those suffering from the hidden magnesium disorders that affect most of us. This book needs to be read by anyone wishing to improve their quality of life.” —Stephen T. Sinatra, M.D., author of The Sinatra Metabolic Cardiology “Clearly written and packed with information . . . a comprehensive and well-referenced guide to the myriad benefits of magnesium.” —Carolyn DeMarco, M.D., author of Take Charge of Your Women’s Health Advisor “Throughout this volume and with utmost clarity, Carolyn Dean presents invaluable recommendations—based on the latest magnesium research. Virtually every American can benefit.” —Paul Pitchford, author of Healing with Whole Asian Traditions and Modern Nutrition “Physicians and therapists have paid scant attention to this very important element, which is also involved in maintaining our good health. The massive evidence is here in this important book on magnesium. I am pleased to have been taking magnesium for so many years.” —Abram Hoffer, M.D., author of Putting It All The New Orthomolecular Nutrition",
  "genres": [
    "Health",
    "Nonfiction",
    "Nutrition",
    "Self Help",
    "Science",
    "Food",
    "Medical"
  ],
  "author": "Carolyn Dean",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/1474199.The_Magnesium_Miracle"
}