{
  "title": "100RPM - One Hundred Stories Inspired By Music",
  "description": "A collection of 100 flash fiction tales, all stories are inspired by songs on YouTube, each story being 100 words or fewer. Inspiring, thought-provoking and often witty, 100 RPM caters for all musical and storytelling tastes. And, most important of all, there's an introduction by Nik Kershaw. All money earned from sales will go to the charity One in Four (a registered charity which provides support and resources to people who have experienced sexual abuse and sexual violence). Every penny raised will make a difference to lives. 100 RPM includes stories from Rowan Coleman, Angi Holden, Matthew Borgard, Stephen Shieber, Matt Hill, Nik Perring, Nasim Marie Jafry, Sylvia Petter, Cally Taylor, Angela Readman, Ray Robinson, Katie Gunn, Angela Powers, Nick Cernis, Sophie Mackintosh, P.W. Lewis, Laura Crosby, Dan Purdue, Stephanie Ressort, Jessica Patient, Ryan Millar, Máire Carr, Dave Cornmell, Ruth Aird, Nicola De Gouveia, D. J. Kirkby, Elizabeth Player, Dan Powell, Michelle Flatley, Isabel Serval, Sara Crowley, Lynsey May, Simon Kewin, Fat Roland, Cathy White, Karl McIntyre, David Kendrick, Vikki Ross, Alison Woodhouse, Scott Pack, Sal Page, Helen Ladderbird, Hannah Harman, Catherine Walter, Suzy Floyd, Sonya Oldwin, Sam Wyld, Rachel N Joy, Emma J. Lannie, Annie Evett, Jennifer M Schmidt, Anna Cardus, Jodie Ansted, Red Morgan, D.E. Oprava, Donna Henderson, Xenia Smith, Louise Pearson, Cassie Morrison, Cassandra Parkin, Sam Thewlis, Polly Burns, Pete Domican, Hannah Simpson, Crystal Schwanke, Jennifer Domingo, Polly Johnson, L J Hart-Collins, Lorna Louise Hutchinson, Rebecca Emin, Caroline Luxford-Noyes, Edward Price, Carole McDonnell, Sarah Dunnakey, Teresa Nusbaum, Simon Kearns, Mike Bursell, Lisa Richardson, Cath Bore, Alexandra Brown, Tracy Kuhn, Sylvia Kelso, Kim Smith, J Bateman-Irish, Sarah Hutchison, PC Wheeler, Jamieson Wolf, Theresa Milstein, Jacqueline Christodoulou, Emily Wheeler and Caroline Smailes.",
  "genres": [
    "Short Stories",
    "Fiction"
  ],
  "author": "Caroline Smailes",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/14742305-100rpm---one-hundred-stories-inspired-by-music"
}