{
  "title": "Travels with Tinkerbelle - 6000 Miles Around France In A Mechanical Wreck",
  "description": "The author and her husband devised a simple plan – to take a tent and the dog and drive around the perimeter of France. Like many simple plans it went wrong before it started and they ended up with two dogs and a campervan named Tinkerbelle.  On the second day of their journey Tinkerbelle begins to self-destruct, helped by the new dog who does his best to eat her from the inside out. This is their story, as they travel from sandy beaches to snow-topped mountains exploring the diverse cultures, cuisines and countryside making up the country called France. Their journey takes them to places out of the ordinary, meeting interesting characters and witnessing ancient traditions. While the dogs rejoice in the freedom they find running on the beaches, Susie and Terry spend a lot of time holding their breath, wondering whether Tinkerbelle will manage to negotiate impossible mountain routes and get them home before she completely disintegrates.  'There are a handful of authors that will achieve that elusive trick of making you laugh out loud. For me it's James Herriot, Bill Bryson & Susie Kelly.' French Entree Magazine June 2013  A driving vacation with a difference!  Like Susie's other bestselling travelogue France books, Travels with Tinkerbelle is a mixture of travel and history sprinkled with humour. Fans of France, fans of travel writing, fans of Bill Bryson, Tim Moore and Peter Mayle will love this book.  Travels with Tinkerbelle is a revision of \"A Perfect Circle\", previously published by Transworld Publishers. Enhanced features of this edition include links to more information about the most significant places visited on the trip and an accompanying on-line photograph album.",
  "genres": [
    "Travel",
    "Nonfiction",
    "Memoir",
    "France"
  ],
  "author": "Susie Kelly",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/14742375-travels-with-tinkerbelle---6000-miles-around-france-in-a-mechanical-wrec"
}