{
  "title": "Life in the Aftermath of a Narcissist",
  "description": "As a sequel to Romance Stew and my quest for chivalric love, adventure, and intimacy, I found this time with a narcissist and his entire clan of takers to be a dark and harrowing trek through the bowels of the Twilight Zone. My marriage opened into an alien landscape - the wife of a man who later presented as bipolar, the perfectionist step-father, his invalid mother with the diagnosis of Asperger's Syndrome and just perhaps a manipulator of emotional incest, and a bipolar/alcoholic adult son who brought the baggage of his forever present mother and her drunken and drugged-out sister into the mix. I was ill prepared in my enthusiastic dash for one final chance to have love with all-thetrimmings to face such frighteningly foreign attitudes and failed miserably to ascertain the reality of these people before saying \"I do.\" I was blindsided by the close dynamics and tight allegiances of the quicksand into which I naively was drawn,leaving me drowning in never-ending demands and overwhelming presences. Where Had I lost myself? I was no wide-eyed teenager. Was I really codependent and unable to be a functioning individual? Letting all my financial holdings be liquidated, always with the promise of \"we have the rest of our lives to make this up,\" and refusing to live in a camper on the folks' property to be at the mother's beck and call, I was left out-in-the-cold when I refused the final pressuring to sell my tiny house. The world of narcissism/psychopathy left me exhausted and terrified - there was no empathy for me as a being. I was only a tool to be used. All the emotions that popped on stage with pretense of sincere caring and connectedness were simply character devices. I had been so bombarded with a perpetual stream of demands, lack of sleep, gas lighting, tests to prove my worth as a wife and for the clan, and almost round-the-clock inundation into their belief systems of using others and the general assemblage of living, I suffered a type of relationship Stockholm Syndrome. When my utilization purposes ended, I was cut from the clan as coldly and precisely as if it were a surgical procedure. I was no longer valuable to these people. It was a long journey back to find myself. The strange morals of the group always left me feeling out-of-focus. There are many of us survivors and we are taking steps to reclaim our lives. I knew Cinderella would still have to clean the castle and that the Prince would be away on exciting travels. I had sought the fairy tale and although aware, knowledgeable, and eager for a new adventure, found myself lost in a panic-filled fun house of mirrors and fog.",
  "genres": [],
  "author": "Becky Ruff Reed",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/14742028-life-in-the-aftermath-of-a-narcissist"
}