{
  "title": "Women Who Love Psychopaths",
  "description": "Sandra L. Brown, M.A., CEO of The Institute for Relational Harm Reduction & Public Pathology Education is a psychopathologist, program development specialist, lecturer, and an award-winning author. Her books include Counseling Victims of Violence: A Handbook for Helping Professionals (1991, 2006), How to Spot a Dangerous Man Before You Get Involved Book and Workbook (2005) and Women Who Love Psychopaths (2008). Sandra is recognized for her pioneering work on women's issues related to relational harm with Cluster B/Axis II disordered partners and specializes in the development of Pathological Love Relationship clinical training and survivor support services. Her books, CD's, DVD's, and other training materials have been used as curriculum in drug rehabs, women's organizations and shelters, women's jail and prison programs, school and college-based programs, inner city projects, and various psychology and sociology programs and distributed in almost every country of the world. Her collaborative research on Women Who Love Psychopaths was recently presented at the Society for the Scientific Study of Psychopathy as well as the Ruth Ginsberg Lecture Series Women and The Law on Domestic Violence, and Domestic Violence Provider and Batterer Intervention Training in which her unique focus on Pathological Love Relationships has been featured. Under her direction The Institute has developed a comprehensive online psychopathology magazine interviewing some of the country's leading researchers on personality disorders and neurobiology, a Therapist Certification Program in Pathological Love Relationships, a Peer-Support Coaching Program, and a Model of Care Approach for Treatment Centers. Sandra's previous work included the founding and directing of Bridgework Counseling Center, a multifaceted mental health treatment center for Trauma Disorders, Treatment of Personality Disorders, and one of the country's first long-term residential programs for women with Dissociative Identity Disorder. She was also a pathologist on a Woman's Trauma Inpatient Hospital Program. She facilitated groups on PTSD and Dialectical Behavioral Therapy as well as individual treatment. Sandra holds a Master's Degree in Counseling.",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Relationships",
    "Self Help",
    "Mental Health",
    "Sociology",
    "Womens"
  ],
  "author": "Sandra L. Brown",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/14742053-women-who-love-psychopaths"
}