{
  "title": "Just Another Paranormal Halloween",
  "description": "On the Darkest Knight of a Pixie's Holiday, you'll feel an A-mazing Grace, but beware of Love, Lies and Zombie Cries, for Samhain's Visitor and His Girl will arrive at the Tiger's Masquerade, followed by the Man in the Long Black Coat. It's Just Another ParaNormal Halloween at the Castle... Mojocastle. A Pixie Holiday by Brigit Aine On Halloween Kira is able to go out with no glamour on and allow others to see her true self, a pixie. As she is trying to avoid the man her father sent years ago to try and marry her, she runs into someone else, someone who makes her feel safe and protected. Although she isn't even aware that she needs protecting, yet.Lance knows he needs to get Kira to like him, after all they are going to be married, but he has to keep her safe and get her to the conclave before any of that can happen. And it seems as if those who do not want to see an alliance between the Pixies and the Wolves would do whatever it takes to make sure his plans are foiled.---------------------------------------------------------Darkest Knight by Ashley Blade Julie asked herself the same question many times, especially after reading one of her favorite paranormal stories.Now what seemed like a fantasy world captured in descriptive words becomes her reality and she has to figure out if it was all it was cracked up to be. ---------------------------------------------------------The Man in the Long Black Coat by Susan GabrielMariah Bishop, the preacher's daughter, lives in a town where religion and superstition are so deeply entwined there's no telling where one ends and the other begins. But her father, the good Eldon Bishop fears there is something more than religious rapture stirring in the young Mariah. When the mysterious man in the long black coat blows into town and holds an old-time revival on All Hallow's Eve, Mariah and the colorful characters who surround her are set on a course with consequences they couldn't possibly foresee.---------------------------------------------------------Samhain's Visitor by Kiki HowellWhen an uninvited visitor shows up during Sarah’s Samhain ritual, her Mute Supper is literally disrupted by cups and plates being tossed about. Soon, the shadow weighing on her and the voices with cryptic messages incite terror.But help comes in various forms. And, one is sexy and full of surprises.---------------------------------------------------------The Tiger's Masquerade by Savanna Kougar Stacy wasn’t looking for a tiger-man to erotically and exotically fill her tank , then steal her heart. That is, until the Halloween ‘Call of the Wild Masquerade’ ball. But, what kind of tiger does she have by the tail?Zyrru wasn’t looking for a human woman to un-tame his fiercest passions, and alter his royal life forever. After all, he’s only vacationing on Earth, and is almost engaged to The Princess. But her rosefire scent is irresistible.---------------------------------------------------------A-Mazing Grace by D. McEntire Halloween never meant anything special to Grace. That is until taking up an offer by her best friend for a night time trip through a local corn maze leaves her changing her tune—and her life. Coming face-to-face with a man sporting glowing red eyes and fangs, then rescued by a man who seemed just as unreal as the first makes for one hell-of-a wild night only she seems to remember. Connell has hunted alongside his brothers for centuries, following a code to protect the secret of their race—vampires—by removing rogue vampires who refuse to blend in among society. That secret is threatened when wiping the memory of a feisty human female he saves from a rogue doesn’t take completely. But it isn’t her recollection of him that leads her deeper into his world. Arriving moments too late on the scene of her second attack by a rogue leaves him facing the choice of converting her or leaving her to die. ---------------------------------------------------------Love, Lies & Zombie Cries by K.A. M'LadyJayda Oslynn knows what death feels like. She knows the solitude in the darkness’ silence. The lonely spaces between life’s last breath and the realm of the undead.Like the women in her family before her, she’s had a life-long affinity with those that wander in the land between. Some call it black magick or necromancy, but to the Oslynn family it’s always been known as death dealing. And, whether a blessing or a curse, Jayda’s always been able to feel their feelings – their love and suffering, their happiness and sorrows. The truth, when shared through her eyes, always has a way of being felt and seen.This Halloween, Jayda finds that when dealing with the dead, some memories are better left buried, for the real truth never stays buried and hearts, once broken seldom seem to mend.---------------------------------------------------------His Girl by Sapphire Phelan My Girl was more than just a song for Evan McPhail and Aimee Saunders; it was the music of their love and passion for each other. For nothing could tear them apart, not even death. Then Aimee vanished. She returns to Evan thirty years later, no longer human. To the tempo of their passion, they prove that doesn't matter.",
  "genres": [
    "Anthologies"
  ],
  "author": "Ashley Blade",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/10489091-just-another-paranormal-halloween"
}