{
  "title": "Searching for Arthur",
  "description": "Legend tells of King Arthur, mortally wounded at the hand of the traitorous Mordred in the final battle of Camlann. Before he was taken to the magical Vale of Avalon, Arthur declared that one day he would return, when the kingdom of Logres was once more in need of his leadership.That day has now come.It is hard to make friends when you’re constantly on the move. Seventeen-year-old Natasha Roth’s father is a diplomat, and so her mother – who is paranoid about terrorists – has moved Natasha and her brother, Arthur, to their eighteenth house in seventeen years: Avalon Cottage, deep in the heart of a Welsh forest.Yet the terrorists are closer than they realize.While out running, Natasha falls into a hidden tomb and awakens the legendary knights of Camelot: young warriors who have been in an enchanted sleep for a thousand years. All have been waiting patiently for the return of Arthur from the mysterious land of Avalon.And now the knights are awake, they intend to reclaim their king.When Arthur goes missing, Natasha joins forces with his girlfriend, “Slurpy” Samantha, in order to look for him. Natasha believes Samantha has fewer brain cells than an amoeba; Samantha believes Natasha is a freak. Retracing Natasha’s original steps to the hidden tomb, they bicker their way into a Welsh mountain and beyond, to the realm of Logres where the Knights of the Round Table are rallying once more.Natasha falls in love with Sir Bedivere, the most loyal of knights to Arthur. He may be in dire need of a 21st Century razor, but he still possesses a set of lime-green eyes that can melt the soul. Yet just as Natasha starts to find confidence in this mystical land, Samantha deserts her. People who play by the rules are of no use to “Slurpy”. Samantha will take her own path to Arthur, aided and abetted by the dark arts which she willingly absorbs from a hot young stranger called Mordred.A race across magical yet deadly lands is on. Natasha battles dwarf-riders, dragons, and eventually “Slurpy” to reach Camelot, where Arthur is held captive by the barbarian Saxon, Balvidore.Natasha’s woes become numerous. What will happen to her and Arthur when the knights realise the eighteen-year-old boy they thought was their king, is in fact a math student with appalling taste in girls? Can two people with a one thousand year age gap really have a relationship? And for the love of all things holy, how is a girl supposed to ride bareback in a pair of skinny jeans?",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Time Travel",
    "Arthurian",
    "Romance",
    "Mythology",
    "Magic"
  ],
  "author": "Donna Hosie",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/14759013-searching-for-arthur"
}