{
  "title": "The Hidden Light of Mexico City",
  "description": "With political suspense, passion for the place, and brutal truth pulled from today's headlines, this debut political thriller illuminates the fight for Mexico's future.A CHANCE MEETING FOR A MANMexico City attorney Eddo Cortez Castillo's unexpected relationship with housemaid Luz de Maria Alba Mora becomes a dangerous vulnerability when he investigates links between the Minister for Public Security and Mexico's most elusive drug cartel leader. But what Eddo doesn't know is that Luz is trapped at the bottom of Mexico's ladder of inequality, where broken dreams and family poverty have brought her to the breaking point.  FOLLOWING A BLOOD MONEY TRAIL OF CARTELS AND CORRUPTIONAs presidential elections near, Eddo's investigation will uncover a political double-cross fueled by blood money and drug cartels. With the help of a secret police network, he'll follow the trail as it twists and turns through a maze of smuggling and money laundering right up to the Mexican border with the United States. There he'll find the beating heart of Mexico's drug culture, where violence buys loyalty, votes are for sale, the odds are against survival, and only a woman whose name means Light of Mary can guide him out. AND A WOMAN WHO FACES THE FIGHT OF HER LIFELuz cannot help Eddo, however, until she finds the courage to confront the social structure she has lived with for so long in Mexico City and dispel the supposed inequality in their relationship. She'll fight a parallel battle of suspense and survival as a soldier in the war being waged in the kitchens of the elite of Mexico City; a silent class war with its own impact on the country. Immigration to the United States may be her best chance for a real life as an artist, but it comes with a higher price than she may be able to pay.When the lives of Eddo and Luz converge, and the cartels discover his investigation, they will both have to find the courage to survive. If they do, the real battle will have just begun. Cartels and corruption need the dark. Who will have the courage to shine a light?",
  "genres": [
    "Mystery",
    "Thriller",
    "Suspense",
    "Mystery Thriller",
    "Fiction",
    "Contemporary Romance",
    "Crime"
  ],
  "author": "Carmen Amato",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/14761023-the-hidden-light-of-mexico-city"
}