{
  "title": "The \"Greene Shorts\" Bestiality Collection: Vol. 1",
  "description": "Joyful sex with some lucky animals is the theme in each of the five sizzling-hot tales in this volume of \"Greene Shorts\" short stories from erotica writer Esmeralda Greene. Four of these stories have been previously released individually, and one is all new, unavailable anywhere else. The stories are:1: \"Great With Child\" - Maisey is a farm girl who's very pregnant -- and very horny. When her husband leaves early one morning without taking care of her needs, she soon finds herself driven to distraction. Luckily she has the farm animals for company...2: \"Mom and Muttly\" - Mother-son incest and bestiality join forces in this tale. When Kyle catches his mother in a compromising position with the family dog, his long-simmering lust for her boils over. But does his mother share his incestuous desire?3: \"The Dog Upstairs\" - As a veterinarian, John has seen a lot of pets and their owners. But when his beautiful upstairs neighbor phones him about a \"sort of a problem\" with her Dalmatian, he soon finds himself embarking on the wildest sexual adventure of his life!4: \"Mary and Joseph\" - In another tale of incest and doggy-sex, Mary is a college student who's got some surprises in store for her father and her brother. They each learn about her \"special relationship\" with her dog, and her lust for each of them as well!5: \"Auntie's Horses\" - This story is available only in this volume! When siblings Eric and Sylvia visit their aunt's farm, they soon find that their incestuous relationship is even more fun when one of their auntie's horses joins in and makes it a three-way. And soon their mother and their aunt are making a similar discovery!This is Esmeralda Greene's first collection of entirely bestiality-themed short stories. None of these stories have been released in a collection before.",
  "genres": [
    "Erotica"
  ],
  "author": "Esmeralda Greene",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/14761442-the-greene-shorts-bestiality-collection"
}