{
  "title": "The Pretty One",
  "description": "Perfect. Pretty. Political. For nearly forty years, The Hellinger sisters of Hastings-on-Hudson-namely, Imperia (Perri), Olympia (Pia), and Augusta (Gus) -- have played the roles set down by their loving but domineering mother Carol. Perri, a mother of three, rules her four-bedroom palace in Westchester with a velvet fist, managing to fold even fitted sheets into immaculate rectangles. Pia, a gorgeous and fashionable Chelsea art gallery worker, still turns heads after becoming a single mother via sperm donation. And Gus, a fiercely independent lawyer and activist, doesn't let her break-up from her girlfriend stop her from attending New Year's Day protests on her way to family brunch.But the Hellinger women aren't pulling off their roles the way they once did. Perri, increasingly filled with rage over the lack of appreciation from her recently unemployed husband Mike, is engaging in a steamy text flirtation with a college fling. Meanwhile Pia, desperate to find someone to share in the pain and joy of raising her three-year-old daughter Lola, can't stop fantasizing about Donor #6103. And Gus, heartbroken over the loss of her girlfriend, finds herself magnetically drawn to Jeff, Mike's frat boy of a little brother. Each woman is unable to believe that anyone, especially her sisters, could understand what it's like to be her. But when a freak accident lands their mother to the hospital, a chain of events is set in motion that will send each Hellinger sister rocketing out of her comfort zone, leaving her to was this the role she was truly born to play?With The Pretty One , author Lucinda Rosenfeld does for siblings what she did for female friendship in I'm So Happy for You , turning her wickedly funny and sharply observant eye on the pleasures and punishments of lifelong sisterhood.",
  "genres": [
    "Fiction",
    "Chick Lit",
    "Contemporary",
    "Book Club",
    "Novels",
    "Family",
    "Adult Fiction"
  ],
  "author": "Lucinda Rosenfeld",
  "average_rating": "2.96",
  "url": "https://www.goodreads.com/book/show/14781234-the-pretty-one"
}