{
  "title": "Rico Slade Will F*cking Kill You",
  "description": "What the crap is Arnold Schwarzenegger doing on the cover of Rico Slade's book? This is Rico Slade's goddamn book. Rico Slade is not a body builder, an actor, or a governor. Rico Slade is an action hero. Rico Slade doesn't care about the political climate. Rico Slade has an advance degree in badassery. Rico Slade's favorite food is the honey-roasted peanut. Rico Slade can rip out a throat with his bare hands. But Rico Slade's arch nemesis, Baron Mayhem, is threatening to drop a bomb on the Earth that will kill every human being except himself while leaving the world's currency intact. To save the planet, Rico Slade must journey across Hollywood to find Baron Mayhem. Unfortunately, Rico Slade's crime fighting style involves ripping out the throat of anyone who gets in his way, including grandmothers and Midwestern tourists.As Rico Slade leaves Hollywood in ruins, the only person who can stop him from destroying the city is his Jewish psychologist, Harold Schwartzman. Until he does, Rico Slade will kill as many people as it takes to thwart Baron Mayhem's evil scheme. Rico Slade will fucking kill everyone.RICO SLADE WILL FUCKING KILL YOU.Praise for the book:\"A one-man Expendables wrecking crew.\" - SUPERHERO NOVELS\"Rico Slade can grab Chuck Norris by a wrist and an ankle and use him as a jump rope. If you're looking for some well-crafted literary mayhem that entertains and pleases in equal degrees, this is the book for you.\" - THE AUSTIN POST\"And, though brilliant and vastly intelligent, it should also be noted that Bradley Sands is a dick.\" -CRACKED.COM\"If you like violence. If you have a decent sense of humor. If you have ever wondered what would happen if Richard Brautigan wrote a 90's action film instead of killing himself in the winter of 1984...These are all great reasons to read Rico Slade Will Fucking Kill You.\" - HOUSEFIRE\"Rico Slade Will Fucking Kill You is a biting piece of satire on the \"unreality\" of Hollywood.\" -THE UNDEAD RAT \"Rico Slade Will Fucking Kill You is laugh out loud funny, full of cheesy dialogue, testosterone, and can easily be read in one sitting. Buy it now or Rico Slade might rip out your fucking throat.\"- SPONTANEOUS COMBUSTION\"If Eugene Ionesco had a threesome with two reels of 80s action movies, the baby would be this book. If you like ridiculous humor with the hands-down wildest action you will ever read, this is your book.\" - ZOMBIEBLOODFIGHTS",
  "genres": [
    "Bizarro Fiction",
    "Fiction",
    "Humor",
    "Horror",
    "Action",
    "Science Fiction",
    "Comedy"
  ],
  "author": "Bradley N. Sands",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/10492085-rico-slade-will-f-cking-kill-you"
}