{
  "title": "Stolen",
  "description": "Fiction. Finalist, Giller Prize. Winner of 2 Saskatchewan Book Awards (Best First Book; City of Saskatoon Book Award). Finalist, Saskatchewan Book Award (Book of the Year). Winner, Canadian Authors' Association- BookTV Emerging Writer Award. Finalist, Amazon/ Books in Canada First Novel Award. Globe and Mail Top 5 First Fiction. Kate Sutherland's \"Top Ten Books of 2006\".Rowan Friesen has made a career of drug dealing and small-time thievery. He lives a loner's life on the outer reaches of Saskatoon, selling crystal meth to highschoolers and hawking his pilfered loot on the net. Shiftless and seemingly friendless, he is, at first glance, an unlikely and unlikable protagonist. But as STOLEN unfolds, we learn the details on Rowan's his well-meaning but self-absorbed mother, his mentally ill father and a high school friendship both lustful and incendiary. This intriguing back-story runs alongside a present-day murder mystery, complete with road trips, arson, alchohol and drugs, tech nerds and the Royal Canadian Mounted Police. Rowan Friesen may not be the world's most likable character, but the complexity and honesty of his story is thrilling. STOLEN's lean, tight narrative tells a tale of theft, love, and madness on the Canadian prairie, and moves along like a half-ton pickup bouncing over dirt roads.\"Lapointe constructs the familiar world, the one inside each of us, in the lives of strangers. It's what fiction does best.\"— The Globe and Mail\"It moves with the force of what's right and true and must not be elided.\"—Giller Prize Jury\"One of the many achievements of STOLEN is that it offers readers of Canadian literature [a] depiction of a Saskatchewan in transition from a predominantly rural agrarian society to an urban one dominated by global capitalism … This Saskatchewan might be fallen, but its residents persevere. Moreover, STOLEN proposes that the province was never as pristine as it might have appeared. Lapointe's novel, in its innovative, contemporary depiction of the province, heralds a brave new age of prairie writing. For this it should be celebrated.\"— Canadian Literature",
  "genres": [
    "Fiction",
    "Canada",
    "Crime",
    "Canadian Literature"
  ],
  "author": "Annette LaPointe",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/1049333.Stolen"
}