{
  "title": "A Surplus of Memory: Chronicle of the Warsaw Ghetto Uprising",
  "description": "In 1943, against utterly hopeless odds, the Jews of the Warsaw Ghetto rose up to defy the Nazi horror machine that had set out to exterminate them. One of the leaders of the Jewish Fighting Organization, which led the uprisings, was Yitzhak Zuckerman, known by his underground pseudonym, Antek. Decades later, living in Israel, Antek dictated his memoirs. The Hebrew publication of Those Seven Years: 1939-1946 was a major event in the historiography of the Holocaust, and now Antek's memoirs are available in English.Unlike Holocaust books that focus on the annihilation of European Jews, Antek's account is of the daily struggle to maintain human dignity under the most dreadful conditions. His passionate, involved testimony, which combines detail, authenticity, and gripping immediacy, has unique historical importance. The memoirs situate the ghetto and the resistance in the social and political context that preceded them, when prewar Zionist and Socialist youth movements were gradually forged into what became the first significant armed resistance against the Nazis in all of occupied Europe. Antek also describes the activities of the resistance after the destruction of the ghetto, when 20,000 Jews hid in \"Aryan\" Warsaw and then participated in illegal immigration to Palestine after the war.The only extensive document by any Jewish resistance leader in Europe, Antek's book is central to understanding ghetto life and underground activities, Jewish resistance under the Nazis, and Polish-Jewish relations during and after the war. This extraordinary work is a fitting monument to the heroism of a people.",
  "genres": [
    "Holocaust",
    "History",
    "Nonfiction",
    "World War II",
    "Contemporary",
    "War",
    "Jewish"
  ],
  "author": "Yitzhak (\"Antek\") Zuckerman",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/147969.A_Surplus_of_Memory"
}