{
  "title": "The Zen of Zombie: Better Living Through the Undead",
  "description": "The world of the The Walking Dead meets the Ram Das Deepak Chopra crowd in this hilarious parody of self-help manuals. Learn how to slow down and move at your own pace, become your own boss, and just devour those irritating people who get in your way.Do you struggle out of bed each morning and sway lifelessly across the room, mouth agape, arms hanging slack, murmuring unintelligibly? Well, take you’re not alone! But these other staggering, limp, perpetually drowsy folks just happen to be zombies—and it turns out they can teach us a lot about enjoying life. And only here, between the covers of this book, will you learn their secrets to happiness.And there’s more, because zombies can offer no-nonsense advice on love, playing to your strengths, and more. The table of contents Learn how to love your undead yourself and succeed in the real world.“We’ve all heard the slurs and stereotypes, but few people stop to consider how much humans have to learn from zombies. What about all the good things zombies do? This book is a guide through the life lessons that can be gleaned from one of the netherworld’s most successful the implacable, untamable zombie. Whatever your setback or ailment, zombies feel your pain. Have you ever felt as if other people were smarter than you? Quicker on the uptake? Zombies feel this way every day. Have you ever been tongue-tied while those around you knew exactly what to say? (Maybe when you did speak, it came out as nothing more than some guttural croaks and gurgles, and possibly very simple words like ‘brains?’). Zombies haven’t let this stop them. Do you drool at inappropriate times? Stagger when you walk? Stare unblinkingly at passersby, sometimes for hours on end, unnerving each one of them?”",
  "genres": [
    "Zombies",
    "Humor",
    "Horror",
    "Comedy",
    "Nonfiction",
    "Philosophy",
    "Self Help"
  ],
  "author": "Scott Kenemore",
  "average_rating": "3.40",
  "url": "https://www.goodreads.com/book/show/1480257.The_Zen_of_Zombie"
}