{
  "title": "The Posthuman",
  "description": "The Posthuman offers both an introduction and major contribution to contemporary debates on the posthuman. Digital 'second life', genetically modified food, advanced prosthetics, robotics and reproductive technologies are familiar facets of our globally linked and technologically mediated societies. This has blurred the traditional distinction between the human and its others, exposing the non-naturalistic structure of the human. The Posthuman starts by exploring the extent to which a post-humanist move displaces the traditional humanistic unity of the subject. Rather than perceiving this situation as a loss of cognitive and moral self-mastery, Braidotti argues that the posthuman helps us make sense of our flexible and multiple identities.Braidotti then analyzes the escalating effects of post-anthropocentric thought, which encompass not only other species, but also the sustainability of our planet as a whole. Because contemporary market economies profit from the control and commodification of all that lives, they result in hybridization, erasing categorical distinctions between the human and other species, seeds, plants, animals and bacteria. These dislocations induced by globalized cultures and economies enable a critique of anthropocentrism, but how reliable are they as indicators of a sustainable future?The Posthuman concludes by considering the implications of these shifts for the institutional practice of the humanities. Braidotti outlines new forms of cosmopolitan neo-humanism that emerge from the spectrum of post-colonial and race studies, as well as gender analysis and environmentalism. The challenge of the posthuman condition consists in seizing the opportunities for new social bonding and community building, while pursuing sustainability and empowerment.",
  "genres": [
    "Philosophy",
    "Nonfiction",
    "Theory",
    "Feminism",
    "Academic",
    "Anthropology",
    "Essays"
  ],
  "author": "Rosi Braidotti",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/14803527-the-posthuman"
}