{
  "title": "Louis Armstrong: An Extravagant Life",
  "description": "Louis Armstrong was the founding father of jazz and one of this century's towering cultural figures.  His musical innovation and exuberance made him a household name, yet the full story of his extravagant life has never been told.  Now, drawing on a vast, previously unexplored archive of Armstrong's writings and recordings, acclaimed biographer Laurence Bergreen presents an intimate, provocative, and definitive portrait of the legendary Pied Piper of American music.The musical talents of Satchmo--as Armstrong became universally known--were prodigious and groundbreaking.  After learning to blow his horn in the bordellos and honky-tonks of Storyville, New Orleans's bustling red-light district, he honed his sound on a Mississippi riverboat and later became a featured solo trumpeter in the nightclub bands of Chicago and New York, where his stunning musicianship, gravelly voice, and irrepressible personality captivated audiences and critics alike.  Countless recordings, nonstop touring of America and Europe, a radio show--the first ever hosted by a black man--and film appearances catapulted him to international stardom, yet he always remained true to himself and loyal to his roots.  Despite his successes, Armstrong's career was also marked by intense struggle--against the Depression, against the Chicago gangsters of the 1930s, and, above all, against racial prejudice.A revolutionary musician and entertainer, Louis Armstrong was also a character of epic proportions.  Born in 1901 to the sixteen-year-old daughter of a slave, he came of age, joyfully, among the prostitutes, pimps, and rag-and-bone merchants of New Orleans.  He married four times and enjoyed countless romantic involvements in and around his marriages.  Throughout his rich and varied life, he was a believer in marijuana for the head and laxatives for the bowels; a prolific diarist and correspondent; a devoted friend to celebrities from Bing Crosby to Ella Fitzgerald; a perceptive social observer; and, in his later years, an international goodwill ambassador.  Even as segments of the black community scorned him as a sellout to the white establishment, Armstrong broke color barriers wherever he went and helped other blacks to find equality and identity in modern America.  \"You see that horn?\" he would ask his adversaries.  \"That horn ain't prejudiced.  A note's a note in any language.\"Filled with insights and information gleaned from Armstrong's voluminous reminiscences and featuring a superb collection of photographs, this remarkable book brings to life as never before the charismatic figure who forever changed the face of music.  In vivid detail and with warmth, wit, and breathtaking sweep, Laurence Bergreen's Louis Armstrong reveals a man of passion, courage, humor, and genius.",
  "genres": [
    "Biography",
    "Music",
    "Jazz",
    "Nonfiction",
    "History",
    "American",
    "United States"
  ],
  "author": "Laurence Bergreen",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/1480846.Louis_Armstrong"
}