{
  "title": "Plum Boxed Set 2",
  "description": "This boxed set contains three hilarious Stephanie Plum novels from Janet Evanovich: Four to Score, High Five and Hot Six.Four to Score: Stephanie Plum, Trenton, New Jersey's favorite pistol-packing, condom-carrying bounty hunter, is back--and on the trail of a revenge-seeking waitress who's skipped bail. With then help of 73-year-old Grandma Mazur, ex-hooker Lula, a transvestite musician named Sally Sweet, and the all-too-hospitable, all-too-sexy Joe Morelli, Stephanie might just catch her woman. Then again, with more mishaps than there are exits on the Jersey Turnpike--including murders, firebombs, and Stephanie's arch-rival bounty hunter chasing after the same fugitive--Stephanie better watch her back big-time if she wants to live to crack this case. High Five: Bounty hunter Stephanie Plum sets out to find her missing uncle-- and along the way smacks slam-bang into: a dead body, a nasty bookie, her stun-gun-toting grandmother, two very sexy men, an angry little man who won't leave her apartment, and a Mafia wedding. Jersey's favorite bounty hunter has never been better! With high hair, street smarts and plenty of attitude, Steph's sure to nail this case-- or risk life and spandex-clad limb trying... Hot Six:Bounty hunter Stephanie Plum and Trenton vice cop Joe Morelli join forces to find the madman killer who shot and barbecued the youngest son of international black-market arms dealer Alexander Ramos. Carlos Manoso, street name Ranger, is caught on video just minutes before the crime occurs. He's the number-one suspect. Ranger is Stephanie's mentor--the man who taught her everything she knows about fugitive apprehension. And he's more than her friend",
  "genres": [
    "Mystery",
    "Humor",
    "Fiction",
    "Romance",
    "Chick Lit",
    "Cozy Mystery",
    "Contemporary Romance"
  ],
  "author": "Janet Evanovich",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/148140.Plum_Boxed_Set_2"
}