{
  "title": "NexLord: Black Chains",
  "description": "The NexLord series is a traditional fantasy in the sense that it deals with strong good and evil. The focus of this epic fantasy story are four young people caught up in a deadly struggle started long ago. It explores the good and evil power of all emotions. The magic system is based on emotion and deals with the power of group beliefs and self fulfilling prophecy. The setting of the story is a unique planet where all normal human emotional tendencies are magnified. Humans are not alone there, and four other intelligent races inhabit the lands as well. Prejudice runs rampant and wars based on racial hatred have plagued the lands for hundreds of years. The emotions of hate and fear have coalesced into one place and continuously inhabit the body of a human, known as the Dreadmaster. This being continuously gathers and wields these evil powers. The ever growing power exists independently of the human vessel it inhabits, and when the body is destroyed it is only a matter of time until the power inhabits a new vessel. To combat the Dreadmaster's power all free humans gathered at one time and created a power fueled by their common belief and emotional need, a power that can be given to a NexLord. Using a check an balance system to keep this power from being abused a test was created. Those who pass this test become Knights of the Realm, known as NexLords. The NexLords and their Bondsmen are the one counter to the Dreadmaster's power. But with the ending of the Final War the last of the NexLords disappeared into the east, warning that the Dreadmaster's power was still out there, but no one listened or believed. For three hundred years now there has not been a new Dreadmaster and no one in the Human Realm has followed the difficult path to become a NexLord. However, there is a Prophecy spreading across the land, a prophecy that tells of the coming of a new NexLord who will bring a golden age. But what it predicts is about to go terribly wrong... for there is another prophecy, a Dark Prophecy, and the world is about to change to that path. Black Chains is the second novel of the NexLord Trilogy. A young man has suddenly become a NexLord, without knowledge of what that means or the powers it conveys. Opposing him are all the evils of the world: Dreadbeasts, Wraiths, evil cults, and dark prophecies. The epic adventure continues as the NexLord and his friends battle a world gone mad, where everyone seems to be their enemy.",
  "genres": [
    "Fantasy"
  ],
  "author": "Philip Blood",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/10494027-nexlord"
}