{
  "title": "Chechen Jihad: Al Qaeda's Training Ground and the Next Wave of Terror",
  "description": "In this authoritative look at the roots of modern terrorism, Yossef Bodansky, one of the most respected—and best-informed—experts on radical Islamism in the world today, pinpoints the troubled region of Chechnya as a dangerous and little-understood crucible of terror in the struggle between East and West. In his number one New York Times bestseller, Bin The Man Who Declared War on America , published before 9/11, Bodansky was among the first to introduce American readers to Osama bin Laden. Now in Chechen Jihad he returns to alert American readers to the lessons to be drawn from the terror campaign in Chechnya—and its ramifications for the global war on terrorism. The final years of U.S.-Soviet relations left Chechnya a fertile breeding ground for Islamic terrorism, and in the past decade an uneasy alliance of native Chechen separatists and militant jihadists have joined forces to help al Qaeda and the greater Islamist movement pursue its war against the West. As Bodansky points out, \"the Chechens are professional fighters—disciplined and responsible, with a combination of skills, expertise, and character that has made them the most sought-after 'force multipliers' in the jihadist movement.\" Bodansky traces the secret history of the two Chechen wars, illuminating how the process of \"Chechenization\" transformed the fight from a secular nationalist struggle into a jihadist holy war against Russia and the secular West. And, in the most instructive message for Western audiences, he reveals how the Chechen rebellion was eventually crippled by a schism between the jihadists and the Chechen people whose nationalist rebellion they had co-opted—an object lesson in the potential vulnerability of Islamist campaigns around the world. Drawing on mountains of previously unseen intelligence from Islamist movements and other military and intelligence sources from throughout the Middle East and Central Asia, as well as senior officials in many of the affected nations, Chechen Jihad offers an intimate and startling portrait of the jihadist movement that is astonishing in its detail and chilling in its implications—but one that points to a new way forward in the struggle to answer the challenges of international Islamist terrorism.",
  "genres": [
    "Islam",
    "Russia",
    "Military Fiction",
    "Politics",
    "Nonfiction",
    "Terrorism",
    "History"
  ],
  "author": "Yossef Bodansky",
  "average_rating": "3.46",
  "url": "https://www.goodreads.com/book/show/1481831.Chechen_Jihad"
}