{
  "title": "Dymer",
  "description": "Written in 1926 before Lewis' conversion. This is a work of narrative poetry. It is similar in some ways to Lewis's first work \"Spirits in Bondage\", which was also a poetic work. It has the same dark feeling that the first one did. What is interesting is that the first book is called \"Spirits in Bondage\", and the cover of this work has a soul breaking free of bondage. Yet the tale is ultimately a sad one. This is essential reading for all C. S. Lewis fans, and helps show the evolution of his thought and faith from an angry and lonely atheist to a leading light of Christian thought in the 20th century. The cover is from the original 1926 edition. The text includes Lewis' introduction to the 1950 republication. As far as we can see \"Dymer\" has only been published as a separate work four times. 1926, 1950, 1998 and 2002. This is the fifth time. But uniquely this is the first time the work has ever been published in eBook format. We have endeavoured to stay true to the original formatting, while at the same time fixed any obvious errors we found. C. S. Lewis' 1950 As its original appearance in 1926, Dymer, like many better books, found some good reviews and almost no readers. The idea of disturbing its repose in the grave now comes from its publishers, not from me, but I have a reason for wishing to be present at the exhumation. Nearly a quarter of a century has gone since I wrote it, and in that time things have changed both within me and round me; my old poem might be misunderstood by those who now read it for the first time. I am told that the Persian poets draw a distinction between poetry which they have ‘found’ and poetry which they have ‘brought’: if you like, between the given and the invented, though they wisely refuse to identify this with the distinction between good and bad. Their terminology applies with unusual clarity to my poem. What I ‘found’, what simply ‘came to me’, was the story of a man who, on some mysterious bride, begets a which monster, as soon as it has killed its father, becomes a god. This story arrived, complete, in my mind somewhere about my seventeenth year. To the best of my knowledge I did not consciously or voluntarily invent it, nor was it, in the plain sense of that word, a dream. All I know it is that there was a time when it was not there, and then presently a time when it was. Every one may allegorise it or psychoanalyse it as he and if I did so myself my interpretations would have no more authority than anyone else’s.",
  "genres": [
    "Poetry",
    "Fiction",
    "British Literature",
    "Fantasy"
  ],
  "author": "C.S. Lewis",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/10494282-dymer"
}