{
  "title": "Pursuing the Good Life: 100 Reflections on Positive Psychology",
  "description": "When we think of psychology, we think of a field dedicated to understanding and curing the dark side of life--addictions, phobias, compulsions, anxieties, and on and on. But there is a field of psychology that looks at the bright side, that considers seriously these questions: What makes life most worth living? And how can we pursue a good life? That field is called, not surprisingly, positive psychology. In Pursuing the Good Life, one of the founders of positive psychology, Christopher Peterson, offers one hundred bite-sized reflections exploring the many sides of this exciting new field. With the humor, warmth, and wisdom that has made him an award- winning teacher, Peterson takes readers on a lively tour of the sunny side of the psychological street. What are the roles played by positive emotions and happiness, by strengths of character, by optimism, and by good relationships with others? How can we pursue the good life in families, workplaces, schools, and sports, no matter who we are or where we live? With titles such as \"You May Now Kiss the Bride--And Would You Like Fries With That?\" and \"How Can You Tell If Someone from France is Happy?\" Peterson good- humoredly explores these questions and many others, including such diverse topics as the difference between employment and work, the value of doing the right thing, and why books matter, among other subjects. Throughout, Peterson shows that happiness is not simply the result of a fortunate spin of the genetic wheel. There are things that people can learn to do to lead happier lives. Pursuing the Good Life is both an enjoyable read and an invaluable guide to making the good life part of your everyday existence.",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Science",
    "Self Help",
    "Personal Development",
    "School"
  ],
  "author": "Christopher Peterson",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/14830300-pursuing-the-good-life"
}