{
  "title": "Europe Before Rome: A Site-by-Site Tour of the Stone, Bronze, and Iron Ages",
  "description": "Werner Herzog's 2011 film Cave of Forgotten Dreams, about the painted caves at Chauvet, France brought a glimpse of Europe's extraordinary prehistory to a popular audience. But paleolithic cave paintings, stunning as they are, form just a part of a story that begins with the arrival of the first humans to Europe 1.3 million years ago, and culminates in the achievements of Greece and Rome.In Europe before Rome, T. Douglas Price takes readers on a guided tour through dozens of the most important prehistoric sites on the continent, from very recent discoveries to some of the most famous and puzzling places in the world, like Chauvet, Stonehenge, and Knossos. This volume focuses on more than 60 sites, organized chronologically according to their archaeological time period and accompanied by 200 illustrations, including numerous color photographs, maps, and drawings. Our understanding of prehistoric European archaeology has been almost completely rewritten in the last 25 years with a series of major findings from virtually every time period, such as Otzi the Iceman, the discoveries at Atapuerca, and evidence of a much earlier eruption at Mt. Vesuvius. Many of the sites explored in the book offer the earliest European evidence we have of the typical features of human society--tool making, hunting, cooking, burial practices, agriculture, and warfare. Introductory prologues to each chapter provide context for the wider changes in human behavior and society in the time period, while the author's concluding remarks offer expert reflections on the enduring significance of these places.Tracing the evolution of human society in Europe across more than a million years, Europe before Rome gives readers a vivid portrait of life for prehistoric man and woman.",
  "genres": [
    "History",
    "Nonfiction",
    "Archaeology",
    "Anthropology",
    "Prehistory",
    "Ancient History",
    "Science"
  ],
  "author": "T. Douglas Price",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/14830273-europe-before-rome"
}