{
  "title": "Civilization in the West: Combined Volume",
  "description": "Civilization in the West, Seventh Edition, Volume I Mark Kishlansky, et al.  “This text is clear, well-organized, and easy for my students to follow. I have never had more satisfied students over a thirty-five year career.” –Don Mohr, University of Alaska — Anchorage “Students typically associate a history classes with being dull and dreary with an accompanying dry text. This book entices students to read the chapters not only because they are assigned but because the students are eager to read them.” –Janilyn M. Kocher, Richland Community College “I have seen texts that are dry, monotonous, and chocked with detail. I have seen others that present the material so lightly that it may blow away. This text is a combination of detailed information in an engaging and interesting presentation.” –John S. Kemp, Truckee Meadows Community College In Civilization in the West, the dramatic, changing contours of Western Civilization are explored through a compelling narrative and a rich image-based approach. In the new Seventh Edition, updated throughout, the authors blend social and political history with an exceptional map and image program to engage students and make the material more accessible. New to this edition  “Image Discovery”  features appear in every chapter and help students approach images as important historical texts.   New “West in the Wider World”  essays: Chapter 1, “The First European Immigrants;” Chapter 10, “World Trade Centers;” Chapter 12, “The ColumbianExchange.”   New primary source documents:  Chapter 3 now includes an excerpt from Plato’s The Apology that presents Socrates in his summation to the Athenian jury; Chapter 7 includes Usamah ibn Munqidh’s observations in “An Arab in Crusader Jerusalem”; in Chapter 8, Gregory of Tours describes a conflict between two families from Tournai that ultimately destroyed them both; and in Chapter 14, in “The Heart and Stomach of a King,” Queen Elizabeth rallies her subjects to oppose the invasion of English by the Spanish Armada.   An expanded Glossary contains over 60 new key terms.    Available versions of Civilization in the West Single Volume Edition ISBN 0-205-55684-1 Volume I (to 1715) ISBN 0-205-55685-X Volume II (since 1555) ISBN 0-205-55686-8 Volume A (to 1500) 0-205-5568-76 Volume B (from 1350 to 1850) 0-205-55688-4 Volume C (since 1789) 0-205-55689-2 Visit us at ablongman.com/history",
  "genres": [
    "History",
    "Reference",
    "Nonfiction",
    "Textbooks",
    "Social Science",
    "Politics"
  ],
  "author": "Mark A. Kishlansky",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/14843009-civilization-in-the-west"
}