{
  "title": "How to Live Together: Novelistic Simulations of Some Everyday Spaces",
  "description": "In The Preparation of the Novel , a collection of lectures delivered at a defining moment in Roland Barthes's career (and completed just weeks before his death), the critic spoke of his struggle to discover a different way of writing and a new approach to life. The Neutral preceded this work, containing Barthes's challenge to the classic oppositions of Western thought and his effort to establish new pathways of meaning. How to Live Together predates both of these achievements, a series of lectures exploring solitude and the degree of contact necessary for individuals to exist and create at their own pace. A distinct project that sets the tone for his subsequent lectures, How to Live Together is a key introduction to Barthes's pedagogical methods and critical worldview.In this work, Barthes focuses on the concept of \"idiorrhythmy,\" a productive form of living together in which one recognizes and respects the individual rhythms of the other. He explores this phenomenon through five texts that represent different living spaces and their associated ways of Émile Zola's Pot-Bouille , set in a Parisian apartment building; Thomas Mann's The Magic Mountain , which takes place in a sanatorium; André Gide's La Séquestrée de Poitiers , based on the true story of a woman confined to her bedroom; Daniel Defoe's Robinson Crusoe , about a castaway on a remote island; and Pallidius's Lausiac History , detailing the ascetic lives of the desert fathers.As with his previous lecture books, How to Live Together exemplifies Barthes's singular approach to teaching, in which he invites his audience to investigate with him―or for him―and wholly incorporates his listeners into his discoveries. Rich with playful observations and suggestive prose, How to Live Together orients English-speaking readers to the full power of Barthes's intellectual adventures.",
  "genres": [
    "Philosophy",
    "Nonfiction",
    "Theory",
    "France",
    "20th Century",
    "Literary Criticism",
    "Cultural Studies"
  ],
  "author": "Roland Barthes",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/14847259-how-to-live-together"
}