{
  "title": "Radical Equations: Civil Rights from Mississippi to the Algebra Project",
  "description": "The remarkable story of the Algebra Project, a community-based effort to develop math-science literacy in disadvantaged schools—as told by the program’s founder “Bob Moses was a hero of mine. His quiet confidence helped shape the civil rights movement, and he inspired generations of young people looking to make a difference”— Barack ObamaAt a time when popular solutions to the educational plight of poor children of color are imposed from the outside—national standards, high-stakes tests, charismatic individual saviors—the acclaimed Algebra Project and its founder, Robert Moses, offer a vision of school reform based in the power of communities. Begun in 1982, the Algebra Project is transforming math education in twenty-five cities. Founded on the belief that math-science literacy is a prerequisite for full citizenship in society, the Project works with entire communities—parents, teachers, and especially students—to create a culture of literacy around algebra, a crucial stepping-stone to college math and opportunity.Telling the story of this remarkable program, Robert Moses draws on lessons from the 1960s Southern voter registration he famously helped organize: “Everyone said sharecroppers didn't want to vote. It wasn't until we got them demanding to vote that we got attention. Today, when kids are falling wholesale through the cracks, people say they don't want to learn. We have to get the kids themselves to demand what everyone says they don't want.”We see the Algebra Project organizing community by community. Older kids serve as coaches for younger students and build a self-sustained tradition of leadership. Teachers use innovative techniques. And we see the remarkable success stories of schools like the predominately poor Hart School in Bessemer, Alabama, which outscored the city's middle-class flagship school in just three years.Radical Equations provides a model for anyone looking for a community-based solution to the problems of our disadvantaged schools.",
  "genres": [
    "Education",
    "History",
    "Nonfiction",
    "Mathematics",
    "Social Justice",
    "Teaching",
    "Politics"
  ],
  "author": "Robert P. Moses",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/148455.Radical_Equations"
}