{
  "title": "Bring Me the Rhinoceros: And Other Zen Koans to Bring You Joy",
  "description": "Bring Me the Rhinoceros\" is an unusual guide to happiness and a can opener for your thinking. For fifteen hundred years, Zen koans have been passed down through generations of masters, usually in private encounters between teacher and student. This book deftly retells fourteen traditional koans, which are partly paradoxical questions dangerous to your beliefs and partly treasure boxes of ancient wisdom. Koans show that you don't have to impress people or change into an improved, more polished version of yourself. Instead you can find happiness by unbuilding, unmaking, throwing overboard, and generally subverting unhappiness. John Tarrant brings the heart of the koan tradition out into the open, reminding us that the old wisdom remains as vital as ever, a deep resource available to anyone in any place or time. \"Here's a book to crack the happiness code if ever there was one. Forget about self-improvement, five-point plans, and inspirational seminars that you can't remember a word of a week later. Tarrant's is the fix that fixes nothing because there is nothing to fix. Your life is a koan, a deep question whose answer you are already living--this is the true inspiration, and Tarrant delivers.\"--Roger Housden, author of the \"Ten Poems\" series \"Every life is full of koans, and yet you can't learn from a book how to understand them. You need someone to put you in the right frame of mind to see the puzzles and paradoxes of your experience. With intelligence, humor, and steady, deep reflection, John Tarrant does this as no one has done it before. This book could take you to a different and important level of experience.\"--Thomas Moore, author of \"Care of the Soul\" and \"Dark Nights ofthe Soul\" \"\"Bring Me the Rhinoceros\" is one of the best books ever written about Zen. But it is more than that: it is a book of Zen, pointing us to reality by its own fluent and witty example. John Tarrant has the rare ability to enter the minds of the ancient Zen masters as they do their amazing pirouettes upon the void and, with a few vivid touches, to illuminate our lives with their sayings.\"--Stephen Mitchell, author of \"Gilgamesh: A New English Version\" \"This book's straightforward honesty, clear writing, and destabilizing insight have a profound effect. John Tarrant does indeed bring on the rhinoceros and a host of other powerful but invisible creatures, ready to run us down when we refuse to acknowledge the fierce, awkward, and beautiful world we inhabit\"--David Whyte, author of \"Crossing the Unknown Sea\" \"John Tarrant's talent for telling these classic Zen tales transforms them magically into a song in which, as you read, the words disappear as the music continues to echo in your mind and make you happy. Mysteriously, like koans.\" --Sylvia Boorstein, author of \"Pay Attention, for Goodness' Sake",
  "genres": [
    "Buddhism",
    "Philosophy",
    "Spirituality",
    "Zen",
    "Nonfiction",
    "Religion",
    "Self Help"
  ],
  "author": "John   Tarrant",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/148471.Bring_Me_the_Rhinoceros"
}