{
  "title": "The Secret Lives of the Kudzu Debutantes",
  "description": "Cotillion: A formal gathering of bright young women on the verge of entering adulthood, the society pages, and prospective high-tax-bracket marriages. Think of a Civil War reenactment with crisp, clean white dresses.Catfight: An impromptu gathering of not-so-young women on the verge of losing their cool. Think of a cotillion with hair-pulling.It's been more than a year since the Kudzu Debutantes exacted sweet, merciless revenge on their cheating husbands, but the repercussions are still palpable throughout Ithaca, Georgia: Nita is anxiously preparing herself for marriage to Jimmy Lee, a man thirteen years her junior; Lavonne, despite having dropped her husband, and eighty pounds, and launched her own business, longs for love; and while Eadie remains married to Trevor, she feels more neglected than ever.So the occasion of Nita's second wedding seems like just the ticket to cheer up the disconsolate Debs. But they've made a formidable enemy in Virginia Broadwell, first lady of Ithaca and the bride's ex-mother-in-law. Hell-bent on vengeance and determined to restore old-school social mores, Virginia hatches a plan so devious it makes her pedicured toes curl in anticipation.Soon enough, the women are knocked for a loop, but you can keep a Kudzu Debutante down for only so long. The one thing stronger than Virginia's wrath is the bond between the three friends, who soon learn that one of Virginia's Jimmy Choos contains an irresistible Achilles' heel. With spirit, wit, and down-home gumption, the take-no-prisoners trio decides it's time to ditch their cotillion manners as they rally to save Nita's marriage, Lavone's business, Eadie's sanity . . . and the honor of Kudzu Debs the world over. Packed with authentic Southern flavor and characters as colorful as an azalea in full bloom, The Secret Lives of the Kudzu Debutantes serves up stinging one-liners and earthy wisdom in equal measure.",
  "genres": [
    "Chick Lit",
    "Fiction",
    "Southern",
    "Humor",
    "Womens Fiction",
    "Womens",
    "Friendship"
  ],
  "author": "Cathy Holton",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/1484581.The_Secret_Lives_of_the_Kudzu_Debutantes"
}