{
  "title": "The Parental Alienation Syndrome: A Family Therapy and Collaborative Systems Approach to Amelioration",
  "description": "In this thoughtprovoking book, Ms. Gottlieb attempts to resolve the controversies surrounding Parental Alienation Syndrome (PAS) by providing substantial empirical evidence from her treatment cases in support of the eight symptoms which child psychiatrist, Richard Gardner, had identified as occurring in the PAS child, and she further exemplifies the commonality of the alienating maneuvers among the alienating parents. The author redefines the typicallyheld characterization of the parents' relationship as portrayed in the pertinent literature and accepted by most PASaware professionals. Numerous case examples are horrific tales of manufactured child abuse; referrals to child protective services (CPS) resulting in suspension of visits between targeted parents and their children; meritless reports to police alleging domestic violence in support of orders of protection which slander and stigmatize targeted parents; exclusionary tactics preventing targeted parents' involvement in their children's medical, educational, social lives and activities; and depletion of targeted parents' resources due to legal fees required to defend himself/herself and to obtain judicial enforcement of parental rights. Ms. Gottlieb methodically documents that PAS is a form of emotional child abuse of the severest kind. The author provides an unprecedented number of treatment summaries, which demonstrate the effectiveness of structural family therapy in treating the PAS family. To further elucidate the subject, the author interviewed several matrimonial attorneys, Law Guardians, and forensic evaluators regarding their experiences with PAS, and she incorporated their thoughts into her recommendations as to how the mental health and judicial communities should resolve this situation in the best interests of the child. \"New Rules\" are suggested which encourage a collaborative rather than an adversarial approach to child custody. This book will be an excellent resource for parents who are divorcing or are in conflict, for adultchild victims of PAS, for mature children of divorcing parents, for judges, for Law Guardians, for matrimonial attorneys, for therapists, for child protective personnel, for law enforcementand for the professional rescuer who believes that a child must be saved from a parent.",
  "genres": [],
  "author": "Linda J. Gottlieb",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/14848109-the-parental-alienation-syndrome"
}