{
  "title": "The Geography of Love: Same-Sex Marriage & Relationship Recognition in America",
  "description": "There is no question that the most prominent gay rights issue in the United States today is the right to marry. Yet accurate, objective information about same-sex marriage and relationship recognition in the United States is difficult to come by. In this book, Seattle-based authors Peter Nicolas & Mike Strong combine their respective training in law and geography to depict the history and current state of marriage and relationship recognition rights for same-sex couples in the United States in words...and in maps.This publication begins with a detailed history of efforts to achieve marriage rights and other forms of relationship recognition (such as domestic partnerships and civil unions) for gay and lesbian Americans, from the first lawsuit filed in 1970 in Minnesota to the new marriage laws approved by voters in November, 2012—and just about everything (judicial and legislative) in between. Next, it provides detailed information on relationship recognition in the United States, including:• which states permit same-sex couples to marry or to enter into other types of legal unions;• the rules for entering into or terminating such relationships; • a comparison of the rights that each state provides to same-sex couples;• the extent to which same-sex relationships entered into in one state are recognized by other states; and• which cities and counties have domestic partnership registries and equal benefits ordinances.That is followed by a look at efforts to ban same-sex marriage at the ballot box, including:• selected vote details by state and county;• a closer look at where support for such efforts was weakest and strongest; and• a comparison of the processes for amending state constitutions across the United States.For those same-sex couples interested in getting married in one of the jurisdictions that permits same-sex couples to marry, the book features a table that provides detailed information about the prerequisites for getting married, including: the marriage license fee; minimum age and blood test requirements; whether non-residents are permitted to marry; and the waiting period, if any, between applying for a license and getting married.The third edition is completely up-to-date, and provides extensive coverage of the votes in November 2012 legalizing same-sex marriage in Maine, Maryland, and Washington.",
  "genres": [],
  "author": "Peter Nicolas",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/10494942-the-geography-of-love"
}