{
  "title": "Bankrupting Nature",
  "description": "This powerful book shows us that we are in deep denial about the magnitude of the global environmental challenges and resource constraints facing the world. Despite growing scientific consensus on major environmental threats as well as resource depletion, societies are largely continuing with business as usual, at best attempting to tinker at the margins of the problems. The authors argue that regardless of whether governments respond to the economic crisis through additional stimulus packages or reduced government spending, environmental and resource constraints will remain. The crisis will be exacerbated by the combination of climate change, ecosystem decline and resource scarcity, in particular crude oil. The concept of Planetary Boundaries is introduced as a powerful explanation of the limits of the biosphere to sustain continued conventional growth. The book breaks the long silence on population, criticizing donor countries for not doing enough to support the education of girls and reproductive health services. It is shown that an economy built on the continuous expansion of material consumption is not sustainable. De-growth, however, is no solution either. The growth dilemma can only be addressed through a transformation of the economic system. A strong plea is made for abandoning GDP growth as the key objective for development. The focus should instead be on a limited number of welfare indicators. The trickle-down concept is seriously questioned, to be replaced by one of sufficiency. Rich countries are called upon to hold back their material growth to leave room for a rising living standard among the poor. Alternative business models are presented, such as moving from products to services or towards a circular economy based on re-use, reconditioning and recylcing – all with the aim of facilitating sustainable development. A Report to the Club of Rome",
  "genres": [
    "Science",
    "Environment"
  ],
  "author": "Anders Wijkman",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/14868239-bankrupting-nature"
}