{
  "title": "How England Made the English: From Hedgerows to Heathrow",
  "description": "Join Harry Mount on his journey through England as he uncovers the national characteristics behind the English look -- a liking for old things, for smallness and gentleness; a taste for the picturesque and the slightly shabby; a preference for accidental, natural beauty over grand human designs. The book explains how the size of the fields is produced by male inheritance laws and the erratic ways of the rambling English hedge; how the industrial revolution created the modern English waistline; and why the Midlands became the home of the British curry. It identifies the materials that made England, too, like the faint pink Aberdeen granite of the kerbstones; and that precise English mix of air temperature, smell and light that hits you the moment you touch down at Heathrow.This book spans new England, as well as the rolling hills and patchwork landscape of Tourist Board England: the hedge-funder's taste for Victorian terraced houses turned into minimalist white boxes; and the steel-reinforced concrete that changed the English city horizon. England and the English have been shaped by our weather, geology and geography; by being a coal-rich, northerly island off the edge of a vast land mass, moored between the Atlantic and the North Sea, warmed by the Gulf Stream.Because of all these things, we drink too much, we're bad at speaking foreign languages and we're shy -- particularly with the opposite sex. But they also mean we're good at defending ourselves, fascinated by nature and gardens, obsessed with walking, indifferent to comfort, and determined to preserve the past. THe most geologically varied small country in the world has produced its most idiosyncratic people; and the English character and the landscape of that small country are inextricably linked.[From the inside front cover]",
  "genres": [
    "History",
    "Nonfiction",
    "Travel",
    "British Literature",
    "Science",
    "Economics",
    "Historical"
  ],
  "author": "Harry Mount",
  "average_rating": "3.34",
  "url": "https://www.goodreads.com/book/show/14878343-how-england-made-the-english"
}