{
  "title": "Warriors of the Cloisters: The Central Asian Origins of Science in the Medieval World",
  "description": "How science in medieval Europe originated in Buddhist AsiaWarriors of the Cloisters tells how key cultural innovations from Central Asia revolutionized medieval Europe and gave rise to the culture of science in the West. Medieval scholars rarely performed scientific experiments, but instead contested issues in natural science, philosophy, and theology using the recursive argument method. This highly distinctive and unusual method of disputation was a core feature of medieval science, the predecessor of modern science. We know that the foundations of science were imported to Western Europe from the Islamic world, but until now the origins of such key elements of Islamic culture have been a mystery.In this provocative book, Christopher I. Beckwith traces how the recursive argument method was first developed by Buddhist scholars and was spread by them throughout ancient Central Asia. He shows how the method was adopted by Islamic Central Asian natural philosophers―most importantly by Avicenna, one of the most brilliant of all medieval thinkers―and transmitted to the West when Avicenna's works were translated into Latin in Spain in the twelfth century by the Jewish philosopher Ibn Da'ud and others. During the same period the institution of the college was also borrowed from the Islamic world. The college was where most of the disputations were held, and became the most important component of medieval Europe's newly formed universities. As Beckwith demonstrates, the Islamic college also originated in Buddhist Central Asia.Using in-depth analysis of ancient Buddhist, Classical Arabic, and Medieval Latin writings, Warriors of the Cloisters transforms our understanding of the origins of medieval scientific culture.",
  "genres": [
    "History",
    "Nonfiction",
    "History Of Science",
    "Science",
    "Islam",
    "India",
    "Medieval History"
  ],
  "author": "Christopher I. Beckwith",
  "average_rating": "3.13",
  "url": "https://www.goodreads.com/book/show/14891878-warriors-of-the-cloisters"
}