{
  "title": "Harlem Nocturne: Women Artists and Progressive Politics During World War II",
  "description": "As World War II raged overseas, Harlem witnessed a battle of its own. Brimming with creative and political energy, the neighborhood’s diverse array of artists and activists took advantage of a brief period of progressivism during the war years to launch a bold cultural offensive aimed at winning democracy for all Americans, regardless of race or gender. Ardent believers in America’s promise, these men and women helped to lay the groundwork for the Civil Rights Movement before Cold War politics and anti-Communist fervor temporarily froze their dreams at the dawn of the postwar era.In Harlem Nocturne, esteemed scholar Farah Jasmine Griffin tells the stories of three black female artists whose creative and political efforts fueled this historic movement for change: choreographer and dancer Pearl Primus, composer and pianist Mary Lou Williams, and novelist Ann Petry. Like many African Americans in the city at the time, these women weren’t native New Yorkers, but the metropolis and its vibrant cultural scene gave them the space to flourish and the freedom to express their political concerns. Pearl Primus performed nightly at the legendary Café Society, the first racially integrated club in New York, where she débuted dances of social protest that drew on long-buried African traditions and the dances of former slaves in the South. Williams, meanwhile, was a major figure in the emergence of bebop, collaborating with Dizzy Gillespie, Thelonious Monk, and Bud Powell and premiering her groundbreaking Zodiac Suite at the legendary performance space Town Hall. And Ann Petry conveyed the struggles of working-class black women to a national audience with her acclaimed novel The Street, which sold over a million copies—a first for a female African American author.A rich biography of three artists and the city that inspired them, Harlem Nocturne captures a period of unprecedented vitality and progress for African Americans and women, revealing a cultural movement and a historical moment whose influence endures today.",
  "genres": [
    "History",
    "Nonfiction",
    "Feminism",
    "Politics",
    "Biography",
    "Music",
    "Race"
  ],
  "author": "Farah Jasmine Griffin",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/14894646-harlem-nocturne"
}