{
  "title": "Stokely: A Life",
  "description": "Stokely Carmichael, the charismatic and controversial black activist, stepped onto the pages of history when he called for “Black Power” during a speech one Mississippi night in 1966. A firebrand who straddled both the American civil rights and Black Power movements, Carmichael would stand for the rest of his life at the center of the storm he had unleashed that night. In Stokely, preeminent civil rights scholar Peniel E. Joseph presents a groundbreaking biography of Carmichael, using his life as a prism through which to view the transformative African American freedom struggles of the twentieth century. During the heroic early years of the civil rights movement, Carmichael and other civil rights activists advocated nonviolent measures, leading sit-ins, demonstrations, and voter registration efforts in the South that culminated with the passage of the Voting Rights Act in 1965. Still, Carmichael chafed at the slow progress of the civil rights movement and responded with Black Power, a movement that urged blacks to turn the rhetoric of freedom into a reality through whatever means necessary. Marked by the assassinations of Malcolm X and Martin Luther King, Jr., a wave of urban race riots, and the rise of the anti-war movement, the late 1960s heralded a dramatic shift in the tone of civil rights. Carmichael became the revolutionary icon for this new racial and political landscape, helping to organize the original Black Panther Party in Alabama and joining the iconic Black Panther Party for Self Defense that would galvanize frustrated African Americans and ignite a backlash among white Americans and the mainstream media. Yet at the age of twenty-seven, Carmichael made the abrupt decision to leave the United States, embracing a pan-African ideology and adopting the name of Kwame Ture, a move that baffled his supporters and made him something of an enigma until his death in 1998.A nuanced and authoritative portrait, Stokely captures the life of the man whose uncompromising vision defined political radicalism and provoked a national reckoning on race and democracy.",
  "genres": [
    "Biography",
    "History",
    "Nonfiction",
    "African American",
    "Politics",
    "American History",
    "Activism"
  ],
  "author": "Peniel E. Joseph",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/14894638-stokely"
}