{
  "title": "The Gilded Age, A Time Travel",
  "description": "A New York Times Notable BookA New York Public Library Recommended BookThe sequel to Summer of Love, A Time Travel (A Philip K. Dick Award Finalist and San Francisco Chronicle Recommended Book)The year is 1895 and immigrants the world over are flocking to California on the transcontinental railroad and on transoceanic steamships. The Zoetrope demonstrates the persistence of vision, patent medicines addict children to morphine, and women are rallying for the vote. In San Francisco, saloons are the booming business, followed by brothels. The Barbary Coast is a notorious sink of iniquity and, atop Telegraph Hill, jousting tournaments draw blood. In Chinatown, the tongs deal in opium, murder-for-hire, and slave girls.Zhu Wong, a prisoner in twenty-fifth century China, is given a choice—stand trial for murder or go on a risky time-travel project to San Francisco, 1895 to rescue a slave girl and take her to safety. Charmed by the city’s opulent glamour, Zhu will discover the city’s darkest secrets. A fervent population control activist in a world of twelve billion people, she will become an indentured servant to the city’s most notorious madam. Fiercely disciplined, she will fall desperately in love with the troubled self-destructive heir to a fading fortune.And when the careful plans of the Gilded Age Project start unraveling, Zhu will discover that her choices not only affect the future but mean the difference between her own life or death.Cover by Tom Robinson.“A winning mixture of intelligence and passion.” The New York Times Book ReviewLisa Mason has published eleven novels including Summer of Love (a Philip K. Dick Award Finalist and San Francisco Chronicle Recommended Book), The Gilded Age (a New York Times Notable Book and New York Public Library Recommended Book), Strange 7 Stories (a collection of previously published short fiction), and thirty stories and novellas in magazines and anthologies worldwide. Her Omni story, “Tomorrow’s Child,” sold outright as a feature film to Universal Pictures.CHROME is Mason's latest novel and 22 Stories is her second collection.",
  "genres": [
    "Science Fiction"
  ],
  "author": "Lisa Mason",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/14896972-the-gilded-age-a-time-travel"
}