{
  "title": "Solomon's Knife",
  "description": "SOLOMON'S KNIFE Victor Koman's Prometheus Award-winning novel is back in a new edition! Ray Bradbury says of him, \"Would that there were a dozen more writers like him in the field.\" Dr. Evelyn Fletcher is a surgeon caught in a maelstrom of controversy. She has secretly devised a surgical procedure that could alter the lives of millions. When the beautiful and successful Valerie Dalton walks into Fletcher's office for a routine abortion, the doctor realizes that she has found the perfect experimental subject. Karen Chandler and her husband sought pregnancy for years with no success. They greet Fletcher's offer of a radically new procedure as a miracle. Karen, with no hesitation, agrees to undergo the clandestine surgery. When little Renata is born and then falls deathly ill, only one person can save her life. A woman who does not even know her daughter exists. Under a barrage of media scrutiny, Valerie Dalton must face the courts with her lover in an unprecedented custody battle. Ultimately, she plumbs the depths of her shattered soul to find the answer to the conflict that rages within her and all society. Solomon's Knife is a masterful and fiery mixture of medical thriller and courtroom drama that fuses every facet of the most violently debated issue of our age. The reality it foreshadows is only years -- perhaps months -- away. Praise for SOLOMON'S \"Solomon's Knife... is a species of that too-rare genus, moral fiction. But it is inhabited by real people instead of cut-outs stenciled with a specific point-of-view. I cared about these people even as I was swept up in the fascinating legal/ethical/moral conundrum they faced. Riveting, spellbinding, intellectually challenging, andemotionally satisfying.\" -- F. Paul Wilson ...\"an exciting page-turner sure to offend readers of all views.... Rousing pulp-fiction-cum social-prophecy.\" -- Kirkus ...\" 'transoption' would neatly put to rest all the outrage surrounding abortion.\" -- Publishers Weekly \"Gripping.... Solomon's Knife is a novel that does what only a great novel can It gives us a new context.\" -- Brad Linaweaver, Atlanta Journal-Constitution \"Solomon's Knife is that rare accomplishment, a philosophical novel with characters who seem like real people you can come to care about. Victor Koman has managed to fuse a serious, fair-minded, and sensitive explication of one of the more emotional issues of our time with a page-turner of a story.... Koman's novel will not only entertain readers, it will help those on all sides of the abortion issue clarify their thinking.\" -- Orange County Register \"Aptly named for the biblical story of King Solomon, this novel will be a welcome addition... in light of all the ethical questions it addresses.\" -- Library Journal Victor Koman has also written a screenplay of Solomon's Knife. He lives in southern California with his wife, Veronica, and daughter, Vanessa, as well as their cat, Kali. Koman graduated summa cum laude from Redlands University in 2001 as a Bachelor of Science in Information Systems. In 2004, he received his MBA from Pepperdine University. His weblog and bookstore are accessible at komansense.com",
  "genres": [],
  "author": "Victor Koman",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/1490718.Solomon_s_Knife"
}