{
  "title": "Bosnia: A Short History",
  "description": "The most comprehensive narrative history of Bosnia available in EnglishThis updated edition of Noel Malcolm's highly-acclaimed A Short History provides the reader with the most comprehensive narrative history of Bosnia in the English language. Malcolm examines the different religious and ethnic inhabitants of Bosnia, a land of vast cultural upheaval where the empires of Rome, Charlemagne, the Ottomans, and the Austro-Hungarians overlapped. Clarifying the various myths that have clouded the modern understanding of Bosnia's past, Malcolm brings to light the true causes of the country's destruction. This expanded edition of Bosnia includes a new epilogue by the author examining the failed Vance-Owen peace plan, the tenuous resolution of the Dayton Accords, and the efforts of the United Nations to keep the uneasy peace.What went wrong in the country where Christians and Muslims mingled and tolerated each other for over five centuries? It was a land with a vibrant political and cultural history, unlike any other in Europe, where great powers and religions-the empires of Rome, Charlemagne, the Ottomans; the faiths of Roman Catholicism, Eastern Orthodoxy, Judaism, and Islam overlapped and combined. In this first English-language history of Bosnia, Noel Malcolm provides a narrative chronicle of the country from its beginnings to its tragic end. Clarifying the various myths that have clouded the modern understanding of Bosnia's past, Malcolm brings to light the true causes of the country's the political strategy of the Serbian leadership, the conflict between the city and the countryside, the fatal inaction and miscalculations of Western politicians.Putting the Bosnia war into perspective, this volume celebrates the complex history of a country whose past, as well as its future, has been all but erased. At last, here is the guide for the general reader seeking a comprehensive and accessible account of the war in the former Yugoslavia.",
  "genres": [
    "History",
    "Nonfiction",
    "European History",
    "Politics",
    "Religion",
    "Medieval",
    "War"
  ],
  "author": "Noel Malcolm",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/1049929.Bosnia"
}