{
  "title": "Buddhism for Dummies",
  "description": "From the outside, Buddhism seems like a bundle of contradictions wrapped inside a paradox. It is a religion without a god, a belief system without rules, and a faith that encourages its adherents to question everything, including its own teachings. You could spend a lifetime studying Buddhist texts and following its observances and still feel like you've only just barely scratched the surface. Yet, over the past 2500 years, this lovely religion that preaches compassion, generosity, tolerance, selflessness and self-awareness has commanded the fervent devotion of hundreds of millions of people around the world who believe it to be the true path to enlightenment. If you're curious about Buddhism but feel intimidated by all the exotic jargon and strange trappings, this book is for you. Written by two leading American Buddhist teachers and scholars, it offers you a uniquely friendly way to explore the fascinating history of Buddhism and discover:Who Buddha was and his significance in world history and spirituality How the practice of Buddhism can enrich your everyday life How Buddha's teachings combine to create a path to enlightenment Daily observances and meditation practices How to fulfill your highest potential through Buddhism In plain English, experts Jonathan Landaw and Stephan Bodian define the important terms, explain the key concepts and explore, in-depth a wide range of topics, including:Buddha's life and teachings and the evolution of the major Buddhist traditions How Buddhism works as a religion, philosophy of life and a practical approach to dealing with life's problems, all rolled into one The idea that the mind is the source of all happiness and suffering How the practices of wisdom and compassion can connect you with your inner spiritual resources Meditation and other core Buddhist practices and how they can affect your everyday life How to apply Buddhist teachings at each stage along the spiritual path Whether you're a searcher of truth, a student of religions, or just curious about what's got Richard Gere and all the rest of those celebrity Buddhists so excited, Buddhism For Dummies is your intro to Buddhism basics.",
  "genres": [
    "Buddhism",
    "Nonfiction",
    "Religion",
    "Spirituality",
    "Philosophy",
    "Reference",
    "Self Help"
  ],
  "author": "Jonathan Landaw",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/149238.Buddhism_for_Dummies"
}