{
  "title": "Headscarf: The Day Turkey Stood Still",
  "description": "\"Headscarved women are here, they are not going away, and they are maybe growing in number and they want to participate in public life,\" Merve Kavakci, 2010. Can the wearing of an Islamic headscarf ever be reconciled with a policy of complete secularism? Is it a symbol of freedom of choice for women, or one of religious dominance? The Headscarf is a unique behind-the-scenes story of the first headscarved woman to be elected into the Turkish Parliament, and the harsh reaction against her election. It deconstructs her vilification by the government, military, media and political parties. Nowhere is the issue of the wearing of the hijab more contentious than in Turkey, whose constitutional principle of secularism has lead to the Turkish government banning women who wear headscarves from working in the public sector. But the majority of women who wear the headscarf in Turkey think that to do so is very important and reflects their dignity and personality, as well as their religious beliefs. In May 1999, this conflict hit the headlines when Merve Kavakci walked into the Turkish Grand National Assembly to take her oath of office as a member of Turkish Parliament, wearing her Islamic headscarf. A near riot ensued, and the Prime Minister famously told the crowd to 'put this woman in her place'. Since then, Kavakci has become an outspoken critic of Turkey's secularization policy, travelling the globe in support of Muslim women's rights, especially regarding the hijab, which she promotes as a symbol of female empowerment. Richard Peres uses this fascinating true story to promote greater understanding of contemporary Turkish politics, and to illustrate the ongoing tension between Turkey's military-secular bloc and its predominantly Islamic population. This highly accessible book will resonate with Western readers who want to know more about this fundamental issue and gain a greater understanding of women's issues, religious conflicts, political Islam, human rights and the struggle for democracy in the Middle East.",
  "genres": [],
  "author": "Richard Peres",
  "average_rating": "2.50",
  "url": "https://www.goodreads.com/book/show/14929218-headscarf"
}