{
  "title": "Kitchen Literacy: How We Lost Knowledge of Where Food Comes from and Why We Need to Get It Back",
  "description": "Ask children where food comes from, and they’ll probably “the supermarket.” Ask most adults, and their replies may not be much different. Where our foods are raised and what happens to them between farm and supermarket shelf have become mysteries. How did we become so disconnected from the sources of our breads, beef, cheeses, cereal, apples, and countless other foods that nourish us every day? Ann Vileisis’s answer is a sensory-rich journey through the history of making dinner. Kitchen Literacy takes us from an eighteenth-century garden to today’s sleek supermarket aisles, and eventually to farmer’s markets that are now enjoying a resurgence. Vileisis chronicles profound changes in how American cooks have considered their foods over two centuries and delivers a powerful what we don’t know could hurt us. As the distance between farm and table grew, we went from knowing particular places and specific stories behind our foods’ origins to instead relying on advertisers’ claims. The woman who raised, plucked, and cooked her own chicken knew its entire life history while today most of us have no idea whether hormones were fed to our poultry. Industrialized eating is undeniably convenient, but it has also created health and environmental problems, including food-borne pathogens, toxic pesticides, and pollution from factory farms. Though the hidden costs of modern meals can be high, Vileisis shows that greater understanding can lead consumers to healthier and more sustainable choices. Revealing how knowledge of our food has been lost and how it might now be regained, Kitchen Literacy promises to make us think differently about what we eat.",
  "genres": [
    "Food",
    "Nonfiction",
    "History",
    "Cookbooks",
    "Cooking",
    "Food History",
    "Health"
  ],
  "author": "Ann Vileisis",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/1492777.Kitchen_Literacy"
}