{
  "title": "Fury",
  "description": "What fires the blood, freezes the heart, twists the mind and drives a person to kill?G. M. Ford, author of the critically acclaimed Leo Waterman mystery novels, returns with a stunning tale of serial lies, corruption, and murder -- and throws an unforgettable new pair of investigators into the mad cosmopolitan mix of present-day Seattle.Frank Corso is a difficult man. A defrocked journalist vilified for allegedly making up \"facts\" on a major crime story while working for the sacrosanct New York Times, he now lives in virtual seclusion on a boat moored on the opposite end of the country -- surviving on the substantial royalties from a bestselling book and on his pay for the occasional column in a local tabloid, the Seattle Sun. Yet it's Corso whom the slow and sheltered Leanne Samples asks for when she walks into the Sun offices and announces that her courtroom testimony, which put Walter Leroy Himes on Death Row, was a lie.Several years earlier, eight Seattle women were slain over the course of eighty days, their bodies carefully displayed in Dumpsters throughout the city by a maniac whom the press dubbed \"the Trashman.\" Leanne Samples would have been victim number nine, she claimed at the time, had she not barely escaped from the clutches of Walter Himes, a large, unwashed, prime sociopathic example of wasted humanity Now Himes is only six days away from execution and everyone wants him dead: the victims' families, the police, the general populace ... even the mayor himself. And Himes will die, unless Frank Corso can quickly change a public opinion that the public does not want changed.But this death train may be impossible for Corso to derail, even with the able assistance of photographer Meg Dougherty. Despite Leanne's shocking confession, the authorities seem unusually keen on having Himes disposed of permanently. And highly situated members of the Seattle PD refuse to consider requesting a stay of execution -- even in the face of the most startling evidence of all: a brutal new murder that bears the Trashman's unmistakable signature.With the clock relentlessly ticking down to Lethal Injection Day, Corso and Dougherty have suddenly made powerful, perhaps deadly, new enemies by getting themselves deeply into something that goes far beyond right, wrong, truth, and justice. And the key to a case that again threatens to devastate a city now ties in a hastily scrawled \"tag\" on an alley wall: the first three spray-painted letters of one angry word ... Fury.",
  "genres": [
    "Mystery",
    "Thriller",
    "Crime",
    "Fiction",
    "Mystery Thriller",
    "Suspense",
    "Noir"
  ],
  "author": "G.M. Ford",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/1493019.Fury"
}