{
  "title": "Native Performers in Wild West Shows: From Buffalo Bill to Euro Disney",
  "description": "Now that the West is no longer so wild, it’s easy to dismiss Buffalo Bill Cody’s world-famous Wild West shows as promoters of stereotypes and clichés. But looking at this unique American genre from the Native American point of view provides thought-provoking new perspectives. Focusing on the experiences of Native performers and performances, Linda Scarangella McNenly begins her examination of these spectacles with Buffalo Bill’s 1880s pageants. She then traces the continuing performance of these acts, still a feature of regional celebrations in both Canada and the United States—and even at Euro Disney. Drawing on interviews with contemporary performers and descendants of twentieth-century performers, McNenly elicits insider perspectives to suggest new interpretations of their performances and experiences; she also uses these insights to analyze archival materials, especially photographs. Some Native performers saw Wild West shows not necessarily as demeaning, but rather as opportunities—for travel, for employment, for recognition, and for the preservation and expression of important cultural traditions. Other Native families were able to guide their own careers and even create their own Wild West shows. Today, Native performers at Buffalo Bill Days in Sheridan, Wyoming, wear their own regalia and choreograph their own performances. Through dancing and music, they express their own vision of a contemporary Native identity based on powwow cultures. Proud of their skills and successes, Native performers at Euro Disney are establishing promising careers. The effects of colonialism are undeniable, yet McNenly’s study reveals how these Native peoples have adapted and re-created Wild West shows to express their own identities and to advance their own goals.",
  "genres": [],
  "author": "Linda Scarangella McNenly",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/14941210-native-performers-in-wild-west-shows"
}