{
  "title": "Fool the World: The Oral History of a Band Called Pixies",
  "description": "It's the 1980s and the rock landscape is littered with massive hair, synthesizers, and monster riffs, but there is an alternative being born in the sleepy East of America-we just don't know it yet.Before the Internet, MTV, and iPods provided far-off music fans with information and communities-and before Nirvana-kids across the world grew up in relative isolation, dependent on mix tapes and self-created art to slowly spread scenes and trends. It was under these conditions that four young musicians found one another in Boston, Massachusetts, and started a band called Pixies.During their initial seven-year career, Pixies would play some of Europe's most gigantic festivals, keep the press guessing, and cultivate a fervid international fan base hungry for more and more of their unique surf punk. The band worked fast, cranking out four albums at a breakneck pace, but ultimately pressures and personality clashes took their Pixies broke up just as bands were singing their praises as the rock'n'roll innovators.For twelve years, a Pixies reunion seemed impossible, but a sudden announcement in 2004 proclaimed the unthinkable-Pixies were getting back together. Their extremely successful reunion tour finally gave the group something they'd always lacked in their proof that their bone-rattling music had left an indelible impact.Fool the World tells Pixies' story in the words of those who lived it, from the band members to studio owners, from A&R executives, producers, and visual artists who worked with them to admirers of their music, such as Bono, PJ Harvey, Beck, and Perry Farrell. With new cartoons by Trompe Le Monde illustrator Steven Appleby, Fool the World is a complete journey through the life, death, and rebirth of one of the most influential bands of all time.",
  "genres": [
    "Music",
    "Nonfiction",
    "Biography",
    "Oral History"
  ],
  "author": "Josh Frank",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/149509.Fool_the_World"
}