{
  "title": "Until the End of Time",
  "description": "Bill, a dedicated young lawyer working at his family’s prestigious New York firm, leaves everything he trained for to follow his dream and become a minister in rural Wyoming. Jenny, his wife, is a stylist whose heart and soul are invested in fashion. She leaves the milieu and life she loves to join him. The certainty they share is that their destinies are linked forever. Fast forward thirty-eight years. Robert is a hardworking independent book publisher in Manhattan who has given up all personal life to build his struggling business. He is looking for one big hit novel to publish. Lillibet is a young Amish woman, living as though in the seventeenth century, caring for her widowed father and three young brothers on their family farm. In secret at night, by candlelight, she has written the novel that burns within her, and gets it into Robert’s hands, wrapped in her hand-stitched apron. He falls in love first with the book, and then with the woman he has never met, living in the sequestered world of the Amish—a world without telephones, computers, electricity, modern conveniences, or cars. Although Lillibet faces banishment from her family and community, she embraces the opportunity to publish her novel, and is irresistibly drawn to the man who has heard her voice. Destiny is at work here. Fate draws her from her horse-and-buggy life toward his, and the publication of her novel.In the hands of master storyteller Danielle Steel, these two remarkable relationships come together in unexpected and surprising ways, as lovers are lost, and find each other again. If it is true that real love lasts forever and lovers cannot lose each other, then Until the End of Time will not only comfort and fascinate us, as destiny does her dance, but it will give us hope as well. Love and fate are powerful, irresistible forces, as Steel proves to us here, in a book about courage, change, risk, and hope . . . and love that never dies.",
  "genres": [
    "Romance",
    "Fiction",
    "Chick Lit",
    "Contemporary Romance",
    "Audiobook",
    "Contemporary",
    "Amish"
  ],
  "author": "Danielle Steel",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/14951193-until-the-end-of-time"
}