{
  "title": "Gai-Jin",
  "description": "Grand in scope and scale, filled with the richness and passion of two great histories coming together, Gai-jin is the long-awaited sixth novel in James Clavell's magnificent Asian Saga. Sweeping us back to the enigmatic and elusive land of his best-selling Shogun, he weaves an extraordinary tale of Japan, now newly open to gai-jin - foreigners - and teeming with contradictions as the ancient and the modern meet in a clash of cultures, of nations, of generations. It is 1862, and in Japan's Foreign Settlement of Yokohama, reverberations from an explosive act of violence will forever alter - and connect - the lives of the major characters. Malcolm Struan, at twenty, is heir to the title of tai-pan of the most powerful and bitterly contested English trading company in the Orient, the Noble House. Malcolm's fate, and that of his family's legacy, become inextricably intertwined with that of a beautiful young French woman, Angelique Richaud. Desired by many, loved purely and passionately by Malcolm, Angelique will hold the future of the Noble House in her hands. Intricately interwoven into the story of the struggle for control of the Noble House is a powerful parallel story of the Land of the Gods, Japan, a country ripped apart by greed, idealism, and terrorism as groups of young xenophobic revolutionaries, ronin, attempt to seize the Shogunate and expel the hated gai-jin from Japan. One man, Lord Toranaga Yoshi, a direct descendant of the first Toranaga Shogun, attempts not only to protect the Shogunate, but to usher it, and Japan, into the modern age. Amid the brutality and heroism, the betrayals and the stunning romance, a multilayered, complex story unfolds. Here the dark and erotic world of the pleasure houses - the Ladies of the Willow World, spies, and terrorists - meets the world of pageantry and power - monarchs and diplomats. And here East meets West in an inevitable collision of two equally powerful cultures as James Clavell creates a vibrant and authentic",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Japan",
    "Historical",
    "Adventure",
    "Asia",
    "Audiobook"
  ],
  "author": "James Clavell",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/1494943.Gai_Jin"
}