{
  "title": "Carried Away",
  "description": "Scorching hot leathersex is only the start when a jaded bottomboy and a one-time Master come together for some no-strings bondage and s/m. But after lust is sated, each finds a deeper hunger within that moves them unexpectedly toward partnership as Owner and owned. Set in the early1990s in New York City, Carried Away is not only replete with hard-core bondage and ferocious it's a love story between two men who are equals in intelligence and character, but opposites in temperament. Terry Andrews is a successful architect and all-around topman with a passion for bondage and the means to indulge it. Matt Stone manages a large bookstore, but he lives for the times when he can surrender control. When these two come together at the Spike, the legendary leather bar, neither is looking for a new partner, just a night of hot action. They get that, and much almost in spite of themselves, they forge a deeper connection. Matt gradually realizes that he needs to belong to someone, not simply let himself be played with and released. For his part, Terry simply needs to own what he loves, and once he falls for Matt, enslaving him is the only option! \"Goodnight, Mr. Benson - it's time to give the '70s a rest. Besides some of the most sizzling, astoundingly detailed bondage and s/m scenes ever written, Carried Away gives us believable, complex characters struggling with jobs and responsibilities, genuine loss, and frightening realities that have nothing to do with make-believe. The author's passion for his subject weaves throughout the text like ropes in the hands of a Japanese-bondage expert. An instantly engaging tour de force. Highly recommended!\" - Laura Antoniou, author of The Marketplace, The Slave, The Trainer, and The Academy \"If anyone is qualified to write hot and realistic man-to-man s/m fiction, it would be david stein, whose lifelong activism within the leather community has bolstered the growth of a whole new world of erotic opportunities. The bondage sex in this book is depicted with great accuracy and feeling, and the characters are well-developed and true to life, making it easy to identify with them. This detailed story reads so smoothly, you'll lose track of the number of pages and wish there was more of it.\" - Patrick Califia, author of Macho Sluts and Sensuous Magic \"Carried Away may not be the great American novel, but for those who can see voluntary slavery as a laudable way of life and courtship by a Master as romantic, david stein has performed a great feat of literature. By showing what is actually possible, he does for our sometimes ploddingly realistic times what John Preston did for an earlier and more fanciful time. The truth of the lives Carried Away examines will never be forgotten by any serious reader.\" -Joseph W. Bean, author of Leathersex and Leathersex Q&A, editor of Leathersex Short Fiction \"Realistic, compassionate, shocking, arousing - one of the best gay male s/m novels I've read. By making the world of gay Masters and slaves more accessible, david stein has opened doors the narrow-minded want to keep closed. Carried Away shows that love in an s/m context can be the greatest adventure of all.\" - Victor Terry, author of WHiPs, Masters, SM/SD, and Tying Knot",
  "genres": [
    "BDSM",
    "M M Romance",
    "Gay",
    "Erotica",
    "LGBT",
    "Gay Erotica",
    "Romance"
  ],
  "author": "David  Stein",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/1050220.Carried_Away"
}