{
  "title": "Nelson Mandela's Favorite African Folktales",
  "description": "\"A treasure for everyone in the family.\"--Bill CosbyNelson Mandela's Favorite African Folktales is a cause for celebration, landmark work that gathers in one volume many of Africa's most cherished folktales. Mandela, a Nobel Laureate for Peace, has selected these thirty-two tales with the specific hope that Africa's oldest stories, as well as a few new ones, be perpetuated by future generations and be appreciated by children throughout the world. In these \"beloved stories, morsels rich with the gritty essence of Africa,\" we meet, among many others, a Kenyan lion named Simba, a snake with seven heads and a trickster from Zulu folklore; we hear the voices of the scheming hyena and learn from a Khoi fable how animals acquired their tails and horns. Several creation myths tell us how the land, its animals, and its people all came into existence under a punishing sun or against the backdrop of a spectacularly beautiful mountain landscape. Whether warning children about the dangers of disobedience or demonstrating that the underdog can--and often does--win, these stories, through their depiction of wise animals as well as evil monsters, are \"universal in their portrayal of humanity, beasts, and the mystical.\" What is particularly exciting about this book is that many of the stories, in their oral form, are almost as old as Africa itself. Most of them were, in fact, first told in various African tongues around evening fires in centuries past--tales from, for example, the San and the Khoi, the original hunter-gatherers and livestock herders of Southern Africa. Translated into English and other European languages chiefly in the nineteenth and twentieth centuries from their original languages--be they Karanga, Nguni, Xhosa, or one of many others--these folktales are a testament to the craft of storytelling and the power of myth. Accompanied by dozens of enchanting, specially commissioned color paintings, Nelson Mandela's Favorite African Folktales--culled from African countries as far-flung as Morocco, Nigeria, Uganda, and Kenya--presents a fountain of precious knowledge that will be treasured by children, as well as adults, for years to come.",
  "genres": [
    "Africa",
    "Short Stories",
    "Audiobook",
    "Fiction",
    "Mythology",
    "Folklore",
    "Fairy Tales"
  ],
  "author": "Nelson Mandela",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/1497070.Nelson_Mandela_s_Favorite_African_Folktales"
}