{
  "title": "History of the Conquest of Mexico/History of the Conquest of Peru",
  "description": "One of America's greatest and most highly regarded historians, William Hickling Prescott set a lofty literary standard for historical writing with his books on Spain's emperors and explorers. Prescott avoided the dry, names-and-dates style of standard histories and instead brought the past alive, telling with drama and vigor the stories of the men who came face to face with the unknown, and the numerous brushes with death they survived as they carved out an empire in the New World. History of the Conquest of Mexico & History of the Conquest of Peru unites in one volume for the first time two of Prescott's best known and most powerful works. The books detail with accuracy and emotional resonance the arrival of Spain's conquerors to Mexico and Peru, and the wars of conquest whose outcomes remain the cause of contention even in the present day. The History of the Conquest of Mexico focuses on Hernan Cortes, a notary from Spain's Extremadura region, arriving at the edge of the Aztec empire with 500 men, determined to spread Christianity and enlarge the domain of Charles V of Spain. Within the space of a few years Cortes found himself fending off rivals from Spain and warring against enraged Aztecs, against whose superior numbers Cortes struggled against the odds to maintain his garrisons. Prescott's biographer Harry Thurston Peck called The History of the Conquest of Mexico \"one of the most brilliant examples which the English language possesses of literary art applied to historical narration.\" Conquistadors Pizarro and Almagro are the protagonists of The History of the Conquest of Peru. Prescott tells of their brutal overthrow of the Incas, and the wars between the two of them afterward. Another of Prescott's biographers, Donald G. Darnell, called the book, \"an immensely readable history.\" Using a wealth of documentation as raw material, Prescott turned this blend of viewpoints into a heroic and tragic epic of Spain's efforts to dominate Central and South America. The Histories",
  "genres": [
    "History",
    "Nonfiction",
    "Classics",
    "Spain"
  ],
  "author": "William Hickling Prescott",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/149730.History_of_the_Conquest_of_Mexico_History_of_the_Conquest_of_Peru"
}