{
  "title": "Game Frame: Using Games as a Strategy for Success",
  "description": "Ever wonder why teens can spend entire weekends playing video games but struggle with just one hour of homework? Why we’re addicted to certain websites and steal glances at our smartphones under the dinner table? Or why some people are able to find joy in difficult or repetitive jobs while others burn out? It’s not the experiences themselves but the way they’re structured that matters.All our lives we’ve been told that games are distractions—playful pastimes, but unrelated to success. In Game Frame , Aaron Dignan shows us that the opposite is games produce peak learning conditions and accelerated achievement. Here, the crucial connection between the games we love to play and the everyday tasks, goals, and dreams we have trouble realizing is illuminated.Aaron Dignan is the thirty-something founder of a successful digital strategy firm that studies the transformative power of technology in culture. He and his peers were raised on a steady diet of games and gadgets, ultimately priming them to challenge the status quo of the modern workplace. What they learned from games goes deeper than hand-eye coordination; instead, this generation intrinsically understands the value of adding the elements of games into everyday life.Game Frame is the first prescriptive explanation of what games mean to us, the human psychology behind their magnetic pull, and how we can use the lessons they teach as a framework to achieve our potential in business and beyond.Games are a powerful way to influence and change behavior in any setting. Here, Dignan outlines why games and play are such important trends in culture today, and how our technology, from our iPhones to our hybrid cars, primes us to be instinctive players. Game Frame tackles the challenging task of defining games and the mechanics that make games work from several perspectives, then explores these ideas through the lens of neuroscience. Finally, Dignan provides practical tips for using basic game mechanics in a variety of settings, such as motivating employees at work or encouraging children at home, giving readers the tools to develop their own games to solve problems in their everyday lives.Illuminated throughout with a series of real-world examples and hypothetical scenarios, Game Frame promises a crash course in game design and behavioral psychology that will leave the reader—and, by extension, the world itself—more productive. Revolutionary, visionary, practical, and time-tested, Game Frame will change the way you approach life.",
  "genres": [
    "Games",
    "Game Design",
    "Business",
    "Nonfiction",
    "Self Help",
    "Design",
    "Gaming"
  ],
  "author": "Aaron Dignan",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/10503045-game-frame"
}