{
  "title": "French or Foe?: Getting the Most Out of Visiting, Living and Working in France",
  "description": "Polly Platt's title French or Foe? is more timely than ever, as the Franco. American alliance frays a little more with each day, the exchanges more vitriolic than ever before. Her book has long been the reference for what it is about the French that rubs Americans the wrong way, why the Franco-American alliance has difficulties, and how to handle French people.... and find out, she says, \"how wonderful they are.\" Now in the third edition, she examines the revolution of the last few years brought about by the computer and the Internet. Interviews with many American and French executives explain the differences .. and the similarities .. in procedures in the work place compared five years ago. In addition, French or Foe?'s third edition describes the \"French exceptions\" of the last few years: the Messier scandal, the reasons why France was voted the Workers' Paradise in 2002; the romantic Look, version 2003; the government's new measures to combat the number of road deaths and to reduce smoking; the new Mayor's campaign against dog poop and his transforming of the banks of the Seine into Paris Plage, a beach resort; the havoc wrought by the hurricanes at Christmas 2000. The third edition tells what happened to various French heroes such as Jean-Paul Belmondo and Yves Saint Laurent and describes events like the reburial of Alexandre Dumas in the Pantheon, the French hall of fame. It portrays the success of determined French individuals, from Eric Srecki, world fencing champion, to Peggy Bouchet, the first woman to row across the Atlantic, and the rocker Johnnie Halliday, who gave the biggest concert ever organized in France in the Stade de France, one year after the greatest celebration ofall..... when the French won the soccer World Cup there in 1998, in one of the country's most exciting and dramatic national triumphs. The addition of an Index makes this third edition one that everyone will want to have in their library.",
  "genres": [
    "France",
    "Travel",
    "Nonfiction",
    "Cultural",
    "International",
    "Language",
    "School"
  ],
  "author": "Polly Platt",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/149775.French_or_Foe_"
}