{
  "title": "The Insanity of God: A True Story of Faith Resurrected",
  "description": "The Insanity of God is the personal and lifelong journey of an ordinary couple from rural Kentucky who thought they were going on just your ordinary missionary pilgrimage, but discovered it would be anything but. After spending over six hard years doing relief work in Somalia, and experiencing life where it looked like God had turned away completely and He was clueless about the tragedies of life, the couple had a crisis of faith and left Africa asking God, \"Does the gospel work anywhere when it is really a hard place?  It sure didn't work in Somalia.Nik recalls that, “God had always been so real to me, to Ruth, and to our boys. But was He enough, for the utter weariness of soul I experienced at that time, in that place, under those circumstances?” It is a question that many have asked and one that, if answered, can lead us to a whole new world of faith.How does faith survive, let alone flourish in a place like the Middle East? How can good truly overcome such evil? How do you maintain hope when all is darkness around you? How can we say “greater is He that is in me than he that is in the world” when it may not be visibly true in that place at that time? How does anyone live an abundant, victorious Christian life in our world’s toughest places? Can Christianity even work outside of Western, dressed-up, ordered nations? If so, how?The Insanity of God tells a story—a remarkable and unique story to be sure, yet at heart a very human story—of the Ripkens’ own spiritual and emotional odyssey. The gripping, narrative account of a personal pilgrimage into some of the toughest places on earth, combined with sobering and insightful stories of the remarkable people of faith Nik and Ruth encountered on their journeys, will serve as a powerful course of revelation, growth, and challenge for anyone who wants to know whether God truly is enough.Discover more inspirational books in the",
  "genres": [
    "Christian",
    "Biography",
    "Nonfiction",
    "Faith",
    "Christianity",
    "Religion",
    "Christian Living"
  ],
  "author": "Nik Ripken",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/14978955-the-insanity-of-god"
}