{
  "title": "The Big Thirst: The Secret Life and Turbulent Future of Water",
  "description": "Praised as “an entertaining and torrential flow of a book” by Nature magazine, The Big Thirstis a startling examination of the passing of the golden age of water and the shocking facts about how water scarcity will soon be a major factor in our lives.The water coming out of your kitchen tap is four billion years old and might well have been sipped by a Tyrannosaurus rex. Rather than only three states of water—liquid, ice, and vapor—there is a fourth, “molecular water,” fused into rock 400 miles deep in the Earth, and that’s where most of the planet’s water is found. Unlike most precious resources, water cannot be used up; it can always be made clean enough again to drink—indeed, water can be made so clean that it’s toxic. Water is the most vital substance in our lives but also more amazing and mysterious than we appreciate. As Charles Fishman brings vibrantly to life in this surprising and mind-changing narrative, water runs our world in a host of awe-inspiring ways, yet we take it completely for granted. But the era of easy water is over.Bringing readers on a lively and fascinating journey—from the wet moons of Saturn to the water-obsessed hotels of Las Vegas, where dolphins swim in the desert, and from a rice farm in the parched Australian outback to a high-tech IBM plant that makes an exotic breed of pure water found nowhere in nature—Fishman vividly shows that we’ve already left behind a century-long golden age when water was thoughtlessly abundant, free, and safe and entered a new era of high-stakes water. In 2008, Atlanta came within ninety days of running entirely out of clean water. California is in a desperate battle to hold off a water catastrophe. And in the last five years Australia nearly ran out of water—and had to scramble to reinvent the country’s entire water system. But as dramatic as the challenges are, the deeper truth Fishman reveals is that there is no good reason for us to be overtaken by a global water crisis. We have more than enough water. We just don’t think about it, or use it, smartly.The Big Thirst brilliantly explores our strange and complex relationship to water. We delight in watching waves roll in from the ocean; we take great comfort from sliding into a hot bath; and we will pay a thousand times the price of tap water to drink our preferred brand of the bottled version. We love water—but at the moment, we don’t appreciate it or respect it. Just as we’ve begun to reimagine our relationship to food, a change that is driving the growth of the organic and local food movements, we must also rethink how we approach and use water. The good news is that we can. As Fishman shows, a host of advances are under way, from the simplicity of harvesting rainwater to the brilliant innovations devised by companies such as IBM, GE, and Royal Caribbean that are making impressive breakthroughs in water productivity. Knowing what to do is not the problem. Ultimately, the hardest part is changing our water consciousness.As Charles Fishman writes, “Many civilizations have been crippled or destroyed by an inability to understand water or manage it. We have a huge advantage over the generations of people who have come before us, because we can understand water and we can use it smartly.” The Big Thirst will forever change the way we think about water, about our essential relationship to it, and about the creativity we can bring to ensuring that we’ll always have plenty of it.",
  "genres": [
    "Nonfiction",
    "Science",
    "Environment",
    "Nature",
    "Audiobook",
    "History",
    "Economics"
  ],
  "author": "Charles Fishman",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/10503170-the-big-thirst"
}