{
  "title": "The Wisdom of Sri Chinmoy",
  "description": "In a world where few feel totally at ease, Sri Chinmoy offers a plan for world and soul survival. Sri Chinmoy s deep love for God is known worldwide. Long revered as a spiritual force for peace at the United Nations, this humble God-directed author asks people of this planet to look within, to rediscover the essential truths of spirituality that have so blessed his extraordinary life. The name Chinmoy, meaning full of divine consciousness, bespeaks the mission of this deep soul. He lives to be an unconditional instrument of God. He trusts God. There is a sympathetic oneness with God and people throughout his reflections. He becomes sad when he thinks of how people have used religion to separate themselves from one another. Sri Chinmoy suggests that the spiritual life s goal is self-transcendence. While man reaches up to God, God in turn reaches down to man. The connection occurs and deepens as each person aspires to open himself to the Light of God, the Will of God and a higher state of consciousness. He is a champion of peace, attracting believers from all religions to see the oneness of the world. He suggests that true religions are recognized by forgiveness, tolerance, compassion, oneness and brotherhood. His work lends itself to a wide audience. Christians, Jews, Muslims and other believers will find many passages in his works of deep insight and helpful suggestion. For those trying to find their way, he proposes a form of prayer that concentration, the focusing of all attention on a small object to become more aware; meditation, reflection on and identification with the vaster universe and the larger issues; and contemplation, an awareness of God so complete that one feels the oneness and love that comes from God and lives in each person and in all creation. Sri Chinmoy does not shrink from the exigencies of everyday life. While he does promote soul growth and inner peace, he follows a long tradition of religious teachers who implore truth-seekers to exhibit and live a life of dynamism that is transformative of this world. Sri Chinmoy believes in reincarnation. He articulates the notion that the soul progresses to a higher state in each incarnation. He roots his teachings in prayer and encourages his readers to adopt a cheerful acceptance of the world with a view to transforming the fate and face of the world. He beckons Westerners to avoid trying to possess the world while encouraging Easterners to see that austerity is not the answer. Sri Chinmoy believes that God will save our world. The Light of God is stronger than the forces of evil. While he has deep confidence in God, his tranquil reflections portray an urgency which calls out to mankind, Wake up! Grow deeper! Love in such a way that God s Will be done.",
  "genres": [
    "Spirituality"
  ],
  "author": "Sri Chinmoy",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/1498167.The_Wisdom_of_Sri_Chinmoy"
}