{
  "title": "The Wit and Wisdom of Discworld",
  "description": "For more than two decades, Terry Pratchett has been regaling readers with tales of Discworld—a flat world balanced on the backs of four elephants, which are standing on the back of a giant turtle, flying through space. It is a world populated by ineffectual wizards and sharp-as-tacks witches, by tired policemen and devious dictators, by reformed thieves and vampires who have sworn to drink no blood. It is a world that is vastly different from our own . . . except when it isn't.Now, in The Wit and Wisdom of Discworld, various nuggets of Pratchett's witty commentary and sagacious observations have been compiled by Pratchett expert Stephen Briggs, a man who, they say, knows even more about Discworld than Terry Pratchett.Within these pages, you'll find musings on:Interior decorating: \"It's a fact known throughout the universes that no matter how carefully the colors are chosen, institutional decor ends up as either vomit green, unmentionable brown, nicotine yellow, or surgical appliance pink. By some little-understood process of sympathetic resonance, corridors painted in those colors always smell slightly of boiled cabbage—even if no cabbage is ever cooked in the vicinity.\" (Equal Rites)Travel: \"Any seasoned traveler soon learns to avoid anything wished on them as a 'regional speciality,' because all the term means is that the dish is so unpleasant the people living everywhere else will bite off their own legs rather than eat it. But hosts still press it upon distant guests anyway: 'Go on, have the dog's head stuffed with macerated cabbage and pork noses—it's a regional speciality.'\" (The Last Continent)Young men: \"And then there was the young male walk. At least women swung only their hips. Young men swung everything, from the shoulders down. You have to try to occupy a lot of space. It makes you look bigger, like a tomcat fluffing his tail. The boys tried to walk big in self-defense against all those other big boys out there. I'm bad, I'm fierce, I'm cool, I'd like a pint of shandy and me mam wants me home by nine.\" (Monstrous Regiment)Class: \"'Old money' meant that it had been made so long ago that the black deeds that had originally filled the coffers were now historically irrelevant. Funny, that; a brigand for a father was something you kept quiet about, but a slave-taking pirate for a great-great-great-grandfather was something to boast of over the port. Time turned the evil bastards into rogues, and rogue was a word with a twinkle in its eye and nothing to be ashamed of.\" (Making Money). . . and more culled from all the Discworld novels.",
  "genres": [
    "Fantasy",
    "Humor",
    "Fiction",
    "Reference",
    "Comedy",
    "Science Fiction Fantasy",
    "Speculative Fiction"
  ],
  "author": "Terry Pratchett",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/149864.The_Wit_and_Wisdom_of_Discworld"
}