{
  "title": "The Johnny Maxwell Trilogy",
  "description": "Johnny Maxwell Trilogy with 3 books [Only You can Save Mankind - Johhny and the Dead - Johnny and the Bomb] in one BookBook 1: Twelve-year-old Johnny receives a pirate edition of the new video game Only You Can Save Mankind from his friend Wobbler. However, he hasn't been playing for long when the ScreeWee Empire surrenders to him. After accepting the surrender he finds himself inside the game in his dreams, where he must deal with the suspicious Gunnery Officer as well as the understanding Captain, and work out exactly what they're all supposed to do now. This might all be the result of an over-active imagination except that the ScreeWee have disappeared altogether from everyone else's copy of the game. With the help of another player, Kirsty, who calls herself \"Sigourney\" (as in Weaver), Johnny must try to get the ScreeWee home.Book 2: Johnny and the Dead (1993) is the second novel by Terry Pratchett to feature the character Johnny Maxwell. The other novels in the Johnny Maxwell Trilogy are Only You Can Save Mankind (1992) and Johnny and the Bomb (1996). In this story, Johnny sees and speaks with the spirits (they object to the term \"ghost\") of those interred in his local cemetery and tries to help them when their home is threatened. Book 3: After Johnny Maxwell, a boy in his early teens, finds Mrs. Tachyon, an old bag lady, by a cinema he discovers that her trolley is in fact a time machine. He goes back to his town, Blackbury, during the time of The Blitz with his friends Stephen, aka Wobbler, Bigmac, Kirsty and Yo-less (possibly because Johnny has been obsessing about the destruction of Paradise Street in a German raid). Wobbler gets left behind in 1941, and when they return for him, Johnny tries to prevent the deaths caused in the raid.",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Fiction",
    "Young Adult",
    "Humor",
    "Middle Grade",
    "Science Fiction Fantasy"
  ],
  "author": "Terry Pratchett",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/149863.The_Johnny_Maxwell_Trilogy"
}