{
  "title": "The Dark Side of Innocence: Growing Up Bipolar",
  "description": "Killing yourself at any age is a seriously tricky business. But when I was seven, the odds felt insurmountable.As a young girl, Terri Cheney's life looked perfect. Her family lived in a lovely house in a tranquil Los Angeles suburb where the geraniums never once failed to bloom. She was pretty and smart, an academic superstar and popular cheerleader whose father doted on her. But starting with her first suicide attempt at age seven, it was clear that her inner world was anything but perfect. \"There's something wrong with her,\" her mother would whisper, her voice quivering on the edge of despair. And indeed there was, although no one had a name for it yet. Hostage to her roller-coaster moods, Terri veered from easy A-pluses to total paralysis, from bouts of obsessive hypersexuality to episodes of alcoholic abandon that nearly cost her her life. Throughout Terri's chaotic early years, nothing was certain from day to day except this: whatever was so deeply wrong with her must be kept a secret. Thirty years later, Terri wrote Manic, a harrowing memoir that revealed her adult struggle with bipolar disorder. It became an instant \"New York Times\" bestseller and received passionate critical acclaim. But it didn't tell the whole story. The mystery of Terri's childhood remained untouched-- too troubling, too painful to fathom. The Dark Side of Innocence explores those tumultuous formative years, finally shattering Terri's well-guarded secret.\" With vivid intensity, it blends a pitch-perfect childlike voice with keen adult observation. The Dark Side of Innocence provides a heart-rending, groundbreaking insider's look into the fascinating and frightening world of childhood bipolar disorder, an illness that affects a staggering one million children. This poignant and compelling story of Terri's journey from disaster and despair to hope and survival will serve as an informative and eye-opening tale for those who would trust a flawless facade.",
  "genres": [
    "Memoir",
    "Mental Health",
    "Psychology",
    "Nonfiction",
    "Mental Illness",
    "Biography",
    "Autobiography"
  ],
  "author": "Terri  Cheney",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/10503737-the-dark-side-of-innocence"
}