{
  "title": "The Osteoporosis Book: Bone Health",
  "description": "Tens of millions of people all around the world are affected by osteoporosis with the numbers increasing yearly. Yet this very serious and debilitating disease is widely ignored and misunderstood by the very people who are most at risk. The Osteoporosis Bone Health, now in its third and most comprehensive edition, is an invaluable and possibly life-saving resource and powerful information tool that should be in the hands of every adult, both female and male. Since The Osteoporosis Book was first introduced in 1993, many new diagnostic techniques, treatment regimens and healthy-living approaches have emerged. This new edition incorporates all these, tailored to the particular issues of the large population of educated baby-boomer consumers who are more prone to take charge of their own bone health (along with that of their elderly parents). The book also enhances and advances bone-health education for modern healthcare providers who tend to a more holistic, all-encompassing approach. To take advantage of the many advances in bone health techniques and technologies, credible, easy-to-read information that addresses the very real issues people are facing, is vital. The Osteoporosis Book is an invaluable aid for optimizing bone health for everyone, shifting the focus from disease treatment to bone health and fracture prevention. This third edition includes updated information on calcium, vitamin D and other essential minerals, along with the power of exercise. It also addresses the value of and procedures for a clinical evaluation by a doctor as well as ways to prevent falls and fractures and manage post-fracture care. New treatment options are presented, and updated information about old therapies is discussed. Written by experts in the field, including a Nurse-Educator who knows first-hand how osteoporosis affects a person’s body, mind and even lifestyle,",
  "genres": [],
  "author": "Gwen Ellert",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/14988345-the-osteoporosis-book"
}