{
  "title": "Rise of the Magi",
  "description": "An epic battle looms as Omar, Myles, and Kasey train a new breed of Magi for war!Omar Metzger, earth's most brilliant scientist, is in a race against time to find his sister in another dimension before she dies in a coma. He has one week before his funding is cut so without hesitation he enters a portal to an unknown world to prove his findings and hopefully save his sister.Myles Callaghan, an illusionist con-artist, has bitten off more than he can chew, swindling a Mafia Don out of several million dollars. On the run, Myles goes much further than he could have imagined. He encounters Omar on Musterion, and they form the Order of the Magi.Kasey is a hired assassin with orders to assassinate the Israeli Prime Minister. Betrayed, Kasey must escape before she is captured. As she crosses an archway in the Prime Minister's basement she realizes she has crossed much more than the threshold of a door--rather a portal.As these three unlikely companions join forces on Musterion, they must find their way through an ever changing maze, fight their inner demons, and then escape to a new world, Soterion, before the forces of evil close in on them. There Kasey is given a sword that was once a Bible on earth. They must take the sword to a carpenter but the Great Red Dragon tries to prevent them. Rise of the Magi is filled with battle action, steampunk fantasy, and a touch of romance, It's an epic tale of their search for truth and ultimately redemption. Book One in the Forgotten Portals Trilogy. FICTION / Christian / Fantasy\"Great story, great characters, great universe! The clash of civilizations, old and new, and mix of ancient cultures and ancient hi-tech flavor is wonderful. Rise of the Magi is much more in depth and \"steam punk\" like than I imagined. My first impression was that the world was going to be too similar to other fantasy worlds but it is very unique. I love the parallel universe and multi-dimensional elements; they are brilliant. The fact that I'm so passionate with my opinions about this story only proves how moving and fresh it really is. There is no question that this story and universe is movie and video game worthy.Congrats Randy, you wrote a wonderful story!\"~Jamie WiggsGame Designer(Squaresoft, Microsoft, EA Games)Works including: Middle Earth 1 and 2, Shadows of Mordor To pre-register (no money required) to order the book click on the provided link below.http://soterion.com/PreOrder.aspx",
  "genres": [
    "Steampunk",
    "Fantasy",
    "Christian Fiction"
  ],
  "author": "Randy Blackwell",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/14994631-rise-of-the-magi"
}