{
  "title": "Cajun and Creole Music Makers: Musiciens cadiens et creoles",
  "description": "The virtual renaissance of all things Cajun and Creole has captivated enthusiasts throughout America and invigorated the culture back home. Who, just fifteen years ago, could have predicted that this regional music would become so astonishingly popular throughout the nation and the world? This new edition of a book first published in 1984 celebrates the music makers in the generation most responsible for the survival of Cajun music and zydeco and showcases many of the young performers who have emerged since them to give the music new spark. More than 100 color photographs, show them in their homes, on their front porches, and in their fields, as well as in performance at local clubs and dance halls and on festival stages. In interviews they speak directly about their lives, their music, and the vital tradition from which their rollicking music springs. Many of the legendary performers featured here--Dewey Balfa, Clifton Chenier, Nathan Abshire, Dennis McGee, Canray Fontenot, Varise Connor, Octa Clark, Lula Landry, and Inez Catalon--are no longer alive. Others from the early days continue to perform--Bois-sec Ardoin, Michael Doucet, D. L. Menard, and Zachary Richard. Their grandeur, humor, and humility are precisely the qualities this book captures. Featured too are young musicians who are taking their place in the dance halls, on festival stages, and on the folk music circuit. Cajun and Creole music makers, both young and old, still play in the old ways, but as young musicians--such as Geno Delafose and the French Rockin' Boogie, and Steve Riley and the Mamou Playboys-- experiment and enrich the tradition with new sounds of rock, country, rap, and funk, the music evolves and enlivens a whole new audience. Barry Jean Ancelet, a native French-speaking Cajun, is chair of the Department of Modern Languages and director of the Center for Acadian and Creole Folklore at the University of Southwestern Louisiana. Among his many books are Cajun Country and Cajun and Creole Folk Tales (both from the University Press of Mississippi). Elemore Morgan, Jr., is an artist and retired professor of visual art at University of Southwestern Louisiana.",
  "genres": [
    "Music"
  ],
  "author": "Barry Jean Ancelet",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/1499832.Cajun_and_Creole_Music_Makers"
}