{
  "title": "It's Enough to Make You Sick: The Failure of American Health Care and a Prescription for the Cure",
  "description": "More and more Americans are finding themselves without health insurance or with coverage that is so inadequate they face financial ruin in the event they actually get sick. So they go without. Their children don't receive their immunizations. They allow that worrisome lump in their breast to grow so large that by the time the cancer has been detected it has spread beyond the ability to cure. Seniors can't pay their heating bills or sustain adequate nutrition as the rising cost of their prescription drugs compels them to make difficult choices. Just how did our system become so dysfunctional and who is responsible? This book will tell you.Too often, discussions on the health care crisis focus a myopic lens on the usual suspects. We are all quick to point a finger at insurance companies who place profit over patients or the pharmaceutical industry that extorts obscene amounts of American dollars for the same drugs that cost 50 to 75 percent less when we cross our borders north or south. We blame trial lawyers who practice with a \"lottery\" mentality that protects neither the patient from negligent care nor good physicians from frivolous lawsuits.But the culpability for our crisis is more widespread. Hospitals have devolved from not-for-profit, community-based institutions to large, national for-profit chains. Doctors no longer spend time with their patients but instead rely on expensive, and often times, unnecessary tests and use physician extenders (such as P.A.s and nurse practitioners) to move patients along like cars on an assembly line. Politicians pass well-meaning laws as a knee-jerk reaction to a specific issue without understanding the unexpected consequences, which frequently only exacerbate the problem. And they operate in a system of special interests and influence peddling that all but assures the failure of any meaningful health care reform. And while we all demand high quality health care, few actually take preventative measures that could keep them out of the system they deride. This is a public that eats, drinks, and smokes to excess yet exercises far too seldom.It's Enough to Make You The Failure of American Health Care and a Prescription for the Cure discusses how things got so bad, tracking the origins of the U.S. health care system and illuminating how each of the important components have evolved over the last century. Lobosky explains how the varied special interests have conspired to create a system that is by far the costliest in the world and yet is mediocre at best in providing quality care. He explores the various culprits and how each has contributed to the sad state of affairs. The Patient Protection and Affordable Care Act is dissected in detail, and a practical and compassionate blueprint for meaningful reform is offered to remedy the situation. This book is a must read for every American who is frustrated and disheartened by the recent health care battles, for every American who suffers through the \"best health care system in the world,\" and for every American who wants to assure quality care for themselves and those they love.",
  "genres": [
    "Nonfiction",
    "Health"
  ],
  "author": "Jeffrey M. Lobosky",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/14999236-it-s-enough-to-make-you-sick"
}