{
  "title": "The Absinthe Underground",
  "description": "Moulin Rouge meets Holly Black in a thrilling sapphic friends-to-lovers romantasy!For Sybil Clarion, the Belle Époque city of Severon is a wild, romantic dream, filled with cafés, cabarets, and glittering nightclubs. Eager to embrace the city’s freedom after running away from home, she’s traded high-society soirées for empty pockets and barren cabinets. At least she has Esme, the girl who offered Sybil a home, and maybe—if either of them dared—something more.Ever since Esme Rimbaud brought Sybil back to her flat, the girls have been everything to each other—best friends, found family, and secret crushes. While Esme would rather spend the night tinkering with her clocks and snuggling her cats, Sybil craves excitement and needs money. She plans to get both by stealing the rare posters that crop up around town and selling them to collectors. With rent due, Esme agrees to accompany—and more importantly protect —Sybil.When they’re caught selling a poster by none other than its subject, Maeve, the glamorous girl doesn’t press charges. Rather, she invites Sybil and Esme to The Absinthe Underground, the exclusive club she co-owns, and reveals herself to be a Green Faerie, trapped in this world. She wants to hire thieves for a daring heist in Fae that would set her free, and is willing to pay enough that Sybil and Esme never have to worry about rent again. It’s too good of an offer to pass up, even if Maeve’s tragic story doesn’t quite add up, and even if Sybil’s personal ties to Fae could jeopardize everything she and Esme have so carefully built.Jamie Pacton, author of The Vermilion Emporium, dazzles in this lavish and decadent LGBTQ+ fantasy romance that will leave readers utterly enchanted!",
  "genres": [
    "Fantasy",
    "Lesbian",
    "Romance",
    "Queer",
    "LGBT",
    "Young Adult",
    "Historical Fiction"
  ],
  "author": "Jamie Pacton",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/150065064-the-absinthe-underground"
}