{
  "title": "Øyets Sult",
  "description": "Un gelido mattino di novembre, in una Oslo già in atmosfera prenatalizia, un uomo viene arrestato dalla polizia. Le manette, i cani, gli imperturbabili poliziotti, le facce dei passanti che lo guardano con sospetto, tutto gli pare irreale, come se stesse assistendo a un film di cui è l’inconsapevole protagonista. Portato al commissariato, viene chiuso in cella senza poter parlare con un avvocato e sottoposto a un estenuante interrogatorio da un ispettore che cerca in tutti i modi di farlo confessare. Ma confessare cosa? Di cosa è in realtà accusato? O è già quel suo nome esotico, Azhiz Shabaz Kumar Sen, che fa di lui un colpevole? O il fatto stesso di essere un indiano, costretto dal “vento della storia” a una vita vagabonda attraverso i continenti e approdato lì, in quel paese nordico e lontano, forse solo perché da bambino un pastore danese gli parlava con rapimento del mistico incanto della neve? Tra Asle Foss, l’ispettore, e l’inafferrabile Shabaz comincia così un duello fatto di domande e risposte, ma anche di inseguimenti, fughe, arresti, evasioni, in un giallo sui generis, in cui quello che tiene viva la suspense non è la ricerca dell’assassino, ma del delitto. Un duello che non è solo lo scontro tra due personalità, ma un confronto tra due culture e due mondi. I ricordi di un’infanzia sulle rive del Gange, i campi profughi, il pellegrinaggio a Calcutta, la madre con le sue arti culinarie e la sua caccia agli insetti, il padre idolatra di Shakespeare, il mitico Bob Beaumon, l’amore norvegese per la bella Liv, le disavventure dello studente Salman-Salman, l’amicizia con lo specialista del cervello Hansen: nella folla di personaggi, fatti ed emozioni che Shabaz a poco a poco rievoca con l’ironica vivacità di un occhio insaziabile, emerge la figura di un uomo affamato di vita che forse continua a nasconderci qualcosa, o forse è solo colpevole di “aver voluto troppo”.",
  "genres": [
    "Fiction"
  ],
  "author": "Tove Nilsen",
  "average_rating": "3.19",
  "url": "https://www.goodreads.com/book/show/1500769._yets_Sult"
}