{
  "title": "The Game",
  "description": "The Game - Jeff Cott The Game is the story of Ellie's bid to change from sexy, biddable housewife to sexy dominant goddess. Ellie and Jake are a happily married couple who play a bedroom game. Having lost the last Game Ellie must start the new one where she left off - bound and gagged on the bed. As she figures out how to tie herself up before Jake's return from work, Ellie remembers the last Game and has ideas for the new one. Jake is immensely strong and loving and has seemingly endless sexual stamina so the chances of Ellie truly gaining control look slim. Although she has won the Game on occasions, she suspects he lets her win just so he can overwhelm her in the next. She has to find a way to break this pattern. But does she succeed? One of Us - Antonia Adams Successful artist Natalie Crane is midway through a summer exhibition with friend and agent Anton when Will Falcon strolls tantalisingly into her life. After a messy divorce, a relationship is not Natalie's priority. Anton takes an immediate dislike to the shaven-headed composer, but Natalie is captivated. He is everything she is not: free, impulsive and seemingly with no thought for the future. He introduces her toDorset's beautiful coves and stunning countryside and their time together is magical. Things get complicated when her most famous painting, a nude self-portrait, is stolen and there are no signs of a break-in. When it's time for her return toLondon, Will doesn't turn up to say goodbye, and she cannot trace him. Anton tells her to forget him, but she cannot. Then she discovers the stakes are much higher than they first appeared. Taste It - Sommer Marsden Jill and Cole are competing for the title of Best Chef. The spicy, sizzling and heated televised contest fuels a lust in Jill she'd rather keep buried. She can't be staring at the man's muscles ... he's her competition! During a quick cooking throwdown things start to simmer and it becomes harder and harder for Jill to ignore that she's smitten in the kitchen. Cole's suggestive glances and sly smiles aren't helping her any. When fate puts her in his shower and then his chivalrous nature puts her in his borrowed clothes, there's no way to deny the natural heat between them.",
  "genres": [],
  "author": "Jeff Cott",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/15007327-the-game"
}