{
  "title": "One Long Hot Summer",
  "description": "One Long Hot Summer - Elizabeth Coldwell Lily's looking after her friend, Amanda's, home on the Dorsetcoast, hoping it will ease her writer's block and help her get over her ex, Alex. What she doesn't expect is that Amanda's 21-year-old son Ryan will arrive at the house, planning to spend the summer surfing and partying - or that he'll have grown up quite so nicely. Ryan's as attracted to her as she is to him - but surely acting on her feelings for a man 14 years her junior is inappropriate? And when Alex makes a sudden reappearance in her life, wanting to get back together, should she follow her head or her heart? How can she resolve this case of summer madness? Just Another Lady - Penelope Friday Regency lady Elinor has fallen on hard times. The death of her father and the entail of their house put Elinor and her mother in difficulty; and her mother's illness has brought doctor's bills that they cannot pay. Lucius Crozier was Elinor's childhood friend and adversary; and there has always been a spark of attraction between the pair. Now renowned as a womaniser, he offers a marriage of convenience (for him!) in return for the payment of Elinor's mother's medical bills. Reluctantly, she agrees. But Lucius has made enemies of other gentlemen of the upper echelon by playing fast and loose with their mistresses, and one man is determined to take his revenge through Lucius's new wife ... Safe Haven - Shanna Germaine Kallie Peters has finally made her dream come true - she's turned the family farm into Safe Haven, an animal sanctuary. But financial woes are pressing in on her, and she's worried that the only way to keep the farm is to allow her rich ex-boyfriend back into her life. When a sexy stranger shows up in her driveway with a wiggling puppy in his arms, she knows it's her chance for a hot rendezvous before she gives up her freedom. The sex is hot, wild and passionate - the perfect interim before returning to the pressures of real life - but something else is happening between them. Can they find a way to save their dreams, their passions and their hearts, or will they have to say goodbye to all they've come to love?",
  "genres": [
    "Romance"
  ],
  "author": "Elizabeth Coldwell",
  "average_rating": "3.08",
  "url": "https://www.goodreads.com/book/show/15007322-one-long-hot-summer"
}