{
  "title": "El país bajo mi piel: Memorias de amor y guerra",
  "description": "Tras casarse muy jóven y ser madre, Gioconda Belli se unió al clandestino y emergente movimiento Sandinista, sustituyendo su deseo de ser una buena esposa por la necesidad de vivir una vida plena y comprometida con los cambios sociales en su país.Irónicamente, su pertenencia a la burguesía y su carrera como poeta renombrada, le brindaron la fachada que le permitió funcionar, secretamente, como rebelde. Desde su infancia en Managua y sus encuentros iniciales con poetas y revolucionarios, a persecuciones urbanas, reuniones con Fidel Castro, relaciones amorosas truncadas por la muerte o el exilio en México y Costa Rica, hasta su inesperado matrimonio con un periodista norteamericano, la historia de Gioconda Belli es tanto la de una mujer que se descubre a sí misma, como la de una nación que forja su destino.ENGLISH DESCRIPTION\"A passionate, lyrical, tough-minded account of an extraordinary life in art, revolution, and love. It's a book to relish, to read and re-read. Unforgettable.\" --Salmon RushdieAn electrifying memoir from the acclaimed Nicaraguan writer (“A wonderfully free and original talent”—Harold Pinter) and central figure in the Sandinista Revolution.Until her early twenties, Gioconda Belli inhabited an upper-class sheltered from the poverty in Managua in a world of country clubs and debutante balls; educated abroad; early marriage and motherhood. But in 1970, everything changed. Her growing dissatisfaction with domestic life, and a blossoming awareness of the social inequities in Nicaragua, led her to join the Sandinistas, then a burgeoning but still hidden organization. She would be involved with them over the next twenty years at the highest, and often most dangerous, levels.Her memoir is both a revelatory insider’s account of the Revolution and a vivid, intensely felt story about coming of age under extraordinary circumstances. Belli writes with both striking lyricism and candor about her personal and political about her family, her children, the men in her life; about her poetry; about the dichotomies between her birth-right and the life she chose for herself; about the failures and triumphs of the Revolution; about her current life, divided between California (with her American husband and their children) and Nicaragua; and about her sustained and sustaining passion for her country and its people.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "History",
    "Biography",
    "Biography Memoir",
    "Politics",
    "Spanish Literature"
  ],
  "author": "Gioconda Belli",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/150077.El_pa_s_bajo_mi_piel"
}