{
  "title": "The End of Race Politics: Arguments for a Colorblind America",
  "description": "An exciting new voice makes the case for a colorblind approach to politics and culture, warning that the so-called ‘anti-racist’ movement is driving us—ironically—toward a new kind of racism.As one of the few black students in his philosophy program at Columbia University years ago, Coleman Hughes wondered why his peers seemed more pessimistic about the state of American race relations than his own grandparents–who lived through segregation. The End of Race Politics is the culmination of his years-long search for an answer.Contemplative yet audacious, The End of Race Politics is necessary reading for anyone who questions the race orthodoxies of our time. Hughes argues for a return to the ideals that inspired the American Civil Rights movement, showing how our departure from the colorblind ideal has ushered in a new era of fear, paranoia, and resentment marked by draconian interpersonal etiquette, failed corporate diversity and inclusion efforts, and poisonous race-based policies that hurt the very people they intend to help. Hughes exposes the harmful side effects of Kendi-DiAngelo style antiracism, from programs that distribute emergency aid on the basis of race to revisionist versions of American history that hide the truth from the public.Through careful argument, Hughes dismantles harmful beliefs about race, proving that reverse racism will not atone for past wrongs and showing why race-based policies will lead only to the illusion of racial equity. By fixating on race, we lose sight of what it really means to be anti-racist. A racially just, colorblind society is possible. Hughes gives us the intellectual tools to make it happen.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Race",
    "Sociology",
    "History",
    "Audiobook",
    "Philosophy"
  ],
  "author": "Coleman Hughes",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/150246196-the-end-of-race-politics"
}