{
  "title": "Weiberregiment",
  "description": "Es gab immer Krieg ... Schon jahrelang befindet sich das kleine und verarmte Borograwien im dauerhaften Kriegszustand mit seinen Nachbarn. Beherrscht von einer Herzogin, die seit dreißig Jahren niemand mehr zu Gesicht bekommen hat, und von einem Gott, dessen absurde Verbote selbst die eigenen Priester nicht mehr begreifen, hat sich Borograwien nun auch noch das mächtige Ankh-Morpork zum Feind gemacht. Dabei ist es um die Armee des Landes so schlecht bestellt, dass sie sich bereits gezwungen sieht, Trolle, Zombies und Vampire anzuwerben, um die Lücken in den eigenen Reihen zu schließen.  Auch der Bruder der jungen Polly Perks ist in den Krieg gezogen und gilt seit einiger Zeit als vermisst. Da sie die Arbeit im Wirtshaus ihrer Eltern ohnehin satt hat, beschließt Polly kurzerhand, in die Armee einzutreten und ihren Bruder zu suchen. Natürlich sind Frauen in den borograwischen Streitkräften strengstens verboten -- schließlich ist Krieg Männersache! --, doch mit Hilfe eines radikalen Haarschnitts und zweier an der richtigen Stelle platzierten Socken gelingt es Polly, den Feldwebel zu täuschen und sich in die Armee einzuschmuggeln. Zunächst lebt sie in ständiger Furcht vor einer Entdeckung. Allerdings beginnt sie bald zu ahnen, dass sie nicht die einzige Frau in der Kompanie ist. Darüber hinaus muss Polly feststellen, dass die Realität des Krieges nur wenig mit dem gemein hat, was in den Medien des Landes darüber berichtet wird.  Weiberregiment ist in einem Winkel von Terry Pratchetts Scheibenwelt angesiedelt, der bisher noch weitgehend unerforscht war. Neben kurzen Auftritten bekannter Figuren wie Hauptmann Mumm von der Stadtwache und William de Worde als Kriegsberichterstatter wartet der Roman außerdem mit einer ganzen Reihe neuer und -- in bester Pratchett-Manier -- verschrobener Figuren auf. Er eignet sich daher auch sehr gut als Einstieg für Leser, die bisher noch keinen Ausflug in die Scheibenwelt unternommen haben. Der Krieg -- vielleicht eine der groteskesten menschlichen Aktivitäten überhaupt -- wird für Pratchett zum Ausgangspunkt für eine Satire auf unfähige Diplomaten, religiöse Fanatiker und verbohrte Bürokraten. Einmal mehr hält uns Pratchett den Spiegel vor und zeigt uns, wie sehr die Absurdität der Scheibenwelt unserer Realität ähnelt ... oder war es etwa anders herum? -- Sara Schade",
  "genres": [
    "Fantasy",
    "Fiction",
    "Humor",
    "Comedy",
    "Audiobook",
    "Science Fiction Fantasy",
    "War"
  ],
  "author": "Terry Pratchett",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/1502803.Weiberregiment"
}