{
  "title": "The Weather Thesaurus: A Fiction Writer's Sourcebook of Words and Phrases to Describe the Weather",
  "description": "Writing Vivid Scenes Has Never Been Easier Thanks To This Invaluable Compendium of Descriptive Words and Phrases!For many fiction writers, the thought of writing about such things as weather conditions can seem tedious and uninspiring. But a beautifully written description of the weather has the power to ignite a reader's imagination and set a mood for the plot that follows. Nothing conveys sadness like a good old-fashioned rainstorm. Likewise, happiness is usually accompanied by sunshine. Good or bad weather conditions can also play a pivotal role in a novel's plot. Horrors, thrillers, and romances alike, all weave weather into their storylines. Characters are very often in conflict with the weather; a thunderstorm or cyclone can become a key plot point within a story. Therefore, knowing how to describe such scenarios becomes a necessityIn the past, this process was often met with dread, but not anymore!Dahlia Evans has compiled a unique thesaurus designed to help fiction writers describe every aspect of the weather. This incredible sourcebook is overflowing with words and phrases gathered from a vast library of bestselling novels. Now, you can write vivid descriptions like a seasoned pro without breaking a sweatInside You Will * A wealth of weather-related nouns organized into 62 thematic sections. Some clouds, rain, sky, sun, wind, and much more.* An exhaustive list of adjectives to describe each main entry word in vivid detail.* A slew of useful prepositional phrases to add color and variety to your descriptions.* Noun phrases of every type imaginable. You will never be short of inspiration with these winners.* An extensive collection of verbs related to each main entry. These action words will bring life to your descriptions.* Each main entry includes a number of example sentences to help illustrate their use in a fictional context.* And finally, words are sorted in alphabetical order for your convenience.The Weather Thesaurus is an essential resource for any fiction writer who wants to take their descriptive writing to the next level.",
  "genres": [],
  "author": "Dahlia Evans",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/150387995-the-weather-thesaurus"
}