{
  "title": "The World and Other Places: Stories",
  "description": "Her first short story collection exhibits the multitude of talents that have made English novelist Jeanette Winterson not just admired but beloved by her many fans. There are the surprising, fresh little phrases minted expressly to convey the delicate realities of the made-up world. There's the humor, fierce and sly but always kind. There's the imagination that changes gender and historical epoch at whim, and does so convincingly; and the characters themselves, a sundry bunch of men and women not necessarily successful or commendable but always, somehow, likable. Best of all, by their very diversity, these stories reveal glimpses of the smart and enigmatic woman behind the work. In \"Atlantic Crossing,\" Winterson becomes a middle-aged businessman of the mid-20th century, accidentally assigned to share his second-class cabin with a young black woman on a transatlantic crossing. In the realm of event, little happens, but in its depth of perception and what it tells of the nuances of regret, the story is as rich as a novel in another writer's hands. A few scant pages later, Winterson becomes a kind of lost female Homer, telling Orion's story from Artemis's point of view: \"When she returned she saw this huge rag of a man eating her goat, raw.... His reputation hung about him like bad breath.\" In \"The Poetics of Sex,\" she creates a lesbian love story that evokes her characters' personalities as explicitly as their erotic pleasures. \"The 24-Hour Dog,\" the story of a woman writer returning a puppy she had thought to adopt, is remorseless as a psychological thriller in the squirmy depths it plumbs: \"I had made every preparation, every calculation, except for those two essentials that could not be calculated: his heart and mine.\" Read The World and Other Places twice, once for instruction, once for joy. --Joyce Thompson",
  "genres": [
    "Short Stories",
    "Fiction",
    "Queer",
    "Literary Fiction",
    "Contemporary",
    "LGBT",
    "Literature"
  ],
  "author": "Jeanette Winterson",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/15049.The_World_and_Other_Places"
}