{
  "title": "Why Can't I Make People Understand? Discovering the Validation Those with Chronic Illness Seek and Why",
  "description": "\"No one gets it!\" we all exclaim at one time or another when we live with chronic illness. But if you feel this way on a regular basis you may be in trouble! Why Can't I Make People Understand? Discovering the Validation Those with Chronic Illness gives you unique insight into why you crave the understanding of those around you when you are suffering with a chronic illness and helps you get past the frustrations you feel when people say things like, \"no pain, no gain!\" or \"if you'd just get out of the house more you'd feel much better.\" No matter how much we love our friends and family, we can become \"sick and tired\" of hearing about how we are causing ourselves to be \"sick and tired.\" Even when you've come to terms with your illness and all the emotions involved one comment or look can send us reeling back to when we were first diagnosed and dealing with all the well-meaning advice and skepticism. Why Can't I Make People Understand? Discovering the Validation Those with Chronic Illness will help you work through this and more, such as. . . * What happens to your spiritual life when you feel alone and misunderstood in your pain? * How does your attitude affect if you get the understanding you seek or not? * How should you pray for others to understand and change their attitude about your illness? * Why do some prayers get answered but with poor results? * How should you respond when people say hurtful things about your chronic illness? * What Biblical responsibilities are you exempt from? * Is it okay to get mad at God about it all and express your true feelings about your illness and the pain others are causing? * How can your relationship with Christ help all of the above become less important?",
  "genres": [
    "Christian"
  ],
  "author": "Lisa Copen",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/1505120.Why_Can_t_I_Make_People_Understand_Discovering_the_Validation_Those_with_Chronic_Illness_Seek_and_Why"
}