{
  "title": "Echoes From The Holocaust: A Memoir",
  "description": "Echoes from the HolocaustA MemoirMira Ryczke Kimmelman\"During the most difficult times of World War II,\" Mira Kimmelman writes, \"I wondered whether the world really knew what was happening to us. I lived in total isolation, not knowing what was taking place outside the ghetto gates, outside the barbed wires of concentration camps. After the war, would anyone ever believe my experiences?\"Kimmelman had no way of preserving her experiences on paper while they happened, but she trained herself to remember. And now, as a survivor of the Holocaust, she has preserved her recollections for posterity in this powerful and moving book—one woman's personal perspective on a terrible moment in human history.The daughter of a Jewish seed exporter, the author was born Mira Ryczke in 1923 in a suburb of the Baltic seaport of Danzig (now Gdansk, Poland). Her childhood was happy, and she learned to cherish her faith and heritage. Through the 1930s, Mira's family remained in the Danzig area despite a changing political climate that was compelling many friends and neighbors to leave. With the Polish capitulation to Germany in the autumn of 1939, however, Mira and her family were forced from their home. In calm, straightforward prose—which makes her story all the more harrowing—Kimmelman recalls the horrors that befell her and those she loved. Sent to Auschwitz in 1944, she escaped the gas chambers by being selected for  slave labor. Finally, as the tide of war turned against Germany, Mira was among those transported to Bergen-Belsen, where tens of thousands were dying from starvation, disease, and exposure. In April 1945, British troops liberated the camp, and Mira was eventually reunited with her father. Most of the other members of her family had perished.In the closing chapters, Kimmelman describes her marriage, her subsequent life in the United States, and her visits to Israel and to the places in Europe where the  events of her youth transpired. Even when confronted with the worst in humankind, she observes, she never lost hope or succumbed to despair. She concludes with an eloquent \"If future generations fail to protect the truth, it vanishes. . . . Only by remembering the bitter lesson of Hitler’s legacy can we hope it will never be repeated. Teach it, tell it, read it.\"The Mira Ryczke Kimmelman is a resident of Oak Ridge, Tennessee, and lectures widely in schools about her experiences during the Holocaust.",
  "genres": [
    "Holocaust",
    "History",
    "Memoir",
    "Nonfiction",
    "Biography Memoir",
    "World War II",
    "Autobiography"
  ],
  "author": "Mira Ryczke Kimmelman",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/150534.Echoes_From_The_Holocaust"
}