{
  "title": "Johnny Appleseed: The Man, the Myth, the American Story",
  "description": "This portrait of Johnny Appleseed restores the flesh-and-blood man beneath the many myths. It captures the boldness of an iconic American life and the sadness of his last years, as the frontier marched past him, ever westward. And it shows how death liberated the legend and made of Johnny a barometer of the nation’s feelings about its own heroic past and the supposed Eden it once had been. It is a book that does for America’s inner frontier what Stephen Ambrose’s Undaunted Courage did for its western one. No American folk hero—not Davy Crockett, not even Daniel Boone—is better known than Johnny Appleseed, and none has become more trapped in his own legends. The fact is, John Chapman—the historical Johnny Appleseed—might well be the best-known figure from our national past about whom most people know almost nothing real at all. One early historian called Chapman “the oddest character in all our history,” and not without cause. Chapman was an animal whisperer, a vegetarian in a raw country where it was far easier to kill game than grow a crop, a pacifist in a place ruled by gun, knife, and fist. Some settlers considered Chapman a New World saint. Others thought he had been kicked in the head by a horse. And yet he was welcomed almost everywhere, and stories about him floated from cabin to cabin, village to village, just as he did. As eccentric as he was, John Chapman was also very much a man of his a land speculator and pioneer nurseryman with an uncanny sense for where settlement was moving next, and an evangelist for the Church of the New Jerusalem on a frontier alive with religious fervor. His story is equally America’s story at the birth of the nation. In this tale of the wilderness and its taming, author Howard Means explores how our national past gets mythologized and hired out. Mostly, though, this is the story of two men, one real and one invented; of the times they lived through, the ties that link them, and the gulf that separates them; of the uses to which both have been put; and of what that tells us about ourselves, then and now.",
  "genres": [
    "Biography",
    "History",
    "American History",
    "Nonfiction",
    "Folklore",
    "Biography Memoir",
    "Food"
  ],
  "author": "Howard Means",
  "average_rating": "3.23",
  "url": "https://www.goodreads.com/book/show/10507420-johnny-appleseed"
}