{
  "title": "Corporate Warriors: The Rise of the Privatized Military Industry",
  "description": "Some have claimed that'War is too important to be left to the generals,'but P. W. Singer asks'What about the business executives?'Breaking out of the guns-for-hire mold of traditional mercenaries, corporations now sell skills and services that until recently only state militaries possessed. Their products range from trained commando teams to strategic advice from generals. This new'Privatized Military Industry'encompasses hundreds of companies, thousands of employees, and billions of dollars in revenue. Whether as proxies or suppliers, such firms have participated in wars in Africa, Asia, the Balkans, and Latin America. More recently, they have become a key element in U.S. military operations. Private corporations working for profit now sway the course of national and international conflict, but the consequences have been little explored. In this book, Singer provides the first account of the military services industry and its broader implications. Corporate Warriors includes a description of how the business works, as well as portraits of each of the basic types of military providers that offer troops for tactical operations; military consultants that supply expert advice and training; and military support companies that sell logistics, intelligence, and engineering. The privatization of warfare allows startling new capabilities and efficiencies in the ways that war is carried out. At the same time, however, Singer finds that the entrance of the profit motive onto the battlefield raises a series of troubling questions'for democracy, for ethics, for management, for human rights, and for national security.",
  "genres": [
    "Nonfiction",
    "Military Fiction",
    "Politics",
    "History",
    "War",
    "Military History",
    "Economics"
  ],
  "author": "P.W. Singer",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/150581.Corporate_Warriors"
}