{
  "title": "Xtabentum: A Novel of Yucatan",
  "description": "According to Mayan legend, the Xtabentum flower that grows wild on the Yucatan peninsula first appeared on the grave of a free-spirited young woman who was scorned for her passion by the people of her village, but loved by the gods for her kind A Novel of Yucatan is a story of two young women set in the years following the Mexican Revolution in Merida, Yucatan, one of the wealthiest cities in the world at the time. Amanda Diaz is from the “divine caste,” a small group of families of European descent who dominate the politics and economy of the region. Amanda’s lifelong friend, Carmen, is from the opposite end of the social spectrum, a Mayan Indian who is the daughter of one of the Diaz family servants. Against the true historical background of rebellion, discrimination and assassination in the unstable country, the whipping of Carmen by a Diaz neighbor exposes the sheltered existence of the two women and drives them apart. The story follows Amanda through her horror at the social injustice of the two-class Mexico to the sacrifices she makes in the name of friendship. Parts of the story take place in modern times, where the discovery of an old birth certificate sets Amanda’s granddaughter in search of a secret about her father’s birth. Her search, told in the first person, is blended with a third-person account of the lives of Amanda and her contemporaries in the 1920s.If you're looking for a captivating and engaging read, look no further than \" A Novel of Yucatan.\" Set against the vibrant backdrop of Mexico's Yucatan Peninsula, this novel offers a thrilling combination of history, culture, and mystery that is sure to keep you on the edge of your seat. With its richly-drawn characters and vivid descriptions of the Yucatan's stunning landscapes, \"Xtabentum\" immerses you in a world of ancient traditions and modern conflicts. Whether you're a fan of historical fiction, mystery, or just a great story, you won't be able to put this book down. So come along on a journey through the lush jungles and pristine beaches of the Yucatan, as the novel's characters grapple with love, loss, and the timeless struggle between good and evil. \" A Novel of Yucatan\" is a must-read for anyone who loves a good adventure, and it's available now!",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Travel"
  ],
  "author": "Rosy Hugener",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/10508401-xtabentum"
}