{
  "title": "The Shame Of The Nation: The Restoration Of Apartheid Schooling In America",
  "description": "\"The nation needs to be confronted with the crime that we're committing and the promises we are betraying. This is a book about betrayal of the young, who have no power to defend themselves. It is not intended to make readers comfortable.\" Over the past several years, Jonathan Kozol has visited nearly 60 public schools. Virtually everywhere, he finds that conditions have grown worse for inner-city children in the 15 years since federal courts began dismantling the landmark ruling in Brown v. Board of Education. First, a state of nearly absolute apartheid now prevails in thousands of our schools. The segregation of black children has reverted to a level that the nation has not seen since 1968. Few of the students in these schools know white children any longer. Second, a protomilitary form of discipline has now emerged, modeled on stick-and-carrot methods of behavioral control traditionally used in prisons but targeted exclusively at black and Hispanic children. And third, as high-stakes testing takes on pathological and punitive dimensions, liberal education in our inner-city schools has been increasingly replaced by culturally barren and robotic methods of instruction that would be rejected out of hand by schools that serve the mainstream of society. Filled with the passionate voices of children and their teachers and some of the most revered and trusted leaders in the black community, \"The Shame of the Nation\" is a triumph of firsthand reporting that pays tribute to those undefeated educators who persist against the odds, but directly challenges the chilling practices now being forced upon our urban systems by the Bush administration. In their place, Kozol offers a humane, dramatic challenge to our nation to fulfill at last the promise made some 50 years ago to all our youngest citizens. From \"The Shame of the Nation\" \"I went to Washington to challenge the soft bigotry of low expectations,\" the president said in his campaign for reelection in September 2004. \"It's working. It's making a difference.\" It is one of those deadly lies, which, by sheer repetition, is at length accepted by large numbers of Americans as, perhaps, a rough approximation of the truth. But it is not the truth, and it is not an innocent misstatement of the facts. It is a devious appeasement of the heartache of the parents of the poor and, if it is not forcefully resisted and denounced, it is going to lead our nation even further in a perilous direction.Also available as a Random House AudioBook and an eBook",
  "genres": [
    "Education",
    "Nonfiction",
    "Race",
    "Politics",
    "Sociology",
    "Teaching",
    "Social Justice"
  ],
  "author": "Jonathan Kozol",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/1508665.The_Shame_Of_The_Nation"
}