{
  "title": "Why Do I Love These People? Honest and Amazing Stories of Real Families",
  "description": "We all have an imaginary definition of a great family. We imagine what it would be like to belong to such a family. No fights over the holidays. No getting on one another’s nerves. Respect for individual identity. Mutual support, without being intrusive. So many people believe they are disqualified from having a better family experience, primarily because they compare their own family with the mythic ideal, and their reality falls short. Is that a fair standard to judge against?”In the pages of Why Do I Love These People?, Po Bronson takes us on an extraordinary journey.It begins on a river in Texas, where a mother gets trapped underwater and has to bargain for her own life and that of her kids.Then, a father and his daughter return to their tiny rice-growing village in China, hoping to rekindle their love for each other inside the walls of his childhood home.Next, a son puts forth a riddle, asking us to understand what his first experience of God has to do with his Mexican American mother.Every step–and every family–on this journey is real.Calling upon his gift for powerful nonfiction narrative and philosophical insight, Bronson explores the incredibly complicated feelings that we have for our families. Each chapter introduces us to two people–a father and his son, a daughter and her mother, a wife and her husband–and we come to know them as intimately as characters in a novel, following the story of their relationship as they struggle resiliently through the kinds of hardships all families endure.Some of the people manage to save their relationship, while others find a better life only after letting the relationship go. From their efforts, the wisdom in this book emerges. We are left feeling emotionally raw but grounded–and better prepared to love, through both hard times and good time.In these twenty mesmerizing stories, we discover what is essential and elemental to all families and, in doing so, slowly abolish the fantasies and fictions we have about those we fight to stay connected to.In Why Do I Love These People?, Bronson shows us that we are united by our yearnings and aspirations: Family is not our dividing line, but our common ground.",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Self Help",
    "Relationships",
    "Book Club",
    "Family",
    "Short Stories"
  ],
  "author": "Po Bronson",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/1508664.Why_Do_I_Love_These_People_Honest_and_Amazing_Stories_of_Real_Families"
}