{
  "title": "The Dominion of War: Empire and Liberty in North America 1500-2000",
  "description": "With the great exceptions of the Revolution, the Civil War, and World War II, Americans seldom think about how military conflict has fundamentally shaped the United States. In The Dominion of War, award-winning historians Fred Anderson and Andrew Cayton offer a startling new perspective on American history. By moving America's forgotten conflicts--its imperial wars--center stage they explain how war, above all else, has been the primary means by which the peoples of North America have defined society for the last half-millennium.In their sweeping narrative, events like the Mexican-American War and the Indian wars, which have long been understood as minor interruptions in the grand arc of American history, emerge as central to the nation's development. Thus the transforming event of the eighteenth century is not the American Revolution but the forty-year-long cycle of imperial warfare and revolution that began with the Seven Years' War. They show how not merely the Civil War, but the War of 1812 and the Mexican-American War provide critical turning points in America's nineteenth-century history. They reveal how the Spanish-American War and its aftermath helped usher in a twentieth century marked by isolationism and ambivalence, until World War II, which saw America's rise to global leadership, and its plunge into the quagmires of Vietnam and Iraq.By focusing on th stories of nine individuals--Samuel de Champlain, George Washington, William Penn, Andrew Jackson, Antonio Lopez de Santa Anna, Ulysses S. Grant, Arthur MacArthur, Douglas MacArthur, and Colin Powell--the authors imbue a vivid human dimension to this compelling history. Recasting familiar triumphs as tragedies, and offering an unconventional set of turning points, The Dominion of War reveals imperialism and republicanism as inseparable influences in the development of American society--a society in which war and freedom have long been intertwined, and one still attempting to define its role in the world at the dawn of the twenty-first century.Description from inside jacket sleeve",
  "genres": [
    "History",
    "War",
    "Nonfiction",
    "Military History",
    "American History",
    "American",
    "Politics"
  ],
  "author": "Fred  Anderson",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/1508754.The_Dominion_of_War"
}