{
  "title": "Developmental Psychology",
  "description": "Why does our memory of our first birthday differ from our memory of our last birthday?What makes children with the same parents have different characters?At what age are children likely to become involved in cyberbullying?Developmental Psychology 1st edition provides a clear and lively coverage of the main topics and concepts required by the British Psychological Society (BPS). The book takes a broadly topical organisation addressing the social and cognitive strands of development, providing an intuitive pathway through the core topics, and a final section which focuses on the clinical and applied aspects of the subjectThe text has been pedagogically developed to encourage the reader to engage with empirical research as well as theory, to make links between different areas of development, and to recognise common themes. Features include:Cutting edge boxes offer insight into research advances, new directions and applications.Lifespan boxes illustrate the ways in which development continues after childhoodNature / nurture interaction boxes explore the issues surrounding this debate highlighting its subtleties and complexityResearch Methods boxes outline and consider established methodologies or present new methodologies, considering its contribution to our understanding of a particular aspect of developmentCase studies provide real descriptions of behaviour bringing more complex and abstract concepts and ideas to life. Throughout the text and at the end of chapters, ‘Stop and think’ and ‘Review’ questions encourage critical reflection of a topic and help students to organise and revise their thinking with respect to coursework and exam requirements. A range of e-learning support materials can be explore at www.pearsoned.co.ukRevise and consolidate your understanding of each chapter by using the Flashcards and Revision questions which provide you with instant feedback. Improve your knowledge and prepare more effectively for lectures and seminars by watching interviews with experts and re-enactments of classic experimentsRachel Gillibrand is a Senior Lecturer in Psychology at the University of the West of England.Virginia Lam is a Senior Lecturer in Psychology at the University of East London.Victoria L. O'Donnell is a psychologist and Senior Lecturer in Higher Education at the University of the West of Scotland",
  "genres": [],
  "author": "Rachel Gillibrand",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/10509177-developmental-psychology"
}