{
  "title": "Trick or Treat: A History of Halloween",
  "description": "Every year, children and adults alike take to the streets dressed as witches, demons, animals, celebrities, and more. They carve pumpkins and play pranks, and the braver ones watch scary movies and go on ghost tours. There are parades, fireworks displays, cornfield mazes, and haunted houses—and, most important, copious amounts of bite-sized candy. The popularity of Halloween has spread around the globe to places as diverse as Russia, China, and Japan, but its association with death and the supernatural and its inevitable commercialization has made it one of our most misunderstood holidays. How did it become what it is today? In Trick or Treat , Halloween aficionado Lisa Morton provides a thorough history of this spooky day. She begins by looking at how holidays like the Celtic Samhain, a Gaelic harvest festival, have blended with the British Guy Fawkes Day and the Catholic All Souls’ Day to produce the modern Halloween, and she explains how the holiday was reborn in America, where costumes and trick-or-treat rituals have become new customs. Morton takes into account the influence of related but independent holidays, especially the Mexican Day of the Dead, as well as the explosion in popularity of haunted attractions and the impact of such events as 9/11 and the economic recession on the celebration today. Trick or Treat also examines the effect Halloween has had on popular culture through the literary works of Washington Irving and Ray Bradbury, films like Halloween and The Nightmare Before Christmas , and television shows such as Buffy the Vampire Slayer and The Simpsons . Considering the holiday in the context of its worldwide popularity for the first time, this book will be a treat for any Halloween lover.",
  "genres": [
    "Nonfiction",
    "History",
    "Halloween",
    "Horror",
    "Folklore",
    "Holiday",
    "Historical"
  ],
  "author": "Lisa Morton",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/15108967-trick-or-treat"
}