{
  "title": "Oak",
  "description": "Botanical, a new series from Reaktion, is the first to integrate horticultural writing with a broader account of the cultural and social impact of plants. Oak , one of the first two books in the series, narrates the biography of the tree that since time immemorial has been a symbol of loyalty, strength, generosity, and renewal. Peter Young explores how the oak, native to the northern hemisphere and found in locations as diverse as the Americas and tropical Asia, has played an important role in state-building, art, folk tales, poems, and songs. Starting with the pagan societies that venerated the oak, Young examines how the tree was used in other religions, revealing how it was believed to be a gateway between worlds in Celtic mythology and later became sacred to Thor in Norse mythology. He follows the oak as it was adopted by many Western European countries as a national symbol, including England, France, and Germany. The United States Congress designated the oak as America’s national tree in 2004, and it is the state tree of Iowa, Connecticut, Illinois, Maryland, New Jersey, and Georgia. Individual oak trees have also gained historical importance, such as the Charter Oak in Hartford, Connecticut, which became a symbol of American independence. In addition to tracing the history of the tree itself, Young investigates oak as a wood used to make furniture, bridges, wine casks, homes, ships, weapons, and even the electric chair, and he describes how the tree has been used as a food source—its fruit, the acorn, was eaten in ancient Greece, ancient Iberia, and Korea, and it was a traditional food of Native Americans. Packed with information and beautiful illustrations, Oak tells the fascinating tale of this stately, durable member of the natural world.",
  "genres": [
    "Nonfiction",
    "Gardening",
    "Nature"
  ],
  "author": "Peter   Young",
  "average_rating": "3.27",
  "url": "https://www.goodreads.com/book/show/15108941-oak"
}