{
  "title": "Just a Boy",
  "description": "\"Gay people don't finish last ... they win!\"High school wrestler Jove Tyler might look like an average guy but he's \"different.\" Instead of falling for Beth Stein, his caring and compassionate \"girlfriend\" at Templeton High, Jove develops a secret crush on his cute classmate Jason Carnivelli, who lives next door혰and is happy to stay in the closet. Just A Boy looks back at a time just short of manhood, filled with first kisses, last chances, and the same question every day: Who will accept me for who I am?From Just A Boy:I had to be honest with myself. I was different than all the other boys at Templeton High School. I wasn't like my friends: Michael and Jason. I was Jove Randall Tyler, and sometimes I found myself looking at Michael or Jason in the wrong manner, a different kind of way. I felt a tingle in my stomach or down in my groin. I became dizzy and confused, almost light-headed ... insanely different.Stop looking at Michael Hennington's biceps, Jove! This is what I screamed inside my mind.Keep your eyes off Jason Carnivelli's butt while he's in his baseball uniform! Shame on you.You figured it out, didn't you? I was different because I liked other guys. I was not different because I was a wrestler on the Templeton Titans Wrestling Team, somewhat a popular kid, somewhat attractive with my ash-colored eyes and slim-muscular build. I wasn't different because Beth Stein considered herself my girlfriend, liking me. Inside, though, I was very different. I was a mess, alone, and really different. I was screwed up. Mental. Just crazy. I was what some of my friends would have called a faggot or queer because I liked the same sex, because I liked to stare at boysinstead of girls, because I was Jove Tyler from 254 Sunnydale Lane in Templeton, Pennsylvania. I was different ... and most of the time I didn't like it.But Jove isn't going to change혰there won't be a single morning he wakes up and likes girls! Just A Boy is a funny and familiar story of that difficult, heartfelt, heartbreaking time between junior high and high school, when a boy is desperate to fit it, without having to pretend to be something혰and someone혰he's not.",
  "genres": [
    "Gay",
    "LGBT"
  ],
  "author": "Rob Clinger",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/1051089.Just_a_Boy"
}