{
  "title": "The Raw Shark Texts",
  "description": "Eric Sanderson is jolted awake one morning to discover that he does not know who he is or where he is. All that he has to cling to is a series of letters and packages—which he is warned not to open—signed “with regret and hope” from the First Eric Sanderson. Attacked in his own home by a force he cannot see and memories he cannot ignore—including those of a perfect love now lost—Eric tears open the parcels and discovers he is being relentlessly pursued by a shark that may exist only in his mind, but which stalks him through the flows and streams of language and human interaction. Hunting the answers as he is hunted, Eric is led on a journey that will either bring the First Eric Sanderson back to life or destroy both Eric Sandersons forever. A daring and unique novel that confronts readers with literary hieroglyphs as well as an intensely original story, The Raw Shark Texts plumbs the depths and dangers of language, the fluidity of memory and the bittersweet ripples of loss. The Ludovician fish is a predator, a shark. It feeds on human memories and the intrinsic sense of self. Ludovicians are solitary, fiercely territorial and methodical hunters. A Ludovician might select an individual human being as its prey animal, and pursue and feed on that individual over the course of years, until that victim’s memory and identity have been completely consumed. Sometimes, the target’s body survives this ordeal and may go on to live a second twilight life after the original self and memories have been taken. In time, such a person may establish a -bolt on’ identity of their own, but the Ludovician will eventually catch the scent of this and return to complete its kill. —from the raw shark texts",
  "genres": [
    "Fiction",
    "Fantasy",
    "Science Fiction",
    "Mystery",
    "Horror",
    "Thriller",
    "Novels"
  ],
  "author": "Steven  Hall",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/1051092.The_Raw_Shark_Texts"
}