{
  "title": "The Forbidden Hills",
  "description": "Gold Glimmers, and the Rush Is On!An expedition led by George Custer in the 1870s confirms that the rumor of gold is true, and now its glimmer beckons from the Black Hills of Dakota Territory. And the rush is on in spite of the threat of war with the Indians. No one seems to desire to strike it rich more than Jim Bannon, a farmer who seeks Alyssa McGuire’s hand in marriage. Her father is the owner of the Bank of Cheyenne and refuses to let her marry below her class. So Jim boldly departs his Wyoming farm in hot pursuit of the wealth that is his ticket to the love of his life. But conflict between miners and Indians heats up, and Jim returns home unsuccessful. How will he ever make Alyssa his bride? book two Dreams of Gold TrilogyWhen gold was discovered out West during the nineteenth century, men rushed from all parts of the globe to stake their claims. Fortunes were made and lost, families uprooted, and a continent shaped by men driven by dreams of gold.(end series header) Gold Discovered in the Black Hills!1875. Jim Bannon is a young farmer, a fine Christian man in love with Alyssa Rose McGuire, the daughter of a wealthy banker in Cheyenne . Her father, Frank, wants her to marry a Christian, of course...but a wealthy Christian. So when the Black Hills of the Dakota Territory (and Sioux country) are opened for gold prospecting, Jim stakes a claim, hoping to strike it rich enough to win Alyssa’s hand with her father’s approval. Thousands of people converge on the Black Hills , seeking gold for everything from medical bills to oil investments. Jim realizes he’s in a mission field among the prospectors—and even the Sioux Indians. But will he ever find enough gold to satisfy Frank McGuire and marry his beloved Alyssa Rose?Story Behind the Book\"We read books on the history of North America and found ourselves captivated with the three big gold rushes in the nineteenth century—the California Gold Rush of 1849, the Dakota Territory Black Hills Gold Rush of 1874, and the Yukon Gold Rush in Canada of 1896. Some gold seekers embraced success, delight, and happiness, but others faced failure, tragedy, and sorrow. In the Dreams of Gold series, we captivate our readers’ imaginations, as well as touch their hearts with both types of results in the gold seekers’ experiences—good and bad.\" —Al and JoAnna Lacy",
  "genres": [
    "Historical Fiction",
    "Christian Fiction"
  ],
  "author": "Al Lacy",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/1512478.The_Forbidden_Hills"
}