{
  "title": "Feminism without Borders: Decolonizing Theory, Practicing Solidarity",
  "description": "Bringing together classic and new writings of the trailblazing feminist theorist Chandra Talpade Mohanty, Feminism without Borders addresses some of the most pressing and complex issues facing contemporary feminism.Forging vital links between daily life and collective action and between theory and pedagogy, Mohanty has been at the vanguard of Third World and international feminist thought and activism for nearly two decades. This collection highlights the concerns running throughout her pioneering work: the politics of difference and solidarity, decolonizing and democratizing feminist practice, the crossing of borders, and the relation of feminist knowledge and scholarship to organizing and social movements. Mohanty offers here a sustained critique of globalization and urges a reorientation of transnational feminist practice toward anticapitalist struggles.Feminism without Borders opens with Mohanty's influential critique of western feminism (\"Under Western Eyes\") and closes with a reconsideration of that piece based on her latest thinking regarding the ways that gender matters in the racial, class, and national formations of globalization. In between these essays, Mohanty meditates on the lives of women workers at different ends of the global assembly line (in India, the United Kingdom, and the United States); feminist writing on experience, identity, and community; dominant conceptions of multiculturalism and citizenship; and the corporatization of the North American academy. She considers the evolution of interdisciplinary programs like Women's Studies and Race and Ethnic Studies; pedagogies of accommodation and dissent; and transnational women's movements for grassroots ecological solutions and consumer, health, and reproductive rights.Mohanty's probing and provocative analyses of key concepts in feminist thought—\"home,\" \"sisterhood,\" \"experience,\" \"community\"—lead the way toward a feminism without borders, a feminism fully engaged with the realities of a transnational world.",
  "genres": [
    "Feminism",
    "Nonfiction",
    "Gender",
    "Social Justice",
    "Race",
    "Politics",
    "Gender Studies"
  ],
  "author": "Chandra Talpade Mohanty",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/151266.Feminism_without_Borders"
}