{
  "title": "Soul Unsung: Reflections on the Band in Black Popular Music",
  "description": "Soul music has specific sounds. Soul as it appears in the term 'Soul jazz' has a vastly different sound to soul as it appears in the term 'Nu Classic Soul' yet there are links between the two. The socio-cultural connotations of the two 'souls' are also vastly different as one would expect given the fact that they pertain to eras that are separated by some four decades. What happened to soul in that time and space? This book describes the sound of soul in an evocative and as incisive a way by analyzing the real nuts and bolts that have been used to construct the music - songform, vocal techniques, instruments, machines and production methods. The overriding interest of the book is not just standard soul but strange soul as performed by Sly Stone, Me Shell N'dgeocello, Bootsy Collins and Bilal Oliver. It also looks at the lack of clear demarcation between strange and standard soul within the work of the same artist. Marvin Gaye started with standard soul and became strange, as did Stevie Wonder. As for Omar's There's Nothing Like This, it is a piece of standard soul, a flimsy one at that, whereas Omar's Best By Far is a piece of prime strange soul, a performance that could only have come from a Briton of Jamaican descent. Some soul artists are standard and strange on the same album. The tension between the two states of tradition and innovation is fascinatingly put under the microscope and has a wider resonance in one of soul's musical jazz. The book is not just about music though. The notion of soul, the mythology of it, the ideal of it, has a very wide range of connotations. Le Gendre looks at culture, lifestyle, dress sense, cooking and attitudes to really get a handle on what soul is and how strange some strange souls - we're talking pill-popping, gun-toting, S&M loving, codpiece sporting, lampshade wearing brothers and sisters - have been.",
  "genres": [],
  "author": "Kevin Le Gendre",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/15129391-soul-unsung"
}