{
  "title": "The Body Has a Mind of Its Own: How Body Maps in Your Brain Help You Do (Almost) Everything Better",
  "description": "In this compelling, cutting-edge book, two generations of science writers explore the exciting science of “body maps” in the brain–and how startling new discoveries about the mind-body connection can change and improve our lives. Why do you still feel fat after losing weight? What makes video games so addictive? How can “practicing” your favorite sport in your imagination improve your game? The answers can be found in body maps.Just as road maps represent interconnections across the landscape, your many body maps represent all aspects of your bodily self, inside and out. In concert, they create your physical and emotional awareness and your sense of being a whole, feeling self in a larger social world.Moreover, your body maps are profoundly elastic. Your self doesn’t begin and end with your physical body but extends into the space around you. This space morphs every time you put on or take off clothes, ride a bike, or wield a tool. When you drive a car, your personal body space grows to envelop it. When you play a video game, your body maps automatically track and emulate the actions of your character onscreen. When you watch a scary movie, your body maps put dread in your stomach and send chills down your spine. If your body maps fall out of sync, you may have an out-of-body experience or see auras around other people.The Body Has a Mind of Its Own explains how you can tap into the power of body maps to do almost anything better–whether it is playing tennis, strumming a guitar, riding a horse, dancing a waltz, empathizing with a friend, raising children, or coping with stress.The story of body maps goes even further, providing a fresh look at the causes of anorexia, bulimia, obsessive plastic surgery, and the notorious golfer’s curse “the yips.” It lends insights into culture, language, music, parenting, emotions, chronic pain, and more.Filled with illustrations, wonderful anecdotes, and even parlor tricks that you can use to reconfigure your body sense, The Body Has a Mind of Its Own will change the way you think–about the way you think.“The Blakeslees have taken the latest and most exciting finds from brain research and have made them accessible. This is how science writing should always be.”–Michael S. Gazzaniga, Ph.D., author of The Ethical Brain“Through a stream of fascinating and entertaining examples, Sandra Blakeslee and Matthew Blakeslee illustrate how our perception of ourselves, and indeed the world, is not fixed but is surprisingly fluid and easily modified. They have created the best book ever written about how our sense of ‘self’ emerges from the motley collection of neurons we call the brain.”–Jeff Hawkins, co-author of On Intelligence“The Blakeslees have taken the latest and most exciting finds from brain research and have made them accessible. This is how science writing should always be.”–Michael S. Gazzaniga, Ph.D., author of The Ethical Brain“A marvelous book. In the last ten years there has been a paradigm shift in understanding the brain and how its various specialized regions respond to environmental challenges. In addition to providing a brilliant overview of recent revolutionary discoveries on body image and brain plasticity, the book is sprinkled with numerous insights.”–V. S. Ramachandran, M.D., director, Center for Brain and Cognition, University of California, San Diego",
  "genres": [
    "Nonfiction",
    "Science",
    "Psychology",
    "Neuroscience",
    "Brain",
    "Health",
    "Audiobook"
  ],
  "author": "Sandra Blakeslee",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/151297.The_Body_Has_a_Mind_of_Its_Own"
}