{
  "title": "James Brown",
  "description": "Foregrounding the funk style \"invented\" by legendary musician James Brown, this study concerns itself with how the experience of time in popular music is reflective of broader social, political or, more simply, existential, conditions. In short, how James Brown's funk might be understood as the musical expression of a particular negotiation of time by a \"minor\" culture, (where this notion of a \"minor\" culture is derived from the work of the philosophers Deleuze and Guattari). That funk would emerge in the mid-1960s, at the very apex of the civil-rights movement, was surely no coincidence, and the book details how Brown's music would render musical the broader existential changes taking place within the African-American community at a crucial political time. This journey through funk's mode of constitution is informed by the philosophical concerns of Gilles Deleuze's Cinema books, which provide a set of conceptual tools that illustrate how Brown's music would impel popular music's compositional shift from a teleological depiction of movement through time (the \"movement-image\") to funk's more direct experience of the temporal (the \"time-image\"). The assassination of Dr. Martin Luther King, and the \"post-soul\" climate that transpired, are used as supporting evidence of how funk's relative temporal indeterminacy begins to take precedence over the more teleological \"soul\" narratives which preceded them. Based on this evidence, it is argued that Brown's music demonstrates a most compelling example of how popular music's temporal mode of constitution might reflect, aesthetically, the broader political and existential circumstances of its emergence, and how this affective relationship to composition made Brown one of the greatest musical innovators of the twentieth century.",
  "genres": [],
  "author": "John Scannell",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/15129546-james-brown"
}