{
  "title": "Global Tribe: Technology, Spirituality and Psytrance",
  "description": "Trance events have an uncanny ability to capture an era, and captivate an audience of travellers occupying the eternal theatre of the dance floor. As this book shows, the tendency within psytrance is to thwart the passage of time, to prolong the night, for those who adopt a liminal lifestyle. Amid the hustle and hubris of the psytrance carnival there is a peaceful repose that you sometimes catch when you've drifted into a sea of outstretched limbs, bodies swaying like a field of sunflowers in a light breeze. And you feel intense joy in this fleeting moment. You are the moment. You are inside the flow. You are all. Embodying the poetry of dance, you are living evidence that nothing lasts. And this is a deep revelation of the mystical function of trance. It is difficult to emerge from this little death, because one does not want the party to end. But it must end, even so that it can recommence-so that one can return to repeat the cycle. The result of fifteen years of research in over a dozen countries, this book applies a sharp lens on a little understood global dance culture that has mushroomed all over the world since its beginnings in the diverse psychedelic music scenes flourishing in Goa in the 1970s and 1980s. The paramount expression of this movement has been the festival, from small parties to major international events such as Portugal's Boom Festival, which promotes itself as a world-summit of visionary arts and trance, a \"united tribe of the world.\" Via first-hand accounts of the scenes, events and music of psychedelic trance in Australia, Israel, Germany, Italy, the UK, the US, Turkey and other places, the book thoroughly documents this transnational movement with its diverse aesthetic roots, multiple national translations and internal controversies. As a multi-sited ethnography and an examination of the digital, chemical, cyber and media assemblage constituting psytrance, the book explores the integrated role that technology and spirituality have played in the formation of this visionary arts movement and shows how these event-cultures accommodate rites of risk and consciousness, a complex circumstance demanding revision of existing approaches to ritual, music and culture.'From the esoteric traveler jams of Goa to the liminal zones of Boom and Burning Man, Graham St John guides us through the cosmic carnival of global psytrance with an intoxicating blend of deep research, empathic ethnography, and edge-dancing cultural analysis. This is the definitive book on what has become, from the perspective of planetary spiritual culture, the most resonant music scene of our transhuman century.' --Erik Davis, author of The Visionary State and Nomad Codes: Adventures in Modern Esoterica '",
  "genres": [
    "Music"
  ],
  "author": "Graham St. John",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/15129640-global-tribe"
}