{
  "title": "Fortunes of War",
  "description": "War looms on the horizon for the kingdoms of Aeretoll and Aquitainia, a war they’ll fight together, as the allies begin to plan their cooperative marches through missives sent via falcon. But in Aeres, Náli arrives with news of the he’s met the emperor of Seles, Romanus Tyrsbane, beyond the veil in the Between, and the emperor, it seems, is searching for Oliver. With Náli’s help, the three Drakes must now learn how to go walking between worlds, guarding their minds and their magic from an enemy who can reach out and touch them from afar.Restless in a way he’s never been before, confused by his anger and his new instincts, Leif takes his wolfpack and departs early, traveling quickly and in secret toward the Southern camp in Inglewood. At his side, urging him to let his wolf take charge, is Ragnar. Cousin, war prize, thrall, wearing Leif’s torq, and testing all of Leif’s patience. He knows it’s foolish to trust him, but Leif cleaves to him regardless, distrustful and resentful of everyone who cannot understand the man – the wolf – he’s become.Leading a ragged army of Southerners and woodland outlaws, Amelia spends her days planning their next move, and her nights walking in a world of dreams, visited by a pair of wolves with blue eyes and an irresistible allure. A letter from Oliver forewarned of Leif’s arrival, but nothing could have prepared her for the way her first glimpse of the prince rattles her to the bone.For Oliver, the long march South is full of sword lessons, saddle sores – and clandestine meetings in the Between with the emperor himself. He’s only spying, he reasons, and he can stop anytime he wishes…can’t he?Fortunes of War is the fifth installment of the ongoing high fantasy Drake Chronicles series, which is intended for adult audiences. It is not a standalone, and the series must be read in order. Dragons, shapeshifters, family drama, and romance abound as our heroes march toward a terrifying enemy, at the mercy of the fortunes of war.",
  "genres": [
    "Fantasy",
    "M M Romance",
    "Dragons",
    "Paranormal",
    "Shapeshifters",
    "Romance",
    "Magic"
  ],
  "author": "Lauren Gilley",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/151334689-fortunes-of-war"
}