{
  "title": "Friend & Foe",
  "description": "PRAISE FOR SHIRLEY McKAY ‘Intoxicating mix of dramatic crime and repressed passion’ – New Books ‘A gripping mystery that holds the reader to the very last page, and a marvellous portrait of St Andrews in the sixteenth century’ – John Burnside St Andrews. 1583, and tensions are running high. Dissension rages between King and councillors, and between the separate factions of the Kirk. At St Mary’s college, the reformer Andrew Melville is unsettled by a series of unnatural events, while the ailing Archbishop Patrick Adamson plays out his darkest fantasies, in the safe seclusion of the castle vaults. Hew is called to investigate a mysterious incident and finds suspicion falling upon him as he is ensnared in a world of superstition, subterfuge and death. This new Hew Cullan story sees the academic lawyer once again in the company of his sister Meg and her husband, physician Giles Locke, in their most challenging case yet. Alliances are formed; there are old scores to be settled; old ghosts reappear and spies are abroad. The king’s escape from captivity throws all in confusion, and as Hew’s loves and loyalties are put to the test, his own life and future are no longer secure. Friend & Foe is the fourth Hew Cullan mystery by Shirley McKay. Hue & Cry, Fate & Fortune and Time & Tide are also available from Polygon.Review“Intoxicating mix of dramatic crime and repressed passion.” —New Books“A gripping mystery that holds the reader to the very last page, and a marvelous portrait of St. Andrews in the 16th century.” —John Burnside, poet and author, Black Cat BoneAbout the AuthorShirley McKay is a freelance proofreader and is the author of The Wee Book of Fife and the Hew Cullan mysteries. In that series, Hue & Cry was short-listed for the CWA Debut Dagger. She currently works as a freelance proofreader.",
  "genres": [
    "Historical Fiction",
    "Mystery",
    "Scotland",
    "Fiction",
    "Crime",
    "Historical Mystery",
    "Historical"
  ],
  "author": "Shirley Mckay",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/15134292-friend-foe"
}