{
  "title": "The Weight Of Night",
  "description": "When her mother is taken from her in a terrible accident, 18-year-old Alexis finds herself facing some previously unknown truths. Her best friend, Keats, is her only confidante when she is faced with an apparent stalker who claims that Alexis’ entire life is built around a lie. Keats keeps the leap-before-you-look Alexis grounded as they are suddenly thrown into a whirlwind world of danger and secret agendas and the viciously deceitful lives of demigods and ancient Greek deities.When a conniving, self-righteous god decides that Alexis is his best hope for retrieving a powerful artifact, she finds herself on the self-discovery journey of a lifetime - tracking a killer and a kidnapper - and facing twisted and dangerous foes along the way.With lives in the balance, Alexis will have to come to grips with who she truly is and just what she might be capable of. Growing more and more dangerous herself, she will have to try and survive long enough to save the one person in the world for whom she cares most.The Special Edition of The Weight Of Night also includes:Trinkets And Arrows - Life is not simple for Lily Abrams, a seventeen year old thief living in Encino. When her reputation derails her living arrangements, she knows what she has to do. She takes a job to steal a bag of rare coins from a suburban home, unaware of the danger lying within. Secrets as old as Ancient Greece are kept hidden in the middle of Los Angeles. After Lily crosses the wrong man, stealing his prized belongings, she makes a deadly enemy and pays the price. Rescued from death by none other than the actual Greek god, Apollo, Lily is manipulated into making an unbreakable deal with a god. He will teach her everything she needs to know about who she is, and what she is capable of; but, first, she must face a vengeful enemy.Soldier Boy - In St. Anne’s Care Facility, in upstate New York, a son of the Greek God of War tells the story of his one true love to a girl who cannot even remember his name.Aaron Richardson has just been released from the army when, at the train station in New York, he literally runs into Rose, a 15 year old girl with a sharp tongue and an even sharper mind. It is immediately evident that he has met his match. In learning who they are to each other, Aaron and Rose face emotional turmoil and terrible tragedy. In the end, the tale is told and the truth will be revealed. Can love truly conquer all?",
  "genres": [
    "Fantasy",
    "Young Adult"
  ],
  "author": "C.L. Stegall",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/15136209-the-weight-of-night"
}