{
  "title": "Havana Bay",
  "description": "The body, at least what was left of it, was drifting in Havana Bay the morning Arkady arrived from Moscow. Only the day before, he had received an urgent message from the Russian embassy in Havana that his friend Pribluda was missing and asking that he come.The Cubans insisted that this corpse floating in an inner tube was Pribluda, but Arkady wasn't so sure.\"You don't investigate assault, you don't investigate murder. Just what do you investigate?\" Arkady asks Ofelia Osorio, a detective in the Policia Nacional de la Revolucion. \"Or is it simply open season on Russians in Havana?\"The comrades of the Cold War have parted bitterly, and the Russians who used to swarm through Havana's streets are now as rare as they are despised, much more so than Americans.Havana is overrun with color, music, and suspicion. The Revolution's heroes have outlived idealism. The Com-munist world has shrunk to Cuba. Paradise has become a stop on sex tours. It is a city of empty stores and talking drums, Karl Marx and sharp machetes, where an American radical rides around in Hemingway's car to tout island investments and a Wall Street developer on the run from the FBI flies a pirate flag.\"A dead Russian, a live Russian,\" Ofelia says. \"What's the difference?\" But the dead Russian is followed by the murders of a Cuban boxer and a prostitute. Although none of them is supposed to be investigated, Arkady cannot be stopped. He speaks no Spanish, knows nothing about Cuba, and, as a Russian, is a pariah. However, there is something about this faded, lovely, dangerous city--the rhythms of waves against the seawall, the insinuation of music always in the air, and, finally, Ofelia herself--that plunges Arkady back into life.\"What ultimately sets the Renko books apart is the careful writing, and, more important, the knowledge of the human heart that is carried through it, through them, first to last.\"–Chicago Tribune",
  "genres": [
    "Fiction",
    "Mystery",
    "Thriller",
    "Crime",
    "Russia",
    "Mystery Thriller",
    "Detective"
  ],
  "author": "Martin Cruz Smith",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/151353.Havana_Bay"
}