{
  "title": "Unlikely Brothers",
  "description": "“You don’t look like brothers . . .”Peace activist and cofounder of the Enough Project, John Prendergast is known as a champion of human rights in Africa. But the not-so-public face of J.P. is the life he’s led as a Big Brother to Michael Mattocks. As a curious, driven, and emotionally wounded twenty-year-old, J.P. made the life-changing decision to form a “Big Brother/Little Brother” relationship with then seven-year-old Michael, who was living out of plastic bags and drifting from one homeless shelter to the next with his mother and siblings. Lacking a connection with his own brother and distancing himself from a disastrous relationship with his father, J.P. formed a unique bond with Michael the moment they met. Michael and J.P. became like family, with Michael and some of his siblings even living with J.P. one summer. In the years that followed, J.P. took Michael and his brothers on outings, whether it was fishing, playing basketball, patronizing cheap restaurants, or going on road trips. This friendship would continue for over twenty-five years as the two coped with varying degrees of violence, instability, and trauma in their own lives.  Told in duet, Unlikely Brothers follows Michael as he grows up on the tough streets of Washington, D.C., where as a young teenager he watched his best friend get shot, dropped out of school, and started dealing crack cocaine shortly thereafter. By sixteen, Michael had become the kingpin of his neighborhood, guns and drugs always close at hand. Meanwhile, J.P. was traveling to and from African war zones. J.P. offered Michael a refuge from the streets, never really confronting the gravity of what Michael was going through in his adolescence. In turn, Michael afforded J.P. an escape from his own turbulent personal and professional life.As the years go by, the two swoop in and out of each other’s lives, slowly disconnecting as they disappear into their respective worlds, but making their way back to each other at a critical moment for both of them. The effect the two have on each other is extremely significant to both of their paths to redemption.Inspirational and deeply moving, Unlikely Brothers beautifully showcases how life’s most random moments can often be the most profound.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography"
  ],
  "author": "John Prendergast",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/10512527-unlikely-brothers"
}