{
  "title": "The Gift",
  "description": "For most of his life, Vladimir Nabokov was quite literally a man without a country. It's a small irony, then, that his career falls so neatly into national phases: Russian, German, French, and American, plus the protracted coda he spend in a Swiss luxury hotel during his final decade. The Gift, which he wrote between 1935 and 1937 in Berlin, is the grand summation of his second phase. It describes, for starters, the sentimental education of a young Russian writer, Fyodor Godunov-Cherdyntsev. This hyphenated creation has more than a few things in common with the author, despite Nabokov's vehement denial in the novel's foreword. Still, only a nitwit would read The Gift for its autobiographical revelations. What this early masterpiece does offer is a wealth of lyrical, witty, heartbreaking prose, beautifully translated from the Russian by Michael Scammell (with an assist from Nabokov himself). Who else would note the way a street rises \"at a barely perceptible angle, beginning with a post office and ending with a church, like an epistolary novel\"? Who else has ever administered the satirical shiv to his characters with such deadly, almost affectionate aplomb? Shirin himself was a thickset man with a reddish crew cut, always badly shaved and wearing large spectacles behind which, as in two aquariums, swam two tiny, transparent eyes--which were completely impervious to visual impressions. He was blind like Milton, deaf like Beethoven, and a blockhead to boot. Of course, only a fraction of The Gift is taken up with this sort of demolition derby. Fyodor's romance with Zina, for example, occasions the most ardent prose of Nabokov's career: \"And not only was Zina cleverly and elegantly made to measure for him by a very painstaking fate, but both of them, forming a single shadow, were made to the measure of something not quite comprehensible, but wonderful and benevolent and continuously surrounding them.\" (Shades of Volodya and Véra? Only the deceased husband and wife, and perhaps Stacy Schiff, know for sure.) At the same time, The Gift is a brilliant, mesmerizing riff on the history of Russian literature, with elaborate bouquets tossed to Pushkin and Gogol. There's also a hilarious yet somehow tender evisceration of the do-gooding polemicist Nikolai Chernyshevski--which was suppressed, in fact, when the novel was originally serialized by a Russian émigré magazine. As should be clear by now, The Gift defies any attempt at quick-and-dirty summary. But the book plays the most pleasurable kind of havoc with our stuffy notions of narrative structure and linguistic protocol. And as Nabokov repeatedly wraps the reader's consciousness around his little finger, he never holds back on that ultimate literary gift: pleasure. --James Marcus",
  "genres": [
    "Fiction",
    "Russia",
    "Classics",
    "Russian Literature",
    "Literature",
    "Novels",
    "20th Century"
  ],
  "author": "Vladimir Nabokov",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/1514309.The_Gift"
}