{
  "title": "The Practice and Science of Drawing",
  "description": "Much of the learning to practice as well as to appreciate art is concerned with understanding the basic principles. One of these principles is what Harold Speed calls \"dither,\" the freedom that allows realism and the artistic vision to play against each other. Very important to any artist or work of art, this quality separates the scientifically accurate from the artistically accurate. Speed's approach to this problem is now considered a classic, one of the few books from the early years of this century that has continued to be read and recommended by those in the graphic arts.In this work, Harold Speed approaches this dynamic aspect of drawing and painting from many different points of view. He plays the historical against the scientific, theory against precise artistic definition. He begins with a study of line drawing and mass drawing, the two basic approaches the artist needs to learn. Further sections carry the artistic vision through unity and variety of line and mass, balance, proportion, portrait drawing, the visual memory, materials, and procedures. Throughout, Speed combines historical backgrounds, dynamic aspects which each technique brings to a work of art, and specific exercises through which the young draughtsman may begin his training. Although not a technique book in the strict sense of the terms, The Practice and Science of Drawing brings to the beginner a clear statement of the principles that he will have to develop and their importance in creating a work of art. Ninety-three plates and diagrams, masterfully selected, reinforce Speed's always clear presentation.Harold Speed, master of the art of drawing and brilliant teacher, has long been cited for this important work. For the beginner, Speed will develop a sense for the many different aspects which go into an artistic education. For the person who enjoys looking at drawings and paintings, Speed will aid developing the ability to see a work of art as the artist meant it to be seen.",
  "genres": [
    "Art",
    "Drawing",
    "Nonfiction",
    "Reference",
    "Classics",
    "Art History",
    "Art Design"
  ],
  "author": "Harold Speed",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/1514213.The_Practice_and_Science_of_Drawing"
}