{
  "title": "The Catalyst",
  "description": "If you like Buffy the Vampire Slayer or the Twilight series, you’ll love Zoe Winters’ paranormal romance series.Gothic romance bestseller.The Catalyst: The Preternaturals, Book 3Kidnapping is not an appropriate way to acquire a babysitter. Ah, screw it. Desperate times...Panthers don’t do responsibility. They don’t do long-term relationships. They definitely don’t raise kids. But when Z discovers a young werewolf in the forest, he takes him in, unaware of the powerful beings hunting the pup. Plus the little furball is driving him insane.Fiona is a witch who can’t leave her house; the birds have told her something bad will happen. The mailbox is as far as she’ll go, but even that may provide more danger than she’s bargained for. When a wolf pup stumbles into her garden, her safe, wrapped-up world heads for a free fall, especially when a sexy panther shifter kidnaps her to his cave to help him look after the pup.AUTHOR’S NOTE: The Catalyst is an ensemble book that also features Jane and Cole (from Blood Lust) and Cain (from Blood Lust and Save My Soul)Zoe Winters’ Paranormal Romance and Urban Fantasy Series: The PreternaturalsEnter a world of dark desire and dark magic where today’s hero is tomorrow’s villain... or vice versa. Unleashed passions between unlikely lovers rage against the backdrop of a world of conflict and infighting among the secret factions of the preternatural underworld.Are you the villain if you’ve got good reasons? Are you the hero just because we’re rooting for you? Tormented alphas, charismatic and ruthless leaders, and the women torn and trapped between them, forced into situations they never should have had to face.Amidst a world of ignorant humans, the demons (true immortals), vampires, and therians (shapeshifters) fight to keep their territories. The only humans aware of this world are the magic users: witches, wizards, and sorcerers who enjoy the ability to mix with the humans or the monsters depending on what suits their current purposes.If the preternatural world is discovered and war breaks out, the humans have a chance... IF the magic users choose to cast their fate with their own kind. Magic combined with technology would even the playing field more than the monsters are comfortable with.Dark lovers you’ll meet in this series:Cain: He’s an incubus dream boat, physically, but it’s nearly impossible to keep up with his body count. Any woman who comes to his bed is likely never to leave... at least not alive. But what happens when he meets a woman with a true death wish, the one meal he discovers he doesn’t want to kill?Anthony: The vampire king. Cold, ruthless, undead, and hard to like. Yet, all it takes is one human with amnesia, to soften his heart. More than anything, he wants to return to a time when Charlotte saw him for the man he is, instead of the monster she’s discovered. Ever since being bitten, she hasn’t been the same. It soon becomes clear that the only way to protect a fragile human is if she’s claimed. Meanwhile, his deepest wish is to have his lover awakened from the memory loss that took everything... not just the memories he meant to erase.Cole: Alpha of one of the strongest werewolf packs in North America. His moral compass goes askew when he finds the woman fated to be his, and he can’t resist kidnapping her. With the life of abuse she’s suffered at the hands of the vampires, it might be a welcome rescue. But the werewolves have a worse reputation than the vampires, a fact that doesn’t inspire much trust. Not your classic sweet werewolf love story. But being an alpha’s mate brings with it a safety and security Jane has never known.If you like Zoe Winters you may also enjoy H.P. Mallory, Larissa Ione, and J.R. Ward.Books in the Preternaturals Series:Blood Lust (book 1) (Kept, Claimed, Mated)Save My Soul (book 2)The Catalyst (book 3)Life Cycle (book 4)Shorts:Cat FightDark Mercy",
  "genres": [
    "Shapeshifters",
    "Demons",
    "Fantasy",
    "Magic",
    "Urban Fantasy"
  ],
  "author": "Zoe Winters",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/15156124-the-catalyst"
}