{
  "title": "Physics and Philosophy",
  "description": "Can we have any knowledge of the world outside us other than we gain by the methods of science? Are we humans endowed with free will, or are we mere cogs in a vast machine that must follow its predestined course until it finally runs down? Is the world we perceive the world of ultimate reality, or is it only a curtain veiling a deeper reality beyond?In this strikingly, lucid and often poetic book, one of the 20th century's greatest scientists grapples with these age-old questions, achieving in the process a brilliant non-technical exposition by defining physics and philosophy, pointing out the differences in their respective attempts to explain physical reality and man's place in it. This discussion paves the way for an outline of epistemological methods in which the rationalism of thinkers like Descartes, Leibniz and Kant is compared to the empiricism of Locke and Hume.Over the course of the book, in a manner that is careful and methodic but never dull, Jeans marshals the evidence for his startling conclusion: recent discoveries in astronomy, mathematics, sub-atomic physics and other disciplines have washed away the scientific basis of many older philosophic discussions. Such long-standing problems as causality, free will and determinism, the nature of space and time, materialism and mentalism must be considered anew int he light of new knowledge and information attained by 20th-century physical science. Even then, however, Jeans cautions against drawing any positive conclusions, pointing out that both physics and philosophy are both relatively young and that we are still, in Newton's words, like children playing with pebbles on the sea-shore, while the great ocean of truth rolls, unexplored, beyond our reach.Although first published nearly 40 years ago, nothing in physics has happened to affect Jean's account in this book; it remains remarkably fresh and undated, a classic exposition of the philosophical implications of scientific knowledge.",
  "genres": [
    "Philosophy",
    "Science",
    "Physics",
    "Nonfiction"
  ],
  "author": "James Hopwood Jeans",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/1516725.Physics_and_Philosophy"
}