{
  "title": "White Niggers of America",
  "description": "White Niggers of America: The Precocious Autobiography of a Quebec \"Terrorist\" is a work of non-fiction literature written by Pierre Vallières, a leader of the Front de libération du Québec . It was translated by Joan Pinkham from the original 1968 French language edition titled Nègres blancs d'Amérique, autobiographie précoce d'un « terroriste » québécois. The translation was published by McClelland and Stewart in 1971 (ISBN 0-7710-8670-9). The translated title uses the word \"nigger\" as an accurate translation of the equally offensive French word \"nègre\".White Niggers of America chronicles the history of the French colonists of North America, first in the New France colonial empire, and then in British North America. A book about exploitation, author Vallières compares to some extent the plight of these immigrants to that of blacks in the American South, arguing that both groups were forcibly imported to the New World and subsequently exploited by aristocrat capitalists.Vallières wrote the book while serving a four year prison sentence for manslaughter in the Manhattan House of Detention for Men in New York City. He was later acquitted in a second trial in 1970.The book is a class analysis of French Canadian settlement and social, political, and economic life in Canada since arrival. Vallières argues that French Canadians have been kept in a position of exploited workers by the English upper class entrepreneurs. He draws parallels between the social and economic position of French Canadians and slaves in the United States, hoping to show that both cultural groups have been brought to the continent to serve as the lower, under, and working class for a common oppressor.Vallières attempts to use the term “nigger” not solely as a cultural or racial indicator, but as a concept encompassing social class and power. In drawing these comparisons, he states that the liberation movements of Black people in America have provided inspiration for French Canadians. While it is clear that Vallières has deliberately transformed a racial term into one of social indicator, he fails to demonstrate that the French in Canada are viewed by the English as inherently inferior based on their culture. Rather, what is shown in the book is that French Canadians have historically occupied a particular social position as a result of political, economic, and military factors, not specifically racial ones.Vallières's book is rife with historical omissions and socio-political misrepresentations. He postulates that the French were imported to Canada for the deliberate purpose of economic exploitation, but makes no acknowledgement of French settlement and oppression of Aboriginal peoples in Canada. In appropriating a racial term and attempting to apply it to another cultural group, not only does Vallières minimize the conditions of Black people in America, but he develops a misleading analogy to explain the conditions of French Canadians.The term \"nigger\" reflects a particular historical experience that one finds difficult and unconvincing to apply to French Canadians, following Vallières's logic. Vallières attempts to provide a historical depiction of one group's oppression by evoking the history of Black populations brought to America, a comparison that is essentialist and insensitive.The book also serves as Vallières's “call to arms” for the exploited masses of French Canadians. He describes the development of a class consciousness among French Canadians through which they become cognizant of their position as oppressed, and Vallières advocates for an armed uprising. Vallières traces the development of his own intellectual and class consciousness, citing the policies and actions of Maurice Duplessis as contributing to his own social unrest. He discusses the asbestos and Murdochville mine strikes as particular instances contributing to his own sense of awareness of the injustice in Quebec.",
  "genres": [
    "History",
    "Politics",
    "Canada",
    "Banned Books",
    "Nonfiction",
    "Essays",
    "Canadian Literature"
  ],
  "author": "Pierre Vallières",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/1518400.White_Niggers_of_America"
}