{
  "title": "Dancing Dragon",
  "description": "'I'm supposed to be the one that calls him back toward the Light. I am the Light to your Dark. You call to me as I call to you. I will always hold you dear. But, it was getting harder. I loved him and it's not as if I never knew it would be difficult loving a vampire. I just never knew the degree of difficulty it would entail.'Michel battles his rising Dark, all but losing his Light within. His line falters, his life is in turmoil and Lucinda is ultimately shut out. Without his kindred to draw him back to the Light, just how Dark will Michel become? And can Lucinda survive without him in her life? To bring him back towards the Light they both must face harsh truths and their deepest secrets and desires. But a vampire's number one rule is survive at all costs. Just what will Michel do to survive and how will it affect Lucinda?An ancient vampire appears in London feasting on innocents with abandon. Lucinda's role as the Sanguis Vitam Cupitor calls her to the streets of Knightsbridge and into the grasp of this powerful and hungry Dark predator. Calling on all her reserves she is barely able to survive with her life, but fails to save those humans he blithely kills. Guilt wages with fear as she realises this is not a one-time event and attempts to discover the meaning behind his appearance and Dark hunger which cannot be assuaged.In the shadows left by the Dark vampire lurks a strange new threat. Dressed in the guise of a mischievous, gorgeous and compelling young man who catches Lucinda in a spell which could not possibly be of this Earth. It's not just his beauty that traps Lucinda though, it's the fact that he has Light. A Light so similar to her own that she is drawn to it, can't stop herself reaching for it. But she ultimately knows, to touch it could prove her downfall. But, can she resist?The world is turning Darker, greater threats than vampires are about to appear and Lucinda is the key. Try as she might, without her kindred by her side her chances of success are dimmed. For together they are stronger, apart they grow weaker. And there are always those on the sidelines who are willing to take advantage of the weak. They are vampyre, it is in their nature to hunt prey and Lucinda is the ultimate game for the predator within.",
  "genres": [
    "Vampires",
    "Paranormal",
    "Urban Fantasy",
    "Romance",
    "Fantasy",
    "Fae",
    "Adult"
  ],
  "author": "Nicola Claire",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/15183582-dancing-dragon"
}