{
  "title": "Black President: The Art and Legacy of Fela Anikulapo-Kuti",
  "description": "Crowned the king of Afrobeat and dubbed the Black President, Fela Anikulapo-Kuti was a master performer, composer and voice of the oppressed. The Nigerian musician and activist invented an infectious new musical genre called Afrobeat, combining American funk and jazz with traditional Yoruba and highlife music to end up with a sound that doubled as a weapon for justice. Troubled by the state of Nigerian society, he assembled and built his Kalakuta Republic and created his own political party, actions which saw him arrested, imprisoned and beaten by the police and military--but Fela was so influential in Nigerian cultural and political life that even they flocked to his funeral to pay respect to their fallen hero. This book features a diverse range of artists who continue to be inspired by Fela's artistic genius and dedication to justice and equality: from visual practitioners like Sanford Biggers, Sokari Douglas Camp, Kendell Geers, Alfredo Jaar, Moshekwa Langa, Olu Oguibe, Yinka Shonibare and Kara Walker to musicians, rappers and DJs. Accompanying essays consider Fela's influence on his musical contemporaries and on an international array of visual artists, Fela as African Blaxploitation hero, and Fela's music in the context of the Nigerian political situation and contemporary activist art. Also included are an updated version of a seminal 1980s article on Fela, a fiction-driven story that reconstructs the last six months of Fela's life, and a poem that deals with Fela's influence on the poet's conception of Africa. Edited by Trevor Schoonmaker.~Essays by Olu Oguibe, Yomi Durotoye, Vivien Goldman, Moyo Okediji and Michael E. Veal. ~Poetry by Sharon Strange. Paperback, 10.5 x 10.5 in./192 pgs / 64 color 40 BW0 duotone 0 ~ Item D20046",
  "genres": [
    "Nonfiction",
    "Music"
  ],
  "author": "Trevor Schoonmaker",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/1519892.Black_President"
}