{
  "title": "Gettin' Down to the \"Real\" Nitty-Gritty-Life: American Dream or American Nightmare",
  "description": "This edition is no longer available.For all editions see hereListen up ladies, when you meet a man then you find out he does things you don’t like, don’t be fakin’ and grinnin’ and acting like what he’s doing is okay just because he may be cute, fine, have nice material things or is good in bed. For example, if he smacks when he eats, and if he belches out loud after eating or drinking instead of covering his mouth and saying “Excuse me,” don’t sit there grinnin’ and acting like that’s cute when you know you’re cringing inside. If you meet a man that never wants to take you out, who’s always calling your house asking you what you’re cooking, and who always wants to sit at your place riding your sofa and bed, don’t be grinnin’ and acting like that sh*t is okay when you know you’re disgusted. Let that man know you don’t play that sh*t and let him go find a damn fool somewhere else.Hey fellas, the same holds true for you. When you meet a woman then you find out she doesn’t like to cook or clean and you know you want a woman who cooks and cleans. Don’t be superficial and decide to keep fakin’ and grinnin’ and continue on with the relationship just because she’s pretty and fine and you like the sex when you know you’re disgusted. Be a grown, honest man instead of being trifling and let her know you want a woman who cooks and cleans then make the effort damnit, to find a woman who you find pretty and fine with good sex who actually likes cooking and cleaning.There's a popular saying out these days that says, \"Keep it Real.\" If you want to read a book that really keeps it \"real\" regarding everyday life that includes topics like, The Dating Game, The Magic Wand, Wedding Day Blues, Dysfunctional Families, Neighbors from Hell and the Rude Awakening that will reveal that carrying, birthing and raising a child is nothing like you thought it would be, you have to read this book. It’s not only \"real,\" it's also bold, humorous, down-to-earth and very entertaining, and that's for real. Through forty chapters, this enthusiastic author has no qualms with calling it as she sees it, thus anyone who endorses political correctness should be forewarned!Chapter 34. COMMON SENSEQ: \"I earn just enough money to cover my bills and maybe eat out once or twice a week, should I go shopping for expensive clothes and shoes and just pay a little money on my bills instead of paying them in full?\"R: Yeah, that’s a real good idea, let those bills double up so you can really get behind. At least when you get your car repossessed and get evicted you’ll be looking good.Q: \"My man never takes me out, he calls only in spells and it’s always after 10:00 p.m., then he comes over to sleep with me and he never spends the night, is he just using me for sex?\"R: No way girlfriend, that man is in love, he’s just really, really busy, maybe he’s working three or four jobs. You know how it is sometimes.Q: \"My man kicks my ass, does he love me, should I stay with him?\"R: Yeah, he loves you so much that he tries to rearrange your face and cave your ribs in. I think you should stay with him until you’re either permanently disabled or dead.",
  "genres": [],
  "author": "Georgia Madison",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/15216101-gettin-down-to-the-real-nitty-gritty-life"
}