{
  "title": "Media Ecologies: Materialist Energies in Art and Technoculture",
  "description": "A \"dirty materialist\" ride through the media cultures of pirate radio, photography, the Internet, media art, cultural evolution, and surveillance. In Media Ecologies , Matthew Fuller asks what happens when media systems interact. Complex objects such as media systems—understood here as processes, or elements in a composition as much as \"things\"—have become informational as much as physical, but without losing any of their fundamental materiality. Fuller looks at this multiplicitous materiality—how it can be sensed, made use of, and how it makes other possibilities tangible. He investigates the ways the different qualities in media systems can be said to mix and interrelate, and, as he writes, \"to produce patterns, dangers, and potentials.\" Fuller draws on texts by Felix Guattari and Gilles Deleuze as well as writings by Friedrich Nietzsche, Marshall McLuhan, Donna Haraway, Friedrich Kittler, and others, to define and extend the idea of \"media ecology.\" Arguing that the only way to find out about what happens when media systems interact is to carry out such interactions, Fuller traces a series of media ecologies—\"taking every path in a labyrinth simultaneously,\" as he describes one chapter. He looks at contemporary London-based pirate radio and its interweaving of high- and low-tech media systems; the \"medial will to power\" illustrated by \"the camera that ate itself\"; how, as seen in a range of compelling interpretations of new media works, the capacities and behaviors of media objects are affected when they are in \"abnormal\" relationships with other objects; and each step in a sequence of Web pages, Cctv—world wide watch, that encourages viewers to report crimes seen via webcams. Contributing to debates around standardization, cultural evolution, cybernetic culture, and surveillance, and inventing a politically challenging aesthetic that links them, Media Ecologies , with its various narrative speeds, scales, frames of references, and voices, does not offer the academically traditional unifying framework; rather, Fuller says, it proposes to capture \"an explosion of activity and ideas to which it hopes to add an echo.\"",
  "genres": [
    "Design"
  ],
  "author": "Matthew Fuller",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/152304.Media_Ecologies"
}