{
  "title": "Keeper Martin's Tale",
  "description": "Ruin Mist was featured in Publisher's Weekly Cover Story. Also recommended by the YA Librarians at VOYA Magazine, Foreword Magazine and in The Complete Idiots Guide to Elves and Fairies, Ancient Art of Faery Magick, Popular Series Fiction for Middle School and Teen Readers: A Reading and Selection Guide, and more.Major marketing, print advertising, publicity and promotion. All new edition for 2003! Bestselling author Robert Stanek delivers an epic fantasy adventure that'll open your mind and your heart. After the Great War that divided the peoples, the kingdoms of men plunged into a Dark Age that lasted 500 hundred years. To heal the lands and restore the light, the great kings decreed that magic and all that is magical, be it creature, man or device, shall be cleansed to dust. Creatures born of magic were hunted to extinction. Any who dared call magic to their hands were butchered in the streets and afterward their kin were cast out of the known lands or hunted in the blood sport. The cleansing raged for so long that no human could recall a time without it and it is in this time that the Dark Lord Sathar returned from the dark beyond. The one hope of the peoples of Ruin Mist was Queen Mother, the elf queen of old. She saw a way out of everlasting darkness, a path that required the union of the divided peoples. Yet the Elves of the West did not share her vision. They thought her mad and answered her call for help with a call to arms. Now for the first time in recorded history the armies of the West are marching toward the sacred city of the East and an unholy war where elf must fight elf is inevitable. To turn back the tides of one war and prepare for another, Queen Mother must send her most trusted warriors on a perilous journey across the Great Sea, but what the elves will find if they can reach the far shores cannot be known for certain.",
  "genres": [
    "Fantasy"
  ],
  "author": "Robert Stanek",
  "average_rating": "2.10",
  "url": "https://www.goodreads.com/book/show/1523699.Keeper_Martin_s_Tale"
}