{
  "title": "Dark Swan, Vols. 1-3",
  "description": "Richelle Mead Dark Swan Bundle: Iron Crowned, Storm Born, & Thorn QueenIron Crowned\"New York Times\" bestselling author Richelle Mead takes readers back to the Otherworld, an embattled realm mystically entwined with our world--and ruled by one woman's dangerous choice...Shaman-for-hire Eugenie Markham is the best at banishing entities trespassing in the mortal realm. But as the Thorn Land's queen, she's fast running out of ways to end the brutal war devastating her kingdom. Her only hope: the Iron Crown, a legendary object even the most powerful gentry fear...Who Eugenie can trust is the hardest part. Fairy king Dorian has his own agenda for aiding her search. And Kiyo, her shape-shifter ex-boyfriend, has every reason to betray her along the way. To control the Crown's ever-consuming powers, Eugenie will have to confront an unimaginable temptation--one that will put her soul and the fate of two worlds in mortal peril...Storm BornJust typical. No love life to speak of for months, then all at once, every horny creature in the Otherworld wants to get in your pants...Eugenie Markham is a powerful shaman who does a brisk trade banishing spirits and fey who cross into the mortal world. Mercenary, yes, but a girl's got to eat. Her most recent case, however, is enough to ruin her appetite. Hired to find a teenager who has been taken to the Otherworld, Eugenie comes face to face with a startling prophecy--one that uncovers dark secrets about her past and claims that Eugenie's first-born will threaten the future of the world as she knows it.Now Eugenie is a hot target for every ambitious demon and Otherworldy ne'er-do-well, and the ones who don't want to knock her up want her dead. Eugenie handles a Glock as smoothly as she wields a wand, but she needs some formidable allies for a job like this. She finds them in Dorian, a seductive fairy king with a taste for bondage, and Kiyo, a gorgeous shape-shifter who redefines animal attraction. But with enemies growing bolder and time running out, Eugenie realizes that the greatest danger is yet to come, and it lies in the dark powers that are stirring to life within her...Praise for Richelle Mead and Succubus Blues...\"This is one of those series I'm going to keep following.\" --Jim Butcher, \"New York Times \" bestselling author\"The mix of supernatural mystery, romance, and reluctant succubus is great fun.\" --\"Locus\"\"Exciting, witty, sexy, intriguing and had me captivated from the first page.\" --Cheyenne McCray\"\"Storm Born\" is my kind of book -- great characters, dark worlds, and just the right touch of humor. A great read.\" --Patricia BriggsThorn QueenEugenie Markham is a shaman for hire, paid to bind and banish creatures from the Otherworld. But after her last battle, she's also become queen of the Thorn Land. It's hardly an envious life, not with her kingdom in tatters, her love life in chaos, and Eugenie eager to avoid the prophecy about her firstborn destroying mankind. And now young girls are disappearing from the Otherworld, and no one--except Eugenie--seems willing to find out why.Eugenie has spilled plenty of fey blood in her time, but this enemy is shrewd, subtle, and nursing a very personal grudge. And the men in her life aren't making things any easier. Her boyfriend Kiyo is preoccupied with his pregnant ex, and sexy fey king Dorian always poses a dangerous distraction. With or without their help, Eugenie must venture deep into the Otherworld and trust in an unpredictable power she can barely control. Reluctant queen or not, Eugenie has sworn to do her duty--even if it means facing the darkest--and deadliest--side of her nature...",
  "genres": [
    "Urban Fantasy",
    "Fantasy",
    "Paranormal Romance",
    "Paranormal",
    "Fae",
    "Magic",
    "Fiction"
  ],
  "author": "Richelle Mead",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/10516982-dark-swan-vols-1-3"
}