{
  "title": "Catherine the Great: Love, Sex, and Power",
  "description": "Dutiful daughter, frustrated wife, passionate lover, domineering mother, doting grandmother, devoted friend, tireless legislator, generous patron of artists and philosophers--the Empress Catherine II, the Great, was all these things, and more. Her reign, the longest in Russian Imperial history, lasted from 1762 until her death in 1796; during those years she built on the work begun by her most famous predecessor, Peter the Great, to establish Russia as a major European power and to transform its new capital, St Petersburg, into a city to rival Paris and London in the beauty of its architecture, the glittering splendor of its Court and the magnificence of its art collections. Yet the great Catherine was not even Russian by birth and had no legitimate claim to the Russian throne; she seized it and held on to it, through wars, rebellions and plagues, by the force of her personality, by her charm and determination, and by an unshakable belief in her own destiny.This is the story of Catherine the woman, whom power alone could never satisfy, for she also wanted love, affection, friendship and humor. She found these in letter-writing, in grandchildren, in gardens, architecture and greyhounds--as well as in a succession of lovers which gave rise to salacious rumors throughout Europe. The real Catherine, however, was more interesting than any rumor.Using many of Catherine's own words from her voluminous correspondence and other documents, as well as contemporary accounts by courtiers, ambassadors and foreign visitors, Virginia Rounding penetrates the character of this most powerful, fascinating and surprisingly sympathetic of eighteenth-century women.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "Russia",
    "Historical",
    "Russian History",
    "European History"
  ],
  "author": "Virginia Rounding",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/152461.Catherine_the_Great"
}