{
  "title": "Necessary Lies",
  "description": "Eva Stachniak's Necessary Lies is an earnest debut novel that explores the secrets, falsifications, and betrayals that build empires while rupturing the lives of individuals. Set during one of the 20th century's most tumultuous decades, it tells the story of Anna, a lecturer in English from the University of Wroclaw, who arrives in Montreal in the fall of 1981. When martial law is declared in Poland, she chooses to remain in Canada, although emigration means abandoning her husband, an activist in the political opposition, and deserting her homeland as it reels from the shock of being betrayed by its own people. What follows is a bittersweet tale of Anna's marriage to a German émigré, a composer, and her journey back to Europe 10 years later--after his death and the fall of Communism--to come to terms with her own departure and her second husband's past. Necessary Lies, which won the Amazon.com/Books in Canada First Novel Award, tackles an intriguingly volatile period of repression, recrimination, and reconciliation in central and eastern Europe (and in Canada's separatist Quebec as well). Stachniak is a lucid lecturer who deftly makes fiction from events that have been fodder for recent travel literature, such as Eva Hoffman's Exit into History: A Journey Through the New Eastern Europe and Irena Karafilly's Ashes and Miracles: A Polish Journey. Stachniak's strength as a writer lies in her skill in invoking place--its sights and smells and energy--and in juxtaposing a city's present with its complex past. Like an archaeologist or archivist, she delves into the layers of history to reveal the collective source of personal tragedy. But these strengths ultimately prove to be the novel's shortcoming as a work of fiction. Stachniak has a faintly irritating tendency (right from page 1) to engage in irresolvable arguments about whether Poland is part of central or eastern Europe. More significantly, she fails to render psychologically compelling characters, despite the potentially fascinating figures she draws upon. Furthermore, central confrontation scenes with Anna's Polish ex-husband and her second husband's longtime German lover miss the opportunity to sound the depths of betrayal. How unsatisfactory for the reader when the collision of two world views gets reduced to the banality of a co-owned apartment buyout. --Diana Kuprel",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Poland"
  ],
  "author": "Eva Stachniak",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/1524690.Necessary_Lies"
}