{
  "title": "Out of the Long Dark: The Life of Ian Carr",
  "description": "Few British jazz musicians have been at the cutting edge of as many movements as Ian Carr. A pioneer bebop player in his youth, a colleague of Eric Burdon and John McLaughlin in the R'n'B explosion of the 60s, co-leader of one of Britain's most innovative jazz groups, the Rendell-Carr Quintet, a free-jazz colleague of John Stevens and Trevor Watts, and the founding father of jazz rock in the UK with his band Nucleus, Carr's musical career alone is truly remarkable, and a one-man history of British jazz in the 60s and 70s. Add to that his work as a member of the United Jazz and Rock Ensemble with such distinguished leaders as George Russell, Stan Tracey and Mike Gibbs, and his work as a player is even more remarkable. Yet Ian Carr is also one of the most perceptive critical writers and broadcasters about jazz, being not only the co-author of the Rough Guide, but also the celebrated biographer of Keith Jarrett and Miles Davis. In recent years he has transformed his writing talents into making innovative and prizewinning films on the music he loves, for which he has always been a fearless and outspoken advocate, from the time of his 1973 book Music Outside. As a teacher, his pupils have included such stellar British talents as Julian Joseph, the Mondesir brothers and Nikki Yeoh. He has been a professor of jazz at London's Guildhall School of Music since the 1980s and was founder of the jazz workshop at the Interchange arts scheme. In this full length biography, Alyn Shipton examines the fascinating mix of ingredients that comprise the man and his music, and in the process draws a vivid picture of Carr's home region, the North-East of England, of National Service, of such literary influences as W. Somerset Maugham, of post-war continental Europe and its Bohemian arts scene, and of the London jazz world from the 1960s onwards. The book shows that jazz does not have to have an American accent to be original and innovative, and to inspire audiences all around the world.",
  "genres": [],
  "author": "Alyn Shipton",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/1524973.Out_of_the_Long_Dark"
}