{
  "title": "Nixon and Kissinger: Partners in Power",
  "description": "With his JFK biography, \"An Unfinished Life,\" Dallek cemented a reputation as a great historian. Now he offers a portrait of a pair of leaders who dominated the world stage, changing the course of history. Decades after working side-by-side in the White House, Richard Nixon & Henry Kissinger remain two of the most contradictory & powerful men in America in the 20th century. While their personalities could hardly have been more different, they were magnetically drawn together. Both were ambitious, self-made men, driven by their own inner demons, often ruthless in pursuit of their goals. At the height of power, their rivalry & collaboration led to policies defining the Nixon presidency. Utilizing declassified archives, Dallek uncovers details about their personal relationship & how they struggled to outdo each other in foreign affairs. He also analyzes their dealings with power brokers at home & abroad--including Vietnam, the China opening, detente with the USSR, the Yom Kippur War, Allende's overthrow & war between India & Pakistan--while recognizing how both men plotted to distract the public from scandal. He details Nixon's erratic behavior during Watergate & how Kissinger helped use national security to prevent impeachment.1 Brethren of a kindNixon Kissinger1968 2 The limits of powerThe Nixon-Kissinger White HouseHope & illusion The politics of foreign policyTroubles galore Crisis managers Winter of discontent3 The best of timesThe road to détenteDétente in Asia: gains & lossesThe warriors as peacemakers Tainted victories 4 The worst of timesNew miseries In the shadow of Watergate The Nixon-Kissinger presidencyThe end of a presidency",
  "genres": [
    "History",
    "Biography",
    "Politics",
    "Nonfiction",
    "Presidents",
    "American History",
    "Us Presidents"
  ],
  "author": "Robert Dallek",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/152545.Nixon_and_Kissinger"
}