{
  "title": "Horizon",
  "description": "From the National Book Award-winning author of the now-classic Arctic Dreams, a vivid, poetic, capacious work that recollects the travels around the world and the encounters--human, animal, and natural--that have shaped an extraordinary life.Taking us nearly from pole to pole--from modern megacities to some of the most remote regions on the earth--and across decades of lived experience, Barry Lopez, hailed by the Los Angeles Times Book Review as \"one of our finest writers,\" gives us his most far-ranging yet personal work to date, in a book that moves indelibly, immersively, through his travels to six regions of the world: from Western Oregon to the High Arctic; from the Galápagos to the Kenyan desert; from Botany Bay in Australia to finally, unforgettably, the ice shelves of Antarctica. As he takes us on these myriad travels, Lopez also probes the long history of humanity's quests and explorations, including the prehistoric peoples who trekked across Skraeling Island in northern Canada, the colonialists who plundered Central Africa, an enlightenment-era Englishman who sailed the Pacific, a Native American emissary who found his way into isolationist Japan, and today's ecotourists in the tropics. Throughout his journeys--to some of the hottest, coldest, and most desolate places on the globe--and via friendships he forges along the way with scientists, archaeologists, artists and local residents, Lopez searches for meaning and purpose in a broken world. Horizon is a revelatory, epic work that voices concern and frustration along with humanity and hope--a book that makes you see the world differently, and that is the crowning achievement by one of America's great thinkers and most humane voices.",
  "genres": [
    "Nonfiction",
    "Travel",
    "Nature",
    "Science",
    "Memoir",
    "Environment",
    "History"
  ],
  "author": "Barry Lopez",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/15259073-horizon"
}