{
  "title": "Wahoo: The Patrols of America's Most Famous World War II Submarine",
  "description": "The career of the USS Wahoo in sinking Japanese ships in the farthest reaches of the Empire is legendary in submarine circles. Christened three months after Pearl Harbor, Wahoo was commanded by the astonishing Dudley W. “Mush” Morton, whose originality and daring new techniques led to results unprecedented in naval history; among them, successful “down the throat” barrage against an attacking Japanese destroyer, voracious surface-running gun attacks, and the sinking of a four-ship convoy in one day. Wahoo took the war to Japan’s front porch, and Morton became known as the Navy’s most aggressive and successful sea raider. Now, in a new quality paperback edition, her full story is told by the person most qualified to tell it—her executive officer Richard O’Kane, who went on to become the leading submarine captain of the Second World War.Praise for Wahoo“The accounts of the patrols are spine-tingling, both in triumph and tragedy. It is a tale of great courage, brilliant leadership, and daring innovation in a new type of submarine warfare fought largely on the surface in waters closely controlled by the enemy. Well-written, a gripping story for anybody with a love of the sea or adventure in submarine combat.” —Naval War College Review “This is an exceptional story of American men who rose to the occasion time and again under dangerous circumstance.” —Abilene Reporter News “A first-hand—and first-rate—narrative, told by the former executive officer of this legendary WWII submarine, which gives readers an intimate feel for life aboard the ‘boats’ that helped beat the odds in the battles of the Pacific and put Japan on the defensive.” —Sea Power “Like Clear the Bridge! , [Richard] O’Kane’s bestselling account of the Tang’s 33 confirmed sinkings, [ Wahoo ] is a rousing, authentic war adventure that could well become a classic of its type, crack[ling] with the tensions, boredom, and occasional exhilaration of submarine life under the Pacific, O’Kane is a superb storyteller, and his credentials are impeccable.” —Springfield Sunday Republic",
  "genres": [
    "History",
    "Military History",
    "World War II",
    "Nonfiction",
    "Military Fiction",
    "Naval History",
    "Audiobook"
  ],
  "author": "Richard H. O'Kane",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/1525984.Wahoo"
}