{
  "title": "The Fortunes of Wangrin",
  "description": "The Fortunes of WangrinAmadou Hampâté BâTranslated by Aina Pavolini Taylor with an Introduction by F. Abiola IreleWinner of the Grand Prix Litteraire de l'Afrique Noire\"I think this is perhaps the best African novel on colonialism and it draws very richly on various modes of oral literature.\" --Ralph Austen, University of Chicago\"It is a wonderful introduction to colonial rule as experienced by Africans, and in particular, to the rule of African middlemen.\" --Martin A. Klein, University of Toronto\"The Fortunes of Wangrin is not only a wonderful novel by one of Africa's most renowned intellectuals, it is also literally filled with information about French colonization and its impact on traditional African societies, African resistance and collaboration to colonization, the impact of French education in Africa, and a host of other subjects of interest.\" --Francois Manchuelle, New York UniversityWangrin is a rogue and an operator, hustling both the colonial French and his own people. He is funny, outrageous, corrupt, traditional, and memorable. Ba's book bridges the chasm between oral and written literature. The stories about Wangrin are drawn from oral sources, but in the hands of this gifted writer these materials become transformed through the power of artistic imagination and license.The Fortunes of Wangrin is a classic in Franchophone African literature.Amadou Hampate Ba was a distinguished Malian poet and scholar of African oral tradition and precolonial history.Aina Pavolini Taylor is an independent translator with wide experience of Africa, now living and working in Italy.F. Abiola Irele is a professor in the Department of Black Studies at Ohio State University.",
  "genres": [
    "Africa",
    "Mali",
    "Fiction",
    "African Literature",
    "Historical Fiction",
    "The World",
    "20th Century"
  ],
  "author": "Amadou Hampâté Bâ",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/152595.The_Fortunes_of_Wangrin"
}