{
  "title": "Chez Panisse Vegetables",
  "description": "For twenty-five years, Alice Waters and her friends at Chez Panisse in Berkeley, California have dedicated themselves to the ideal of serving the finest, freshest foods with simplicity and style. From tender baby asparagus in early spring, to the colorful spectrum of peppers at the height of summer; crisp, leafy chicories in autumn, to sweet butternut squash in the dark of winter, much of the inspiration about what to put on the menu comes from the high quality produce Waters and her chefs seek out year-round. Using the treasures from the earth, Chez Panisse Vegetables offers endless possibilities for any occasion. Try Grilled Radicchio Risotto with Balsamic Vinegar at your next dinner party, or Pizza with Red and Yellow Peppers for a summer evening at home. Why not forgo green-leaf lettuce, and opt for Artichoke and Grapefruit Salad drizzled with extra-virgin olive oil? Or serve Corn Cakes with fresh berries for breakfast instead of cereal?Throughout Vegetables, Waters shares her energy and enthusiasm for what she describes as \"living foods.\" When she first began in the restaurant business, the selection of good-quality vegetables was so limited that she found herself searching out farmers with whom she might do business. Luckily, today's explosion of markets and organic farms across the country ensures that any home cook can find freshly harvested produce to put on the table. And with the increased popularity of home gardening, more and more people are taking their vegetables straight from the earth and into the kitchen.Cooks, gardeners, vegetarians and everyone who appreciates good food will find Chez Panisse Vegetables to be not only a cookbook, but a valuable resource for selecting and serving fine produce. From popular vegetables like corn, tomatoes and carrots, to more unusual selections like chard, amaranth greens and sorrel, Vegetables offers detailed information about the seasonal availability, proper look, flavor and preparation of each selection. Arranged alphabetically by vegetable, and filled with colorful linocut images, Chez Panisse Vegetables makes it easy for a cook to find a tempting recipe for whatever he or she has brought home from the market.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction",
    "Reference",
    "Foodie",
    "Culinary"
  ],
  "author": "Alice Waters",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/152706.Chez_Panisse_Vegetables"
}