{
  "title": "The Sleeping Sword",
  "description": "Bun Bendle introduces us to his very first story, called The Sleeping Sword, written after he suddenly became blind. Nothing's been the same since Bun dived off a quay and hit his head on a rock. What he can't bear to tell anyone is that as well as his sight, the accident seems to have wiped out parts of his memory. In despair, he contemplates suicide, but the love of his great friend Anna saves him. His friends petition for him to be able to stay on his home island of Bryher in the Scilly Isles, and not be sent away to school. Calling his father in for tea one day, Bun falls through a cavity under the field. His father's tractor rumbling towards him just manages to stop, inches away. The cavity is a tomb, containing an ancient and beautiful sword and shield. Bun is immediately drawn to them, and as he holds the sword, Bedivere, a knight of the Round Table appears and commands him to take it to King Arthur. Taking Anna on his quest, Bun finds a galleon waiting at the quay to them to the king. Bun suddenly remembers their meeting before, told in Arthur, High King of Britain, and Arthur stands before them, a warrior reunited with his shield and his sword, Excalibur. Arthur reveals his purpose; Bun must drive Excalibur back into the stone until it is time for the king to come again. Bun and Anna return to Bryher on the ghost ship, hardly believing what has happened around them. The next morning Bun wakes to find his sight restored, the sword and shield safely in the cavity in the field and Anna totally unaware of the previous night's events. So Bun concludes his story, proud to have written such a long one, and Anna loves it. Bun strolls off to the field towards his father's tractor, and suddenly falls down a cavity. The tractor is rumbling towards him...and he knows everything he's dreamt is about to come true.",
  "genres": [
    "Fantasy",
    "Childrens",
    "Fiction",
    "Arthurian",
    "Middle Grade",
    "Adventure",
    "Historical Fiction"
  ],
  "author": "Michael Morpurgo",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/1527401.The_Sleeping_Sword"
}