{
  "title": "Once Upon a Tart ... : Soups, Salads, Muffins, and More",
  "description": "A cookbook in the tradition of The Silver Palate and The Barefoot Contessa . . .In New York City, famous for its food and restaurants, locals are reverential about the bakeshop and café Once Upon a Tart. For more than a decade, they have been lining up at the store mornings and afternoons, waiting patiently for their signature scones, muffins, soups, salads, sandwiches, cookies, and—of course—tarts. And pretty much since the day the café opened, patrons have been asking—sometimes begging—the proprietors for their sweet and savory recipes. Good the wait is over.In Once Upon a Tart , the café’s founders and co-owners, Jerome Audureau (a New Yorker via France) and Frank Mentesana (a New Yorker via New Jersey), go public with their culinary secrets (“We don’t have any,” says Frank. “That’s our biggest secret of all”) and recipes. They also tell their inspiring success story, from selling tarts wholesale out of a warehouse in Long Island City to opening their now-famous outpost in Soho.In nine delicious chapters ranging from savory tarts to cookies, the authors instruct and advise home cooks on everything from how to make the flakiest tart crust (“keep the dough cold”) to making sandwiches (“condiments are key”) to how to diet (“you want half the calories, eat half the scone”). Once Upon a Tart is packed with more than 225 easy-to-prepare recipes, including all the store classics that have earned Frank and Jerome the devotion of their Caramelized-Leek-and-Celery Tart, Creamy Carrot Soup with Fresh Dill, Pork Loin Sandwich with Frisée and Rosemary-Garlic Aioli, Buttermilk Scones with Dried Currants, Banana–Poppy Seed Muffins, and Strawberry-Rhubarb Tart with Crisp Topping.Says Frank, “We believe that deep down, everyone is a cook.” Adds Jerome, “And that a little butter in your life is a good thing.”",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Reference",
    "Nonfiction",
    "Food"
  ],
  "author": "Frank Mentesana",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/152786.Once_Upon_a_Tart_"
}