{
  "title": "The Shore of Forever",
  "description": "In the 1950s, the world is still recovering from World War II. Families look for new lives in places across the sea, mothers find their peace playing homemaker, and soldiers try to move past decisions made during their time at war. Among those searching for a second chance are Eloisa Nicoletti, Adeline Darbonne, and Arden Lund, whose paths converge in the middle of the Atlantic on July 25, 1956, in the aftermath of the sinking of the SS Andrea Doria.SS Andrea DoriaOld wounds from WWII still scar Eloisa Nicoletti's family and her hometown of Bari, Italy. Through the years, the Nicoletti's have watched their neighbors and friends flee for a new life in the west. When that opportunity comes for Eloisa in the form of her fiancé, she takes it, and her family reluctantly follows. Boarding the luxurious Andrea Doria is the final step in the journey to New York, but the dangers of the ocean lurk just inside the fog, and the safety of home's shore is hundreds of miles away.MS StockholmArden Lund has sailed on the smallest ship on the North Atlantic route since she was launched in 1946. Home away from home, the ship is the only place he can ever find peace. Still reeling from mistakes made during the war, his way of life will be tested all over again when the Stockholm runs across the Andrea Doria in the middle of the night in a field of thick fog.SS Île De FranceAdventure had always been at the forefront of Adeline Darbonne's mind. When her time as an army nurse was over, she took on the adventure of marriage. Years after this decision and two baby girls later, Adeline is looking for something beyond her role as a housewife. Traveling back to France from America with her family, she's hoping another move will be the perfect opportunity to make something of herself again. However, on the first evening of the voyage, her skills as a retired army nurse are called upon by the crew, and the bonds between her and her family are tested like never before.As all three ships steam across the Atlantic, three people's lives will converge and be forever changed on the fateful night of July 25, 1956.",
  "genres": [
    "Historical Fiction",
    "World War II"
  ],
  "author": "Elora Maxwell",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/152839129-the-shore-of-forever"
}