{
  "title": "The Picnic: An Escape to Freedom and the Collapse of the Iron Curtain",
  "description": "A dramatic reconstruction of the greatest border breach in Cold War history and its tumultuous aftermath. 'A pivotal – and exhilarating – moment in late 20th-century history . . . gripping' Observer'This little gem of a book . . . intensely moving' Sunday Times* A GUARDIAN BIGGEST FICTION AND NON-FICTION FOR 2024 * A WATERSTONES ‘BOOK YOU NEED TO READ IN 2024’ * A FOYLES TOP TEN READ FOR JANUARY 2024 *In August 1989, a group of Hungarian activists did the they entered the forbidden militarised zone of the Iron Curtain - and held a picnic.Word had spread of what was going to happen. On wisps of rumour, thousands of East German 'holiday-makers' had made their way to the border between Hungary and Austria, awaiting an opportunity, fearing prison, surveilled by lurking Stasi agents. The stage was set for the greatest border breach in Cold War that day hundreds would cross from the Communist East to the longed-for freedom of the West. The fall of the Berlin Wall, the end of the Soviet Union - the so-called end of history - all would flow from those dramatic hours.Drawing on dozens of original interviews with those involved - activists and border guards, escapees and secret police, as well as the last Communist prime minister of Hungary - Matthew Longo reconstructs this world-shaping event and its tumultuous aftermath. Freedom had been won but parents had been abandoned and families divided. Love affairs faltered and new lives had to be built from scratch.The Picnic is the story of a moment when the tide of history turned. It shows how freedom can be both dream and disillusionment, and how all we take for granted can vanish in an instant.'Evoke[s] the dramatic events in vivid colour . . . fascinating' Telegraph‘Captivating . . . a vivid, fast-paced narrative’ New York Times",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "European History",
    "Germany",
    "Audiobook",
    "Historical"
  ],
  "author": "Matthew Longo",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/152921691-the-picnic"
}