{
  "title": "Las escalas de Levante",
  "description": "El conocimiento fortuito, en París, de un antiguo héroe rescatado del recuerdo de un vetusto libro de texto. Una serie de encuentros en que éste rememora y narra su azarosa existencia a la espera de una cita misteriosa. Y, a partir de ahí, el fluir de una historia apasionante en la que, a lo largo de múltiples peripecias, relampaguean la ternura y la violencia, momentos de gloria y de dicha y abismos de desaliento, sobre los que, finalmente, superándolo todo, incluso la distancia y la incertidumbre, se alza -como un símbolo del mestizaje, la tolerancia y el espíritu de reconciliación que inspiran toda la obra de Amin Maalouf- el amor. Con Las escalas de Levante, título que hace referencia a las ciudades comerciales que durante largo tiempo fueron crisol y punto de contacto entre los hemisferios oriental y occidental, el escritor libanés se asoma por primera vez al siglo xx en esa minuciosa reconstrucción novelada de los avatares de Oriente que viene acometiendo a lo largo de su obra -«León el Africano» (AQ 1 y LB 1524), «Samarcanda» (AQ 7 y LB 1645), «Los Jardines de Luz» (AQ 16 y LB 1702), «La Roca de Tanios» (AQ 24 y LB 1761)-. Situada contra un fondo que abarca cabalmente todo nuestro siglo, desde el fin del imperio otomano hasta nuestros días, pasando por la Francia ocupada durante la Segunda Guerra Mundial y los violentos episodios del conflicto árabe-israelí, la historia de Ossyane Ketabdar, emblema de la ancestral encrucijada de caminos que ha sido desde siempre el Cercano Oriente, constituye la encarnación particular pero perfecta de todos aquellos individuos a los que la ciega violencia de los hombres y los vaivenes de la Historia han desposeído de lo que más aprecian. Otras obras de Amin Maalouf en Alianza Editorial: «El primer siglo después de Beatrice» (AQ 19) y «Las cruzadas vistas por los árabes»",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Novels",
    "Roman",
    "French Literature",
    "Literature",
    "Lebanon"
  ],
  "author": "Amin Maalouf",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/1529635.Las_escalas_de_Levante"
}