{
  "title": "What We All Long For",
  "description": "“They were born in the city from people born elsewhere.”What We All Long For follows the overlapping stories of a close circle of second-generation twenty-somethings living in downtown Toronto. There’s Tuyen, a lesbian avant-garde artist and the daughter of Vietnamese parents who’ve never recovered from losing one of their children in the crush to board a boat out of Vietnam in the 1970s. Tuyen defines herself in opposition to just about everything her family believes in and strives for. She’s in love with her best friend Carla, a biracial bicycle courier, who’s still reeling from the loss of her mother to suicide eighteen years earlier and who must now deal with her brother Jamal’s latest acts of delinquency. Oku is a jazz-loving poet who, unbeknownst to his Jamaican-born parents, has dropped out of university. He is in constant conflict with his narrow-minded and verbally abusive father and tormented by his unrequited love for Jackie, a gorgeous black woman who runs a hip clothing shop on Queen Street West and dates only white men. Like each of her friends, Jackie feels alienated from her parents, former hipsters from Nova Scotia who never made it out of subsidized housing after their lives became entangled with desire and disappointment.The four characters try to make a life for themselves in the city, supporting one another through their family struggles.There’s a fifth main character, Quy, the child who Tuyen’s parents lost in Vietnam. In his first-person narrative, Quy describes how he survived in various refugee camps, then in the Thai underworld. After years of being hardened, he has finally made his way to Toronto and will soon be reunited with his family – whether to love them or hurt them, it’s not clear. His story builds to a breathless crescendo in an ending that will both shock and satisfy readers.What We All Long For is a gripping and, at times, heart-rending story about identity, longing and loss in a cosmopolitan city. No other writer has presented such a powerful and richly textured portrait of present-day Toronto. But What We All Long For is not only about a particular city. It’s about the universal experience of being human. As Walcott puts it, “Brand makes us see ourselves differently and anew. She translates our desires and experiences into a language, an art that allows us to voice that which we live, but could not utter or bring to voice until she did so for us.”",
  "genres": [
    "Fiction",
    "Canada",
    "Contemporary",
    "Queer",
    "School",
    "LGBT",
    "Canadian Literature"
  ],
  "author": "Dionne Brand",
  "average_rating": "3.36",
  "url": "https://www.goodreads.com/book/show/153093.What_We_All_Long_For"
}