{
  "title": "Take This Bread: A Radical Conversion",
  "description": "“Mine is a personal story of an unexpected and terribly inconvenient Christian conversion, told by a very unlikely convert.”–Sara MilesRaised as an atheist, Sara Miles lived an enthusiastically secular life as a restaurant cook and a writer. Then early one winter morning, for no earthly reason, she wandered into a church. “I was certainly not interested in becoming a Christian,” she writes, “or, as I thought of it rather less politely, a religious nut.” But she ate a piece of bread, took a sip of wine, and found herself radically transformed.The mysterious sacrament of communion has sustained Miles ever since, in a faith she’d scorned, in work she’d never imagined. In this astonishing story, she tells how the seeds of her conversion were sown, and what her life has been like since she took that bread.A lesbian left-wing journalist who covered revolutions around the world, Miles was not the woman her friends expected to see suddenly praising Jesus. She was certainly not the kind of person the government had in mind to run a “faith-based charity.” Religion for her was not about angels or good behavior or piety; it was about real hunger, real food, and real bodies. Before long, she turned the bread she ate at communion into tons of groceries, piled on the church’s altar to be given away. The first food pantry she established provided hundreds of poor, elderly, sick, deranged, and marginalized people with lifesaving food and a sense of belonging. Within a few years, the loaves had multiplied, and she and the people she served had started nearly a dozen more pantries.Take This Bread is rich with real-life Dickensian characters–church ladies, child abusers, millionaires, schizophrenics, bishops, and thieves–all blown into Miles’s life by the relentless force of her newfound calling. She recounts stories about trudging through the rain in housing projects, wiping the runny nose of a psychotic man, storing a battered woman’s .375 Magnum in a cookie tin. She writes about the economy of hunger and the ugly politics of food; the meaning of prayer and the physicality of faith. Here, in this achingly beautiful, passionate book, is the living communion of Christ.“ The most amazing book.” – Anne Lamott",
  "genres": [
    "Memoir",
    "Religion",
    "Nonfiction",
    "Spirituality",
    "Christianity",
    "Faith",
    "Christian"
  ],
  "author": "Sara  Miles",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/153242.Take_This_Bread"
}