{
  "title": "Macarin Anjing",
  "description": "Libby, tokoh dalam novel ini, adalah tokoh yang sangat lovable. I love her and I love this novel. A page turner![Ninit Yunita, istribawel & penulis]Serasa kena tonjok. Hei, gue juga pernah macarin anjing dan gue rasa setiap cewek pernah jatuh cinta sama cowok tipe kayak gini (Ngaku deh!). Gue masih inget jelas GRRR.... Menyedihkan memang, kadang yang imitasi memang lebih gencar iklannya toh?! Suka deh sama gaya bahasanya Ino. Mengalir, renyah, pedes (ini yang asik...!), dan berani. Pokoknya mesti baca deh! [Yennie Hardiwidjaja, penulis novel & skenario]Waktu baca judulnya, saya sempat terloncat. Macarin Anjing. La Madonna Santo Dio, cerita apa ini gerangan? Tetapi baru baca beberapa kalimat saja saya memang sudah senyum-senyum. Dan makin ke dalam makin tak kuasa menahan tawa dengan gaya penuturan yang lugas. Uniknya lagi, novel ini juga memberikan segudang ‘referensi’ tentang berbagai hal. Dan tiba di penutup, saya memang ‘sakit hati’, kok Christian yang muda itu bisa menulis begitu lucu dan menarik (hehehe…, boleh dong ngiri).[Ita Sembiring, penulis]Ino, I've read your novel and I think it's great! I think your newest novel is a sample of a new form of post-modern kind of comedy that has flourished well in Indonesia for the past few years. In Australia itself I don't think I've seen this form of comedy as mainstream as in your works. Truly a great works of the new generation of Indonesian writers. Congrats! [Ari Poespodihardjo, dosen]Cerita Ino tuh seru banget. Aku suka banget. Beda dari yang sebelumnya. Cinta tuh emang butuh kesabaran. Kita gak tau yang mana jodoh kita, jadi sebaiknya gak perlu terlalu kebawa dalam kesedihan kalo lagi patah hati. Semuanya udah diatur.... Trus, cerita ini tuh nambah pengetahuan, khususnya catatan kakinya, menandakan Ino orang yg kreatif dan seneng baca.[Dewi Kartika, mahasiswi]",
  "genres": [
    "Indonesian Literature",
    "Chick Lit"
  ],
  "author": "Christian Simamora",
  "average_rating": "2.98",
  "url": "https://www.goodreads.com/book/show/1533317.Macarin_Anjing"
}