{
  "title": "The Housing Question",
  "description": "Die nachfolgende Schrift ist der Wiederabdruck dreier Artikel, die ich 1872 in den Leipziger \"Volksstaat\" schrieb. Damals ergoß sich grade der französische Milliardenregen [49] über Deutschland; Staatsschulden wurden abgezahlt, Festungen und Kasernen gebaut, die Bestände von Waffen und Militäreffekten erneuert; das disponible Kapital nicht minder als die zirkulierende Geldmenge wurden plötzlich enorm vermehrt, und das alles grade zu einer Zeit, wo Deutschland nicht nur als \"einiges Reich\", sondern auch als großes Industrieland auf der Weltbühne auftrat. Die Milliarden gaben der jungen Großindustrie einen mächtigen Aufschwung; sie vor allem waren es, die die kurze, illusionsreiche Periode der Prosperität nach dem Krieg, und gleich darauf, 1873/1874, den großen Krach [372] zuwege brachten, durch welchen Deutschland sich als weltmarktfähiges Industrieland bewährte. Die Zeit, worin ein altes Kulturland einen solchen, obendrein durch so günstige Umstände beschleunigten Übergang von der Manufaktur und dem Kleinbetrieb zur großen Industrie macht, ist auch vorwiegend die Zeit der \"Wohnungsnot\". Einerseits werden Massen ländlicher Arbeiter plötzlich in die großen Städte gezogen, die sich zu industriellen Mittelpunkten entwickeln; andrerseits entspricht die Bauanlage dieser älteren Städte nicht mehr den Bedingungen der neuen Großindustrie und des ihr entsprechenden Verkehrs; Straßen werden erweitert und neu durchgebrochen, Eisenbahnen mitten durchgeführt. In demselben Augenblick, wo Arbeiter haufenweis zuströmen, werden die Arbeiterwohnungen massenweis eingerissen. Daher die plötzliche Wohnungsnot der Arbeiter und des auf Arbeiterkundschaft angewiesenen Kleinhandels und Kleingewerbs. In Städten, die von vornherein als Industriezentren entstanden, ist diese Wohnungsnot so gut wie unbekannt. So in Manchester, Leeds, Bradford, Barmen-Elberfeld. Dagegen in London, Paris, Berlin, Wien hat sie ihrerzeit akute Formen angenommen und besteht meist chronisch fort.",
  "genres": [
    "Nonfiction",
    "Philosophy",
    "Politics",
    "Economics",
    "Theory",
    "History",
    "Urbanism"
  ],
  "author": "Friedrich Engels",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/1533938.The_Housing_Question"
}