{
  "title": "The Stream of Life",
  "description": "Clarice Lispector tinha o hábito de dormir cedo, acordar de madrugada e ficar sentada na sua sala pensando, fumando e ouvindo a Rádio Relógio, acompanhada apenas de seu cachorro, Ulisses. Nesses momentos de solidão, nasceram muitas de suas obras, que, depois, ela escreveria com a máquina de escrever apoiada sobre as pernas. “Escrevo-te sentada junto de uma janela aberta no alto do meu ateliê”, diz ela em determinado trecho do romance Água viva, em que a autora se confunde com a personagem, uma solitária pintora que se lança em infinitas reflexões sobre o tempo, a vida e a morte, os sonhos e visões, as flores, os estados da alma, a coragem e o medo e, principalmente, a arte da criação, do saber usar as palavras num jogo de sons e silêncios que se combinam, a especialidade da própria Clarice.Água viva, longo texto ficcional em forma de monólogo, foi lançado pela primeira vez em 1973, poucos anos antes da morte de Clarice que, nessa época, já se consagrara como um dos valores mais sólidos da nossa literatura, por seu estilo único, em que a grande preocupação era a busca permanente pela linguagem.Água viva é um desafio emocionante para quem lê ou relê Clarice Lispector. Traz uma linguagem que não se perde no tempo; ao contrário, é ricamente metafórica, em que coisas, ações e emoções do dia-a-dia se transformam em grandiosas digressões indagadoras sobre o sentido da existência e da vida. Seguindo a linha de características introspectivas de seus livros, Clarice cria uma obra singular, verdadeiro relato íntimo que projeta em flashes, como num caleidoscópio, verdadeiros resumos de estados de espírito em tom de confidência, onde a subjetividade sobrepuja o factual e a narradora é responsável pela cadência do texto.Nova edição do de um dos livros mais conhecidos de Clarice Lispector, agora com projeto gráfico de Victor Burton e capa criada a partir de pinturas da própria Clarice. Esta edição traz posfácio do poeta Eucanaã Ferraz.",
  "genres": [
    "Fiction",
    "Poetry",
    "Classics",
    "Philosophy",
    "Brazil",
    "Literature",
    "Novels"
  ],
  "author": "Clarice Lispector",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/153462.The_Stream_of_Life"
}