{
  "title": "Imaro: The Quest for Cush",
  "description": "It begins with the reunion of Imaro and his kidnapped lover Tanisha, who has been taken to the ruined City of Madness. With the help of their new found friend Pomphis, a Pygmay from the eastern forests of Nyumbani, they learn of the sorcerous forces that may have been behind the dark wizard that destroyed Imaro's youth. The trio goes to Mavindi, the port capital of the Eastern Coastal kingdom of Azania, in search of the legendary Kingdom of Cush, where Imaro hopes to find answers to the questions that have plagued his life. Who is he? Who was his father, and why was he seemingly cursed, and hounded from birth by forces beyond his control.Like his contemporaries, Karl Edward Wagner (Kane) and Michael Moorcock (Elric), Charles Saunders brings something new to the traditional heroic fantasy tale. A broad knowledge of, and passion for, the history and myths of Africa led to the creation of a heroic fantasy character the likes of which the world has never seen. Imaro is no Tarzan… no Conan… Imaro is a warrior out of African legend.Saunders' novel fuses the narrative style of fantasy fiction with a pre-colonial, alternate Africa. Inspired by and directly addresses the alienation of growing up an African American fan of Science Fiction and Fantasy, which to this day remains a very ethnically homogonous genre. It addresses this both structurally (via its unique setting) and thematically (via its alienated, tribeless hero-protagonist). The tribal tensions and histories presented in this fantasy novel reflect actual African tribal histories and tensions, and provide a unique perspective to current and recent conflicts in Africa, particularly the Rwandan genocide and the ongoing conflict in The Sudan.",
  "genres": [
    "Fantasy",
    "Sword and Sorcery",
    "Fiction",
    "Speculative Fiction",
    "Pulp",
    "Dark Fantasy",
    "Action"
  ],
  "author": "Charles R. Saunders",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/1535274.Imaro"
}