{
  "title": "Women With Men: 3 Stories",
  "description": "Richard Ford's Independence Day --his sequel to The Sportswriter, and an international bestseller--is the only novel ever to have received both the Pulitzer Prize and the PEN/Faulkner Award. Now, two years later, he reaffirms his mastery of shorter fiction with his first collection since the widely acclaimed Rock Springs, published a decade ago.The landscape of Women with Men ranges from the northern plains of Montana to the streets of Paris and the suburbs of Chicago, where Mr. Ford's various characters experience the consolations and complications that prevail in matters of passion, romance and love. A seventeen-year-old boy starting adulthood in the shadow of his parents' estrangement, a survivor of three marriages now struggling with cancer, an ostensibly devoted salesman in early middle age, an aspiring writer, a woman scandalously betrayed by her husband--they each of them contend with the vast distances that exist between those who are closest together. Whether alone, long married or newly met, they confront the obscure difference between privacy and intimacy, the fine distinction of pleasing another as opposed to oneself, and a need for reliance that is tempered by fearful vulnerability.In three long stories, Richard Ford captures men and women at this complex and essential moment of truth--in the course of everyday life, or during a bleak Thanksgiving journey, seismic arguments, Christmas abroad, the sudden disappearance of a child, even a barroom shooting. And with peerless emotional nuance and authority he once again demonstrates, as Elizabeth Hardwick has written, \"a talent as strong and varied as American fiction has to offer.\"",
  "genres": [
    "Fiction",
    "Short Stories",
    "American",
    "Contemporary",
    "Relationships",
    "Literary Fiction",
    "Love"
  ],
  "author": "Richard Ford",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/153554.Women_With_Men"
}