{
  "title": "Throes of Democracy: The American Civil War Era 1829-1877",
  "description": "\"And then there came a day of fire!\" From its shocking curtain-raiser—the conflagration that consumed Lower Manhattan in 1835—to the climactic centennial year of 1876, when Americans staged a corrupt, deadlocked presidential campaign (fought out in Florida), Walter A. McDougall's Throes of The American Civil War Era, 1829-1877 throws off sparks like a flywheel. This eagerly awaited sequel to Freedom Just Around the A New American History, 1585-1828 carries the saga of the American people's continuous self-reinvention from the inauguration of President Andrew Jackson through the eras of Manifest Destiny, Civil War, and Reconstruction, America's first failed crusade to put \"freedom on the march\" through regime change and nation building. But Throes of Democracy is much more than a political history. Here, for the first time, is the American epic as lived by Germans and Irish, Catholics and Jews, as well as people of British Protestant and African American stock; an epic defined as much by folks in Wisconsin, Kansas, and Texas as by those in Massachusetts, New York, and Virginia; an epic in which Mormon prophet Joseph Smith, showman P. T. Barnum, and circus clown Dan Rice figure as prominently as Herman Melville, Walt Whitman, and Henry Ward Beecher; an epic in which railroad management and land speculation prove as gripping as Indian wars. Walter A. McDougall's zesty, irreverent narrative says something new, shrewd, ironic, or funny about almost everything as it reveals our national penchant for pretense—a predilection that explains both the periodic throes of democracy and the perennial resilience of the United States.",
  "genres": [
    "History",
    "Civil War",
    "American History",
    "Nonfiction",
    "American",
    "19th Century"
  ],
  "author": "Walter A. McDougall",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/1536793.Throes_of_Democracy"
}