{
  "title": "MAD's Greatest Artists: The Completely MAD Don Martin",
  "description": "Just about everyone who came of age during the 1960s, 70s, and 80s was influenced by MAD MAGAZINE, and no one at MAD was more influential than \" MAD 's MAD dest Artist,\" Don Martin. His immediately recognizable style--featuring bulbous noses, wild sound effects, and the legendary \"hinged feet\"--was filled with broad and daring slapstick and routinely broke new ground. A surprisingly quiet man, Martin's work spoke volumes as he left an indelible mark on several generations, influencing the style of many illustrators while shaping the sense of humor of countless misguided youths. He was inducted into the Comic Book Hall of Fame in 2004. Says Gary Larson, creator of The Far Side : \"Don Martin was the one who really stood out.\"Now, it is with great pride that Running Press, in collaboration with MAD , launches the MAD 's Greatest The Completely MAD Don Martin ( MAD 's Greatest Artists Series). For the first time ever, here is the complete collection of every piece of art Don Martin published in MAD throughout his extraordinary thirty-year tenure (1957-1987). With all of Martin's strips, covers, posters, and stickers--presented in chronological order--it is nothing less than a masterpiece of comic genius. Complementing Martin's opus of published works are letters, sketches, and rare photos providing an in-depth look at the artist at work. Plus, scattered throughout are notes and original illustrations--commissioned for this volume--paying tribute to the artist and penned by MAD 's most-notable personalities, including Al Jaffee, Mort Drucker, Jack Davis, Sergio Aragonés, and more. There are also notes by the likes of Jim Davis ( Garfield ) and a foreword by Gary Larson. A collector's item and object d'art in its own right, this deluxe two-volume slipcased edition will be the season's must-have gift book for the millions whose childhoods--and subsequent adulthoods--would not have been the same without MAD MAGAZINE and Don Martin.",
  "genres": [
    "Comics",
    "Humor",
    "Graphic Novels",
    "Art",
    "Cartoon",
    "Fiction",
    "Comic Strips"
  ],
  "author": "Don Martin",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/1052113.MAD_s_Greatest_Artists"
}