{
  "title": "Highland Guardian",
  "description": "Sarah Douglas is a successful thirty-eight year old romance novelist with big problems. She's come to Scotland on a three month working vacation hoping to recapture her muse—who's deserted her—and resolve the issue of her strange 'feelings'— the ones which allow her to sense the emotions of everyone she touches.From the moment she arrives, however, her problems only intensify. She's being stalked, but by whom? Is he real or only a figment of her imagination? What about the darkly handsome owner of the cottage she's leasing? How is she ever going to deal with her growing attraction to a man ten years her junior? She knows from bitter experience men—particularly men who look like Ian—aren't interested in women like her.Ian McCullough is neck-deep in troubles of his own. As a half-mortal descendent of Faeries, he's a Guardian, sworn to protect both the mortals of this world and the Portals leading to the Faerie Realm. After six hundred years, he's confident he knows what to expect in just about every situation and exactly how to handle it. But he never counted on a woman like Sarah showing up in his life; a woman who intrigues and charms him. A woman who turns out to be of Faerie descent herself, although she has no idea of her heritage and no belief in any Otherworld beings.When he's assigned to protect her, Ian finds the job is tougher than he could possibly have imagined. Oh, he can handle the stalker and the ex-husband and even the renegade Faeries trying to kidnap her for their own purpose. It's falling in love and forsaking his status as Guardian, a position he swore to honor at his father's deathbed, he's having trouble with.Both Sarah and Ian struggle to battle the demons of self-doubt and their individual pasts. In the process they learn that healing will take the strongest magic of all, the true love that occurs only between two souls fated to be togetherhttp://www.melissamayhue.com/books.html",
  "genres": [
    "Romance",
    "Time Travel",
    "Historical Romance",
    "Fantasy",
    "Paranormal Romance",
    "Paranormal",
    "Time Travel Romance"
  ],
  "author": "Melissa Mayhue",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/1537464.Highland_Guardian"
}