{
  "title": "Rock & Roll: An Unruly History",
  "description": "Rock and roll is a profoundly American art form, the musical expression of revolutionary changes in popular culture and values, a Dionysian eruption that hit the white-bread fifties like a hurricane.  It was a force destined to shake up subsequent decades and transform American culture.  Throughout its nearly four-decade history, rock and roll has continued to reinvent itself, to challenge, to upset as well as delight, to break rules and make new ones.Rock & An Unruly History is the companion guide to PBS's ten-part series on rock that aired in September.  When PBS first conceived the Rock & Roll series, they sought out Robert Palmer, an acclaimed rock historian, writer, and the New York Times 's first full-time pop music critic, to help assemble the names, events, and landmarks that are the terrain of rock history.  Palmer acted as the chief advisor to the series and it was this association that inspired him to write ROCK &   An Unruly History .ROCK & ROLL traces the course of rock's rich history through Palmer's own perceptions and experiences. Incorporating countless interviews with rock personalities that he has conducted over the last three decades, ROCK & ROLL follows rock's road of creative flashpoints, but diverges, too, to explore the fundamental traditions that have helped define both the music and its culture.  With a corresponding chapter to each part in the series, ROCK & ROLL shows how people, places, and events from rock \"gods\" to little known session musicians, from Muscle Shoals, Alabama, to the far reaches of West Africa shaped and defined the music's most important epochs.  Yet, to give rock the more in-depth analysis that it deserves, Palmer has written three additional essays \"I Put a Spell on You,\" \"Delinquents of Heaven, Hoodlums from Hell,\" and \"The Church of the Sonic Guitar\" which  respectively explore the rudiments of rhythm, the ritual of rebellion, and the story of the \"six-string\" in rock.In ROCK & ROLL , Robert Palmer traces rock's ongoing evolution, showing how its many styles and early influences from blues and gospel to reggae, punk, and rap overlap and distinguish themselves from one another.  With more than one hundred and fifty illustrations,   ROCK & ROLL is the best of the two primary approaches to rock and roll history the history of innovative flashpoints, and the history of an ongoing tradition.  As told through the senses and lifelong  experiences of one of rock's preeminent critics, ROCK & ROLL is the most insightful and intelligent history of rock ever written.",
  "genres": [
    "Music",
    "History",
    "Nonfiction"
  ],
  "author": "Robert Palmer",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/1537508.Rock_Roll"
}