{
  "title": "Common Sense on Mutual Funds: New Imperatives for the Intelligent Investor",
  "description": "NATIONAL BESTSELLER!\"Cogent, honest, and hard-hitting-a must read for every investor.\" -Warren E. BuffettPraise for Common Sense on Mutual Funds\"Invoking both Thomas Paine and Benjamin Graham, Jack Bogle outlines a supremely logical plan not only to better investors' returns, but to improve the whole fund industry. This isn't just the best book yet by Bogle, it may well be the best book ever on mutual funds.\" -DON PHILLIPS, President & CEO, Morningstar, Inc.\"Buffett cannot teach you or me how to become a Warren Buffett. Bogle's reasoned precepts can enable a few million of us savers to become in twenty years the envy of our suburban neighbors-while at the same time we have slept well in these eventful times.\"-PAUL A. SAMUELSON, Massachusetts Institute of Technology Department of Economics\"After a lifetime of picking stocks, I have to admit that Bogle's arguments in favor of the index fund have me thinking of joining him rather than trying to beat him. Bogle's wisdom and his commonsense way of explaining things make this book indispensable reading for anyone trying to figure out how to invest in this crazy stock market.\"-JAMES J. CRAMER, Money Manager and Senior Columnist for TheStreet.com\"Written in his characteristic forthright and visionary style, Bogle penetrates the myths and jargon to shed a powerful light on the central issues that confront every investor, no matter what their level of experience or sophistication.\" -MARTIN L. LEIBOWITZ, Vice Chairman and Chief Investment Officer, TIAA-CREF\"Jack Bogle is one of the great pioneer/visionaries of the investment business. In this book, he shares his knowledge, experience, and judgment to enable us to become better investors. The final philosophical chapters provide insights that may help some of us become better people.\" -BYRON R. WIEN, Chief U.S. Investment Strategist Morgan Stanley Dean Witter",
  "genres": [
    "Finance",
    "Nonfiction",
    "Business",
    "Personal Finance",
    "Money",
    "Economics",
    "Self Help"
  ],
  "author": "John C. Bogle",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/153765.Common_Sense_on_Mutual_Funds"
}