{
  "title": "Lazaro Cardenas: Mexican Democrat",
  "description": "General Cardenas sought to dissuade Mr. Townsend from writing this biography saying that as a friend he was apt to be prejudiced in his favor. As was probably noted by Professor Frank Tannenbaum in his foreword to this book, he states that \"it is difficult for anyone who has known General Cardenas to write about him dispassionately.\"General Cardenas is represented as a man of honor, nobility,, integrity, tact, idealism, moderation, modesty, sincerity, liberalism, tolerance, vision-and countless other virtues. As page after page was read, and as the number of the virtues mounted, one might search for some confession of shortcoming, some fall from virtuous grace. On the very few occasions when the fact of error was conceded, this was defended by the author as an extenuating circumstance. For example, when President Cardenas, who stood for honest elections and noninterference by the Executive (sic), winked at the fraudulent counting of the votes after the Almazan-Camacho election, it was because Almazan's threat to revolt had caused the President \"to lose concern about the counting of the votes.\"William Cameron Townsend, who has spent most of his adult life among Indian tribes of Mexico and Guatemala, first became acquainted with Lazaro Cardenas in 1935 when the President of Mexico discovered Mr. and Mrs. Townsend living in an Indian village in Morelos teaching the Indians to read in their native Aztec language. A long and intimate friendship developed, affording Mr. Townsend an excellent opportunity to become well acquainted with Lazaro Cardenas, the man. The particular value of this book, therefore, is to be found in the warm, sympathetic character delineation of General Cardenas rather than in the sketchy, disjointed, and thoroughly inadequate chapters on the Cardenas administration. For a more penetrating, comprehensive, and orderly view of the problems and achievements of the Cardenas administration we must still rely on the Weyls' Reconquest of Mexico.",
  "genres": [
    "Biography",
    "History"
  ],
  "author": "William C. Townsend",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/15392202-lazaro-cardenas"
}