{
  "title": "The Mammoth Cheese",
  "description": "When Manda Frank conceives eleven babies with the help of fertility treatments, she brings the world's attention to rural Three Chimneys, Virginia. As the news media descends on the town, even bringing presidential candidate Adams Brooke to Manda's hospital bedside, the residents of Three Chimneys celebrate before the cameras. When all eleven children are born alive, Pastor Leland Vaughn rejoices in his belief that the miraculous event will enliven his community.Meanwhile, artisanal cheese-maker Margaret Prickett has devoted herself to campaigning for Brooke, who has promised to instate a sweeping amnesty for family farms that will erase the debt that threatens her own centuries-old farm. At home, tension swells as Margaret's daughter Polly, after suffering through her parents' messy divorce, finds her own rebellious urges expressed in the radical ideas of Mr. March, a young history teacher. At the same time, August Vaughn, Margaret's loyal farm hand, struggles with his feelings for Margaret, taking solace in being a living historian of Thomas Jefferson. As autumn progresses and the sickly Frank babies begin to die, all of Three Chimneys becomes infected with the same disquiet simmering in the Prickett household.In an effort to heal his shaken flock, Pastor Vaughn encourages Margaret and August to recreate the Mammoth Cheese, a 1,235-pound wheel of Cheshire delivered to the newly inaugurated President Thomas Jefferson by his New England supporters. Margaret reluctantly agrees, and soon the whole town is involved in the new project. As Margaret plunges herself into first the Adams Brooke campaign and then the making of the giant cheese, she loses sight of the events unfolding in Polly's life. Polly's crush on Harvey March, her revolutionary-minded history teacher, gradually develops into a dangerous relationship. As the novel progresses, March's words and actions towards Polly become questionable and finally blatantly inappropriate and sinister, soon showing that Polly's suspicions of his affection for her aren't wishful thinking at all.August Vaughn also begins to question his place in Margaret's life. For years, he harbored a love for her that kept him living at home with his parents and working as a laborer on her farm. Now that Margaret's marriage has ended, August admits his feelings for her, and Margaret, overwhelmed by her work on the farm and the increasingly threatening letters from the bank regarding foreclosure on her property, rebuffs him. August distances himself from the Prickett and Vaughn families, buying a piece of land and overseeing the construction of his own, small home.August's parents are hurt by their only son's decision to leave home, especially his father Leland, who struggles with guilt from his involvement in the birth of the Frank Eleven. He begins to question the wisdom of his council in encouraging Manda to carry all eleven embryos to term. The first babies die and the rest suffer in the hospital and or at the new Frank home, which has been left half-finished by Polly's father's construction firm in the wake of dwindling interest in and charity for the Frank family. But even Leland doesn't understand Manda's suffering. A celebrity and town hero while pregnant, the deaths of her children have returned Manda to her status as the girl from the wrong side of the tracks. She miserably cares for the six implacable infants, babies with whom she has been unable to bond. As her life descends into increasing chaos, and her older daughter Rose suffers a terrible dog bite from Manda's untrained pack, Manda finds herself overcome by deep despair and even contemplates killing the babies and herself.Finally, the cheese is complete. Leland, optimistic that all of Three Chimneys will benefit from Margaret's project, organizes the trip to Washington D.C. Polly's history class, under the supervision of Mr. March, joins the trip, as does a reluctant August, who despite his father's pleas, has refused to dress as Jefferson for the trip. The cheese has at this point become an ethically questionable endeavor, but Margaret finds herself unable to stop what she has begun. Brooke has used Margaret's family motto to get elected, and Margaret is dismayed by the commercial aspect her gift to Brooke has taken on-the cheese now sports corporate sponsorship and is trailed by the media. Margaret's feels even more defeated when a reporter accompanying the caravan tells her that Brooke's farm amnesty is sure to succumb to a compromise with congress. She also realizes her own feelings for August but is unable to bridge the distance that has grown between them.As Margaret, Polly, August, Leland, and Mr. March travel towards Washington, the tensions threatening their families and all of Three Chimneys builds to a startling conclusion that forces everyone to face the gap between their intentions and their actions.In the vivid world of The Mammoth Cheese, the present is immersed in the ppppppast and the meaning of community is elusive. As the characters struggle to understand their own debts to parents, friends, and neighbors, they learn to assert their independence.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Literary Fiction",
    "Historical Fiction",
    "Family",
    "Novels",
    "Book Club"
  ],
  "author": "Sheri Holman",
  "average_rating": "3.46",
  "url": "https://www.goodreads.com/book/show/1540627.The_Mammoth_Cheese"
}