{
  "title": "The Wolf's Bitch",
  "description": "Arthur White was never the most popular kid in high school. Bullied daily by the incredibly massive, but lean Johnny Claw, Arthur vows to reinvent himself when he goes to University.Only a year later Arthur has become a muscle bound hard-body that can't help but draw the attention of all the cute college guys who \"accidently\" brush against his backside during class.But White can't seem to shake his unpopular past, still feeling inadequate despite his flawless Adonis body and beautiful baby face.That is until he is invited to the Tooth and Claw Society, a fraternity for the rich and powerful future leaders of the world, second only to the Skull and Bones Society in assurance for a life of influence and luxury.But when Arthur is led into an empty forest clearing for his Induction Ritual, he knows something sinister is afoot.To his surprise, the hunky members who had invited him to join Tooth and Claw are werewolves who want nothing more than his ass on a silver platter- in more ways than one!Can Arthur White escape the forest, or will he succumb to his darkest fantasy?Warning! This 5,500+ word short story contains steamy gay shower sex, werewolf gangbangs, naked wrestling, and capture fantasies abound!Here's an \"“I’m going to enjoy this,” he could hear the monstrous voice of Alistair Tooth boom as he lifted him as if he were merely a rag doll. The pricks of his fur reminded Arthur of a porcupine as the spiky ends pined themselves around his skin.“Yeah, Arthur thought to himself, me too.”Claw opened his mouth and revealed rows of jagged white teeth which seemed to leave little room for his extremely long tongue. Johnny slid his moist pink sliver of flesh across Arthur’s pectorals, taking time suck between the sexy line of separation; the result of endless hours of exercise.Arthur couldn’t help, but get hard. His simple pink rod glided upright as he felt Alistair’s man-wolf hybrid cock smash against the crevice of his bare ass. He couldn’t shake the feeling that the two monsters were making him into a human sandwich as they squeezed him between their two tight bodies. A third breath, Kaiser he assumed, had worked himself beneath the three above and began lapping Arthur’s balls like a dog in the summer time. Tooth began his slow grind as he shoved himself into his asshole, his vein ridden dowel scrapping against his prostate. Arthur let out a small moan as Johnny Claw sucked at his nipples.\"",
  "genres": [],
  "author": "Kate Hampton",
  "average_rating": "2.84",
  "url": "https://www.goodreads.com/book/show/15414420-the-wolf-s-bitch"
}