{
  "title": "T. Rex and the Crater of Doom",
  "description": "Sixty-five million years ago, a comet or asteroid larger than Mt. Everest slammed into the Earth, causing an explosion equivalent to the detonation of a hundred million hydrogen bombs. Vaporized impactor and debris from the impact site were blasted out through the atmosphere, falling back to Earth all around the globe. Terrible environmental disasters ensued, including a giant tsunami, continent-scale wildfires, darkness, and cold, followed by sweltering greenhouse heat. When conditions returned to normal, half the genera of plants and animals on Earth had perished.This horrific story is now widely accepted as the solution to a great scientific murder mystery what caused the extinction of the dinosaurs? In T. rex and the Crater of Doom , the story of the scientific detective work that went into solving the mystery is told by geologist Walter Alvarez, one of the four Berkeley scientists who discovered the first evidence for the giant impact. It is a saga of high adventure in remote parts of the world, of patient data collection, of lonely intellectual struggle, of long periods of frustration ended by sudden breakthroughs, of intense public debate, of friendships made or lost, of the exhilaration of discovery, and of delight as a fascinating story unfolded.Controversial and widely attacked during the 1980s, the impact theory received confirmation from the discovery of the giant impact crater it predicted, buried deep beneath younger strata at the north coast of the Yucatán Peninsula. The Chicxulub Crater was found by Mexican geologists in 1950 but remained almost unknown to scientists elsewhere until 1991, when it was recognized as the largest impact crater on this planet, dating precisely from the time of the great extinction sixty-five million years ago. Geology and paleontology, sciences that long held that all changes in Earth history have been calm and gradual, have now been forced to recognize the critical role played by rare but devastating catastrophes like the impact that killed the dinosaurs.",
  "genres": [
    "Science",
    "Nonfiction",
    "Dinosaurs",
    "History",
    "Palaeontology",
    "Geology",
    "Biology"
  ],
  "author": "Walter Álvarez",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/1542164.T_Rex_and_the_Crater_of_Doom"
}