{
  "title": "When the Killing's Done",
  "description": "From the bestselling author of The Women comes an action- packed adventure about endangered animals and those who protect them.  Principally set on the wild and sparsely inhabited Channel Islands off the coast of Santa Barbara, T.C. Boyle's powerful new novel combines pulse-pounding adventure with a socially conscious, richly humane tale regarding the dominion we attempt to exert, for better or worse, over the natural world. Alma Boyd Takesue is a National Park Service biologist who is spearheading the efforts to save the island's endangered native creatures from invasive species like rats and feral pigs, which, in her view, must be eliminated. Her antagonist, Dave LaJoy, is a dreadlocked local businessman who, along with his lover, the folksinger Anise Reed, is fiercely opposed to the killing of any species whatsoever and will go to any lengths to subvert the plans of Alma and her colleagues. Their confrontation plays out in a series of escalating scenes in which these characters violently confront one another, and tempt the awesome destructive power of nature itself. Boyle deepens his story by going back in time to relate the harrowing tale of Alma's grandmother Beverly, who was the sole survivor of a 1946 shipwreck in the channel, as well as the tragic story of Anise's mother, Rita, who in the late 1970s lived and worked on a sheep ranch on Santa Cruz Island. In dramatizing this collision between protectors of the environment and animal rights' activists, Boyle is, in his characteristic fashion, examining one of the essential questions of our Who has the right of possession of the land, the waters, the very lives of all the creatures who share this planet with us? When the Killing's Done will offer no transparent answers, but like The Tortilla Curtain, Boyle's classic take on illegal immigration, it will touch you deeply and put you in a position to decide.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Book Club",
    "Environment",
    "Literary Fiction",
    "Audiobook",
    "Nature"
  ],
  "author": "T. Coraghessan Boyle",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/10523257-when-the-killing-s-done"
}