{
  "title": "A Natural History of Parenting: From Emperor Penguins to Reluctant Ewes, a Naturalist Looks at Parenting in the Animal World and Ours",
  "description": "\"We humans parent our young longer than any other animal on earth. For us, parenting is such an essential part of reproduction that we tend to think of parenting as an essential part of all reproduction. . . . Most creatures living on the earth today do not bother with such things at all. Beyond producing good-sized eggs and finding, perhaps, a suitable spot to lay them, most animal parents never give their young any kind of care. They never even see their young. And were they to see them, they would be much more inclined to eat them than to offer them food, protection, or guidance.\"In A Natural History of Parenting,Susan Allport, a naturalist and science writer, explores the exciting and often startling dynamics of maternal and paternal behavior among the species.  When one of the ewes Allport was raising refused to mother her new lamb, she was forced to reconsider many of her preconceptions about the world of parenting. She  began to explore the roots of parental instincts across the broad spectrum of the animal kingdoms. In A Natural History of Parenting, she examines the awesome diversity of nature to reveal what we share with insects, birds, and other animals, and, just as important, how we differ from them.Allport's study takes the reader from caves in Texas filled with twenty million bats to huge tanks of beluga whales at the New York Aquarium, from the icy reaches of East Greenland where Arctic wolves raise their young to ant nests where huge labor pools have led to primitive infant care. Along the way, she gathers research on myriad creatures--beavers and wasps, birds and elephants, frogs and humans--to show us a magnificent variety of parental behavior among species, from a male emperor penguin forgoing nourishment to spend weeks protecting an egg balanced on the top of his feet to the manifestations of the human female's \"nesting instinct.Susan Allport is the best kind of science writer--knowledgeable, inquisitive, and entertaining. This invaluable book will ensure that you never again think in the same way of how and why we nurture our young.\"Susan Allport tackles a complex subject head on with penetrating analysis. Her acute observations, introspection, and logical conclusions capture the essence of the whole spectrum of understanding parenting, and make major contributions to the delicate art of rearing children. Allport has given parenting a fresh and exciting direction. The next century will need just such courageous and responsive attention to the underpinnings of the human society. \"        --Kenneth A. Chambers, zoologist at the American Museum of Natural History and author of A Country Lover's Guide to Wildlife",
  "genres": [
    "Nonfiction",
    "History",
    "Parenting"
  ],
  "author": "Susan Allport",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/1542747.A_Natural_History_of_Parenting"
}