{
  "title": "Wikinomics: How Mass Collaboration Changes Everything",
  "description": "In just the last few years, traditional collaboration—in a meeting room, a conference call, even a convention center— has been superseded by collaborations on an astronomical scale.   Today, encyclopedias, jetliners, operating systems, mutual funds, and many other items are being created by teams numbering in the thousands or even millions. While some leaders fear the heaving growth of these massive online communities, Wikinomics proves this fear is folly. Smart firms can harness collective capability and genius to spur innovation, growth, and success.  A brilliant guide to one of the most profound changes of our time, Wikinomics challenges our most deeply-rooted assumptions about business and will prove indispensable to anyone who wants to understand competitiveness in the twenty-first century.  Based on a $9 million research project led by bestselling author Don Tapscott, Wikinomics shows how masses of people can participate in the economy like never before. They are creating TV news stories, sequencing the human genome, remixing their favorite music, designing software, finding a cure for disease, editing school texts, inventing new cosmetics, or even building motorcycles. You'll read about:  • Rob McEwen, the Goldcorp, Inc. CEO who used open source tactics and an online competition to save his company and breathe new life into an old-fashioned industry. • Flickr, Second Life, YouTube, and other thriving online communities that transcend social networking to pioneer a new form of collaborative production. • Mature companies like Procter & Gamble that cultivate nimble, trust-based relationships with external collaborators to form vibrant business ecosystems.   An important look into the future, Wikinomics will be your road map for doing business in the twenty-first century.",
  "genres": [
    "Business",
    "Nonfiction",
    "Economics",
    "Technology",
    "Sociology",
    "Internet",
    "Science"
  ],
  "author": "Don Tapscott",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/154341.Wikinomics"
}