{
  "title": "Jesus in America: Personal Savior, Cultural Hero, National Obsession",
  "description": "Where else but America do people What Would Jesus Do?What Would Jesus Drive?What Would Jesus Eat? \"This book is for believers and non-believers alike. It is not a book about whether one should believe in Jesus, but about how Americans have believed in and portrayed him.\" -- from the Introduction Jesus in America is a comprehensive exploration of the vital role that the figure of Jesus has played throughout American history. Written by one of our most distinguished historians, Richard Wightman Fox, this book provides a brilliant cultural history of Jesus in America from its origins to today, demonstrating how Jesus is the most influential symbolic figure in our history. Benjamin Franklin understood Jesus as a wise man worthy of imitation. Thomas Jefferson regarded him as a moral teacher. The assassination of Abraham Lincoln, which occurred on Good Friday, was popularly interpreted as paralleling the crucifixion of Jesus ... as one preacher put it, \"Jesus Christ died for the world, Abraham Lincoln died for his country.\" Elizabeth Cady Stanton appropriated Jesus' message to champion women's rights. George W. Bush named Jesus as his favorite political philosopher -- and several other GOP candidates followed suit -- during the last presidential race. As we have seen in recent presidential elections, the name of Jesus is often thrust into the center of political debates, and many Americans regularly enlist Jesus, their ultimate arbiter of value, as the standard-bearer for their views and causes. Fox shows how Jesus influenced such major turning points in American history Fox gives an expert, lively account of all the ways that Jesus is portrayed and understood in American culture. Extensively illustrated with images representing the multitude of American views of Jesus, Jesus in America reveals how fully and deeply Jesus is ingrained in the American experience.",
  "genres": [
    "Religion",
    "History",
    "Nonfiction",
    "Christianity",
    "Sociology",
    "Cultural Studies"
  ],
  "author": "Richard Wightman Fox",
  "average_rating": "3.35",
  "url": "https://www.goodreads.com/book/show/1543467.Jesus_in_America"
}