{
  "title": "Party of Three",
  "description": "Pia My dreams of a career as an artist are too big to let a little thing like love derail them. Funny how it takes a drag show to reach inside my soul, show me a glimpse of who I truly am, and bring my two best friends into my life. After a lifetime as collateral damage to Mom’s serial monogamy, I never thought I’d have room for the inevitable heartache of romance. Yet I can’t help myself when it comes to the two men who mean more to me than I ever imagined possible. Emil Coming out is never easy, but staying in the closet is crushing my soul. I’ve known who I am for most of my life. Jewish, drag king, trans man, teacher, brother, son, uncle. But rejection and fear have kept my truth locked up inside for years. Drag gives me my one safe outlet to be myself, but it takes Pia and Gregor’s unwavering support to find the courage to embrace every part of myself. They give me the strength to step out of the closet and the drive to fight for love. Gregor Some days, getting out of bed seems like more than I can manage. My mom was my rock for most of my life. Single by choice, she showed me that family is who we choose. She is the reason I went into nursing, the reason I fell in love with drag. When I lost her, it seemed like my entire life fell apart. Depression consumed me. It isn’t until I meet my online best friends in person that I truly relearn how to live. Now I’m hoping the three of us can become the family I’ve longed to rebuild ever since I lost mine. Party of Three is an M/M/X nerdy contemporary romance with two trans leads who have different experiences of what that means for them. It is book six in the series, but it can stand alone or function as a series prequel. This is part one of a two-part duology featuring these three characters and it ends with an HEA/HFN. The CW information for both books about these three characters is in the author’s note.",
  "genres": [
    "Found Family",
    "M M M"
  ],
  "author": "Alex  Silver",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/154372397-party-of-three"
}