{
  "title": "Christina, Queen of Sweden: The Restless Life of a European Eccentric",
  "description": "She was born on a bitterly cold December night in 1626 and, in the candlelight, mistakenly declared a boy. On her father's death six years later, she inherited the Swedish throne. She was tutored by Descartes, yet could swear like the roughest soldier. She was painted a lesbian, a prostitute, a hermaphrodite, and an atheist; in that tumultuous age, it is hard to determine which was the most damning label. She was learned but restless, progressive yet self-indulgent; her leadership was erratic, her character unpredictable. Sweden was too narrow for her ambition. No sooner had she enjoyed the lavish celebrations of her officialcoronation at twenty-three than she abdicated, converting to Catholicism (an act of almost foolhardy independence and political challenge) and leaving her cold homeland behind for an extravagant new life in Rome. Christina, Queen of Sweden, longed fatally for adventure. Freed from her crown, Christina cut a breath-taking path across spending madly, searching for a more prestigious throne to scale, stirring trouble wherever she went. Supported and encouraged in turn by the pope, the king of Spain, and France's powerful Cardinal Mazarin, Christina settled at the luxurious Palazzo Farnese, where she established a lavish salon for Rome's artists and intellectuals. More than once the cross-dressing queen was forced to leave town until a scandal died down. She loved to buckle on a sword and swagger like the men whose company she adored, but the greatest mystery in her life was the true nature of her elusive sexuality, which biographer Veronica Buckley explores with sensitivity and rigor. For a time it seemed there was nothing this extraordinary woman might fear attempting, until a bloody tragedy of her own making foreshadowed her downfall. Pairing painstaking research with a sparkling narrative voice and unerring sense of the age, Veronica Buckley reclaims a protean life that had been preserved mostly as myth. Christina was a child of her time, and her time was one of great Europe stood at a crossroads where religion and science, antiquity and modernity, peace and war all met. Christina took what she wanted from each to create the life she most desired, and she dazzled all who met her.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "Sweden",
    "Biography Memoir",
    "European History",
    "Historical"
  ],
  "author": "Veronica Buckley",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/1544257.Christina_Queen_of_Sweden"
}