{
  "title": "Genesis: The Scientific Quest for Life's Origin",
  "description": "Life on Earth arose nearly 4 billion years ago, bursting forth from air, water, and rock. Though the process obeyed all the rules of chemistry and physics, the details of that original event pose as deep a mystery as any facing science. How did non-living chemicals become alive? While the question is (deceivingly) simple, the answers are unquestionably complex. Science inevitably plays a key role in any discussion of life's origins, dealing less with the question of why life appeared on Earth than with where, when, and how it emerged on the blasted, barren face of our primitive planet. Astrobiologist Robert Hazen has spent many years dealing with the fundamental questions of life's genesis. As an active research scientist, he is down deep in all the messy details that science has to offer on the subject, tracing the inexorable sequence of events that led to the complicated interactions of carbonbased molecules. As he takes us through the astounding process of emergence, we are witness to the first tentative steps toward life?from the unfathomable abundance of carbon biomolecules synthesized in the black vacuum of space to the surface of the Earth to deep within our planet's restless crust. We are privy to the breathtaking drama that rapidly unfolds as life prevails. The theory of emergence is poised to answer a multitude of questions?even as it raises the possibility that natural processes exist beyond what we now know, perhaps beyond what we even comprehend. Genesis tells the tale of transforming scientific advances in our quest for life's origins. Written with grace, beauty, and authority, it goes directly to the heart of who we are and why we are here.",
  "genres": [
    "Science",
    "Biology",
    "Evolution",
    "Nonfiction",
    "Chemistry",
    "Popular Science",
    "Genetics"
  ],
  "author": "Robert M. Hazen",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/1544217.Genesis"
}