{
  "title": "The Beginning of Dying",
  "description": "For Hilary Boyd and Thursdays In The Park fans.Backup singer Sally Lightfoot is challenged to lose her wididity, her born-again virginity, before she crumbles into cardigany, sexless middle age. Sally dismisses her old friend Ramone's idea out of hand. Just a year after the death of her beloved husband, her feelings are way too raw. How can she think of dating, let alone sex, when she's so inside the invisibility zone that even charity chuggers avoid her? Going through the dating hell her daughter Ami was going through with added flabby bits? No thanks. Besides which what were the chances of a stray suddenly-single Hugh Fearnley Whittingstall type passing her way, all sexy salty hair and rubber wellies, a Hugh who’d be interested in a short, mixed-up 50 year old who'd misplaced her waistline?But then Sally hadn't banked on meeting island man Loro, a musician of her own age who presses buttons she forgot she had ever posessed. On a long-overdue holiday, the old adventurous rock chick, long buried beneath Sally’s faithful suburban wifely exterior, surfaces. Lust takes on a life of its own and pushes her forward into danger. Does she dare make the first move? Can she fulfill Ramone's challenge and put passion back into her life? Or will she just be making the biggest, most deluded fool of herself ever?A funny, bittersweet Truly Madly Deeply meets Shirley Valentine romance that will have you crying your heart out and laughing out loud.REVIEWS'A wonderful look at finding yourself again after the death of a loved one. Insightful and delightful, full of thoughtful dialogue and exceptional clarity.' LESLIE WRIGHT, The Huffington Post, Blogcritics, Seattlepi, Tic Toc.'I devoured this book. Last night I finished it before my cats got fed.' ELIZABETH BACON-SMITH [US Amazon reviewer]'A beautiful life interrupted then healed by the songs of Leonard Cohen.' BLOGCRITICS'A wonderful story about a woman learning to find herself again. It did remind me a little of How Stella Got Her Groove Back , but it was different enough to stand on its own merits and be enjoyable. If you enjoy a book that takes you on an emotional roller coaster while rooting for the main character, The Born Again Virgin is the book for you.' LITERARY R&R'One minute this book has the reader laughing out loud, the next we are sobbing. This is a finely written novel that deserves to be a bestseller.' JACQUI LOFTHOUSE, The Writing CoachFormerly titled Ten Good Reasons To Lie About Your Age",
  "genres": [
    "Chick Lit",
    "Romance",
    "Contemporary",
    "Fiction"
  ],
  "author": "Stephanie Zia",
  "average_rating": "3.40",
  "url": "https://www.goodreads.com/book/show/15446207-the-beginning-of-dying"
}