{
  "title": "Wartime: Understanding and Behavior in the Second World War",
  "description": "Winner of both the National Book Award for Arts and Letters and the National Book Critics Circle Award for Criticism, Paul Fussell's The Great War and Modern Memory was one of the most original and gripping volumes ever written about the First World War. Frank Kermode, in The New York Times Book Review, hailed it as \"an important contribution to our understanding of how we came to make World War I part of our minds,\" and Lionel Trilling called it simply \"one of the most deeply moving books I have read in a long time.\" In its panoramic scope and poetic intensity, it illuminated a war that changed a generation and revolutionized the way we see the world.Now, in Wartime, Fussell turns to the Second World War, the conflict he himself fought in, to weave a narrative that is both more intensely personal and more wide-ranging. Whereas his former book focused primarily on literary figures, on the image of the Great War in literature, here Fussell examines the immediate impact of the war on common soldiers and civilians. He describes the psychological and emotional atmosphere of World War II. He analyzes the euphemisms people needed to deal with unacceptable reality (the early belief, for instance, that the war could be won by \"precision bombing,\" that is, by long distance); he describes the abnormally intense frustration of desire and some of the means by which desire was satisfied; and, most important, he emphasizes the damage the war did to intellect, discrimination, honesty, individuality, complexity, ambiguity and wit. Of course, no Fussell book would be complete without some serious discussion of the literature of the time. He examines, for instance, how the great privations of wartime (when oranges would be raffled off as valued prizes) resulted in rococo prose styles that dwelt longingly on lavish dinners, and how the \"high-mindedness\" of the era and the almost pathological need to \"accentuate the positive\" led to the downfall of the acerbic H.L. Mencken and the ascent of E.B. White. He also offers astute commentary on Edmund Wilson's argument with Archibald MacLeish, Cyril Connolly's Horizon magazine, the war poetry of Randall Jarrell and Louis Simpson, and many other aspects of the wartime literary world. Fussell conveys the essence of that wartime as no other writer before him. For the past fifty years, the Allied War has been sanitized and romanticized almost beyond recognition by \"the sentimental, the loony patriotic, the ignorant, and the bloodthirsty.\" Americans, he says, have never understood what the Second World War was really like. In this stunning volume, he offers such an understanding.",
  "genres": [
    "History",
    "Nonfiction",
    "World War II",
    "War",
    "Military History",
    "Military Fiction",
    "Psychology"
  ],
  "author": "Paul Fussell",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/154474.Wartime"
}