{
  "title": "Sex: How to Get More of It: A guy’s roadmap to paradise, in and out of the bedroom",
  "description": "How can you make your woman happy and also get what you need? Believe it or not, it’s not impossible! And it doesn’t cost more than a couple of bucks here and there--no trips to Italy or expensive jewelry required. In this handbook, which I’ve kept intentionally short and to-the-point, you will get insight into how women think so that you can speak and behave in a way that will reignite her passion for you. To help you with this I’ve come up with THE LIST which contains 20 easy things you can do to make your relationship happier, more peaceful, and full of love, romance and sex. Ultimately, women want to feel safe, loved, appreciated and cherished. I’m going to give you the tools you need to help her feel exactly that. Enjoy the handbook and I hope it helps bring you and your girl joy that will last a lifetime. Praise for Jodi Ambrose’s “This book is a much-needed idiot’s guide to women. It is honest, frank, and funny. I wish more books on relationships were this straight-forward and witty. Jodi Ambrose gives practical, real-world advice without sounding preachy or patronizing. I have recommended this book to many men and women as I believe both genders will enjoy and learn a great deal from it.\" --Rachel Tighe, Ph.D., Chair, Department of Communication Studies, The University of Virginia's College at Wise “Jodi Ambrose’s books should be required reading for every clueless man and woman who does not understand what can make their relationships \"click\". Her books are not about blindly going along with what your partner thinks is right. Instead, Jodi Ambrose shows you simple ways to easily get in harmony with your loved one.” --Joey Pinkney, Award-winning Book Reviewer and Author “Jodi Ambrose reestablishes a connection between oft-mystified partners by revealing emotional necessities integral to the understanding of the differing sexes. Remarkable in their accessibility, both books avoid jargon in favor of practical-living advice. These books won’t do the work for you, but they will give you the tools to get the job done yourself.” --Philip Rosenberg, Host of Sex and Politics Radio",
  "genres": [],
  "author": "Jodi Ambrose",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/10524630-sex"
}