{
  "title": "وجه النائم",
  "description": "\"أتذكر اللحظة أني، عندما كنت في رحم أمي، كنت غاضباً من كل أحد حتى منكِ، وأسترجع كلامي وأنا أصرخ على الناس، بينما قدمي تضغط على عصبٍ أو لحمٍ في جوف والدتي.. هل تعرفين ما قرّرته وقلته حينها؟ أن أمضي هذا الوقت \"غسان\" حسناً... لحظتها حزمت أمري، أنا الجنين الثقيل بأن أحدثكم عن نفسي، أيها البشر، بلغتكم التي تدعو للسخرية - هكذا قلتُ... فقد ودَّعت كل أهلي من الأجنة؛ ولأنني لا أطيق الإنتظار، فسأقول لكم ما يمكن قوله، ولن أفكّر بأني حنثت بميثاق الرحم، وتكلّمت بغير لغته، فأنا أعي أنكم غير قادرين على سماعي، وحتى لو سمعني أحدكم فسيعتبر هذا وهماً، أو بعضاً من خرافاتكم البلهاء، تلك التي تخترعونها لتداروا بها جبنكم وهلعكم من الغيب\".الرواية تحكي عن رجل سعودي في منتصف الأربعينات من عمره، تعرض لمآسي مبكرة في حياته جعلت منه شخصاً مختلاً ومضطرباً في عيون الآخرين. حياته هذه انتهت به إلى عيشه مع ذاته فقط، ناقماً على كل شيء وعلى كل أحد. له نظرته الخاصة للوجود والحياة. يسافر بشكل دائم إلى جبل لبنان حيث سيجد مكاناً هناك صغيراً لأسراره. تقوم بينه وبين فتاة لبنانية علاقة غيبية في عالم الغيب فقط، دون أن تتحقق على أرض الواقع. الرواية تريد أن تقول أن الغيب ليس له قانون لكن له طباع، والكاتب يحاول أن ترصد بتأمل واسع طباع هذا الغيب، عبر هذه المسارات: المنامات التي يراها النائم، والقصاصات التي يجمعها أو يكتبها ذلك الرجل، ثم يودعها في حفرةٍ ببيتٍ في جبل لبنان، وتشاء الصدفة أن تكتشفها الفتاة اللبنانية، فتقرأ كل قصاصاته فتتابعه وتتأثر به وبأسراره وحياته المؤلمة، دون أن يعلم، حتى تقع في حبه غيبياً.الرجل من ناحيته يعيش بيقين أن امرأة مجهولة في هذا الوجود تناديه وتراقب حياته، ويعيش كل أيامه وهو يخاطبها ويكاتبها، لكنه لم يخطر بباله أن هذه المرأة المجهولة تعيش في الجبل الذي يخبئ في مكان ما منه أسراره، حيث لم يرها ولم يلتق بها.. وكذلك فالبنت اللبنانية تعرف ولا تعرف أنها هي المرأة المجهولة التي يحلم بها ويكاتبها وترى تفاصيل حياته. الاثنان يعيشان أحداث هذا الضباب الرقيق من الغيب والمجهول. حسناً... لحظتها حزمت أمري، أنا الجنين الثقيل بأن أحدثكم عن نفسي، أيها البشر، بلغتكم التي تدعو للسخرية - هكذا قلتُ... فقد ودَّعت كل أهلي من الأجنة؛ ولأنني لا أطيق الإنتظار، فسأقول لكم ما يمكن قوله، ولن أفكّر بأني حنثت بميثاق الرحم، وتكلّمت بغير لغته، فأنا أعي أنكم غير قادرين على سماعي، وحتى لو سمعني أحدكم فسيعتبر هذا وهماً، أو بعضاً من خرافاتكم البلهاء، تلك التي تخترعونها لتداروا بها جبنكم وهلعكم من الغيب",
  "genres": [
    "Novels"
  ],
  "author": "عبد الله ثابت",
  "average_rating": "3.47",
  "url": "https://www.goodreads.com/book/show/10526117"
}