{
  "title": "Rivalry: A Geisha's Tale",
  "description": "Originally published in 1918, Rivalry is regarded as the masterpiece of Nagai Kafu, a Japanese novelist known for his brilliant renderings of Tokyo in the early years of modern Japan. Stephen Snyder offers the first English translation of the complete, uncensored text, which has long been celebrated as one of the most convincing and sensually rich portraits of the geisha profession.Rivalry tells a sweeping story in which sexual politics compete with sisterly affection in a world ruled by material transaction. Komayo is a former geisha who, upon the death of her husband, must return to the \"world of flower and willow\" to escape poverty. A chance encounter with an old patron, Yoshioka, leads to a relationship in which both lovers hope to profit: Yoshioka believes Komayo can restore his lost innocence; Komayo plans to use Yoshioka's patronage to compete in the elaborate music and dance performances staged by her fellow geisha.Yoshioka is eager to ransom Komayo, but as she considers his offer, Komayo falls in love with Segawa, a young actor who promises to turn the talented geisha into the finest dancer in the Shimbashi quarter. Though her feelings for Segawa are genuine, Komayo is eager to use her lover's position to become the lead performer among her peers. Her ambition even tempts her to take on a third patron known only as the \"Sea Monster,\" a repellent but wealthy antiques dealer whose deep pockets promise to shoot Komayo to the height of celebrity.Though she finds herself at the pinnacle of a glittering career, Komayo nevertheless becomes the target of a bitter rivalry between her three lovers that leaves her both thrilled and exhausted, both brutalized and redeemed. Kafu's compelling tale takes readers from the intimate corners of the geisha house to the back rooms of assignation, from the dressing areas of the great kabuki theaters to the lonely country villa of a theater critic and connoisseur of Shimbashi women. His lush depictions of architecture and costumes and his incisive descriptions of urban life and individual motive provide a vivid backdrop for Komayo's struggle-one woman's absorbing quest to find fame, affection, and financial security in the refined but ruthless theater of Shimbashi.",
  "genres": [
    "Japan",
    "Japanese Literature",
    "Fiction",
    "Historical Fiction",
    "Classics",
    "Asia",
    "Asian Literature"
  ],
  "author": "Kafū Nagai",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/1547840.Rivalry"
}