{
  "title": "Killobyte",
  "description": "Walter Toland has the heart and soul of a hero - but his physical body is confined to a wheelchair. He lost both his legs and his job in the line of duty as a policeman. Baal Curran is a high school senior, full of the promise and heartbreak of her first love, and her first loss. The needle scarring from her diabetes drove away the only boy ever to care for her. Now she has retreated inside herself, determined never to be hurt again. Both of them have discovered Killobyte, an exciting new fantasy adventure game that promises to be the most realistic experience they can imagine. Once again Walter can have the strong legs of a hero, charging through a castle to rescue a captive princess, battling a ferocious dragon, matching wits with a sorcerer. With her face hidden behind a fictional character, Baal can forget her shyness and her fear that others will shrink away from her because of her lifetime of illness. She can laugh and have adventures, and dare to care about someone else again. But Killobyte is more real than even its creators can have dreamed. Within its programming lurks a flaw that has allowed one demented player a kind of power its creators never intended - a power that can trap and \"kill\" Walter and Baal time after time in the game scenarios. Of course, as long as this game of cat and mouse is kept within the world of computer-generated adventures, it's only a frustration. Walter and Baal seem never to win. But as the games continue, they begin to wonder whether the power of this mystery player can extend outside the framework of the game.... The mystery player is out for power - and the power he has in mind is far more than just racking up points against fictional opponents. He's coming after Walter and Baal in the real world, and his threat is death.",
  "genres": [
    "Science Fiction",
    "Fantasy",
    "Fiction",
    "Science Fiction Fantasy",
    "Young Adult",
    "Gaming",
    "Speculative Fiction"
  ],
  "author": "Piers Anthony",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/15502.Killobyte"
}