{
  "title": "Eating the Sun: How Plants Power the Planet",
  "description": "A story of a world in crisis and the importance of plants, the history of the earth, and the feuds and fantasies of warring scientists—this is not your fourth-grade science class's take on photosynthesis. From acclaimed science journalist Oliver Morton comes this fascinating, lively, profound look at photosynthesis, nature's greatest miracle. Wherever there is greenery, photosynthesis isworking to make oxygen, release energy, and create living matter from the raw material of sunlight, water, and carbon dioxide. Without photosynthesis, there would be an empty world, an empty sky, and a sun that does nothing more than warm the rocks and reflect off the sea. With photosynthesis, we have a living world with three billion years of sunlight-fed history to relish. Eating the Sun is a bottom-up account of our planet, a celebration of how the smallest things, enzymes and pigments, influence the largest things­­—the oceans, the rainforests, and the fossil fuel economy. From the physics, chemistry, and cellular biology that make photosynthesis possible, to the quirky and competitive scientists who first discovered the beautifully honed mechanisms of photosynthesis, to the modern energy crisis we face today, Oliver Morton offers a complete biography of the earth through the lens of this mundane and most important of processes. More than this, Eating the Sun is a call to arms. Only by understanding photosynthesis and the flows of energy it causes can we hope to understand the depth and subtlety of the current crisis in the planet's climate. What's more, nature's greatest energy technology may yet inspire the breakthroughs we need to flourish without such climatic chaos in the century to come. Entertaining, thought-provoking, and deeply illuminating, Eating the Sun reveals that photosynthesis is not only the key to humanity's history; it is also vital to confronting and understanding contemporary realities like climate change and the global food shortage. This book will give you a new and perhaps troubling way of seeing the world, but it also explains how we can change our situation—for the better or the worse.",
  "genres": [
    "Science",
    "Nonfiction",
    "Biology",
    "Environment",
    "Evolution",
    "Nature",
    "Popular Science"
  ],
  "author": "Oliver Morton",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/1550712.Eating_the_Sun"
}