{
  "title": "Mission Flats",
  "description": "From the New York Times bestselling  author of Defending JacobFormer D.A. William Landay explodes onto the suspense scene with an electrifying novel about the true price of crime and the hidden corners of the criminal justice system. Only an insider could so vividly capture Boston’s gritty underworld of cops and criminals. And only a natural storyteller could weave this mesmerizing tale of murder and memory, a story about the hold of time past over time present–and the story of one unforgettable young policeman who ventures into the most dangerous place of all.By a gleaming lake in the forests of western Maine, outside a sleepy town called Versailles, the body of a man lies sprawled in a deserted cabin. The dead man was an elite D.A. from Boston, and his beat was that city’s toughest Mission Flats .Now, for small-town police chief Ben Truman, investigating the murder will mean leaving his quiet, haunted home and journeying to an alien world of hard streets and hard bargains, where the fierce struggle between police and criminals is fought for the ultimate stakes.Ben joins a manhunt through Mission Flats, where cops are scrambling to find their number-one Harold Braxton, a ruthless predator targeted for prosecution by the murdered D.A. To the Boston police, Braxton is a marked man. But as Ben watches the shadow dance of cops and suspects, he begins to voice doubts about Braxton’s guilt…especially when he uncovers a secret history of murder and retribution stretching back twenty years…back to a brutal killing now nearly forgotten. As past and present collide and a bloody mystery unfolds, only one thing remains the most powerfulrevelations are yet to come.Mission Flats is at once a relentless page-turning mystery and a vivid portrait of a cop’ s life. Here are the street corners, courtrooms, and stationhouses; the deal makers, thugs, and quiet heroes. An unforgettable world–and the luminous, boundary-breaking debut of a new voice in suspense fiction–Mission Flats will haunt you long after the final pages.",
  "genres": [
    "Mystery",
    "Fiction",
    "Mystery Thriller",
    "Thriller",
    "Crime",
    "Audiobook",
    "Suspense"
  ],
  "author": "William Landay",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/1551111.Mission_Flats"
}