{
  "title": "Switching Time: A Doctor's Harrowing Story of Treating a Woman with 17 Personalities",
  "description": "One afternoon in 1989, Karen Overhill walks into psychiatrist Richard Baer’s office complaining of vague physical pains and depression. Odder still, she reveals that she’s suffering from a persistent memory problem. Routinely, she “loses” parts of her day, finding herself in places she doesn’t remember going to or being told about conversations she doesn’t remember having. Her problems are so pervasive that she often feels like an impersonator in her own life; she doesn’t recognize the people who call themselves her friends, and she can’t even remember being intimate with her own husband. Baer recognizes that Karen is on the verge of suicide and, while trying various medications to keep her alive, attempts to discover the root cause of her strange complaints. It’s the work of months, and then years, to gain Karen’s trust and learn the true extent of the trauma buried in her past. What she eventually reveals is nearly beyond belief, a narrative of a childhood spent grappling with unimaginable horror. How has Karen survived with even a tenuous grasp on sanity?Then Baer receives an envelope in the mail. It’s marked with Karen’s return address but contains a letter from a little girl who writes that she’s seven years old and lives inside of Karen. Soon Baer receives letters from others claiming to be parts of Karen. Under hypnosis, these alternate Karen personalities reveal themselves in shocking variety and with undeniable traits—both physical and psychological. One “alter” is a young boy filled with frightening aggression; another an adult male who considers himself Karen’s protector; and a third a sassy flirt who seeks dominance over the others. It’s only by compartmentalizing her pain, guilt, and fear in this fashion—by “switching time” with alternate selves as the situation warrants—that Karen has been able to function since childhood.Realizing that his patient represents an extreme case of multiple personality disorder, Baer faces the daunting task of creating a therapy that will make Karen whole again. Somehow, in fact, he must gain the trust of each of Karen’s seventeen “alters” and convince them of the necessity of their own annihilation.As powerful as Sybil or The Three Faces of Eve, Switching Time is the first complete account of such therapy to be told from the perspective of the treating physician, a stunningly devoted healer who worked selflessly for decades so that Karen could one day live as a single human being.From the Hardcover edition.",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Memoir",
    "Mental Health",
    "Biography",
    "Mental Illness",
    "Medical"
  ],
  "author": "Richard K. Baer",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/1551737.Switching_Time"
}