{
  "title": "Kingmaker",
  "description": "A collection of five erotic stories based on the theme of sex at work.Kingmaker by Justine ElyotThe day after the election, Ms Saffron finds herself in a unique position - holding the balance of power. If her rivals want to win, they must woo her - but both are surprised at just how literally she takes the concept of getting into bed with another party. Who will make her the best offer? Which of her suitors will she make king?Freedom of the Breast by Landon DixonThe first brassiere had been patented six years earlier, in 1913, consisting of little more than two silk handkerchiefs and some pink ribbon. Milky Matthews had taken that basic breast-cupping premise and set sail with it, in an effort to ensure a snug and sexy fit for big-breasted women. He worked 16 hours a day, seven days a week, driven by the burgeoning demand for his big tit bras. Until, one day, Milky meets a beautiful, busty member of the Freedom of the Breast Movement, who demands total tit emancipation for women, unfettered boobs for all. She’s seeking Milky’s support, while he’s seeking release of a different kind.Cardboard by Kay JaybeeWhen, during a passionate encounter, Pia tells her courier boyfriend Owen, of how aroused the aroma of cardboard makes her, and of all the kinkily submissive things she’d like to experience on a pile of boxes, his lack of response makes her think he hasn’t heard her. It is a total surprise to Pia when, weeks later, Owen guides her into the middle of a deserted delivery depot, staring at a vast bed of cardboard boxes. Stripped, her wrists bound with parcel tape, Pia quickly realises Owen had taken in every word of her deepest desire after all ... will the reality live up to her fantasies?Employees Only by Angel ProppsSometimes to get ahead in your career you have to start off at the bottom, or on the bottom. In Employees Only, a beautiful and ambitious employee is pitted against her sexy and lust-driven employer in a kinky girl-on-girl tale that proves that sometimes paying the cost to be the boss is incredibly hot.Jumping the Gun by Zee KensingtonIt’s the sultriest night of the year, and the air conditioning is on the fritz. The only thing that can make this female tattoo artist any hotter is an after-hours job with sexy rockabilly hunk Travis. But, is he trying to get on her good side to scam some free ink, or is he genuinely looking to make a connection? Whatever his reason, she’s still going to take what she wants, and get a hell of a lot more than overtime pay out of the deal.These stories have also been published in Sex at Work",
  "genres": [],
  "author": "Justine Elyot",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/10527967-kingmaker"
}