{
  "title": "I Don't Mean to Be Rude, But...: Backstage Gossip from American Idol & the Secrets that Can Make You a Star",
  "description": "Do YOU have what it takes to be a star? Simon Cowell reveals the answer and takes you behind the scenes of American Idol in this wickedly entertaining tell-all.Since the debut of American Idol, puckish Brit judge Simon Cowell has become America’s most notorious critic—not only on account of his incredible instinct for spotting the next breakout musical stars, but for his hilarious, shockingly candid repartee with everyone who crosses his path. Now, true to form, he holds nothing back, offering you a backstage pass to America’s hottest show—the highlights, the gossip, the contestants who blew their chances—and takes you on a whirlwind tour of the music business while sharing his own insider opinions, on everything.From his days in the mailroom at EMI Records to the creation of American Idol, Simon has always had a knack for judging talent—and for being center stage. Here, he tells the rollicking stories of his first insult (to his mother), his first music criticism (to first-grade teacher Mrs. Prigg), and his first image makeover (on his unfortunate younger brother). And of course, the side-splitting backstory of the birth of American Idol —and all the dreadful auditions, bad hair days, judges’ squabbles, juicy rumors, surprise triumphs, and #1 singles that followed.With his trademark wit and brutal honesty, Simon delivers the real dish Who gave the best and worst performances on the show? What really goes on between the three judges (and what was it like to kiss Paula Abdul)? Who were the biggest divas when the cameras weren’t rolling? And, if you’re an aspiring Justin or J.Lo, you’ll also learn the trade secrets that only Simon how to develop an image and make the most of your talent, how to find an agent or manager, how to nail an audition, and—should you be so lucky to make it to the top—how to stretch your 15 minutes into a career.Packed with razor-sharp insights into music, the fame game, and pop-music powerhouses from the Beatles to Britney Spears, I Don’t Mean to Be Rude, But… is your ticket inside American Idol, and a highly amusing, no-holds-barred look at what it takes to make it big.",
  "genres": [
    "Nonfiction",
    "Music",
    "Biography",
    "Autobiography",
    "Memoir",
    "Tv",
    "Biography Memoir"
  ],
  "author": "Simon Cowell",
  "average_rating": "3.26",
  "url": "https://www.goodreads.com/book/show/155257.I_Don_t_Mean_to_Be_Rude_But_"
}