{
  "title": "Tanequil",
  "description": "Events that began in \"Jarka Ruus,\" Book One of High Druid of Shannara, come swiftly to a head in this second thrilling volume. Alliances are made, trusts are betrayed, and prices are paid. Throughit all, Terry Brooks orchestrates the action with the flawless hand of a master mythmaker- fashioning another exquisite link in his chain of bestselling epics.Loyal to none but herself andlethal even to those closest to her, Shadea a'Ru now holds sway as High Druid of Paranor-her ascension to power all but unchallenged in the wake of Grianne Ohmsford's sudden, mysteriousvanishing. Only Shadea and her catspaw-the treacherous Prime Minister Sen Dunsidan-know the secret fate of the true Ard Rhys . . . for it was they who engineered it, by means of dark magic. And nowGrianne languishes in the fearsome and inescapable netherworld called the Forbidding.Their bloodless coup a success, the corrupt pair, and their confederates within the Druid Council, seeks to maketheir dominion over the Four Lands absolute-with the aid of a devastating new weapon. But it could all be undone if Grianne's young nephew, Penderrin, succeeds in his frantic quest to rescue her.Shadea's airship-borne minions and the relentless assassin under her command continue their fierce pursuit of Pen and his comrades. Eluding death is only half the battle for Pen. To breach theForbidding and bring Grianne back to the natural world means finding the fabled Tanequil . . . and the talisman it alone can provide. That means journeying into the Inkrim-a dreaded region thick with shadows andhaunted by harrowing legends. It also means striking a bargain more dire than Pen could ever imagine. But there can be no turning back. For in her unearthly prison, the Ard Rhys faces a demonic plight too hideous tocountenance. . . .",
  "genres": [
    "Fantasy",
    "Fiction",
    "Epic Fantasy",
    "Science Fiction Fantasy",
    "High Fantasy",
    "Science Fiction",
    "Adventure"
  ],
  "author": "Terry Brooks",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/15552.Tanequil"
}