{
  "title": "Ghost Stories of an Antiquary",
  "description": "Ghost Stories of an Antiquary is the first Horror short-story collection by British writer M.R. James (AKA: Montague Rhodes James) published in 1904 (some had previously appeared in magazines). Some later editions under this title contain both the original collection and its successor, More Ghost Stories of an Antiquary (1911), combined in one volume. This collection features some of M.R. James’ greatest tales of the supernatural world crossing over into our own. In Number 13, an inn that previously belonged to an alchemist changes dimensions in the night. The Mezzotint features a painting of a house reenacting a gruesome scene from the house’s history. In The Treasure of Abbot Thomas, an antiquary who has discovered the location of a treasure gets far more than he bargained for.There are eight classics by great Edwardian scholar and storyteller. \"Number Thirteen,\" \"The Mezzotint,\" \"Canon Alberic's Scrapbook,\" and more. Renowned for their wit, erudition and suspense, these stories are each masterfully constructed and represent a high achievement in the ghost genre. Montague Rhodes James (1862–1936) was a medieval scholar; Provost of King's College, Cambridge. He wrote many of his ghost stories to be read aloud in the long tradition of spooky Christmas Eve tales. His stories often use rural settings, with a quiet, scholarly protagonist getting caught up in the activities of supernatural forces. The details of horror are almost never explicit, the stories relying on a gentle, bucolic background to emphasize the awfulness of the otherworldly intrusions. He is best remembered for his ghost stories which are widely regarded as among the finest in English literature. One of James' most important achievements was to redefine the ghost story for the new century by dispensing with many of the formal gothic trappings of his predecessors, and replacing them with more realistic contemporary settings.",
  "genres": [
    "Horror",
    "Short Stories",
    "Fiction",
    "Classics",
    "Gothic",
    "Ghost Stories",
    "Ghosts"
  ],
  "author": "M.R. James",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/1556093.Ghost_Stories_of_an_Antiquary"
}