{
  "title": "My Beloved Monster: Masha, the Half-wild Rescue Cat Who Rescued Me",
  "description": "The #1 bestselling author of  The Alienist,  Caleb  Carr , tells the extraordinary story of Masha, a half-wild rescue cat who fought off a bear, tackled Caleb like a linebacker—and bonded with him as tightly as any cat and human possibly can.Caleb Carr has had special relationships with cats since he was a young boy in a turbulent household, famously peopled by the founding members of the Beat Generation, where his steadiest companions were the adopted cats that lived with him both in the city and the country. As an adult, he has had many close feline companions, with relationships that have outlasted most of his human ones. But only after building a three-story home in rural, upstate New York did he enter into the most extraordinary of all of his cat Masha, a Siberian Forest cat who had been abandoned as a kitten, and was languishing in a shelter when Caleb met her. She had hissed and fought off all previous carers and potential adopters, but somehow, she chose Caleb as her savior. For the seventeen years that followed, Caleb and Masha were inseparable. Masha ruled the house and the extensive, dangerous surrounding fields and forests. When she was hurt, only Caleb could help her. When he suffered long-standing physical ailments, Masha knew what to do. Caleb’s life-long study of the literature of cat behavior, and his years of experience with previous cats, helped him decode much of Masha’s inner life. But their bond went far beyond academic studies and experience. The story of Caleb and Masha is an inspiring and life-affirming relationship for readers of all backgrounds and interests—a love story like no other.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Animals",
    "Cats",
    "Biography",
    "Biography Memoir",
    "Audiobook"
  ],
  "author": "Caleb Carr",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/155685403-my-beloved-monster"
}