{
  "title": "Sometimes the Magic Works: Lessons from a Writing Life",
  "description": "“Terry Brooks is adamant about dedicating oneself to the craft, while showing awe and humility for the creative process. . . . Every serious writer should refer to this book regularly for inspiration as well as solid crafting advice.”—Elizabeth Engstrom Cratty, Director of Maui Writers RetreatIn Sometimes the Magic Works , New York Times bestselling author Terry Brooks shares his secrets for creating unusual, memorable fiction. Spanning topics from the importance of daydreaming to the necessity of writing an outline, from the fine art of showing instead of merely telling to creating believable characters who make readers care what happens to them, Brooks draws upon his own experiences, hard lessons learned, and delightful discoveries made in creating the beloved Shannara and Magic Kingdom of Landover series, The Word and The Void trilogy, and the bestselling Star Wars novel The Phantom Menace .In addition to being a writing guide, Sometimes the Magic Works is Terry Brooks’s self-portrait of the artist. “If you don’t think there is magic in writing, you probably won’t write anything magical,” says Brooks. This book offers a rare opportunity to peer into the mind of (and learn a trick or two from) one of fantasy fiction’s preeminent magicians.Praise for Sometimes the Magic Works“A marvelously pragmatic initiation to the art of writing.” —Dorothy Allison, author of  Bastard Out of Carolina“[A] succinct and warmhearted autobiographical meditation on the writing life.” —Publishers Weekly“A wise, warm-hearted book—part autobiography, part how-to-do-it manual, with some amazingly candid behind-the-scenes material . . . Fantasy fans, novice writers, and even veteran pros will learn plenty from it.” —Robert Silverberg, award-winning author of the Majipoor Chronicles",
  "genres": [
    "Writing",
    "Nonfiction",
    "Biography",
    "Memoir",
    "Reference",
    "Biography Memoir",
    "How To"
  ],
  "author": "Terry Brooks",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/15569.Sometimes_the_Magic_Works"
}