{
  "title": "The Story Of My Wife: The Reminiscences Of Captain Störr",
  "description": "Lui è grande e grosso, una sorta di Orson Welles impacciato e maldestro. Lei è minuta, graziosa, civettuola. Lui è chiuso, solitario, brusco, diffidente. Lei è espansiva, gentile, capricciosa, arrendevole. Lui non ride mai. Lei ride sempre. Eppure, l'unione fra il capitano di lungo corso Jacques Störr e sua moglie Lizzy (una giovane francese dal passato incerto che lui ha conosciuto a Minorca e portato a vivere a Parigi) non è fondata sull'attrazione fra due opposti nasce dall'incontro di due anime irrequiete e disilluse, stanche di vagabondare ma incapaci di ricongiungersi, che «procedono in parallelo verso il nulla» in un crescendo di rancori e malintesi, scenate furibonde e riconciliazioni provvisorie – rimanendo sempre profondamente estranee l'una all'altra. Ciononostante la loro è la storia di un amore che vive al di là della morte – e ha un potere di fascinazione su chi l'ascolta. Quando Störr, che all'epoca della loro vita in comune ha dedicato gran parte del suo tempo e delle sue energie a raccogliere e analizzare gli indizi dei presunti tradimenti della moglie, dopo anni di stremato vagabondaggio tornerà nella casa da dove lei è scappata proprio per sottrarsi alla sua ossessiva gelosia, scoprirà che Lizzy abita sempre vicino al suo cuore, «in una specie di silenzio magico e pietrificato ... nella stanza accanto» – stanza di cui lui preferisce non aprire la porta. La storia di mia moglie, romanzo a cui lavorò in isolamento assoluto per sette anni, fu pubblicato in Ungheria nel 1942 e passò inosservato fino al 1958, allorché apparve in Francia da Gallimard, per poi essere tradotto in un'altra dozzina di lingue e valere all'autore una candidatura al Nobel nel 1965.",
  "genres": [
    "Hungarian Literature",
    "Hungary",
    "Fiction",
    "Novels",
    "20th Century",
    "Classics",
    "Literature"
  ],
  "author": "Milán Füst",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/1053069.The_Story_Of_My_Wife"
}