{
  "title": "Londres",
  "description": "Par une nuit d'hiver, assis sur de vilaines planches en bois à l'extérieur d'une maison, un petit garçon est plongé dans la lecture d'un livre de mythologie grecque. Il s'appelle Peter. Nous sommes à Londres, en 1887. Il fait un froid glacial. Soudain, un trait de lumière jaune vient terminer sa course sous son capuchon. Peter croit avoir capturé une étoile filante. En vérité, il s'agit d'une minuscule créature vivante. Une fée… Ravissante, coquette et terriblement susceptible. Et quand cette fée jette une poignée de poussière dans les yeux du petit garçon, celui-ci se met à voler dans les airs, par-dessus les toits londoniens couverts de neige… Le lecteur l'aura compris : ce petit garçon n'est autre qu'un certain Peter Pan, figure légendaire de l'imaginaire occidental, apparu dans le roman de James Matthew Barrie et adapté très librement en dessin animé par Walt Disney. Le dessinateur Régis Loisel, coauteur de la série à succès La Quête de l'oiseau du temps, s'est à son tour emparé du mythe pour le transcrire en une bande dessinée dont le premier volet est paru en 1990. Une œuvre qui s'est très vite imposée comme l'une des plus belles réussites de la BD contemporaine. Tout en rendant hommage à la beauté de l'adaptation signée Disney, le dessinateur a opté pour une vision sombre et parfois cruelle de l'œuvre de James Matthew Barrie. Servi par un dessin foisonnant au coup de crayon énergique, son Peter Pan charrie des images fortes et tourmentées, des instantanés de sang et de violence brute qui voisinent heureusement avec des scènes d'humour et de poésie bucolique. Le récit démarre dans les ruelles sordides des quartiers miséreux du Londres victorien, loin, bien loin des maisons confortables chères à Disney. Peter est un gamin rejeté par sa mère. Un enfant des rues qui fait oublier leurs malheurs à ses copains d'infortune en leur racontant avec talent des histoires à rêver debout. De quoi leur faire croire que la vie n'est peut-être pas si moche que ça... Le soir venu, il trouve écoute et réconfort auprès de mister Kundal, homme bon et instruit qui lui offre à manger. Et qui lui apporte aussi les nourritures spirituelles indispensables à son développement intellectuel en l'initiant aux mystères de la mythologie grecque. Au passage, il lui parle de son père – une scène qui prendra toute sa force dans Crochet, le cinquième et avant-dernier volume de la série… Entrer dans le Peter Pan de Régis Loisel, c'est s'embarquer pour une odyssée fascinante à travers les méandres de l'imaginaire. Après tout, comme le dit si bien Peter, il suffit d'y croire… --Gilbert Jacques",
  "genres": [
    "Bande Dessinée",
    "Comics",
    "Graphic Novels",
    "Fantasy",
    "Comic Book",
    "France",
    "Fiction"
  ],
  "author": "Régis Loisel",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/1558870.Londres"
}