{
  "title": "Noisy Outlaws, Unfriendly Blobs, and Some Other Things That Aren't as Scary, Maybe, Depending on How You Feel About Lost Lands, Stray Cellphones, Creatures From the Sky, Parents Who Disappear in Peru, a Man Named Lars Farf, and One Other Story We [...]",
  "description": "Full title: Noisy outlaws, unfriendly blobs, and some other things that aren't as scary, maybe, depending on how you feel about lost lands, stray cellphones, creatures from the sky, parents who disappear in Peru, a man named Lars Farf, and one other story we couldn't quite finish, so maybe you could help us outContents:Introduction / Lemony Snicket --Small country / Nick Hornsby --Lars Farf, excessively fearful father and husband / George Saunders --Monster / Kelly Link --The contests at Cowlick / Richard Kennedy --Each sold separately / Jon Scieszka --Seymour's last wish / Sam Swope --Grimble / Clement Freud --Spoony-E & Spandy-3 vs. the Purple Hordes / James Kochalka --Sunbird / Neil Gaiman --The Aces phone / Jeanne DuPrau --The sixth borough / Jonathan Safran Foer.Interspersed with charts, graphs, and various crossword puzzles, A Book of Noisy Outlaws, Evil Marauders, and Some Other Things . . . features some of today's best authors spinning new tales ranging from the spooky to the strange. George Saunders tells the story of a father who takes caution to dangerous extremes in \"Lars Farf, Excessively Fearful Father and Husband.\" In \"ACES by Phone,\" a small boy finds a cell phone that lets him listen in on the thoughts of dogs, and in \"Small Country,\" Nick Hornby introduces a country too small for a postal system but, unfortunately for one bookish boy, just big enough for a football team. Each story features full-color illustrations by artists including Barry Blitt, Lane Smith, David Heatley, and Marcel Dzama.The collection includes previously unpublished children's stories from Jonathan Safran Foer (Everything is Illuminated), Nick Hornby (High Fidelity), Neil Gaiman (Sandman), George Saunders (CivilWarLand in Bad Decline), Kelly Link (Stranger Than Fiction), and Jon Scieskza (Stinky Cheese Man). The dust jacket folds into a unique aerogram, which factors into a special contest involving a story written partly by Lemony Snicket, partly by thousands of children.",
  "genres": [
    "Short Stories",
    "Fiction",
    "Fantasy",
    "Young Adult",
    "Anthologies",
    "Humor",
    "Horror"
  ],
  "author": "Eli Horowitz",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/15591.Noisy_Outlaws_Unfriendly_Blobs_and_Some_Other_Things_That_Aren_t_as_Scary_Maybe_Depending_on_How_You_Feel_About_Lost_Lands_Stray_Cellphones_Creatures_From_the_Sky_Parents_Who_Disappear_in_Peru_a_Man_Named_Lars_Farf_and_One_Other_Story_We_"
}