{
  "title": "Monique and the Mango Rains: Two Years With a Midwife in Mali",
  "description": "What is it like to live and work in a remote corner of the world and befriend a courageous midwife who breaks traditional roles?Monique and the Mango Rains: Two Years with a Mali Midwife is the inspiring story of Monique Dembele, an accidental midwife who became a legend, and Kris Holloway, the young Peace Corps volunteer who became her closest confidante. In a small village in Mali, West Africa, Monique saved lives and dispensed hope every day in a place where childbirth is a life-and-death matter and where many children are buried before they cut a tooth. Kris worked side-by-side with her as they cared for each other through sickness and tragedy and shared their innermost secrets and hopes. Monique's life was representative of many women in one of the world's poorest nations, yet she faced her challenges in extraordinary ways. Despite her fiercely traditional society and her limited education she fought for her beliefs birth control, the end of female genital mutilation, the right to receive a salary, and the right to educate her daughters. And she struggled to be with the man she loved.Her story is one of tragedy joy, rebellion, and of an ancient culture in the midst of change. It is an uplifting tribute to indomitable spirits everywhere. Monique and the Mango Rains is a fascinating voyage to an unforgettable place, a voyage spent close to the ground, immersed in village life, learning first-hand the rhythms of this world. From witnessing her first village birth to the night of Monique's own tragic death, Kris draws on her first-person experiences in Mali, her graduate studies in maternal and child health, medical and clinic records, letters and journals, as well as conversations with Monique, her family, friends and colleagues, to gives readers a unique view and a friend in West Africa.",
  "genres": [
    "Nonfiction",
    "Africa",
    "Memoir",
    "Biography",
    "Travel",
    "Mali",
    "Biography Memoir"
  ],
  "author": "Kris Holloway",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/15597.Monique_and_the_Mango_Rains"
}