{
  "title": "Faith In Faithlessness: An Anthology of Atheism",
  "description": "Asks freethinkers to declare their atheism in defiance of the stigmatization of disbelief.With the rise of religious fundamentalism worldwide and a new 'spiritualism' in North America, expressed disbelief in God or gods has become a taboo once again in the Anglo-American world. In the last few years, however, atheism has witnessed a resurgence exemplified by the best-selling works of Sam Harris, Richard Dawkins and Christopher Hitchens.Faith in Faithlessness is intended to contribute to the reassertion of the legitimacy of godlessness as a philosophical and moral stance. It is a unique anthology that presents a comprehensive selection of writings, by some of the world's most celebrated thinkers, past and present, who eloquently address the most significant questions concerning religious belief.Included are essays by Benedict de Spinoza, Diderot, Paul-Henry Thiry D'Holbach, David Hume, Thomas Paine, Percy Bysshe Shelley, John Stuart Mill, George Elliot, W.E.H. Lecky, Elizabeth Cady Stanton, Charles Bradlaugh, Anatole France, Charles Darwin, Friedrich Nietzsche, Robert G. Ingersoll, Ludwig Feuerbach, Michael Bakunin, Karl Marx, Emma Goldman, H.L. Mencken, Clarence Darrow, Carl Van Doren, Bertrand Russell, Sigmund Freud, Albert Camus, Albert Einstein, Francis Crick, Gore Vidal, Kai Nielsen, Christine Overall, Sam Harris, Richard Dawkins, Christopher Hitchens, Michel Onfray, Elizabeth Second Anderson, Tariq Ali, Salman Rushdie, Kurt Vonnegut. Also included are other celebrity atheists and a major resource guide.TABLE OF CONTENTSPREFACEINTRODUCTIONFROM THE EARLY CLASSICS1. Theologico-Political Treatise - Benedict de Spinoza2. Thoughts on Religion - Denis Diderot3. The System of Nature - Paul-Henry Thiry, Baron d'Holbach4. The Natural History of Religion - David Hume5. The Age of Reason - Thomas Paine6. A Refutation of Deism - Percy Bysshe Shelley7. Immortality - John Stuart Mill8. Evangelical Teaching - George Eliot9. The Spirit of Rationalism in Europe - W.E.H. Lecky10. The Christian Church and Women - Elizabeth Cady Stanton11. Humanity's Gain from Unbelief - Charles Bradlaugh12. Miracle - Anatole France13. Autobiography - Charles Darwin14. The Antichrist - Friedrich Nietzsche15. God and the Constitution - Robert G. Ingersoll16. The Essence of Religion in General - Ludwig Feuerbach17. God and the State - Michael Bakunin18. Contribution to the Critique of Hegel's Philosophy of Right - Karl MarxFROM THE EARLY 20TH CENTURY CLASSICS19. The Philosophy of Atheism - Emma Goldman20. On the Scopes Trial - H.L. Mencken21. The Lord's Day Alliance - Clarence Darrow22. Why I Am an Unbeliever - Clarence Darrow23. Is There a God? - Bertrand Russell24. The Claims of Theology - A.J. Ayer25. The UNbelievers and the Christians - Albert Camus26. Science and Religion - Albert EinsteinFROM THE LATER 20th CENTURY and 21st CENTURY27. Monotheism and Its Discontents - Gore Vidal28. How Is Atheism to Be Characterized? - Kai Nielsen29. Atheism - Christine Overall30. The Atheist Manifesto - Sam Harris31. Why There Almost Certainly Is No God - Richard Dawkins32. Religion as an Original Sin - Christopher Hitchens33. In the Service of the Death Fixation - Michel Onfray34. Thank Goodness! - Daniel C. Dennett35. For the Love of Reason - Louise M. Anthony36. If God Is Dead, Is Everything Permitted? - Elizabeth Second Anderson37. An Atheist Childhood - Tariq AliA Rapper's Song - Greydon Square38. Humanism and the Territory of Novelists - Salman Rushdie39. Why My Dog Is Not a Humanist - Kurt Vonnegut A New The Second Wave - Dimitrios RoussopoulosNOTES ON THE CONTRIBUTORSRESOURCE GUIDE from the Website of Richard DawkinsCREDITS AND PERMISSIONSCelebrity quotes throughout, including from George Bernard Shaw, Voltaire, Ralph Waldo Emerson, Aldous HUxley, Tennessee Williams, Charles Bukowski, Jean-Paul Sartre, Noam Chomsky, Sigmund Freud, Ingmar Bergman, Katharine Hepburn, John Malkovich, Robert Altman, Jodie Foster, Bill Gates, Angelina Jolie, Jack Nicholson, Howard Stern, Isaac Asimov, Woody Allen, Richard Leakey, James Watson, Jean Roddenberry, Gloria Steinem.DIMITRIOS ROUSSOPOULOS is author and/or editor of some eighteen books.",
  "genres": [
    "Religion",
    "Philosophy"
  ],
  "author": "Andrea T. Levy",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/1560300.Faith_In_Faithlessness"
}