{
  "title": "The Talented Mr. Ripley / Ripley Under Ground / Ripley's Game",
  "description": "Suave, agreeable, and completely amoral, Patricia Highsmith's hero, the inimitable Tom Ripley, stops at nothing--not even murder-- to accomplish his goals. In achieving for himself the opulent life that he was denied as a child, Ripley shows himself to be a master of illusion and manipulation and a disturbingly sympathetic combination of genius and psychopath. As Highsmith navigates the mesmerizing tangle of Ripley's deadly and sinister games, she turns the mystery genre inside out and takes us into the mind of a man utterly indifferent to evil. The Talented Mr. RipleyIn a chilling literary hall of mirrors, Patricia Highsmith introduces Tom Ripley. Like a hero in a latter-day Henry James novel, is sent to Italy with a commission to coax a prodigal young American back to his wealthy father. But Ripley finds himself very fond of Dickie Greenleaf. He wants to be like him--exactly like him. Suave, agreeable, and utterly amoral, Ripley stops at nothing--certainly not only one murder--to accomplish his goal. Turning the mystery form inside out, Highsmith shows the terrifying abilities afforded to a man unhindered by the concept of evil.Ripley Under GroundIn this harrowing illumination of the psychotic mind, the enviable Tom Ripley has a lovely house in the French countryside, a beautiful and very rich wife, and an art collection worthy of a connoisseur. But such a gracious life has not come easily. One inopportune inquiry, one inconvenient friend, and Ripley's world will come tumbling down--unless he takes decisive steps. In a mesmerizing novel that coolly subverts all traditional notions of literary justice, Ripley enthralls us even as we watch him perform acts of pure and unspeakable evil.Ripley's GameConnoisseur of art, harpsichord aficionado, gardener extraordinaire, and genius of improvisational murder, the inimitable Tom Ripley finds his complacency shaken when he is scorned at a posh gala. While an ordinary psychopath might repay the insult with some mild act of retribution, what Ripley has in mind is far more subtle, and infinitely more sinister. A social slight doesn't warrant murder of course-- just a chain of events that may lead to it.",
  "genres": [
    "Fiction",
    "Mystery",
    "Classics",
    "Crime",
    "Thriller",
    "Novels",
    "Literature"
  ],
  "author": "Patricia Highsmith",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/156023.The_Talented_Mr_Ripley_Ripley_Under_Ground_Ripley_s_Game"
}