{
  "title": "The Great Awakening: Defeating the Globalists and Launching the Next Great Renaissance",
  "description": "In The Great Defeating the Globalists and Launching the Next Great Renaissance, the most persecuted man on Earth, Alex Jones, gives you the good news about the failing plans of the globalists to control humanity. The expression “Get woke, go broke” has entered the common lexicon as we’ve seen company after company invoke the false gods of diversity, equity, and inclusion to their financial demise. But this surface discussion masks a much darker truth. What we are witnessing is nothing less than the failed plans of social Darwinists to capture free market capitalism and turn it toward their fascist aims of controlling and depopulating the globe. Working with New York Times bestselling author Kent Heckenlively, Jones masterfully gives you the deeper discussion about such hot button topics as the truth behind the globalists plans for artificial intelligence (AI), the central bank digital currency, social credit scores, Big Tech tyranny, censorship, fifteen-minute cities, the unholy alliance between big business and big government, the military-intelligence-industrial complex—which is hell-bent on eternal war—and the all-out assault on free speech and the Second Amendment. The good news is that these plans are destined to fail, if we wake up to the anti-human future the globalists have planned for us. The globalists hate freedom, and what they hate the most is the greatest freedom document in human history, the United States Constitution. Jones does not shy away from the darker parts of American history—the way we have been systematically deceived by the intelligence agencies since their assassination of President John F. Kennedy—but he provides example after example of people who have broken free from the matrix of lies to tell the truth. The people the globalists fear the most are the members of their own systems of control, who wake up and then decide to act against the machine. The globalists believe they’ve planned for every possible contingency, but they hadn’t counted on the conscience and love of truth, which lives in the souls of good people. St. Augustine once “The truth is like a lion; you don’t have to defend it. Let it loose; it will defend itself.” No figure in our modern times has roared louder against the enemies of freedom than Alex Jones. In the calm and dispassionate style that made his first book, The Great Reset: And the War for the World, such a smash hit, Alex lays out the flaws in the plans of the globalists and how they seek to create a world in direct opposition to God’s plans for our glorious human future. But God consistently works His will in our world, even through imperfect individuals like Donald Trump, Alex Jones, or you. If you want to read one book this year to understand your world and help lead humanity to the next great human renaissance, you need to order this book today.",
  "genres": [
    "Politics",
    "History",
    "Nonfiction",
    "Philosophy",
    "Economics"
  ],
  "author": "Alex Jones",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/156356558-the-great-awakening"
}