{
  "title": "The King of Time",
  "description": "Velimir Khlebnikov, who died in 1922 at the age of thirty-six, is one of the great, untranslated Russian poets of this century. Hailed by his contemporaries and by later writers and scholars as the creative genius behind the Russian Futurist movement, Khlebnikov is famous more for his inaccessibility than for the excellence of what he actually produced. Even Russians are generally baffled by him.Now, in a powerful American rendition, we are given access to the strange and beautiful world of Khlebnikov, \"the word's wild highwayman.\" Trained in the natural sciences and mathematics and by temperament an artist, Khlebnikov thought he had discovered the Laws of Time and Tables of Destiny, by which enlightened humans could live in harmony with themselves and with nature. He coined the terms \"Futurian\" and \"Presidents of Planet Earth\" for himself and his friends, and he devoted all of his short, restless life to finding a language appropriate to his vision. Experiments with words became magical paths to a reinvigorated future, and produced some of the most extraordinary poems in the Russian language.These goals and researches were variously embodied as well in stories, plays, and visionary essays in which Khlebnikov advances architectural plans for mobile cities, a new alphabet based on universal meanings of sounds, and communication by way of vast television networks. The result is poetry of startling originality, modernity, and linguistic virtuosity--a true challenge to translators and one that has been met brilliantly here by Paul Schmidt and Charlotte Douglas.The King of Time is a representative sampling of Khlebnikov's writings, taken from the translation of his complete works prepared under the auspices of the Dia Art Foundation. It includes many pieces, among them the full text of the astounding poem-play Zangezi, never before translated. General readers will be introduced to the legendary Khlebnikov, and cognoscenti will applaud the inventiveness of the rendering.",
  "genres": [
    "Poetry",
    "Russia",
    "Russian Literature",
    "Fiction",
    "Short Stories",
    "Literature"
  ],
  "author": "Velimir Khlebnikov",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/1564021.The_King_of_Time"
}