{
  "title": "The Proper Lady and the Woman Writer: Ideology as Style in the Works of Mary Wollstonecraft, Mary Shelley, and Jane Austen",
  "description": "\"A brilliant, original, and powerful book. . . . This is the most skillful integration of feminism and Marxist literary criticism that I know of.\" So writes critic Stephen Greenblatt about The Proper Lady and the Woman Writer , Mary Poovey's study of the struggle of three prominent writers to accommodate the artist's genius to the late eighteenth- and early nineteenth-century ideal of the modest, self-effacing \"proper lady.\" Interpreting novels, letters, journals, and political tracts in the context of cultural strictures, Poovey makes an important contribution to English social and literary history and to feminist theory.\"The proper lady was a handy concept for a developing bourgeois patriarchy, since it deprived women of worldly power, relegating them to a sanctified domestic sphere that, in complex ways, nourished and sustained the harsh 'real' world of men. With care and subtle intelligence, Poovey examines this 'guardian and nemesis of the female self' through the ways it is implicated in the style and strategies of three very different writers.\"—Rachel M. Brownstein, The Nation\" The Proper Lady and the Woman Writer is a model of . . . creative discovery, providing a well-researched, illuminating history of women writers at the turn of the nineteenth century. [Poovey] creates sociologically and psychologically persuasive accounts of the Wollstonecraft, who could never fully transcend the ideology of propriety she attacked; Shelley, who gradually assumed a mask of feminine propriety in her social and literary styles; and Austen, who was neither as critical of propriety as Wollstonecraft nor as accepting as Shelley ultimately became.\"—Deborah Kaplan, Novel",
  "genres": [
    "Nonfiction",
    "History",
    "Feminism",
    "Theory",
    "Gender Studies",
    "Womens",
    "Gender"
  ],
  "author": "Mary Poovey",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/156544.The_Proper_Lady_and_the_Woman_Writer"
}