{
  "title": "A natureza das bruxas",
  "description": "Em um mundo em que as bruxas controlam o clima, cada vez mais errático e perigoso, somente uma garota pode salvar a Terra da destruição. Mas os poderes de Clara colocam em risco mortal aqueles que ela mais ama e, conforme seus sentimentos pelo bruxo que a treina crescem, ela será forçada a escolher entre a magia, o amor e o planeta.Há séculos as bruxas mantêm o clima sob controle, seus poderes atingindo ápice durante a estação em que nasceram. Mas conforme as mudanças climáticas tornam a atmosfera mais errática, manter o controle fica cada vez mais difícil – e é aí que entra Clara Densmore, uma rara bruxa atemporal cuja magia se conecta a todas as estações.No outono, Clara está cansada de sua magia, que, imprevisível, ameaça a vida de quem ela mais ama. Apesar da necessidade crescente de alguém que possa controlar eventos climáticos cada vez mais perigosos, o plano de Clara é usar o eclipse solar para se livrar de sua magia para sempre.No inverno, o mundo está à beira do caos. Incêndios florestais e tempestades violentas convencem Clara de que ela é a única que pode evitar mais desastres.Na primavera, ela se aproxima de Sang, um bruxo vindo de outra escola que está ajudando-a em seu treinamento. Conforme os poderes dela se fortalecem, o mesmo acontece com seus sentimentos, e Clara teme que Sang torne-se a próxima vítima de sua magia.No verão, Clara precisa escolher entre seu poder e sua felicidade, seu dever e seus entes queridos… antes que perca tudo.Um apaixonante romance de estreia, A natureza das bruxas é uma história sobre uma mulher poderosa que deve decidir se usar sua magia volátil para ajudar o mundo vale o preço de abrir mão da pessoa que mais ama.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Witches",
    "Romance",
    "Fiction",
    "Magic",
    "Paranormal"
  ],
  "author": "Rachel  Griffin",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/156599612-a-natureza-das-bruxas"
}