{
  "title": "The Portable Atheist: Essential Readings for the Nonbeliever",
  "description": "«Οι οπαδοί των νεράιδων δεν χτυπάνε την πόρτα σου για να σε προσηλυτίσουν. Δεν απαιτούν να διδάσκεται η ψευτοεπιστήμη τους στα σχολεία. Δεν καταδικάζουν σε θάνατο οπαδούς άλλων νεράιδων. Δεν ισχυρίζονται ότι οι ηθικοί κανόνες βγαίνουν από τις τελετές των νεράιδων και ότι χωρίς νεράιδες θα είχαμε συνουσίες στους δρόμους και την κατάργηση της ατομικής ιδιοκτησίας. Δεν λένε ότι οι νεράιδες έφτιαξαν τον κόσμο και ως εκ τούτου πρέπει να κλείνουμε το γόνυ στον Μεγάλο Αδελφό των νεράιδων. Δεν λένε ότι η νεράιδα θα σε διατάξει να σκοτώσεις την αδελφή σου αν κυκλοφορεί στο δρόμο με κάποιον που δεν είναι ο αδελφός της.Νομίζω λοιπόν ότι ισχύει αυτό που ο ποιητής Σέλεϋ αποκαλούσε αναγκαιότητα του αθεϊσμού. Αργά ή γρήγορα θα πρέπει να πάρεις θέση. Είτε αποδίδεις την παρουσία σου εδώ στους νόμους της βιολογίας και της φυσικής είτε την αποδίδεις σε ένα θείο σχέδιο. (Μπορείς να διακρίνεις τον φίλο από τον εχθρό από το πώς απαντούν σε αυτό το αναπόδραστο ερώτημα και από το πώς αντιμετωπίζουν τις επιπτώσεις του.) Κι ωστόσο, όπως και οι πιστοί, άπαξ και αποφασίσουμε, έχουμε ακόμη πολλή δουλειά μπροστά μας.»Ο Κρίστοφερ Χίτσενς, που πέθανε τον Δεκέμβρη του 2011, μας οδηγεί μες από την αγνωστικιστική και αντιθρησκευτική σκέψη πολλών αιώνων. Ο τόμος περιλαμβάνει 45 κείμενα που συνιστούν τον κανόνα του αθεϊσμού. Από τον Λουκρήτιο στον Ντέιβιντ Χιουμ, από τον Τόμας Χομπς και τον Σπινόζα ως τον Σέλλεϋ και τον Καρλ Μαρξ, και από τον Δαρβίνο και τον Φρόυντ ως τους νεότερους και σύγχρονους μαχητικούς συνήγορους του αθεϊσμού, τον Ρίτσαρντ Ντώκινς, τον Ντάνιελ Ντένετ, τον Μάικλ Σέρμερ, τον Σαμ Χάρις, τον Ίαν Μακιούαν, και πολλούς άλλους. Τα διαφωτιστικά όσο και απολαυστικά κείμενα της ανθολογίας, εμπλουτισμένα με τα εξαιρετικά σχόλια του Κρίστοφερ Χίτσενς, ενδιαφέρουν όχι μόνο τον άθεο, τον αγνωστικιστή και τον πανθεϊστή, αλλά διεγείρουν την περιέργεια ακόμη και του μονοθεϊστή αναγνώστη.",
  "genres": [
    "Nonfiction",
    "Philosophy",
    "Atheism",
    "Science",
    "Essays",
    "History",
    "Sociology"
  ],
  "author": "Christopher Hitchens",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/1566053.The_Portable_Atheist"
}