{
  "title": "What I Wish I Said: Confessions of a Columnist",
  "description": "Just as they do on those television cooking contests when the bell rings and the contestants’ hands go up, at four o’clock on Friday afternoon, the column is filed—ready or not—to the columnist’s horror, discomfort, or self-satisfaction. Regardless, one exigent and unrelenting thought what you wish you’d said. Such is the life of a weekly newspaper columnist. Unable to ignore the urge any longer, in What I Wish I Confessions of a Columnist, author Jaime Watt has collected forty-eight of his most eye-opening, illuminating, and provocative Toronto Star columns and with humour, candour, and wit, he’s responded to each with what he wishes he’d said. The collection also features contributions from former senator and columnist André Pratte and from journalist and former editor-in-chief of the Toronto Star Michael Cooke. Widely regarded as Canada’s leading high-stakes communications strategist and the architect of groundbreaking campaigns that transformed politics with their boldness and creativity, Watt brings his insight to bear on some of the most vexing and consequential issues in Canadian life by reappraising his past work. Across six topical subject areas—civil liberties and human rights, portraits of leaders, the Liberal Party in power, the Conservative Party in opposition, the Donald Trump presidency, and the COVID-19 crisis—this subtle yet accessible collection offers a distinctive look at recent times. Whether he got it right or wrong, Watt pulls no punches when it comes to critiquing—and at times lambasting—his past columns. Revisiting his best and worst takes, Watt and his co-author Breen Wilkinson look at what might have been said in the columns he has been writing for more than seven years. And as he does, Watt challenges with new perspectives and ideas, inviting readers to consider what they wish they might have said, to consider how their points of views, and even their values, may have changed with time.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Jaime Watt",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/156699837-what-i-wish-i-said"
}