{
  "title": "The Friends of Meager Fortune",
  "description": "Growing up in a prominent lumber family in the Miramichi, brothers Will and Owen Jameson know little of the world beyond their town and the great men who work the forest, including their father. But as young men, the boys couldn’t be more different — where seventeen-year-old Will is headstrong and rugged, able to hold his own in the woods or in a fight, Owen, three years his junior, is literary and sensitive. What worries their mother Mary, however, is the prophecy told to her by a local woman upon Will’s “that her first-born would be a powerful man and have much respect — but his brother would be even greater, yet destroy the legacy by rashness, and the Jameson dynasty [would] not go beyond that second boy.” She tries to laugh it off, but the prophecy becomes a part of local legend and hangs over the heads of the boys like a dark cloud.When their father dies in a freak accident and the management of the Jameson tracts and company falters, Will, as the true inheritor of his father’s “shrewd mind and fists to match,” quits school to take over. He’s a strong leader of men, but perhaps too strong at times, and dies while clearing a log jam during a run. Reggie Glidden, Will’s best friend and the Push of the Jameson team, takes Owen under his wing, searching for any small sign that the younger boy has his brother’s qualities. But Owen knows his limitations and, after his brother’s death and then rejection by the girl of his dreams, Lula Brower, he joins the army and heads off to war hoping to get himself killed. Instead, he returns a decorated war hero.Then he falls in love with the beautiful, childlike Camellia — the wife of Reggie Glidden — and soon Owen and Camellia find themselves watched on all sides, caught in the teeth of an entire town’s gossip and hypocrisy despite the innocence of their relationship. But for the community, it’s as if taking Owen Jameson — and therefore the whole Jameson family — down a peg or two will give them control over their changing world. Inexorably, Owen and Camellia are pulled into a chain of events that will end with death, disappearance, and a sensational trial.At the same time, realizing his destiny, Owen takes over the family business and begins what will become the greatest cut in New Brunswick history, his men setting up camp on the notoriously dangerous Good Friday Mountain. The teamsters spend months in fierce ice and snow, daily pitting themselves against nature and risking their lives for scant reward, in the last moments before the coming of mechanization that will make them obsolete. This heroic, brutal life is all Meager Fortune, the camp keeper, knows. A good and innocent man, he shows unexpected resolution in the face of the betrayals of the more worldly men around him.With The Friends of Meager Fortune , award-winning author David Adams Richards continues his exploration of New Brunswick’s Miramichi Valley, both the hard lives and experiences that emerge from that particular soil and the universal human matters that concern us the work of the hands and the heart; the nature of true greatness and true weakness; the relentlessness of fate and the good and evil that men and women do. It is a devastating portrait of a society, but it is also a brilliant commemoration of the passing of a world — one that cements David Adams Richards’ place as the finest novelist at work in Canada today.From the Hardcover edition.",
  "genres": [
    "Fiction",
    "Canada",
    "Historical Fiction",
    "Canadian Literature",
    "Novels",
    "Book Club",
    "Romance"
  ],
  "author": "David Adams Richards",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/1568640.The_Friends_of_Meager_Fortune"
}