{
  "title": "The Mystery of Marriage: Meditations on the Miracle",
  "description": "Meditate on the Spiritual Significance of MarriageIn the 20th Anniversary Edition of this Gold Medallion Award winner, Mike Mason goes on a poetic search to understand the wondrous dynamics of committed love. In highly readable, first-person style, Mason’s writing stimulates readers’ thoughts and prayers and propels couples to deeper intimacy. “A marriage is not a joining of two worlds,” says the author, “but an abandoning of two worlds in order that one new one might be formed.” Rich chapters on “Otherness,” “Vows,” “Intimacy,” “Sex,” “Submission,” and an all-new chapter on “Oneness” lift readers to view the eternal, spiritual nature of this faith-filled, “impossible,” wild—yet wonderful—frontier.“An outstanding achievement. Rarely has a book aroused in me so much enthusiasm as has the combination of wisdom, depth, dignity, and glow that I find in these chapters.”-J.I. Packer“Absolutely exquisite. It reaches down deep into our innermost being, revealing, revitalizing, rewarding. A real classic.”-Gigi Graham Tchividjian“A drop everything book. Mason deals with the stunning paradoxes of the mystery, the problems, and the glories of marriage. I don’t need to read any other book on the subject.”-Elisabeth ElliotStory Behind the Book\"Over the twenty years since its publication, many couples have told me that they’ve read my book aloud to each other. This always amazes me and gives me great joy. I’m also amazed that many single people have read it. Either way, my goal is for hearts to be warmed by the mystery of divine love. I want couples to enter into deeper intimacy by thinking together about the mystery of marriage —about how their love, besides being a gift of God, reflects the very love He has for Himself in the Trinity. For God is not a bachelor, and throughout the Bible marriage is a supreme picture of the nature of God’s love and of His kingdom. I want people who read my book to feel so soaked in these wonderful, divine mysteries that it deepens their reverence for marriage and inspires them to greater love.\"  -Mike Mason",
  "genres": [
    "Marriage",
    "Nonfiction",
    "Christian",
    "Christianity",
    "Relationships",
    "Christian Living",
    "Theology"
  ],
  "author": "Mike Mason",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/156886.The_Mystery_of_Marriage"
}