{
  "title": "The Silver Metal Lover",
  "description": "Mother, I am in love with a robot.No. She isn't going to like that.Mother, I am in love.Are you, darling?Oh, yes, Mother, yes I am. His hair is auburn, and his eyes are very large. Like amber. And his skin is silver.Silence.Mother. I'm in love.With whom, dear?His name is Silver.How metallic.Yes. It stands for Silver Ionized Locomotive Verisimulated Electronic Robot.Silence. Silence. Silence.Mother....It is a world of the future, where beauty is available to all, given the sophistication of technology and medicine. Yet Jane is - well, surely pleasant-enough-looking, with her soft brown hair and slightly plump body. Years back, when Jane was tiny, her beautiful, wealthy mother had her analyzed for perfect body type, and now cosmetic medications keep her true to form. And she questions little. After all, her mother has so much authority, so many opinions, that there's nothing for Jane to say.And Jane's lovers are largely in her mind - men from films she's seen, from books she's read. The thought of confronting a flesh-and-blood lover makes Jane grow cold. What would she say to him? What would he think of plain Jane?Until she meets Silver, a singer and guitarist. And a robot - with all the adoration and compassion that in-the-flesh lovers lack.But, unlike human lovers, Silver is for sale, and Jane - desperate for his love - risks estrangement from her mother and friends to possess him. With Silver as her partner, she tastes the first happiness and independence she has ever known. She even grows pretty, as she stops taking the pills and treatments her mother had ordered for her.Yet - what would you do if the manufacturer decided to recall the particular model of lover you'd bought?A startling romance of the future by the author of Sometimes, After Sunset and Electric Forest.",
  "genres": [
    "Science Fiction",
    "Fantasy",
    "Romance",
    "Fiction",
    "Young Adult",
    "Robots",
    "Dystopia"
  ],
  "author": "Tanith Lee",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/1569280.The_Silver_Metal_Lover"
}