{
  "title": "The Secret Books of Paradys I & II",
  "description": "2-in-1 edition, 401 pagesThe Book of the Damned, c. 1988 (0879514086)The Book of the Beast, c. 1988 (0879514175)The strange and the tormented dwell in Paradys - prowling its dark streets and twisted alleyways, passing the endless hours in the city's elegant mansions and smoke-tarnished inns, wandering in moldering graveyards and the stark surrounding countryside. For the land here is bound by a timeless, soul-chilling magic, and that power has cast its spell over all who have ever lived in this foreboding and dangerous place.So come to Paradys, and witness that city's life and history through the eyes of its provocative and perverse citizens - a darkly fascinating odyssey as only World Fantasy Award winner Tanith Lee could imagine it.Journey back to an era of opulent salons and hopeless duels without honor - a time when it is fashionable among the idle rich to dabble in the occult. But in the case of one troubled man, such dabblings awaken an obsessive love for a mistress of seductive terror - a being who may well prove capable of draining his talent, his lifeblood, his very essence away ...Venture into a medieval Paradys held siege by the plague - a city wherein a young woman, betrayed by her own family, is forced to face perils far more horrifying than the dread disease. For after all, the plague only claims its victims' lives ...Enter the city of today and meet a writer who is lured to a fateful assignation with a man pursued by Death's dark shadow - only to find herself trapped by a sorcery as ancient and mutable as Egypt's ever-shifting sands;Then travel back to the earliest days of Paradys and the Roman occupation, when the gift of a mysterious Assyrian amulet - the origins of which had been long lost even then - marks a family for doom. For the curse of the amulet follows them down through the generations, destroying not only those in the direct line, but all who are brave enough, or foolish enough, to love them ...Includes The Book of the Damned (three novellas) and The Book the Beast (a novel).",
  "genres": [
    "Fantasy",
    "Horror",
    "Fiction",
    "Dark Fantasy",
    "Science Fiction Fantasy",
    "Novels",
    "Unfinished"
  ],
  "author": "Tanith Lee",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/1569322.The_Secret_Books_of_Paradys_I_II"
}