{
  "title": "The Master of Whitehall - Katelyn's Chronicles",
  "description": "After the brutal murder of her parents in a robbery, Katelyn Corbin, a thoroughly modern 21 year old college senior, finds herself attempting to re-start her life in Charleston, SC, where she finds love, healing and a brand new life in a most unexpected avenue. This story follows Katelyn from her hometown just outside Atlanta to her new school in Charleston. There she meets James and is deeply intrigued by him from their first meeting; feeling as if he has touched her very soul. The more she considers him, the more intense her interest becomes. He is a wealthy patron of the arts, especially at her school. He is tall and handsome with a strong persona; a young widower, living alone in a huge, but beautifully restored old plantation house called 'Whitehall'. Their friendship soon becomes serious, becoming a full on relationship as Katelyn falls madly in love with him. James soon makes his love for her just as obvious. Their lives begin to blend, twisting and turning, as they continue to grow closer. After several strange incidents, Katelyn begins to develop a series of unsettling questions about her new love. However, she knows that after facing the catastrophe of her parent’s deaths, she can face anything life throws at her. She begins looking at the questions, searching her own soul. Finally deciding that she must know the answers, she confronts him. She soon discovers James' true nature; confirming her fears that he was indeed not the man she thought, but the man she feared him to be. The confirmation of her suspicions are shocking to her, turning her world view on its side. She is forced to acknowledge things about herself and her world that she never thought possible. With her new found knowledge, Katelyn realizes she must make a choice to live with or without James. She quickly decides to adapt her life and adjust her beliefs in order to continue to be with James. Their love for each other develops and continues to grow as he assists her to close the gaping wounds left by the tragedy of her parent’s murders. Katelyn continues to uncover other secrets, discovering another existence, as she begins her new life with James. The story reaches a highly emotional and completely unexpected ending that fully illustrates Katelyn's personality of love and care for those around her. The Master of Whitehall, a paranormal romance novel is complete at 104,000 words. The story unfolds over the course of nearly a year, and features flashbacks that more fully develop each of the characters, offering insights into their personal histories. The story is narrated in first person perspective by Katelyn as she offers a window into the world of possibilities of love between mortal and immortal. The Master of Whitehall will be very appealing to readers of Rachel Caine's 'Morganville Vampires', Charlaine Harris’ ‘True Blood’ series, and Anne Rice's 'Vampire Chronicles'.",
  "genres": [
    "Vampires",
    "Young Adult",
    "Romance",
    "Paranormal"
  ],
  "author": "Rick H. Veal",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/15698483-the-master-of-whitehall---katelyn-s-chronicles"
}