{
  "title": "Fr. Gabriele Amorth: The Official Biography of the Pope's Exorcist",
  "description": "“Among men, a special role is played by exorcists. They are like the tips of diamonds in this army that counters evil with good. They are priests chosen to drive out the extraordinary presence of Satan and his army.”—Fr. Gabrielle AmorthWhen Fr. Gabriele Amorth passed away on September 16, 2016 at the age of ninety, he had given everything to Christ and His Church. He performed as many as twelve exorcisms in a day. He faithfully served sixty-nine years in the Pauline religious order, sixty-two as a priest, and thirty years as the pope’s exorcist.In this official biography, Father Amorth’s extraordinary life is revealed for the first time in English. In these pages, you will learn about a humble priest who initially refused the appointment of exorcist. You will discover how this spiritual son of Saint Padre Pio trained to be an exorcist and the details of his first exorcism. How he single handedly spearheaded the consecration of Italy to the Immaculate Heart of Mary. He later founded what became the International Association of Exorcists (IAE), the only organization of its kind recognized by the Church.Father Amorth once said about exorcisms, “The battle can last for hours. And it almost never ends with deliverance. It takes years to free a possessed person. Many years. Satan is difficult to defeat.”Although the world knows him only as an exorcist, he was so much more. His profound prayer life, his simplicity, his love for poverty, his sense of humor, his fearlessness, his friendship with many saints, and his esteemed love for Our Lady set him apart. Because of Our Lady’s protection, he once declared, “I always say that it is the devil who is afraid of me.”Everyone is called to do battle with devil, but only few people are given the power over the demons. And “despite the fatigue, disappointments, and losses, he would never retreat from the enemy.” Here, you will find the remarkable story of the most renowned exorcist of the last century, a warrior for Christ. “Those who knew him, already consider him a saint.”",
  "genres": [],
  "author": "Domenico  Agasso",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/156990007-fr-gabriele-amorth"
}