{
  "title": "Ghost Platoon: 39 Australian Soldiers, Vietnam, 1969 The Army Denied They Existed What Were They Trying to Hide?",
  "description": "Thirty-nine years ago an Australian Army Platoon saw action in Vietnam. Years later, the army said they didn't exist. What secrets were they trying to hide?For 39 years the Australian Defense Force strenuously denied a unit called the 2nd Defense and Employment Platoon existed during the Vietnam War.The platoon was a makeshift rapid deployment force of 38 men, all regular troops, based at the Australian Task Force Headquarters at Nui Dat in 1969 from late April to June.The ragtag unit was thrown together with diggers left behind in Vietnam when their regiment returned to Australia. It was so slapdash it didn't even have an officer or sergeant in charge.But a rugged ex-Royal Marine, Jim Riddle, stepped forward to take the lead. When the platoon was thrown into one of the biggest firefights of the Vietnam War against hundreds of enemy, Riddle proved his leadership, bringing all his men through unscathed and leaving the battlefield littered with enemy bodies.It was a highly successful operation, but immediately afterwards Riddle's platoon was mysteriously disbanded, the team broken up and scattered throughout the army. There were no official records. It was as though the platoon never existed. It was a Ghost Platoon. Something happened at that ambush that compelled the army to bury the platoon's existence, and the secrets that went with it.Three decades later the men of the platoon set out to prove their unit had existed. They ran into bureaucratic brick walls and official denials from the top brass and official historians. What's more, the army strongly denied darker deeds done after the fighting, deeds which some of the men allege were war crime atrocities.This is the story of the men of the Ghost Platoon.",
  "genres": [
    "Military Fiction",
    "Nonfiction",
    "War"
  ],
  "author": "Frank Walker",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/15699736-ghost-platoon"
}