{
  "title": "The Mountairy Rock City Chronicles",
  "description": "Mountairy Rock… …a modern city with an ancient soul. A city where goliath trees dwarf the skyscrapers, hidden packs of werewolves roam the rooftops, covert witches practice their crafts and a leviathan of a Demon secretly builds its own army of crazed worshipers. Life had finally started to come together for Max Madigan. This was going to be the year that would see him finally earn his Doctorate, start his career and hopefully kick his long dormant love life back into gear. But as the New Year starts there’s a grisly massacre at Haley Museum. In the after math Max stumbles across the Stone At first glance the small engraved stone seemed to be nothing more than a bit of debris from the night’s violence. Yet the path that his life had been traveling down has been irrevocably changed just by picking it up and the cult responsible for the murders now knows that it’s in his possession. Their members are crazed, maniacal and in some cases; serpent eyed and fang toothed.  Fortunately the mysterious Stone seems to be in tune with his peril. It fills him with its power granting him the incredible strength, speed, and heightened senses of a feral animal. The mystical energy is just enough to keep Max half a step ahead of the cult. But the Stones power attracts an ever growing galley of enemies and allies; a flame haired vixen from an isolated section of Mountairy Rock and a mercurial witch, have taken a keen interest in both the Stone and Max himself. They serve as a guides to the side of Mountairy Rock that he’s never seen. They warn him of its dangers, of the Serpent Cult… and of the Demon. Though it’s the members of the Cult that will fight, kill, and die if necessary in their worship, Max must eventually deal with the Demon that is intent on possessing the Stone. Beset on all sides by danger the stage is set for the ultimate face-off between the Demon and an exhausted and beaten Max in the back alleys of Mountairy Rock.",
  "genres": [],
  "author": "Howard Night",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/15700291-the-mountairy-rock-city-chronicles"
}