{
  "title": "Kind of Kin",
  "description": "A richly comic yet heartfelt novel about people who want to do right and still do wrong, and people who do right in spite of themselves, as they try to help, protect, and provide for those they love most when a draconian new state law threatens an ordinary American family and throws a close-knit community into turmoil.All of Cedar, Oklahoma, is shocked when Bible-believing Bob Brown and his friend, Pastor Jesus Garcia, are tossed in the county jail for hiding a barn-full of Mexicans. Thanks to an ambitious blonde state legislator and her politically shrewd husband, it's a felony to harbor an undocumented immigrant in the Sooner State.It's bad enough that her Christian daddy is a felon, but now John Brown refuses to defend himself, creating a mess of trouble for his daughter, Sweet. She's got enough on her hands caring for her husband's bedridden elderly great-grandfather, and trying to keep her son, Carl Albert in line. Now, she's got her ten-year-old nephew Dustin to worry about, too. A quiet and thoughtful boy, Dustin hasn't had it easy. His mother is dead, his older sister Misty Dawn is looking for her recently deported husband, and Carl Albert beats up on him. Sweet is trying to hold it all together, but the more she tries to fix things, the faster her life unravels. When Dustin disappears and Misty Dawn shows up with needs of her own, Sweet's sense of guilt and responsibility drive her to desperate actions that test her family, friends, and neighbors in unexpected and revealing ways.A story of self-serving lawmakers and complicated lawbreakers, Christian principle and political scapegoating, Rilla Askew's funny and poignant novel explores what happens when upstanding people are pushed too far-and how an ad-hoc family, and ultimately, an entire town, will unite to protect its own.",
  "genres": [
    "Fiction",
    "Book Club",
    "Contemporary",
    "Family",
    "Religion",
    "Literary Fiction",
    "Literature"
  ],
  "author": "Rilla Askew",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/15700403-kind-of-kin"
}