{
  "title": "Laura Meets Jeffrey: Both Sides of an Erotic Memoir",
  "description": "LAURA MEETS JEFFREY while she’s working in an upscale New York City brothel in 1980 and they share an apocalyptic moment. It’s love at first orgasm. And so begins their double lives in a real life version of Fifty Shades Of Grey.LAURA MEETS JEFFREY is a love story, a name-dropping, hilarious, shameless erotic cyclone, a documentary of the excesses, dangers and extreme edges of sex, drugs, rock ‘n’ roll, and a close-up personal history of sexual liberation’s primetime. At dinner parties she’s known as a witty lingerie model and jewelry artisan, and a famous film director’s ex-lover. He’s her media wizard boyfriend, a designer discovered by John Lennon who worked for John & Yoko, Apple Records and the Rolling Stones, and then created Puritan, the world’s largest-selling explicit sex magazine. On weekends he boxes with Ryan O’Neal and Jose Torres. And at night, in the erotic demimondes of New York, Miami and LA, Laura and Jeffrey romp through waves of drugs and lascivious exploration and dive into S&M, porn star threesomes, orgies, glory holes and sex clubs as our unquenchable libidomaniacs fulfill their wildest fantasies.The late Norman Mailer wrote the Foreword to LAURA MEETS JEFFREY and considered his famous interview with Jeffrey and Laura on “Ethics and Pornography,” excerpted as a bonus chapter in this book, one of the best of the more than 600 he gave in his lifetime. Besides bequeathing the Foreword, Mailer gave guidance to this account of two lovers, who missed none of the wild era just before the door slammed shut on sexual freedom and aren’t afraid to reveal all of it. Introduction by legendary punk journalist Legs McNeil.",
  "genres": [
    "BDSM",
    "Erotica",
    "Menage",
    "Nonfiction",
    "Romance",
    "Contemporary",
    "Memoir"
  ],
  "author": "Jeffrey Michelson",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/15701081-laura-meets-jeffrey"
}