{
  "title": "from the farther side of beyond",
  "description": "\"from the farther side of beyond (a collection of novellas to keep you up at night),” is a book of thrillers by Peggy Randall-Martin, author of \"So Far Behind.” You asked for a collection of her works and she was listening. This book includes one true life experience and six of her favorite tales that will take you to the edge and teeter on the razor-thin line between what is real and that unknown place inside us where fear thrives and curls ready to strike.\"A Good Sleep 4 Murder,\" is the story of Adam Duncan who will stop at nothing to get what he wants. During the final days of his marriage, he developed a mind-bending plan to save his matrimonial union. If it works who will save his wife from him? And when will it spread to a home near you?\"Abilene, Sweet, Sweet, Abilene,\" I tell you this story now because the people who lived it are all dead; anyway that's what I'm told. My hope is that this resurrection will be the nemesis needed to call those memories forth because then and only then, will I be able to rest.\"Are You Scared Yet?\" When O'Neal Bradley discovered the body of her best friend, she didn't know her name was next on the killer's list. And she couldn't have known that her home was the looking glass through which the killer could place her in the cross-hairs of a sniper rifle and watch every move she made. Her life was no longer her own and she hid in the only place available - in plain sight.\"Backside of the Mirror,\" When Whitley Wickingham received notice of her grandmother's death, she traveled to Wickingham Farm. The day after her arrival she discovered an antique mirror in the attic. It was her plan to move it downstairs that disturbed the order of things in the old house and the definition of normal took on a whole new meaning. Nothing was as it seemed and no one appeared to be who they said they were. Whitley had no idea of the terror that lay in wait. In her worst nightmare she would never have danced so closely to insanity and she would've awakened before sheer evil forced her to run for her life. But this wasn't a night terror and she would try to go without sleep for fear when she closed her eyes it would be for the last time.\"Death Takes a Highway,\" Have you heard the old saying, \"Be careful. You could wake up in the morning and find yourself dead?\" Sounds preposterous, right? What if you went out for a nice dinner at your favorite haunt and no one recognized you? And the conversation at the table next to yours was filled with rumors and innuendos that you were seen in places unknown to you. Would you blow it off as a series of crazy coincidences or launch a search for absolutes? But all roads don't lead home so plan your travel carefully because when death takes a highway the consequences could leave you dying to know the truth.\"So Far Behind,\" In a place, condition, or time previously passed or departed from... Anna-Jake Constan grew up in her parent's little house on Maple Street in Garner's Rest, Oklahoma. Her younger siblings moved away right after high school and never returned until the day of their papa's funeral. At 38 years old Anna-Jake resided there alone, and the horrifying events that took place in the house one dark frozen winter night are what the locals called, \"the happening.\" They said it was the coldest day in hell...“For Whom The Phone Rings,” is based on a true life event, late 1999, in this author’s life. The occurrence puzzles her to this day and no one has been able to offer a viable explanation. If it happened to you, would you have answered the phone? (Not sold independently of this collection.) \"denoting events or phenomena beyond the scope of normal scientific understanding/explanation.\"",
  "genres": [],
  "author": "Peggy Randall-Martin",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/15701236-from-the-farther-side-of-beyond"
}