{
  "title": "Who's Your Daddy, Baby?",
  "description": "Who's Your Daddy, Baby? is a quirky paternity mystery with a Facebook twist. Inspired by the author's experience, it is the story of Lori Pomay, a happily married career woman living in suburban Washington, D.C.  Lori undergoes genetic testing for in vitro fertilization and her world is rocked when she is told the dad she always knew could not possibly have been her biological father.  This mid-life shocker sends her into an alternately hilarious, heartwarming, and heartbreaking search for truth about her heritage - from Appalachian Cherokees to a Purple King, with high-rolling gamblers, car dealers, dentists, and all manner of older, confused amnesiacs along for the ride.  It's a mystery which should appeal to those searching for their roots, with DNA testing foibles and myths of history exposed.With Lori's mother having died in the 1990s, taking many of the answers to her questions with her, the situation was rife with miscalculations.  Initially, the protagonist Lori McGuire Pomay's only clues to a prospective unknown biological father's identity are memories of her late mother discussing pre-marital dating in the mountains of southwestern Virginia, and faded old letters from several paternal contenders, written around the time of her conception in the apparently swinging spring of 1958.  The hunt eventually involves possibly ten paternal prospects; their families and friends; the membership of two churches; the high-rolling gambler ex-husband of a famous Hollywood actress; two families of car dealers; several free-spirited road trips around Virginia, and numerous humorous telephone calls and e-mails. It all boils down to timing and opportunity.  Lori learns more than she ever wanted to know about the vagaries of female fertility, the fallibility of half-siblingship DNA testing, problems with blood type testing/mutations, the impact of several genetic mutations - and her late mother's courtships.  Readers learn more than they might have known about Appalachian heritage, northern European ethnicity, inbreeding, sex and Rock n' Roll in the 1950s, the bonds of motherhood, and the nature of paternity.  Throw in the onset of a puzzling hereditary vertigo condition set off by hormone injections, plus a trip to the hospital for chest pains, and Who's Your Daddy, Baby? will leave your head spinning. It's a magical mystery tour and \"Who Done It\" classic maybe only a mother could create, and as Paul McCartney might say, the answer to which maybe only your mother should know.  Then again, there's the possibility medical testing mistakes might be fueling this comedy of errors, but, whatever the answer, Lori's world is forever changed by the journey.",
  "genres": [
    "Fiction"
  ],
  "author": "Lisa Pell",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/15702541-who-s-your-daddy-baby"
}