{
  "title": "رائحة مولانا",
  "description": "الرواية هى أول كتاب ينشر للكاتب بعد مجموعة من القصص القصيرة فى المجلات الثقافية عبر الأربعة أعوام الماضية , الرواية تمت كتابتها فى الفترة من أغسطس 2008 إلى أكتوبر 2010 , وتمت قبل الثورة بشهور , وبتناقش صناعة الديكتاتوريات وانهزامها وإعادة صناعتها فى شكل فانتازياصيف 2008, الساحل الشمالى الشمس تتعامد على سطح الورقة, لم أتصور وأنا أكتب السطر الأول لروايتى أن مصر مؤهلة للثورة ضد حكامها, شغلتنى أفكار عن فن صناعة الديكتاتور,خلعت ملابسى وغسلت أفكارى بين الأمواج25 يناير 2011, شارع القصر العينى على الرغم من أن القاعدة الأولى التى يتعلمها كل طفل هى ألا يعبث مع مولانا, إلا أن هناك دائما من يخالفها.11فبراير 2011, ميدان التحرير أنهيت كتابة السطر الأخير منذ شهور, الجموع تتدافع داخل الميدان, يقطع فيض بهجتى سؤال, هل ماتت الديكتاتورية, وهل ماتت روايتى؟نوفمبر 2011, شارع محمد محمود أوقن من العود الأبدى للواقع, ومن الصراع الطويل بين عبيد الديكتاتوريات وهادميها, ومن أن قصة مولانا لا تنتهى, ومثلها روايتى.مارس 2012, مكان ما, أو كل مكان الثورة مستمرةمقالات عن الرواية :http://alhayat.com/Details/438758http://octobermag.com/issues/1873/art...http://shorouknews.com/news/view.aspx...http://www.cairo360.com/arabic/articl...منافذ البيع :مكتبة المعرض الدائم : 1194 كورنيش النيل - رملة بولاقمكتبة مركز الكتاب الدولى : 30 شارع 26 يوليومكتبة 26 يوليو : 19 شارع 26 يوليومكتبة شريف : 36 شارع سريف - وسط البلدمكتبة عرابى : 5 ميدان عرابى - التوفيقيةمكتبة الحسين : مدخل 2 الباب الأخضر - الحسينمكتبة المبتديان : 13ش المبتديان - السيدة زينبمكتبة 15 مايو : مدينة 15 مايو - خلف مبنى الجهاز بحلوانمكتبة الجيزة : 1 ش مرادمكتبة ج. القاهرة : خلف كلية إعلاممكتبة رادوبيس : ش الهرم - مبنى سينما رادوبيسمكتبة أكاديمية الفنون : شزجمال الدين الأفغانى - محطة المساحة - الهرممكتبة الاسكندرية : 49 ش سعد زغلولمكتبة بورفؤاد : بجوار مدخل الجامعة - ناصية ش11 , 14مكتبة طنطا : ميدان الساعة - عمارة سينما أميرمكتبة المنصورة : 5 ش السكة الجديدةمكتبة طلعت سلامة : الزقازيق - ميدان التحرير",
  "genres": [],
  "author": "أحمد عبد المنعم رمضان",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/15702836"
}