{
  "title": "Power to the Max",
  "description": "If you’re a fan of Bella Andre, Lora Leigh, Janet Evanovich, Mary Janice Davidson, Charlaine Harris, and Laurell K. Hamilton, get ready for Max Starr!Thirty-something, down-on-her-luck accountant Max Starr has the unfortunate gift of being psychic, a newly-discovered wrinkle in her already messed-up life. Her husband, Cameron, is dead, killed in a botched 7-11 robbery two years ago. In her grief, Max has cut herself off from friends, moved out of her San Francisco home in favor of a studio apartment, and dumped her flourishing career as a CPA to do temp work.Now Max has developed an annoying penchant for attracting the spirits of murdered women. Okay, they possess her. And to exorcize them, Max must unmask their killers. But how?! By stepping into the void their deaths created, taking their jobs, befriending the loved ones they left behind. Max goes wherever she has to go and does whatever she has to do.In Max’s latest Lance La Russa had a thirst for power, exotic tastes, and the money to pay for both. Angela Rocket, the beautiful, quirky call girl willing to fulfill his every fantasy, was the last person to see him alive. And the prime suspect.To solve the crime, Max Starr must enter the world of sex for hire, much to the chagrin of her ghostly late husband Cameron and sort-of boyfriend homicide detective Witt Long. She’ll need all her psychic skills to save Angela from going to prison for a crime Max is sure she didn’t commit. Max also has a new challenge. Can she find the real murderer without being possessed by the murdered man’s spirit?And the scariest thing of all? Witt’s Mom Ladybird Long wants to help do the detecting![Previously published in 2004]*** contains explicit material ***",
  "genres": [
    "Romance",
    "Ghosts",
    "Paranormal",
    "Contemporary Romance",
    "Mystery"
  ],
  "author": "Jasmine Haynes",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/10538369-power-to-the-max"
}