{
  "title": "A Gathering of Storms",
  "description": "\"Where is she?” he asked, and Mother Nature gave his words emphasis as lightning lit up the windows and cast tree limb shadows across our faces. We were two pale figures in a blue sea, and we swam through shadows.I knew where he could find her, always in the same place, and I believe he knew I knew, but I would never admit it. I sat and stared into his big brown puppy dog eyes, so lost and confused. A man, but you could still see the child through the wispy brown locks, which dangled down from the mop on his head like vines from a pale stone building. No matter what he went through, or how long it took, his eyes always looked the same; where his soul lived. A powerful soul, but a lonely soul. As if he had lacked a part since the dawn of time and throughout the ages, his search never ends and he’ll always ask the same question.“Where is she?”I wished I could tell him, but I could not dare risk it. Some things are far too important to juggle in the dark; some things break too easily.Several moments passed. He asked again with more force, and the sky grumbled with thunder. I didn’t turn my head, but I cast my eyes up and let my mind wander in the storm. It’s always storms. An endless gathering storm, and the thunder and lightning always punctuated his words, which didn’t surprise me. The world bends around those who will shape it, even if they are unaware of their power. He took a step and I could hear the silver scrape against his belt loop. I met his eyes so he could see my reassurance. It gave him pause. I didn’t want to hurt him, but I knew I would. It’s hard to fight destiny, impossible to challenge it, but it’s a task I accepted, and it brought me here.Mary and Cyrus have known each other their entire lives and have loved each other for just as long, but their own personal demons and latent fears have kept them at an arm’s length.As they finally overcome their issues and find their way into each other’s arms, they are unaware of the darkness, which lurks within the shadows.When that darkness latches on to Mary, Cyrus must face his greatest enemy if he is to have any hope of saving the woman he loves……himself.Now the cruel gears of fate have begun to grind, the dark clouds have darkened the warm light of day, and the storm… is coming.",
  "genres": [
    "Fantasy",
    "Paranormal",
    "Paranormal Romance",
    "Romance",
    "Fiction"
  ],
  "author": "Brandon Tackett",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/15703678-a-gathering-of-storms"
}