{
  "title": "Double Crossing",
  "description": "\"Outstanding in both its structure and its questioning of faith, this offering is not to be missed.\" - Kirkus Reviews (STARRED Review) \"Best of all is the shocking surprise that changes everything, even Papa-a haunting aspect of the immigrant story left too long untold.\" - Booklist (STARRED Review) The future for Jews in rural villages of Russia in 1905 held little promise. Stories of pogroms seeped through the countryside, and the czar was conscripting soldiers because of rumors of war and revolution. Benjamin Balaban, a poor but very devout Jew, determines to flee to America. He will take Raizel, his almost-twelve-year-old daughter, and once they are settled he will send for his wife and other children. Raizel doesn’t understand the reasons for leaving. How can her village be dangerous? It’s full of magic and the stories and poems that her grandmother Bubba tells her. But go she must. Her odyssey with her father across Russia and Europe and on to America is full of adventure, adversity, and hardship. She desperately misses her family, but she retells Bubba’s stories to keep her memories alive. Finally, they board a ship for America, but a terrible storm makes Raizel and her father sick. All their food is stolen, and Benjamin won’t eat non-kosher food. At Ellis Island, his long beard and ear locks, his peasant clothes, his deep cough, and emaciated frame get them turned away from America. Raizel, though, is now determined to get back to America and the hope of a new life for her whole family. She must convince her father that he’ll have to give up his orthodox food and traditions and put on the clothes of his new country. She and her father both will have to leave everything behind to make their final crossing to America. Double Crossing is the winner of the Paterson Prize for Books for Young People and the Skipping Stones Honor Award, and is a Notable Book for a Global Society and a Notable Children’s Book of Jewish Content. Eve Tal was born in 1947 in New York City. She lives on Kibbutz Hatzor with her husband and three sons.",
  "genres": [
    "Historical Fiction",
    "Young Adult"
  ],
  "author": "Eve Tal",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/157045.Double_Crossing"
}