{
  "title": "The Children of Hamelin",
  "description": "Click author's name above to watch the Book Trailer!Everyone knows the Pied Piper led them away. But no one knows what happened to them.After soundly throttling The Escape National Champions, seventeen year-old Horatio Gaph is approached by a short, stubby creature delivering a curious box wrapped in nine pieces of brown paper and smelling like...peppermint. Inside, a somewhat plain, somewhat boring music pipe and a note requesting its return, but with no return address. While working to unravel the origin of the music pipe, Horatio learns baffling truths about himself and his family-that he is a descendant of the Children of Hamelin, the famed boys and girls led away by the notorious Pied Piper. Horatio Gaph teams up with Annie Walker, his girlfriend with an extraordinary gift for music and Linus Sob, a fairytale know-it-all. They discover clues and instruction in the writings and actions of L. Frank Baum, the Brothers Grimm, JM Barrie, and Lewis Carroll that not only suggest that the fairy tales told by these men are real, but the delivery of Horatio's music pipe will dramatically change the nature of this world's existence.In a thrilling race around the globe, Horatio, Annie and Linus seek the four keys that will unlock the secrets of the music pipe while being pursued by the fierce, apocalyptic government, The Synarch, and the powerful, mysterious group known as the Wizards, an organization hell-bent on stopping Horatio from returning the music pipe to its proper owner. Unless Horatio can solve the fantastic riddles before being caught or worse, the truths about these fairytales-and the unrealized potential of this world-will forever be lost.The Children of Hamelin is a blistering-paced, thoughtful Young Adult adventure that keeps readers guessing through its explosive conclusion.",
  "genres": [
    "Fantasy"
  ],
  "author": "Danny Lasko",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/15704557-the-children-of-hamelin"
}