{
  "title": "Whistle Blowing",
  "description": "Official Description: Former Navy medic Sebastian Thompson has classic good looks and a true blue heart. But that doesn’t mean he has the confidence to make a move on the gorgeous young blond who just breezed in to the Blue Dragon Bar. Fate will play its hand, anyway. Finding the same young blond beaten to the edge of death, terrified of a hospital, Sebastian has to choose - walk away, or try to save a life.This one chance encounter will lead Sebastian into a web of danger. Who is the enemy and who is a friend? Who will he trust when everyone has a reason to lie? How far will he go, and what will it cost, to do the right thing?Original Prompt:Dear Author,I'm so out of my league with this one I have no idea what the hell I'm doing. I watched him walk into that bathroom. How could I not notice him? Just look at him. He's fucking beautiful. I didn't see him come back out, but I was trying to play it cool, ya know? I thought maybe he'd left when after 30 minutes I didn't see him in the bar anywhere. Shrugging it off, figuring he's probably a good 10 years too young for me anyway, I went to the bathroom and saw him again. Only this time he was a broken, bloody heap on the floor in the last stall. Shit! I rushed over to him, felt for a pulse and tried to assess the damage. I'm just a retired Navy medic, not a doctor but when I roused him, he started screaming and pleading with me not to take him to the hospital. Said they'd kill him if they found him and they'd be sure and look there first. So I picked him up, carried him out and brought him home. He's so badly beaten. I think they kicked him half to death. I have to examine him, but he's so scared. I'm not sure if he's been raped or not but how do I get him to trust me enough to even check? Please help me put this beautiful, battered boy back together again.Photo Description: A bleached-blond young man with a sculpted body is sitting half-naked and curled over his own knees. His eyes are closed, and his head is down. He looks tired and scared.This story was written as a part of the M/M Romance Group's \"Love is Always Write\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story.Download the story, read it online or find it in Love Is Always Write: Volume 11 - Bonus Volume.__________Genre: contemporary, thriller. Tags: medical personnel; military men; first time; hurt/comfort; slow burn; unresolved sexual tensionWarnings: descriptions of post-violent-attack first aid and medical care; non-graphic discussions of off-screen sexual assault; gun violence (non-sexual). Word count: 70,085",
  "genres": [
    "M M Romance",
    "Contemporary",
    "Romance",
    "Gay For You",
    "Abuse",
    "LGBT",
    "Short Stories"
  ],
  "author": "Ada Maria Soto",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/15704868-whistle-blowing"
}