{
  "title": "Hired Help",
  "description": "Olivia's girlfriend walked out on her months ago and she's desperate for some action. Her best friend recommends some hired help. This title contains graphic language and f/f sex.9.000 word erotic story Scarlet unbuttoned Olivia's blouse, starting at the bottom and, without touching or exposing any skin, gradually made it to the top. Before she opened the two sides of fabric that covered Olivia's breasts like a curtain hiding something delicious, she ran her lips all the way up and down Olivia's neck, more breathing than kissing. She fixed her gaze on Olivia again and, with a tantalisingly slow caress, escorted the blouse down Olivia's arms until it fell to the floor. Olivia stood trembling against the wall, her nipples bulging hard against the lace of her bra. It wasn't Scarlet's actions so much--most women knew how to sensually undress a lover--as the complete confidence she displayed in them, erasing every second thought Olivia'd had about this afternoon. Soon she'd start to wonder why she hadn't resorted to this earlier.\"Come on,\" Scarlet whispered while kicking off her shoes. \"Time to test the bed.\" Olivia's glance caught the alarm clock on the night stand. It was three twenty-three but she already knew she was going for the full five hours. She stepped out of her shoes and, having slightly gained composure again, along with the belief that her voice wouldn't shake too much, addressed Scarlet, \"As stunning as that dress looks on you, I think it's time to take it off.\"\"At your service, madam.\" Scarlet presented her back to Olivia so she could zip her out of the gown. Her skin was so smooth and evenly bronzed that Olivia suspected Scarlet of coming from another galaxy, or at least another, more sun-kissed area than northern Europe. Scarlet's ruby dress was now a silk puddle on the hotel room carpet. The only fabric left on her skin was a wine-coloured pair of panties. What a profession, Olivia thought, it doesn't even require wearing a bra. Scarlet faced Olivia in her almost naked glory and flipped open the button of her jeans. Once they had dropped to the floor as well, forming another mountain of discarded clothing, Scarlet backed onto the bed, her eyes never leaving Olivia's face. Olivia crawled towards her on all fours, to that promising soft-skinned body that was all hers for the next hours, and looked forward to straddling Scarlet, but, as soon as she approached, Scarlet grabbed her by the wrists and made her lose balance. Scarlet tipped Olivia over and held her arms above her head with one hand, her long fingers pressing firmly into the delicate skin of Olivia's wrists.\"Don't move,\" Scarlet said while peering deep into Olivia's eyes. She reached for her bag which stood next to the bed and produced a red silk scarf. \"Okay?\" Scarlet asked and Olivia wouldn't dream of declining the offer of being tied up. Scarlet's breasts, which Olivia was more than ready to devour, swayed up and down while she tightened the scarf around Olivia's hands and tied her to the bed. \"This is why I like the George V,\" she said, \"the furniture is very functional.\"",
  "genres": [
    "Erotica",
    "LGBT",
    "Lesbian",
    "Short Stories",
    "Fiction",
    "Queer",
    "Lesbian Romance"
  ],
  "author": "Harper Bliss",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/15705090-hired-help"
}