{
  "title": "Connected",
  "description": "Brief SynopsisCONNECTED is a speculative fiction thriller with touches of science and philosophy, which reached No.1 in Amazon UK's Bestseller lists for both Thrillers and Science Fiction within 5 days of release.Beginning with the funeral of a renowned classical violinist in a sleepy rural hamlet in the Lake District, a former theoretical physicist tries to make sense of his brother's suicide. Across the country, a university student, enjoying the unexpected attentions of an enigmatic seductress, is disturbed when his best friend falls to his death from the thirteenth floor of a neighbouring campus tower block.As each tries to unravel the mystery behind the apparent suicides, they are drawn into an obsessive search for a computer-generated fractal video sequence, with startling effects on human consciousness, and which might just pave the way for discovery of the ultimate Theory of Everything. However, they are not the only ones to have seen the potential of this mind-altering video, and soon find themselves in a desperate race against time with gangsters from the shadowy worlds of sex, drugs, cyber-crime, and massively multi-player on-line gaming.Science ContentAlthough, as the reviews testify, CONNECTED has been enjoyed by many with no background in computer science, Mandelbrot Fractal geometry, string theory, quantum physics or brain science, those with some interest or knowledge in these areas seem to have particularly enjoyed the book. One reason for this appears to be that most of these references are actually based on fact. Of course, some readers have preferred to skim these sections, and claim that this did not detract from the story. Others have appreciated the scientific detail and fidelity, and some have even thanked the author for explaining such things in a way that enabled them to learn something new.Philosophy, Science and ReligionAlthough CONNECTED is mostly enjoyed as a fast-paced mystery thriller, it is also, to a limited extent, about the inevitable conflict between science and religion. The two main male protagonists happen to be atheist, and some of the dialogue explores the different thoughts and attitudes concerning some of life’s deeper questions. These include the origins of the universe, the nature of consciousness, and whether there could be life after death. Again these philosophical references to faith and atheism are few, and mostly quite short, but all are crucial to the story.Setting and slangCONNECTED is a contemporary novel, set entirely in England. As the story unfolds through two converging plot threads, the action switches between a fictitious village in the Lake District, the University of Essex in Colchester (an old Roman town about 60 miles north-east of London), Bracknell (a newer suburban town some 40 miles west of London), and North London.Consequently, there is some British slang and occasional use of bad language (e.g. a few instances of the F-word etc.) in keeping with the age and background of the characters.Why Connected?Years ago, while the author was at university, a fellow student had a breakdown and was admitted to the local psychiatric hospital. A few, who knew him well, went to visit and reported that he’d subsequently lost the plot and was gabbling incomprehensibly of having found the answer to life, the universe and everything. While most people seemed consumed with sadness and pity at this, the author’s first thought was, “What if he really had discovered some universal truth?” Although never seriously believing that he had, it was on that day that the seed of an idea lodged in his young brain – a seed that years later would",
  "genres": [
    "Science Fiction",
    "Thriller",
    "Fiction",
    "Mystery",
    "Amazon",
    "Mystery Thriller",
    "Science Fiction Fantasy"
  ],
  "author": "Simon Denman",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/15705074-connected"
}