{
  "title": "Paths of the Norseman",
  "description": "Paths of the Norseman is the second volume of the vividly-detailed historical chronicles of Halldorr, an orphan whose entire desire was to lay beside both a warm hearth and a plump wife, but the fate spun by the norns took a different thread. Instead, he found himself exiled, resigned to a life of raiding, killing for plunder and survival. In his first adventure he became bodyguard to a king, brutally fighting in monumental battles such as Maldon and Swoldr which were to be handed down for centuries in skaldic verse.Now after watching so many of his countrymen slain in battle at the end of his last tale, Halldorr returns to Greenland with his adopted brother Leif to take revenge on the man who saw him wrongly exiled thirteen years ago. But returning home after so many years of killing, Halldorr finds he is a different man, so seizing upon his destiny is short-lived as he longs for journey. The new jarl of Greenland is only too happy to comply and commands Halldorr to discover new lands and new peoples, to settle in a foreign wilderness.Soon, with Helluland and Markland in his wake and Vinland under his feet, Halldorr again finds that his hopes for peace are washed away by the waves of history as two peoples separated by an ocean for eons, collide. The choice for battle or peace is not his own and he is left fighting, assuming the persona of a Berserker of yore, in events which today we find etched in the Vinland Sagas.All the while Halldorr follows the drumbeat of history, he still desires a woman to be his own. Freydis, the fiery enchantress from his youth, again bounds into his path. Will he fall under the trance of her wiles or seek the true love of Gudrid?With fantastic characters from the pages of history – such as Erik the Red, Leif Eriksson, Thorhall the Huntsman, Bjarni Herjolfsson, Freydis Eriksdottir, and Gudrid the Wide-Travelled – brought to life full of faults, wit, and duty, Paths of the Norseman is the most engaging way to bring the past to life. Read it today.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Adventure"
  ],
  "author": "Jason Born",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/15705298-paths-of-the-norseman"
}