{
  "title": "Whill of Agora",
  "description": "Every so often, an epic adventure emerges that makes the blood surge, the spine tingle, and the heart smile page after exhilarating page. Such is Whill of Agora, Michael James Ploof’s action-packed fantasy that visits strange new lands as it unveils how one exceptional young man named Whill makes full use of fierce wits, superior skills, and relentless will to help defend the land of Agora from the monstrous Draggard. With plenty of drama and action packed battle scenes, Whill of Agora will enthrall anyone on the quest for great adventure, good times, and an infectiously optimistic outlook on even the darkest and most dangerous of days. It is the year 5170 in the land Agora, where humans, dwarves, and elves have existed in peace for centuries. Now, however, the human King Addakon has invaded and waged war on neighboring Isladon. The once peaceful Kingdoms of Agora are on the brink of continental war. The Dark Elf Eadon, Addakon's master, and his army of Dragon-Elf crossbreeds, the Draggard, threaten to conquer all kingdoms. The final hour has arrived. Enter young Whill, a nineteen-year-old ranger with battle savvy and untapped abilities. Having spent years roaming Agora and training with his mentor Abram, Whill has become a bright intellectual and a master of combat. What he seeks most, however, is the identity of his birth parents. Instead, he finds a tumultuous terrain and a prophecy placing him in the center of the struggle. Along the way, Whill encounters an equally inspired group of companions that are matched in skill and mission. These include Rhunis the Dragon Slayer, the young Tarren, the fearless Dwarf Roakore, the beguiling warrior Elf Avriel, and the powerful Zerafin. As Whill joins forces, he forges bonds far mightier than their escalating travails. With high adventure and fierce friendship, Whill of Agora will capture your imagination and grip your heart during every super-charged escapade that Agora’s bold and grinning brotherhood embraces.",
  "genres": [
    "Fantasy",
    "Epic Fantasy",
    "Magic",
    "Fiction",
    "Adventure",
    "Young Adult",
    "Dragons"
  ],
  "author": "Michael James Ploof",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/15705304-whill-of-agora"
}