{
  "title": "American Psalms: Prayers for the Christian Patriot",
  "description": "More than a devotional, American Prayers for the Christian Patriot offers a worship-based approach to becoming a Praying Patriot. Filled with Scripture-focused prayer, tips for spiritual formation and tools to fulfill God's command to pray for those in authority over us, this book will renew your heart for the nation that gives personal liberty and the God who gives eternal freedom.Steeped in American history with a strong biblical foundation, American Psalms takes the reader on a one-year journey of spiritual growth with weekly prayers for the nation, psalms for special days of prayers, relevant teachings to enhance your perspective and worksheets designed to promote prayer for America's leaders. With prayers spanning subjects from our troops to the presidency, from NASA to the fishing industry, and from the economy to our children's teachers, Masters has covered nearly every aspect of American society with scripture-based prayer while teaching the reader how to regularly pray for our nation without political bias.What People Are Saying About American “ American Psalms challenges Christian patriots to put aside personal agendas, prejudices and partisanship, and pray for our leaders as God commands.”-Mike Huckabee, author of A Simple Government“… American Psalms , is tremendous! It is an uplifting, faith-filled treasury of inspiring prayers, solidly based in Scripture—‘an answer to prayer’ for our country at this critical time.”-William J. Federer, nationally known speaker, best selling author of America‘s God and Country Encyclopedia of Quotations\"American Psalms is a concise prayer guide for those who are new to intercession as well as those who are seasoned prayer leaders. In addition to motivating readers to pray for all aspects of our nation, this resource provides strategic prayer points and handy worksheets. This is a useful tool for all prayer leaders.\"-Mary Bruce, National Day of Prayer Northeast National Area Leader",
  "genres": [],
  "author": "Joshua J. Masters",
  "average_rating": "4.90",
  "url": "https://www.goodreads.com/book/show/15705934-american-psalms"
}