{
  "title": "Troll Or Derby",
  "description": "In Troll Or Derby, fifteen-year-old Roller Deb is singled out by town bullies for both her skates, and for being different. When her popular homecoming queen of a sister is kidnapped by a scuzzy drug dealer, Deb must flee the trailer park in which she's grown up, and rescue her. Along the way, Deb becomes enmeshed in the magical realm of trolls and fairies, and the blood-thirsty version of roller derby at which these beings excel. But spending too much time among the fairies comes with a price. Will Deb choose to save her sister, with the aid of a mysterious troll? Or will she be lost to the lures of roller derby, and the blonde temptress April, forever?Axel Howerton says \"Red Tash delivers again with this tale of rockin', rollin' and full metal fantasy! I love this damn book.\"Mercedes Yardley: \"This book has it all. Prophecies. Destinies. Royalty, trust, revenge. Sex, drugs, and rock and roll are doused in humor and lit ablaze with quirky snark. I blew through this book incredibly fast because I couldn’t put it down. If you want a solid, fun read, then pick up Red Tash’s Troll or Derby.\" Braine of TalkingSupe.com Book Reviews says: \"Roller Deb is the perfect amalgam of Heather Graham (Boogey Nights) and Ellen Page (Whip It), she's a sexy ass-kicking heroine and I can't help but adore the chick! All that unleashed power is both scary and fascinating, it feels like staring into the sun. And Harlow, with his swoon-worthy name, is the kind of troll you want to fall in love with (I was actually imaging them to be Julianne Hough and Diego Boneta in Rock of Ages with Tom Cruise as the villain McJagger). Overall the story is crazy exciting and so fast paced you'll just keep on flipping the pages.\"",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Paranormal",
    "Lesbian",
    "Urban Fantasy",
    "Fae",
    "Roller Derby"
  ],
  "author": "Red Tash",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/15706166-troll-or-derby"
}