{
  "title": "What Ukulele Players Really Want To Know",
  "description": "The bestselling beginners guide and handbook for the ukulele aimed specifically at new players or those thinking of taking up the uke. Many ukulele guides available are far too prescriptive and quite simply don't provide the answers to the common questions a beginner has. Whilst they concentrate on useful technique and provide sample songs to play, in my experience they leave the new player with a lot of questions unanswered. This book aims to fill in those gaps. It's not a tutor book, it's a book to answer all the other stuff!Barry Maz, ukulele player and author of the Got A Ukulele website has collated and expanded on his popular beginners guides to provide new players with a comprehensive resource of advice, tips and tricks for the ukulele.With 29 detailed sections dealing with everything from the shape and size of the instrument, to strings and even how to grow your fingernails and toughen fingers, the book provides no-nonsense advice from a seasoned ukulele player, written in a friendly style. The book draws on Barry's own experiences in starting out with the ukulele, and the mistakes he made so you don't have to! Also included is a handy reference section and ukulele glossary to help with those terms that may not be so familiar to the beginner.Barry advises that his book is best read in conjunction with other tuition methods or in advance of purchasing your first instrument, to bring a spot of welcome light relief to your practice and development with the uke. Think of it as a uke owners guide!Includes an interactive Table Of Contents. Happy strumming!ALSO NOW AVAILABLE - CHECK OUT 'More Of What Ukulele Players Really Want To Know' Barry's follow up book!NOW AVAILABLE - Chords That Ukulele Players Really Want To Know.** number one ranked music book on Kindle UK store in December 2011**** In the book review, Gary said \"While the book is indeed aimed at absolute beginners, it is in fact pretty comprehensive, covering all the issues likely to nip a the heels of someone starting everything from how to pick out your first uke to advice on humidifying your instrument and fingernail care. It is not an instructional guide; there are plenty of how-to-play books out there. It's more of a user's guide, filled with the kind of info you'd eventually pick up from hanging out with a bunch of veteran players for several months but which is all a mystery to someone starting out by themselves.\"",
  "genres": [
    "Music"
  ],
  "author": "Barry Maz",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/10541465-what-ukulele-players-really-want-to-know"
}