{
  "title": "The Midwives' War",
  "description": "Against the chaotic backdrop of World War II, Grace Murphy is working as a midwife in Doncaster Royal Infirmary with her two friends, Clodagh and Patsy. In between delivering babies and tending wounded airmen, the girls endure bombing raids, rationing and the hardships and heartbreak that war brings. But in the faces of the new babies she welcomes to the world, Grace always looks for hope, as she dreams of a time when the war will end. When the midwives get the chance to go to a dance at the nearby RAF Finningly, they jump at the offer. The hangar is crowded with happy dancing couples but when the glamourous Spitfire pilots saunter in, looking dashing in their leather flying jackets and brightly coloured silk scarves, Grace can’t resist taking a peek. And the moment Grace meets pilot, Richard Carmichael, she knows he will capture her heart. With every daring flying raid, Grace and Richard risk losing each other forever. All Grace can do is look out for Richard in the patches of blue sky, and hope that fate will bring them their very own wartime happy-ever-after… Chrissie Walsh is back with this heart-breaking tale of love against the odds, perfect for fans of Fenella Miller, Daisy Styles and Margaret Dickinson. What readers are saying about Chrissie ‘Chrissie Walsh is a wonderful writer who brings the past to life and will make readers feel as if they are living the story and not just reading it. Her characters are strong and resourceful protagonists who find themselves with no other choice but to battle against all the obstacles in their way.’ ‘This was a very, very, very good read from start to finish I didn't want to put it down.’ ‘What a great story, didn't want it to end. Great characters and certainly made great reading. Looking forward to reading more from this author.’ ‘What a lovely book the story flowed beautifully. The characters were introduced slowly so as not to confuse the reader and they all brought something different to the book.’ ‘Just brilliant! From the first page to the last I was completely enthralled.’",
  "genres": [
    "Historical Fiction",
    "World War II",
    "Historical",
    "Fiction",
    "British Literature"
  ],
  "author": "Chrissie Walsh",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/157068313-the-midwives-war"
}