{
  "title": "Atomic Summer",
  "description": "THREE friends, TWO secrets, ONE lie, and the summer that changed their lives2012 Southern California Book Festival, Honorable Mention recipient From award winning author, Elaine D. Walsh comes an introspective and emotional novel with vivid characterization. This insightful, nostalgic, and witty story follows the lives of three teenage girls as they 'come of age’. In 1953, the world was ripe for destruction. The Korean War dragged on and the Rosenbergs were executed as spies. Senator Joseph McCarthy convinced the country communists were infiltrating the government, and the threat of nuclear war festered in the collective consciousness of the nation. While American’s constructed backyard bomb shelters, the government conducted nuclear tests in the desert, three teenage girls planned their futures. Their innocent conversations about what each of them would do if the end of the world were imminent, coupled with a friend’s obsession, become the catalyst for a prank that spins wildly beyond control and draws in an entire town. Left behind in the wake of that summer’s events are their unrealized dreams and open wounds. In 1973, a reunion trip to the small town of their youth returns them to the summer of 1953 and the passion and betrayal that changed their lives.\nBE PREPARED! This summer will be Atomic!\nWhat readers are saying about Atomic Summer? \n   Every character comes alive \n  \n   Refreshing \n  \n   The story transported me back in time \n  \n˃˃˃ Why should you grab a copy of this award winning novel?In addition to being one of the top summer reads, the author dedicated the book to her mother who died of cancer and is donating all her royalties to cancer causes and charities. \nGrab your copy now and see why everyone else loves Atomic Summer",
  "genres": [
    "Drama",
    "Historical Fiction",
    "Amazon",
    "Young Adult",
    "Fiction",
    "Coming Of Age",
    "Chick Lit"
  ],
  "author": "Elaine D Walsh",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/15707237-atomic-summer"
}