{
  "title": "Deception",
  "description": "Do the Fey exist? In Grace’s world they do, but she doesn’t know it yet.\tAn unsuspecting Grace thinks she is utterly ordinary ignoring the fact that odd things happen to her daily. She has always felt like she did not belong anywhere or to anyone. She constantly lets others rule her feelings, drive her inner anger, and squelch her capabilities. Yet she sees impossible things happen, seems to make them happen unintentionally, and spends the majority of her teenage life trying to prove to others that she is not a freak.\tIan, is a clever quiet dark-haired boy who always seems to mysteriously save her at just the right time from her darkest moments. And does he know how Grace feels about him? Will she ever admit it aloud?\tThen one Halloween night, her eighteenth birthday, she finally finds out the truth. A prophecy. Before she was born, her destiny was chosen naming her to end a war. She enters a world hidden just outside the real one. Was it all laid out, or does she have a choice? \tGrace seems to think so even still. And Ian gives her the choice to walk away from him and his secrets. But does she want to walk away? Ian offers much more than just himself, the son of the Seelie Court queen. He offers her a path into his world where appearances are deceiving and others are trying to woo her away. Her world by birth. Creatures. And they are not the tiny winged beings from her childhood. They call themselves many names. Fey. Fair Folk. Fairies. And they say she is to be their new queen. But the enemies who want her to fail are closer than you think. Much closer. Will Grace be able to tell friend from foe? Even ones who have been beside her for years? \tAnd yet all of this was her choice? What will Grace choose? Who will Grace choose?NEWLY REVISED AND EDITED VERSION -SUMMER 2014",
  "genres": [
    "Fae",
    "Fantasy",
    "Young Adult"
  ],
  "author": "Cyndi Goodgame",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/15708174-deception"
}