{
  "title": "Khatyn",
  "description": "It is a quiet place, with lush green grass covering the location of the former Belarusian village. A village that was burned to the ground with its inhabitants in 1943. Anyone familiar with this small corner of Eastern Europe is chilled to the bone by the events that transpired there, and the village’s name Khatyn has now come to embody a horrific national tragedy. But tragedy is not all this name embodies, for it also reminds people of the tremendous courage of those who fought for the life and freedom of their country. It is the story of this village and the events that surround its annihilation that are the focus of Ales Adamovich’s novel Khatyn, which was written on the basis of historical documents. The author, himself a World War II veteran and partisan, depicts the reality of the partisan resistance to fascism in Belarus. The main character is a man named Florian, who in his memories returns to events that transpired some thirty years ago, when as a teenager he joined a partisan unit and met his future wife, Glasha. He witnesses how the villagers of Khatyn are burned alive as reprisal for supporting the partisan movement. The monstrous cruelty of the death squad and its commanders manifested itself in the act of punishing the entire community for the deeds of those who had helped the partisans. The village, composed mostly of the elderly and mothers with children, was locked inside a barn. After being covered with dry hay, the barn was set ablaze with the families inside.Over half a century later, Adamovich’s story about the courage of ordinary people has not lost its immediacy. Today, the world is still marred by war crimes committed against communities of noncombatant. Khatyn is a testament to an event that must not be forgotten, and to a reality that must not be repeated.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "War",
    "Russia",
    "Literature",
    "World War II",
    "Classics"
  ],
  "author": "Alieś Adamovič",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/15709527-khatyn"
}