{
  "title": "Dalton",
  "description": "Warning: Erica Chilson is revising/rewriting/restructuring/editing/formatting the Mistress & Master of Restraint Series in its entirety for release into Print. A few titles will receive updated covers, as well as a more descriptive synopsis. The FINAL editions will vary from those currently in release. If you are a new reader, and not one who enjoys rereading, then I suggest you ‘wishlist’ or ‘TBR’ the following book & subscribe to Erica Chilson’s website: ericachilson.wordpress.comHowever, if you would like to read this title in its current form, and then experience its final edition, or if you have previously purchased this title, an ebook update will become available. You will NOT have to repurchase another ebook copy. Instruction on how to update, and whether or not you need to update to the most current edition, can be found on Erica Chilson’s website under the tab ‘Updated Editions’. Erica Chilson apologizes for the inconvenience, and hopes that the readers understand her decision to create and publish a professional book worthy of its story and its readers. *warning will be removed when the Final editions go live, and a new warning will published. If reading this statement, then the Final Editions are not available as of yet* Mistress & Master of RestraintThe story of Restraint began with Katya Waters. We followed her journey of self-discovery as she merged the mysteries of her past with her twisted present. Join the characters of Restraint as they tell the story from their points of view. The following book delves into the mind of the masochist- Dalton, Master of Restraint.Follow Dalton as he uses a secret identity to infiltrate Restraint and locate the informant feeding Adelaide Whittenhower. His struggles with his painful past and his behavior of creating havoc among the membership is a bitter pill for the masochist to swallow. Will Adelaide welcome him into the fold before the members of Restraint banish him? Dalton is approximately 56,000 words.Adults 18+This is a work of erotic fiction. The author does not endorse nor condone any of the behavior enclosed within. The subject matter is not appropriate for minors. Please note this novel contains explicit sexual situations that include but are not limited to, force, BDSM activities, bisexual acts, multiple partners, and ménage. If any of the above mentioned acts offend, please do not read. Readers: please play safely, responsibly, and consensually.",
  "genres": [
    "BDSM",
    "Menage",
    "M M Romance",
    "Romance",
    "Erotica",
    "M F M",
    "Adult"
  ],
  "author": "Erica Chilson",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/15709884-dalton"
}