{
  "title": "Planet Predators",
  "description": "From the International Number One Best Selling Author Saxon Andrew comes the second book in his third Science Fiction Series, Lens of Time - Planet Predators. Earth has managed to steal technology from both the Alliance and the Moet Empire and build starships that can now stand up to the two strongest civilizations in the Galaxy. However, they are millions of years behind the Blue Giant Ships that are planning another invasion to destroy all space faring civilizations in the Milky Way. What makes the situation dire is that the species that wiped out the Blue Giants and the Jenze in both the Milky Way and the Andromeda Galaxies four million years earlier is returning to repeat the process on new civilizations.Even the Blue Giants have no chance against the returning warships from the giant galaxy, M-87 and time is growing short. The Moet and Alliance are evacuating their planets and Earth will be left behind to face the coming menace. The only hope of salvation is a Crazy Cuban that may be the difference maker in the coming war.The story continues and Christopher Conner’s invention will have to be used again to find salvation for all Mankind in the distant past. Even that may not be enough. The Violet Colored ships are coming and planets will die under the beams of the Planet Predators.This review is Lens of Time - The Pyramid Builders (Lens of Time (Book One)) (Kindle Edition) Another book in Mr Andrew's prolific and always excellent releases. The Lens of time grabs you at the first word and holds on. Dr. Christopher Connor has invented a device to interpret the light that has left the Earth into its component occurrences but he needs a faster than light ship to get ahead of the light in able to see backwards into the light stream and display the incidents as they happened. Dr. Jillian Gordon has plans for an FTL ship found in an archaeology expedition to the Great pyramid of Egypt along with a warning that the earth will be destroyed within the next 4-6 years. The book is the story of these two, with a great supporting cast, combining forces and combating this coming disaster. In doing so, they run across alien civilizations who may not be friendly. This is a fast paced, hard to put down book that leaves you anxiously awaiting the next in the series, as all of Mr. Andrew's books do.This review is Lens of Time - The Pyramid Builders (Lens of Time (Book One)) (Kindle Edition) Lens of Time is an extraordinarily enjoyable book that will have you on the edge of your seat from its very opening scenes. The book is deceptively easy to read, but contains a plethora of fascinating ideas, excitement and characters.Dr. Christopher Connor is a wonderfully colorful protagonist who is brought to life by Andrew's excellent characterization of him. As readers, we empathize with him immediately and cannot help being drawn into his extraordinary adventure.I don't want to give too much of the plot away, but needless to say that the only downside to reading this exciting book is that you will be wishing that the next one was released right away.One of the year's most enjoyable reads. Highly recommended.Planet Predators is a full length novel at 75,000 words. It is the second book in the number Bestselling Lens of Time Series. Visit us at annihilationseries.com. The cover was done by Christine Ticali at Dark Road Designs. Editing was done by theindieeditor.",
  "genres": [
    "Science Fiction",
    "Military Fiction"
  ],
  "author": "Saxon Andrew",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/15709815-planet-predators"
}