{
  "title": "The Billionaire's Secrets",
  "description": "THE BILLIONAIRE'S SECRETS - Now with an all-new chapter (plus a new love scene)!“The windswept cliffs of Newfoundland make for an epic backdrop, and there are times when The Billionaire’s Secrets seems to be channelling the spirits of the Bronte sisters. If you can suspend your disbelief a little, you’ll likely find this to be a grand, romantic book.” --indiebookspot.com“I recommend it to those of you who are on the \"Fifty Shades of Grey\" grind.” --Jessica, Amazon reviewerWARNING!!Do not read if you don't believe in love at first sight, dark handsome strangers, poetic justice, good sex, exciting plot twists, or happy endings.This book is to be taken with a suspension of disbelief and a cold glass of white wine.Side effects include sighs, sleepiness due to late night reading, and an addiction to fun reads.IF YOU'RE WILLING TO TAKE THE RISK, READ ON...When Chloe Winters answers an advertisement seeking a private tutor for a six-year-old girl, little does she know it means relocating from metropolitan Boston to an isolated mansion on a cliff overlooking the Atlantic Ocean in Newfoundland, Canada. Nor does she realize the little girl's widower father is Gaelan Byrne, a billionaire whose dark, brooding sexiness has brought him as much fame as his money. But Chloe, shocked by his coldness toward his daughter, vows to remain unmoved by both his fortune and good looks - a vow she soon finds impossible to keep.Gaelan Byrne has been dragged to hell and back by women before and is none too happy to discover the matronly retired teacher he hoped to hire turns out to be the beautiful, caring Chloe. But how can he fire her when the daughter he is incapable of loving adores her? He vows to keep the relationship strictly professional - a vow he soon finds impossible to keep.But while the attraction they feel soon engulfs them with all the intensity of a spring storm, the secrets Gaelan keeps makes any chance for happiness seem as remote as the windswept cliffs of Newfoundland.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Fiction",
    "Love",
    "Gothic",
    "Adult"
  ],
  "author": "Meadow Taylor",
  "average_rating": "3.36",
  "url": "https://www.goodreads.com/book/show/15711162-the-billionaire-s-secrets"
}