{
  "title": "Felt Tips: Office-Supply Erotica",
  "description": "FELT TIPS – The World’s Greatest Charity Anthology of Office-Supply-Related Erotica!Please congratulate all our fine Felt Tips writers when you see them on Twitter. They donated their time and talents to this charity anthology. Because of them, some kids who couldn't afford new school supplies and some down-on-their-luck parents who can’t afford work clothes will be getting a hand from our one-handed read.\nFelt Tips - Table of Contents:\nIndelible by Jenny LynTaking Dictation by Karen BoothHard at Work by Karen StivaliThe Saint of Office Hell by Heather ColeOf Silver, Sin, and School Desks by BlacksilkMine by Brittany LawrenceWhat Is It, Suzie? by Eric Andrew SatchwillMy New Office Chair by Gwen Marie PorterProof by Amber LinStapled by Jason DarrickGetting Down to Business by Kelly JamiesonIn the Closet by AmyBeth InvernessSpecial Delivery by Rebecca StewartThe Drawing by Marie WrightDown to the Point by Sopphey VanceDoing it Write by Lynne SilverMark Me by Jillian BoydTape by Shoshanna EversVee by Alyssa Linn PalmerThe Fountain Pen by Sandra BuninoTrust Me by Antonio AngeloWhiteboard by Lela GwennThe Night Shift by Xander GrimmThe Benefits of Multitasking by Kiki SnowRoutine Maintenance by R. BrennanThe Boss by Maxine MarshPrivate Message by Cara EllynAll Marked Up by Erin DanielleA Stroke of Peach by Lucy FelthouseThe Server by Anya WinterA Rough Night at the Office by Diana CruzA Planned Encounter by Emily CaleTheo's Donation by Patricia CorrellThe Motion of the Ocean by Morgan SierraOpen Rack by Candice BundyThe Antique by K. FishSilky & Silvered by Memory ScarlettAll Work & No Play by Michelle RibaricTurnabout by Stella HarrisCaught by Juliana SliemaEmbrace the Strength Inside by Jade AdkinsWhat Happens at STAPLES by Amanda FletcherLove Letters by Allie SandersTeacher's Pet by Tiffany Reisz",
  "genres": [
    "Erotica",
    "BDSM",
    "Short Stories",
    "Anthologies",
    "Romance",
    "Fiction"
  ],
  "author": "Tiffany Reisz",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/15711978-felt-tips"
}