{
  "title": "Forced Awakening",
  "description": "While enjoying the summer at her grandmothers cottage Sophie falls captive to a sex-crazed Werewolf. Still a virgin, Sophie is reluctant to give in to his sexual desires. Hopeless and without a plan of escape she begins to crave the wolfs depraved needs.A small taste of what's inside:---“No!” Sophie screamed, beating her fists against the man’s back.“The less noise you make, the easier this will be,” the man said darkly.“Help!” she cried, “Someone help me please!”But the man was fast and seemed unaffected by her weight as he swiftly carried her deeper into the woods. Sophie screamed again, in vain, but she knew no one would hear her. She thrashed and kicked her legs and beat her fists, exerting every ounce of energy she had.“Female, you do not want to use all your energy now,” said the man, and she heard the dark humor in his voice. The sound made her stomach turn. She went limp against the man, and quickly began devising a way to escape. She felt the man slowly slide his fingers up her legs, under her skirt.“No!” she cried out, kicking her legs. But he held her legs tight with one arm, while the other arm explored her soft, young skin. The man moaned deeply and he pushed his fingers up to her thighs, feeling her soft flesh. He kneaded his fingers into the skin, moaning in quiet appreciation. Sophie squeezed her eyes shut, cringing from his touch.Sophie noticed that the man’s pace began to slow and it seemed as if he were tiring. Of course he couldn’t continue at his pace with Sophie thrown over his body. Taking advantage of the opportunity, Sophie kicked with force and her body hit the ground with a thud. She scrambled to get up and run, but the man was faster, pinning her to the earth.He smiled, “No need to run, female. You can’t escape.”Sophie fought against his weight, but he did not budge.“I wanted to find a better spot, but his will have to do,” he said. Sophie studied the man; under normal circumstances he was probably very attractive. He was tall and broad with large muscles. He had dark auburn hair and dark chocolate eyes with a strong jaw.“I am Rylan,” he said, his voice softer. “I wish you no harm, but I must use your body.”---",
  "genres": [
    "Erotica",
    "Paranormal",
    "Shapeshifters",
    "Adult",
    "Werewolves",
    "Romance",
    "Paranormal Romance"
  ],
  "author": "Bree Bellucci",
  "average_rating": "2.93",
  "url": "https://www.goodreads.com/book/show/15712147-forced-awakening"
}