{
  "title": "Dominion",
  "description": "When pre-med student Eve Hayden searches for a translator for an ancient French illuminated manuscript she found in her dead mother’s research files, she gets more than she bargained for: Michel de Cernay, a former priest and eight hundred year old vampire and his identical twin brother Julien, a former knight. The manuscript details their death and rebirth as vampires in 1224 during the Cathar Crusade at the hands of an ancient vampire.Michel wants to prevent Eve from reading the manuscript or becoming a vampire hunter like her dead mother before her. He hopes Eve will instead pursue her studies in music. Unable to compel her to forget him and all about vampires, Michel asks Eve to become his Adept, working cases with him protecting the Treaty of Clairveaux that keeps vampires in the closet and peace between the two species. He also wants her to become his sexual submissive and despite her initial reluctance, Eve is drawn to the idea of submitting to this beautiful vampire.She also meets his brother Julien, a brash and mercurial opposite to Michel's calm determination. The temperamental opposite of Michel, Julien tries to complicate the budding romance between Eve and Michel in the hopes of winning Eve for himself. The brothers play a dangerous game of power with an ancient enemy in an effort to prevent Dominion -- when vampires rule over humans.Gifted with paranormal skills, planning to follow in her mother’s footsteps as a vampire hunter, Eve is torn between loyalty to her mother’s cause and her desire for these twins.Erotic, suspenseful and fast-paced, the Dominion series will keep you turning pages as Eve searches for the truth about her mother’s death, her birth and her desires.",
  "genres": [
    "Vampires",
    "Paranormal",
    "Romance",
    "Paranormal Romance",
    "Erotica",
    "Fantasy",
    "Urban Fantasy"
  ],
  "author": "S.E. Lund",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/15712652-dominion"
}