{
  "title": "She Wulf",
  "description": "He comes through the centuries to find her, the girl who could save them all. Alone in a the future and a foreign land, he must trust the coven’s magic to find the girl in the prophecy, the one who will rid his people of the demons which cannot be killed. Annie Pearce runs through the streets of the city, chasing a demon, the likes she has never seen before. After finally capturing the creature, she works to find out where it comes from and how to destroy the monster. Cham Chamsky follows a lead and discovers a mystery man in the forest near where the demon was found. This is no ordinary man. He is a Viking—a man from the past—thirteen centuries in the past. Annie and Cham don’t believe in coincidence, and know the demon and Viking are somehow related. With the demon imprisoned and the Viking on the loose, it is essential they learn the origins of the strange pair in order to protect the non- magical world from their presence. In a startling twist of fate, the Viking Kolgaar, drags Annie through a portal to the past, and she learns of the prophecy that has foretold her destiny, one she didn’t know she had. She must rid the ancient England of the regenerating demons—especially Gergalina, the largest and meanest of all the horrible creatures. The monsters have terrorized the Vikings and the coven, destroying everything in their path. When the prophecy was read, there was hope for the first time in centuries. Annie struggles with her new destiny as she adjusts to life in the past, and tries to figure out figures a way to destroy the un-killable demons with the help of her faithful partner Spencer. It is a purpose she must fulfill if she is ever to return home. She Wulf is the follow- up novel to The Day of First Sun, the first novel by Sheryl Steines. Continue the adventure of Annie and Cham as they set out to save the world one more time.",
  "genres": [],
  "author": "Sheryl Steines",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/15714157-she-wulf"
}