{
  "title": "Awaken the financial genius in you Rebuilt",
  "description": "Awaken the Financial Genius in you! is an expression that best encapsulates everyone's dream and wish for financial success and how it can be made a reality. The amazing thing is that everyone has the gift hidden deep within that need to be brought out in a glorious fashion to manifest his or her genius. And, the world seems breathlessly in wait for the yet to be revealed genius that only you can introduce.As a matter of fact, the time of that revelation is now since the world seems to be moving faster than any other time in human history. There is neither time to sleep nor slumber since a little bit of both attract poverty like a thief by night. Momentary pleasures are never fulfilling, or rewarding enough, except fleetingly. Never indulge in them.They evaporate like morning dew at sunrise. Only your investment will remain to testify of your genius. It all boils down to the legacy you wish to leave behind. Mine is a cautious book that is meant to guide you away from falling in the trap of living to rue the lost times and chances with which life will have presented you. Act with speed on whatever you pick from this book and some others. Just as the saying goes, \"One is only old when regrets take the place of dreams\"Do not put off until tomorrow what you can do today; it kills your inspiration and can render inaction inevitably indefinite. Don't be the chief assassin of your own dreams. Take action to position yourself into working towards the realization of your most cherished dreams. Be an active player in steering the wheels of your destiny until your desired result stares you in the face. You can do it!Thank you,Tonny Rutakirwa,CEO and President Utory,™Tonniez® Group of companies.Author,Awaken the financial genius in you! and Awaken the financial genius in you (revised edition).AWAKEN THE FINANCIAL GENIUS IN YOU REBUILTA FOREWORDBY EDMOND KIZITOTonny is a remarkable young man. Not that he is always going to be young. When I met him, he gave me his book to read. As I did something else with him in a three-way meeting, I could not help but wonder. A 19 year-old writing a book that could resonate with many of us in our 40s.And I have read many books. This one, among many others that are to come, will inspire you. You might be a young teenager looking to foment a mindset of excellence; you will need it. Or a middle-aged someone willing to discover your business acumen in retirement.“Awaken the Financial Genius in You” is far much more than a treatise on financial management. It is far from personal finance or prudent economic management. It is a book about success in life. The management saying that you cannot improve what you cannot measure seems to be the pinnacle point that drives the book to the expose on finances.Yet it could the guide to your success in marriage. See, it really is not for the young alone.Truths that Tonny uses to illustrate his points set him aside as a clear-minded intellectual mentor. He is going to help many that are willing to listen to him. Or read his books. Astounded at his age, don’t ever get blinded and fail to see the light that he is pointing out.Life is run on several, timeless principles. Grasp them and you are on your way to your success. How Tonny got them so early in life still mesmerizes me.This book will sell beyond the borders as its message is universal. If you find it close enough to you and affordable, be grateful since durable truths have been translated for you to fit in your closer context.By learning to communicate such a message at an early age, the author -- whom I have known to be an extremely humble, patient, and incredibly intelligent young man -- has added to the skills needed to revolutionize an entire generation.As to whether you benefit from it will certainly depend on how seriously you take this book and its message. I read the entire first edition in one sitting. Reading the second, expanded edition on the plane ensured an otherwise tedious flight was bearable.I had just written the foreword to another book when Tonny approached me with a similar request. Most times I would recommend someone else to do it. This time I could not, simply because the level of intensity of his material is certainly bound to provide the foundational thinking block of many young people and reformat those of older people.Whether it is for business, friendship or marriage that you intend to succeed – whichever way you measure success – you are going to not only read this book and mould your success principles close to it, you are going to have to follow the man, regardless of how many years he might be younger than you, because you are going to be needing his messages for a long time to come.Measure your success.Edmond KizitoArusha, Tanzania,February 27, 2012",
  "genres": [],
  "author": "Tonny Rutakirwa",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/15714889-awaken-the-financial-genius-in-you-rebuilt"
}