{
  "title": "Guardian's Hope",
  "description": "Hope Parsons has heard about the evil of demons since she was a child in the little isolated community where she grew up. Demons were part of the outside world; demon sex, demon drink, demon music, demon woman. According to her father, her mother had a demon in her, too.This is Hope’s world until she finds a box her mother hid years ago and the remnant of a letter her runaway sister wrote begging for help. These finds are the impetus she needs to embark on a journey out into the world and the city where she hopes to find her sister and learn more about her mother’s legacy. Once there, she learns her father was wrong about most of the evils of the outside world. Unfortunately, he was right about one; living, breathing demons are real.Nico ad Nimeni, with his dark charm and magazine cover good looks, is a recent addition to Canaan ad Simeon’s House of Guardians. As a Guardian of the Race, it’s his job to protect his people, the Paenitentia, along with humankind from the demons who cross over from the Otherworld, but Nico knows there are demons other than those that stalk the night preying on the fear and flesh of humankind. Nico’s personal demons are the ones that plague a man’s soul and insist he stand apart.When circumstances bring Hope to the House, she finds a place where everything she was taught about good and evil is turned upside down. In this world of witches and demons, vampires and Paenitentia, she learns that things are not always what they seem and that a shy, self-conscious country girl can be beautiful and find love in the arms of a suave sophisticate.Join Hope and Nico as they search for her missing sister and discover in each other the healing power of love.",
  "genres": [
    "Paranormal Romance",
    "Paranormal",
    "Vampires",
    "Romance",
    "Demons",
    "Fantasy",
    "Contemporary"
  ],
  "author": "Jacqueline Rhoades",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/15715599-guardian-s-hope"
}