{
  "title": "Apostles of Disunion: Southern Secession Commissioners and the Causes of the Civil War",
  "description": "In late 1860 and early 1861, state-appointed commissioners traveled the length and breadth of the slave South carrying a fervent message in pursuit of a clear to persuade the political leadership and the citizenry of the uncommitted slave states to join in the effort to destroy the Union and forge a new Southern nation.Directly refuting the neo-Confederate contention that slavery was neither the reason for secession nor the catalyst for the resulting onset of hostilities in 1861, Charles B. Dew finds in the commissioners' brutally candid rhetoric a stark white supremacist ideology that proves the contrary. The commissioners included in their speeches a constitutional justification for secession, to be sure, and they pointed to a number of political \"outrages\" committed by the North in the decades prior to Lincoln's election. But the core of their argument, the reason the right of secession had to be invoked and invoked immediately, did not turn on matters of constitutional interpretation or political principle. Over and over again, the commissioners returned to the same: that Lincoln's election signaled an unequivocal commitment on the part of the North to destroy slavery and that emancipation would plunge the South into a racial nightmare.Dew's discovery and study of the highly illuminating public letters and speeches of these apostles of disunion -- often relatively obscure men sent out to convert the unconverted to the secessionist cause -- have led him to suggest that the arguments the commissioners presented provide us with the best evidence we have of the motives behind the secession of the lower South in 1860-61. Addressing topics still hotly debated among historians and the public at large more than a century after the Civil War, Dew challenges many current perceptions of the causes of the conflict. He offers a compelling and clearly substantiated argument that slavery and race were absolutely critical factors in the outbreak of war -- indeed, that they were at the heart of our great national crisis.",
  "genres": [
    "History",
    "Civil War",
    "Nonfiction",
    "American Civil War",
    "American History",
    "School",
    "Historical"
  ],
  "author": "Charles B. Dew",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/1054644.Apostles_of_Disunion"
}