{
  "title": "حدائق الرئيس",
  "description": "على الخط الفاصل بين السلطة والناس، أو بين الجلاد والضحية، تتحرك رواية (حدائق الرئيس)، وتقول من خلال هذه الحركة حكايات ثلاثة من أبناء العراق كلهم (أبناء شق الأرض) التوصيف الذي اختاره \"محسن الرملي\" لثلاثة أبطال استثنائيين: طارق بن ظاهر إمام المسجد، عبد الله بن شق الأرض وصار ابن صالح، وإبراهيم بن سهيل الدمشقي. ولد الثلاثة سنة 1959 في أشهر متتالية، ومنذ حَبوهم ولعبهم عراة المؤخرات، في التراب قرب أمهاتهم المتجمعات بجوار التنانير، أو أمام أبواب بيوتهن، في المساءات، لتبادل الثرثرة وأخبار الناس التي يسمينها (عُلوم)، صاروا أصدقاء لا يفترقون إلا للنوم في دور الأهل وأحياناً يبيت أحدهم في دار الآخر إذا ما زعل من أهله أو تأخر في السهر. معاً أصيبوا بمرض الحصبة ومعاً شُفوا منه، معاً تعلموا المشي والسباحة وصيد العصافير، تربية الحمام، سرقة البطيخ والرمان وألعاب الرماية والاختباء وكرة القدم. معاً دخلوا المدرسة وكانوا يدافعون عن بعضهم أمام اعتداءات بقية التلاميذ، ويدرسون للامتحانات وسط الحقول أو في غرفة أحدهم ليلاً. هذا الفضاء الروائي ينهض به خطاب له مواصفاته الخاصة، سواء على مستوى السرد أو الحوار أو اللغة، فعلى مستوى السرد يتحرك الروائي بين الوقائع والذكريات، وكثيراً ما تشكل الذكريات ملاذاً من الوقائع القاسية وهنا تجنح اللغة السردية نحو الوصف، \"... قالوا: ماذا نفعل يا شيخ.. أندفن الرؤوس لوحدها أم ننتظر حتى نعثر على أجسادها وندفنها سوية؟ لقد قُتلوا في بغداد، أو في الطريق إليها، وبغداد الآن فوضى تغص بالجثث المجهولة والمفخخات والأجانب والكذب، وربما من الاستحالة العثور على جثثهم...\". وعلى مستوى الحوار، نجح الروائي في المزج بين طريقتي السرد والعرض في تصوير الشخصيات وخطاباتها، فيتخذ لصوته دوراً في الكشف عن نوازعها وأفكارها وسلوكها، وتباين أصواتها ونبراتها الاجتماعية المختلفة، وحتى مواقعها كما في حديثه عن \"قصور الشعب\": \"... سيادته يقول إنها قصور للشعب، فهو يحب الشعب والشعب يحبه. كما أنها تعطي صورة مشرفة عنا، وتُبين للضيوف الأجانب الذين يزورون بلدنا مدى العز الذي يعيش فيه الشعب العراقي...\" وهذا ما يعزز البعد الواقعي للتناقض/الهوة بين السلطة والشعب ويعكس أيضاً روح المجتمع الذي تتناوله. أما اللغة فهي على قدر من السلاسة والوضوح، تجنح نحو تصويرية إنشائية جميلة تبقى محافظة على المضمون والوقائع، وأكثر تعبيراً عن الخصوصية العراقية، الاجتماعية والفردية لمنطوق الشخصيات ومراميها الحيوية. وهكذا استطاع \"محسن الرملي\" أن يُعبر عن أكثر حالات الإحباط البشري والشعور بعبثية الأقدار أمام مصير شعب بأكمله، تتبدل الوجوه ويبقى الظلم، والجلاد، أصبح فرنجي برنجي كما يقول اللبنانيون، فعلى مدى نصف قرن، لم تتبدل حياة الناس البسطاء، الحروب، الحصار، المقابر الجماعية وفوضى الاحتلال، التي يضيع فيها دم إبراهيم، كرمز للدم العراقي، في هذه الرواية بين فلول نظام سابق وأتباع نظام تلاه. \"حدائق الرئيس\" هي أكثر من رواية، هي حكاية وطن، بين عراق الأمس وعراق اليوم، يصوغها محسن الرملي، ليفضح من خلالها زيف ديمقراطيات العالم المتقدم، وهو يجرب أسلحته في صدور أبناءنارواية \"حدائق الرئيس\" هي عمل حافل بالأحداث والتواريخ والمواضيع والشخصيات التي من أبرزها شخصية عبدالله كافكا، طارق المُندهِش وإبراهيم قِسمة. ولِد الثلاثة في أشهُر مُتتالية، ومنذ حَبوهم ولعبهم عُراة في التراب قرب أمهاتهم المتجمعات بجوار التنانير أو أمام أبواب بيوتهن، في المساءات، لتبادل الثرثرة وأخبار الناس التي يُسمينها (عُلُوم)، صاروا أصدقاء لا يفترقون إلا للنوم. معاً أُصيبوا بمرض الحصبة ومعاً شُفوا منه، معاً تعلموا المشي والسباحة وصيد العصافير، تربية الحمام، سرقة البطيخ والرمان وألعاب الرماية والاختباء وكرة القدم. تسرد هذه الرواية سيرتهم ومن خلالها جانباً من تاريخ العراق على مدى نصف قرن، وكيف انعكست أحداثه على حياة الناس البسطاء. الحروب، الحصار، الدكتاتورية، الأسر في إيران، غزو الكويت، المقابر الجماعية وفوضى الاحتلال التي يضيع فيها دم إبراهيم، كرمز للدم العراقي، بين فلول نظام سابق وأتباع نظام تلاه، فتُيسر لقارئها فهم تعقيد التاريخ العراقي الحديث بمآسيه المتلاحقة عبر قَص شيق في 28 فصلاً، من بين عناوينها: أبناء شَق الأرض، سَفر بقَدم واحدة، عَودة كافكا من الأَسر، شَوكة البحر، سِر الفضيحة التي لم تُفضَح، طفولة في صندوق عسكري، الرئيس يقتل الموسيقي، جثث ودفاتر، عرس نَسمة، آكلو الورد، لقاءات الأحياء والأموات وزواج مُكرّر. محسن الرملي، وبعد نجاح روايتيه \"الفتيت المبعثر\" و\"تمر الأصابع\" ونشرهما بالإنكليزية والإسبانية، قد وعد قُرّاءه بهذا العمل \"حدائق الرئيس\" في لقاءات صحفية وبرامج تلفزيونية منها تحقيق أعدته عنه القناة الرسمية الأسبانية، مكرراً تنبيهه ورفضه لاعتبار الضحايا مجرد أرقام، كما تَذكُر الصحافة، وإنما \"هم أناس لهم تاريخ وعوائل وأحلام وتفاصيل. كل شخص هو عالَم قائم بذاته.. ومن بين مهام الأدب تبيان ذلك\".",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Novels",
    "War",
    "Literature",
    "Historical",
    "Contemporary"
  ],
  "author": "محسن الرملي",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/15715911"
}