{
  "title": "IMPOSSIBLE JOURNEY, A Tale of Times and Truth",
  "description": "IMPOSSIBLE JOURNEY is a unique science fiction novel! It's truly a sci-fi (specifically time-travel) novel with a purpose!!What do these historical eras have in common: 1)the California gold rush, 2)early colonial America, 3)the renaissance, 4)the reformation, 5)the time of Camelot and 6)the Roman era? They all contain valuable lessons which point to ultimate truth.What do a group of future scientists from all over the world have in common? A desire for truth, hope for a bright future and a belief in a Divine being of some sort.Put all the above elements together and you have an explosive formula for a great sci-fi novel, a fantasy adventure novel which could also be of interest to fans of historical fiction and Christian fiction as well as those of science fiction.In the future, when time-travel is theoretically proven an universally accepted, a group of scientists of all faiths decide to try to time-travel back to the Garden of Eden in order to prevent the fall of man and thus put an end to all sin, sickness and disease. They manage to gain the backing for the project from a wealthy financier. The trouble is, they can only go back 200 years, more or less, at a time and will have to make repairs to the time cylinder at every stop. Thus, they visit the historical California gold rush and then early Colonial America. Then, they are pulled forward unexpectedly to a future time of trouble, where robots serve, and forced to fight in a senseless war. They manage to break free and take off only to discover they have a stow-away. But the stow-away has a device which will help them to go further back with each leap. Thus, they then time-travel to the Renaissance and meet the historical figure, Leonardo Da Vincie, But, by mistake they take off without the stow away and his device. Then, they are pulled forward again, but only to the time of the Reformation, where they meet Martin Luther and have an argument over faith. Then, with the help of a new fuel formula, using alcohol, they manage to arrive at Camelot and finally, Ancient Jerusalem, where they at last realize the real answer: the true end & goal of their mission.The e-book is available on Smashwords.com in many reading formats including KINDLE",
  "genres": [],
  "author": "James M. Becher",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/15716007-impossible-journey-a-tale-of-times-and-truth"
}