{
  "title": "In Harm's Way",
  "description": "In Harm’s Way, Book 3 in the Surviving the Zombie Apocalypse series, picks up on Day 8 where “Soldier On: Surviving the Zombie Apocalypse” left off.Outbreak - Day1Like a fragile house of cards in a hurricane, Presidents, Premiers, entire governments and their ruling bodies disappeared instantly. Some had ensconced themselves in deep underground bunkers or remained holed up in fortified strongholds, but history would tell that most had been swallowed up by the dead - never to be heard from again.Infection rates skyrocketed in the United States’ largest cities the first days of the outbreak, as the rapacious dead delivered the Omega virus with emotionless efficiency. During the ensuing days, the rest of the country and the world shared the same fate as Omega spread exponentially from within the mega population centers, pulsing into the countryside, a rotten, shambling diaspora. It had taken 3.7 billion years for man to evolve from a universal common ancestor – to stop dragging his collective knuckles - finally to emerge the dominant species, complete with shiny new iPads, Smartphones, worldwide non-stop air travel, and all manner of high tech war machines. Yet it had taken one microscopic manmade virus only three days to deliver mankind, on its collective knees, to the doorstep of extinction. Outbreak – Day 8After running and gunning across much of the western U.S., Cade Grayson, former Delta Force operator, is finally reunited with his wife Brook and daughter Raven. Hours after arriving at the relative safety of Schriever Air Force Base in Colorado Springs, the new Capital of the United States, Cade is approached by the new President, Valerie Clay. Her request is simple: she appeals to the patriot in him to rejoin the Unit that he left for civilian life fifteen months prior and once more go into harm’s way, taking the fight to the enemy.Meanwhile, Duncan Winters, Vietnam-era aviator, finds himself stranded in Springs along with BLM firefighter Daymon Bush. Both men arrived with Cade and were promised transport back to Eden, Utah. Duncan longs to be reunited in Eden with his brother Logan, a survivalist/ Doomsday prepper. Daymon, with no surviving family, knows only one thing for certain: he doesn’t want to remain trapped behind the wire inside of a huge government-run military base.Mere days after Washington D.C. is overrun and the sitting President goes missing, Robert Christian, billionaire kingmaker who has been waiting in the wings for a world-changing event such as this, marshals his group of mercenaries led by ex-SEAL Ian Bishop. Their mission: to control what remains of the United States by any means necessary and ultimately reshape the country to fit their warped vision for a new world order.Will Cade accept President Clay’s overture and embark on a new high priority mission alongside his friend and mentor, Delta Commander General Mike Desantos?Will Brook Grayson continue to hone her newly found survival skills and successfully train her eleven-year-old daughter Raven to defend herself against the undead threat?Will Captain Ronnie Gaines and his SF soldiers from Fort Kit Carson succeed in clearing downtown Springs of the zombie menace?Will Duncan and Daymon survive their flight from Schriever Air Force Base and find the survivalist group in Eden? Can the human race survive what appears to be its final extinction level event?",
  "genres": [
    "Zombies",
    "Horror",
    "Apocalyptic",
    "Post Apocalyptic",
    "Action",
    "Fiction",
    "Horror Thriller"
  ],
  "author": "Shawn Chesser",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/15716062-in-harm-s-way"
}