{
  "title": "Bury Me In Smoke",
  "description": "The world is a hard, cold place, and that was before the living dead trampled it underfoot. This warrior would be one to know. He never did have an easy path, and this morning is no exception as he stares at the glittering ruins in the distance. New Orleans. The city is now a crumbling maze, haunted by psychotic warlords leading bloodthirsty gangs. Even from the road, he can feel the presence of other survivors... scavengers, warriors, like him. His own brand of coldness has kept him alive this long, but there's no way in hell he can go on without ammo. His choices are Nola, or death. But the Big Easy has her generous moments. A wayward woman crosses his path, the rarest prize a heart as black as his could hope for. But isn't it just his luck? This prize has fire in her belly-- and a bounty on her head. \"Set in a post-apocalyptic New Orleans, this 71-page horror novella follows a lone survivor’s treacherous journey through the zombie-filled swamps and corpse-strewn streets of Louisiana, armed with only six shells in his shotgun. The hardened (and extremely horny) ex-soldier crosses paths with a heavily armed woman with an unknown agenda, who is being hunted by a New Orleans warlord and his meth-head biker cronies. The two survivors’ fates become intertwined as they struggle to evade the depraved hillbilly bikers, dodge and decapitate the infected, and have rough and dirty post-apocalyptic sex. Though the zombie apocalypse genre may seem played out, SLUG Mag’s own Megan Kennedy keeps it fresh and brutal with plenty of graphic violence, sex and even a dose of Slayer. Think Zombieland plus Cormac McCarthy’s The Road plus sexy pulp fiction novel. Kennedy’s engrossing storytelling makes Bury Me In Smoke a quick and entertaining read, and a perfect Halloween mood-setter. This blood-stained e-book is available for free download at smashwords.com or on Amazon, and links to Kennedy’s other short stories and poems can be unearthed at duskblood.tumblr.com.\" - Cody Kirkland, SLUG Magazine",
  "genres": [],
  "author": "Megan Kennedy",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/15716382-bury-me-in-smoke"
}