{
  "title": "Sheer Purgatory",
  "description": "An hilarious romp through the Afterlife in a Douglas Adams meets Terry Pratchett kind of way. If Monty Python had shot another movie, this would probably have been the one they shot dead. Dan arrives in Purgatory with Victor 3157, his well-meaning but incompetent guardian angel, where he finds he has to wash away his sins, outsmart angelic security and figure out how to get his life back.“Divine Comedy!” – The Wednesday Times.It’s 8 a.m. in London, England, and Dan Trench is having a very bad morning. He has a terrible hangover from the night before, his girlfriend has left a message that she wants to talk to him right now, and he has left something he should not have lost in one of the bars he visited last night. But things are about to get very much worse, as unknown to him, his hapless guardian angel, Victor 3157, is also on his case. Dan is about to discover a whole new world where souls are washing away their sins in a place where they do things differently ... Historical novelist, Robert Carter, takes us on a detour into humor with his latest book, Sheer Purgatory. The author offers a glimpse into an afterlife that awaits 95% of us, whether we believe in it or not. Carter “I happened to read in the Daily Telegraph that Pope Benedict XVI had abolished Limbo, and I thought, well, if he doesn’t want it, I’ll have it.” The annexation of Purgatory soon followed.Sheer Purgatory leads its readers through territory beloved of fantasy fans and Python geeks everywhere. Carter’s background in physics has helped him create a consistent world running on rules that turn human behavior on its head, a world made not of matter and energy, but of ectoplasm and ether. From the moment of his demise, the hero must learn to get along and accomplish his goal of setting right a great injustice, and in the process discovers a whole new understanding of how things work on Planet Earth. “With a bit of luck,” says Carter, “Dante will be turning in his grave.”Sure to become a contemporary fantasy classic, Sheer Purgatory is fun-poking comedy at its best.",
  "genres": [
    "Fantasy",
    "Humor",
    "Young Adult",
    "Adventure",
    "Religion",
    "Fiction",
    "Comedy"
  ],
  "author": "Robert    Carter",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/15716710-sheer-purgatory"
}