{
  "title": "Show Me Yours",
  "description": "Dear Author,It seems like we've known one another for ever, but he doesn't really know me at all. He doesn't know I'm gay and I'm really scared what will happen when he finds out. Especially when he finds out that I don't want to be just friends anymore.Josh and Trey have been friends since they were kids, but Josh moved away when they were both seventeen. Their bond has been thinned by distance, by the weight of secrets withheld and a trust betrayed. For years now they've only exchanged short emails and occasional calls, over too many miles to cross. Trey's been willing to live with that, even encouraged it. Because letting Josh get close again might make keeping Trey's secrets impossible.When Josh shows up on Trey's doorstep with a request for help, it could well be an unmitigated disaster. But Trey finds he can't say no. This is Josh asking Trey to lend a hand. Josh, the guy who still pushes every other man Trey ever looked at to second place. So Trey's going to take the chance and say yes. He's going to grab a few days with the straight guy he never stopped loving, take what crumbs he can get, and damn the consequences. Although those consequences may not turn out to be the ones Trey's expecting.Photo Description: Two dark-haired young men share a playful moment beside the ocean, framed against a backdrop of waves crashing on a rocky shore. Both men are laughing, wet and tanned, wearing only Speedos. The slimmer man reaches forward to snag the waistband of his friend's swim trunks, pulling them back in a way that exposes part of the other man's taut, rounded ass. The more muscular man reaches back with a hand planted on his friend's close-cropped head, shoving him away.This story was written as a part of the M/M Romance Group's \"Love is Always Write\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story.Read the story online or find it in Love Is Always Write: Volume 8.",
  "genres": [
    "M M Romance",
    "Friends To Lovers",
    "Contemporary",
    "Romance",
    "Contemporary Romance",
    "Short Stories",
    "Erotica"
  ],
  "author": "Kaje Harper",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/15719619-show-me-yours"
}