{
  "title": "A MASTER MARINER'S TALE: The Adventures of a Reluctant Secret Agent",
  "description": "A Master Mariner’s Tale is a captivating naval adventure that takes the reader on a thrilling journey along the coast of County Durham, North Yorkshire, and Northumberland in 1881. Europe is a boiling cauldron of warring states, fledgling nations, political scheming, and meddling in the internal affairs of neighbouring nations. Five major powers hold the fragile peace together. Great Britain watches and waits for the tinderbox to spark igniting hostilities between Russia, France, Austria, and Germany. The German Chancellor, Prince Otto von Bismarck is at the centre of all the political manoeuvring and meddling in the affairs of other nations and always to the advantage of Germany. However, before the pulse-pounding action and heart-stirring escapades commence, I invite you to explore the rich tapestry of Seaham, a quaint coastal maritime town, and experience the daily existence of a seasoned mariner aboard a sailing collier ship designed to serve the coal trade along this coast.The first three chapters serve as an essential prologue, meticulously detailing the picturesque town of Seaham during the pivotal year of 1881. Transporting you back in time, these initial chapters paint a vivid portrait of the town's bustling docks, charming streets, and the close-knit community that thrives in harmony with the sea. As we explore the setting, you will be introduced to key characters whose lives intertwine with the tale's protagonist, Captain Richard Raine, a seasoned master mariner renowned for his sailing skills. Richard is an honourable man who believes strongly in his principles and is more concerned about his family, the working conditions of his crew, the weather and loyalty to his employer and shipowner Mrs Anderson. He has never shown any interest in the delicate diplomatic issues that plague international affairs and relationships between countries.Chapter One: \"The brigantine William Thrift\" opens the curtains to this captivating story, providing a glimpse into the day-to-day routine on board the workhorse of the sailing fleet used in the coal trade - the collier brigantine. From the rhythmic sound of waves caressing the shore to the scent of salt in the air, you will experience the life of a hardworking mariner like never before.Chapter Two: \"The brave sea pilots of Seaham Harbour\" unveils the enchanting world of a mariner. Through the eyes of our protagonist, Captain Richard Raine, you will gain insight into the daily routines, challenges, and camaraderie shared amongst the sailors aboard the collier sailing ship, \"The William Thrift.\" The chapter explores the intricacies of ship navigation, the hierarchy of the crew, and the sailor's unwavering bond with the ever-changing ocean.Chapter Three: \"Into the town\" further unravels the master mariner's existence, exploring the relationship that naturally existed between the ship captain and the ship owners. The trials and triumphs of maritime living emphasize the resilience and spirit that define these intrepid souls who call the sea their home.With a solid foundation laid in these initial chapters, the true adventure begins to unfurl in Chapter Four. Brace yourself as Captain Raine and his crew find themselves entangled in a breathtaking saga. Richard Raine could never have imagined the adventure that was to unfold when he sailed out of Seaham Harbour in April 1881 and the part he would play in maintaining the fragile peace that existed in Queen Victoria’s empire encountering both perilous adversaries and unlikely allies.So, dear reader, before you embark on the tumultuous odyssey that lies ahead, take a moment to savour the charm of Seaham and to fathom the essence of a mariner's life on board a sailing ship. For it is within these pages that the heart and soul of our tale reside, shaping the destiny of the extraordinary voyage that awaits you beyond Chapter Three. Bon voyage!",
  "genres": [],
  "author": "Fred   Cooper",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/15719614-a-master-mariner-s-tale"
}