{
  "title": "Never Say Goodbye",
  "description": "‘Never Say Goodbye…’ is a story of relationships getting complicated because of situations and surroundings. It is a story of an extra-marital affair and how it is looked at from a woman’s and a man’s perspective. It is a story of how the field of genetics can affect a person’s thoughts and approaches to ethics in science.The characters in the book are simple at times, complex at the other, but easy to relate with. The story is pacy and delivers unexpected twists at the most unexpected times. Anjali, is a young doctor, who is driven by an urge to do much more than just medicine. An infatuation leads to her marrying a businessman, and into a joint family, where studies and education take second place. Even her husband has a very different outlook to life. They are, literally, moving on different paths in life, and Anjali realises this only when she meets Aakash who, too, is a doctor. From being her mentor, Aakash gradually becomes her soul mate and their relationship reaches a flashpoint as they fight an outbreak of plague in a tiny village in north India. Anjali goes headlong into the relationship, not caring about the consequences but Aakash preaches to her about the strengths of the institution of marriage in India and how extra-marital affairs are, rightly or wrongly, frowned upon in India. Their approaches to the relationship reverse when Anjali gets pregnant with his child. Anjali goes on to study human genetics at an institution in the UK. At the end of the programme, she is entrusted with the task of setting up a laboratory in Shillong to research on therapeutic cloning. The institution is keen on the laboratory being located in a remote place where the laws on cloning research are less stringent than in the UK. Over a few years, without Anjali realising it, the laboratory moves towards successful research into techniques for human cloning. Anjali thinks this is unethical and resists pressure to actually clone a human being.What follows is an emotion-arousing sequence of events. At times you will just love Anjali, and at times you will hate her for the way she relates to people. But that regardless, you will never want to press the pause button until you finish the roller-coaster ride which the author takes you through.",
  "genres": [
    "Romance"
  ],
  "author": "Rajiv Seth",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/15719916-never-say-goodbye"
}