{
  "title": "Lonely Mirrors",
  "description": "A Wartime Romance in World War 2From the Welsh Valleys and London to Cairo during the Second World War, this explicit and deeply moving account of mothers and daughters coming to terms with rapidly changing social attitudes towards marriage and the sexual habits of contemporary lifestyles make for a real page-turner of a début novel. It is a World War 2 romance novel, because that is when the story began, but it is much more than that, it goes on to explore the relationships that evolve over the decades following the war and the impact that this illicit love affair has on the lives of the very complex and different characters involved.Women in Love and Secret AffairsSusannah Carlton deals with love and jealousy with few holds barred. The characters in this book are forensically examined and the motives of the women involved are laid bare leaving little to the imagination. There are parts that are sexually explicit and other parts that are deeply moving at an emotional level. Women in World War 2 had to live very differently to women in contemporary times, social standards and the perspectives on how women should behave have changed beyond recognition during the 70 years since the end of the war. Secret affairs are much more commonplace in a modern world.Men and Women at WarYoung people under extreme pressure and away from their normal family environment can sometimes give in to temptations which under normal circumstances they would be able to resist. Is it so wrong to seek comfort when you are away from loved ones in a foreign place? Some did and paid a high price for doing so, this is one such story.In modern times there is almost an expectation that relationships will eventually fail and that people will go their separate ways. Secret affairs are often the cause. But years ago separation was not an option, marriage was for life and there were no second or third chances, no matter how miserable you were. This romantic fiction shows how a brief and passionate affair during World War 2, between a doctor and a nurse, had ramifications that extended through generations to the present day. And no one was more affected than the perpetrators themselves!Secret Affairs and Illicit Love With A PunchFamily lives are seldom straightforward. In this book, the insights revealed suggest a narrative honesty that will ensure Susannah’s next book will be much awaited. Romantic books with such a punch are rare nowadays. Don’t miss this if you love reading about true conflict within marriages, women at war and all spawned by an unfaithful husband more than 70 years ago. The women in the story are not always shown in the best of light, but it is a fascinating assessment of the times they lived in, the personalities involved and the interaction between the different relationships of sisters, mothers, daughters and wives as social rules evolved following the second world war to current times. This is a book you may want to keep away from your partner, lest he should learn too much!",
  "genres": [],
  "author": "Susannah Carlton",
  "average_rating": "4.86",
  "url": "https://www.goodreads.com/book/show/15719870-lonely-mirrors"
}