{
  "title": "The Leftovers",
  "description": "A startling, thought-provoking novel about love, connection and loss from the New York Times bestselling author of The Abstinence Teacher and Little Children.What if the Rapture happened and you got left behind? Or what if it wasn't the Rapture at all, but something murkier, a burst of mysterious, apparently random disappearances that shattered the world in a single moment, dividing history into Before and After, leaving no one unscathed? How would you rebuild your life in the wake of such a devastating event?This is the question confronting the bewildered citizens of Mapleton, a formerly comfortable suburban community that lost over a hundred people in the Sudden Departure. Kevin Garvey, the new mayor, wants to speed up the healing process, to bring a sense of renewed hope and purpose to his traumatized neighbours, even as his own family falls apart. His wife, Laurie, has left him to enlist in the Guilty Remnant, a homegrown cult whose members take a vow of silence but haunt the streets of town as \"living reminders\" of God's judgment. His son, Tom, is gone, too, dropping out of college to follow a sketchy prophet by the name of Holy Wayne. Only Kevin's teenaged daughter, Jill, remains, and she's definitely not the sweet \"A\" student she used to be. Kevin wants to help her, but he's distracted by his growing attraction to Nora Durst, a woman who lost her entire family in the tragedy, and is still reeling three years later, groping for a way to face the remainder of her life.Through the prism of a single family, Perrotta illuminates a familiar America made strange by grief and apocalyptic anxiety. The Leftovers is a powerful and deeply moving book about people struggling to hold on to a belief in their own futures.",
  "genres": [
    "Fiction",
    "Book Club",
    "Fantasy",
    "Science Fiction",
    "Dystopia",
    "Audiobook",
    "Contemporary"
  ],
  "author": "Tom Perrotta",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/10548922-the-leftovers"
}