{
  "title": "Ice Within The Soul",
  "description": "It was probably more than decade ago when I developed the Ice Within the Soul. At that time the phrase represented the pure evil of serial killers, murderers & pedophiles. Those that went into murderous rages with no remorse for those they inflicted pain upon. It was a time when horrible senseless crimes seem to fill minutes of the evening news and pages of the daily paper. All too often my traumatized eyes cringed while processing such reprehensible violence against human beings. At that moment I wondered how the world seemed to breed so many cruel and twisted human beings. Sadly, not every serial killer, pedophile, murder or bully looks like a monster. Some may even exhibit a handsome and respectable façade. Their looks used a as a tool to subdue the unsuspecting prey into their deceptive wicked web. Slowly, though the dark evil core and the ice within the soul bleeds through and becomes a tragic reality. This is not a horror story, but one child’s journey through the first four decades of her life. Moe Bender arrived in this world wide eyed and wondrous. Where every child’s a prodigy absorbing the vast amounts of knowledge from their surroundings. As a young five year old, Moe Bender relied on her intuition and quickly learned you shouldn’t always obey adults. Moe’s ability to sense concealed evil or passive aggressive emotions such as resentment and anger were felt as a palpable internal alarm! Her story begins at a time when the innocent years weren’t always carefree or free from pain. That good everyday people can also have varying degrees of “ice” within all their souls. That mass murders were just one extreme end of the spectrum. Moe Bender was one of six siblings with a special bond that was slowly falling apart. The flashes of the young girls’ destiny came as visions. She followed those visions and tried to decipher the gift of feeling the emotions of those around her. It wasn’t always a gift but a curse. To a young child it was confusing to see a smile on one’s face but feeling the intense hostility from across the room. Many of us have witnessed first hand how harboring anger or resentment over a period of years is capable of great destruction, especially to a family. Like a contagious disease spreading quickly to every member. When you see a vision of what is to come years from now…how do you stop it? How do you melt the ice within the soul of those you love and even your own?",
  "genres": [],
  "author": "Shawn Maureen McKelvie",
  "average_rating": "4.75",
  "url": "https://www.goodreads.com/book/show/15722320-ice-within-the-soul"
}