{
  "title": "Kaki yang Terhormat",
  "description": "Menurut Anda, bagian tubuh manakah yang paling penting? Saya yakin, tak mudah untuk langsung menjawab. Tetapi, bila hal itu ditanyakan kepada nenek saya, serta-merta ia akan bilang, “Kaki!” seraya mengangkat sebelah kaki, dengan telunjuk menukik lurus ke bawah, dalam hitungan yang tak mencapai detik.….Sebetulnya, kalau mau jujur, bukan hanya Nenek yang bangga. Banyak dari keluarga kami, yang bila ngobrol, tak bisa menyembunyikan perasaan bangga kepada keluarga lain. Bahkan, bukan hanya keluarga kami. Banyak dari penduduk kampung, yang bila ngobrol, juga tak bisa menyembunyikan bangga kepada penduduk kampung lain. Maka, keyakinan Nenek pada kaki, berkembang bagai tak terbantahkan. Seperti tak cukup kalau kaki hanya dikatakan penting. Kaki adalah sesuatu yang terhormat.….Kaki yang Terhormat adalah kumpulan cerpen yang memuat cerpen-cerpen realis Gus tf Sakai dalam masa 25 tahun kepengarangannya, mulai dari “Bulan Setempayan” yang ia tulis saat berusia 19 tahun dan memenangi sayembara menulis cerpen di sebuah majalah, sampai “Kaki yang Terhormat” yang terpilih sebagai salah satu Cerpen Pilihan Kompas 2009. Merupakan kumpulan cerpennya yang ke-5 setelah Istana Ketirisan (Balai Pustaka, 1996), Kemilau Cahaya dan Perempuan Buta (Gramedia, 1999), Laba-Laba (Gramedia, 2003), dan Perantau (Gramedia, 2007). Kemilau Cahaya dan Perempuan Buta menerima Penghargaan Sastra Lontar 2001 dan Penghargaan Sastra Pusat Bahasa 2002. Perantau terpilih sebagai fiksi terbaik pilihan pembaca Ruang Baca Koran Tempo 2007 dan meraih Penghargaan Sastra Khatulistiwa 2007. Kemilau Cahaya dan Perempuan Buta telah diterjemahkan ke bahasa Inggris oleh The Lontar Foundation dengan judul The Barber and Other Short Stories (2002) dan menerima SEA Write Award dari Kerajaan Thailand (2004).",
  "genres": [
    "Indonesian Literature",
    "Short Stories",
    "Fiction"
  ],
  "author": "Gus tf Sakai",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/15722644-kaki-yang-terhormat"
}