{
  "title": "Black Against Empire: The History and Politics of the Black Panther Party",
  "description": "In Oakland, California, in 1966, community college students Bobby Seale and Huey Newton armed themselves, began patrolling the police, and promised to prevent police brutality. Unlike the Civil Rights Movement that called for full citizenship rights for blacks within the U.S., the Black Panther Party rejected the legitimacy of the U.S. government and positioned itself as part of a global struggle against American imperialism. In the face of intense repression, the Party flourished, becoming the center of a revolutionary movement with offices in 68 U.S. cities and powerful allies around the world.Black against Empire is the first comprehensive overview and analysis of the history and politics of the Black Panther Party. The authors analyze key political questions, such as why so many young black people across the country risked their lives for the revolution, why the Party grew most rapidly during the height of repression, and why allies abandoned the Party at its peak of influence. Bold, engrossing, and richly detailed, this book cuts through the mythology and obfuscation, revealing the political dynamics that drove the explosive growth of this revolutionary movement, and its disastrous unraveling. Informed by twelve years of meticulous archival research, as well as familiarity with most of the former Party leadership and many rank-and-file members, this book is the definitive history of one of the greatest challenges ever posed to American state power. Read an excerpt here: Black Against Empire: The History and Politics of the Black Panther Party by Joshua Bloom and Waldo E. Mart... by University of California Press Listen to an interview with the authors here:http://www.ucpress.edu/book.php?isbn=...",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "Race",
    "African American",
    "Social Justice",
    "American History"
  ],
  "author": "Joshua Bloom",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/15722514-black-against-empire"
}