{
  "title": "Pulse of Heroes",
  "description": "WINNER OF 2011 INDIE BOOK OF THE YEAR!!!! At Paranormal Reads!A suspenseful, passionate, paranormal romance that sweeps through the emotions of first love and heartache as it traverses centuries and continents.Michelle used to feel like she was behind in everything, especially school and relationships. Her great aunt from the old country says she is like a bland meal, \"no salt or pepper\". But in junior year, everything changes. Her father takes a position on the Town Council, a popular boy in school becomes interested in her, and most importantly, the Hekademos Learning Center, a private school for 'troubled' students, moves into her quiet neighborhood amidst the protests of the entire town.After an embarrassing fall over the school wall, Michelle meets Elliot and her ordinary ‘bland’ life changes its course forever.Elliot is no ordinary human. In fact, no one at the Hekademos Learning Center is. Beautiful and fierce, they have survived throughout the millennia by weaving in and out of human events. Through them, Michelle learns that history and myths from around the world are dotted with references to their kind. Michelle falls madly in love with the ever-striking and mysterious Elliot and, as much as he tries to fight it, he develops strong feelings for her as well. Although Elliot carries numerous painful memories from his many pasts, he disregards his own better judgment and the advice of his friends, and finds himself falling for Michelle‘s offbeat personality. Their feelings grow in intensity, but when History catches up with them, the difference between their life paths threatens to destroy any future that they might have had together.Michelle learns that there are infinite shades of gray between black and white, and has to deal with the bundle of contradictory emotions called love. She has to trust her intuition in order to face the danger and uncertainty of being drawn into Elliot’s wondrous world. Ultimately, it is up to Michelle to make the split-second, life-altering decision that will either tear them apart forever, or give them another chance.",
  "genres": [
    "Romance",
    "Paranormal",
    "Fantasy",
    "Young Adult",
    "Paranormal Romance",
    "Mythology",
    "Supernatural"
  ],
  "author": "A. Jacob Sweeny",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/10550107-pulse-of-heroes"
}