{
  "title": "Fairy Tales",
  "description": "Fairy Tales, by Hans Christian Andersen, is part of the Barnes & Noble Classics series, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of Barnes & Noble Classics: New introductions commissioned from today's top writers and scholars Biographies of the authors Chronologies of contemporary historical, biographical, and cultural events Footnotes and endnotes Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work Comments by other famous authors Study questions to challenge the reader's viewpoints and expectations Bibliographies for further reading Indices & Glossaries, when appropriateAll editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. Barnes & Noble Classics pulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works.Who has not laughed at the emperor’s new clothes, thrilled to the song of the nightingale, or sympathized with the ugly duckling? In the 170 years since they first began to appear, Hans Christian Andersen’s Fairy Tales have entranced and bewitched millions of readers, adults and children alike.  Writing in the midst of a Europe-wide rebirth of national literature, Anderson broke new ground with his fairy tales in two important ways. First, he composed them in the vernacular, mimicking the language he used in telling them to children aloud. Second, he set his tales in his own land and time, giving rise to his loving descriptions of the Danish countryside. In contrast to such folklorists as the Brothers Grimm, Anderson’s tales are grounded in the real and often focus on the significance of small or overlooked things. Here are all of Andersen’s collected tales, many—such as “The Little Mermaid,” “The Red Shoes,” and “The Steadfast Tin Soldier”—still popular through modern adaptations, and others, including “The Flying Trunk” and “The Most Incredible Thing,” well worth rediscovering. Jack Zipes is professor of German and comparative literature at the University of Minnesota. A specialist in folklore and fairy tales, he has authored numerous books of criticism over the last thirty years and edited several major anthologies, including the Norton Anthology of Children’s Literature (2005). Marte Hvam Hult holds a Ph.D. in Scandinavian languages and literatures from the University of Minnesota. She is the author of Framing a National Narrative: The Legend Collections of Peter Christen Asbjørnsen and a forthcoming translation of Asbjørnsen’s Huldreeventyr.",
  "genres": [
    "Classics",
    "Fiction",
    "Fantasy",
    "Fairy Tales",
    "Short Stories",
    "Childrens",
    "Literature"
  ],
  "author": "Hans Christian Andersen",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/1572454.Fairy_Tales"
}