{
  "title": "Mass Extinction",
  "description": "Once again GR screws it up. They put the subtitle before the title. I hate GR and wish I’d never been part of it. It & it’s troll reviewers are why I quit writing.A literary work with contemporary, social science/fiction overtones. This epic tale of an apocalyptic possibility is told through the experiences of a young woman and those in her immediate circle. They face a worldwide crisis that should have never occurred. It thrusts Elle back to the stress-filled mental state of a previous like-experience. She's barely healed and so grateful her giant black gelding isn't counted among the missing. She’s determined to understand how and why the world's equine species could vanish en masse in the blink of an eye. Knowing is the only thing she believes will save her from repeating her previous breakdown, to be forced to receive more of the horrific treatment which closed the inner doors of her memory. Many events and people are now forgotten to her. One is the love she was discovering with Tommy. By chance they cross paths stirring her memories of a recent past as he realizes Elle’s commitment didn’t lose her permanently for him after all. Together they re-discover their path to find a new territory on this world where the horses run. Elle’s journey begins as her past soon catches up in many unexpected ways. Dream-visions reveal a forgotten Native American connection as more people begin hearing the thunder of running horses and the lone whinny calling their name. Many Lakhóta visionaries from a past age guide Elle and Tommy along with others drawn to join their quest. They discover clues to a scientific phenomenon hidden on the Earth. They can't accept the horses may never return unless they realize their horses knew what they do not--a change will effect Mother Earth and all living upon her. Will it be an awakening or a catastrophe, or both?",
  "genres": [],
  "author": "Judith-Victoria Douglas",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/15726222-mass-extinction"
}