{
  "title": "Public Displays of Eroticism",
  "description": "Public Displays of Eroticism-The secret fantasy, sex in a public place. One couple's sexual antics at a local park inspires four other couples to bare it all in the open air. Featuring short stories by Cassandra Carr, Jami Davenport and Cristal Ryder.Back to Nature by Cassandra CarrA sub and her Master play hooky to indulge their exhibitionism kink and unknowingly start an entire chain of events.Hail Mari by Jami DavenportMeeting Mari Simms for one night of hot sex each year for the past four years is no longer enough for Wyatt Bedford, a ten-year veteran of professional football. This time, he plans on telling her he wants more. While waiting for her in a park, he stumbles upon a sight that changes his game plan and takes their relationship to whole new level. Can Wyatt and Mari find love in the final quarter with the clock ticking? Taking it Outside by Cristal RyderVal sets up an afternoon of play with long-time boyfriend Tyler at a secluded beach. After packing a goodie bag with playthings, she leaves a note for Tyler. While waiting for his arrival, through binoculars Val spots lovers on the distance shore, and when Tyler arrives, together they watch the couple. Voyeurism at its best. Turned on by watching the couple have sex, Val and Ty have their own public display of eroticism.Taking their loving outside is a surprisingly erotic treat neither expected to enjoy as much as they do. But a bigger surprise awaits them, leaving them wondering if there is more to come.A Whole New World by Cassandra CarrAfter witnessing some dirty deeds in the woods, Miranda finds she has some kinks she didn't know about and discovers her boyfriend, Ross, is more than happy to help her explore them.In the Open by Jami DavenportOnce a year, Jaid Angelini takes a break from her demanding career as a criminal defense attorney for a night of passion with young, hot pro-football player Alex Greeley. Despite misgivings about their age difference, Jaid desires a more permanent relationship and concocts a scheme to brand her name on his heart. After witnessing an exhibitionist couple in the park, her plan takes a turn toward the great outdoors. Will Alex and Jaid finally go for the long bomb or settle for minimum yardage?",
  "genres": [
    "BDSM",
    "Erotic Romance",
    "Anthologies"
  ],
  "author": "Cassandra Carr",
  "average_rating": "4.64",
  "url": "https://www.goodreads.com/book/show/15726266-public-displays-of-eroticism"
}