{
  "title": "Schaduwbeeld of Het geheim van Appeltern : Kroniek van een leven",
  "description": "Joan Derk van der Capellen (1741-1784) noemde zich, terecht volgens Jan en Annie Romein in Erflaters van onze beschaving, 'De tribuun der burgerij'.Als jonge man baande hij zich met moeite een weg naar de politiek, door zijn admissie te forceren tot de Overijsselse Ridderschap (1772) en zo tot de Staten. Het is de tijd van de regenten: de Republiek der Verenigde Nederlanden wordt gekenmerkt door oligarchisch, aristocratisch bestuur, stadhouder prins Willem V treedt, onder invloed van zijn voogd en adviseur de hertog van Brunswijk Wolfenbüttel, vaak op als absoluut monarch. Het rommelt weliswaar onder de burgerij, maar dat neemt bij lange na niet zulke vormen aan als in Frankrijk en Amerika. Van der Capellen correspondeert met de 'nieuwlichters' in andere landen. Hij verzet zich in en buiten de Staten steeds meer tegen machtsmisbruik en de behandeling van de burger als een onmondige.In 1781 verschijnt er een hartstochtelijk pamflet tegen Willem V en zijn raadgevers: de bekende Brief aan het volk van Nederland, een oproep aan de natie om oude vrijheden en rechten te verdedigen. Joan Derk ontwierp dit kritische geschrift, waarschijnlijk in samenwerking met zijn vriend de predikant François van der Kemp, op zijn landgoed Huis Appeltern.Hella S. Haasse heeft aan de hand van authentieke tijdsdocumenten een kroniek samengesteld waaruit een beeld ontstaat van Nederland in een weinig bekende periode, te midden van landen in grote beroering. Tevens is het boek een speurtocht naar de persoon en de innerlijke roerselen van Joan Derk baron van der Capellen tot den Pol, een man wiens karakter vol tegenstrijdigheden ons telkens voor raadsels plaatst. Ondanks zijn zwakke gezondheid, ondanks tegenwerking en teleurstellingen, heeft hij zich met verbazingwekkende, doelgerichte energie ingezet voor democratische vernieuwingen in de Republiek der Verenigde Nederlanden.(Foto stofomslag: Bert Nienhuis; het washuis, het enig overgebleven deel van Huis Appeltern).",
  "genres": [
    "Biography",
    "Nonfiction",
    "Literature",
    "History"
  ],
  "author": "Hella S. Haasse",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/15727886-schaduwbeeld-of-het-geheim-van-appeltern"
}