{
  "title": "Mânil: Einfach nur der Anfang",
  "description": "Ein verpeilter, renitenter Jungmagier, der sich mit seinen neuen Kräften herumschlägt und versucht herauszufinden, wer er ist und wo er hingehört. Dazu ein misanthropischer, grundsätzlich miesgelaunter, sadistischer Lehrer für Magie mit düsterer Vorgeschichte und rabenschwarzem Humor. Eine psychisch labile Überfliegerin, die fast soviel verwüstet wie der Hauptprotagonist. Ein Prinz, sexy, aber charakterlich voll daneben. Eine neugierige Studentin, die mehr über Magie weiß, als die meisten Magier. Geheimnisse, sich selbstständig machende Träume, Stimmen im Kopf, eine Kristallkugel, die sich nicht benehmen kann, Regen aus Messern, Verwandlungsmagie, dubiose Fesselzauber - Chaos garantiert!Neben dem Aspekt des Fantastischen und der konsequenten Selbstironie geht es in dieser Geschichte vor allem um Freundschaft, Selbstfindung, Queerness, Eigenakzeptanz, gespaltene Persönlichkeit, Machtgefälle, Angst und Durchhaltevermögen, die schwierigen Sprünge über den eigenen Schatten, Individualität, Übergriffigkeit und um die Tatsache, dass das Leben ohne Unsinn wirklich sinnlos ist.Dieses Buch ist der Beginn von Mânils turbulenter Reise in die Welt der Magie, voller Witz, absurder, bissiger Dialoge, Slapstick, ernster und teilweise auch weniger ernst gemeinter Machtkämpfe, unerwarteter Wendungen und Situationskomik - und zwischendurch überraschender Tiefgründigkeit.Der erste Teil der Geschichte spielt in einer modernen Welt namens Mehrleben im Land Vingada-Cherat, in dem die Öffentlichkeit erst vor wenigen Jahren erfahren hat, dass Zauberer und andere magische Wesen deutlich realer sind, als man bislang dachte, und vor allem schon immer unter den Menschen gelebt haben:Der 16-jährige etwas seltsame und verpeilte Außenseiter Mânil hatte bisher jedoch nichts mit Magie am Hut. Er war viel zu beschäftigt damit, seinen Platz in der Welt zu finden. Nachdem er auf Grund einer skurrilen Wette versehentlich eine magische Verwandlung an sich selbst vollzieht, findet er sich bald bei dem misanthropischen Suketo wieder. Dieser ist ein launischer, etwas schrulliger Privatlehrer für Magie, bei dem Mânil nun seine Ausbildung beginnt. Neben Mânil wird dort noch eine weitere Handvoll Jugendlicher unterrichtet und er entdeckt gemeinsam mit ihnen staunend die magische Seite Mehrlebens.Der vorlaute Mânil muss hier jedoch nicht nur mit den anderen Magiern in Ausbildung zurechtkommen, sondern auch seine immensen Kräfte akzeptieren und bändigen lernen, herausfinden wer er ist; und das während seine Träume und die neuen Stimmen in seinem Kopf noch weitere düstere Geheimnisse zu enthalten scheinen.Besonders das Verhältnis zu dem sehr verschlossenen und bisweilen sadistischen Suketo spielt eine große Rolle. Doch wer hier erwartet, dass es so typisch \"schräger Schüler holt griesgrämigen Lehrer zurück ins fröhliche Leben\" wird, der wird sich umschauen, denn so schwarz-weiß läuft es bei mir nie. Es stellt sich jedoch heraus, dass sich zwischen dem mürrischen Suketo und dem renitenten und auch gern provokativen Mânil trotz - oder mehr sogar durch - deren nicht selten eskalierenden Machtkämpfen ein sehr gespanntes und komplexes Verhältnis entwickelt. Es kann letztendlich jede*r für sich selbst entscheiden, wie er über dieses seltsame Verhältnis denkt.Mit Lilian, einer mutigen, jungen Frau, die entschlossen ist, sich gänzlich ohne Magie in der Magierwelt zu behaupten, freundet Mânil sich rasch an, doch der eigensinnige Mânil findet nicht nur Freunde in der zunächst noch kleinen Gruppe. Zwischen ihm und dem skrupellosen Tyrone entwickelt sich schon bald eine erbitterte Feindschaft.Im Hintergrund gibt es auch noch die Plüscheule \"Eule Eule von Plüsch zu Federfell\", die die meisten aufkommenden Fragen durchaus beantworten könnte - es aber ganz bestimmt nicht tut! Was die echte Eule, Mânils rabiate, beste Freundin, die ihren Namen grundsätzlich niemandem verrät, noch alles weiß, scheint auch nicht ohne zu sein...Bei dieser Geschichte handelt es sich um eine hauptsächlich personelle Ich-Erzählung aus wechselnden Perspektiven, um meine Leser*innen aus erster Hand an den Charakterentwicklungen und deren Gedankengängen teilhaben zu lassen.",
  "genres": [],
  "author": "Desiderius M. Rainbow",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/105514557-m-nil"
}