{
  "title": "A Walk in the Park",
  "description": "Bestselling author Jane Green has partnered with Bioré® for the short story A Walk in the Park, about Olivia Adamson, a 20-something whose life is suddenly filled with surprises. But one thing that doesn’t have to be unpredictable is your complexion. Bioré® knows that every 20-something needs at least one thing she can depend on: clear, beautiful skin.In the time you read this short story, you could be on your way to healthy-looking skin by removing build-up, dirt and oil with Bioré® Pore Strips. So go ahead, grab a big comfy blanket, a Bioré® Pore Strip and your eReader. You’ll be ready to face anything.The muscular dog appears out of nowhere, like a mythological creature from the dark side, making a beeline for Pippin. Amy freezes, pulling the tiny Yorkie behind her, then screams as the dog opens its huge jaws and clamps them around Pippin. A yelp, then all is quiet.Just when Amy Adamson thinks her life can’t get any worse…Six months ago, Amy Adamson felt like she had it all, until overnight, everything changed. Everyone said Eric was bad news, but surely he would change for her… wouldn’t he? His constant partyin, her fear of losing him if she didn’t keep up, led to her losing her job, he apartment, and now, it seems, her whole life.A surprise visit to the apartment to collect her things finds Eric in bed with her roommate. Who’s also stolen her Biore Combination Skin Balancing Cleanser. Bitch.All Amy wants is her old life back, but with no job offers, and no money, she’s back in her parents’ suburban house, squeezing into jeans that are rapidly becoming too small, and cursing an unexpected case of teenage acne thanks to the loss of her Biore. Who the hell has acne at twenty six anyway?The only people her age left in town are the losers, or the ones who married their childhood sweethearts, taking every opportunity to show off their “adorable home” and 2.4 children.Just when she thinks it can’t get any worse, she’s walking their pet Yorkie by the beach when it’s attached by a large dog that has escaped the ramshackle home of a reclusive woman known only as Mrs. Warner.Mrs. Warner isnt’ home. Her grandson, William, is. A screenwriter, he’s funny, warm, and has a smile that makes Amy tingle in places she’s forgotten about.Life starts looking up thanks to a date with William and Biore Fighting Ice Cleanser. Until Amy opens the wrong door to discover a dead body in the guest room. Is William truly the nice guy he seems? Can the Biore create the miracle she needs? Will Amy, in short, find that luck might finally be on her side?",
  "genres": [
    "Chick Lit",
    "Short Stories",
    "Romance",
    "Adult",
    "Novella"
  ],
  "author": "Jane Green",
  "average_rating": "3.05",
  "url": "https://www.goodreads.com/book/show/15728208-a-walk-in-the-park"
}