{
  "title": "Rise of the Horde",
  "description": "Amazon Bestseller, Voted best Zombie/Horror E-books of 2012 on Goodreads'Zombie Rise of the Horde' is everything the blurb promises it to be, and much, much more! A tale of despair and sacrifice, small precious victories, farewells and reunions, and subtle spirituality, \"Zombie Rise of the Horde\" is a book I would highly recommend to readers looking for an enormously thrilling story with a degree of depth to it. As the book ends with a bit of a cliff hanger, I sincerely hope that we'll soon see more books from this brilliant author.\"Books for Tomorrow, 5 of 5 star review\"Whoa! This book is a super exciting fast paced trip! I enjoyed it greatly. So will I be buying the next book? Hell yes I will. Without a doubt!\"Contagious Reads, Lori\"An excellent composition of prose, action, dialogue and foreshadowing is Rise of The Horde that is indicative of a well-seasoned story teller. Devan Sagliani's endeavor is tremendous in luring readers into anticipating more and more. Whether you're an avid reader or been bitten by the curiosity bug in zombielore, there's a little something for everyone in Rise of The Horde.\"Horror News, Dave Gammon\"Zombie Attack! Rise of the Horde by Devan Sagliani is the book you, your friends, and your kids (provided they like sweet gory violence) should be reading. I mean it. If I had sum it up... I would say, \"What the hell are you still doing here? Why haven't you bought it yet?\"The Geekest\"Novice author Devan Sagliani breathes new life into a tired over indulgent genre. His concept of appealing to a mass audience is firmly grasped and unrelenting. Once delving into the narrative of this novella, the tale becomes infectious and downright addictive. Many avid readers will have difficulty putting it down.\" Rick Amortis, HellnotesWhen 16 year old Xander's older brother Moto left him at Vandenberg Airforce Base he only had one request - don't leave no matter what. But there was no way he could have known that one day zombies would gather into groups big enough to knock down walls and take out entire buildings full of people. That was before the rise of the horde!Now Xander is on the run, fleeing south to Port Hueneme to locate his brother with nothing but his martial arts training and the katana blade left to him. Along the way he'll have to fight for his life against other survivors, neo-Nazi's, outlaw bikers, gang bangers, cannibals, cult members, and a seemingly endless sea of flesh hungry zombies.But Xander is far from alone. Traveling with him are Benji, a 12 year old comic book geek, and Felicity Jane, a childhood celebrity with wild mood swings. Will they make it together in one piece to the safe zone or will they become the next meal for a hungry horde of wild zombies?Zombie Attack! Rise of the Horde is filled with pulse pounding undead action from the very first chapter up until the bitter sweet end. From rock stars and celebrities to false prophets and miracle workers, this book has it all! The story takes off like a bullet and doesn't slow down until the last sentence. You won't be able to put it down!",
  "genres": [
    "Zombies",
    "Horror",
    "Fiction",
    "Young Adult",
    "Apocalyptic",
    "Audiobook"
  ],
  "author": "Devan Sagliani",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/15728700-rise-of-the-horde"
}