{
  "title": "Christus' tegenwoordigheid in de Christenen",
  "description": "Christ Is Passing By collects 18 homilies given by St. Josemaria between 1951 and 1971, on the occasion of various liturgical feast days. The guiding thread is divine filiation, and the universal call to holiness entailed by this reality. Other important themes are the sanctification of ordinary work, contemplation in the midst of the world, and unity of life. The first edition was published in 1973. Over half a million copies have been sold in 14 languages.Bishop Alvaro del Portillo writes in the foreword that the book represents a small fraction of the founder of Opus Dei's immense work of catechesis. \"These homilies are not theological 'tracts' dealing with set topics; they are addressed to people of widely varied cultural and social backgrounds, spoken with a gift of tongues that makes them accessible to everyone. Underlying these considerations is an assiduous and loving knowledge of Sacred Scripture, the divine Word. St. Josemaria is speaking not to specialists, but to persons of flesh and blood, whose soul already harbors the life of God and who, having begun to experience God's love, want to draw closer to Him.The Navarre Bible New Testament series offers extensive explanations of the meaning of the scriptural text and its implications for everyday life. The commentaries draw on a rich variety of sources - Church documents, the writings of the Fathers and Doctors of the Church, and the work of prominent spiritual writers, particularly Saint Josemaria Escriva, who initiated the Navarre Bible project. The commentary appears on the same page as the Bible text, which is the Revised Standard Version Catholic Edition. Each volume is self-contained with extensive introductions and notes to Old Testament prophecies. The Navarre Bible commentary is considered by many to be the best Catholic commentary on the Bible available today.",
  "genres": [
    "Catholic",
    "Spirituality",
    "Christianity",
    "Nonfiction",
    "Theology",
    "Faith",
    "Christian"
  ],
  "author": "Josemaría Escrivá",
  "average_rating": "4.65",
  "url": "https://www.goodreads.com/book/show/15730944-christus-tegenwoordigheid-in-de-christenen"
}