{
  "title": "Alis grave nil",
  "description": "Sara è pronta per un altro giorno della sua solita vita. La scuola, i dispetti della sorella Reb, le malignità delle vecchie amiche e la certezza di non contare granchè. E' sicura che l'amore non faccia per lei e che le favole siano solo invenzioni per sognatrici. Ma proprio quel giorno, in un incontro tutt'altro che casuale, conosce Eric. Bellissimo e misterioso, protettivo e minaccioso, Sara intuisce che Eric è decisamente più che un ragazzo normale, ma quello che proprio non può immaginare è che la loro storia sia cominciata molto prima di incontrarsi e che le parole latine tatuate sul suo braccio nascondano un inquietante segreto... Senza curarsi di quanto il principe si confonda pericolosamente con il cacciatore, Sara dovrà lottare con tutta se stessa per opporsi alle forze oscure che minacciano di separarli per sempre e far vivere l'amore da fiaba che ha sempre desiderato.Recensito positivamente su oltre 40 «La lettura risulta fluida, veloce, accattivante al punto da non poter smettere, ma di desiderare leggerlo tutto d'un fiato. Assolutamente non prevedibile, è ricco di colpi di scena, fino all'ultima pagina, alla quale si giunge con la tensione alle stelle. Barbara Schaer riesce a farci affezionare, con un solo libro, ai suoi personaggi, così ben definiti e a tutto tondo che sembrerà di conoscerli e di gioire e soffrire insieme a loro.»Romanticamente Fantasy«.. trovare, invece, delle gran belle storie d'amore, capaci di farci trepidare, emozionare, piangere dalla sorpresa, è molto più raro. Eppure, io sono stata fortunata, perché ho incontrato una storia d'amore così nel romanzo di una giovane esordiente, \"Alis Grave Nil\", e ne sono rimasta davvero colpita. Una storia raccontata con dolcezza, una storia con dei protagonisti che si presenteranno a voi poco a poco fino a farsi amare totalmente, una storia che inizia in nessun modo straordinario ma che straordinaria lo diventa leggendola.»Coffee and Books«Ho letto questo libro in un giorno. L'ho praticamente divorato. E questo dovrebbe bastare a farvi capire qual è il mio giudizio su Alis Grave Nil...un libro che si legge tutto d'un fiato, scorrevole, fluido, mai noioso con personaggi ben caratterizzati e descrizioni giuste che non spezzano il ritmo del racconto.»Inside a Book",
  "genres": [
    "Fantasy",
    "Romance",
    "Young Adult",
    "Urban Fantasy"
  ],
  "author": "Barbara Schaer",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/15731347-alis-grave-nil"
}