{
  "title": "Happy Ever After Trilogy",
  "description": "For the first time - Happy Ever After The Complete Trilogy in one book!HAPPY EVER If it's just you and me, together, for the rest of our lives - no-one else to mess things up... could you ever love me?Peter loves Vanessa. He loves her a lot and is looking forward to starting a nice life with her, and only her. No one else to get in the way and mess up their beautiful relationship. He'll do anything for her. Absolutely anything to make her happy. Anything to see that beautiful smile of hers. Anything to live happily ever after with her.The only problem is - Vanessa doesn't know Peter and, more importantly, understand why she is cuffed to the dining room table.Told through the eyes of the two people living the story, follow Peter as he keeps Vanessa prisoner hoping that she will fall in love with him and follow Vanessa as she desperately looks for a way out of this hell.G.S.O.H ESSENTIALBefore you can have your 'Happy Ever After' you need to find The One.In Susie, Peter thought he had found his perfect lady. The woman he wanted to spend the rest of his life with... He just needed to convince her to feel the same - and if that meant kidnapping her then so be it.Told through the point of view of the two characters living this story - immerse yourself in Matt Shaw's prequel to 'Happy Ever After' and learn the truth about what happened to Young Susie...But remember..... Good. Sense. Of. Humour. Essential.A FRESH Finally - the gripping conclusion to the 'Happy Ever After' trilogy.Vanessa's alone now; living in her own personal Hell. He's gone now. Peter is gone. Not coming back, despite her ailing self-conscious trying to convince her otherwise. It's just her now. Alone. Her only objective is to break from the house in which she's become trapped. She just needs to break out. Get to the outside. Once outside she can worry about putting everything behind her - try to at least.'Don't worry about that now. Just get out. Get out. Then worry about A Fresh Start.'Told through Vanessa's POV - this is the Final part in the 'Happy Ever After' Trilogy.",
  "genres": [
    "Horror",
    "Thriller"
  ],
  "author": "Matt Shaw",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/15731487-happy-ever-after-trilogy"
}