{
  "title": "George's Terms",
  "description": "The good guys have a new doctrine and it is based on George’s Terms…When mankind reaches the pentacle of success, there is nowhere to go but down.While the novel features zombies and an end-of-the-world scenario, it is the story of how man can be cruel and inhumane on his own, especially when there is no longer law. Life and death must be redefined. When a bullet to the brain may be a kind thing, mercy and death itself take on new meanings.Set in Texas, most of the world’s population comes down with an infection with hemorrhagic effects that cause massive bleeding and then coma. Only, no one dies. The engineered infection has a nasty surprise waiting as prions cause holes to form in the brain and the enraged victims to go after loved ones and friends to feed and spread the infection. Quickly, the infected outnumber the healthy.George, an older, retired policeman and his three elderly friends are suddenly called back into service along with a rag-tag group of survivors trying to get trained well enough to rescue all the survivors they keep finding. A retired Marine, Len, gathers his team with reluctance: Julia: a hot-tempered Hispanic girl, Alex: a gay man, Beth: a woman unsure of her place in the world, Roy: a racist with a bad attitude, Kimball: a quiet cowboy, and many others.The story follows the strong characterizations as each survivor battles external forces and their own inner fears and morality; every action and choice now is far-reaching, they discover, and nothing is as simple as before.Although they take shelter in a hospital, they face far more than the roving zombies: the last of the government dropped bombs on the cities, survivors are trapped and need help, and raiders are beginning to kill innocents. Is there a responsibility to find justice and save everyone? George begins showing the survivors that the responsibility is now their own. He comes to another realization: each person must now decide his own fate and if that means going out on terms others don’t like, then so be it.George’s Terms is the first of the series and includes a lot of zombie action but is also a study of how people adapt or become extinct when mankind is no longer the top species. Like Lord of the Flies, everyone is just trying to pick the right side to be on and stay at the top of the game; the question is, what will they do to stay number one?",
  "genres": [
    "Zombies",
    "Horror"
  ],
  "author": "Catt Dahman",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/15732360-george-s-terms"
}