{
  "title": "The Story Collection: Volume One",
  "description": "Discovered some of Matt Shaw's many books? Published together, as a single collection, are the first of his stories (\"The Last Stop\", \"The Chosen Routes\", \"Writer's Block\", \"Smile\", \"Love Life\") - at a cheaper rate than if you were to buy the books individually now you really do have no excuse not to give his work a go!THE LAST Having lost his Wife, James feels as though he has lost everything that matters to him. Finally beaten by his ongoing battles with depression, James decides his best plan of action is to sell his worldly possessions. Sell-up and move out to Australia for a final blow-out... a final adventure bringing nothing but highs, before his planned, grand exit from his own Life.And it could have been the ideal plan had he not fallen asleep on the train...From Matt Shaw (Best-selling author of 'Happy Ever After') comes a whole new dark and twisted tale....THE CHOSEN 'The Chosen Routes' - was the Spirit trying to warn them of something, when the small drama group tried the ouija board? Was there a hidden message behind the sentence, spelt out by the moving glass - or was it simply the owner of the haunted mansion, where they were staying for the weekend on a money-raising scheme for charity, playing with their minds?Either way, there was no way of turning back now and, for one, it was a weekend they'd never forget. Their Path Was Set.WRITER'S Nothing to write. Been too long now. At this rate, they would have forgotten about him. Forgotten his words. Forgotten his story.... no, they couldn't. They couldn't forget what he did. No one will forget his first story. The story that introduced him to the world.No matter how much they wanted to forget what they read.... no one could. Even so, he needs to ignore his wife's possible affair and get past his writer's block.... get his new work out there.... keep him fresh in their memories.He was stood there. Right there. He kept shouting that he was going to go but.... he wasn't moving... he wasn't. I thought he was bluffing... I only turned my back on him for a moment. A moment! Had I seen him go... of course I would have followed. Of course I would have gone after my younger brother! The thought of him lost in this shopping centre... alone... it sends shivers down my back.I have to find him. I WILL find him. Anything to get out of having to make the call home to mum. She's going to be so mad...* * * * * * *Alex's mum was tired and over-worked. Holding down a full-time job, keeping the house clean and looking after the children - the youngest of which was still a handful with his ADHD as they tried to get the medication right - she just wanted a break. Even if it were only for an afternoon - so she sent Alex to the shopping mall, with his younger brother who was throwing a tantrum because he wanted to go to the toy store to spend his pocket money. She never once thought Alex would lose his younger brother in the crowds.And no one would have guessed how the day would have ended or just how many more children were missing.'Smile' is a new horror from the best-selling author behind the 'Happy Ever After Trilogy' - told through the eyes of the main character as he frantically searches for his missing brother.LOVE Share a night with Kim, a working girl, and her client. Both have skeletons in their closets.With three hundred and sixty pounds in her purse and the clock only just having struck midnight – Kim knew, as she left the hotel, there would still be enough time to get the necessary finances behind her to run from everything. She’d have enough money to run from what she’d done and become. As she walked towards the city’s Red Light District, to join the other street girls, she knew that it would all be over in just a few more hours...",
  "genres": [
    "Horror"
  ],
  "author": "Matt Shaw",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/15732313-the-story-collection"
}