{
  "title": "Shadow's Light",
  "description": "I felt hot tears streaming down my cheeks at his words. Spoken so carelessly, with such shameless intent. He knew how I felt. How I had been feeling. How lost and alone and full of grief my days had been. Avery was not a friend. Not even a trusted acquaintance. But, he understood what I was going through. Even if he didn't have a compassionate bone in his entire buffed body, he knew what I had suffered. I didn't have to justify my behaviour to him.Walking out on her life and hiding in the only place she can think of that the Iunctio - the vampire governing body - and in particular, the Champion, can not find her, Lucinda faces eternity alone and on the run. Heartbroken, bereft and quite desolate she hides in amongst the lowest forms of vampire society. Doing what she can to keep the innocents safe, while denying herself the support she desperately needs to recover from such personal losses.A saviour of sorts arrives, but can he be trusted? Avery Rousseau has only ever been interested in himself. But the handsome, arrogant and always so well-put-together vampire does seem to care. At least he offers a distraction from the heartache and loss. Lucinda battles with her inherent mistrust of the one vampire who understands what she is going through. But, should she allow him inside her crumbling walls?More than just vampires stalk Lucinda though. There is a fairy who claims she is his one true love. Lucinda is called to his Light, she can't help reaching for it, but to do so could have everlasting consequences she may not be prepared to face. As time runs out - first with the Iunctio, then the Ljósálfar - Lucinda must do what she has to do, to survive, before her heartache breaks her in two.But memories plague her, her mind starts to play cruel tricks and slowly reality begins to crumble, taking a once strong and confident Nosferatin down as quickly as a predator catches its prey. And now, there are just so many predators, Lucinda may not stand a chance at all at avoiding being someone's prey.",
  "genres": [
    "Vampires",
    "Paranormal",
    "Urban Fantasy",
    "Fae",
    "Romance",
    "Fantasy",
    "Adult"
  ],
  "author": "Nicola Claire",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/15733421-shadow-s-light"
}