{
  "title": "Broken Angels",
  "description": "A speculative thriller woven with cosmic Lovecraftian weirdness, Broken Angels is the first book in a Metaphysical Fantasy series entitled Eve of Light. Metaphysical Fantasy is a subgenre that combines action & adventure with philosophy or theology (a popular example would be Philip Pullman's His Dark Materials, specifically The Amber Spyglass). Intended for readers aged 16 and older (or mature readers of any age), this book contains graphic violence, adult language, and heretical ideas about the nature of reality. Here's the set-up: Still grieving years after the butchery of his pregnant mother and kidnapping of his premature brother, Robert Goldner was just seventeen when he contracted the White Fire Virus. He prayed for the excruciating death most victims experience shortly after acquiring the STD. Instead he was cursed to live on, slowly dying, ridden with billions of parasites, and possessing a bizarre but limited ability to manipulate photons, the basic units of light. At age twenty, Robert still considers himself damned and confused, not the least because more and more surviving virus-carriers are calling themselves \"angels\"-- God-blessed beings of light--his licentious partner Darryl Ridley being a prime example. But Robert attempts to shove the irritating mystery of it all to the gutters of his mind as he focuses on his mission as a Watcher agent, locating and recovering missing children in the Washington, D.C. area. When Robert and Darryl receive a hot tip on the location of a virus-infected girl who disappeared shortly after attempting to massacre half her high school, they prepare to chalk up another success. But when they instead find the girl's best friend from school, beaten nearly to death, they become entwined in a conspiracy involving magick, bizarre creatures, fantastic realms beyond space and time, and even the death of God. Can two dying angels do anything to prevent the Apocalypse?",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Fiction",
    "Supernatural",
    "Paranormal"
  ],
  "author": "Harambee K. Grey-Sun",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/15734756-broken-angels"
}