{
  "title": "A Queer History of the United States",
  "description": "Winner of a 2012 Stonewall Book Award in nonfictionThe first book to cover the entirety of lesbian, gay, bisexual, and transgender history, from pre-1492 to the present.In the 1620s, Thomas Morton broke from Plymouth Colony and founded Merrymount, which celebrated same-sex desire, atheism, and interracial marriage. Transgender evangelist Jemima Wilkinson, in the early 1800s, changed her name to “Publick Universal Friend,” refused to use pronouns, fought for gender equality, and led her own congregation in upstate New York. In the mid-nineteenth century, internationally famous Shakespearean actor Charlotte Cushman led an openly lesbian life, including a well-publicized “female marriage.” And in the late 1920s, Augustus Granville Dill was fired by W. E. B. Du Bois from the NAACP’s magazine the Crisis after being arrested for a homosexual encounter. These are just a few moments of queer history that Michael Bronski highlights in this groundbreaking book. Intellectually dynamic and endlessly provocative, A Queer History of the United States is more than a “who’s who” of queer history: it is a book that radically challenges how we understand American history. Drawing upon primary documents, literature, and cultural histories, noted scholar and activist Michael Bronski charts the breadth of lesbian, gay, bisexual, and transgender history, from 1492 to the 1990s, and has written a testament to how the LGBT experience has profoundly shaped our country, culture, and history. A Queer History of the United States abounds with startling examples of unknown or often ignored aspects of American history—the ineffectiveness of sodomy laws in the colonies, the prevalence of cross-dressing women soldiers in the Civil War, the impact of new technologies on LGBT life in the nineteenth century, and how rock music and popular culture were, in large part, responsible for the devastating backlash against gay rights in the late 1970s. Most striking, Bronski documents how, over centuries, various incarnations of social purity movements have consistently attempted to regulate all sexuality, including fantasies, masturbation, and queer sex. Resisting these efforts, same-sex desire flourished and helped make America what it is today. At heart, A Queer History of the United States is simply about American history. It is a book that will matter both to LGBT people and heterosexuals. This engrossing and revelatory history will make readers appreciate just how queer America really is.",
  "genres": [
    "History",
    "Nonfiction",
    "LGBT",
    "Queer",
    "Social Justice",
    "Politics",
    "American History"
  ],
  "author": "Michael Bronski",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/10065595-a-queer-history-of-the-united-states"
}