{
  "title": "Victoria's Demon Lover",
  "description": "Victoria is a lonely accountant by day, a demon's lover by night. Her visitations began without warning and frightened her at first but after several steamy encounters with a shape-shifting lover, she began to look forward to those nights of intense pleasure and physical adventure.Then one night they stopped.Now Victoria is consumed with an intense longing to discover how and why her lover appeared, and especially why he disappeared. She cannot just make a few phone calls to track him down, she must enter the land of the dead and travel through time. She discovers her lover did not select her at random. There is a link between them that has been severed, a link that transcends time and rips apart the flimsy veil of death and life.With the help of an enigmatic antiquarian bookseller and a monkey-demon from hell, Victoria is determined to grasp the answers to her questions about living and dying, the nature of reality and to find herself in the arms of her elusive ethereal lover.Victoria's Demon Lover is an erotic adventure. Explicit and arousing descriptions of the act of love in many of its permutations are explored within its pages. This is not your mother's Regency Romance. Be warned. If this were a paper book it would run 215 pages.Excerpt:Jasper squeezed her hand. \"Tell me what Jack looks like.\"\"He is tall. His hair is dark brown...he is strong with broad shoulders and arms like...\" Victoria stopped. Her demon changed his form constantly. \"He is also a Roman soldier. Shorter and sturdy. His thighs are thick and corded from marching and climbing and running. His arms are strong from fighting and rowing and digging. He is dark, tanned from the sun, has dark hair and dark stubble that never seems to be shaved smooth.\" She sighed, \"And sometimes he has lighter skin and blond hair and icy blue eyes looks like he lives in Valhalla. That one is sad, and each of them has a large scar here...\" she touched her neck.Jasper jumped. \"A scar there?\" He pointed to his own neck.She looked down, hopeful. \"You know him?\"\"There are many with scars from their human lives. Most erase them or change form to hide them, but I know one who openly wears a thick scar on his neck.\"\"Show me.\"Jasper squeezed her hand and the landscape around them disappeared. They reemerged in a more earthlike setting, wind and sky and trees...and a battle.They stood on a small rise, again beneath a tree, but empty cultivated fields spread out before them to the horizon. Two armies on foot collided near a small stream. Victoria heard the screams, the shouting and the clash of metal on leather and the sickening thud of bodies falling to the ground. She put a hand to her mouth.Jasper nodded. \"War is Hell. There is a lot of it down here.\"\"He is in there?\" There were hundreds of soldiers. They appeared to be Romans and Gauls. She knew from her history books that this war had waged for many years.\"Yes. He is always here.\"\"Am I supposed to go down there?\"\"I wouldn't. I'd wait until it was over and then walk among the dead and wounded.\"\"I don't want to find him dead or wounded.\"Jasper looked up at her. \"Why didn't you say so?\"\"Why should I have to say so? I am trying to find him alive.\"Jasper stared at her. \"You are in Hell. No one here is alive.\"",
  "genres": [
    "Erotica",
    "Paranormal",
    "Romance",
    "Paranormal Romance",
    "Demons",
    "Historical",
    "M F Romance"
  ],
  "author": "Alia Bess",
  "average_rating": "3.34",
  "url": "https://www.goodreads.com/book/show/15734786-victoria-s-demon-lover"
}