{
  "title": "Keys to the Coven",
  "description": "Welcome to \"Keys to the Coven\" a witty, tightly plotted, sometimes very dark, (adult) urban fantasy/romance set in an original universe where karma is power, sex is karma, and it's not who you know but whose soul you own that matters.To become a demon, you must die in complete and utter despair. Three hundred years ago, Max passed that test with flying colors and joined the afterlife resolving never again to have innocent blood on his hands. Now a successful Demonic Intervention Agent, Max has been given the job of breaking Felicity Woodsen's family curse. But what she doesn't know, what Max can't bring himself to tell her, is that completing his mission almost certainly means her death.When Felicity inherits her mother's coven, she learns each firstborn Woodsen daughter must become the consort of an evil-arch demon. Felicity's only hope is to ally with the mysteriously charming Max. But is saving her body from one demon worth the price of risking her soul with another?Arch-Demon Roxashael landed in Hell when his Roman captors sent his family, one by one to be devoured by lions. The lesson was clear: power is good; lots of power is better. Two-thousand years later, Rocky has power. He's purchased hundreds of souls, and he's created the Minsk Homunculus, a magic artifact that, by binding a human witch as his consort, places him above the goody-two-shoes laws of karma.But Rocky made a mistake. He fell in love with Felicity's mother and in a moment of weakness promised to give up his demon-consort charm. Now Felicity's mother is dead, the Minsk Homunculus is slated for destruction, and Rocky's power as an arch-demon is about to end.No demon can break a promise. If Rocky refuses to give up the Minsk Homunculus, he'll become the lowest, most abject slave in Hell.But then, why break promises when they're so easy to corrupt?*Caution: This book contains violence, strong sexual themes, moderately explicit sex between consenting adults, (unfulfilled) threats against children, and one completely gratuitous reference to unicorns. Not intended for readers under 18.",
  "genres": [
    "Paranormal",
    "Romance",
    "Fantasy",
    "Urban Fantasy",
    "Paranormal Romance",
    "Magic",
    "Demons"
  ],
  "author": "Vicky Loebel",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/15738335-keys-to-the-coven"
}