{
  "title": "In My Time: A Personal and Political Memoir",
  "description": "In this eagerly anticipated memoir, former Vice President Dick Cheney delivers an unyielding portrait of American politics over nearly forty years and shares personal reflections on his role as one of the most steadfast and influential statesmen in the history of our country.The public perception of Dick Cheney has long been something of a contradiction. He has been viewed as one of the most powerful vice presidents—secretive, even mysterious, and at the same time opinionated and unflinchingly outspoken. He has been both praised and attacked by his peers, the press, and the public. Through it all, courting only the ideals that define him, he has remained true to himself, his principles, his family, and his country. Now in an enlightening and provocative memoir, a stately page-turner with flashes of surprising humor and remarkable candor, Dick Cheney takes readers through his experiences as family man, policymaker, businessman, and politician during years that shaped our collective history. Born into a family of New Deal Democrats in Lincoln, Nebraska, Cheney was the son of a father at war and a high-spirited and resilient mother. He came of age in Casper, Wyoming, playing baseball and football and, as senior class president, courting homecoming queen Lynne Vincent, whom he later married. This all-American story took an abrupt turn when he flunked out of Yale University, signed on to build power line in the West, and started living as hard as he worked. Cheney tells the story of how he got himself back on track and began an extraordinary ascent to the heights of American public life, where he would remain for nearly four decades: * He was the youngest White House Chief of Staff, working for President Gerald Ford—the first of four chief executives he would come to know well. * He became Congressman from Wyoming and was soon a member of the congressional leadership working closely with President Ronald Reagan. * He became secretary of defense in the George H. W. Bush administration, overseeing America’s military during Operation Desert Storm and in the historic transition at the end of the Cold War. * He was CEO of Halliburton, a Fortune 500 company with projects and personnel around the globe. * He became the first vice president of the United States to serve out his term of office in the twenty-first century. Working with George W. Bush from the beginning of the global war on terror, he was—and remains—an outspoken defender of taking every step necessary to defend the nation. Eyewitness to history at the highest levels, Cheney brings to life scenes from past and present. He describes driving through the White House gates on August 9, 1974, just hours after Richard Nixon resigned, to begin work on the Ford transition; and he portrays a time of national crisis a quarter century later when, on September 11, 2001, he was in the White House bunker and conveyed orders to shoot down a hijacked airliner if it would not divert. With its unique perspective on a remarkable span of American history, In My Time will enlighten. As an intimate and personal chronicle, it will surprise, move, and inspire. Dick Cheney’s is an enduring political vision to be reckoned with and admired for its honesty, its wisdom, and its resonance. In My Time is truly the last word about an incredible political era, by a man who lived it and helped define it—with courage and without compromise.",
  "genres": [
    "Biography",
    "Politics",
    "Nonfiction",
    "History",
    "Memoir",
    "Autobiography",
    "American History"
  ],
  "author": "Dick Cheney",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/10555059-in-my-time"
}