{
  "title": "Viimeiset viestit",
  "description": "Suuren tietokoneyrityksen johtajiin kuuluva mies päättää yhtäkkiä jättää työnsä ja lähteä pitkälle matkalle. Läheiset tukevat Teemun irtiottoa siitä huolimatta, ettei mies kerro irtisanoutumisensa eikä matkansa syytä. Perhe antaa hänelle tilaa, kaverit lähinnä kadehtivat oravanpyörästä hyppäävän miehen päätöstä. Mihin Teemu on menossa ja miksi? Miksi hän tarvitsee väärennettyjä henkilöllisyystodistuksia? Entä miksi hän ostaa useita prepaid-liittymiä, joita ei voi jäljittää? Lukija on samassa asemassa kuin Teemun läheiset: yhteyttä pidetään tekstiviestein eikä mies juuri kerro muuta kuin matkansa uusimman etapin. Ja sen mitä jazzia kaupungissa voi kuunnella. Vähitellen alkaa tihkua outoja yksityiskohtia: Keitä ovat ihmiset joita Teemu matkallaan tapaa? Miksi poliisit kyselevät häntä? Mitä Teemun entisessä työpaikassa on tapahtunut? Aikooko Teemu Euroopan ulkopuolelle? Onko hän kenties sairas? Aikooko hän tulla ollenkaan takaisin? Onko kyse kenties hänen viimeisistä viesteistään? Viimeiset viestit on mukaansa tempaava ja arvoituksellinen tarina, jännityskertomus, joka tekee yhdenlaista kirjallisuudenhistoriaa: romaani rakentuu pelkistä tekstiviesteistä. Kirjan maailma avautuu tiiviinä viesteinä joita mies lähettää perheelleen ja ystävilleen sekä vastausviesteistä joita hän saa. Viestien välit ovat yhtä tiheitä kuin tosielämässä kun me odotamme kärsimättömänä vastausta kysymykseen joka vaatii välitöntä ratkaisua. Ja ne ovat yhtä tiheitä kuin aukot parhaimmassa jännitystarinassa, jossa odotetaan malttamattomana seuraavaa käännettä. Hannu Luntiala (s. 1952) debytoi vuonna 2006 mainion vastaanoton saaneella novellikokoelmalla Hommes, joka kertoi miesten maailmasta ja erityisesti sen pimeistä puolista. Suomen ja tiettävästi koko maailman ensimmäinen tekstiviestiromaani.",
  "genres": [
    "Finnish Literature"
  ],
  "author": "Hannu Luntiala",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/15741176-viimeiset-viestit"
}