{
  "title": "Try and Avoid the Speed Bumps",
  "description": "We all want our life to be one smooth road, but none of us gets that all the time. Between the calm stretches of highway, we are forced to deal with the potholes and the occasional speed bump that accompany the turmoil surrounding family, jobs and friendships. If we don't slow down to maneuver the bumps, we might find ourselves a bit battered and bruised. This book, gives us a look at some of those speed bumps and how love, patience and a good dose of humor help us maneuver life's complications.Try and Avoid the Speed Bumps is the follow up book to the successful Life on the Off Ramp which included some of the most popular earlier humor essays by Donna Cavanagh. In this book, Donna Cavanagh takes us down life's path where middle age, teenagers, the empty nest and suburban existence can sometimes result in a rough ride. As you read through these essays, you will not only laugh at her experiences but you might see yourself in the same driver's seat too.\"Donna Cavanagh's observations about life, love and parenting are spot-on and laugh-out-loud funny.\"- Nanette Varian, features editor, More magazine \"Nobody does family life funnier or sweeter today.From the first page to the last, Donna's world is a delight guaranteed to brighten your day.\"- Ilene Beckerman, author of \"Love, Loss and What I Wore\"\"Read this now! HumorOutcasts Founder Donna Cavanagh gets much-deserved top billing in this hilarious collection of columns illuminating the human condition. Her observations resonate with young and old alike, finding spot-on humor in the seemingly mundane. After reading this book, you will never open a fortune cookie in quite the same way.\"- Bruce Ferber, Television writer/producer and author of the novel \"Elevating Overman\"\"Speed bumps and all, the ride is one hundred percent funnier when Donna Cavanagh is on board. Intelligent, insightful and irresistible, her humor will keep you laughing and page turning until the very end.\"- Nancy Berk, Ph.D., Psychologist, award-winning humorist, comic and author of \"College Bound and How To Help Your Kid Get Into A Great College without Losing Your Savings, Your Relationship, or Your Mind\"",
  "genres": [],
  "author": "Donna Cavanagh",
  "average_rating": "4.70",
  "url": "https://www.goodreads.com/book/show/15741897-try-and-avoid-the-speed-bumps"
}