{
  "title": "L'incredibile storia di Soia e Tofu",
  "description": "Contrariamente all'opinione comune, non è per niente facile la vita di un gatto. Soprattutto a Pechino. Lo sanno bene Soia e Tofu, gli irresistibili protagonisti di questo romanzo. Soia è grosso, rosso e baldanzoso. È convinto di essere il più abile cacciatore al mondo di libellule, anche se non ne ha ancora catturata una: quelle dispettose scappano sempre all'ultimo momento. Tofu, invece, è una piccola randagia: nata in un bidone della spazzatura, è più timida e schiva. Pur essendo così diversi tra loro, quando vengono allontanati dalle rispettive famiglie e si ritrovano a vivere insieme nella stessa casa, i due diventano inseparabili. Soia, più esperto, guida Tofu nel mondo degli umani, queste creature così poco abili a comunicare che non comprendono nemmeno il significato dei suoi miagolii e dei movimenti della sua coda. E Tofu ben presto impara la regola più importante: mai varcare il cancello del giardino, là da dove un giorno spunta il volto sorridente di Xiao Xu. Trionfante, l'uomo annuncia che un'azienda che produce cibo per gatti ha scelto Soia come testimonial per una grande campagna pubblicitaria. È l'inizio di un'incredibile avventura, grazie alla quale i due gattini esploreranno il mondo al di là degli hutong del centro di Pechino e, affrontando sfide e pericoli, diventeranno grandi. Una toccante storia da leggere a mente aperta e senza preconcetti, come farebbe un bambino, per scoprire che gli animali protagonisti di questo romanzo non sono poi tanto diversi dagli uomini, con le loro personalità e convinzioni, e soprattutto il loro costante bisogno di verità, giustizia e amore. Un romanzo ricco di riferimenti alla Cina di ieri e di oggi, che regala illuminanti spunti a tutti coloro che sentono il bisogno di capire meglio chi siamo, da dove veniamo e dove stiamo andando.",
  "genres": [
    "Fiction",
    "Animals",
    "Cats",
    "China",
    "Asian Literature",
    "Fantasy",
    "Asia"
  ],
  "author": "Pallavi Aiyar",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/15744470-l-incredibile-storia-di-soia-e-tofu"
}