{
  "title": "CancerDance- a love story",
  "description": "'CancerDance- a love story', is a journal written while navigating the nightmare existence a perfectly normal family becomes embroiled in once the Big C enters their lives, changing everyone forever. Spanning almost a decade, 'CancerDance- a love story' is a testament to the sheer power of love, a reminder that we're all much stronger than we think we are, and a warm embrace to those dancing along with us...Thursday, April 15, 2010I wonder whatever happened to \"normal.\"I asked my son yesterday if he could even, in his ten year existence, remember a time when our family life didn't consist of hospitals, operations, recovery, repeat. And though he made light of thinking it over, he was serious when he said, \"No. Not really.\"I'm trying to come to terms with our new reality. Not our beloved old knock-around house at the edge of Brownsboro TX (pop. 756)—chickens in the yard, turkeys on the porch, drifting off to sleep to the chorus of hundreds of spring peepers down by the pond—but this hotel room in the middle of Houston (4th largest city in the US of A), the non-stop cacophony of helicopters and ambulances rushing to the hospital district glowing just a few blocks away.And, as crushing as living here with no set ending, no date we can circle on the calendar, is, we refuse to leave without Ward. He's here. We're here. They tell us it's going to be a \"very, very long haul\" but that's fine as long as we're all here and all together.I've known Ward for 16 years and we've been a couple almost 15. This is not my first go-around on the relationship/marriage train, but this is the only time I can honestly say there's never been one minute, one second, that I've ever thought, \"Hmmmm, this just isn't working out.\" Ward's the best friend I've ever had, the best father I could ever imagine for Alec, and truly the Love of My Life. And even though I'm surly, argumentative, and difficult, for some reason he feels the same way about me.But while other couples—even those who still love each other deeply—stagnate and flounder a bit under the day- to-day child raising and working and bill paying, wishing for some excitement to knock the dust off of their routines, we crave the opposite:Quiet. Normal. Boring. Stay-at-home Life.I know, from tuning into every morsel of his being, which is wrapped up, trussed up, invaded, and hooked to machines that surround him carnivorously, that he can hear me. I hold his hand, and talk to him, and at sensible times there are signs—the twitch of his hand in mine, the raising of an eyebrow, the flicker of an eyelid, the rising or lowering of his blood pressure—that tell me he's fighting as hard as he can. That no one wants to go home more than he does.So we wait. And I keep him company, holding his hand and reading aloud to him in an almost insane caricature of normalcy. I pretend not to notice the nurses and others coming in and going about their medical business—the business of keeping my husband alive till his body is strong enough to once again keep itself alive.And outside the hospital walls, I meet other people who complain petulantly about the irritating habits of spouses, or the boredom of their jobs, or the tiring, mind-numbing chores inherent in the raising and training of children, and they look at me like we're all in the same secret club and ask, \"Yanno what I mean?\"I think of what I wouldn't give right now to find beard hairs in the bathroom sink, or a collection of half-empty soda cans abandoned around the house, or even to simply be at home in our own bed—together.And I can't even feign thinking about it before answering, \"No. Not really.\"",
  "genres": [],
  "author": "Sheri Dixon",
  "average_rating": "4.71",
  "url": "https://www.goodreads.com/book/show/15744516-cancerdance--a-love-story"
}