{
  "title": "Fairie-ality: The Fashion Collection from the House of Ellwand",
  "description": "Do you believe in fairies? How about high fashion? Enter the exquisite world of fairie fashion – where feathered hats are designed for maximum lift, oak-leaf jackets boast ample wing vents, and flower-petal flats are easily removable for flight.In the fairie world, there is only one top designer of couture and accessories. . . .Prepare to be enchanted! While humans go about their workaday lives, there is a secret world of well-dressed fairies flitting about in fragile fashions that would take your breath away – if only you could see them. Well, now you can. For the first time ever, elusive fairie couturier Ellwand allows mortals a peek at his ethereal designs in Fairie-ality , a catalogue so spectacularly crafted it befits a fairie queen herself. Showcased are nearly 150 creations – including dresses, jackets, trousers, shoes, hats, and delicate unmentionables – fashioned wholly from feathers, flower petals, shells, seeds, and other materials from nature. Consider these special Extraordinary production elements, including three specially selected paper stocks; metallic inks; fold-out booklets; vellum envelope with removable fashion card; and numerous half-, third-, and quarter-pages, notably to showcase garments for a playful mix & match, offering dozens of outfits to create.Drawings by celebrated fashion illustrator David Downton, capturing the graceful, but rarely glimpsed, fairie attired in Ellwand’s designs.Witty and delightfully romantic captions by Eugenie Bird.A breathless narrative by a young fairie guiding us from The Season’s start through May Day revelry and a Fairie Tale Wedding.Filled with authentic fairie lore that will lure fairie lovers by the legion, this superbly designed volume also offers many clever nods to human fashion history. Its fun, fanciful costume descriptions will amuse the fashion-savvy everywhere, while the stunning array of fashions themselves – a veritable dress-up dream –will leave readers of all ages spellbound.",
  "genres": [
    "Art",
    "Fantasy",
    "Fashion",
    "Fairies",
    "Picture Books",
    "Reference",
    "Fiction"
  ],
  "author": "Eugenie Bird",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/1006591.Fairie_ality"
}