{
  "title": "Emily And The Hit Man",
  "description": "Emily wants nothing more than Brandon’s cock sliding around in her pussy. Dreaming of it just will not do. To her he is the hottest assassin in the organization. But when he puts a gun to her head and tells her she is his next assignment, she begins to question her attraction. After all, what girl in her right mind wants to fuck her own assassin? Brandon knows he cannot kill Emily. For one reason, he has not fucked her yet. For the other reason, he knows the hit is bogus. Something isn’t right at the organization and he intends to find out who wants her dead.In New Orleans, it’s Marti Gras time. But for Emily and Brandon, it’s discovery time. Discovering each other in Brandon’s bed that is…..♥♥♥♥♥ This erotic snippet is intended for mature readers only. If you’re not 18 years or older, find something more suitable for your age.The following Novella of approx. 11,500 words is an erotic romance and it features the lives of assassins, killing and brutality in some situations.♥♥♥♥♥♥“Cummon, Emmy,” he murmured. “Tell me you want me.”She whimpered and ran her hands frantically over his shoulders and down his arms. “You know I want you Brandon. Make me yours, make me come,” she begged. She looked up at him and noticed that the green in his eyes were clouded behind his dark pupils. “I want to see your cock.” She knew all he had to do was touch himself and she’d be lost with no way back. She felt the power of his body as he shifted his weight and reached for his zipper. She also knew he felt invincible as he pulled his jeans down his legs. Even still, when he asked her to do the same, she eagerly obliged. Afterward, they sat staring at each other. Naked, and wanting in their own individual ways. “Lie back.” He said, and she did. His mouth slid down her body, her exquisite, oh-so-tempting body. God, was she so conceited to believe he wanted her because of her body? Ohh, and the way her belly quivered as his tongue traced a line down the middle of it. She was a modern girl who loved her body jewelry. She hoped he would like the little flower handing from her navel. “Oh fuck!” she exclaimed loudly when his tongue teased it before moving further down. She reached out, and grabbed on to the door handle. Was the car big enough to accommodate what he had in mind? She hoped so. She closed her eyes as he kissed a line to her pussy. She enjoyed the feel of his hot tongue against her skin. His body was warm, his shoulders strong as she held on to them.“Wait right here.” He said and she opened her eyes to watch him as he left her. He got out of the car and walked to her side. After he opened the door, he dropped his jeans on the ground and got down on his knees on top of them. Then he reached forward and put his hands under her thighs. As he turned her toward him, he hooked his arms under her knees and pulled her ass to the edge of the seat. When he had her pussy lined up perfectly with his cock, she looked up at him. “Condom?” she was a responsible girl after all. She knew he was dying to get inside her as he sighed and reached across her. He fumbled with the door to the glove box and she nearly giggled at his urgency. Finding the condom, he quickly removed the wrapper and rolled the latex over his dick. Like the rest of him, his cock was big and perfect. She couldn’t help but lick her lips as she thought about what he was getting ready to do with it. But still, he held back, teasing her. Bending forward at the waist, he parted the damp folds of her pussy and pressed his mouth to her center. She jerked and quivered as he licked and tasted her. She was ready for him. “I don’t want to wait Brandon, please…,” she begged.",
  "genres": [],
  "author": "Aalexxa Aarows",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/15747496-emily-and-the-hit-man"
}