{
  "title": "The Impostor",
  "description": "“Wow - what an amazing job Tiffany has done. There wasn't a moment that I wasn't engaged with the characters or the plot. The build up of mystery and tension in this suspenseful romantic novel is superbly done. I found myself constantly holding my breath and nervously listening for creaks in the house. There were some beautifully crafted romantic moments that had me swooning for Dylan, and several moments when I shed a tear. Stunning! The novel flowed very well, effectively creating a good balance of suspense, character interaction and the lovely romance. The ending. Oh my! Tiffany, what an ending you have created. I have no idea what to expect for book two, Obsession and Sacrifice, other than I can not wait to read it. And no doubt it will be as wonderful as The Impostor.” -Becky Johnson, Bex and Books\"‎I loved the suspense of The Impostor. I couldn't put it down. I can't wait for the Obsession and Sacrifice! I love Dylan and Nicole. The love story is like a fairy tale!\"- Amy BarnhouseThe Impostor, A Love Story is the first novel in a suspenseful romantic trilogy about unexpected love and a woman’s fight for survival. It is a captivating story of growth, acceptance, and the perseverance to begin again. “Alaska? Who goes to Alaska?” Nicole, a young single mother, escapes an abusive ex-boyfriend and leaves behind the broken dreams of becoming an artist. She travels to Alaska, a place she knows little about, on a journey of self-discovery. Nicole is scared of getting hurt again, but Dylan’s chiseled body, chocolate-brown eyes and charm captivate her. She begins to fall in love. In Alaska, she discovers the power of friendship and true love and starts to let down her guard. But is her security a facade?Soon Nicole’s innocent beauty taunts a sinister man, and she is caught in a web of deception and danger. Someone evil is stalking her. Someone she had trusted. Will she be saved? Or will she be hunted? “Knowing that the story has a basis on the author’s experience brings the world into an eagle eye view. This book offers a great deal of social significance and insight into the ideals and dreams of women, as well as the fears and struggles. It’s not just a romance. It’s not just a mystery. It’s about growth, acceptance and having the spirit to continue when the horizon shows nothing but dark clouds and lightening. Life is Chaos, but it can be beautiful too, if you have the persistence and determination to see it through. If you like Nora Roberts’s mysteries, you will love Tiffany Carmouché. ” Aleta OBrien, Fleur De Aleta\"The Impostor is an amazing novel about Courage, Faith, Love and the will to survive. Nicole is one of the strongest female characters I've ever read about. She inspires you to keep going but at the same time, lets you see that even in the hardest situations, it's good to open yourself up to new things. There's nothing better than a great love novel, but Tiffany Carmouché made it way more interesting adding suspense, action and tragedy. This is a must-read. You won’t be disappointed.\" Dann Barba \"I LOVED IT! It was great to see how the main character grew as a person—mistakes, unexpected love and all. The suspense pulls you forward and keeps you up at night. The men are steamy too (which never hurts)!\" –Rocky Guzman\"Nicole had a vivacious personality, and her enthusiastic desire for adventure was believable. Tiffany did a nice job of portraying Nicole's vulnerability as a young mother desperate to provide her daughter a better life. She did a nice job with the settings. She took advantage of Alaska's scenic landscape, and provided well-crafted descriptions.",
  "genres": [
    "Suspense",
    "Romantic Suspense",
    "Contemporary"
  ],
  "author": "Tiffany Carmouche",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/15747559-the-impostor"
}