{
  "title": "Everything Voluntary: From Politics to Parenting",
  "description": "From the Introduction:  The mainstream political, education, and parenting philosophies all have one thing in common: promoting the domination of one group of people over another. In politics, this is the ruling class, i.e., politicians and bureaucrats, over the ruled. In education and parenting, this is teachers or parents over their children. Someone's interest prevails over someone else's, and in these arenas, \"violent\" solutions prevail over peaceful ones.  The purpose of this book is to question the \"virtues\" of human relations based on violent coercion, and to promote instead human relations based on mutual consent. For it is under one type or the other that human interaction in all arenas of life necessarily fall.  From large-scale social organization and maintenance to the small-scale family unit, it is the position of this editor that peace and prosperity are most likely achieved through relations based on mutual consent. This book should prime the reader to develop an understanding and commitment to the political, social, and life philosophy called \"voluntaryism.\"  Back Cover Endorsements:  \"A wonderful selection of first-rate essays on one of the most important principles of civilized life-cooperating with people instead of controlling, taxing, dragooning, bullying or bombing them. Bravo, Skyler Collins!\" - Lawrence W. Reed, author of \"Striking The Root,\" and president of the Foundation for Economic Education.  \"This collection is especially valuable because it comes from the mind of someone who became convinced of the case for liberty -- and so we have here some of the most intellectually compelling literature of the modern libertarian world. The application to family life presents a serious challenge even to those who embrace political and economic liberty, but puzzle about how to apply these principles in their own life. In this, there is a collection about high thought and real action, and that's a beautiful combination.\" - Jeffrey Tucker, author of \"It's a Jetson's World\" and \"Bourbon for Breakfast,\" executive editor of Laissez Faire Books, and former editorial vice president of the Ludwig von Mises Institute.  \"This book contains a very useful, well-organized, and carefully selected set of essays centered around the idea of human liberty, what Hazlitt called 'cooperatism' [\"Foundations of Morality,\" p. xii] and what the editor calls 'voluntaryism.' In addition to covering the basics of politics and economics, the book contains a large number of essays devoted to education and parenting. This decision makes perfect sense, when we realize that our children and the ideas they are exposed to are the greatest hope for liberty in generations to come. I highly recommend this excellent volume, for beginners, activists, and seasoned libertarians.\" - Stephan Kinsella, author of \"Against Intellectual Property,\" and director of The Center for the Study of Innovative Freedom.",
  "genres": [
    "Sociology",
    "Parenting",
    "Education"
  ],
  "author": "Skyler J. Collins",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/15747544-everything-voluntary"
}