{
  "title": "Den vita frun",
  "description": "Bok 2 av den hyllade historieläraren från Lund!År 1784 reser Maria som sällskap till Juliana Bielke och hennes mor Dorotea från Stockholm till Borgeby slott i Skåne. Den vackra och utmanande Juliana har förargat sin mor genom att i hemlighet förlova sig med den unge fattige konstnären Kasper, och av den anledningen beslutar Dorotea sig för att ta med dottern bort från storstadens lockelser till Borgeby, där inte mindre än tre unga, ogifta och adliga män befinner sig. Maria, som levt tillsammans med familjen Bielke sedan hennes mor dog i dysenteri, är i jämförelse med Juliana alldaglig och tillbakadragen och van att befinna sig i skuggan av sin välgörares dotter.Familjen som residerar på Borgeby slott präglas av inre motsättningar och mörka hemligheter. Petronella Rosenhielm har två söner, Elias och Hugo Grave. Hon är änka och omgift med ryttmästare William Rosenhielm som i sin tur har sonen Alexander.Elias börjar genast uppvakta Juliana och hans mor är överdrivet insmickrande. Maria kan inte låta bli att undra över deras avsikter. Varför har sällskapet egentligen bjudits in till slottet?Till en början trivs Maria i sin nya miljö, men snart blir hon varse att allting inte står rätt till på slottet. Det sägs att det spökar i de kalla, mörka stensalarna och enligt Elias är det Den Vita Frun, som dränkt sig i en närliggande å, som hemsöker familjen. Maria vet inte om skrönan berättats bara för att skrämma henne och Juliana, men när hon själv förnimmer en oförklarlig närvaro börjar hon tro att det kanske ändå ligger något i Elias historia. Samtidigt finner hon kryptiska meddelanden i sin kammare, väcks av egendomliga ljud mitt i natten och märker flera gånger hur någon förföljer henne då hon promenerar i slottets trädgård. Maria börjar misstänka att det inte bara är av en händelse som hon har hamnat på Borgeby slottDen Vita Frun är Frida Skybäcks andra roman. Det är en begåvad, spänningsfylld kärleksroman om en ung kvinnas väg till att finna sig själv.Frida Skybäck (född 1980) är språk- och historielärare och arbetar på en internationell grundskola. Hon är bosatt med sin man och dotter i Lund. Frida Skybäck fick ett hedersomnämnande i Amelias kriminalmanustävling 2010 för sina texter. Hennes lovprisade debutroman Charlotte Hassel utkom 2011.",
  "genres": [
    "Historical Fiction",
    "Romance"
  ],
  "author": "Frida Skybäck",
  "average_rating": "3.18",
  "url": "https://www.goodreads.com/book/show/15747878-den-vita-frun"
}