{
  "title": "ToGetHer",
  "description": "“It was 12 midnight. I wondered how different this time would have been if I too had a boyfriend, would I be chatting with him at this time? Would we meet today? Would we get gifts for one another? Would we openly express what we felt for each other? Or would we keep it a sweet secret? Would I change too, like Snighdha had? Would I be possessive, would fight for small silly reasons, and then make up? Would I ever be able to dedicate and share my life with someone? Maybe, love would change me; maybe the feeling of being special will make me behave differently. But could I ever find someone special enough for me. Could I actually fall in love with someone? I doubted my own self. Just then my phone vibrated“Hey Ayesha! Happy valentine day dear!” it was Lakshit’s message.“Is he crazy? Sending messages at 12?” mind 1 got angry. Even my roommate who was busy talking on phone to her boyfriend stared at me, surprised.“So what’s the big deal? Do your other friends not message you at this time” practical mind 2 replied, changing the mobile mode to silent.“But those are the forwarded goodnight messages, not the ones wishing valentine day!” mind1 fought back“Don’t over think; it’s not a big deal. Ignore it and don’t reply back” brain 2 suggested.But brain 1 is neither as quick nor as smart as brain2. It made me type a reply,“A message from you at this hour is indeed a surprise. Anyways Happy Valentine Day to you too. Goodnight. Sleep tight.” Sent.Hardly a minute passed when it vibrated again. “Wow, so you too are awake. I was confused .Honestly; I thought you might get angry for messaging so late at night.”“Don’t reply to this one” mind 2 advised.But mind 1 made me type again.“Ya..was not feeling sleepy, lost in my own thoughts about the valentine day in school, old memories, newaz its late now. so lets stop chatting.” Sent.Another half minute passed when it vibrated again.”",
  "genres": [
    "Fiction"
  ],
  "author": "Ishita Bhown",
  "average_rating": "2.93",
  "url": "https://www.goodreads.com/book/show/15748395-together"
}