{
  "title": "Forty Days at Kamas",
  "description": "Inspired by Aleksandr Solzhenitsyn’s account of a Soviet labor camp revolt in Gulag Archipelago, Volume III, the story follows political prisoners and security officials at a corrective labor camp in Kamas, Utah, where inmates seize control during the summer of 2024.Kamas, Utah. 2024. In the totalitarian dystopia that America has become after the Unionist Party’s rise to power, the American West contains vast Restricted Zones dotted with ghost towns, scattered military garrisons and corrective labor camps where the regime disposes of its real and suspected enemies. Kamas is one such camp.On a frigid March night, a former businessman from Pittsburgh, Paul Wagner, arrives at a labor camp in Utah’s Kamas Valley, a dozen miles east of the deserted resort town of Park City, which prisoners are dismantling as part of a massive recycling project.When Wagner arrives, he is unaware that his eleven-year-old daughter, Claire, has set off to Utah to find him after becoming separated from her mother at the Philadelphia Airport. By an odd quirk of fate, Claire has traveled on the same train that carried her father into internal exile.Only after Wagner has renounced all hope of survival, cast his lot with anti-regime hard-liners and joined them in an unprecedented and suicidal revolt does he discover that Claire has become a servant in the home of the camp’s Deputy Warden. Wagner is torn between his devotion to family and loyalty to his fellow rebels until, on the eve of an armored assault intended to crush the revolt, he faces an agonizing choice between a hero’s death and a coward’s freedom.In Forty Days at Kamas, author Preston Fleming offers a stirring portrait of a man determined to survive under the bleakest of conditions and against formidable odds. Fleming’s gift for evocative prose brings the characters and events to life in a way that arouses emotional tension while also engaging the reader’s intellect with fundamental questions about the future of American society.",
  "genres": [
    "Fiction",
    "Dystopia",
    "Thriller",
    "Science Fiction",
    "Amazon",
    "Historical Fiction",
    "Mystery Thriller"
  ],
  "author": "Preston Fleming",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/10558758-forty-days-at-kamas"
}