{
  "title": "The Haze",
  "description": "The legend of the most powerful coven of vampires began in a very unconventional way. Fifteen hundred years ago, a holy man living in Rome was viciously turned inhuman by a blood thirsty vampire. Lucius’ purity was ripped from him and he was left to struggle with his lamentable misfortune, although unknown to him or the evil powers that turned him, fate played a great hand in Lucius’ new found reality. We all have a purpose in this world and Lucius’ was significant, yet he fought against his fate, against his hunger for human blood, and against the predator that now festered within him.The fates stepped in again and offered him a skillful advocate. They sent him Sulla, a two thousand year old mystical vampire, who had foreseen Lucius’ purpose in a vision and was determined to help him accept his fate as a gift, not a curse. With her help, Lucius recognized his task, and it wasn’t to be a predator but a guardian. He was to change the ways in which vampire’s treated humans. His intuitive mind and holy beliefs pushed him to create a new form of vampire that wouldn’t compromise compassion for lust. He set out and succeeded in creating a powerful new coven of highly gifted vampires he named Elite. The Elite were conceived to follow his beliefs and fight for a new purpose, yet with great misfortune Lucius reached his final death before his vision was completed. The Elite continued to follow his laws, but foolishly believed their purpose died with him, and accomplished little in fulfilling his destiny. Now, fifteen hundred years later, his great granddaughter, Natalia, struggles to keep the balance between her vast gifts, her understanding of her inherited purpose, the return of a highly skilled warrior she’s always desired, the consuming distraction of her sexual awakening, and a fascinating connection to a gifted human which can destroy everything.",
  "genres": [
    "Paranormal",
    "Paranormal Romance",
    "Vampires",
    "Amazon"
  ],
  "author": "Janine Olsson",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/15748821-the-haze"
}