{
  "title": "Living My Life, Vol. 1",
  "description": "“You damn bitch of an anarchist, I wish I could get at you. I would tear your heart out and feed it to my dog.” This was one of the less obscene messages received by Emma Goldman (1869-1940), while in jail on suspicion of complicity in the assassination of McKinley. The most notorious woman of her day, she was bitterly hated by millions and equally revered by millions.The strong feelings she aroused are understandable. She was an alien, a practicing anarchist, a labor agitator, a pacifist in World War 1, an advocate of political violence, a feminist, a proponent of free love and birth control, a communist, a street-fighter for justice — all of which she did with strong intellect and boundless passion. Today, of course, many of the issues that she fought over are just as vital as they were then.Emma Goldman came from Russia at the age of 17. After an encounter with the sweatshop and an unfortunate marriage, she plunged into the bewildering intellectual and activist chaos that attended American social evolution around the turn of the twentieth century. She knew practically everyone of importance in radical circles. She dominated many areas of the radical movement, lecturing, writing, haranguing, and publishing to awaken the world to her ideas. After World War I she was deported to Russia, where she soon discovered that anarchists were no better liked than in America, despite Lenin’s first gesture of welcome. She escaped with her life but never was allowed to return to the United States.Emma Goldman was a devastatingly honest woman, who spared herself as little as she spared anyone else. From her account the reader can gain insight into a curious personality type of recurrent interest: a woman who devoted her life to eliminating suffering, yet could make a bomb or assist in staging an assassination. Equally interesting are her comments on other radicals of the period, such as Kropotkin, Berkman, Mooney, Lenin, Trotsky, Haywood, Most, the Haymarket martyrs, and many others. Her autobiography, written with vigor, ranks among the finest in the English language.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Memoir",
    "Feminism",
    "Biography",
    "History",
    "Autobiography"
  ],
  "author": "Emma Goldman",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/1055914.Living_My_Life_Vol_1"
}