{
  "title": "Following Caesar: From Rome to Constantinople, the Pathways That Planted the Seeds of Empire",
  "description": "A travel narrative following three ancient roads and looking at more than two thousand years of history of Ancient Rome through the modern eye.In 66 B.C., young, ambitious Julius Caesar, seeking recognition and authority, became the curator of the Via Appia. He borrowed significant sums to restore the ancient highway. It was a way to curry favor from Roman citizens in villages along the route, built from Rome to Brindisi between 312-191 B.C. He succeeded and rapidly grew in popularity. After achieving greatness in Rome and the far reaches of Gaul, he led armies along this road to battle enemies in Roman civil wars. And then, across the Adriatic Sea, he joined Via Appia's sister road, the Via Egnatia that began in today's Albania. Other armies followed these two roads that eventually connected Rome to Byzantium, today's Istanbul. Octavian, who became, in 27 B.C., Rome's first emperor, and his friend and later enemy Mark Antony traveled portions of both roads to defeat Caesar's murderers Brutus and Cassius at Philippi in eastern Macedonia. The great Roman statesman Cicero, the Roman poet Homer, the historian Virgil and many other notables traveled along one or both of these roads. In the first century of the Roman Empire in the earliest years of Christianity, the apostles Peter and Paul traversed portions of them. Pilgrims, seeking salvation in far-away Jerusalem, followed them as well throughout much of the Middle Ages. In the early second century A.D., the emperor Trajan charted a new coastal route between Benevento and Brindisi, later called the Via Traiana.Today, short stretches of the original three roads can be seen in the ruins of ancient Roman cities, now preserved as archaeological wonders, and through the countryside near, and sometimes under, modern highways. Following those routes is the purpose of treading along the path that Caesar and so many others took over the early centuries. Modern eyes, seeing through the mists of more than two thousand years of history, lead the traveler along these three roads coursing through six countries between Rome and Istanbul. It is a journey full of adventure, discovery, and friendship—one one worth taking.",
  "genres": [
    "History",
    "Nonfiction",
    "Travel",
    "Audiobook",
    "Italy",
    "Ancient",
    "Ancient History"
  ],
  "author": "John Keahey",
  "average_rating": "3.36",
  "url": "https://www.goodreads.com/book/show/157494537-following-caesar"
}