{
  "title": "The Adventures of Ed Tuttle, Associate Justice, and Other Stories",
  "description": "A zoo with only black and white animals. A camp where children are forced to gather clams or face a trip to the “hot box.” A Supreme Court Justice’s confirmation hearing presided over by the 1977 Kansas City Royals. The Adventures of Ed Tuttle, Associate Justice, and Other Stories transports the reader to these hilarious places and beyond. This is a world, according to Dan Kennedy, host of The Moth Storytelling Podcast, “where corporate cafeteria lunch servers blurt out Kierkegaard quotes to soften the hard luck of a low supply of the ‘lunch beans’ that two raging alcoholic white collar workers crave daily; a world where an HMO in-network dentist hovers over patients and instead of asking about their flossing habits or aches, asks what it is that they like best about him; a world where television sitcoms are set on death row. That’s nothing—that’s the tip of the iceberg.” These stories, illustrations, and other errata are as funny as they are strange, as wonderful as they are wacky.“This is funny stuff, and I hope that Jay Wexler will donate his brain to neuroscience so we can see what’s up with it.”— Steven Pinker, Harvard College Professor of Psychology, Harvard University, and author of How the Mind Works “Jay Wexler is my kind of writer—that is to say, a weird one, and a wry one, and one who isn't afraid to act silly in a sort of bait-and-switch that, to the reader's surprise, moves him as much as it makes him laugh. Like all the best comedians, Wexler is clearly nursing a heart that the world broke a long time ago. Ed Tuttle is a book that can't decide what it wants to be when it grows up, but as with most cases of arrested development, there’s something very serious going on behind all the antics. Plus, there are pictures.”— Ron Currie, Jr., author of Everything Matters! “With a smart, irreverent style that never fails to delight, Jay Wexler is the 1977 Kansas City Royals of humor writing.”— Christopher Monks, author of The Ultimate Game Guide to Your Life and Editor, McSweeney’s Internet Tendency “Jay Wexler writes as if he has the ghost of James Thurber haunting him. These stories and sketches will hurt your gut and then tickle your brain. You need this humor. It'll be a hard week without it.”— William Giraldi, author of Busy Monsters “This feels something like the high-spirited whimsy of Wodehouse crashing into the joyously surreal lyrics of a Robyn Hitchcock song and the meticulous hilarious detail of Steve Martin's fiction. Wexler's stories are refreshingly original; forthright, inventive, and whimsical without being precocious; and like all great comedy, almost subliminally laced with a hint of the things we all struggle with like love and death. It was just plain fun to read this, so much so that I'm sure I'll do it again.”— Dan Kennedy, author of Loser Goes First and Rock An Office Power Ballad ; host of The Moth Storytelling Podcast",
  "genres": [
    "Fiction"
  ],
  "author": "Jay Wexler",
  "average_rating": "3.35",
  "url": "https://www.goodreads.com/book/show/15749747-the-adventures-of-ed-tuttle-associate-justice-and-other-stories"
}