{
  "title": "Dragon Defense",
  "description": "Praise for the “In the best traditions of Anne McCaffrey's fantasy books, \"Heirs to the Throne\" trilogy walks right on the border between Epic Fantasy and Sci-Fi. On one hand, we have advanced technologies like space travel, cloning, mind transfer to artificially created hosts, to name a few. On the other, we have dragons, people with special abilities who can control minds, talk to animals, heal, or even use \"speed time\"…This book, this trilogy, actually, falls into the \"diamond in the rough\" category. With no promotional budget behind the series, it's easy to miss even something this epic. So, pick these books up and spread the word - this is a lot of reading bang for the buck. Recommended.” Oleg Medvedkov, AuthorBook an Institute battleship threatens to destroy the planet, Donovan must wage war without modern weaponry. Before the Zebulon crew escaped from Institute-controlled space twenty years ago, Dr. Alexander deleted crucial records about Transfer from Institute files and hoped they could vanish before the Institute discovered the sabotage. He was wrong! Humiliated by the exodus of the scientists, Fremont won’t rest until he extracts the ultimate revenge. Donovan must train new recruits to operate forbidden technology and bored teenagers look like perfect candidates. Is there enough time for feudal lordlings to learn space-age skills and save the planet? In the meantime desert riders target Jarrack’s daughter, Shariel, who inherited his power of mind control. Afraid of becoming evil like her father, she needs to perfect the skill to help her siblings escape from a desert prison. The royal princesses face other predicaments. Lauryn travels to a desert stronghold to halt a dangerous radiation leak and falls prey to Salizar, a desert rider eager to marry a princess. Tessa and the wolves capture Jarrack, whose mind dwells inside a vulnerable young son. Can they keep him contained? Brandon, a spoiled lordling wants Felesia as his bride and plots to shanghai Jordan. Wild dragons join humans to rescue Shariel. The dragons enjoy giving rides to humans, but will they agree to fight for their new friends? As the clock ticks toward an explosive deadline, humans, dragons, and wolves execute a dramatic confrontation. Courage and ingenuity are the best weapons to prevent disaster and forge a new direction for the backward society. Will Donovan’s “dragon defense” strategy tip the balance in Drako’s favor? Their very survival depends on its success.",
  "genres": [],
  "author": "Diane Rapp",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/15750064-dragon-defense"
}