{
  "title": "The Apex Book of World SF 2",
  "description": "An expedition to an alien planet; Lenin rising from the dead; a superhero so secret he does not exist. In The Apex Book of World SF 2, World Fantasy Award nominated editor Lavie Tidhar brings together a unique collection of stories from around the world. Quiet horror from Cuba and Australia; surrealist fantasy from Russia and epic fantasy from Poland; near-future tales from Mexico and Finland, as well as cyberpunk from South Africa. In this anthology one gets a glimpse of the complex and fascinating world of genre fiction – from all over our world. Pre-order edition also includes Nir Yaniv‘s never-before-published-in-English novelette “Undercity” (8800 words) as well as Charles Tan‘s essay, “World SF: Our Possible Future”!Table of Contents:“Alternate Girl’s Expatriate Life” by Rochita Loenen-Ruiz“Mr Goop” by Ivor W. Hartmann“Trees of Bone” by Daliso Chaponda“The First Peruvian in Space” by Daniel Salvo (translated by Jose B. Adolph)“Eyes in the Vastness of Forever” by Gustavo Bondoni“The Tomb” by Chen Qiufan (translated by the author)“The Sound of Breaking Glass” by Joyce Chng“A Single Year” by Csilla Kleinheincz (translated by the author)“The Secret Origin of Spin-Man” by Andrew Drilon“Borrowed Time” by Anabel Enríquez Piñeiro (translated by Daniel W. Koon)“Branded” by Lauren Beukes“December 8th” by Raúl Flores (translated by Daniel W. Koon)“Hungry Man” by Will Elliott“Nira and I” by Shweta Narayan“Nothing Happened in 1999” by Fábio Fernandes“Shadow” by Tade Thompson“Shibuya no Love” by Hannu Rajaniemi“Maquech” by Silvia Moreno-Garcia“The Glory of the World” by Sergey Gerasimov“The New Neighbours” by Tim Jones“From the Lost Diary of TreeFrog7” by Nnedi Okorafor\"The Slows” by Gail Hareven (translated by Yaacov Jeffrey Green)“Zombie Lenin” by Ekaterina Sedia“Electric Sonalika” by Samit Basu“The Malady” by Andrzej Sapkowski (translated by Wiesiek Powaga)“A Life Made Possible Behind The Barricades” by Jacques Barcia“Undercity” by Nir Yaniv“World SF: Our Possible Future” by Charles Tan",
  "genres": [
    "Science Fiction",
    "Short Stories",
    "Anthologies",
    "Fantasy",
    "Fiction",
    "Speculative Fiction"
  ],
  "author": "Lavie Tidhar",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/15750676-the-apex-book-of-world-sf-2"
}