{
  "title": "The Telepathic Clans",
  "description": "The Succubus Gift & Succubus UnleashedBook 1 of the Telepathic Clans Saga:The Succubus Gift The history of the Clans, called the Sidhe by the Irish, stretches back to antiquity. The Goddess blesses Her people with 25 Telepathic Gifts. In addition to Telepathy, the Gifts include command over Air and Fire, Telekinesis and Teleportation. In over 2,500 years, She has never bestowed more than 15 Gifts on a single person.Brenna Morgan was orphaned at eight when her parents were killed in a plane crash. Through one foster home after another, she carried the ornate, carved wooden box her mother had left with her, keeping it always a secret. Then one night she stumbles over a man who claims her as family.Brenna’s life isn’t the same after she discovers her unusual and mysterious heritage. In addition to being a telepath, Brenna learns she has the Succubus Gift. That’s just the beginning of her problems. Someone is stalking her. Then there’s the tall, dangerous woman who shadows her and hints a Goddess has linked them. And what is she going to do with a handsome, charismatic, womanizing man she knows she should avoid? Some days a girl just wants to pull the covers over her head and stay in bed -- with a willing young man of course.Urban Fantasy with a dash of romance. The Succubus Gift is a completely different take on the succubus myth. Beautiful women and hot men in a world with a hidden telepathic subculture.Book 2 of the Telepathic Clans Saga:Succubus UnleashedIt's not easy being a succubus.Brenna O'Donnell and Rebecca Healy continue their integration into the Clan. Learning more about their Gifts and always seeking someone who will love them. After a crash course in learning about her genetic heritage, Brenna O'Donnell has discovered what it really means to be a succubus and has learned to embrace her strange Gift. Her major concern is whether Collin will accept her for what she is. As she adjusts to telepathic society, others in the Clan have plans that will strip the last of her freedom. The social season is around the corner, including events that Brenna never imagined in her wildest dreams. The succubi, representatives of the Goddess on earth, are at the center of an ancient worship. And if a girl is going to be the center of attention, then obviously she needs a new dress.Between the romance and glistening balls of the Clan's social events, Brenna and Rebecca discover life is not secure. Telepaths from other Clans are kidnapping young girls and selling them into slavery.A continuation of what one reviewer called an, \"... utterly heart stopping onslaught of sex, violence and paranormal abilities ...\"",
  "genres": [
    "Paranormal",
    "Urban Fantasy"
  ],
  "author": "B.R. Kingsolver",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/15751940-the-telepathic-clans"
}