{
  "title": "Trust Your Radar: Honest Advice For Teens and Young Adults from a Surgeon, Firefighter, Police Officer, Scuba Divemaster, Golfer, and Amateur Comedian",
  "description": "Avoid Life's Major Sand Traps! An incredible range of life lessons sprinkled with unforgettable, moving, and laugh out loud stories. Practical, reasonable solutions from a totally unique, straightforward approach. Distills everything young people need into one concise, fun to read format. Parents: You want your kids to know these things! Book Benefits: Show young people, in a clear and non-preaching way, how to avoid the major sand traps of life that snag every generation. Also keep readers entertained with fun and memorable stories from the author's careers as a surgeon, firefighter, police officer, scuba divemaster, golfer, amateur comedian, and more. Target audience Ages 14 to 40 and concerned parents. Unprecedented approach: Practical, real life advice filled with engaging, funny, and poignant stories. Completely unique perspective in an easy and fun to read format. Controversial: It's time to replace: \"Just say no,\" abstinence only, celebrity and reality show worship, intolerance, rigid ideologies, confusing jargon - with accurate information and workable solutions. This book lets you: Identify your Radar - It's your brain functioning optimally; not a vague intuition or sixth sense. Train your Radar - Stock your memory bank with key information on crime avoidance, healthy weight, tattoos, getting organized, respectful relationships, going to college or work. Cut through fake complexity with clear thinking on evaluating people, investments, credit cards. Learn the most dangerous toxic personality types and avoid them like the plague. Meet the Radar Jammers - They have the power to turn down or turn off our clear thinking Radars. Some are well known: alcohol and drugs, peer pressure, infatuation, anger. Others are surprising: showing off, fake complexity, unthinking religions, the need for speed, dangerous personality disorders, and even fast food! Learn specific techniques to deal with them all. Top 10 Radar Jammers: Most sand traps of life have a Radar Jammer or two waving people in: 1) Alcohol, Drugs, and Addiction (Pretty obvious) 2) Love, Infatuation, and Marriage (Hold onto your shorts) 3) Unthinking Religion (Warning: Sacred cow alert) 4) It's Too Complicated For You To Understand 5) Anger and Rage 6) Sleep Deprivation 7) Fast Food and Overeating 8) Multitasking, Electronic Devices 9) The Need For Speed 10) Showing Off \"C.B. provides young people practical advice to help navigate life's inevitable obstacles and hurdles. All parents want at some time to be able to whisper wisdom into their child's ear...Trust Your Radar, does just that.\" Craig Wasserman, co-author of The Invisible Spotlight \"C.B. Brooks explains the complex world of personal finance in simple, understandable terms and in a fun, conversational style.\" Taylor Larimore, co-author of The Bogleheads Guide to Investing and The Bogleheads Guide to Retirement Planning.",
  "genres": [],
  "author": "C.B. Brooks",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/15752716-trust-your-radar"
}