{
  "title": "The Perlemoen of Obz",
  "description": "The coastal towns of South Africa bustle with a hot new drug: perlemoen, endangered abalone that fetches a high price in East Asia and turns humble fisherman into wealthy kingpins overnight. Thursday Malaysius is an earnest young worker in a local fish factory who only wants to stroll through the hills of Hermanus and watch the whales as they flop in the bay. Until one day his best mate Leon—affable, cinnamon-skinned, and good looking—comes knocking for help. As Thursday’s simple world crumbles around him, he is drawn inexorably into the violent multi-million rand perlemoen trade, in a quest not just to save Leon but himself. The Perlemoen of Obz is based on research with prosecutors and abalone workers, transporting you to a Cape Town underworld hidden beneath the peaks of Table Mountain. Brimming with humor, this multicultural exploration of post-apartheid South Africa is as much about loyalty to your friends as to yourself, and confronting your deepest fears when there is no one left to show you the way.“You can taste Cape Town, you can hear it in the dialogue, see its beauty in the descriptions. Deji Olukotun has my city’s number: especially its nasty underbelly, the dangerous dealing of abalone poachers. And there’s humour too, an off-beat humour that is typical of people living by their wits. Here’s a wonderfully strange tale of the city beneath the mountain.” —Mike Nicol“Thursday Malaysius, a likable fellow with an almost magical expertise in perlemoen abalone, is unintentionally thrown into the dangerous business of international smuggling. Loyalty to his childhood friend Leon, while admirable, could prove to be a fatal mistake. Author Deji Olukotun depicts South African life with a deft and affectionate voice. The vivid and memorable characters of The Perlemoen of Obz will stay with the reader long after the story is finished.” —Marla Johnson, World Literature TodayDeji Olukotun graduated from the MA in Creative Writing at the University of Cape Town in South Africa. A human rights lawyer by training, he became the inaugural Freedom to Write Fellow at the PEN American Center. His work has been published in Guernica, Joyland, Words Without Borders, World Literature Today, and The London Magazine. His time is divided between Brooklyn and the small farm where he grew up in New Jersey.",
  "genres": [],
  "author": "Deji Olukotun",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/15753297-the-perlemoen-of-obz"
}