{
  "title": "The Voice of the Tiger, A War Romance During the Malayan Emergency",
  "description": "A love story and jungle odyssey, laced with military action, among the indigenes and wild creatures of the rainforests of Malaya.Vince Tanner was in 2 NZ Regt sent to Malaya to replace 1NZ Regt at about the time the Malayan Emergency was coming to an end.He soon gets into trouble when he contracts a serious tropical disease and finds himself admitted to a military hospital. It is here that he finds and falls in love with Audrey, a beautiful nursing officer, who by the rules of the military he is strictly forbidden from having a relationship with. But it was love at first sight and there were no military rules in the world that would stop them being together.They embark on an intense affair and although they have only known each other a matter of days, the depth of their relationship leaves them feeling that they have known each other their entire lives. Their euphoria is short lived however, it is cut short sharply when dire and unexpected events from the past and present overtake the couple, Audrey is attacked and slips into a deep coma from which she may never recover.Forced to resume his military duties and believing he has lost the first woman he has ever really loved, Vince falls into despair, drunkenness and lechery. On patrol deep in the Malayan rainforest he becomes separated from his platoon, discovers the solitude and vast grandeur of the jungle, the wonder of nature and ultimately the Orang Asli, the indigenous aboriginal people of Malaya.A symbiotic relationship between Vince and the Orang Asli tribe is established, but he begins to suspect that everything that has happened to him was pre-ordained and possibly influenced by Abu the spiritual leader (Halak) of the Orang Asli tribe. During the time he spends with the Orang Asli he discovers the differences between his and their culture, a belief system that embraces the rules of animism and social rules that would be strictly taboo in his own society. He feels comfortable in their presence and, for a short time, lives as they live, accepts their rules and embraces their culture. He knows he will eventually have to leave, but fate will determine when and whether he and Audrey can ever be together again.The Voice of the Tiger is a story of romance, a war romance, that came to be a tale of love at first sight, a meeting of true soul mates and an illicit, forbidden love, tainted by brutal, behaviour changing events that threaten to tear the lovers apart forever.The Malayan Emergency was never truly recognised as a war, but a war is exactly what it was and many young men found themselves embroiled in the conflict far away from their native homeland. These are circumstances where young men take solace wherever they can find it. During war it is not uncommon for men to seek the company of a woman, a distraction to help them cope with the situations they find themselves in.Vince found the indigenous peoples of the Malayan peninsula, discovered their world of animism and ultimately an aboriginal man ‘Abu’ who was prepared to risk his very soul to help him. Believers in animism consider that there are many gods who interact through nature taking many different forms. These can be heavenly bodies, inanimate objects, the spirits of humans that have passed on or those that take the form of animals.Vince, with guidance from a man’s spirit in a tiger’s form and using the power of animism attempts to find redemption? Can Abu help him save the woman he loves from the gates of the underworld itself and keep the gods appeased at same time?Albeit a work of fiction, the story clings closely to the reality of the period. It is a war romance set amongst the indigenous peoples of Malaya and the events that were taking place at this time of military conflict.",
  "genres": [],
  "author": "Markham Turner",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/15753348-the-voice-of-the-tiger-a-war-romance-during-the-malayan-emergency"
}