{
  "title": "The Illegal Gardener",
  "description": "The Illegal Gardener\n is the first book in the Greek Village Collection from INTERNATIONAL BEST SELLING AUTHOR Sara Alexi.The Illegal Gardener is a moving, poignant story about life's rare encounters which knock us off our path, and elevate our very existence.Driven by a need for some control in her life, Juliet sells up on impulse and buys a run down farmhouse in a tiny Greek village, leaving her English life behind. Her boys have grown and she has finally divorced her bullying husband. This is her time now.Whilst making her new home habitable, Juliet discovers she needs a sturdy helping hand with the unruly and neglected garden. Unwilling to share her newfound independence with anyone, but unable to do all the work by herself, she reluctantly enlists casual labour.Aaman has travelled to Greece from Pakistan illegally. Desperate to find a way out of poverty, his challenge is to find work and raise money for the harvester his village urgently need to survive.What he imagined would be a heroic journey in reality is fraught with danger and corruption. Aaman finds himself in Greece, and with each passing day loses a little more of himself as he survives his new life as an immigrant worker; illegal, displaced, unwanted and with no value. Hungry and stranded, how will he ever make it back home to Pakistan?In what begins as an uncomfortable exchange, Juliet hires Aaman to be her gardener, but resents the intrusion even though she needs the help. Aaman needs the work and money but resents the humiliation.In spite of themselves, as the summer progresses, they get to know one another and discover they have something in common. Pieces of their lives they have kept hidden even from themselves are exposed, with each helping the other to face their painful past.Will Juliet and Amaan finally let each other in? And what will be the outcome of this improbable conjoining of two lost souls?",
  "genres": [
    "Fiction",
    "Greece",
    "Contemporary",
    "Romance",
    "Chick Lit",
    "Cultural",
    "Book Club"
  ],
  "author": "Sara Alexi",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/15754134-the-illegal-gardener"
}