{
  "title": "Rispin Quill",
  "description": "Rispin Quill, The Dragon TongueLegends of the Dragon Tongues: Book OneThe small town of Ravenswood Bridge has a problem – a large, scaly, fire breathing problem. Once a year a huge dragon turns up and decides to fly around setting fires left, right and centre, which for most people, isn't really that convenient.This year however, will be different; a prophet has spoken, the monster will be no more and the good people will be saved, for they have a champion, a chosen one, a hero. At least, that’s how the plan was meant to go, before Rispin Quill got involved.Rispin Quill, The Dragon Tongue is a satirical, fantasy, comedy novel that's suitable for all ages.What’s in the book?Prepare for legends, a walk to certain doom, several inclusions of facts from renowned natural historian Doctor L. C. Monoculus, learn the truth behind the shameful acts of a drunken, rampaging strongman, and receive tips on how to / how not to trap a furioum mouse.Experience an exciting encounter with a mighty dragon, a frightening fight with a vicious werewolf, then there’s possible death, blossoming love, and well-edited dull bits that you'll hardly notice.Please be aware (part one)Rispin Quill, the Dragon Tongue does not include: villain does bad deed. “We need a hero.” Hero turns up. Predictable filler to use up more pages. Swords / axes / a battle. The hero’s friend dies (gallantly). Wait, no, they’re okay. The villain is dead – or are they? Everyone is happy. The end.Please be aware (part two)According to a certain dragon, that along with fire and P.R., dragons additionally created writing – just to ensure books like this one could be written. With that knowledge in mind, keep a dragon happy / don’t suffer from the dark treacle; read Rispin Quill, the Dragon Tongue, right away.^^ Dragon P.R. at its finest.",
  "genres": [
    "Fantasy"
  ],
  "author": "Andrew Thornway",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/15754647-rispin-quill"
}