{
  "title": "Kiss Me Forever / Love Me Forever",
  "description": "Kiss Me Forever \n He's Hot. He's Sexy. He's Romantic. He's Immortal. \n If there is one thing Dixie LePage does not need in her life, it's complications. And the man sitting across the table from her in a crowded English pub, the one offering to buy the library of her inherited estate in a small English village, is a major complication. For starters, there's the broad shoulders. The slightly amused smirk. That smoldering look that makes it impossible to concentrate. And that infuriating, old-fashioned, and well, okay, incredibly appealing sense of chivalry. No doubt about it, the guy is hot and sexy. Of course, there is one wee little problem: He claims to be a vampire named Christopher Marlowe, as in THE Christopher Marlowe, famous playwright, contemporary of Will Shakespeare. Right. Amend that to hot, sexy, and totally insane. Please see \"no more complications.\" So why can't Dixie seem to resist the warmth of Christopher's charm, the protective feel of his strong hands, or the tempting pull of his full mouth when the sun goes down. . .?  \nLove Me Forever\n Does This Come In My Size?\n Justin Corvus. That was the name of the gorgeous, dark-eyed charmer holding her hand in a sensual clasp, turning her knees into jelly. All struggling, single mother Stella Schwartz meant to do was let her son, Sam, browse through books at Dixie's Vampire Emporium. She hadn't counted on the shop assistant being a stylish super-hunk with the kind of Hugh Grant accent that makes a woman's thoughts wander through a neighborhood called Take Me Now, Please. And to top it off, the man's a sweetheart. The way he picked up on the fact that she didn't have two red cents for the Halloween costume Sam wanted but made it happen anyway? Total head-over-heels time. When Justin smiles at her, it's as if he's known her forever. . .and when he asks for her phone number--to let her know when the costume is ready, of course--Stella can't help wanting this feeling to go on forever. There's something very different about Justin Corvus. . .different and irresistible. . .  For The First Time Together-- Two Unforgettable Novels Of Passion By An Extraordinary New Voice In Romance Rosemary Laurey  Discover one of contemporary romance's brightest rising stars, Rosemary Laurey, in two remarkable novels complete in this volume. Enter a world where enchantment runs wild, passions are white-hot, love is deliciously unexpected, and the hero is anything but safe. Experience this dazzling new author and feel twice charmed, because with novels this good, you won't want to stop with just one. . .",
  "genres": [
    "Vampires",
    "Romance",
    "Paranormal",
    "Paranormal Romance",
    "Fiction",
    "Adult",
    "Fantasy"
  ],
  "author": "Rosemary Laurey",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/105605.Kiss_Me_Forever_Love_Me_Forever"
}