{
  "title": "This Wild Silence",
  "description": "\"I like to tell Liz that I'm her dark side,\" says Christine, the narrator of critically acclaimed author Lucy Jane Bledsoe's newest novel. And Christine and her sister, Liz, are indeed opposites. Liz, married to her high school sweetheart Mark, has an outwardly perfect life, but her fierce control is beginning to falter. Christine, a doctor in San Francisco's Tenderloin district who is buried in her work, cannot connect meaningfully with any of the women with whom she falls in love. But the sisters share a secret, one that has bound them tightly to each other for 30 years.\"Scanning the horizon for Timothy is almost an instinct with me,\" Christine reveals in the book's opening sentence. Timothy, her little brother, disappeared 30 years ago while she and Liz were supposed to be watching him, and their guilt over this event and the lies they have almost come to believe have haunted both sisters throughout their lives. On a winter expedition in California's Sierra Nevada mountains with Liz, Mark, their current juvenile delinquent charge Lenny, and Mark's assistant Melody, an undercurrent of tension bursts into open hostility when a sudden storm traps them on the mountain.Through Lucy Jane Bledsoe's graceful writing, the -sisters' lifetime of deception is gradually and heartbreakingly revealed, and finally, in this harsh and dangerous environment, secrets are exposed and lies give way to the kind of healing truth that provides a possibility for hope.Lucy Jane Bledsoe is the author of \"Working Parts,\" winner of the American Library Association Gay/Lesbian/Bisexual Award for literature, and \"Sweat: Stories and A Novella,\" a Lambda Literary Award finalist. She has been published in \"Newsday\" and \"Ms.\" among others, and teaches in the master's of creative writing program at the University of San Francisco.",
  "genres": [
    "Fiction",
    "Lesbian",
    "LGBT",
    "Queer"
  ],
  "author": "Lucy Jane Bledsoe",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/1056051.This_Wild_Silence"
}