{
  "title": "Light & Dark: The Awakening of the Mageknight",
  "description": "Blurb Description:Danny Firoth is an average thirteen-year-old who finds himself at the beginning of his eighth-grade year, struggling with some of the more common concerns that plague a boy of his age: bullies, homework, and his mother. Sabrina Drake is the new girl. She is beautiful and spellbinding, but carries a fantastic secret.Accepted into the White Rock Academy of Illumination, a school for young Squires destined to become Knights of the Light and battle the forces of the Dark with magical weapons called Bondeds, Danny joins his five closest friends in the training of their lives. Honed in the techniques of blade work by an Elvin swordmaster and educated by a colorful assortment of knightly instructors, Danny and his friends are placed on the path to becoming knighted members of the Light. However, the Dark may have other plans as they unveil a sinister plot in this fantastic tale of dragon-riding adventure, sword-wielding action, and coming-of-age drama.Synopsis:WARNING - MAY CONTAIN SPOILERSDanny Firoth is on the verge of beginning his final year in middle school. The only odd thing to happen on that fateful day is the appearance of new student in school, a beautiful girl named Sabrina Drake. Fascinated by not only her spellbinding looks, but her interest in a popular fantasy card game called Knights, Danny develops a school-age crush. However, before he can build up the courage to talk to her at length, he is confronted by the resident bully. Forced into a fight, he learns that he is not so average as a strange power awakens within him, allowing him to foresee the actions of others before they happen. With the help of this new ability, Danny is able to put his antagonist in his well-deserved place, but quickly finds himself punished with an after-school detention. Awaiting the arrival of his not so happy mother, Danny is startled as a rumble shakes the very foundation of the school. Following the shuddering to its source, he discovers two frightful creatures engaged in an epic struggle of mortal combat, a large dragon and a strange shadowy being. Nearly torn to pieces by the creature of shadow and saved by the creature of legend, the dragon, Danny barely escapes. The next day at school, Danny joyfully finds that Sabrina Drake has taken a curious interest in him. With plans to meet after school, Danny’s dark thoughts, once centered on the frightful events the night before, become focused on his crush. However, things do not go as planned as the creature of shadow appears once more, forcing Sabrina Drake to forgo her secret and transform into the familiar form of the dragon that saved Danny the previous evening. After defeating the dark creature, Sabrina Drake resumes the shape of a human and begins to explain that the popular card game of Knights is more than simply a game, but reality. She describes an ancient struggle with the creature she has just defeated, dating back hundreds of years as well as an Order that has vowed to destroy them, the Light. Discovering that he has a rare ability to see these forces of darkness, Danny accepts an invitation to be tested for the possibility that he could one day become a Knight of the Light. Danny as well as four of his closest friends are judged worthy and accepted into the White Rock Academy of Illumination, a school for young Squires destined to become Knights of the Light and battle the forces of the Dark with magical weapons called Bondeds; swords created from the souls of fallen Knights of the Light. Upon the back of a full-blooded Draconic, a dragon as well as Sabrina’s father, Danny and his friend's venture to the Florida coast where they board an old, but magical ship, and set sail for the Bermuda Triangle. In the center of the legendary triangle is a swirling tempest of black clouds, created by an ancient tear between the human world and the world of the Shadows. With the help of a Navi, a wizard specialized in navigating the dangers of the dark storm, Danny and his friends arrive safely at White Rock Island where they begin the training of their lives. Honed in the techniques of blade work by an Elvin swordmaster, Sir Syndil, and educated by a colorful assortment of professors, Danny and his friends learn battle strategy, hand to hand combat, defense against the magical arts, and a history of the ancient conflict with the Shadows. However, discovering a powerful ability within himself that may mark him as the destined savior foretold, the Mageknight, Danny must question the intentions of his instructors. With the help of his friends, Danny must use everything he has learned to thwart the betrayal of someone within the Order of Light in this fantastic tale of dragon-riding adventure, sword-wielding action, and coming of age drama.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Fiction",
    "Supernatural"
  ],
  "author": "Daniel M. Fife",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/15755349-light-dark"
}