{
  "title": "Disenchanted",
  "description": "Book One (The Celtic Vampyre Saga)333 pages (print length)Faelynn LeCroix is a woman hell-bent on finding those responsible for the brutal murder of her mother and the abduction of her father. She’s on a quest for revenge and, in her opinion, the bloodier the better. The arduous trail that she has been doggedly following for three years has led her directly into the path of Nathaniel Valour, an Irish vampyre who rules over the territory of New England. At first, she sees him as nothing more than one of the fiends she disposes of on a nightly basis, but something tells her that Nathaniel is different from every other vampyre she has ever encountered on her trail of retribution. The truth is, Nathaniel Valour is different—he is a vampyre with a secret. Upon looking into the eyes of Faelynn, Nathaniel realises that she is the one he has unknowingly been waiting for. Can Faelynn see beyond her situation and place her fragile trust in the hands of a depraved creature of the night, one she swore to destroy every last one of? If she can, Faelynn may find herself closer than ever to quenching her thirst for vengeance.This intriguing and passionate saga would be attractive to the habitual readers of Gothic literary works, paranormal romance, and horror.\"Dark, brooding and dripping with atmosphere, 'Disenchanted' is absolutely fantastic. With a great ear for dialogue and a wonderfully descriptive style, Farrell sucks you in from the first paragraph and doesn't let you go until the climax which leaves you begging for more.\" - Ruairi O’Hagan, Cork's RedFM.“Masterful… Challenging… Beautiful… I loved it, I used to live for writing like this!” - Braine, Talk Supe.“Mark my words, C.K. Farrell is going to be a force to be reckoned with in the publishing world. It’s about time an Irish writer threw their hat, and a scholarly hat at that, back into the vampire arena.” - Veronica Salva, New Hampshire Gothic Horror Review.\"The Celtic Vampyre Saga is an enchanting and terrifying account of lost souls who seek redemption. It is a lot more than a simple, lustful vampire tale. Instead, it is a mature, artistic, and thought-provoking piece with substance in abundance. Read it, you will not find yourself disappointed, only inspired and enlightened.” - D’arcy Ondine, Artist, Poet, and Author.",
  "genres": [
    "Paranormal",
    "Vampires",
    "Romance",
    "Paranormal Romance",
    "Amazon",
    "Fiction",
    "Fantasy"
  ],
  "author": "C.K. Farrell",
  "average_rating": "3.34",
  "url": "https://www.goodreads.com/book/show/15755564-disenchanted"
}