{
  "title": "Love Does: Discover a Secretly Incredible Life in an Ordinary World",
  "description": "Now a New York Times Bestseller!As a college student he spent 16 days in the Pacific Ocean with five guys and a crate of canned meat. As a father he took his kids on a world tour to eat ice cream with heads of state. He made friends in Uganda, and they liked him so much he became the Ugandan consul. He pursued his wife for three years before she agreed to date him. His grades weren't good enough to get into law school, so he sat on a bench outside the Dean’s office for seven days until they finally let him enroll.Bob Goff has become something of a legend, and his friends consider him the world's best-kept secret. Those same friends have long insisted he write a book. What follows are paradigm shifts, musings, and stories from one of the world’s most delightfully engaging and winsome people. What fuels his impact? Love. But it's not the kind of love that stops at thoughts and feelings. Bob's love takes action. Bob believes Love Does.When Love Does, life gets interesting. Each day turns into a hilarious, whimsical, meaningful chance that makes faith simple and real. Each chapter is a story that forms a book, a life. And this is one life you don't want to miss.Light and fun, unique and profound, the lessons drawn from Bob's life and attitude just might inspire you to be secretly incredible, too. “If this book does not make your heart beat faster, book the next flight to Mayo Clinic!” --Bill Hybels, Senior Pastor, Willow Creek Community Church, Chairman, Willow Creek Association“Bob Goff is a one-man tsunami of grace, a hurricane of love. He doesn't just talk about change, he really is change, as Love Does chronicles in such a vivid way. Yet, Love Does doesn't leave you feeling like you want to celebrate its author, it awakens a sense deep within that you, too, have an outrageous role to play in God's unfolding story or rescue and repair.” --Louie Giglio, Passion Conferences/Passion City Church“An interesting and compelling story (with Young Life roots) that ends with a practical challenge and ‘love does’ and God can use you to do it!” --Denny Rydberg, President, Young Life“Every once in a while someone like Bob Goff shows up to remind us that some things matter a lot more than others. Love Does has a kind of ‘north star’ effect that will push you to refocus your life and energy on what is most significant. It doesn't just invite you to respond with your God-given potential, it invites you to become a part of what God can do beyond your potential.” --Reggie Joiner, Founder and CEO of Orange“We liked the book a lot. Mostly, the balloons on the cover. The rest was pretty good too. Lots of stories about how God helps us.” --Aedan, Asher and Skye Peterson ages 13, 12 and 9“This may look like a book. It’s not. It is an invitation to enter into the greatest adventure you have ever known—your life as it was meant to be lived. Hang on!” --Michael Hyatt, Author,  Get Noticed in a Noisy World, MichaelHyatt.com“Bob’s ability to love people brings contagious hope and inspiration wherever he goes. The power of love showcased in this book will surely touch the hearts and souls of many people.",
  "genres": [
    "Christian",
    "Nonfiction",
    "Faith",
    "Self Help",
    "Christianity",
    "Christian Living",
    "Religion"
  ],
  "author": "Bob       Goff",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/15755576-love-does"
}