{
  "title": "Manipulating the List",
  "description": "Katherine Sheppard is the exception to the rule. That is, as long as she continues to run from the law; murder innocent people; and manipulate the Collector’s List…  Shouldn’t be hard, right?  Since the tender age of six, Katherine has always loved to hear Jonathan’s nightly stories about tracking, stalking, and collecting his victims. She’s even had the privilege of watching souls transition into the afterlife, led by the hand of the Collector to their paths where angels or demons escort them home. It has been an unwavering friendship that has flourished for sixteen years. That is, until an unexplainable twist in circumstances causes Katherine’s name to appear on the Collector’s List.  Oh, but do not mistake this as an end, this is just the beginning. Katherine refuses to hand over her soul quietly and Jonathan will stand beside his friend, feeling the bitter sting of helplessness as he realizes that he might possibly be the cause of her demise. So now a new relationship unfolds between them, one of checks and balances, hints, clues, and mysteries, where the two, despite their now forbidden friendship, will work together to manipulate the List.  But just as resolute, the law won’t stand idly by as Katherine assists in the deaths of others. Every form of law enforcement is preparing to conduct a global manhunt to bring her to justice. Nor will the Creator of the List tolerate a friendship that goes completely against his rules. The collections continue to increase in difficulty, pushing Katherine into an irreversible life of crime where the only possibility of escape is her own death. Yet Katherine, as impassionedly determined as a trapped animal trying to escape its captor, will stay the course in her fight to overcome Heaven, Hell, earth and … the Collector.",
  "genres": [
    "Fantasy",
    "Paranormal"
  ],
  "author": "K.B. Lever",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/15756982-manipulating-the-list"
}