{
  "title": "Bitten and Bound",
  "description": "In this new version of Bitten and Bound, Dominique DuBois has expanded her original story to further develop the sexual and personal relationships between Jack Thompson and Jordan March. Containing nearly three times as much material as the first version (with extensively fuller background information, and longer sex scenes), DuBois has laid the foundation for a broader and more colorful story between her two intriguing main characters for those of her readers who desire a deeper and more fulfilling tale. Hopefully those of you who like more character development and longer romantic interactions in your erotic stories, will duly enjoy this updated, expanded, and naughty new edition of \"Bitten and Bound: Unleashed.\"~(For those readers who are more interested in a brief, exhilirating erotic tale, the original \"Bitten And Bound\" will still be available for purchase.)Jordan March thinks she is going on a lovely week-long retreat with Jack Thompson, a man she met and befriended over the internet several months ago. Initially brought together over their shared love of the arts, she eagerly accepts his invitation to a week-long arts festival up in the mountains. Only little does she know, Jack's plans do not revolve around art, whatsoever. They revolve around their second mutual interest; that of bondage, submission, and hot and steamy sex.Believing that Jack is interested in her only for her mind, Jordan, a rather bookish but still beautiful woman, is absolutely stunned to realize that instead of a week of adventure with his six friends, Jack instead has plans for the two of them only; plans that involve her complete and total submission to each and every one of his somewhat sadistic, but oh so sexy desires. When they arrive to the planned \"lodge\" and Jordan finds only a cottage with certain sexual devices out front, she will run away fast and hard from the man who is destined to chase her. But what Jordan will soon realize is that what she is running from is not only being forced into delicious and overpowering sex with Jack, but that she is also running in fear from the truth of her own deepest sexual desires. Will she finally face up to them with Jack during their week-long excursion? Will she ever be able to admit to her body's deepest desires? Only time will tell, as we join Jack and Jordan on the ultimate sexual odyssey and the total surrender and submission of not only her body, but also her soul.**This novella contains adult themes, including (but not limited to); explicit sex, bondage, choking, some mild \"rape\" themes/fantasies, forced oral sex, submission/domination, and other explicitly sexual themes and descriptions. If you are uncomfortable with any of these themes, please refrain from purchasing this work. This work is also intended only for those 18 years of age and older, and it is not authorized to be read by minors. Please refrain from purchasing it unless you are legally able to do so by law (as an adult). Thank you.**",
  "genres": [
    "BDSM"
  ],
  "author": "Dominique D. DuBois",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/15757429-bitten-and-bound"
}