{
  "title": "Sacred Body, Sacred Spirit: A Personal Guide to the Wisdom of Yoga and Tantra",
  "description": "Sacred Body, Sacred Spirit is a book about transforming our ordinary lives into a sacred experience. You will be introduced to Tantra as the essence of yogic practice and philosophy. Known by the ancient yogis as a powerful conduit for personal transformation, Tantra holds the secret to turning our longings into love and our feelings of separation into spiritual union. Generally known in the West as \"the yoga of sex,\" in this book, you will encounter a more integral form of Tantra. Some yogis call this ancient wisdom \"the yoga of everything.\" Because, Tantric yoga is about seeing and realizing that everything we do can become a sacred, spiritual act. This form of alchemical spirituality is insightfully and poetically articulated in this book by Ramesh Bjonnes, a popular yoga blogger, workshop leader and cofounder of the Prama Institute. \"An insightful, balanced approach to the frequently misunderstood pursuit of spiritual growth and personal well-being.\" --Kirkus Review \"This book is a source that any person, lay or scholar, will benefit from reading, because here is a practitioner whose fine mind reaches into his heart, converging one into the other. Bjonnes is now an important voice for the study of living Tantra.\" Douglas Brooks, Professor of Religion, Rochester University, author of Auspicious Wisdom \"The writings of Ramesh Bjonnes cut right to the core of the spiritual journey. His essays enter through my mind and then travel to my heart, where they blossom like beautiful flowers of love and truth.\" Jai Uttal, Grammy-nominated world musician \"Sacred Body, Sacred Spirit is an inspiring and provocative book. These essays have been among the most consistently popular ever on our website.\" Bob Weisenberg, Associate Publisher, Elephant Journal",
  "genres": [],
  "author": "Ramesh Bjonnes",
  "average_rating": "4.70",
  "url": "https://www.goodreads.com/book/show/15758632-sacred-body-sacred-spirit"
}