{
  "title": "A Rage in the Heavens",
  "description": "THE FIRST BOOK IN THE PALADIN TRILOGY  “Power be the lure that draws men forth, and power be the snare that takes them.”  Thus runs an ancient proverb of Alencia, and its truth is demonstrated when Alacon Regnar, Tyrant of the Northlands, is enticed to accept a demonic scepter known as the Ohric with whispered promises of conquest and domination. The Ohric fulfills these promises beyond even Regnar’s wildest dreams, summoning forth the Juggernaut, a gigantic darkness in human shape that smashes its way through everything in its path and leads the Northing horde towards Jalan’s Drift, the greatest and richest fortress-city in all the world.  Against this horror stands a single man, Darius Inglorion, a holy warrior known as a Paladin, who is summoned to rally the states of the Southlands which are frozen by fear and treachery. But societies have their own defenders who strike out when their functions are threatened, and Darius faces treachery from dukes and priests alike. He finds a devious ally in Adella, a fearless thief with a mystical sword who just may hold the key to the Juggernaut. And finally, pursuing him over the long leagues is Darius’ own 17 year-old daughter, Shannon, who has ignored his orders and followed him to the wars, heeding a call she can neither understand nor resist.   THE PALADIN TRILOGY  Three Novels of Heroism  Juggernaut, a weapon of the ancient wars, bursts forth from a shattered vault deep beneath the mountains to smash its way through the walls of castles and cities alike, clearing the path for the conquest of the barbarian horde of Alacon Regnar. In answer comes a single warrior, Darius Inglorion, riding a great stallion, wearing antiquated armor, and armed with a living sword, Sarinian the Avenger to rally the divided principalities which lie paralyzed before this terrible armada. Darius is a Paladin, a holy warrior, who overcomes treachery and accusations of heresy to stir the hearts of men and lead them to fight the invaders to a bloody standstill. But it is then that the true purpose for the release of the Juggernaut explodes upon all involved, and Paladin and monstrosity alike are revealed as naught but pawns in a far greater Game, a Game for dominion of all the world.",
  "genres": [
    "Fantasy"
  ],
  "author": "James A. Hillebrecht",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/15758843-a-rage-in-the-heavens"
}