{
  "title": "The Unruly Life of Woody Allen: A Biography",
  "description": "The first independent investigation of Woody Allen, our era's most celebrated, distinctive, and confounding filmmaker, reveals the controversial private life behind the icon. Until now, there has been little scrutiny of that life. The Woody viewed biographers as the Ebola plague, dangerous, uncontrollable contagions that might squish his public persona into mousse. Allen's prolific achievements are all but unparalleled in cinematic history. To fans, his films have always represented an ongoing autobiography, through which he has bared his self-deprecating overanalytical soul to the world. It was not until 1992, when his stormy private life turned into sensational headlines, that the cracks in the familiar persona appeared. The lines separating art and fact, myth and reality, public and private life, became increasingly blurred. Marion Meade has tracked down scores of people in Allen's life who have never before spoken to an Allen boyhood pals; Brooklyn neighbors and teachers; colleagues Buddy Hackett and Mel Brooks from his early career as a television writer and stand-up comic; actors Maureen Stapleton, Max von Sydow, and Bob Hope; director Sydney Pollack; and the film reviewers who have followed his career for decades -- Vincent Canby, Roger Ebert, Stanley Kauffmann, Andrew Sarris, and John Simon. She also details the numerous examples of art imitating life in Allen's films, particularly the extraordinary saga behind his marriage to the adopted daughter of his long-time lover, Mia Farrow. In reconstructing Allen's life, Meade explores the cult of celebrity in America -- how it is our own infatuation with the rich and famous that has made it possible for this supremely talented man to shrewdly manipulate both the media and the moviegoing public.",
  "genres": [
    "Biography",
    "Film",
    "Nonfiction",
    "Audiobook",
    "Biography Memoir"
  ],
  "author": "Marion Meade",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/1575999.The_Unruly_Life_of_Woody_Allen"
}