{
  "title": "كيف نغتنم رمضان",
  "description": "بسم الله الرحمن الرحيمالحمد لله رب العالمين، والعاقبة للمتقين، ولا عدوان إلا على الظالمين، والصلاة والسلام على إمام الأولين والآخرين، وعلى آله وصحبه أجمعين أما بعد:فها هو الشهر الفضيل قد لاحت أنواره، وفاحت أزهاره، وترنمت أطياره، يحمل في طياته الخير الكثير، والأجر الكبير، والفضل العميم.وها نهن كعادتنا، نستقبل شهر رمضان بالعاطفة الجياشة، والبهجة الغامرة، والفرحة التامة.ولكنا نستقبله بلا خطة مدروسة، ولا منهجية صحيحة، ولذلك فإن الكثير منا لا يستمر حماسه لهذا الشهر إلا أيامًا معدودات من أوله، ثم يتكاسل شيئًا فشيئًا، حتى يعود القهقرى، ويترك ما عزم عليه من عبادة, وذكر، بل قد يترك الواجبات، ويفعل المحرمات والمنهيات، وهذا خطر عظيم، لأن النبي  قال: «رغم أنف رجل دخل عليه رمضان ثم انسلخ قبل أن يغفر له» [رواه الترمذي, وصححه الألباني].وهذه – أخي الحبيب، أختي الكريمة – إشارات تعينكما على اغتنام فضائل رمضان, وإدراك كنوزه وجوائزه، وتحذركما من التفريط والإضاعة: أولاً: رمضان لماذا؟لماذا كل هذا الاهتمام بشهر رمضان دون غيره من الشهور؟ والجواب: أن لرمضان من الفضائل والمزايا ما ليس لغيره من شهور العام، ومن ذلك، أنه الشهر الذي نزل فيه القرآن، كما قال سبحانه: شَهْرُ رَمَضَانَ الَّذِي أُنْزِلَ فِيهِ الْقُرْآَنُ هُدًى لِلنَّاسِ وَبَيِّنَاتٍ مِنَ الْهُدَى وَالْفُرْقَانِ [البقرة: 185]، وقال تعالى: إِنَّا أَنْزَلْنَاهُ فِي لَيْلَةٍ مُبَارَكَةٍ [الدخان: 3]، وفيه ليلة خير من ألف شهر: لَيْلَةُ الْقَدْرِ خَيْرٌ مِنْ أَلْفِ شَهْرٍ [القدر: 3]. وفيه تصفد الشياطين, وتغلق أبواب النيران، وتفتح أبواب الجنان، كما قال : «إذا جاء رمضان، فتحت أبواب الجنة، وغلقت أبواب النار، وصفدت الشياطين» (متفق عليه). ومعنى صدفت: أي: حبست.* وبصيامه وقيامه تحصل مغفرة الذنوب.* والأجر فيه يقع مضاعفًا، فقد أخبر النبي  أن: «عمرة في رمضان تعدل حجة» (متفق عليه).* وذكر  أن: «لله فيه عتقاء من النار، وذلك في كل ليلة، حتى ينقضي رمضان» (رواه أحمد).* وأخبر  أن: «للصائم عند فطره دعوة لا ترد» (رواه ابن ماجة)، فهذا وغيره – أخي الحبيب – يبين لك أن رمضان جدير بأن يهتم به، ويشمر له، ويتفرغ فيه للعبادة والطاعة. ثانيًا: لك صمت:لا بد أن يكون صيام رمضان عبادة خالصة لله سبحانه وتعالى، فإن كثيرا من الناس, وبخاصة من الشباب والفتيات يصومون على سبيل العادة، حيث إنهم نشؤوا في وسط يصوم رمضان, فصاموا مثلهم، غير مدركين عظمة هذه الشعيرة، ولا أبعادها النفسية والتربوية والصحية والاجتماعية، ولذلك فإن مثل هؤلاء لا يشعرون بلذة العبادة، ولا حلاوة الطاعة التي يشعر بها من صام, تعظيمًا لله عز وجل, مخلصًا له، مدركًا جوانب العظمة في عبادة الصيام، ولذلك فقد نبه النبي  على وجوب الإخلاص لله عز وجل في هذه الشعيرة، فقال: «من صام رمضان إيمانًا واحتسابًا، غفر له ما تقدم من ذنبه» (متفق عليه).وقال: «من قام رمضان إيمانًا واحتسابًا غفر له ما تقدم من ذنبه» (متفق عليه).وقال: «من قام ليلة القدر إيمانًا واحتسابًا غفر له ما تقدم من ذنبه» (متفق عليه).قال ابن بطال في (شرح صحيح البخاري): (قوله: «إيمانًا» يريد تصديقًا بفرضه، وبالثواب من الله تعالى على صيامه وقيامه. وقوله: «احتسابًا» يريد بذلك يحتسب الثواب على الله، وينوي بصيامه وجه الله. وهذا الحديث دليل بين على أن الأعمال الصالحة لا تزكو، ولا تتقبل، إلا مع الاحتساب وصدق النيات، كما قال : «الأعمال بالنيات، ولكل امرئ ما نوى» (متفق عليه)( ). ثالثًا: على خطى الرسول :وحتى نغتنم فضائل رمضان لا بد من اتباع هدي النبي  في صيامه وقيامه، وكان من هديه  في شهر رمضان: الإكثار من أنواع العبادات، فكان جبريل عليه السلام يدارسه القرآن في رمضان، وكان إذا لقيه جبريل أجود بالخير من الريح المرسلة. وكان أجود الناس، وأجود ما يكون في رمضان، يكثر فيه من الصدقة والإحسان وتلاوة القرآن والصلاة والذكر.* وكان  يخص رمضان من العبادة بما لا يخص غيره به من الشهور.* وكان يعجل الفطر، ويحض عليه، ويتسحر، ويحث على السحور, ويؤخره، ويرغب في تأخيره.* وكان  يحض على الفطر بالتمر، فإن لم يجد فعلى الماء.وكان  يفطر قبل أن يصلي.وكان فطره على رطبات – إن وجدها - فإن لم يجدها, فعلى تمرات، فإن لم يجد حسا حسوات من ماء.وروي عنه أنه كان يقول إذا أفطر: «ذهب الظمأ، وابتلت العروق، وثبت الأجر إن شاء الله» (رواه أبو داود).رابعًا: رؤية الحكم والفوائد:ولا بد للمسلم والمسلمة كذلك أن يعرفا شيئًا من حكم الصيام وفوائده، فإن ذلك من دواعي الاهتمام بهذه العبادة، وإيقاعها على الوجه المطلوب، ومن تلك الحكم والفوائد:1- الصوم طريق لحصول التقوى، كما قال تعالى: يَا أَيُّهَا الَّذِينَ آَمَنُوا كُتِبَ عَلَيْكُمُ الصِّيَامُ كَمَا كُتِبَ عَلَى الَّذِينَ مِنْ قَبْلِكُمْ لَعَلَّكُمْ تَتَّقُونَ [البقرة: 183].2- وهو سبب للتخلص من كل أنواع الباطل: لقوله : «من لم يدع قول الزور والعمل به والجهل، فليس لله حاجة في أن يدع طعامه وشرابه» (رواه البخاري).3- وهو يضعف الشهوة، ويعود على الصبر: ويقوي الإرادة، ولذلك أمر النبي  من لم يستطع الزواج من الشباب بالصيام.4- أنه يفرغ القلب, ويشغله بما يجلب له السعادة والفلاح: من الذكر والعبادة وتلاوة القرآن.5- أنه يضيق مجاري الدم التي هي مجاري الشيطان، فتسكن النفس، ويهدأ البال، وتزول الوساوس، ويتفرغ الإنسان لطاعة ربه.6- أنه يطهر الأمعاء, ويصلح المعدة، وينظف البدن من الفضلات التي قد تسبب الضرر مع الوقت.7- تعويد الأمة على النظام والاتحاد وحب العدل والمساواة والإيثار والبذل والعطاء، ومواساة الفقراء والمساكين وأهل الفاقة( ). خامسًا: الصوم الحقيقي:",
  "genres": [],
  "author": "خالد أبو صالح",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/15760893"
}