{
  "title": "Unearthing",
  "description": "THE SPECIAL OVER-SIZED HARDCOVER EDITION\"Steve Moore, who lives in the same room he was born in 61 years earlier, is a living metaphor for the history, geography and geology of Shooter's Hill and a conduit to the Greek gods and spiritual manifestations... Is it great art? Yes!\" -- N.M.E.“The men of Unearthing are only marginally of this plane of existence, and what they’ve created is positively out of this world.” -- The AV Club“A tribute to a colleague and mentor and a demonstration that Moore has transcended the boundaries of the graphic novel.” – The New York TimesOne of the world’s foremost authors of the fantastic, Alan Moore, joins internationally esteemed photographer Mitch Jenkins for an unprecedented visual and literary experience. An intensely poetic and innovative work of biography, Unearthing maps the lifetime of author, orientalist and occultist Steve Moore, while simultaneously investigating the extraordinary history of South London with which that life has been intertwined. Integrating text with haunting and exquisite imagery, Unearthing excavates a territory at the margins of a city, of reality, and of human imagination.Starting life in Iain Sinclair’s seminal anthology LONDON: City of Disappearances, this dazzling and hypnotic piece has evolved through a series of live performances and acclaimed recordings, culminating in this breathtaking full-color volume. Three formats are available, a deluxe softcover edition, a special oversized hardcover edition limited to 1,200 copies worldwide, and a special signed and numbered oversized hardcover edition limited to 300 copies worldwide.-- Co-Published by Top Shelf Productions and Knockabout.-- 184 Pages, 11.75” x 16.5” aka A3 size (wow!)",
  "genres": [
    "Comics",
    "Art",
    "Poetry",
    "Nonfiction",
    "Biography",
    "Photography",
    "History"
  ],
  "author": "Alan             Moore",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/15761546-unearthing"
}