{
  "title": "A Lusting Couple",
  "description": "Janet and Toby's youngest child has gone off to college. For the first time in years, their time is their own. One evening Janet receives an email with the subject line, \"From Toby's secret admirer.\" Janet understands why women are attracted to her husband, but that doesn’t mean she tolerates those who don’t keep it to themselves. For the author of the email to announce herself makes Janet angry enough that she ignores her don’t-open-unsolicited-emails rule.Hi Janet,I love what your new Blanks do for your butt. Surprised? I’m not just Toby’s secret admirer; I’m yours, too. My husband and I have decided to seduce your husband and you. We’ve been talking about having a foursome with the two of you for so long that just making the decision to initiate contact has me terribly aroused. I’m bi, my husband isn’ the same as you and Toby. We aren’t swingers. The only man I will ever have intercourse with is my husband, and the only woman he will ever have intercourse with is me. But you and I can do whatever we want with each other and never break that rule, can’t we? Would your husband enjoy watching you make love to another woman? I know mine would love to watch me. And I have always wanted to take on two men at once. If you’ll let me take Toby in my mouth while my husband takes me from behind, I’m sure I can find something to occupy myself with while watching you having the favor returned. What would you like to get up to?Warmest regards,XXSo begins A Lusting Couple, volume one in Foursomes For All, a groundbreaking new series of non-fiction erotic novels about love affairs between couples. True stories from couples who do it all, powerfully written by some of the best ghost writers in the business.",
  "genres": [
    "Menage",
    "Erotica",
    "Erotic Romance",
    "Contemporary",
    "Nonfiction"
  ],
  "author": "Janet G.",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/15761780-a-lusting-couple"
}