{
  "title": "La Petite Chartreuse",
  "description": "Philosophe de formation, Pierre Péju est devenu romancier et essayiste. Son essai La Petite Fille dans la forêt des contes avait été salué par la critique ; La Petite Chartreuse, roman, vient d'être récompensé par le prix du livre Inter 2003 formé d'un jury composite de lecteurs et de journalistes.  Il y a trois personnages principaux dans La Petite Chartreuse : Eva, une petite fille qui porte un anorak rouge au milieu de l'hiver, Thérèse Blanchot, la mère d'Eva, qui se pense être mauvaise mère parce qu'elle arrive toujours en retard et passe son temps à fuir, et Vollard, un libraire taciturne qui conduit ce jour-là une camionnette remplie de livres anciens. S'est-elle jetée sous ses roues ? Est-ce lui qui ne l'a pas vue ? La chaussée était-elle trop glissante ? Est-ce la faute de la mère qui, si elle avait été pour une fois à l'heure, n'aurait pas obligé Eva à vouloir traverser la route toute seule ? En tous cas, en une fraction de seconde, le destin bascule quand Vollard renverse Eva. La petite se retrouve dans le coma. Il y a peut-être une chance qu'elle reprenne conscience. Il faut lui parler. Vollard au chevet de la petite se met à lui parler. Les mots qui lui viennent le plus naturellement à la bouche, ce sont des mots de récits, de contes. \"Ce sont des livres que j'ai lus il y a longtemps et dont je me souviens toujours, des bouts de textes qui me reviennent au hasard\".  À sa façon La Petite Chartreuse est aussi un conte initiatique et une réflexion sur le pouvoir enchanteur ou destructeur des mots. La petite Eva ne peut plus parler. Sa mère n'a jamais su trouver les mots. Vollard, le libraire, mesure \"le bruit étouffé des vieilles phrases\" mais sait que leur pouvoir face à la mort n'est rien. La Petite Chartreuse est un livre beau et sensible qui prend au cur par sa simplicité. --Denis Gombert",
  "genres": [
    "Fiction",
    "French Literature",
    "France",
    "Contemporary",
    "Books About Books",
    "Literature",
    "Read For School"
  ],
  "author": "Pierre Péju",
  "average_rating": "3.29",
  "url": "https://www.goodreads.com/book/show/15761955-la-petite-chartreuse"
}