{
  "title": "Constantinople",
  "description": "What does an auxiliary member of the tsar’s family do as the Bolsheviks reach out to strangle the last vestiges of White Russian society in the aftermath of the 1917 Russian Revolution? As others of the Russian nobility did, young Count Pyotr Romanov, sent by his family in St. Petersburg to the southern Russian city of Kazan to join the cadets of the Imperial Military Academy for safety, escapes from immediate peril to a false safety. Kazan proves not to be far enough, and by 1920 Pyotr, forced to rely on a grasping and controlling academy professor who initiates him in man love, is fleeing first to Novorossiysk, to be evacuated to the Crimea, and then, just as the Bolsheviks are poised to overrun that peninsula into the Black Sea, he is evacuated by sea to Constantinople.Along the way, and once spit out in Constantinople along with hundreds of other destitute White Russians, Pyotr lives by his wits and his ability to survive by using men who want to use him.During his struggle to survive he has also pursued the mysterious Katya Betskoya, who harbors a shocking secret and who he has saved from being trampled on the dock at Sevastopol before he is evacuated to Constantinople to live by selling his body on the streets, eventually becoming a chauffeur to an importer. From thence, he finds himself in the Turkish port of Smyrna, where, once again, he is put in physical danger and is caught up in another pogrom, this time pitting Turks against Greeks and Armenians. The illusive Katya appears here, this time in the role of Pyotr’s savior, and he faces yet another need to evacuate to relative safety.While becoming less and less enchanted by the White Russian cause and more determined to remake himself into a new person and to win Katya, Pyotr gives himself over to the lusts of other men to survive and live against the backdrop of some of the most momentous events to occur in the Black Sea region in the 1920s. This is almost as much a history of the calamitous times as it is of the personal struggle to survive and thrive of a young nobleman in a time of revolution and chaos.",
  "genres": [
    "M M Romance"
  ],
  "author": "Dirk Hessian",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/15762544-constantinople"
}