{
  "title": "Nobody Has To Know",
  "description": ".\"Nobody Has To Know: Passion, Love, Lies & Death Collide in Compelling New Novel – Urging Readers to Consider the Bold Consequences of their Mistakes Masterfully crafted by Jessica Ross, ‘Nobody Has to Know’ embroils readers in a seemingly-magical marriage that quickly turns ugly. Some end up dead, those left behind end up riddled with guilt, and everyone learns the true plight hidden behind lies. This is a romance story unlike anything else ever written before, and one forcing readers to face some uncomfortable universal truths. For Immediate Release Greenville, NC – While the romance genre has long been a staple of the literary landscape, both readers and critics are currently crying out for wholly-unique new narratives that don’t succumb to recycling of the “same-old” concepts. Thankfully, Jessica Ross is stepping up to the plate with gusto. ‘Nobody Has to Know’, her thrilling new release, proves just how quickly love can turn from bliss to barbaric – and even deadly. Synopsis: Nobody has to know, or do they? Shhhhh!! The story is fun, quirky, and filled with lies and unexpected consequences mixed with passion and true love. In the words of Thomas Jefferson, “Do not bite at the bait of pleasure till you know there is no hook beneath it.” We can learn a lot about our own lives when we take the time to analyze someone else’s. Remember every decision you make has consequences, whether it be good or bad. Ask yourselves before you choose your paths, can I live with what could be at the end of this road? This book is dedicated to my mother, an inspirational beauty. “At its core, the narrative homes in on lies and the reality that every action taken in life has some sort of consequence,” explains Ross. “Most people enter into decisions without considering the consequences – just like my characters. It’s a decision that ultimately destroyed their lives.”",
  "genres": [],
  "author": "Jessica  Ross",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/15763176-nobody-has-to-know"
}