{
  "title": "Lost and Found (The Game Plan #1)",
  "description": "Lance Callahan, MD, is known to his hospital staff as a man with a heart of gold. When a young woman is brought in with a gunshot wound and severe post-traumatic amnesia, Lance is just the man to care for her. No one knows who she is, where she's from, or why she was left to perish in the unforgiving desert. Even her name, Noelle, is known to Lance only from an inscription on a necklace found in her pocket.In his effort to help Noelle, Lance determines that due to the trauma she has suffered, the young woman requires retraining to become age-appropriate in all of her activities. Her little girl persona further shocks him when she suddenly claims him as her \"Daddy.\"With nowhere else for her to go, Lance turns to his close-knit family for help, and Noelle suddenly finds herself with a new aunt and two new uncles, along with more love than she can handle. She quickly learns that there are some very specific rules in the Callahan home, for both Daddy's little girl and Lance's big girl, and that the consequences for breaking the rules include a very red and sore bottom!Questions remain about Noelle's past, and as the mystery of her origins slowly unravels, it becomes clear that Noelle has a very special secret of her own… a secret that could tear apart everything she's learned to love, including the joy of being lost and then found by a man who's given his heart to her. Publisher’s Lost and Found is an erotic novel that includes non-consensual spankings, anal play, exhibitionism, STRONG & SEXUAL AGE PLAY ELEMENTS, and more. Very hot! If such material offends you, please don’t buy this book.Book 12 chapters / 48,726 words",
  "genres": [
    "BDSM",
    "Erotica",
    "Aliens",
    "Romance",
    "Paranormal",
    "Paranormal Romance",
    "Science Fiction"
  ],
  "author": "Breanna Hayse",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/15763358-lost-and-found-the-game-plan-1"
}