{
  "title": "Sullivan's War: The Complete Adventure",
  "description": "On Earth, a powerful politician has been murdered. When he's assigned to the case, Agent Frank Allen soon discovers that the man responsible, Rick Sullivan, is not yet finished killing. But Allen will also discover that Rick Sullivan is not the man he appears to be, and the war he's fighting, a war to rid his home planet of its oppressive government, is not his only battle. As Allen pursues Sullivan across the known galaxy, he begins to question his own beliefs and loyalties. Will Allen be able to stop Rick Sullivan before he kills again? Does he really want to? As their lives become increasingly intertwined, both men realize they must face truths about themselves that neither of them are prepared for. And some of those truths will have consequences that neither of them could have ever imagined.This edition collects Sullivan's War: Books I, II & III, which are also available individually.Praise for Sullivan's War:“With sharp prose, delicate and—at times—stabbing dialogue, and scene setting that is on par with the best of the fiction writers of the past, Rose delivers a one-two punch to the gut that makes this reader want more and more.” - Benjamin X. Wretlind, author of Sketches from the Spanish Mustang“The Sullivan’s War series is a must-read for science fiction fans. Mr. Rose delivers with a rock-solid plot, well-paced delivery, intriguing alien elements, believable worlds, and nonstop action.” - K. Wodke, co-author of Zeke\"With heart-stopping battles and a conclusion that took my breath away, Sullivan's War is a sci-fi thriller that definitely delivers! - Alexia Purdy, author of Reign of Blood“Sullivan's War is so much more than typical science fiction...a very entertaining sociological and political thriller, set in the future, with top notch, well fleshed out characters, and great action scenes.” - Steve Umstead, author of the Evan Gabriel Sci-fi Adventure Trilogy",
  "genres": [
    "Science Fiction"
  ],
  "author": "Michael K. Rose",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/15763443-sullivan-s-war"
}