{
  "title": "Exquisite Breath of Darkness",
  "description": "“I need to feel every inch of your skin against mine.”She rushed him and, with a burst of lycan strength, took him down onto the floor.For a few seconds, she sat motionless, her gaze not once wavering from his. He’d never even imagined a more exquisite woman. From the moment he’d first taken her hand at the cemetery six months ago, she’d become as essential to him as the air he breathed. For many years he thought he would never find a love as strong and as pure as her love. Now, he couldn’t fathom a life without her. He never wanted to try.Too afraid to move, to touch her, to do anything that might stop her, he kept his fists clenched as his sides. He watched. He waited. He hoped for more. The sight of her on top of him, looking down at him with so much love and lust in her eyes, stole his breath away. It was his perfect fantasy made reality. He’d never experienced anything nearly as glorious until she reached down to touch him.Her fingers never stopped touching his body, moving over him, exploring him with such obvious fascination and hunger that he was trembling with pleasure, with anticipation for more. “I really want to hate you right now, Joseph. I can’t believe I’m burning up for you like this. I’m going crazy. I’m not even sure of what to do with you.” Moving slowly, she leaned down, stretching her body over his. “I’ve never needed anything more than I need you right now. I have to touch you.”Her breath was deliciously hot against his skin as her lips moved from the base of his throat to his jaw. “Oh, damn, Mia.” Closing his eyes, he savored the sensation of her mouth and tongue playing over his skin. He knew he needed to stop her. “Mia.” Her name came out sounding like a strangled groan. Her teeth gently teased his chin, jaw, neck, and ear. “Wait.” His pulse thundered in his ears. Nothing inside him wanted to detour her from touching him. How the hell was he going to regain control of his body’s demand for her?“I feel alive when I’m with you.” Her fingers worked on unknotting his tie until she’d pulled it off. She framed his face with her hands. “Look at me, Joseph.” He opened his eyes. “Stop holding back. I need you to touch my body, every part of my body. Lose control with me. I need to feel every inch of your skin against mine. Need me, burn for me like I’m burning up for you.” Her mouth felt heavenly in the most sinful of ways feeding on him as her fingers worked to undo his shirt buttons. “Touch me, Joseph.”",
  "genres": [
    "Paranormal",
    "Paranormal Romance",
    "Romance",
    "Vampires",
    "Dragons"
  ],
  "author": "Candice Stauffer",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/15764098-exquisite-breath-of-darkness"
}