{
  "title": "The Cipher",
  "description": "Kathe Koja's classic, award-winning horror novel is finally available as an ebook.  Nicholas, a would-be poet, and Nakota, his feral lover, discover a strange hole in the storage room floor down the hall - \"Black. Pure black and the sense of pulsation, especially when you look at it too closely, the sense of something not living but alive.\" It begins with curiosity, a joke - the Funhole down the hall. But then the experiments begin. \"Wouldn't it be wild to go down there?\" says Nakota. Nicholas says \"We're not.\" But they're not in control, not from the first moment, as those experiments lead to obsession, violence, and a very final transformation for everyone who gets too close to the Funhole.  THE CIPHER was the winner of the 1991 Bram Stoker Award, and was recently named one of io9.com's Top 10 Debut Science Fiction Novels That Took the World By Storm. Long out-of-print and much sought-after, it is finally available as an ebook, with a new foreword by the author.   \"An ethereal rollercoaster ride from start to finish.\" - The Detroit Free Press  \"Combines intensely poetic language and lavish grotesqueries.\" - BoingBoing  \"Kathe Koja is a poet ... [T]he kind that prefers to read in seedy bars instead of universities, but a poet.\" - The New York Review of Science Fiction  \"Her 20-something characters are poverty-gagged 'artists' who exist in that demimonde of shitty jobs, squalid art galleries, and thrift stores; her settings are run-down studios, flat-beer bars, and dingy urban streets [a] long way from Castle Rock, Dunwich, or Stepford, that's for sure.\" - Too Much Horror Fiction  \"This powerful first novel is as thought-provoking as it is horrifying.\" - Publishers Weekly  \"Unforgettable ... [THE CIPHER] takes you into the lives of the dark dreamers that crawl on the underbelly of art and culture. Seldom has language been so visceral and so right.\" - Locus  \"[THE CIPHER] is a book that makes you sit up, pay attention, and jettison your moldy preconceptions about the genre ... Utterly original ... [An} imaginative debut.\" - Fangoria  \"Not so much about the vast and wonderful strangeness of the universe as it is about the horrific and glorious potential of the human spirit.\" - Short Form    From Publishers  Down-and-out Nicholas and his friend Nakota one day discover a black hole in the floor of an abandoned storage room in his apartment building, which they quickly christen the \"Funhole.\" The two set out to see what happens when they drop various items into the hole, whetting its appetite with insects, a mouse and a human hand, which all come back violently rearranged. Next, they lower a camcorder into the hole to record the action within. The videotape they retrieve is spellbinding, but there's a what Nicholas sees is different from everyone else's vision. To Nakota the hole means change, because whatever is dropped into the Funhole emerges transformed-- if it ever emerges. Mesmerized by the Funhole, she claims that Nicholas is the only one who can make things happen around it. For Nicholas himself, the hole is a phenomenon that forces him to face his miserable, aimless life. Koja has created credible characters who are desperate for both entertainment and salvation. Inaugurating Dell's new Abyss Books series, this powerful first novel is as thought-provoking as it is horrifying.",
  "genres": [
    "Horror",
    "Fiction",
    "Fantasy",
    "Science Fiction",
    "Weird Fiction",
    "Lovecraftian",
    "Horror Thriller"
  ],
  "author": "Kathe Koja",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/15764138-the-cipher"
}