{
  "title": "Journey to Light",
  "description": "Long ago in a time known as the Anziên age, people lived in a complex and vibrant society which reached levels of technology and genetic engineering unimaginable to anyone now alive. Then 3,500 years ago, the Anziên era ended abruptly and traumatically. Why? No one knows but the downfall left survivors in a world of strife and hardship. This world badly needed peace and tranquility.The only bright spot came in a land called Pàçia. Physically separated from the rest of the world by high mountains, the gentle nature of the Pàçian people also set them apart from all others. They built the beautiful city Abbelôn and chose the wisest and most benevolent among them to lead the way on the path of tranquility and harmony. These leaders had no power or authority. They did not rule; they fulfilled duties – the High Duties of Pàçia. The High Protector kept peace through persuasion; the Benevola cared for and comforted everyone; and the Keeper protected the people from harm. Generation after generation, they made the world a better place. But their strength gradually weakened with time, and three and a half millennia is a very long time.Outside Pàçia, the population grew and cities arose. The Great Cities were ruled by powerful despots who increasingly ignored lessons of peace and goodwill. Worse, new enemies invaded part of the land. But were they really ‘new’ or were they terrors returned from a forgotten past?In this environment, the story begins. * * *Twelve years ago, brutal men called the Zafiri invaded Pàçia with a massive army, capturing the beautiful city Abbelôn and crushing the gentle people there. Now the rest of the world is threatened by more war and destruction. Then an extraordinary young woman named Sistére Graice, member of a widely know but little understood organization, crosses paths with a man unlike any she has met before. Her ‘effect,’ her ability to control everyone else, has no power over him. Known only as Holder, the man has no memory, not even of his own identity. Graice’s mentor Sybille hires him as a guide for a journey she and Graice must make, partly so they can keep him close until they discover his secret. As they travel, Graice tries to help Holder recover his memory. While he is in a drugged sleep, she ‘sees’ into his mind and discovers small fragments of past events, all involving a beautiful golden-haired woman. When he wakes, Holder still does not remember these scenes but Graice has learned much about him.In the backwaters of the land meanwhile, a boy age thirteen travels with his aunt, his only living relative, hiding from enemy spies by moving constantly and using false names and disguises. When he complains that he knows nothing about his parents, she reveals his family name and bits of its history. Later, she gives him an amulet and implies he will wear it someday. It’s an Emblem of High Duty, she says. His grandfather and mother had held two of the three High Duties before they died. A girl named Caelia, also thirteen, hides from the same enemy in a cavern where her father searches for secrets of the Anziên civilization. Named after a legendary heroine from antiquity, Caelia is unusually bright and mature for her age and her shining red-gold hair sets her apart. Girls with that hair color are born once in a millennium, people say, and everyone in the community loves Caelia. At this point, however, even the girl herself does not know why they do. When she wants to leave the cave on an adventure, everybody objects but no one can say no to her. She gets her way and departs with a trading expedition.Along their separate paths, Graice and Holder are attacked by a monstrous creature; outlaws kidnap Caelia; and enemy soldiers close in on the boy. Not only do all survive but the encounters also reveal hidden secrets. The story continues in Part II.- - -",
  "genres": [
    "Fantasy"
  ],
  "author": "Bob Craton",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/15764676-journey-to-light"
}