{
  "title": "At His Instruction",
  "description": "Isabeau finally spends the night in the bed of her mysterious boss, Mr. Drake, and wakes, ready to begin her slave training at the office. When the bondage gear comes out, she's ready and willing to have him show her the ropes. But when a stranger bursts into Mr. Drake's office, she's naked beneath the desk, trapped, and forced to hear things she shouldn't. When trust is broken, can the relationship survive?This 5600 word story is the fifth part in the bestselling erotic romance series, \"The Billionaire's Beck and Call.\" raised the lid of the box and my mouth fell open. Inside were two long, black leather gloves, covered in laces and buckles. I didn’t know what to make of them. I lifted one out, my skin humming at the feel of the supple material. “What are these for?”Mr. Drake’s eyes burned into mine. “They are bondage opera gloves, little temp. With them, I can restrain you in a myriad of ways. But today, I’ll use them to keep your arms bound behind your back.”I looked back down at the glove in my hand, tracing the metal eyelets and laces with my fingertip. The thought of being bound by him made my body come alive. I licked my lips. “Oh.”“I told you your training would begin today, Isa. Are you still my willing slave?”He ran a hand over my face, and I trembled at his touch. It felt like time stopped for a moment, and as I looked at him, I knew I wanted this more than anything. To be his. To please him. To let him please me, the little voice inside me said, and I smiled, knowing I was ready for whatever he had to give me.“Yes, Sir.”His hand knotted in my hair, and he pulled me close. The twinge of pain made me even hotter. A soft moan escaped my lips as he brought his face just inches from mine.“You’re going to learn how to perform on your knees today, slave. I’m going to feed you my cock, inch by inch, until you learn how to take it all. Would you like that?”He yanked my hair, tilting my head up and making me gasp. “Yes… Sir.”I’d been fantasizing about tasting him for days now, wondering what he would feel like stretching my lips, what he would taste like on my tongue. His lips met mine, hot and urgent, and I opened to him, moaning into his mouth. When we broke apart, his breathing was ragged, his pupils dark and dangerous.“On. Your. Knees.”",
  "genres": [
    "BDSM",
    "Erotica",
    "Romance",
    "Contemporary",
    "Short Stories",
    "Novella",
    "Adult"
  ],
  "author": "Delilah Fawkes",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/15764309-at-his-instruction"
}