{
  "title": "Escape from Xanadu",
  "description": "Short In this third novelette in the Magnetron Chronicles series, Phineas Magnetron and the Hogalum Society are quite literally drawn to the incomparable lost city of Zhen-Atu. There they find the lost passengers and crew of the Salmagundi, and learn that the laws of physics are not as straightforward as previously believed. Indeed, the very nature and genesis of mankind are called into question.Extended descriptionPhineas Magnetron is an eccentric Nineteenth Century inventor and former Union soldier who sustained a war injury which has unaccountably bestowed upon him a strange gift he doesn't completely understand. No stranger to peril and derring-do, Phineas is asked to join the Hogalum Society, an inscrutable secret organization of crime fighting adventurers, by none other than Society founder Dr. Yngve Hogalum.Traveling the globe in their Luftigel electric airship, Phineas Magnetron and his Hogalum brothers encounter mistrustful policemen, mentally ill criminals, wood-craving aliens, a witch doctor, a mad oracle, and a cross-dressing female matador, among many others. However, this \"steam dream team\" always manages to triumph over impossible odds and improbable obstacles as they preserve order in a disorderly world with all the Steam Age weird science they can muster.The Magnetron Chronicles is a serialized steampunk tale re-envisioning the future of generations past with all the breathless melodrama and tumult of that Victorian-era pulp fiction staple, the \"penny dreadful.\" The narrative harks back to the grandiose style of Jules Verne and H. G. Wells, but gently satirized with a sprinkling of purposeful anachronisms, double entendres, tongue-in-cheek inventions, and droll Twainian humor. Adapted from Mackenzie's \"The Secret Journals of Phineas J. Magnetron,\" a web serial characterized by short chapters with cliffhanger endings, the story builds chapter by chapter, volume by volume, as quirky new characters join the fray and perplexing new mysteries and situations arise.The Magnetron Chronicles is a planned 12-volume series of novelette-length volumes. In this third volume, \"Escape from Xanadu,\" Phineas Magnetron and the Hogalum Society are quite literally drawn to the incomparable lost city of Zhen Atu. There they find the lost passengers and crew of the Salmagundi, and learn that the laws of physics are not as straightforward as previously believed. Indeed, the very nature and genesis of mankind are called into question.",
  "genres": [
    "Science Fiction"
  ],
  "author": "D.L. Mackenzie",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/15764780-escape-from-xanadu"
}