{
  "title": "Do Over",
  "description": "Paisley’s juggling three key plans her senior 1.Get her parents back together2.Organize a stellar prom3.Find the perfect dateFinding the perfect date--an excerpt from Do I read, “Would you rather have someone run their fingertips or fingernails over your wrist?”Trey’s eyebrows lifted. “I don’t know. Show me.” He flipped his hand over, palm up with the back of his hand against the black foam bar.I swallowed and ran my fingertips over the blue veins on his wrist. His fingers twitched. I looked into his eyes when I lightly scraped my nails over the same spot. His fingers flexed and touched the back of my hand. His eyes widened and dilated. His dark green gaze dropped to my mouth.I took my hand away. “Which one?”“Yes,” he said. ”Both.”I scribbled the answer.The cart jolted upwards another two feet and paused. He said, “What about you?”“Huh?”“What did you answer?”I shrugged. “I’ll do mine later.”Trey flipped my hand over against the bar. He held it down with his right hand, and with his left rubbed calloused fingers down my palm and across the inside of my wrist. I felt the sensation from my fingertips to my elbow and reflexively tried to jerk my hand away. Trey tightened his grip, and ran his fingernails lightly over the same spot.A shiver went through my whole body.“I wonder if the order matters?” He ran his fingertips over my skin next. The tingles were amazing.I trembled and yanked free. Staring hard at the questionnaire, I drew a column down the page and wrote my Both.Lights came on around the fair, refusing to let the day end as red, gold, and pink streaked through the sky with the sunset. The evening breeze pushed the cart and shifted Trey’s brown hair across his forehead, hiding his injury. He slid an arm over my shoulders. “What’s the next one?”",
  "genres": [
    "Young Adult",
    "Romance",
    "High School",
    "Contemporary",
    "Teen",
    "Chick Lit",
    "Sports Romance"
  ],
  "author": "Emily  Evans",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/15764774-do-over"
}