{
  "title": "The League of Delphi",
  "description": "History’s darkest secrets hide in plain sight.   One of the freshest new voices in the world of young adult suspense, Chris Everheart confirms that he’s here to stay with this fast-paced, ingeniously plotted, unputdownable thriller. A lone teen, a suspicious death, an ancient conspiracy. The first book of the gripping new Delphi series, The League of Delphi draws you in, takes you on a tense and thrilling ride, and leaves you wanting more.  Ten years after his father's mysterious death, 17-year-old Zach secretly returns to his wealthy hometown in search of answers. Why did his mother move him away then go into hiding to die alone? Why did she change his name, forbidding him to ever reveal his true identity? Why was he never allowed to return home? Left with nothing and no one, Zach is desperate to reconnect with this seemingly “perfect” town. But something isn’t right. When a local teen commits suicide and no one seems to care, Zach’s hopes collapse into disenchantment and suspicion. Ashley, a local teenager on the fringe, piques his interest with whispers of a secret committee controlling the lives of everyone around them. Could it be true? Together, Zach and Ashley delve into the hidden life of the town and discover a dark connection to Ancient Greece and the Oracle at Delphi. Their suspicions are confirmed - but the conspiracy is more terrifying and dangerous than they ever imagined...  Fans of Charles Benoit (You; Fall From Grace) and Suzanne Collins (The Hunger Games) will instantly connect with Chris Everheart’s “visual” storytelling style and relatable characters. The League of Delphi delivers a fascinating thriller filled with nerve-wrenching suspense that confounds the reader to the very end and solidifies Everheart’s status as one of the hottest newcomers to hit the shelves.",
  "genres": [
    "Young Adult",
    "Fantasy",
    "Mystery",
    "Mythology"
  ],
  "author": "Chris Everheart",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/15766944-the-league-of-delphi"
}