{
  "title": "Learning Curve",
  "description": "Ada's company relocated her to Berlin, provided that she'd take an intensive course in German. It proves to be a steep learning curve, until her teacher Giselle implements some alternative educational methods. This title contains graphic language and f/f sex9.000 word erotic storyEXTRACT \"You're such a top.\" I turn my head to face her.\"Don't be silly.\" She traces a finger along my mouth. \"You were begging for it.\"I start to protest but she moves in again, covering my mouth with hers, stifling my words.\"Please, Miss,\" I say after biting her tongue playfully, causing it to disappear from my mouth. \"Can I have a taste now?\"Her eyes glisten and she holds back a smile.\"What?\" I start easing myself out from under her embrace.\"I do hope you give better head than you speak German.\" She bursts out laughing and I can't control myself either. I bury my nose in her wild mane of hair and find her ear. \"I've had better teachers than you.\"I have my eyes back on her face just in time to see the look of playful indignation expressed in the 'o' of her mouth. I wink at her and move down to taste her nipples.I cover them in hot saliva and trail my tongue along every inch of her breasts. The magnetic pull of her pussy is too strong though and I abandon her chest. I lock my eyes on hers while I travel south. Her face is bunched together in a look of pure desire, her lips puckered and open and her eyes covered by slitted eyelids. I smell her tangy juices before I taste them. I want to dive in and savour them but, if anything, I know she likes it slow so I restrain myself. I treat her inner thighs to a shower of wet kisses while my nose drinks in her heady perfume. I anticipate the special moment of licking a new lover's pussy for the first time. The mere thought of it makes my head spin. I sat across from this woman for weeks, dreaming of this while she tried to drill the difference between 'Die' and 'Der' into my distracted brain. To bury my lips between her legs now feels like an unexpected triumph, a victory of the heart, but I'm getting slightly ahead of myself.My tongue slicks alongside her pubic hair and I let it tickle my nose. I position my hands under her buttocks and run my thumbs over that delicate curve where the behind joins the legs. My own juices start flowing again. The memory of how Giselle slowly drove me to orgasm earlier, so controlled and confident in the outcome, nudges my clit to attention. I glance up at her and strands of hair cling to her face. I don't have the patience to make her wait any longer. My lips swell at the prospect of licking her and I take position. I blow gently over the length of her pussy and drink in the pink glistening sight of it. I circle my tongue around her clit and the aroma of her juices unleashes a long-buried passion inside of me. No matter what stands to happen after this, it's already much more than sex for me now.The first contact of my tongue on her clit sends a shiver up my own spine and Giselle's quiet moan adds to the excitement. I sense fluids trickling down my thighs. My thumbs are so close to Giselle's pussy they're soon covered in her wetness. I'm startled by two hands tugging at my hair, pulling my face up.\"Turn around,\" Giselle hisses, her breath hitching in her throat. \"Sit on my face.\"",
  "genres": [
    "LGBT",
    "Lesbian",
    "Erotica",
    "Romance",
    "Contemporary",
    "Erotic Romance",
    "Teachers"
  ],
  "author": "Harper Bliss",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/15767395-learning-curve"
}