{
  "title": "The Pyramid Legacy",
  "description": "For over four millennia the Great Pyramid of Giza has guarded a secret image; until NOW!A prominent young Egyptologist is murdered by a colleague, deep within the bowels of the Great Pyramid of Giza. The authorities are keen to cover it up, but they know they can’t achieve total closure whilst English robotics engineer, Ben Anderson, remains in possession of a powerful image. An image, which suggests the Great Pyramid at Giza was not built by ancient Egyptians. What the Egyptian authorities don’t know is that unless the true meaning behind the image can be established, along with other images which will later surface, the future of mankind will face the most serious threat imaginable. Anderson manages to escape Egypt at the earliest opportunity, together with his astrophysicist girlfriend, Samantha Gibson, but the authorities are quickly on their tail when it becomes evident they have arrested the wrong person. Keen to establish who really built the Pyramids, Anderson seeks to gain additional proof to support his theory. As he and Gibson begin to discover a series of seemingly disparate clues, they soon realise that everything is far from straightforward. Whilst seeking additional resources, Gibson is unwittingly embroiled in the internal politics of the US military, with the result that she becomes a pawn in a vicious power struggle involving a corrupt senior officer. Her path crosses that of an ex-lover and her relationship with Anderson stretches to breaking point. As Anderson begins to see Gibson from a totally different perspective, his focus changes, and he pushes himself well beyond the limits of his comfort zone in an attempt to discover the truth. Gibson is now prepared to do anything to fulfil a lifetime ambition, but as her objective becomes almost within her grasp a virulent virus threatens to stop her . . . and Anderson has the antidote . . . together with a totally different agenda. And so an unprecedented race begins to finally reveal the true legacy of the Great Pyramid of Giza. The Pyramid Legacy is a thriller, but also has a story of love and deceit deeply woven in.",
  "genres": [
    "Mystery",
    "Thriller",
    "Mystery Thriller",
    "Fantasy",
    "Science Fiction",
    "Fiction"
  ],
  "author": "Clive Eaton",
  "average_rating": "3.37",
  "url": "https://www.goodreads.com/book/show/15767645-the-pyramid-legacy"
}