{
  "title": "Intangibles: Big-League Stories and Strategies for Winning the Mental Game-in Baseball and in Life",
  "description": "\"Intangibles is filled with lessons and tools for helping baseball players in all stages of their development.\"--Fredi Gonzalez, Manager, Atlanta Braves\"A must read for athletes looking to gain a mental edge or simply better identify their own strengths.\"--Bryan Minniti, Assistant General Manager, Washington NationalsA must read for all baseball players, coaches, and fans...Mental skills coach Geoff Miller has spent years helping professional baseball players improve their mental toughness--both on and off the field. Now, he's making these invaluable lessons available to everyone who loves the game of baseball.From high school to the Major Leagues, all baseball players struggle with competition, pressure, and their own personal challenges. This book, through inspiring stories about professional baseball players in various stages of their careers, as well as hands-on tips and questionnaires, will help players evaluate and improve the mental skills that are necessary for that competitive edge.In Intangibles, you'll find stories, instruction, and practical applications that teach players and coaches how to put forth their best mental games--portrayed through the eyes of those who have experienced those learning moments firsthand in their quests to become Major Leaguers. From a local park's baseball diamond to dusty minor league dugout benches to the musty concrete tunnels under Major League stadiums, Intangibles meets players where they are, offering specific ways to improve performance and outlook.Whether you hope to be a big league player someday, or whether you simply want to play your best game, this book is essential for all athletes who want to learn how to overcome fear, build confidence, and develop a mental framework for success.",
  "genres": [
    "Baseball",
    "Sports"
  ],
  "author": "Geoff   Miller",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/15768091-intangibles"
}