{
  "title": "The Walnut Tree",
  "description": "\"I was in Paris the day the French Army was mobilized.\"In 1914, while visiting her friend Madeleine, Lady Elspeth Douglas's life is thrown into chaos when war breaks out and the Germans quickly overrun Belgium, threatening France. Having just agreed to marry Alain, Madeleine's dashing brother, Lady Elspeth watches him leave to join his unit, and then she sets out for England, only to find herself trapped on the French coast.Caught amid a sea of stranded travelers, terrified refugees, and wounded men overflowing the port of Calais, the restless Elspeth—daughter of a Highland laird whose distinguished family can trace its roots back to the court of Mary, Queen of Scots—decides to make herself useful, carrying water to weary soldiers near the Front. It is an act of charity that almost gets her killed when enemy shells begin to explode around her.To her rescue comes Captain Peter Gilchrist, who pulls her away from the battle and leads her to safety. But before they can properly say good-bye, Elspeth and Peter are separated.Back in London, Elspeth is haunted by the horrors she witnessed in France. She also cannot forget the gallant Peter Gilchrist, even though she has promised herself to Alain.Transformed by her experience, Elspeth enrolls in a nursing course where she meets a fellow nurse in training, Bess Crawford. It is a daring move, made without the consent of Elspeth's guardian, her cousin Kenneth, a man with rigid notions of class and femininity.Yet Elspeth Douglas is a young woman with a mind of her own, which—as she herself says—is a blessing and a curse. She is determined to return to the battlefields of France to do her part . . . and to find the man she has no right to love. But before she can set things right with Alain, he goes missing, then Peter is gravely wounded. In a world full of terror and uncertainty, can the sweetness of love survive or will Elspeth's troubled heart become another casualty of this terrible war?A poignant tale brimming with adventure, danger, and love, The Walnut Tree is an enchanting holiday gift and a wonderful companion to Charles Todd's acclaimed Bess Crawford series.",
  "genres": [
    "Historical Fiction",
    "Mystery",
    "Fiction",
    "Romance",
    "Christmas",
    "Historical",
    "Audiobook"
  ],
  "author": "Charles Todd",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/15768152-the-walnut-tree"
}