{
  "title": "World War D. The Case against prohibitionism, roadmap to controlled re-legalization",
  "description": "102 years after the launch of global drug prohibition, 41 years after the official declaration of the war on drugs, World War D is an important and timely book. As the wave of support for drug reform keeps growing throughout the world, from church groups to retired law enforcement, to the NAACP, to Kofi Annan, George Shultz, Paul Volcker, and a string of former Latin American and European head of states, the concept of legalization is rapidly moving from fringe lunacy to the mainstream. Yet, to this day, no book has addressed the issue in such an analytic, global and comprehensive way. World War-D revolves around the simple but fundamental question: Are organized societies capable and willing to manage and control psychoactive substances, instead of leaving it to organized crime? This, really, is placing the bar extremely low when you think about it. Capable, we are; the book explains why and how. After all, the vast majority of psychoactive substances, including the two deadliest, are already legal and more or less efficiently controlled. Will we garner the will? Going beyond the simplistic characterizations of the War on Drugs rhetoric, World War-D clearly demonstrates that prohibition is the worst possible form of control. The so-called controlled substances are effectively out of control; or rather, they are controlled by the underworld at a staggering and ever-growing human, social, economic and geopolitical cost to the world. World War-D lays out a concrete, pragmatic, and realistic roadmap to global re-legalization founded on a multi-tiered legalize, tax, control, prevent, treat, and educate approach with practical and efficient mechanisms to manage and minimize societal costs. Far from giving up and far from an endorsement, controlled legalization would be finally growing up; being realistic instead of being in denial; being in control instead of leaving control to the underworld. It would abolish the current regime of socialization of costs and privatization of profits to criminal enterprises, depriving them of their main source of income and making our world a safer place. At a time when the current and two former US presidents have admittedly indulged, as have politicians of all stripes from Al Gore to Newt Gingrich and Sarah Palin and over 50% of the adult US population, the credibility tipping point of the War on Drugs propaganda has long been passed. All that appears to be missing is the political courage to admit failure and move on to more realistic and efficient policies. What will it take for decision makers to display the wisdom and garner the courage to end the disastrous War on Drugs and responsibly take charge of drug production and trade instead of leaving it in the hands of extremely dangerous and powerful international criminal organizations?",
  "genres": [],
  "author": "Jeffrey Dhywood",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/15768202-world-war-d-the-case-against-prohibitionism-roadmap-to-controlled-re-l"
}