{
  "title": "The Philosophy of Desert Metaphors in Ibrahim al Koni: The Bleeding of the Stone",
  "description": "This essay is concerned with illustrating the plurality of meaning concealed in a text that may be prised out through a more heterodox reading process. The scope of this essay is to unveil the stark reality that academic literary classification often creates boundaries discouraging liberal reading processes in Arabic literature. This is due to diverse historical processes that have inhibited allegorical and polysemic interpretations of texts. Al-Koni makes use of a specific typology of space and rhetorical metaphor to induce a multiplicity of meaning. To ensure coherence, this essay traced al-Koni’s context, the evolution of Arabic literature, the rhetorical trope metaphor in many of its variations, the diverse levels of desert space, and al-Koni’s general style. The ‘reading’ process will reveal the possibility of transcending ‘compartmentalisation’ in favour of a more hybrid understanding of ‘universality’. In the arena of oriental studies, and Arabic literature in particular, the essay will endeavour to illustrate that such a paradigm shift is possible and necessary, as al-Koni’s work amply reveals.A Tuareg by birth, Ibrahim al-Koni is no longer considered to be simply an emerging author. His works have now earned him international repute and prestigious academic recognition. Themed primarily around a desert context, his novels have been categorized as post-modern, polyphonic, magical, socialist and Sufi fabula. Calleja’s book takes a close look at one of his works – The Bleeding of the Stone – with the explicit aim of revealing some of the philosophical reflections concealed in the text. In it the desert provides a landscape rich in allusions while metaphors allow readers to engage in creative interpretation.",
  "genres": [],
  "author": "Meinrad Calleja",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/15769011-the-philosophy-of-desert-metaphors-in-ibrahim-al-koni"
}