{
  "title": "Constantine's Sword: The Church and the Jews, A History",
  "description": "In a bold and moving book that is sure to spark heated debate, the novelist and cultural critic James Carroll maps the profoundly troubling two-thousand-year course of the Church's battle against Judaism, and faces the crisis of faith it has provoked in his own life as a Catholic. More than a chronicle of religion, this dark history is the central tragedy of Western civilization, its fault lines reaching deep into our culture.The Church's failure to protest the Holocaust--the infamous 'silence' of Pius XII--is only part of the story: the death camps, Carroll shows, are a culmination of the long, entrenched tradition of anti-Judaism. From Gospel accounts of the crucifixion of Jesus, to Constantine's transformation of the cross into a sword, to the rise of blood libels, scapegoating, and modern antisemitism, Carroll reconstructs the dramatic story of the Church`s conflict not only with Jews but with itself. Yet in tracing the arc of this history, he affirms that it did not necessarily have to be so. There were roads not taken, heroes forgotten; new roads can be taken yet. Demanding that the Church finally face this past in full, Carroll calls for a fundamental rethinking of the deepest questions of Christian faith. Only then can Christians, Jews, and all who carry the burden of this history begin to forge a new future. Drawing on his well-known talents as a storyteller and memoirist, and weaving historical research through an intensely personal examination of conscience, Carroll has created a work of singular power and urgency. Constantine's Sword is a brave and affecting reckoning with difficult truths that will touch every reader.",
  "genres": [
    "History",
    "Religion",
    "Nonfiction",
    "Judaism",
    "Christianity",
    "Jewish",
    "Theology"
  ],
  "author": "James Carroll",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/1576965.Constantine_s_Sword"
}