{
  "title": "Webster Grove",
  "description": "A complete compilation of theWebster Grove novellas: The New Girl, Under the Mistletoe, Secrets to Keep, Coming Out, and All Good Things.THE NEW GIRL:Seventeen year old Steph has her heart set on a new beginning… for the eleventh time. A move to Webster Grove introduces her to a new school, new friends, and new experiences- including a few tender glances from her sexy English teacher. After signing up for a costuming position on the school production of Romeo and Juliet, co-directed by none other than the gorgeous Mr. Rivera, Steph soon learns the difficulties of withstanding the pursuit of forbidden love.UNDER THE MISTLETOEIt’s beginning to look a lot like Christmas in Webster Grove, but seventeen year old Steph isn’t in the mood to celebrate. When Mr. Rivera’s attitude goes from bad to worse, Steph makes it her number one priority to help the Christmas Grinch rekindle his relationship with the holiday spirit. Meanwhile, Webster Grove High’s newest student, Isaac Peyton, is raising the eyebrows of every girl in school, and keeping Steph on her toes with his questionable motives. With the days ticking by, all Steph wants is to turn a seemingly blue Christmas into a holiday she’ll never forget…SECRETS TO KEEP:Secrets, secrets, are no fun! And with each day that passes in Webster Grove, eighteen-year-old Steph is learning that lesson the hard way. Between dodging stares, kisses, and mixed signals from the man of her dreams, Steph has more on her plate than she can handle. With wedding plans officially underway for the Rivera/Ghijk wedding, Steph is working overtime to lose weight and finally fit into a tiny bridesmaid gown. And if all that’s not enough, she’s pulled into a lie that forces her to start holding up appearances with a new (fake) boyfriend. With her three best friends at her side, and one beautiful man in her heart, Steph has to decide if happily ever after is worth the wait…COMING OUT:Eighteen year old Steph is facing many uncertainties, and the problems just keep piling up! Secrets from the past are slowly unraveling, close relationships are falling apart, and big revelations stand to test the strength of true friendships. Will love and forgiveness be enough to conquer all of the truths that are coming out? Steph can’t find the answer, but she’s praying she can figure it out before she leaves for Paris… if she decides to go at all.ALL GOOD THINGS:After five years of working side-by-side in Paris with one of the most esteemed fashion designers in the industry, twenty-three year old Steph Ghijk has packed her bags and returned to the States. Upon her arrival in the familiar town of Webster Grove, Steph takes on a directing position for the high school drama production – putting her in very close quarters with a man who hasn’t quite forgiven her for her long overdue return. Unable to choose between her heart and her head, Steph is taking each day at a time… and hoping the love she once had will be the final love of her life. --------------------------------------------------------------------------------",
  "genres": [
    "Romance",
    "Young Adult",
    "Contemporary Romance",
    "Teachers",
    "Chick Lit"
  ],
  "author": "Tracie Puckett",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/15769927-webster-grove"
}