{
  "title": "The Disaster Diaries: How I Learned to Stop Worrying and Love the Apocalypse",
  "description": "Sam Sheridan has traveled the world as an amateur boxer and mixed martial arts fighter; he has worked as an EMT, a wilderness firefighter, a sailor, a cowboy at the largest ranch in Montana, and in construction under brutal conditions at the South Pole. If he isn’t ready for the Apocalypse and the fractured world that will likely ensue, we are all in a lot of trouble.Despite an arsenal of skills that puts many to shame, when Sam became a father he was beset with nightmares about being unable to protect his son. With disaster images from movies, books, and the nightly news filling his head, he was slowly being driven to distraction. If a rogue wave hit his beach community, would he be able to get out? If the power grid went down and he was forced outside the city limits, could he survive in the wilderness? And let’s not even talk about plagues, zombie hoards, and attacking aliens. Unable to quiet his mind, Sam decides to face his fears head-on and gain as many skills as possible.The problem is each doomsday situation requires something unique. Trying to navigate the clogged highway out of town? Head to the best stunt driving school in the country. Need to protect your family, but out of ammunition? Learn how to handle a knife. Is your kid hurt or showing signs of mental strain? Better brush upon emergency medicine and the psychological effects of trauma. From training with an Olympic weight lifter to a down and dirty apprenticeship in stealing cars with an ex-gang member, from a gun course in the hundred-degree heat of Alabama to agonizing lessons in arctic wilderness survival, Sam leaves no stone unturned. Will it be enough if a meteor rocks the earth? Who’s to say? But as Sam points out, it would be a damn shame to survive the initial impact only to die a few days later because you don’t know how to build a fire.A rollicking narrative with each chapter framed by a hypothetical catastrophic scenario, The Disaster Diaries is irresistible armchair adventure reading for everyone curious about what it might take to survive a cataclysmic event and those who just want to watch someone else struggling to find out.",
  "genres": [
    "Nonfiction",
    "Survival",
    "Post Apocalyptic",
    "Dystopia",
    "Audiobook",
    "Memoir",
    "Adult"
  ],
  "author": "Sam Sheridan",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/15769972-the-disaster-diaries"
}