{
  "title": "A Diary's House",
  "description": "<center><h2>A Diary's House</h2></center><h3> <b> <i>A Diary's House</i> is about adventure, lost love, and the hope that dreams, even those in the final years of life, can at last prevail. It is of a young boy’s attempt to become a man, the once-lost secrets of a diary, a sweeping romance which transcends time and place. It is more than a boy’s journey into manhood, but the mysteries of so many lives unknowingly intertwined, now brought together in a climatic ending; all from the engrossing world embedded in a forgotten diary; a diary of a woman.Born in the vast and looming mountains of North Carolina during the 1870’s, Landon Hampshire always remembered the folklore and legendary tales his father told him during his early childhood; about the people of the Kituhwa (Cherokee) and the birth of this tribal nation – an enchanting story he could never forget. Incorporating the aid of an eccentric old French trapper (old man Montague), Landon and his friends set out on an adventure, their initial intention is to discover treasure and become men. But what Landon will eventually come to discover is more than he ever bargained for.Landon didn't realize his boyhood adventure would yield the incredible journey he ultimately experiences - going down the mysterious and mystical Randola River. At the base of the river is an island even more mysterious than the Randola itself.The island releases many of its mysterious, yet even many more are created when Landon discovers, on the island, a diary of a young woman who lived forty years prior during the 1830’s (Trail of Tears). The diary entries are hopeful, though haunting. It reveals, in intimate detail, the life and dreams of this very special young girl who is turning into a woman of beauty and adventure, her love for a Cherokee boy, and the trials she will ultimately face. Her story unfolds through the reading of her diary, and Landon suddenly finds himself caught up in a sweeping, empowering world of re-invention and ultimate redemption. </b> </h3><h2> Reader Reviews </h2><h3> ' Before I began reading ‘A Diary’s House’, I really didn’t know what to expect. I suppose the best way to describe it is, like anything you read, you make it personal for yourself. Well, that is the way it was for me. When reading this book and coming to the ending, I thought of my very first love when I was fifteen. I was young then (I am now in my fifties, a single mom of a twenty-three year old son) and I can’t tell you how much this novel made me remember a time so long ago, brought me to emotions I thought were lost or forgotten. This novel moved me to remember that time, and I never thought I would ever read a novel which would make me feel the way that this novel made me feel.Frankly, it was an emotional experience. And not having any real expectations before I began reading it made it that much more powerful in the end. I thought about Landon Hampshire (the main character) and his journey, much more for the emotional and spiritual journey than going down the Randola River as he did. This was simply an antidote for the real heart in the story. You won’t be disappointed in the end. I promise you. Everyone dreams of having real, true love, and ‘A Diary’s House’ delivers in every way on this element. The emotional impact drew me to tears, and made me weep for a boy and his grandmother, and how they took this journey, in some respects together - in a very, very special way. It was truly a moving experience unlike any novel I have read.",
  "genres": [
    "Historical",
    "Native American",
    "Historical Fiction"
  ],
  "author": "C. David Murphy",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/15770577-a-diary-s-house"
}