{
  "title": "The Ming Storytellers",
  "description": "It is the 15th Century. At the dawn of the Ming Dynasty, three women's paths will cross. And of their journey, a tale will be born.An imperial concubine,A Persian traveler,And a mysterious storyteller.Three women: One story.\nThis is BEIJING. A city seething with mystery and royal intrigue.Once a palace orphan, the wilful Min Li has only ever sought to please, even if that means pleasing Emperor Zhu Di. Now a powerful concubine, Min Li unearths a terrible secret concealed within the walls of Beijing's Imperial city. Driven to despair, she seeks help from her lover, Admiral Zheng He. But this will spark a chain of events that even sets Beijing's palace on fire. Min Li's fate is sealed but her true enemy is not who she thinks.The Ming Storytellers is a historical tale of 15th century China that sweeps across the palaces of Nanjing and Beijing into the mountainous villages of Yunnan, where a mysterious shaman holds the key to a woman's destiny.Across the oceans, from the bustling bazaars of Southern India to the lush shores of Zanzibar, nothing is quite what it seems.For the eyes and ears of the Ming Emperor are ever near.----A tale of the far East replete with dark secrets, The Ming Storytellers is set during the early Ming Dynasty, soon after the reconquest of The Middle Kingdom from the Mongols. The Ming Storytellers delves into the political and personal intrigues of the Zhu Imperial family. On the eve of the great Beijing Palace fire and the Ming fleet's sixth expedition, an imperial concubine is swept up by dark forces of obsession and revenge. The Ming Storytellers is a must journey for historical travelers and for those who believe in the bridging of worlds.",
  "genres": [
    "Historical Fiction",
    "China",
    "Mystery",
    "Historical",
    "Fiction",
    "Asian Literature",
    "15th Century"
  ],
  "author": "Laura Rahme",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/15770639-the-ming-storytellers"
}