{
  "title": "No Higher Power",
  "description": "Power UnrestrainedFor four years Barack Obama has waged an unparalleled attack—largely undocumented by the mainstream media—on religious liberty in the United States. Never before has an administration been more convinced that there is no higher power than itself: one nation under Obama. In this stunning new book, veteran conservative lawyer, activist, and commentator Phyllis Schlafly and reporter George Neumayr reveal the greatest assault on American liberty in our time—the Obama administration’s war on religious freedom.In No Higher Power you’ll learn:Why a second Obama term could spell the end of Catholic hospitals and the court-martialing of Christian military chaplainsHow the Obama administration is stripping conscience protections for pro-life doctors and nurses—forcing them to either assist in abortions or quit medicineHow the Obama administration sought to ban Bibles from military hospitals and prohibit invocations of Jesus Christ at military funeralsWhy even Justice Elena Kagan—an Obama appointee to the Supreme Court—was shocked by the Obama administration’s dictating employment policy at a Lutheran churchHow Obama is defying federal law in the Defense of Marriage ActHow liberal Christians like Jim Wallis have acted as useful idiots for Obama’s war on Christianity—and how the Catholic Left in Chicago actually helped pay for Obama’s training as a disciple of the radical Saul AlinskyWhy the Obama administration coddles Islam while actively discriminating against Christians and JewsAnd much more InIn No Higher Power, Schlafly and Neumayr expose the Obama administration’s brazen disregard for the First Amendment, its relentless purging of religion from our public life, and the even more chilling persecution of religion set to come.",
  "genres": [
    "Religion",
    "Politics",
    "Nonfiction"
  ],
  "author": "Phyllis Schlafly",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/15770697-no-higher-power"
}