{
  "title": "Naughty Neighbor",
  "description": "Dear Reader:In a previous life, before the time of Plum, I wrote twelve short romance novels. Red-hot screwball comedies, each and every one of them. Nine of these stories were originally published by the Loveswept line between the years 1988 and 1992. All immediately went out of print and could be found only at used bookstores and yard sales.I'm excited to tell you that those nine stories are now being re-released by HarperCollins. Naughty Neighbor is the eighth in the lineup, and it's presented here in almost original form. Usually when I edit these books I do some modernizing. For instance, I change VHS to DVD, and roller skates to Rollerblades, and sticks of gum are now pieces of gum. I do this because the books were meant to be contemporary (as opposed to historical), and I don't want the reader to have a time disconnect. In the beginning of the original Naughty Neighbor, my heroine throws a handheld phone into the toilet, and the next morning she goes into the bathroom and sees the \"slim silver antenna caught between the toilet lid and seat.\" Okay, so most phones don't have extended antennas anymore, but I just loved the image . . . so I left it in. And I don't know how many women wear front-closure bras anymore, but that got left in, too.Naughty Neighbor is probably the most romancey of all the Loveswepts I wrote, but there's still a small mystery to unravel. Louisa Brannigan is a no-nonsense, hardworking press secretary, fighting her way to the top of Capitol Hill, with no help from her annoying neighbor, Pete Streeter. He receives phone calls all night long, he steals her morning paper, he thinks jeans are formal wear, and worst of all he's involved Louisa in the disappearance of a pig. So this is the story of a pig in Witness Protection and love being found by a workaholic woman and a fun-loving man who makes terrible pots of coffee.Enjoy!Janet Evanovich",
  "genres": [
    "Romance",
    "Chick Lit",
    "Fiction",
    "Humor",
    "Contemporary Romance",
    "Contemporary",
    "Mystery"
  ],
  "author": "Janet Evanovich",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/1577167.Naughty_Neighbor"
}