{
  "title": "The Josiah Manifesto: The Ancient Mystery & Guide for the End Times",
  "description": "NEW YORK TIMES BEST SELLER Is there an answer, a guide, a blueprint that reveals what you need to know to survive, to stand, and to prevail in view of what’s coming in the days ahead?  Has it been revealed to us in the appearing of a sign from an ancient mystery playing out in modern times before our eyes?After seven explosive New York Times Bestsellers, Jonathan Cahn now releases his newest blockbuster - THE JOSIAH MANIFESTO - The Ancient Mystery & Guide for the End-Times - as mind-blowing as all his bestsellers - and with something  the Blueprint, the Answer - the Manifesto!\nThe Josiah Manifesto\n opens up the stunning mysteries that lie behind the dramatic events of recent times that have changed our world – and the message hidden within them with regard to what lies ahead.Could a 3000 year-old calendar of appointed days provide the secret to the most dramatic year of our lives – even ordaining a plague, a national lockdown, days of fire, and the changing of the Supreme Court?  Could an ancient temple, an ominous prayer, and a mysterious template lie behind the event that overtook Capitol Hill and shook the nation?  Could an enigmatic ancient king reveal the secret of a modern American president?  Could an ordinance given in the middle of a desert 3000 years ago have determined the rise and fall of a Latin American dictator?Could an ancient array of mysteries from the Middle East have converged on Washington DC in a single hour to change the history of America? What does the future hold?  Is America heading for calamity?  Is the world?   Is there hope?  Have we been given a last chance?  Is it possible to change history?  And is there a blueprint for what you need to know to survive and stand with regard to what is yet to come - even a guide to the ‘end-times’? \nThe Josiah Manifesto\n will take you on a prophetic journey from a Caribbean island to the Washington D.C. to the ancient Valley of Hinnom to the Supreme Court to a desert mountain to an ancient middle eastern temple to the gates of America - to uncover an ancient puzzle that lies behind the events that have altered our lives - Including …The Island of Mysteries – The House of Fallen Children – The Heavenly Court – The Child of the Nile – The Agents of Heaven on Earth – The Stranger in the Living Room – The Mystery of Days … And Much, Much More!   And could these mysteries give you the key to what you need to know to prevail in the days to come – even a guide to the end times?It will all be revealed in THE JOSIAH MANIFESTO – The Ancient Mystery & Guide for the End-Times!The book you can’t afford not to read!",
  "genres": [
    "Christian",
    "Nonfiction",
    "Religion",
    "Audiobook",
    "Spirituality",
    "History",
    "Christianity"
  ],
  "author": "Jonathan Cahn",
  "average_rating": "4.62",
  "url": "https://www.goodreads.com/book/show/157717100-the-josiah-manifesto"
}