{
  "title": "Bunny on a Bike",
  "description": "\"A great insight into 80s London, attitudes to women and life as a trainee bunny, plus smatterings of celebrities, this book captures that careless sense of youthful immortality perfectly. A fab light-but-intelligent read.\" Amazon reviewer \"To say I liked this book would be an understatement, I absolutely loved it!\" Amazon reviewer \"A wonderfully uplifting book that brightens even the dullest of days. The author has a way with words that delights the reader, and leaves her feeling better about the world in general.\" Amazon reviewer Carol and Bev have no idea about what they want to do for a living. They see a newspaper advertisement for Playboy croupiers and, with a typical lack of forethought, decide to apply. After parading in bikinis and completing two gruelling maths tests (with a certain amount of cheating), they get the job. They do four weeks training at Victor Lownes' mansion in Tring, where there is free-flowing champagne and a well-stocked jukebox. They are commandeered to be photographed with Victor on his return from hospital, and are invited to attend one of his weekend parties, where they meet celebrities but are not terribly impressed. Bev and Carol encounter unscrupulous landlords and exact a savage revenge. They deal blackjack to all kinds of punters, fend off lecherous pit bosses and almost fall in love. They get into all kinds of trouble and come out unscathed. Bunny on a Bike gives the reader an amusing insight into life inside the casino and being young in 80s London. Along the way, Bev and Carol make us laugh with their very different attitudes to life. One thing is sure - they will be friends forever. Bunny on a Bike is a memoir. It is anecdotal, unfolding chronologically, and told in the first person. Its tone is ironic, and its protagonists offer us an uplifting and humorous account of the process of becoming a Playboy croupier. If you like frivolity and fun, if you like a dry kind of humour, if you like to laugh, you will love Bunny on a Bike. There are three Bev and Carol adventures, which are all stand-alone books. For those who would like to know the order, here it 'One Summer in France', 'Bunny on a Bike' and 'Stranded in the Seychelles'. Download a free sample to your Kindle and join Bev and Carol on one of their hilarious adventures.",
  "genres": [
    "Humor",
    "Memoir"
  ],
  "author": "Bev Spicer",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/15772354-bunny-on-a-bike"
}