{
  "title": "ديستوبيا",
  "description": "المجموعة جميلة .. أهنئك عليها. الحوار فيها اكثر فنية من المجموعة السابقة والموضوعات إنسانية ولها ظلال غير مباشرة وهذا يوسع في المعني والرؤيا . القصص القصيرة نجت من قليل من الشرح والتفسير للمشاعر الموجود في القصص الاطول مثل ديستوبيا التي حملت المجموعة عنوانها وهي رغم ذلك جميلة . هذه مجموعة تبشر بكاتبة حقيقية . تحياتي وإلي الأمام .إبراهيم عبد المجيد\\\\\\\\قرأت مجوعتك الثمينة واستمتعت بها .. ملاحظتى الأساسية أنك تكتبين نفسك ولنفسك وهذا نجاح رائع جدا .. شعرت كم أنت أصيلة ولا تقلدين أحدا ولا تستعرين أصابع غيرك ولا أحاسيسه .. دمت مبدعة ننتظر منها الكثيرحمدي عبد الرحيم\\\\\\ديستوبيا تحتوى على مجموعه قصصيه قصيره من أجمل ماقرأت تنتقل فيها مابين الأدب الساخر والرومانسى والأنسانى بأسلوب سرد بسيط ورائع فى نفس الوقت شريف شوقي\\\\\\نحن هنا أمام مجموعة قصصية متنوعة الأفكار والأجواء، وربما التنوع هذا يناسب جدا قارئ القصة القصيرة، الذي لا يمتلك النفس الطويل لقراءة ذات خط واحد لا يتغير، فجاءت بعض القصص اجتماعية، وبعضها أقرب لأدب الخيال والإثارة، وبعضها يحمل الإسقاط السياسي.حاولت عزة بندق في هذه المجموعة الخروج عن خط الكتابة النسائية المتعارف عليها، من نقاش أحاسيس ومشاكل المرأة فحسب، وخرجت ببطلاتها –إلى حد كبير- عن نطاق أنوثتهن، ليكنّ جزءً من مجتمع شامل يحتوي الرجل والمرأة معا كـ (إنسان)، ووازنت في الحديث على لسان أبطالها رجالا ونساء.وربما أجمل ما في المجموعة تلك الأعمال التي تتناول المواقف السياسية في مشاهد بسيطة عميقة أوصلت المعنى دون حماسة مفتعلة، أو ثورية هي (موضة) حالية في كتابات الشباب؛ لكن الكاتبة هنا حرصت على أن تقدم قصصها في صيغة تبقى بعد انقضاء زمن الثورة والانفعال، وترتبط بالمجتمع الذي يعيش تلك السياسات ويربيها في أجياله، كي يعانيها بعد ذلك، ولا يمل شكواها.المجموعة كتبت على مدى زمني واسع بعض الشيء، فبدا نضوج الكاتبة أكثر في الأعمال التي كتبتها مؤخرا، وينم ذلك عن قلم ننتظر منه الأفضل دوما.إيمان الدواخلي\\\\\\شعرت بالمتعة وأنا أتنقل بين قصة وأخرى في هذه المجموعة. تارة أذهب إلى المستقبل المجهول، وأسراره الغافلة في قلب الرمال في قصة الخيال العلمي \"ديستوبيا\"، وتارة إلى أعماق البحر والفانتازيا في قصة \"أمواج\". أبحث كالملهوف عن البطلة النبيلة في قصة \"مسألة غباء\". أضحك بشدة واستمتاع مع \"م ط ج\"، وينتابني الحزن مع ما يصيب البطلة في \"وصلة حب\"عزة بندق كاتبة واعدة. تجيد فنون القص والحكي، وتبرع في رسم الشخصيات، والغوص داخل أغوارهم النفسية. تمتاز بسلاسة الأسلوب وعذوبته. تبحث دائماً عن أفكار جديدة غير مطروقة من قبل، وأتوقع لها في المستقبل القريب أن يبرز اسمها بوضوح بين الكُتاب الشباب.علاء محمود\\\\\\أكثر ما يميز عزة بندق في رأيي هو الإصرار والحماس والسعي المستمر للتطور، وهي الصفات التي تصنع الكتّاب الناجحين.. هذه المجموعة القصصية تحوي بين دفتيها مجموعة متمايزة من القصص ذات المضامين المختلفة، بعضها قد يجده القارئ رائعًا وبعضها قد يجده على الحافة بين المحاولة والنضج.. بعضها قد يجده غامضًا وبعضها الآخر مباشرًا.. لكن الشيء المؤكد أنه سيجد بينها ما سيعجبه ويؤثر فيه.أحمد عبدالمجيد\\\\\\\\تمتاز مجموعة ديستوبيا بإنسانيتها و لغتها البسيطة التي تراعي المستويات المختلفة للقاريء مع عمق الفكرة لذلك ستقرأ سطورا تم صياغتها بعناية فائقة حتى في تناولها للقضايا الاجتماعية و الإنسانية بلمحة رومانسية جادة تجعل القاري يصل للنهاية وكأنه تناول فنجانا من القهوة الامريكية دوبل اسبريسو ..فهي جرعة مكثفة و مركزة تستطيع أن تخرج منها مبتسما .محمد سامي البوهي",
  "genres": [
    "Short Stories"
  ],
  "author": "Azza Bondok",
  "average_rating": "3.31",
  "url": "https://www.goodreads.com/book/show/15772606"
}