{
  "title": "The War of the Stolen Mother",
  "description": "In the 30th century, Earthers make first contact with an intelligent lifeform called the Shshi, which evolved from termites. Following that contact, the Champion of the Shshi, the Warrior Ki'shto'ba Huge-Head, and the bard of the fortress of Lo'ro'ra, Di'fa'kro'mi the Remembrancer, are moved to set off on a quest to reach the sea, the existence of which was unknown to them until the humans came. Joined by two Worker helpers, they head first for Ki'shto'ba's home fortress of To'wak, where they find that the local Tyrant, who has long feared Ki'shto'ba's power, is holding citizens of Lo'ro'ra prisoner. We learn of our Champion's hatching (it has a twin) and of a Seer's revelations that Ki'shto'ba was sired by the Sky-King and that it can be killed only under unusual circumstances. Ki'shto'ba undertakes to ransom the prisoners by agreeing to leave To'wak and perform twelve wonders before returning, thus freeing the Tyrant from the fate of being killed by its more powerful sibling. The Companions then set off again, joined by the twin A'zhu'lo and by a fifth Companion, an outcast Worker named Za'dut, who is an outrageous trickster and thief. Their journey takes them to the fortress of Thel'or'ei, which has been at war with its neighbors for nine years over possession of a river ford. Ki'shto'ba is duped into supporting Thel'or'ei, which in fact has committed an unspeakable crime against the Shshi Way of Life. When Ki'shto'ba learns of this crime, it renounces its oath and goes over to the other side. There, with the help of Za'dut the trickster, plots are devised to steal Thel'or'ei's protective talisman and to breach its impregnable walls. But with a crime so heinous and with flawed local Champions who are either craven, cunning, or willful and unpredictable, it is unlikely the outcome can be favorable ...",
  "genres": [
    "Science Fiction"
  ],
  "author": "Lorinda J. Taylor",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/15773135-the-war-of-the-stolen-mother"
}