{
  "title": "السلطانة حرم: خفايا حرملك السلطان سليمان القانوني",
  "description": "بذة الناشر:تتحدث هذه الرواية للكاتبة التركية \"دمت آلطن يلكي أوغلو\" عن السلطانة حُرِّم التي كانت واحدة من أكثر النساء تأثيراً في التاريخ العثماني. فالصور المرسومة لها والأحكام المتشكلة عنها تركز في أغلبها على كونها السلطانة الغادرة القاسية. إلا أن الافتقار إلى المعلومات التاريخية المؤكدة، وعدم الغوص في الأسباب والنتائج المؤدية إلى طفولة حُرّم، ربما كانت السبب في رسم هذه الصورة عنها.حُرِّم في هذه الرواية، هي امرأة ككل النساء؛ تهب العواصف في نفسها، وتقع بين مخالب خوفها المغطى بمأساة طفولتها. فهي بالرغم من مكانتها اضطرت إلى مواجهة الصعاب التي بدأت منذ طفولتها ولم تنته مع حملها لقب السلطانة، فقد خُطفت وضُربت وأهينت وكادت تباع ولكنها فضلت الكفاح والصمود؛ وهذا ما لا تختاره غالبية النساء اللواتي يمررن بمثل هذه الظروف. فالآلام التي عاشتها غذّت طموحها، وحثتها على الأخذ بالثأر من الحياة والناس الذين ذبحوا طفولتها البريئة. ولكن الحروب التي خاضتها بذكاء، وانتقامها من الحياة لم تنسها أنها امرأة عاطفية إلى حدّ الوقوع في الحب وإن كان محرّماً، وأنها أم تقع على عاتقها مسؤولية حماية أولادها من الأعداء مهما كلف الأمر.تقول الروائية عن عملها هذا \"... هذه الرواية ليست رواية تاريخية، بل رواية من نتاج خيالي مستمد من مرحلة تاريخية. هدفي تقديم رؤية مختلفة عن ظلم التاريخ الشعبي. ترى، هل يمكن تعريف الظلم المتجلي بدفع حُرّم الأب ليصبح قاتلاً لابنه في مرحلة تاريخية كان يرفع فيها شعار: \"إما الموت أو عز الدولة\" بأنه انعكاس لغريزة حماية الذات من خطر الموت حيث كان الصراع المغذى عبر الحبل السري بين الأب وابنه على أشده؟الجارية الموسكوفية حُرّم تبحث عن تفسير لتفضيلنا تصرفات تفرض بعيداً عن التاريخ بكل أشكاله، وعن جذورنا، وعن حبنا لها.لا شك في أن الرواية قد اعتمدت على عدد غير محدود من الوثائق والمعلومات التاريخية، ولكن مصدر إلهامي كان الفراغ التاريخي في حياة حُرّم. فهوية المرأة، وما عاشته في سنوات طفولتها مرتبطان تماماً بأطروحة ارتبطتُ فيها عقلياً وقلبياً حتى النهاية، وسكبتها على الورق...\".في هذه الرواية سنعيش معاً خفايا الحرملك، وما يدور بين الجواري الطامحات والعبيد ذوي النفوذ، وما هي حقيقة النفوذ الذي يلعبه المقربون من السلطانة من وزراء. إنها باختصار القصة غير المروية عن الحرملك.",
  "genres": [
    "Turkish Literature",
    "Historical Fiction",
    "Roman",
    "Fiction",
    "Turkish",
    "Novels",
    "Politics"
  ],
  "author": "Demet Altınyeleklioğlu",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/15773514"
}