{
  "title": "The Lady Submits",
  "description": "Sometimes a highborn Lady needs to be brought low...It's the decadent, raunchy holiday of Bacchanal, and the Lady Lucrezia Grimaldi cannot find a man to satisfy her. Worse, she's been saddled with the brutish Carlo Castellan as her bodyguard for the last night of Bacchanal. There's only one thing to do: escape to the fabled House of the Severille...The imperious Lady Lucrezia expects to sate herself by dominating some poor house slave. What she gets instead is the harsh touch of a Severille Master who will stop at nothing to make the Lady submit.Excerpt below......Lucrezia had never been one to hide. She'd never felt the need. Hidingwas what one did when one wasn't sure of one's place in the world, andshe had always been quite sure of her place at the top. Suddenly she wasn't sure of anything. After a moment of stunned hesitation, Lucrezia had immediately fled toan unoccupied bench in a relatively secluded corner of the courtyard,partially obscured by the greenery of several tall, foreign lookingplants. She had thought to collect herself, and find a way to explainher mistake -- she was not a slave, and didn't know the first thing aboutsubmission to anything -- but there was no escape from the sights andsounds of the Severille: on the other side of the mottled green curtainwas a woman having sex with two men at once on a bench much like the oneLucrezia occupied. One of the men kept slapping the woman's reddenedbuttocks as he drove into her asshole from behind, while the other tookher pussy from below. She was crying unintelligibly with near constantpleasure.Once more, Lucrezia could not look away.\"How amusing,\" a deep voice rumbled behind her. She tried to turn toface the intruder, but a heavy hand grabbed her shoulder and kept herstill while a rougher hand clasped between her legs from behind. She gasped in shock, but did not move. She did not even speak. The sudden, bright fire from the hand between her legsseemed to blot out all words.\"Don't you know that those who hide in plain sight only wish to befound?\" the voice continued, and she realized it was muffled by a mask.Still, it was resonant and rich, and with the calm authority of someonewho is rarely disobeyed. She opened her mouth to speak, but whoever hadtrapped her began to rub his fingers along the length of her slitthrough the thin fabric of her undergarment, and Lucrezia lost her wordsonce more. She felt herself begin to melt into him, and heard himchuckle softly.\"Do not move. Do you understand?\"\"Yes,\" she heard herself say, and nearly choked on it.The man moved his hand from her shoulder to her breast, first over thesoft, expensive leather, then with impatience reaching under the topspiece to seize her naked flesh. He kneaded her breast until she leanedinto him, rolling her nipple between his fingers, massaging her pussywith his other hand. He pinched her nipple, hard, and laughed as shesquealed.\"Yes,\" the voice said, \"you will do.\" He spun her around to face him. He was wearing a full black mask ofsmooth lacquer, his full mouth and stubbled chin all that was visible,and he was smiling. His dark eyes shown through the holes in his maskwith a kind of amused certainty, as Lucrezia imagined a cat might lookat a struggling mouse. What's more, he was powerfully built, with abroad frame wrapped in thick muscle, and shirtless to the waist. Hischest was dusted with fine dark hair, trailing all the way down to hisbelt. Just the sight of him was arousing. He reached out and tipped herchin up to him, taking a look at her blushing cheeks and wet lips. Thenhe grabbed her between the legs again, and drew her close. \"This is now mine,\" he said....The Lady Submits is a 12,000 word erotic historical fantasy novelette featuring strongBDSM themes. If you don't like bondage, leashes, public display andhumiliation, or alpha male doms who brook no dissent, then this probablyisn't for you. Otherwise...enjoy. ;)",
  "genres": [
    "BDSM",
    "Erotica",
    "Romance",
    "Historical Romance",
    "Novella",
    "Historical",
    "Short Stories"
  ],
  "author": "Chloe Cox",
  "average_rating": "3.40",
  "url": "https://www.goodreads.com/book/show/15773798-the-lady-submits"
}