{
  "title": "Henry Adams: History of the United States During the Administrations of Thomas Jefferson",
  "description": "One of the greatest histories ever written in English, Henry Adams's History of the United States is remarkable for its fullness of detail, its penetrating insight, and above all its strong, lively, and ironic style. First published in nine volumes from 1889 to 1891, this classic work was out of print for several decades until The Library of America reissued it in two volumes: the first volume on the years of Thomas Jefferson's presidency and the second devoted to those of James Madison.With a cast of characters including Aaron Burr, Napoleon Bonaparte, Albert Gallatin, John Randolph, Toussaint L'Ouverture, and the complex, brilliantly delineated character of Thomas Jefferson, the first volume is unrivaled in its handling of diplomatic intrigue and political factionalism. Upon assuming office, Jefferson discovers that his optimistic laissez-faire principles--designed to prevent American government from becoming a militaristic European \"tyranny\"--clash with the realities of European war and American security. The party of small government presides over the Louisiana Purchase, the most extensive use of executive power the country has yet seen. Jefferson's embargo--a high-minded effort at peaceable coercion--breeds corruption and smuggling, and the former defender of states' rights is forced to use federal power to suppress them. The passion for peace and liberty pushes the country toward war.In the center of these ironic reversals, played out in a Washington full of diplomatic intrigue, is the complex figure of Jefferson himself, part tragic visionary, part comic mock-hero. Like his contemporary Napoleon Bonaparte, he is swept into power by the rising tide of democratic nationalism; unlike Bonaparte, he tries to avert the consequences of the wolfish struggle for power among nation-states.The grandson of one president and the great-grandson of another, Adams gained access to hitherto secret archives in Europe. The diplomatic documents that lace the history lend a novelistic intimacy to scenes such as Jefferson's conscientious introduction of democratic table manners into stuffily aristocratic state dinner parties. Written in a strong, lively style pointed with Adams's wit, the History chronicles the consolidation of American character, and poses questions about the future course of democracy.",
  "genres": [
    "History",
    "American History",
    "Nonfiction",
    "Presidents",
    "19th Century",
    "American",
    "Biography"
  ],
  "author": "Henry Adams",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/157743.Henry_Adams"
}