{
  "title": "Zero Point",
  "description": "Earth’s Zero Asset citizens no longer face extermination from orbit. Thanks to Alan Saul, the Committee’s network of control is a smoking ruin and its robotic enforcers lie dormant. But power abhors a vacuum and, scrambling from the wreckage, comes the ruthless Serene Galahad. She must act while the last vestiges of Committee infrastructure remain intact – and she has the means to ensure command is hers. On Mars, Var Delex fights for the survival of Antares Base, while the Argus Space Station hurls towards the red planet. And she knows whomever, or whatever, trashed Earth is still aboard. Var must save the base, while also dealing with the first signs of rebellion. And aboard Argus Station, Alan Saul’s mind has expanded into the local computer network. In the process, he uncovers the ghastly experiments of the Humanoid Unit Development, the possibility of eternal life, and a madman who may hold the keys to interstellar flight. But Earth’s agents are closer than Saul thinks, and the killing will soon begin. Earth’s Zero Asset citizens no longer face extermination. Thanks to Alan Saul, the Committee’s despotic network is in ruins and its robotic enforcers lie dormant. But the ruthless Serene Galahad sees an opportunity to grab power. On Mars, Var Delex fights for Antares Base’s survival, while the Argus Space Station hurtles towards the red planet. And Var knows whomever, or whatever, trashed Earth is still aboard. She must not only save the base, but deal with the first signs of rebellion. And aboard Argus Station, Alan Saul’s mind has expanded into the local computer network. In the process, he uncovers the ghastly experiments of the Humanoid Unit Development, the possibility of eternal life, and a madman who may hold the keys to interstellar flight. But Earth’s agents are closer than Saul thinks, and the killing will soon begin.",
  "genres": [
    "Science Fiction",
    "Space Opera",
    "Fiction",
    "Dystopia",
    "Audiobook",
    "Military Fiction",
    "Cyberpunk"
  ],
  "author": "Neal Asher",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/15775601-zero-point"
}