{
  "title": "The Archmage",
  "description": "NOTHING LESS THAN THE WORLD The would-be Archmage has slain nearly all the magic-users in the world, taking their power for himself. If he succeeds in killing the Lucky Seven's own mage Stratocaster, the Archmage's power will become absolute and plunge the world into darkness under his cruel reign. But not if Mustang Sally and the rest of the Just Cause superheroes have anything to say about it. OUT OF TIME Only time will tell if Sally can run fast enough to escape the Archmage's clutches, fast enough to outwit his evil plan, fast enough to save the world. Praise for JUST CAUSE, the first book in the Just Cause Universe series \"Ian Healy's Just Cause is a slam-bang good superhero story: part JLA, part Young Romance, with some splashes of Our Army at War to keep you on your toes. I thoroughly enjoyed Mustang Sally's adventure and look forward to reading more of Healy's work.\" -Rob Rogers, author of Devil's Cape \"Ian Healy's Just Cause is solid, serious superhero action in the classic tradition, with tons of interesting characters, extremely well-crafted action scenes, and real depth. Highly recommended.\" -Van Allen Plexico, author of The Sentinels \"The best thing about Ian Healy's books is the accessibility of their worlds and characters. He welcomes us in and takes us for a fun and memorable ride, and unlike other superhero universes, we never feel like the understanding of an entire mythology is out of our grasp-or would take thousands of reading hours to accomplish.\" -Allison M. Dickson, author of The Last Supper \"Mr. Healy clearly loves superhero fiction. He has taken tried and true superhero tropes, made them his own, and crafted an excellent world, story, and characters. I highly recommend.\" -Corey L. Bishop, Creative Commoners podcast \"Ian Healy's Just Cause is a great superhero book because it creates a world that is so close to our own we almost think that maybe these things did/are really happening, it's just that we don't live in the right city, and don't maybe have that special brick touch pattern to get us to Diagon Alley.\" -Jenn Zuko, Nerds in Babeland \"It almost feels like you're watching a movie instead of reading a book when the superheroes are battling the villains.\" -Megan Bostic, author of Never Eighteen",
  "genres": [
    "Superheroes",
    "Fantasy"
  ],
  "author": "Ian Thomas Healy",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/15776199-the-archmage"
}