{
  "title": "Kiss of the Butterfly",
  "description": "\"I sense it even now. People thirst for it; the entire country is mad with desire for it...” A dying man’s cryptic letter to an enigmatic professor launches student Steven Roberts on an unwitting quest, shrouded in mystery, into the war-torn labyrinth of a disintegrating Eastern European country. Steven plunges into the maelstrom to unearth long-forgotten documents holding clues to an ancient Emperor’s deeply buried secret, an inconceivable and long-forgotten evil that has slumbered for centuries. Steven’s perilous journey stretches from Southern California’s sunny beaches, to the exotically dystopian city-scapes of Budapest, Belgrade, and Bosnia, as it plays out against a backdrop of events that occurred centuries before in the Balkans.Kirkus Reviews wrote: “In the glut of vampire-themed novels now on the market, Lyon’s debut stands out… skillful… authentic… fascinating… inspired… Lyon executes it perfectly... vivid... engaging... highly promising... sophisticated...”Meticulously researched and set against the background of collapsing Yugoslavia, “Kiss of the Butterfly” weaves Balkan folklore together with intricate historical threads from the 15th, 18th and 20th centuries to create a rich phantasmagorical tapestry of allegory and reality. It is about passion and betrayal, obsession and desire, the thirst for life and the hunger for death. And vampires – which have formed an integral part of Balkan folklore for over a thousand years – are portrayed in their original folkloric form, which differs dramatically from today’s pop culture creations.“Kiss of the Butterfly” is based on true historical events. In the year of his death, 1476, the Prince of Wallachia -- Vlad III (Dracula) -- committed atrocities under the cloak of medieval Bosnia’s forested mountains, culminating in a bloody massacre in the mining town of Srebrenica. A little over 500 years later, in July 1995, history repeated itself in Srebrenica, when nearly 8,000 people were slaughtered, making it the worst massacre Europe had seen since the Second World War. For most people, the two events seemed unconnected…From Kirkus ReviewsAs Yugoslavia disintegrates, an American bent on investigating Balkan vampire folklore becomes caught up in evils both supernatural and political.In Yugoslavia on a scholarship to study Balkan ethnography, graduate student Steven Roberts finds his research being directed toward vampires, which have a rich folkloric history in the region. Vampires, he learns, aren’t what Bram Stoker, Anne Rice and Hollywood said they were. For example, the folklore suggests that only newly made vampires are nocturnal, meaning that older ones should be harder to spot—though one of Steven’s professors notes that in 1992 Yugoslavia, it might be hard to tell the vampires from the thugs: “Haven’t you seen all the black jeeps and limousines with darkened windows? If I were a vampire, that would be the ideal way to travel around during daytime.” As Steven delves further into crumbling archives and into an underground labyrinth hiding vampiric secrets, he and his friends get caught up in a perilous confluence of events. Steven must confront his past, his loss of faith and how he might regain it, and his attraction to a mysterious, dangerous woman. He learns the truth about his professor Slatina, who in turn faces a crucial decision that will affect not just vampires but all of the Balkans. In the glut of vampire-themed novels now on the market, Lyon’s debut stands out for its skillful integration of authentic, fascinating myth with the political events of the early 1990s. Linking the horror of the supernatural with the horror of human violence is an inspired idea, and Lyon executes it perfectly. He evidently knows the area, its history and its languages, giving the reader vivid details not just of long-ago history but of the 1990s Balkans: socialist-chic shabbiness, ever-present cigarette smoke, the way every Serb that Steven meets has a cousin in Chicago, and the corrupt Milosevic government. “Slobo keeps prices low so people won’t complain,” a character nicknamed Bear says. “It’s okay if we don’t have gas, just so the gas we don’t have is cheap.” Steven can be irritatingly slow on the uptake, and the ending is less satisfying than it could be, since Lyon is apparently leaving room for sequels. Still, it’s a highly promising start with an engaging cast of characters.No capes, no glitter: a vampire novel for readers who value sturdy mythology and a sophisticated understanding of history, along with warmblooded, human connections.ReviewPublishers Weekly\"A fast-pacedadventure into a modern heart of Balkan darkness... A truly original take on theblood-sucking undead.\" -Publishers Weekly \"In the glut ofvampire-themed novels now on the market, Lyon's debut stands out... skillful... authentic...fascinating... inspired... Lyon executes it perfectly... vivid... engaging... sophisticated.... No capes, no glitter: a vampire novel for readers who value sturdymythology and a sophisticated understanding of history, along withwarmblooded, human connections.\" -Kirkus Reviews \"A wonderfulsurprise...the modern day vampire mythos is completely shattered and restructuredas a truth, backed by historical fact...My heart and spirit stirred.\" -Horror-Web \"A denouement ofaction and heart-pounding resolution... It was a wild ride to the ending,... If youliked \"The Historian\", you'll love Kiss of the Butterfly.\" -Vampire Romance Books\"Immediately gratifying...a worthy addition to any vampire enthusiast's collection.\" -Vampires.com",
  "genres": [
    "Horror",
    "Vampires",
    "Historical Fiction",
    "Fantasy",
    "Paranormal",
    "Historical",
    "Thriller"
  ],
  "author": "James  Lyon",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/15776662-kiss-of-the-butterfly"
}