{
  "title": "Riding Professor Cox",
  "description": "***Please note this is a 7100 word short story involving multiple partners, spanking, dominant males, teacher, student sex***College student Nikki Graham has a problem...a big, sexy problem named Professor Adam Cox. She's waited six months to get a spot in his very popular mythology class, but she can't keep her mind (or her eyes) focused on the Greek gods in the textbook, because she's too busy ogling the Greek god teaching the class. With her grade failing faster than the batteries in her vibrator, it's going to take some quick thinking to salvage her GPA. Good thing she's willing to do whatever it takes to land that easy A...I started when the door suddenly opened. A guy my age stumbled in, his hands full of folders and notes. He glanced over at me and nearly dropped his things. He was pretty cute, with black hair that brushed his chin and dark blue eyes. He looked to be about five-nine and had a lean swimmer's build. \"Sorry,\" he said, \"I didn't realize anyone else was in here. I'm Professor Adam's TA, and I normally come in here at this time to help grade papers.\"A light bulb went off in my mind. I eyed him speculatively and wondered if I could enlist his help in improving my grade. After all, if Professor Adam didn't want to take me up on my offer, I could almost bet this boy would.I looked up and caught his gaze wandering up and down my body with an appreciative look. My nipples hardened at the attention, and his eyes locked on my chest while he waited for my reply. \"It's okay. I just had to stay after class to talk to the professor about my grade.\" I sighed, moving a bit closer to the TA. \"He rushed out of here pretty quickly, though, and I don't think he's coming back. He left before we could resolve my grade issue.\" I stuck my hand out. \"My name is Nikki, what's yours?\"When he reached out to take my hand, I pulled him until our bodies were flush and my breasts pressed against his hard chest. I heard his breath catch at the contact. \"J-Justin,\" he stuttered. \"My name is Justin.\"I grinned up at him. \"Well, Justin, do you think you might be able to help me out with my grade?\" I reached down and grabbed the noticeable bulge in his jeans, giving it a quick squeeze and then running my hand along his shaft in an up-and-down motion.",
  "genres": [
    "Erotica"
  ],
  "author": "Isis Pierce",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/15776828-riding-professor-cox"
}