{
  "title": "plygs",
  "description": "This is the book the fundamentalist Mormons don’t want you to read.This journalistic novel, although technically a work of fiction, is a fact-based story about a family and its struggle with living within a polygamous community located on the Utah-Arizona state line.“plygs” takes the reader inside a closed, secretive society where women are raised with no other purpose than to serve their husbands, who are chosen for them by the prophet, and are emotionally—and sometimes beaten—into hollow, baby-making vessels.The book examines the corruption, fraud, and men sworn to uphold the law who turn a blind eye to violence and violations of the laws of God and man as they serve the perverted commands of the wicked prophet instead of the men and women of the community whose welfare and laws they have sworn to uphold.It also delves into the darkness of girls, some as young as 12, who are torn from their homes and placed into marriages with much older men and forced into relationships that continue the cycle of abuse and perversion.The book was greeted with positive reader “This book made me cry, made me angry, upset me, but I could not put it down. It's a story of justice, through fate and the legal system. It was hard to read for the mother of an independent daughter, but GOOD.”“As a father of daughters and growing up in the West in the shadows of the LDS Church, this book was as interesting as it was shocking. The author conveyed a firm grasp of the realities of polygamy and the details of a hidden culture outside of American mainstream right in our backyard; hidden by religious beliefs.”“’plygs’ is an extremely well-written piece of fact-based fiction. It is emotionally gripping, and once I started reading, I could not put it down. About polygamy, it steers away from the fake, glammed up version of the religious sect, given to the public by ‘Sister Wives’ and ‘Big Love.’ ‘plygs’ is the tough but honest truth. The characters become real to you as you read about the cruelty, the injustice, and the horrors inflicted upon them, and by them.”It wasn’t long, however, before controversy visited the book as members of various fundamentalist Mormon sects began a campaign to offset the acclaim the book was receiving by submitting negative reviews—some from sect members who had not even read the book—to the Amazon.com site to inhibit “Kociela is not from the Plural subculture; neither does he claim an anthropological degree and years of ethnographic experience in studying the cultural subgroups of Southern Utah. And unfortunately, readers are implicated in the invisible assumption that Kociela's knowledge is pure rather than political.”“Most of this book is not true and this man who wrote it could not substantiate it in anyway (sic) with true documented facts. And I just feel bad for these people that people are believing this book to be of true facts and it is not.”“It’s an unfortunate slandery (sic) that will cause more harm to the victims then (sic) good. wouldn't (sic) recommend.”The book, however, is based on research the author undertook during his 16-year career as a newspaper reporter, columnist, and news editor in St. George, Utah, just 40 minutes from the community the book is based on. He interacted with members of the polygamous community as they shopped in the same stores, met women who were brave enough to escape from the lifestyle, wrote columns on the subject, and directed his news staff in a variety of stories that ranged from the worldwide manhunt for FLDS prophet.“All of the information in this book has been thoroughly researched and verified,” the author said. “Mormon scholars and those who lived the polygamous lifestyle have agreed that the information in this book, whether historical or incidental, is spot-on.“Despite the controversy, I stand by it all, from beginning to end, and make no apologies for any content because it places the subject of polyg",
  "genres": [],
  "author": "Ed Kociela",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/15777823-plygs"
}