{
  "title": "On The Bright Side",
  "description": "Publisher's Weekly says: \"Johannes kicks off the Starling series with this fresh novel about an angel’s peripatetic path to earning her wings...A humorous addition to the angel story genre. \"As if the devil’s food cake at her wake and the white fat pants she’s stuck wearing for eternity weren’t bad enough, fourteen year-old Gabby is quick to discover that Cirrus, the main rung of Heaven, is a far cry from the Pearly Gates. Here, SkyFones and InnerNets are all the rage. At her first Bright ceremony, G.O.D., the automated assignment system, spits out Angela Black, Gabby’s arch nemesis and longtime fencing rival. As a Bright, Gabby has to protect Angela, her assigned mortal, in order to move up through the training levels of heaven.Back on earth, Angela starts hitting on Michael, Gabby’s crush and should-have-been boyfriend. Gabby’s pranks to quell the love are harmless at first until the school dance sabotage gets completely out of control. Then, Celestial Sky Agent, Lawrence, who happens to have anger management issues of his own, steps into reveal that Angela has big problems, and what she really needs is Gabby’s help. Determined to right her wrong and ease her mother’s grief, Gabby steals an ancient artifact that allows her to return to earth for just one day. But if Gabby’s not careful, her well-meaning mission just might shift the very foundation of Heaven, Earth, and every place in between, causing the danger of the dark side to roam free.Praises for On The Bright Side\"S.R. Johannes delivers a cute sci-fi thrill ride for middle graders! Even in death there is a BRIGHT SIDE!\" - Addison Moore, author of the bestselling Celestra seriesClever and charming, ON THE BRIGHT SIDE is the story of a reluctant guardian angel, her still-breathing crush, and the frenemy she’s assigned to protect. A great read! -Suzanne Young, author of A Need So Beautiful, A Want So Wicket (6/12), and The Program (2013)“ON THE BRIGHT SIDE is both hilarious and heart-warming – a tale that’ll have you hoping that there really *are* spunky and determined angels like Gabby who’ve got our backs.” - Kristin O’Donnell Tubb, author of Selling Hope & The 13th Sign (2013) (Feiwel & Friends)\"With a smart, snappy heroine and a heart-warming crush, ON THE BRIGHT SIDE is a page-turning new take on guardian angels that left me begging for a sequel!\" - Gretchen McNeil, author of Possess and Ten (9/12) (Balzar + Bray)",
  "genres": [
    "Paranormal",
    "Young Adult",
    "Middle Grade"
  ],
  "author": "Shelli R. Johannes",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/15778625-on-the-bright-side"
}