{
  "title": "The Court of the Spider Queen",
  "description": "Take your funny bone on an extraordinary adventure with Captain Tripp Vaguely! You will be hurled into immediate action as the Captain and his most trusted compatriot, Ghost-Tongue the Anasazi, trek deep into the jungles of darkest Africa to capture a legendary beast with cosmically-sighted goggles and a portable, gear-churned arsenal! These are just the tip of the extraordinary iceberg when the American bravado and Victorian gadgetry of Captain Tripp Vaguely is in play! Fast-paced action and dry wit ensue as the duo confronts both a race of humanoid arachnids and the Captain's arch-nemesis, the wicked and phonetic Doctor von Skaar! You'll laugh. You'll groan. You'll break a sweat!The Court of the Spider Queen is the first short story installment of the Extraordinary Adventures of Captain Tripp Vaguely and the first book in the Fascination Chronicles; a humorous adventure series by author, Ziggy Tausend and his Clandestine Tales. It introduces the reader to the Captain and his cohort, Ghost-Tongue while forging the first step toward his next mysterious but surely impossible goal. Poking fun whilst simultaneously embracing the pulp format of bygone years, the Extraordinary Adventures of Captain Tripp Vaguely are quick journeys through the fantastic. An Edisonade-style steampunk genre infused with mythology and humor, the Court of the Spider Queen is but the opening of the door into a realm without boundaries. Further releases will follow soon, as Clandestine Tales (clandestinetales.com) prepares to carry the reader into vast worlds of excitement. Visiting Clandestine Tales also offers extra glimpses into the background of the characters and helpful information such as a Glossary of Terms to fill in the gaps between the here and now and the Victorian past.",
  "genres": [],
  "author": "Ziggy D. Tausend",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/15778932-the-court-of-the-spider-queen"
}