{
  "title": "Organized Crime: The Unvarnished Truth About Government",
  "description": "Politics and thieves, coercion and regulation, fascism and the Fed, centralization and liberty, workers and unions, trade and freedom, free-market achievements and government disasters in American history—this book covers it all!Organized Crime collection of essays in the tradition of Austrian political economy—a combination of applied economics and the study of governmental reality. Unlike “mainstream” economists who are content to spin mathematical model after mathematical model which explain little or nothing about the real world, DiLorenzo’s focus has always been just the opposite—to use economic understanding to gain a better understanding of how the political-economic world works. Austrian economics is indispensable to succeed at this task. The book is divided into six sections: “Coercion and Regulation” analyzes various aspects of government regulation of business; “Politics and Thieves” is of course about the inherent nature of government; “Centralization versus Liberty” discusses the never-ending quest by statists to monopolize and centralize political power so as to isolate themselves as much as possible from public influence; “Money and the State” describes the myriad evils of central banking, which was always thought of by its original proponents in America as an engine of corruption; “Workers and Unions” discusses various labor union myths and superstitions that too often cloud the public’s thinking about the reality of labor markets; and “Truth and Lies about Markets” is a taxonomy of some of the main market-failure myths that have long been used to illegitimately advance the cause of economic interventionism, as well as some newer ones.In Organized Crime: The Unvarnished Truth About Government, Thomas J. DiLorenzo strips away the vast apparatus of establishment propaganda and exposes the government smokescreen. No statist lies are safe from his scrutiny. In his straightforward and methodical approach to uncovering truths of freedom, liberty has a champion.",
  "genres": [
    "Politics",
    "Economics",
    "History",
    "Nonfiction",
    "Essays",
    "Conspiracy Theories",
    "Philosophy"
  ],
  "author": "Thomas J. DiLorenzo",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/15779622-organized-crime"
}