{
  "title": "Warpaint",
  "description": "NEW YORK TIMES and USA TODAY BESTSELLING AUTHOR, ELLE CASEY, brings readers Book 2 of 4 in the YA Dystopian APOCALYPSIS Series, suitable for older teens and adults. WARPAINTMy name’s Bryn Mathis. I’m seventeen years old, and I live in Kahayatle, otherwise known as The Everglades. I’m here with my three best friends and a tribe of Native American teens, because my dad died almost a year ago, along with all the other adults in the world. We’re creating a whole new world for ourselves, but this world has problems. The biggest threat to our survival is not starvation anymore … it’s the gang of kids who lives nearby that has become more vicious than anyone could have imagined possible. The soulless demons have gone too far, and it’s time for us to rise up and do what needs to be done to set things right. Alone, it might have been impossible; but now I’ve got friends. I’m worried, though, that I won’t be able to get them ready to fight in time, and that we’re taking on more of a challenge than we can handle right now. And I have no idea what might be waiting for us when we arrive on their front doorstep. Content Warning: Mild violence and some foul language. Meant for older Young Adult readers (age 15+). This book is in the Dark Science Fiction / Horror / Post-Apocalyptic genres, featuring teen characters only. \nAPOCALYPSIS SERIES READING ORDER\nKahayatle (Apocalypsis Book 1) **Special introductory ebook price**Warpaint (Apocalypsis Book 2)Exodus (Apocalypsis Book 3)Haven (Apocalypsis Book 4)This series is dedicated to the amazing, wonderful Native Americans who populate our nation, continuing their traditions and reminding the rest of us that sometimes, progress isn’t always the best thing for our people. I invite you to learn more about the Miccosukee tribe, their history, culture, and lifestyle by visiting this website: http://www.miccosukee.com/indian-vill...",
  "genres": [
    "Dystopia",
    "Post Apocalyptic",
    "Young Adult",
    "Apocalyptic",
    "Romance",
    "Survival",
    "Horror"
  ],
  "author": "Elle Casey",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/15780556-warpaint"
}