{
  "title": "The Greater Journey: Americans in Paris",
  "description": "From two-time Pulitzer Prize-winning author David McCullough comes the inspiring, enthralling—and until now, untold—story of the American painters, writers, sculptors, and doctors who journeyed to Paris between 1830 and 1900, ambitious to excel in their work, fell in love with the city, and changed America with what they achieved.After risking the hazardous journey across the Atlantic, these Americans embarked on a greater journey in the City of Light. That they achieved so much for themselves and their country profoundly altered American history. As David McCullough writes, “Not all pioneers went west.”Elizabeth Blackwell, the first female doctor in America, was one of this intrepid band. Another was Charles Sumner, who enrolled at the Sorbonne because of a burning desire to know more about everything. There he saw black students with the same ambition he had, and when he returned home, he would become the most powerful, unyielding voice for abolition in the U.S. Senate, almost at the cost of his life.Writers Ralph Waldo Emerson, Nathaniel Hawthorne, Mark Twain, and Henry James were all “discovering” Paris, marveling at the treasures in the Louvre, or out with the Sunday throngs strolling the city’s boulevards and gardens. “At last I have come into a dreamland,” wrote Harriet Beecher Stowe, seeking escape from the notoriety Uncle Tom’s Cabin had brought her. Sculptor Augustus Saint-Gaudens and painters Mary Cassatt and John Singer Sargent, three great American artists, flourished in Paris, inspired by French masters and the city itself.McCullough tells this sweeping, fascinating story with power and intimacy, bringing us into the lives of remarkable men and women. The Greater Journey  is itself a masterpiece.",
  "genres": [
    "History",
    "Nonfiction",
    "France",
    "American History",
    "Biography",
    "Travel",
    "Art"
  ],
  "author": "David McCullough",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/10572731-the-greater-journey"
}