{
  "title": "Metro 2033",
  "description": "Yıl 2033...Nükleer savaş sonrası enkaz haline gelen dünyada insan soyu neredeyse tükenmiş, radyasyon yüzünden kentler yaşanamaz halde. Hayatta kalan birkaç bin kişi yeraltına, dünyanın en büyük nükleer sığınağı olan Moskova Metrosu'na sığınıyor.Burası insanoğlunun son kalesi.Yeraltındakiler için en büyük tehlike Karaderililer. İstasyonlar mini devletlere bölünmüş. İdealler, dinler, temiz su filtreleri gibi nedenlerle bir araya gelmiş halklar. Duygular yerini içgüdülere bırakmış.Tek bir amaç var: Ne pahasına olursa olsun hayatta kalmak.Genç Artyom'a yaklaşmakta olan karanlık tehlikeye karşı halkı uyarması için Metro'nun kalbi, \"Polis\" istasyonuna gitme görevi verilir. Metro'nun kaderi belki de tüm insanlığın kaderi Artyom'un elindedir artık…Moskova metrosu, romanda anlatıldığı gibi labirente benzer, büyüklüğü ve hatları tam olarak bilinmeyen bir gizemdir. Metroda, devlet ve gizli servislere ait yüzden fazla gizli yeraltı sığınağı bulunur. Sovyetler Birliği döneminde liderleri korumak ya da ülkeden kaçırmak için yapıldığı söylenen Metro-2, Moskova metrosunun bir parçası ve en ünlü efsanelerinden biridir. Esin kaynağı olduğu çok sayıda mit ve şehir efsanesi vardır.* * *1979 Moskova doğumlu Dmitry Glukhovsky, 14-15 yaşlarında kafasında salt bir fikir olarak oluşturdu Metro 2033'ü. Gazeteci olarak Fas'tan Guatemala'ya, İzlanda'dan Japonya'ya kadar neredeyse bütün dünyayı dolaştı. Çernobil'de nükleer reaktörü filme almak için bölgedeydi. Kuzey Kutbu'ndan dünyada ilk kez canlı yayını gerçekleştirdi. Anadili Rusça'ya ek olarak İngilizce, Fransızca, Almanca, İbranice ve İspanyolca da bilmektedir. Metro-2033 kitabı ile 2007 yılında, Kopenhag'daki EuroCon yarışmasında, Avrupa Bilim Kurgu Topluluğu (the European Science Fiction Society) tarafından Teşvik Ödülü'ne (the Encouragement Award) değer görüldü. Bu kitaptan uyarlanan aynı adlı bir video oyunu da bulunmaktadır.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Horror",
    "Post Apocalyptic",
    "Dystopia",
    "Fantasy",
    "Russia"
  ],
  "author": "Dmitry Glukhovsky",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/15781576-metro-2033"
}