{
  "title": "Sword from the Sky",
  "description": "It is the Dark Ages. A Dying Sun Sets in the West. Man Becomes Shadow.Out of this Sunless Land Will Rise a Legend...Of the Starborn Child,Of the Great Cosmic War,Of the Sword of Power...It has been twelve years since the guardian star came down from the sky, hunting the elusive child destined to save the ailing sun. The end of the land is nigh, while darkness slowly rolls over the looming horizon. The creeping fog harvests an army of beastly children, and the sun will set one last time over the kingdom of Bune.But there is hope. And it comes in the form of a twelve-year-old boy with a wooden leg, chosen to save the sun from its untimely death. Unfortunately, young Luca has no idea that he's the one. And so the heart-pulsing adventure begins when Luca and his friends Vehru and Pabru are thrown into a frightening world of creatures both deadly and beautiful, caught in the middle of a cosmic war between gallant stars and darkly shadows. Follow Luca as he comes of age, struggling to advance in mastery at the prestigious Blade School of Daví while pining for the heart of his affectionate crush, Lereh of Heatheranla, all before being confronted by a mysterious woman, claiming Luca as her own and bringing with her an army of shadowed warriors bred solely for one purpose--to bring about the death of the setting sun.In Book I of his debut series, R. Janvier del Valle plummets the reader into a long lost history of myth and legend, forming a rich and complex cosmic tragedy sure to resonate with both the hardcore and casual reader of heroic fantasy literature. Discover an epic war between the earthly and heavenly, enjoying great feats of valor and courage with edge-of-your-seat duels and engrossing action as the author brings together the worlds of the natural and supernatural in this fast-paced, epic fantasy thriller!*This novel is approximately 99,000 words (the equivalent to 400 paperback pages).",
  "genres": [
    "Fantasy",
    "Epic Fantasy",
    "Adventure",
    "Christian",
    "Young Adult",
    "Supernatural",
    "Religion"
  ],
  "author": "R. Janvier del Valle",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/15783089-sword-from-the-sky"
}