{
  "title": "Love Plus One",
  "description": "All her life, Jordi Hemphill was told that she needed to change to fit in and be accepted. She talked too much, laughed too loud, and most definitely, indisputably and inexcusably weighed too much. In fact, she wore her size-20+ clothes without so much as an apology. She didn’t care to fit in. She didn’t want to be beautiful. Instead, she wanted to wear her hair in funky colors, she itched for tattoos and piercings, and dreamed of a life much bigger than working at the local Burger Palace for minimum wage. She had been born with the voice of a superstar, and something inside her told her it was OK to dream big, even if she had to do it in secret.  On her eighteenth birthday, she takes every last cent she has and buys a one-way ticket for Los Angeles. She is sure her talent will get her noticed by those more open-minded to see it. Then and only then will she show all the naysayers in her hometown that she was a somebody no matter what they thought.  Unfortunately Los Angeles wasn't any more welcoming. Jordi didn't fit into their pop machine no matter how well she sang. Other pop princess had the \"full package,\" whereas Jordi still needed to change if she wanted her dreams to come true. It took a plus-size TV producer to take a chance on her, casting her for a reality talent show called \"Fierce,\" which put attitude and talent far above the traditional pop star image.  Thanks to Giovanni Carnevale, the lead singer of \"Dreaming in Blue\" and “Fierce’s” rock star judge, Jordi gets a chance to fight for her place on a national stage.  But will America embrace this alternative diva? Or will they too expect her to conform in order to be accepted... to be loved? Despite the acceptance of new friends and supporters, old ghosts continue to haunt Jordi on her new journey. It will take handsome fellow contestant, Jace Riga, to finally help expose and exorcise the demons that drive her self-destruction.  \"Fierce\" continues the story introduced in the Ginger Voight novel, \"Mogul,\" where Jordi joins a hodge-podge of other contestants to battle for the championship that dares every single hopeful to live large, to be FIERCE.  Ginger Voight, the author of the best-selling \"Groupie\" series, brings fame once again to the forefront with her new adult story, \"Fierce.\" The characters you grew to love in the \"Groupie\" trilogy and \"Love Plus One\" are back to help the incomparable Jordi Hemphill carve a place for herself as a pop princess despite the odds in this coming-of-age Rubenesque romance.",
  "genres": [
    "Romance",
    "Chick Lit",
    "Amazon",
    "Contemporary Romance",
    "Contemporary"
  ],
  "author": "Ginger Voight",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/15783382-love-plus-one"
}