{
  "title": "Finding the Mark",
  "description": "A mysterious stone... Twenty-year-old Michael Black's parents are dead; killed in a horrifying car crash that may not have been an accident. They leave him a rather simple looking stone, a \"trace\" that unleashes a previously unknown ability in him.An unknown power... The power enables him to bridge into another's mind and control not only their thoughts, but also their actions. THE SOMNIBUS... When Michael unwittingly bridges to his dead mother, he is attacked by the Somnibus; guardian wraiths from a shadowy world filled with stench and decay.But the Somnibus aren't Michael's only concern. The ability to bridge also reveals an even greater power trapped within the trace. An ability coveted by the people responsible for the death of his parents. They want the trace, and will stop at nothing to get it.With the Somnibus and his parents' killers closing in, Michael must keep the stone from falling into the wrong hands. Michael must distinguish fact from fiction, forcing him to make deadly decisions; choices that may cost him his life...and maybe his soul.   ******Praise for the work of Craig McGray\"...the writer did such a good job of description that I just kept reading until I was done. The writer just pulled me in and like I said before, I just kept reading until I was done. I am looking forward to reading 'The Somnibus: Book I' when it is released.\" -Michael Edward -Review for This Little Piggy\"The description of events was wickedly vivid. I could see the blood and smell the stench. I had to read the story a second time, because I could not believe I wanted to recommend it...It is horror in the tradition of Edgar Allan Poe. As readers, we must confront our own perceptions of victims and villains.\" -Gayle Hayes -Review for This Little Piggy\"One unique spin though was the main character's attitude through the whole thing. I would mention it here but that would ruin the surprise. ;) I look forward to more from this Author.\" -Trace -Review for This Little Piggy \"I really enjoyed McGray's short story, This Little Piggy and I like The Somnibus even more. I hate recapping the story, so let's just say there are moments in here that will creep you out of your skin. Craig does a great job of keeping the story flowing nicely with a finale that will leave you at once well satisfied and begging for more. -Griffin Hayes -Review for The Somnibus: Book I\"Mr. McGray has crafted a chilling paranormal thriller that will keep you awake at night, because it is sometimes terrifying but also because you won't want to put it down. This is the beginning of a series that I look forward to continuing with, but the author has done an excellent job of making sure this first book is self-contained and satisfying enough that you won't leave off feeling cheated of a proper conclusion. That being said, there are questions and enticing hints left at the end of the book that will make you look forward to the next installment.\" -Michael K. Rose -Review for The Somnibus: Book I",
  "genres": [
    "Paranormal"
  ],
  "author": "Craig McGray",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/15784104-finding-the-mark"
}