{
  "title": "Ripples in Time",
  "description": "July 1816—Kendra Donovan could use a distraction. The FBI agent has been dealing with a serious case of cold feet after impulsively agreeing to marry Alec, the Marquis of Sutcliffe. And if that isn’t enough, there is also the tantalizing possibility that maybe, just maybe she could return to her own timeline as the one-year anniversary of her shocking arrival in the early 19th century approaches.When Reginald Lansing, the Earl of Craymore, is found mortally wounded on the Duke of Aldridge’s land, Kendra gets the distraction that she’s been looking for. At first glance, it appears as though the aristocrat is the victim of a highwayman. After all, Lansing had been traveling with the Anahita Pink, a priceless pink diamond that can be traced to the lost treasure of King John, and has since vanished. However, some things aren’t adding up, and Kendra begins to suspect that there’s more to the crime than a simple robbery.Certainly, Craymore’s life proves to be complicated. He had his sister, Lady Evelyn, committed to a madhouse to prevent her from marrying a fortune hunter, and recently he’d been heard arguing with his radical cousin, who is next in line to inherit the title and Craymore fortune. Both could benefit from the earl’s untimely death. On the other hand, anyone who managed to get their hands on the Anahita Pink would benefit.No one knows better than Kendra that humanity’s darker impulses can cause devastating ripples. And when the killer strikes again, Kendra realizes that her investigation is more than a puzzle, more than a distraction—it is a terrifying game of cat and mouse against a ruthless killer, who will stop at nothing to win.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Time Travel",
    "Romance",
    "Historical",
    "Fiction",
    "Historical Mystery"
  ],
  "author": "Julie McElwain",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/105735278-ripples-in-time"
}