{
  "title": "Son Of Adam - A Wellford Family Series",
  "description": "This book is about what happens to a man and his family after he catches a pedophile serial killer._______Son Of Adam, takes us on the thrill ride exposing the monster lurking inside each of us.Cal, a black, rough tempered, hard-nosed automotive engineer driving his way around life’s twisting race-track until the second Gulf War places him on a collision course with a pedophile serial killer in a distant war-torn land. Lives changed forever in an instant of horror.Seventeen girls missing and seventeen weeping mothers with no hope of rescue confuse the soldier’s motives and missions. A small, foreign village with a fledgling infrastructure barely able to support traffic stops was a pedophiles playground. The shadows of war and the prowling despot have free reign over the frightened village families until the killer gets sloppy, exposing his bloodstained trail. All the gory pieces fall together and the Army platoon moves in for the arrest. Mission accomplished for all, except for the soldier that found him – the one who had to search the killer’s bedroom and catalog all of his bloody souvenirs.Back home and years later, the demons of that horrible day are still lurking in the darkness, pushing him from odd job to odd job around the country, spiraling an out of control life but weaving it back together with help from some unlikely outsiders – just like him.The suspenseful story winds its way from the foothills of the Alps to the foothills of the Appalachians as a new journey begins. With twists and turns along the way, finishing in the unwanted answer to an age old question. A life redeemed in the midst of disgraceful mistakes and youth’s tiresome baggage, bringing him back to the tender answer to a divisive social issue: How can anyone be Pro-Life and Pro-Death Penalty?From first homes to the German Oktoberfest and jumbo jet rides across the Atlantic Ocean to automotive assembly plants in the new south, Son Of Adam, exposes the inner workings of the fall-out from the heinous crimes and bloody investigation, pieced by painful piece.",
  "genres": [],
  "author": "Matthew Akers",
  "average_rating": "3.42",
  "url": "https://www.goodreads.com/book/show/15784225-son-of-adam---a-wellford-family-series"
}