{
  "title": "Huis van muziek",
  "description": "Huis van muziek is een van die zeldzame, onvergetelijke boeken, waarin alle aspecten van het menselijk bestaan vervat zijn, op een ontroerende, komische, erotische en surreële manier.Het verhaal begint in de jaren dertig op het platteland van midden-Zweden. Onderweg naar een repetitie van Backs Weinachtsoratorium valt Solveig Nordensson van haar fiets en wordt voor de ogen van haar achtjarig zoontje Sidner door koeien vertrapt. Het rouwende gezin verhuist van de plek des onheils, maar zowel Sidner als zijn vader Aron ontdekken al gauw dat je verdriet niet zomaar ergens kunt achterlaten. Aron begint in zijn wanhoop te hallucineren om zijn overleden vrouw te ‘zien’. Uiteindelijk reist hij onverrichtterzake naar Nieuw-Zeeland, omdat hij meent Solveig daar terug te zullen vinden. De introverte Sidner zoekt zijn heil in wonderlijke vriendschappen met een zwerver en een oudere vrouw die er nogal vrijmoedige gedachten op nahoudt. En zelf Sidners zoon Victor gaat jaren later nog gebukt onder de sporen die zijn grootmoeders dood in de familie heeft nagelaten. Hij tracht ze te bezweren door een groots opgezette uitvoering van Bachs Weinachtsoratorium te organiseren - een uitvoering die een halve eeuw eerder door Solveigs tragische dood werd onderbroken, evenals de levens om haar heen.Göran Tunström (Karlstad, Zweden, 1937) publiceert sinds 1958 gedichten en romans. Hij is een van de belangrijkste en succesvolste hedendaagse Zweedse auteurs. In Nederlandse vertaling verscheen Brief uit de woestijn (1987) en De dief (1994), dat inmiddels aan een vierde druk toe is. Huis van muziek is in vele talen vertaald. De aangrijpende televisieserie naar dit boek werd ook op de Nederlandse televisie uitgezonden.",
  "genres": [
    "Fiction",
    "Sweden",
    "Classics",
    "Swedish Literature",
    "20th Century",
    "Modern Classics",
    "Christmas"
  ],
  "author": "Göran Tunström",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/15785938-huis-van-muziek"
}