{
  "title": "HIDDEN MICKEY ADVENTURES 1: Peter and the Wolf",
  "description": "HIDDEN MICKEY ADVENTURES 1Peter and the Wolf The 6th Hidden Mickey novel by Nancy Temple Rodrigue, following \"Hidden Mickey 4.5: Unfinished Business—Wals\". It features a new generation of clue solvers, continuing the Hidden Mickey series of action-adventure mysteries about Walt Disney and Disneyland written for Adults, Teens, & Tweens (age 9 to 90)WHAT'S MORE EXCITING THAN A FAMILY DAY AT DISNEYLAND?Ditching their family, Peter Brentwood and his younger brother stumble upon a letter from the Master Storyteller himself, Walt Disney. Following a clue in the letter they are immediately caught up in what they thought was an innocently fun treasure hunt.SOMEONE ELSE DISCOVERS THEIR HUNT FOR HIDDEN TREASURE.The quest takes a serious turn when someone in a trusted position begins tracking their every move, hungering for the treasure for himself.WILL LONG-HELD SECRETS BE FORCIBLY REVEALED?The secrets Lance and Kimberly Brentwood have closely guarded could rip their family apart if compromised. At stake is something they hold very dear: Walt's Legacy. WATCH AS THIS YOUNGER GENERATION OF TREASURE HUNTERS GRAPPLE WITH AN IMPOSING AND FEARSOME MENACEWolf, their friend and protector steps in, but is it too little, too late? Uncover secrets of Disneyland and the Disney Studios in Burbank as we watch the drama unfold.YOU WILL NEVER LOOK AT DISNEYLAND THE SAME AGAIN!Next book in the series... \"HIDDEN MICKEY ADVENTURES 2: Peter and the Missing Mansion\"Another \"E-Ticket\" ride through Disney's history.Want to go on your own 'E-Ticket' adventure? Next time you visit a Disney Park you can play in Quests like Adam & Lance by bringing with you a copy of HIDDEN MICKEY ADVENTURES in Disneyland - HIDDEN MICKEY ADVENTURES in Disney California Adventure, and for our east coast Fans: HIDDEN MICKEY ADVENTURES in WDW Magic Kingdom (or download one to your mobile device).",
  "genres": [],
  "author": "Nancy Temple Rodrigue",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/15787022-hidden-mickey-adventures-1"
}