{
  "title": "Amanda's Eyes",
  "description": "Waking up is the pits when you come to in a hospital with a broken arm, a colorful assortment of abrasions and contusions, and a face swathed in bandages. It's even worse if you can't remember what hit you.The bad and the ugly are crime reporter Amanda \"A.J.\" Gregson's business. But learning she had a ringside seat for an explosion that vaporized two federal agents, incinerated an entire block of warehouses, and peppered her eyes with so much shrapnel they had to be surgically removed? Well, that gives the darker side of life a whole new meaning.Haunted by will-o-the-wisp nightmares, A.J. waits for her transplant and struggles to remember the events leading up to the fateful night of September 4, 2075. She isn't the only one who wants that information. Special Agent Jack \"Iceman\" Eagan is as determined to get the facts as she is to remember them. When memory floods back in brutal detail the night before surgery, fed and reporter form an uneasy alliance against the architects of her personal disaster, a lethal band of killers-for-hire known as Ferrymen.\nThe Ferrymen. My not-so-magnificent obsession for more than a year. Only a cataclysm could have made me forget. I guess you could call them hitmen. You could also call Einstein a math whiz. Think ruthless. Think unstoppable. Think killers so proficient 'caught the ferry' was fast replacing 'bought the farm' in common usage, and you have the Ferrymen in a nutshell.\nA.J. is raring for a rematch with Hell's Boatmen, eager to come out swinging as soon as the bandages come off. But fate has a surprise in store for both her and Eagan. Before long, her new baby blues reveal a power that turns her world upside down--the power to see hidden dimensions of the human heart.When the Sight unmasks the mastermind behind the Ferrymen, A.J. realizes she's onto a story no one will believe--least of all the ultra-cynical Iceman--and it propels her toward a second head-collision with evil. Will she survive the final encounter?A paranormal fantasy that will appeal to those who don't normally read them, the near-future thriller Amanda's Eyes blends suspense, drama, and humor in an exploration of the capacities for good and evil in each of us, the cost of doing the right thing, and the push-me-pull-you relationship between the Fourth Estate and the Long Arm of the Law.",
  "genres": [
    "Science Fiction",
    "Thriller",
    "Mystery",
    "Fiction",
    "Paranormal",
    "Amazon",
    "Crime"
  ],
  "author": "Kathy Disanto",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/15786998-amanda-s-eyes"
}