{
  "title": "Innocence Lost",
  "description": "Get sucked into the Journey that is Innocence Lost. Impossibilities, heartaches and wonder if love prevails all. Join us as we follow the story of Siobhan and Blake as they battle through the trials and tribulations of two very different worlds.Blake is an Elder Vampire, over four hundred years old, dark, mysterious, bold, tall, and extremely gorgeous, as only a vampire such as he can be. Centuries of feeling incomplete knowing there’s a part of him that is missing, part he yearns to be complete. Never knowing he would find that in the oddest way. A meeting with a gypsy fortune teller has him intrigued when she foretold of when and where he could find his Queen.But he was warned there would be many brutal, obstacles to be overcome before any kind of happy ever after couldbe accomplished, before his Queen and the missing link to his soul, the woman whom would complete him would be safe in his arms.Siobhan, pronounced (Ser-bi-on) is a beautiful young woman, an innocent, on holiday with her friends when she unexpectedly meets atall charismatic man who completely and utterly sweeps her off her feet, she is drawn to him like amoth to a flame. He's so sexually dominant, taking his time to initiate her, step by slow step, patiently and completely to the carnal pleasures, her body could feel. What only he could make her feel...But unbeknown to either of them, adark and evil presence from Blake’s past has been observing them, planning to shred their worlds apart, and sooner rather than later. Siobhan is cruelly ripped from his embrace and is thrust into a world beyond anything she has ever dreamt of or could ever have imagined existed.Follow us as Blake has abattle with forces he’s not sure he can defeat, all to bring home the one and only woman he would ever have, love and desire with all that he is.Welcome to Innocence Lost",
  "genres": [
    "Vampires",
    "Paranormal"
  ],
  "author": "Helen  Johnston",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/15787692-innocence-lost"
}