{
  "title": "Die Traumvektor Tetralogie - Gesamtausgabe",
  "description": "Es gibt ein Geheimnis, das älter ist, als das Universum selbst.Mehr als 650 Seiten (Paperback) erzählen von faszinierenden Welten jenseits unserer Vorstellungskraft.Welten, in denen weder Raum noch Zeit existieren. Welten, die so anders sind, dass auch jene Wesen sie lange nicht verstehen konnten, die unserem Universum schon vor Äonen den Rücken gekehrt haben, um sie zu erkunden und hinter ihr Geheimnis zu kommen. Nun stehen sie kurz davor, das Rätsel zu lösen, doch dazu bedürfen sie der Hilfe der Menschen.Doch die Menschheit darf und wird nie etwas davon erfahren.Diese Auflage wurde mit vielen Links zu Hintergrund- und Zusatzinformationen versehen, um dem Leser, sofern er gewillt ist, die Möglichkeit zu geben, etwas mehr über das geschichtliche, philosophische, soziale und wissenschaftliche Umfeld der handelnden Personen zu erfahren.I.UrsprungEin frustrierter Programmierer findet sich nach einer durchzechten Nacht plötzlich in einem unbekannten Zeitalter wieder, in der die Menschheit ausgestorben scheint. Er trifft auf eine technologisch fortschrittliche, humanoide Spezies und bald erkennt er, dass die Erde ihren angestammten Platz verlassen hat und einen fremden Stern umkreist.Was ist aus der Menschheit geworden? Wer hat die Erde in diesen Raumsektor transportiert? Woher kommen die Außerirdischen?Auf der Suche nach Antworten stößt er auf ein Geheimnis, das älter ist, als das Universum selbst.II.AufstiegIn einer nicht allzu fernen Zukunft, in der nicht mehr demokratisch gewählte Parteien das Volk regieren, sondern längst progressive neodemokratische Staatsformen, aus weltumspannenden Megakonzernen, die Macht übernommen haben und die Menschen zu mehr oder weniger willenlosen Sklaven mutiert sind, wird Anath, eine hochrangige Offizierin der SAE, von Träumen heimgesucht, in denen sie immer wieder das Leben einer anderen Frau durchlebt.Als sie den Hinweisen in den Träumen folgt, kommt sie einer unglaublichen Verschwörung auf die Spur. Einer Verschwörung, dessen Ursprung weder auf der Erde, noch in dieser Zeit, ja nicht einmal in diesem Universum zu finden ist, sondern weit über alles hinausgeht, was der menschliche Verstand begreifen kann.III.UnitätEinige Jahre vor der Jahrtausendwende: Eine Frau erwacht aus einem sonderbaren Traum und muss feststellen, dass ihr Freund verschwunden ist. Nach einem Tag vergeblicher Suche erfährt sie zufällig, dass er in einem Flugzeug über Thailand abgestürzt und vermutlich tot ist. Schweren Herzens begibt sie sich nach Thailand, um die Überreste ihres Freundes als die Seinen zu identifizieren.Auf dem Flug dorthin lernt sie einen Mann kennen, der kurz davor stand, das größte Geheimnis der Menschheit zu lüften, ohne es zu ahnen.In Thailand angekommen wird sie überraschend von Soldaten festgenommen, die sich als Mitglieder einer geheimen Weltregierung herausstellen. Eine Weltregierung, die ein Geheimnis verbirgt, welches das weitere Schicksal der Menschheit entscheidend beeinflussen kann und wird.IV.InterferenzWelches Geheimnis verbindet die Welten in \"I.Ursprung\", \"II.Aufstieg\" und \"III.Unität\"?Gibt es eine namenlose Macht, die im Verborgenen wirkt und die Zivilisationen der Universen für ihre eigenen undurchsichtigen Zwecke missbraucht? Oder gibt es eine einfache Lösung, die allerdings so aberwitzig ist, dass nur die Verrücktesten unter den Verrückten darauf stoßen?Ist die Physik der Außerirdischen der Schlüssel oder ist sie, so wie auch viele Theorien der Gegenwart, noch zu unvollständig, um alle Ereignisse im Universum zufriedenstellend erklären zu können?Im letzten Teil der Tetralogie hat der Autor für die Leserschaft auf all diese Fragen verblüffende Antworten parat.»Folgt den Spuren der Alten und ihr werdet verstehen.«Mehr auf traumvektor.eu",
  "genres": [],
  "author": "Jeamy Lee",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/15787877-die-traumvektor-tetralogie---gesamtausgabe"
}