{
  "title": "Beast of Fire",
  "description": "BEAST OF FIRE Lucan's human life was ripped from him by a demon known as a Darkland Beast, but he was saved by the Archangel Rafael to join the immortal Knights of White, as a protector of humanity. For two hundred years, Lucan served honorably but one fateful night, he did he unforgivable, the one thing he can never be saved from. Lucan vowed servitude to the leader of the Darkland Beasts, and the underworld in the process, and he did it to save a woman, a firestarter who the demon leader intended to use to destroy the Knights. Kresley Ward has spent her life as a freak, unable to control her firestarting abilities, scaring away everyone who has ever been in her life, and afraid of hurting someone. She isn't about to be the reason Lucan is destined for eternal hell. For the first time in her life, a new medical treatment has given her control over her ability to start fires, and she intends to put it to use. She's going after Lucan and saving him no matter what the danger, or cost, to herself. Passion and destiny will bring Lucan and Kresley together but will Kresley prove to be Lucan's ultimate salvation or the the weapon that destroys the protectors of humanity, The Knights of White.ABOUT The Knights of White.....Sentenced to an eternity on earth for killing his brother Abel, Cain became angry and sought the favor of the Underworld. By doing so, it is said that he was granted magical powers and given leave from the physical plane. But his gifts came with a price. Cain must oversee the Darkland Beasts, evil beings who walk the earth. Hungry for power, he builds his army of Beasts, stealing male souls while simply using and discarding the females. Over time, the scale of good and evil began to tilt. The Archangel Raphael, the healer of the earth, was given the duty of balancing the scale again. To do this, he assigned Salvador, his most trusted companion, the duty of saving those souls worthy of serving good against evil. These unique individuals, victims of the Darkland Beasts, are given back their souls and enlisted into an elite army...The Knights of White.But in each of these Knights still lurks a Beast of darkness that only they can completely dispel. Each Knight must face their Beast and defeat it. For the simple laws of the universe present a balance of good and evil, and these Knights have tasted the temptations of evil. They must prove they are worthy of the soul returned to them and capable of facing the Underworld without defeat. These Knights must prove themselves worthy of a mate born of all that is pure and good. If they do so, then, and only then, will the Knight become all that he can be -– a magical warrior against evil, gifted with a love that will guide him through darkness to light.",
  "genres": [
    "Paranormal",
    "Romance",
    "Demons",
    "Paranormal Romance",
    "Audiobook",
    "Magic",
    "Fantasy"
  ],
  "author": "Lisa Renee Jones",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/15788485-beast-of-fire"
}