{
  "title": "Light from a Distant Star",
  "description": "Light from a Distant Star is a gripping coming-of-age story with a brutal murder at its heart and a heroine as unforgettable as Harper Lee’s \"Scout.\"It is early summer and Nellie Peck is on the cusp of adolescence – gangly, awkward, full of questions, but keenly observant and wiser than many of the adults in her life. The person she most admires is her father, Benjamin, a man of great integrity. His family’s century old hardware store is failing and Nellie’s mother has had to go back to work. Nellie’s older half-sister has launched a disturbing search for her birth father. Often saddled through the long, hot days with her timid younger brother, Henry, Nellie is determined to toughen him up. And herself as well.Three strangers enter Nellie’s protected life. Brooding Max Devaney is an ex-con who works in her surly grandfather’s junkyard. Reckless Bucky Saltonstall has just arrived from New York City to live with his elderly grandparents. And pretty Dolly Bedelia is a young stripper who rents the family’s small, rear apartment and becomes the titillating focus of Nellie’s eavesdropping.When violence erupts in the lovely Peck house, the prime suspect seems obvious. Nellie knows who the real murderer is, but is soon silenced by fear and the threat of scandal. The truth, as she sees it, is shocking and unthinkable, and with everyone’s eyes riveted on her in the courtroom, Nellie finds herself seized with doubt.No one will listen. No one believes her, and a man’s life hangs in the balance. A stunning evocation of innocence lost, Light from a Distant Star stands as an incredibly moving and powerful novel from one of America's finest writers.",
  "genres": [
    "Fiction",
    "Mystery",
    "Young Adult",
    "Coming Of Age",
    "Historical Fiction",
    "Contemporary",
    "Literary Fiction"
  ],
  "author": "Mary McGarry Morris",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/10574574-light-from-a-distant-star"
}