{
  "title": "Winter Collection",
  "description": "Six Award-Winning Authors have contributed brand new stories to A Timeless Romance Anthology: Winter Collection. A collection unlike any other, readers will love this compilation of six sweet historical romance novellas, set in varying eras, yet all with one thing in common: Romance.The Road to Cavan Town by Sarah M. Eden, set in 1864 Ireland, combines Eden’s sense of humor with her signature sweet romance. Alice Wheatley walks each weekend into town, accompanied by Isaac Dancy. And while Alice finds herself falling in love with the gentleman, unfortunately he has his eyes set on the belle of the town, Miss Sophia Kilchrest. Alice must find a way to turn Isaac’s eyes toward her.Regency author Heidi Ashworth’s delightful story, It Happened Twelfth Night, set in England 1812, follows Luisa Darlington who discovers the man of her dreams, Percy Brooksby, isn’t in love with her as much as she thought he was. When Percy’s friend, the mysterious foreigner, Mr. Flynn, visits for the twelfth night holiday, he promptly sweeps Luisa off her feet, quite literally. Luisa is left catching her breath in more ways than one.An Unexpected Proposal by Annette Lyon is a captivating romantic novella, set in remote Wood Camp, the snowy canyon of Logan, Utah, 1880. When Caroline Simpson is forced to thwart the aggressive advances of Mr. Butch Larson, she discovers that her long-time friend, James, has genuine affection for her. But as stubborn as Caroline is, she minimizes the feelings he’s awakened in her, and it takes almost losing James to admit her true feelings for him.In Joyce Di Pastena’s charming medieval story, Caroles on the Green, we enter England of 1151, in which Lady Isabel has a dilemma. She promises herself that she’ll marry the man who sent a ring hidden in her pastry since the man she truly loves, Sir Lucian de Warrene, has proved to be impossible and exasperating. To forget him, Isabel sets her eyes on other eligible men, only to face another confrontation with Lucian—who isn’t about to back off and leave her to her newest plot.Donna Hatch’s enchanting novella, A Winter’s Knight, begins when Clarissa Fairchild’s coach just happens to break down in front of the most forbidding estate in the county, that of Wyckburg Castle, a place where young brides have been murdered for generations by their husbands. Clarissa is horrified yet curious all in the same breath. When she meets widower Christopher de Champs, Earl of Wyckburg, she must decide if she should flee or uncover the greatest secret in the county about her handsome rescuer. In Heather B. Moore’s exciting turn-of-the-century story, A Fortunate Exile, Lila Townsend finds herself the victim of a broken heart—broken by the most notorious bachelor in 1901 New York City. If that isn’t bad enough, her father sends her to Aunt Eugenia’s remote farm where Lila must wait for her father’s anger to subside and the gossip columns to find new fodder. When Lila meets her aunt’s boarder, Peter Weathers, she discovers a man who isn’t afraid to stand up to her formidable family and take a chance on a woman with a sullied reputation.",
  "genres": [
    "Romance",
    "Historical Fiction",
    "Christmas",
    "Clean Romance",
    "Historical Romance",
    "Historical",
    "Regency"
  ],
  "author": "Sarah M. Eden",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/15789526-winter-collection"
}