{
  "title": "The Christmas Kid: And Other Brooklyn Stories",
  "description": "Never before collected in one volume, here are Pete Hamill's stories about Brooklyn, the borough in which he was born and grew up, and the one closest to his heart.A young boy with a mysterious past forever transforms the lives of the neighborhood toughs. A man returns to his old haunts to avenge the death of his brother. A couple chooses to embrace their memories of a bygone era rather than live in a diminished future.These are stories of a New York almost lost but not forgotten. They read like messages from a vanished age, brimming over with nostalgia (which Hamill has called the most common New York emotion), for the world after the war, the city before heroin and crack, the days of the Dodgers and Giants, even, for some, the world of the Depression.Full of pieces that have been unavailable for years, this collection is classic Hamill -- a must-read for his fans, for those who love New York, and for anyone who seeks to understand the world today through the lens of the world that once was.The Christmas kid --The price of love --A death in the family --Wishes --The love of his life --Good-bye --Changing of the guard --Footsteps --A poet long ago --The car --Just the facts, ma'am --6-6-44 --The trial of Red Dano --Leaving paradise --Lullaby of Birdland --The boarder --The men in black raincoats --The radio doctor --The challenge --A hero of the war --The final score --Gone --You say tomato, and ... --'S wonderful --The warrior's son --The second summer --The sunset pool --The lasting gift --The man with the blue guitar --The hitter bag --Trouble --The home country --The waiting game --The home run --Up the roof --The book signing",
  "genres": [
    "Short Stories",
    "Christmas",
    "Fiction",
    "New York",
    "American",
    "Collections",
    "Audiobook"
  ],
  "author": "Pete Hamill",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/15789723-the-christmas-kid"
}