{
  "title": "SANTA MONICA DISPOSAL & SALVAGE",
  "description": "Praise from Marge Piercy: \"Penny Perry’s SANTA MONICA DISPOSAL & SALVAGE is a powerful and moving collection of poems that form a narrative of loss and survival. When the poet was only sixteen, her mother died suddenly and her father abandoned her. She had to take care of herself, cook, clean, learn everything she had been protected from – and she did. Her attitude is incredibly nonjudgmental in these poems rich in detail, grounded in a place and time. They are dense with specifics but flow in carefully crafted effortless-seeming narrative.\" Praise from Diane Wakoski: \"I loved everything about Penny Perry's SANTA MONICA DISPOSAL & SALVAGE. The vivid details of place, period, people, the rich linking narrative, and most of all the sense of poetry being teased out of the everday world imposed on the immigrant experience of her grandparents, the echoes of the holocaust, the odd snazzy world of movie dominated California before digitized reality usurped it. . .I who recognize personality in art was completely won over by these poems.\" In Santa Monica Disposal & Salvage -- her first collection of poetry -- Penny Perry links 34 autobiographical poems into a stirring memoir from a famous beach town that is anything but postcard perfect. Here, aging movie stars peer through curtains at tourists as the narrator's parents -- an Irish junkman and a Jewish New Yorker -- struggle to carve out a life in the land of orange trees, perennial sun and cultural divides. In her journey to adulthood, the young woman discovers a knack for salvage and an ability to see the true beauty of a place everyone wants to visit. Praise from Steve Kowit: \"The poems in Santa Monica Disposal & Salvage create the moving story of the author's difficult and troubled childhood and adolescence. The family portraits are sharply drawn and the story that emerges utterly believable and compelling. \"Penny Perry's poetry -- graceful, engaging and free of rhetorical excess -- allows her tale to unfold much the way it would in any captivating prose memoir. \"Santa Monica Disposal & Salvage is powerful, precise, and a book you will not soon forget.\"",
  "genres": [],
  "author": "Penny Perry",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/15789574-santa-monica-disposal-salvage"
}