{
  "title": "The Time Traveler's Apprentice",
  "description": "Simon Grant has an unlikely friend in Professor Moira Ananke, whom he met while visiting the museum where she works. One day, while looking through dusty bookshelves he comes upon a series of black, leather journals. He quickly becomes engrossed in reading her accounts of archaeological digging at Ramses' tomb in Egypt's Valley of the Kings in 1995, excavating ancient Indian cities at Harappa in 1986. His attention is drawn to a dozen more journals stretching along the Field Notes from the Discovery of Tutankhamen's Tomb, 1922, Finding Troy, 1871, Work with Johannes Burkhardt, 1812. Simon glances toward his mentor who silently watches him take down several books and scan their pages. They are what they appear to be--her personal notes from excavations stretching back nearly 200 years. So begins Simon's introduction to time travel. Professor Ananke is a Master Time Traveler. She agrees to accept Simon as her apprentice, to teach him the secrets of time travel. After a few brief practice trips, Simon feels he is beginning to learn the tricks of this dangerous business. But one day, while photographing a mysterious medieval manuscript, he is grabbed and thrown through time under no control of his own. Simon lands, shaken and confused, in a medieval wood in Yorkshire, England. He is discovered by a young lady, Bryn Berengar, who involves him in a dangerous and suspenseful mystery tied to the murder of Thomas Becket. Their search for the manuscript that provides clues to the mystery exposes them to many dangers, including being poisoned by monk's hood, locked in a tower room with a corpse, and fighting a desperate knight with a secret to hide. They travel to Carlisle Castle to thwart a plot to overthrow King Henry II and Simon finds the fencing lessons he took at the local youth bureau take on great importance as he fights for his life. Perhaps most dangerous however, is the relationship he is developing with Bryn.",
  "genres": [
    "Time Travel",
    "Science Fiction",
    "Fantasy",
    "Historical Fiction"
  ],
  "author": "Kelly Grant",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/10575140-the-time-traveler-s-apprentice"
}