{
  "title": "Sister Mine",
  "description": "Nalo Hopkinson--winner of the John W. Campbell Award, the Sunburst Award, and the World Fantasy award (among others), and lauded as one of our \"most inventive and brilliant writers\" (New York Post)--returns with a new work. With her singular voice and characteristic sharp insight, she explores the relationship between two sisters in this richly textured and deeply moving novel . . . We'd had to be cut free of our mother's womb. She'd never have been able to push the two-headed sport that was me and Abby out the usual way. Abby and I were fused, you see. Conjoined twins. Abby's head, torso, and left arm protruded from my chest. But here's the real kicker; Abby had the magic, I didn't. Far as the Family was concerned, Abby was one of them, though cursed, as I was, with the tragic flaw of mortality.Now adults, Makeda and Abby still share their childhood home. The surgery to separate the two girls gave Abby a permanent limp, but left Makeda with what feels like an even worse deformity: no mojo. The daughters of a celestial demigod and a human woman, Makeda and Abby were raised by their magical father, the god of growing things—a highly unusual childhood that made them extremely close. Ever since Abby's magical talent began to develop, though, in the form of an unearthly singing voice, the sisters have become increasingly distant.Today, Makeda has decided it's high time to move out and make her own life among the other nonmagical, claypicken humans—after all, she's one of them. In Cheerful Rest, a run-down warehouse space, Makeda finds exactly what she's been looking for: an opportunity to live apart from Abby and begin building her own independent life. There's even a resident band, led by the charismatic (and attractive) building superintendent.But when her father goes missing, Makeda will have to discover her own talent—and reconcile with Abby—if she's to have a hope of saving him . . .",
  "genres": [
    "Fantasy",
    "Fiction",
    "Urban Fantasy",
    "Speculative Fiction",
    "Magical Realism",
    "Audiobook",
    "Science Fiction"
  ],
  "author": "Nalo Hopkinson",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/15790940-sister-mine"
}