{
  "title": "Banished: Surviving My Years in the Westboro Baptist Church",
  "description": "Banished is an eye-opening, deeply personal account of life inside the cult known as the Westboro Baptist Church, as well as a fascinating story of adaptation and perseverance.You've likely heard of the Westboro Baptist Church. Perhaps you've seen their pickets on the news, the members holding signs with messages that are too offensive to copy here, protesting at events such as the funerals of soldiers, the 9-year old victim of the recent Tucson shooting, and Elizabeth Edwards, all in front of their grieving families. The WBC is fervently anti-gay, anti-Semitic, and anti- practically everything and everyone. And they aren't going anywhere: in March, the U.S. Supreme Court ruled in favor of the WBC's right to picket funerals.Since no organized religion will claim affiliation with the WBC, it's perhaps more accurate to think of them as a cult. Lauren Drain was thrust into that cult at the age of 15, and then spat back out again seven years later.Lauren spent her early years enjoying a normal life with her family in Florida. But when her formerly liberal and secular father set out to produce a documentary about the WBC, his detached interest gradually evolved into fascination, and he moved the entire family to Kansas to join the church and live on their compound. Over the next seven years, Lauren fully assimilated their extreme beliefs, and became a member of the church and an active and vocal picketer. But as she matured and began to challenge some of the church's tenets, she was unceremoniously cast out from the church and permanently cut off from her family and from everyone else she knew and loved.Banished is the story of Lauren's fight to find herself amidst dramatic changes in a world of extremists and a life in exile.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Religion",
    "Biography",
    "Cults",
    "Autobiography",
    "Biography Memoir"
  ],
  "author": "Lauren Drain",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/15791350-banished"
}