{
  "title": "Sober Mercies: How Love Caught Up with a Christian Drunk",
  "description": "Where do you turn for hope when you already have the answer--but the answer isn't working?As a long-time Christian, Heather Kopp never expected to become an out-of-control alcoholic who kept private stashes of booze all over the place--tucked behind books in her study, zipped into a special compartment in her oversized purse, at the back of her closet stuffed inside her boots.Even as her career and marriage teetered on the brink, Kopp couldn't get a grip, desperately hiding the true extent of her drinking from the rest of the world--her husband included. During the day she wrote books about God and prayer and family. At night she'd locked herself in her bathroom to guzzle chardonnay.For her, as for many Christians who struggle with addiction, overwhelming shame and confusion only made things worse. Why wasn't her faith enough to save her? Why didn't repentance, Bible reading and prayer work? Where was God?Meanwhile, as she watched in horror, her grown son descended into his own nightmare of drugs and alcohol. She feared for his life, yet she couldn't stop drinking long enough to help him--or find a way out for herself.Until the day everything changed.Engaging, funny and bracingly honest, Kopp shares her remarkable journey into darkness...and back to the light again. Her story reveals the unique challenges and spiritual conundrums Christians face when they become ensnared in an addiction, and the redemption that's possible when we finally reach the end of ourselves.If you love Jesus but shop too much, drink too much, eat too much, crush on men who aren't your husband, or otherwise fixate on doing things you hate but can't stop doing, SOBER MERCIES is for you.As you follow Kopp's sincere, stumbling journey toward freedom and a deeply satisfying relationship with God, you'll find renewed hope--and practical steps of recovery--for your own journey.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Christian",
    "Biography",
    "Christianity",
    "Religion",
    "Mental Health"
  ],
  "author": "Heather Harpham Kopp",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/15791165-sober-mercies"
}