{
  "title": "The Breeders",
  "description": "“When the Breeders come for ya, there ain't no escape. They strap ya to a bed and all ya hear is the thud of your heart and the cries of your friends as they wheel ya down to hell. Then the doctors come. You squeeze your eyes shut and pray you can forget. But ya never do.”  Sixteen-year-old Riley Meemick is one of the world's last free girls. When Riley was born, her mother escaped the Breeders, the group of doctors using cruel experiments to bolster the dwindling human race. Her parents do everything possible to keep her from their clutches-- moving from one desolate farm after another to escape the Breeders' long reach. The Breeders control everything- the local war lords, the remaining factories, the fuel. They have unchecked power in this lawless society. And they're hunting Riley.  When the local Sheriff abducts the adult members of her family and hands her mother over to the Breeders, Riley and her eight-year-old brother, Ethan, hiding in a shelter, are left to starve. Then Clay arrives, the handsome gunslinger who seems determined to help to make up for past sins. The problem is Clay thinks Riley is a bender-- a genderless mutation, neither male nor female. As Riley's affection for Clay grows she wonders can she trust Clay with her secret and risk her freedom?  The three embark on a journey across the scarred remains of New Mexico-- escaping the Riders who use human sacrifice to appease their Good Mother, various men scrambling for luck, and a deranged lone survivor of a plague. When Riley is forced into the Breeder's hospital, she learns the horrible fate of her mother—a fate she'll share unless she can find a way out.   The Breeders Series  Prequel A Breeders Story Book 1: The Breeders",
  "genres": [
    "Dystopia",
    "Young Adult",
    "Science Fiction",
    "Romance",
    "Fantasy",
    "Fiction",
    "Horror"
  ],
  "author": "Katie French",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/15791488-the-breeders"
}