{
  "title": "Dangerous Tastes: The Story of Spices",
  "description": "Spices and aromatics―the powerful, pleasurable, sensual ingredients used in foods, drinks, scented oils, perfumes, cosmetics, and drugs―have long been some of the most sought-after substances in the course of human history. In various forms, spices have served as appetizers, digestives, antiseptics, therapeutics, tonics, and aphrodisiacs. Dangerous Tastes explores the captivating history of spices and the fascination that they have aroused in us, and the roads and seaways by which trade in spices has gradually grown. Andrew Dalby, who has gathered information from sources in many languages, explores each spice, interweaving its general history with the story of its discovery and various uses.Dalby concentrates on traditional spices that are still part of world cinnamon, cloves, ginger, pepper, saffron, and chili. He also discusses aromatics that are now little used in food but still belong to the spice trade and to traditional frankincense, myrrh, aloes-wood, balsam of Mecca. In addition, Dalby considers spices that were once important but that now are almost long pepper, cubebs, grains of Paradise.Dangerous Tastes relates how the Aztecs, who enjoyed drinking hot chocolate flavored with chili and vanilla, sometimes added annatto (a red dye) to the drink. This not only contributed to the flavor but colored the drinker's mouth red, a reminder that drinking cacao was, in Aztec thought, parallel with drinking blood. In the section on ambergris, Dalby tells how different cultures explained the origin of this Arabs and Persians variously thought of it as solidified sea spray, a resin that sprung from the depths of the sea, or a fungus that grows on the sea bed as truffles grow on the roots of trees. Some Chinese believed it was the spittle of sleeping dragons. Dalby has assembled a wealth of absorbing information into a fertile human history that spreads outward with the expansion of human knowledge of spices worldwide.",
  "genres": [
    "Food",
    "History",
    "Nonfiction",
    "Cooking",
    "Food History",
    "Cookbooks",
    "Nature"
  ],
  "author": "Andrew Dalby",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/1579231.Dangerous_Tastes"
}