{
  "title": "Time",
  "description": "Hailed by Arthur C. Clarke as \"a major new talent,\" Stephen Baxter is one of the most gifted writers to appear in the last decade. His stunning novels combine state-of-the-art scientific speculation with nonstop adventure on a cosmic scale, continuing the grand tradition of science fiction pioneered by such giants as Isaac Asimov and Robert E. Heinlein.Now the multi-award-winning author gives us his most ambitious and accomplished novel yet. Audaciously conceived, brilliantly executed, it is nothing less than a masterpiece--an unforgettable race through and against time itself, with the fate of the universe and all mankind hanging in the balance.The year is 2010. More than a century of ecological damage, industrial and technological expansion, and unchecked population growth has left the Earth on the brink of devastation. But as the world's governments turn inward, one man dares to gamble on a bolder, brighter future. That man--Reid Malenfant--has a very different solution to the problems plaguing the the exploration and colonization of space.Battling national sabotage and international outcry, Malenfant's bootstrap company builds a spacecraft, plots its course, and trains the genetically enhanced Sheena 5 for her one-way journey. As apocalyptic riots sweep the globe, Malenfant launches the rocket. But Sheena has plans of her own. And even as she sets them in motion, the situation on Earth grows more desperate and violent.Now Malenfant--together with a brilliant but disturbed mathematician, a child prodigy, and his ex-wife--must gamble the very existence of time and space on a single desperate throw of the dice. The odds are a trillion to one against him . . .Or are they?",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Time Travel",
    "Hard Science Fiction",
    "Space Opera",
    "Fantasy",
    "Science Fiction Fantasy"
  ],
  "author": "Stephen Baxter",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/100683.Time"
}