{
  "title": "The Mad Scientist's Guide to World Domination: Original Short Fiction for the Modern Evil Genius",
  "description": "From Victor Frankenstein to Lex Luthor, from Dr. Moreau to Dr. Doom, readers have long been fascinated by insane plans for world domination and the madmen who devise them. Typically, we see these villains through the eyes of good guys. This anthology, however, explores the world of mad scientists and evil geniuses—from their own wonderfully twisted point of view. An all-star roster of bestselling authors—including Diana Gabaldon, Daniel Wilson, Austin Grossman, Naomi Novik, and Seanan McGuire ... twenty-two great storytellers, all told—have produced a fabulous assortment of stories, guaranteed to provide readers with hour after hour of high-octane entertainment born of the most megalomaniacal mayhem imaginable. Everybody loves villains. They’re bad; they always stir the pot; they’re much more fun than the good guys, even if we want to see the good guys win. Their fiendish schemes, maniacal laughter, and limitless ambition are legendary, but what lies behind those crazy eyes and wicked grins? How—and why—do they commit these nefarious deeds? And why are they so set on taking over the world? If you've ever asked yourself any of these questions, you’re in luck: It’s finally time for the madmen’s side of the story.Between each chapter falls a single-page essay by the editor, by way of introduction to the story ahead; they have titles of their own, but all contain spoilers, so are not listed here (they can be found on the Internet Science Fiction Database if desired). All individual works in this anthology are in short story form, with the exception of Diana Gabaldon's 80-page Outlander novella, and unless otherwise noted, were first published within. CONTENTS Foreword - Chris Claremont, The Mad Scientist's Guide to World Domination: Original Short Fiction for the Modern Evil Genius (p9)01 - Austin Grossman, Professor Incognito Apologizes: An Itemized List (p16)02 - Harry Turtledove, Father of the Groom (p28)03 - Seanan McGuire, Laughter at the Academy: A Field Study in the Genesis of Schizotypal Creative Genius Personality Disorder (SCGPD) (p38)04 - David D. Levine, Letter to the Editor (p52)05 - Jeremiah Tolbert, Instead of a Loving Heart (2004, p59)06 - Daniel H. Wilson, The Executor (p68)07 - Heather Lindsley, The Angel of Death Has a Business Plan (p83)08 - Dave Wolverton (as David Farland), Homo Perfectus (p96)09 - L.A. Banks, Ancient Equations (p108)10 - Alan Dean Foster, Rural Singularity (p123)11 - Genevieve Valentine, Captain Justice Saves the Day (p133)12 - Theodora Goss, The Mad Scientist's Daughter (2010, p142)13 - Diana Gabaldon, The Space Between (2012 Outlander novella, p161)14 - Carrie Vaughn, Harry and Marlowe Meet the Founder of the Aetherian Revolution (p245)15 - Laird Barron, Blood and Stardust (p261)16 - L.E. Modesitt Jr., A More Perfect Union (p276)17 - Naomi Novik, Rocks Fall (p289)18 - Mary Robinette Kowal, We Interrupt This Broadcast (Lady Astronaut short story, p298)19 - Marjorie M. Liu, The Last Dignity of Man (p306)20 - Jeffrey Ford, The Pittsburgh Technology (p328)21 - Grady Hendrix, Mofongo Knows (p341)22 - Ben H. Winters, The Food Taster's Boy (p357)",
  "genres": [
    "Science Fiction",
    "Short Stories",
    "Anthologies",
    "Fantasy",
    "Fiction",
    "Horror",
    "Humor"
  ],
  "author": "John Joseph Adams",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/15793066-the-mad-scientist-s-guide-to-world-domination"
}