{
  "title": "The Story of Spanish",
  "description": "Just how did a dialect spoken by a handful of shepherds in Northern Spain become the world's second most spoken language, the official language of twenty-one countries on two continents, and the unofficial second language of the United States? Jean-Benoît Nadeau and Julie Barlow, the husband-and-wife team who chronicled the history of the French language in The Story of French, now look at the roots and spread of modern Spanish. Full of surprises and honed in Nadeau and Barlow's trademark style, combining personal anecdote, reflections, and deep research, The Story of Spanish is the first full biography of a language that shaped the world we know, and the only global language with two names—Spanish and Castilian.The story starts when the ancient Phoenicians set their sights on \"The Land of the Rabbits,\" Spain's original name, which the Romans pronounced as Hispania. The Spanish language would pick up bits of Germanic culture, a lot of Arabic, and even some French on its way to taking modern form just as it was about to colonize a New World. Through characters like Queen Isabella, Christopher Columbus, Cervantes, and Goya, The Story of Spanish shows how Spain's Golden Age, the Mexican Miracle, and the Latin American Boom helped shape the destiny of the language. Other, more somber episodes, also contributed, like the Spanish Inquisition, the expulsion of Spain's Jews, the destruction of native cultures, the political instability in Latin America, and the dictatorship of Franco.The Story of Spanish shows there is much more to Spanish than tacos, flamenco, and bullfighting. It explains how the United States developed its Hispanic personality from the time of the Spanish conquistadors to Latin American immigration and telenovelas. It also makes clear how fundamentally Spanish many American cultural artifacts and customs actually are, including the dollar sign, barbecues, ranching, and cowboy culture. The authors give us a passionate and intriguing chronicle of a vibrant language that thrived through conquests and setbacks to become the tongue of Pedro Almodóvar and Gabriel García Márquez, of tango and ballroom dancing, of millions of Americans and hundreds of millions of people throughout the world.",
  "genres": [
    "History",
    "Nonfiction",
    "Language",
    "Linguistics",
    "Spanish Literature",
    "Spain",
    "Adult"
  ],
  "author": "Jean-Benoît Nadeau",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/15793078-the-story-of-spanish"
}