{
  "title": "Follow Her Home",
  "description": "A stunning, edgy debut introducing Juniper Song, an amateur sleuth taking on the darkness in the veins of L.A. with razor-sharp wit and a breaking heart.Juniper Song knows secrets–how to keep them and how to search them out.  As a girl, noir fiction was her favorite escape, and Philip Marlowe has always been her literary idol. So when her friend Luke asks her to investigate a possible affair between his father and a young employee, Juniper (or \"Song\" as her friends call her) finds an opportunity to play detective. Driving through L.A.'s side streets, following leads, tailing suspects-it all appeals to Song's romantic ideal of the noir hero. But when she's knocked out while investigating a mysterious car and finds a body in her own trunk, Song lurches back to the real L.A., becoming embroiled in a crime that goes far beyond role play. What's more, this isn't the first time Song has stuck her nose in other people's business. As she fights to discover the truth about her friend's family, Song reveals one of her own deeply hidden secrets, something dark and damaging, urging her to see the current mystery through, to rectify the mistakes of her past life.A dazzling debut from fresh new talent Steph Cha, featuring a strong, modern, sharply observant heroine with an unforgettable voice, Follow Her Home takes readers through dangerous twists and turns, beyond the glittering high-rises and freeways of L.A. on a case that will stay with them long after the final page.Praise for Follow Her Home “Stephanie Cha's brilliant debut is as Noir as Old Nick's sense of humour. Compelling from first to last page, she takes on contemporary L.A., sweeping the reader through Chandler's twilight, heartbroken city from mansions to faux K-town hostess bars.  L.A. Noir at its finest.” -- Denise Mina, author of The Dead Hour \"Follow Her Home takes a fresh trip down the sunny, dark streets of Los Angeles, and Juniper Song is a great guide - young, sharp, and worldly-wise. Keenly observed and deeply felt, the story slowly got under my skin. I couldn't put it down.\" - Meg Gardiner, Edgar Award-winng author of Ransom River “In a glittery L.A. of pretty, privileged twentysomethings, Stephanie Cha's Follow Her Home opens like a playful homage to Raymond Chandler but deepens into something darker:  an utterly 21st-century  ode to sisterhood in the face of crime.  A fast-paced thriller told in smart, sparkling prose, Follow Her Home is a moving exploration of mothers and daughters, men and women, immigrant history, loss, and hope.” –Joy Castro, author of Hell or High Water",
  "genres": [
    "Mystery",
    "Fiction",
    "Noir",
    "Crime",
    "Thriller",
    "Mystery Thriller",
    "Contemporary"
  ],
  "author": "Steph Cha",
  "average_rating": "3.41",
  "url": "https://www.goodreads.com/book/show/15793162-follow-her-home"
}