{
  "title": "The Message of You: Turn Your Life Story into a Money-Making Speaking Career",
  "description": "A step-by-step handbook that teaches readers to find the extraordinary stories tucked deep within them to make a difference in the lives of others—and to get paid—as a motivational speakerTHE MESSAGE OF YOU begins with a simple belief - that your greatest speech already exists and that it has already been delivered in front of a live audience masterfully and powerfully by you. Best-selling author and international comic, Judy Carter sets out to prove that THE MESSAGE OF YOU is in the advice you give to your friends; in the lessons you teach your children; in the stories you tell your family. It's expressed through the volunteer work you do, the way you run your business, the way you turned your messes into successes. THE MESSAGE OF YOU is a distillation of all of your experiences, both personal and professional, that form the narrative meaning of your life. A meaning that you can develop into a well-written, funny speech to inspire audiences, enhance your current profession, and launch a successful money making career as a professional speaker. In Part One of the book, Judy leads you through a series of in-depth exercises meant to mine your personal and professional experiences for stories that establish your qualifications, your problem/solutions, your action steps and your methodology. In Part Two, Judy has created a six-step structure for writing an entertaining and informative speech, guiding you through each step in detail. But the real bonus of THE MESSAGE OF YOU is that Judy is a comic. Her \"Comedy Pass\" chapter takes you through simple but effective comedy writing techniques that will transform even a flat PowerPoint snoozer into a knee-slapping showstopper of a keynote. Once your speech is well-written and funny, Judy takes you through Part Three, teaching you how to take your message to the masses with inexpensive but essential marketing tips. The Message of You offers an accessible approach, big picture guidance, and nitty-gritty nuts and bolts of sound advice. Judy has been a comedy and speaking coach for over twenty years. She's a firm believer that how you present your ideas is just as important as the ideas themselves. She knows that humor and strong content are the missing ingredients in most speeches and her book, THE MESSAGE OF YOU helps you discover both your message and your comedic voice by taking you through the same process she uses to coach her private clients.",
  "genres": [
    "Self Help",
    "Business",
    "Communication",
    "Nonfiction",
    "Comedy",
    "Writing"
  ],
  "author": "Judy Carter",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/15793156-the-message-of-you"
}