{
  "title": "The Starboard Sea",
  "description": "\"A rich, quietly artful novel that is bound for deep water, with questions of beauty, power and spiritual navigation as its main concerns. The title refers not to the right side of a boat but to the right course through life, and the immense difficulty of finding and following it.\"--Janet Maslin, The New York TimesA powerful first novel about life and death, friendship and love, as one young man must navigate the depths of his emotions.JASON PROSPER grew up in the elite world of Manhattan penthouses, Maine summer estates, old-boy prep schools, and exclusive sailing clubs. A smart, athletic teenager, Jason maintains a healthy, humorous disdain for the trappings of affluence, preferring to spend afternoons sailing with Cal, his best friend and boarding-school roommate. When Cal commits suicide during their junior year at Kensington Prep, Jason is devastated by the loss and transfers to Bellingham Academy. There, he meets Aidan, a fellow student with her own troubled past. They embark on a tender, awkward, deeply emotional relationship.When a major hurricane hits the New England coast, the destruction it causes brings with it another upheaval in Jason's life, forcing him to make sense of a terrible secret that has been buried by the boys he considers his friends.Set against the backdrop of the 1987 stock market collapse, The Starboard Sea Amber Dermont is an examination of the abuses of class privilege, the mutability of sexual desire, the thrill and risk of competitive sailing, and the adult cost of teenage recklessness. It is a powerful and provocative novel about a young man finding his moral center, trying to forgive himself, and accepting the gift of love.",
  "genres": [
    "Fiction",
    "Coming Of Age",
    "Historical Fiction",
    "Young Adult",
    "Book Club",
    "Boarding School",
    "Contemporary"
  ],
  "author": "Amber Dermont",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/15793274-the-starboard-sea"
}