{
  "title": "Picking Up: On the Streets and Behind the Trucks with the Sanitation Workers of New York City",
  "description": "America's largest city generates garbage in torrents―11,000 tons from households each day on average. But New Yorkers don't give it much attention. They leave their trash on the curb or drop it in a litter basket, and promptly forget about it. And why not? On a schedule so regular you could almost set your watch by it, someone always comes to take it away. But who , exactly, is that someone? And why is he―or she―so unknown? In Picking Up , the anthropologist Robin Nagle introduces us to the men and women of New York City's Department of Sanitation and makes clear why this small army of uniformed workers is the most important labor force on the streets. Seeking to understand every aspect of the Department's mission, Nagle accompanied crews on their routes, questioned supervisors and commissioners, and listened to story after story about blizzards, hazardous wastes, and the insults of everyday New Yorkers. But the more time she spent with the DSNY, the more Nagle realized that observing wasn't quite enough― so she joined the force herself . Driving the hulking trucks, she obtained an insider's perspective on the complex kinships, arcane rules, and obscure lingo unique to the realm of sanitation workers. Nagle chronicles New York City's four-hundred-year struggle with trash, and traces the city's waste-management efforts from a time when filth overwhelmed the streets to the far more rigorous practices of today, when the Big Apple is as clean as it's ever been. Throughout, Nagle reveals the many unexpected ways in which sanitation workers stand between our seemingly well-ordered lives and the sea of refuse that would otherwise overwhelm us. In the process, she changes the way we understand cities―and ourselves within them.",
  "genres": [
    "Nonfiction",
    "History",
    "Anthropology",
    "New York",
    "Sociology",
    "Urban Planning",
    "Labor"
  ],
  "author": "Robin Nagle",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/15793496-picking-up"
}