{
  "title": "Frankenstein's Cat: Cuddling Up to Biotech's Brave New Beasts",
  "description": "For centuries, we've toyed with our creature companions, breeding dogs that herd and hunt, housecats that look like tigers, and teacup pigs that fit snugly in our handbags. But what happens when we take animal alteration a step further, engineering a cat that glows green under ultraviolet light or cloning the beloved family Labrador? Science has given us a whole new toolbox for tinkering with life. How are we using it?In Frankenstein's Cat, the journalist Emily Anthes takes us from petri dish to pet store as she explores how biotechnology is shaping the future of our furry and feathered friends. As she ventures from bucolic barnyards to a \"frozen zoo\" where scientists are storing DNA from the planet's most exotic creatures, she discovers how we can use cloning to protect endangered species, craft prosthetics to save injured animals, and employ genetic engineering to supply farms with disease-resistant livestock. Along the way, we meet some of the animals that are ushering in this astonishing age of enhancement, including sensor-wearing seals, cyborg beetles, a bionic bulldog, and the world's first cloned cat.Through her encounters with scientists, conservationists, ethicists, and entrepreneurs, Anthes reveals that while some of our interventions may be trivial (behold: the GloFish), others could improve the lives of many species-including our own. So what does biotechnology really mean for the world's wild things? And what do our brave new beasts tell us about ourselves?With keen insight and her trademark spunk, Anthes highlights both the peril and the promise of our scientific superpowers, taking us on an adventure into a world where our grandest science fiction fantasies are fast becoming reality.",
  "genres": [
    "Science",
    "Nonfiction",
    "Biology",
    "Animals",
    "Technology",
    "Genetics",
    "Audiobook"
  ],
  "author": "Emily Anthes",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/15793536-frankenstein-s-cat"
}