{
  "title": "Rookie Yearbook One",
  "description": "The first print publication edited by Tavi Gevinson, the editor in chief of Rookie, the website for teenage girlsTavi Gevinson started her personal blog, Style Rookie, in 2008, when she was eleven years old. It was a place where, from the confines of her bedroom in the suburbs, she could write about personal style and chronicle the development of her own. Within two years, the blog was averaging fifty thousand hits per day. Soon fashion designers were flying her around the world to attend and write about fashion shows, and to be a guest of honor at their parties.     Soon Tavi’s interests grew beyond fashion, into culture and art and, especially, feminism. In September 2011, when she was fifteen, she launched Rookie, a website for girls like her: teenagers who are interested in fashion and beauty but also in dissecting the culture around them through a uniquely teen-girl lens. Rookie broke one million page views within its first six days. Rookie Yearbook One collects articles, interviews, photo editorials, and illustrations from the highly praised and hugely popular online magazine.      In its first year, Rookie has established a large inclusive international community of avid readers. In addition to its fifty-plus regular writers, photographers, and illustrators (many of whom are teenage girls themselves), Rookie’s contributors and interviewees have included prominent makers of popular culture such as Lena Dunham, Miranda July, Joss Whedon, Jon Hamm, Zooey Deschanel, David Sedaris, Elle Fanning, Amy Poehler, Paul Rudd, John Waters, Chloe Sevigny, Liz Phair, Dan Savage, JD Samson, Ira Glass, Aubrey Plaza, Daniel Clowes, Carrie Brownstein, Paul Feig, Bethany Cosentino, Kimya Dawson, Fred Armisen, and Winnie Holzman.     As a young teenager, Gevinson couldn’t find what she was looking for in a teen magazine; Rookie is the one she created herself to fill that void. Her coolheaded intellect shines in Rookie, arguably the most intelligent magazine ever made for a teen-girl audience. Gevinson writes with a humble but keen authority on such serious topics as body image, self-esteem, and first encounters with street harassment. She’s equally deft at doling out useful advice, such as how to do a two-minute beehive, or how to deliver an effective bitchface. Rookie’s passionate staffers and faithful readers have helped make Rookie the strong community that it is.     To date, Gevinson has written for Harper’s Bazaar, Jezebel, Lula, and Pop, and is a contributing editor for Garage magazine. She has been profiled in The New York Times and The New Yorker, and has been on the cover of Pop, L’Officiel, Zeit Magazin, and Bust. As a speaker, she has made numerous presentations at venues such as IdeaCity, TEDxTeen, L2 Forum, and the Economist World in 2012 Festival. Last year Lady Gaga called her “the future of journalism.”",
  "genres": [
    "Nonfiction",
    "Feminism",
    "Essays",
    "Art",
    "Fashion",
    "Photography",
    "Pop Culture"
  ],
  "author": "Tavi Gevinson",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/15794592-rookie-yearbook-one"
}