{
  "title": "The Big Truck that Went By: How the World Came to Save Haiti and Left Behind a Disaster",
  "description": "On January 12, 2010, the deadliest earthquake in the history of the Western Hemisphere struck the nation least prepared to handle it. Jonathan M. Katz, the only full-time American news correspondent in Haiti, was inside his house when it buckled along with hundreds of thousands of others. In this visceral, authoritative first-hand account, Katz chronicles the terror of that day, the devastation visited on ordinary Haitians, and how the world reacted to a nation in need.More than half of American adults gave money for Haiti, part of a monumental response totaling $16.3 billion in pledges. But three years later the relief effort has foundered. It’s most basic promises—to build safer housing for the homeless, alleviate severe poverty, and strengthen Haiti to face future disasters—remain unfulfilled. The Big Truck That Went By presents a sharp critique of international aid that defies today’s conventional wisdom; that the way wealthy countries give aid makes poor countries seem irredeemably hopeless, while trapping millions in cycles of privation and catastrophe. Katz follows the money to uncover startling truths about how good intentions go wrong, and what can be done to make aid “smarter.”With coverage of Bill Clinton, who came to help lead the reconstruction; movie-star aid worker Sean Penn; Wyclef Jean; Haiti’s leaders and people alike, Katz weaves a complex, darkly funny, and unexpected portrait of one of the world’s most fascinating countries. The Big Truck That Went By is not only a definitive account of Haiti’s earthquake, but of the world we live in today.",
  "genres": [
    "Nonfiction",
    "History",
    "Politics",
    "International Development",
    "Journalism",
    "Memoir",
    "Book Club"
  ],
  "author": "Jonathan M. Katz",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/15794250-the-big-truck-that-went-by"
}