{
  "title": "Auto-Lexikon / Kfz-Technik + Mechatronik-Allgemein",
  "description": "mit INDEX-Suche von A - Z8500 Fachbegriffe werden definiert (deutsche Erklaerungen (Kraftfahrzeugtechnik) + -Mechatronik-Allgemein (Multimedia Internet EDV Maschinenbau Antriebstechnik Elektronik Telekommunikation Netzwerktechnik Handhabungstechnik Messen-Steuern-Regeln)+Abkuerzungen aus dem Kfz-BereichLeseprobe (Adaptive Cruise Control (Abstandsregeltempomat) {kfz-Technik}: Der Abstandsregeltempomat (Adaptive Cruise Control; ACC) ist ein Fahrerassistenzsystem, aufbauend auf den Geschwindigkeitsregler. ACC bremst und beschleunigt abhängig vom Verkehrsfluss in bestimmten Grenzen selbstständig. Dazu wird mit Hilfe von ACC mit einem Radarsensor der Raum vor dem Fahrzeug überwacht. Entdeckt das System ein langsamer vorausfahrendes Fahrzeug, wird die Geschwindigkeit des eigenen Fahrzeugs so weit reduziert, dass es in einem definierten Abstand bleibt. Ist die Fahrbahn vor dem eigenen Fahrzeug wieder frei, so wird auf die eingestellte Geschwindigkeit beschleunigt.CAN-Bus- System {kfz-Technik}: Die Abkürzung CAN heißt Controller-Area-Network. Das CAN-Bus-System im Fahrzeug ermöglicht die Vernetzung der elektronischen Baugruppen wie Steuergeräte oder intelligente Sensoren. Ein Beispiel hierfür ist der Lenkwinkelsensor. Mit dem CAN-Bus-System wird der Datenaustausch zwischen den Steuergeräten auf einer einheitlichen Plattform durchgeführt. Vorteile des a) -Steuergeräte übergreifende Systeme wie z. B. das ESP sind wirtschaftlicher realisierbar. b) -Systemerweiterungen sind einfacher durchzuführen. c) -Man kann eine systemübergreifende Diagnose über mehrere Steuergeräte zur gleichen Zeit durchführen. Im CAN-Bus erkennt man alle Fehler eindeutig. Mit Hilfe eines internen Fehlermanagementes erhält man eine hohe Datensicherheit.Fahrerassistenzsystem ACDIS (in Aktive Abstandsführung; Active Distance Support) {kfz-Technik}: ACDIS heißt ein Fahrerassistenzsystem von Continental. ACDIS benutzt man zur abstandabhängigen Geschwindigkeitsregelung und zur Einhaltung vorgegebener Tempolimits. Ein eindeutiges Feedback über alle System-Aktivitäten bekommt der Fahrer durch Vibrationsbewegungen des Gaspedals. Der Fahrer wird auch bei deaktiviertem System über einen zu geringen Sicherheitsabstand informiert.Leseprobe Fernsehausstrahlung {Multimedia}Es gibt für Fernsehprogramme drei digitale Ausstrahlungswege, die man für die jeweiligen analogen Verfahren benutzen will. Mit digitalen Sendewegen kann man mehrere Programme und neben SDTV auch HDTV-Programme übertragen. Das Sendesignal nennt man digitales Komponentensignal.Erster digitaler über terrestrische Sender, nach dem DVB-T-Verfahren. Die Datenrate ist gering, die Bildqualität nicht so gut. DVB-T kann man auch für den mobilen Empfang benutzen.Zweiter digitaler über das Kabel mit DVB-C. Man empfängt die Signale zentral, beispielsweise mit Satellit.",
  "genres": [],
  "author": "Markus Wagner",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/15796085-auto-lexikon-kfz-technik-mechatronik-allgemein"
}