{
  "title": "Moore's Mythopoeia, a novel",
  "description": "Everything is perfect.Absolute, faultless perfection… a genuine utopia. There is no disease, no murder, no terrorism, no crime, no age, no violence, no problems. Any kind of issue can be treated with medication – any kind of issue.Everyone is happy.There is no such thing as war, since there is only one nation, one government. There is no such thing as corruption, since politicians wear jumpsuits with their corporate sponsorships advertised clearly. Government and business have merged into a single institution. There is no citizenship, no difference between company, worker and consumer, since everyone is brand; everyone has sold their name to advertise for a company, a product.Everyone is guaranteed 15 minutes of fame – guaranteed.There are no nationalities, no ethnicities, no religious affiliation. Everyone looks the same and thinks the same. Everyone is guaranteed an education, a job, a tranquil life. Everyone is guaranteed a mate and children.All you have to do si go along, make money, purchase products, love each other, stick to your brand, support your company. Any problem has a pill. Any concern a treatment. You can be perfect, with a perfect head of hair, a perfect erection, a perfect figure, a perfect mind.By law, you have to be perfect.The world is so perfect, there is no death…Even if you try, you can’t pull it off. Poor Joseph Moore knows this better than anybody, since he’s tried just about everything. Only, there is something afterwards, a hint of what used to be… there’s a salacious spirit… seriously embittered, waiting for heaven for eons. There can’t be two paradises. When one is found, the other is lost.But maybe there is a way…The last orphan; a telepathic, clairvoyant government operative; a terrorist network made-up of the authors of children’s books; theatrical stray cats; a new Adam and Eve (and their seductive half-sister); capricious cloak and dagger operations; swashbuckling forays; setups and double-triple agents; one hot blonde bombshell of a guardian angel; a psychotropic raid into the heaven’s suburbs; and final duel…Moore’s Mythopoeia is a story in which sci-fi meets the Biblical genesis story, espionage is taken to absurd lengths, action/adventure melds with bodice-rippling love scenes, and one man’s defiance illuminates a uniquely human need for sin.",
  "genres": [],
  "author": "Christopher WunderLee",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/10576750-moore-s-mythopoeia-a-novel"
}