{
  "title": "The Ordinary Acrobat: A Journey into the Wondrous World of the Circus, Past and Present",
  "description": "The extraordinary story of a young man’s plunge into the unique and wonderful world of the circus—taking readers deep into circus history and its renaissance as a contemporary art form, and behind the (tented) walls of France’s most prestigious circus school.When Duncan Wall visited his first nouveau cirque as a college student in Paris, everything about it—the monochromatic costumes, the acrobat singing Simon and Garfunkel, the juggler reciting Proust—was captivating. Soon he was waiting outside stage doors, eagerly chatting with the stars, and attending circuses two or three nights a week. So great was his enthusiasm that a year later he applied on a whim to the training program at the École Nationale des Arts du Cirque—and was, to his surprise, accepted.Sometimes scary and often funny, The Ordinary Acrobat follows the (occasionally literal) collision of one American novice and a host of gifted international students in a rigorous regimen of tumbling, trapeze, juggling, and clowning. Along the way, Wall introduces readers to all the ambition, beauty, and thrills of the circus’s long from hardscrabble beginnings to Gilded Age treasures, and from twentieth-century artistic and economic struggles to its brilliant reemergence in the form of contemporary circus (most prominently through Cirque du Soleil). Readers meet figures past—the father of the circus, Philip Astley; the larger-than-life P. T. Barnum—and present, as Wall seeks lessons from innovative masters including juggler Jérôme Thomas and clown André Riot-Sarcey. As Wall learns, not everyone is destined to run away with the circus—but the institution fascinates just the same.            Brimming with surprises, outsized personalities, and plenty of charm, The Ordinary Acrobat delivers all the excitement and pleasure of the circus ring itself.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "History",
    "Biography",
    "Art",
    "France"
  ],
  "author": "Duncan Wall",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/15796938-the-ordinary-acrobat"
}