{
  "title": "The Romanov Cross",
  "description": "Nearly one hundred years ago, a desperate young woman crawled ashore on a desolate arctic island, carrying a terrible secret and a mysterious, emerald-encrusted cross. A century later, acts of man, nature, and history converge on that same forbidding shore with a power sufficient to shatter civilization as we know it. Army epidemiologist Frank Slater is facing a court-martial, but after his punishment is mysteriously lifted, Slater is offered a job no one else wants—to travel to a small island off the coast of Alaska and investigate a potentially lethal The permafrost has begun to melt, exposing bodies from a colony that was wiped out by the dreaded Spanish flu of 1918. Frank must determine if the thawed remains still carry the deadly virus in their frozen flesh and, if so, ensure that it doesn’t come back to life. Frank and his handpicked team arrive by helicopter, loaded down with high-tech tools, prepared to exhume history. The colony, it transpires, was once settled by a sect devoted to the mad Russian monk Rasputin, but there is even more hiding in the past than Frank’s team is aware of. Any hope of success hinges on their willingness to accept the fact that even their cutting-edge science has its limits—and that the ancient wisdom of the Inuit people who once inhabited this eerie land is as essential as any serum. By the time Frank discovers that his mission has been compromised—crashed by a gang of reckless treasure hunters—he will be in a brutal race against time. With a young, strong-willed Inuit woman by his side, Frank must put a deadly genie back in the bottle before all of humanity pays the price. The Romanov Cross is at once an alternate take on one of history’s most profound mysteries, a love story as unlikely as it is inevitable, and a thriller of heart-stopping, supernatural suspense. With his signature blend of fascinating history and fantastic imagination, critically acclaimed author Robert Masello has once again crafted a terrifying story of past events coming back to haunt the present day . . . and of dark deeds aching to be unearthed.Praise for  The Romanov Cross “In this fascinating, funny, and frightening supernatural thriller, [Robert] Masello skillfully weaves together the story of the deaths of the Russian royal family with the possibility of a new worldwide influenza pandemic. . . . Toss in a pack of slavering wolves, the undead, and a chilling ending, and the result is a terrific, can’t-put-it-down read. Fine prose and plotting help solidify Masello’s position at the top of this crowded subgenre.”— Publishers Weekly “A former Army epidemiologist contends with greedy locals and the harsh Alaskan terrain in order to prevent the recurrence of a deadly pandemic. . . . Masello weaves several disparate genres—medical thriller, historical novel, ghost story—into a coherent whole. A delicious sense of creeping dread permeates the first act, greatly enhanced by its setting in the stark but beautiful landscape of northwestern Alaska. . . . Tense, taut and impossible to put down.”— Kirkus Reviews (starred review)",
  "genres": [
    "Historical Fiction",
    "Thriller",
    "Fiction",
    "Mystery",
    "Mystery Thriller",
    "Russia",
    "Suspense"
  ],
  "author": "Robert Masello",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/15797005-the-romanov-cross"
}