{
  "title": "Storm Kings: The Untold History of America's First Tornado Chasers",
  "description": "Isaac's Storm meets The Age of Wonder in Lee Sandlin's Storm Kings, a riveting tale of the weather's most vicious monster-the super cell tornado-that recreates the origins of meteorology, and the quirky, pioneering, weather-obsessed scientists who helped change America.While tornadoes have occasionally been spotted elsewhere, only the central plains of North America have the perfect conditions for their creation. For the settlers the sight of a funnel cloud was an unearthly event. They called it \"the Storm King\" and their descriptions bordered on the supernatural: it glowed green or red, it whistled or moaned or sang. In Storm Kings, Lee Sandlin retraces America's fascination and unique relationship to tornadoes. From Ben Franklin's early experiments, to \"the great storm debates\" of the nineteenth century, to heartland life in the early twentieth century, Sandlin shows how tornado chasing helped foster the birth of meteorology, recreating with vivid descriptions some of the most devastating storms in America's history, including the \"Tri-State tornado\" of 1925 and the Peshtigo \"fire tornado,\" whose deadly path of destruction was left encased in glass. Drawing on memoirs, letters, eyewitness testimonies, and numerous archives, Sandlin brings to life the forgotten characters and scientists-like James Espy, America's first meteorologist and Corporal John Park Finley, who helped place a network of weather \"spotters\" across the country-that changed a nation, detailing the almost invisible history of The National Weather Service, the settling of the Midwest, and how successive generations came to understand and finally coexist with the spiraling menace that could erase lives and whole towns in an instant.",
  "genres": [
    "History",
    "Nonfiction",
    "Science",
    "Nature",
    "American History",
    "Adventure",
    "Audiobook"
  ],
  "author": "Lee Sandlin",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/15797316-storm-kings"
}