{
  "title": "Blue Lard",
  "description": "The Russian master's most infamous novel, a dystopian fever dream about cloning, alternative histories, and world domination.Vladimir Sorokin’s Blue Lard is the most iconic and iconoclastic Russian novel of the last forty years. Thanks in part to its depiction of Stalin and Khrushchev having sex, which inspired a Putinist youth group to throw shredded copies of the author’s books into an enormous toilet erected in front of Moscow’s Bolshoi Theater, Blue Lard is the novel that tore Sorokin out of the Moscow Conceptualist underground and into the headlines.The book begins in a futuristic laboratory where genetic scientists speak in a Joycean dialect of Russian mixed with Chinese—peppered with ample neologisms—and work to clone famous Russian writers, who are then made to produce texts in the style of their forebears. The goal of this “script-process” is not the texts themselves, but the blue lard that collects in the small of their backs as they write.This substance is to be used to power reactors on the moon—that is, until a sect of devout nationalists breaks in to steal the blue lard, planning to send it back in time to an alternate version of the Soviet Union, one that exists on the margins of a Europe conquered by a long-haired Hitler with the ability to shoot electricity from his hands. What will come of this blue lard? Who will finally make use of its mysterious powers?Blue Lard is a stylistically acrobatic book, translated by Max Lawton into an English idiom just as bizarre as the Russian original. Evoking both Pulp Fiction and the masterpieces of Marquis de Sade, Sorokin’s novel is a brutal, heady trip that annihilates all of its twentieth- (and twenty-first-) century competition in the Russian canon—and that annihilates Russia itself in a resounding act of heavy-metal dissidence.",
  "genres": [
    "Fiction",
    "Russia",
    "Science Fiction",
    "Russian Literature",
    "Fantasy",
    "Novels",
    "Literary Fiction"
  ],
  "author": "Vladimir Sorokin",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/157975976-blue-lard"
}