{
  "title": "Nightside the Long Sun",
  "description": "It has been nearly a decade since the completion of Gene Wolfe's four-volume epic The Book of the New Sun, \"one of the modern masterpieces of imaginative literature - an evocation of a world so far in the future that magic and technology, poetry and science, are indistinguishable, a world heavy with time but not yet bereft of hope, a world brought to life by Mr. Wolfe's unique blend of slightly archaic diction and ever-surprising vocabulary\" (The New York Times Book Review). In the intervening years his award-winning novels and stories have solidified his reputation both in fantasy and science fiction with a cascade of stunning achievements. No sf writer has been more highly and continually praised.Now Wolfe returns to science fiction with a mighty multi-volume mega-novel of mystery, war, and revolution, The Book of the Long Sun, set on a world, the Whorl, existing inside a giant starship sent from Urth to colonize a distant planet. Wolfe's previous work in this future universe has been hailed as a \"major landmark of contemporary American literature\" by Booklist, and \"a masterpiece of science fantasy comparable in importance to the major works of Tolkien and Lewis\" by Publishers Weekly.Enormous in breadth and scope, Wolfe's ambitious new work opens out into a world of wonders, of gods and humans, aliens and machines, and mysterious adventures far out in space and deep inside the human spirit. It is set on a ship-world whose origins are shrouded in legend, ruled by strange gods who appear infrequently to their worshippers on large screens, and peopled by a human race changed by eons of time, yet familiar.Nightside the Long Sun is the beginning of a masterpiece of science fiction for this decade. Life on the Whorl, and the struggles and triumphs of Patera Silk to satisfy the demands of the gods, will captivate readers yearning for something new and different in science fiction, for the magic of the future. The Book of the Long Sun is launched with success.",
  "genres": [
    "Science Fiction",
    "Fantasy",
    "Fiction",
    "Novels",
    "Science Fiction Fantasy",
    "Religion",
    "Speculative Fiction"
  ],
  "author": "Gene Wolfe",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/1057768.Nightside_the_Long_Sun"
}