{
  "title": "My Mother's Wars",
  "description": "An acclaimed writer on her mother’s tumultuous life as a Jewish immigrant in 1930s New York and her life-long guilt when the Holocaust claims the family she left behind in Latvia A story of love, war, and life as a Jewish immigrant in the squalid factories and lively dance halls of New York’s Garment District in the 1930s, My Mother’s Wars is the memoir Lillian Faderman’s mother was never able to write. The daughter delves into her mother’s past to tell the story of a Latvian girl who left her village for America with dreams of a life on the stage and encountered the realities of her new the battles she was forced to fight as a woman, an immigrant worker, and a Jew with family left behind in Hitler’s deadly path.The story begins in 1914: Mary, the girl who will become Lillian Faderman’s mother, just seventeen and swept up with vague ambitions to be a dancer, travels alone to America, where her half-sister in Brooklyn takes her in. She finds a job in the garment industry and a shop friend who teaches her the thrills of dance halls and the cheap amusements open to working-class girls. This dazzling life leaves Mary distracted and her half-sister and brother-in-law scandalized that she has become a “good-time gal.” They kick her out of their home, an event with consequences Mary will regret for the rest of her life.Eighteen years later, still barely scraping by as a garment worker and unmarried at thirty-five, Mary falls madly in love and has a torrid romance with a man who will never marry her, but who will father Lillian Faderman before he disappears from their lives. America is in the midst of the Depression, Hitler is coming to power in Europe, and New York’s garment workers are just beginning to unionize. Mary makes tentative steps to join, despite her lover’s angry opposition. As National Socialism engulfs Europe, Mary realizes she must find a way to get her family out of Latvia, and she spends frenetic months chasing vague promises and false rumors of hope. Pregnant again, after having submitted to two wrenching back-room abortions, and still unmarried, Mary faces both single motherhood and the devastating possibility of losing her entire Eastern European family.Drawing on family stories and documents, as well as her own tireless research, Lillian Faderman has reconstructed an engrossing and essential chapter in the history of women, of workers, of Jews, and of the Holocaust as immigrants experienced it from American shores.",
  "genres": [
    "History",
    "Memoir",
    "Nonfiction",
    "Biography",
    "Holocaust",
    "World War II",
    "Judaica"
  ],
  "author": "Lillian Faderman",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/15797735-my-mother-s-wars"
}