{
  "title": "The Chinese Takeout Cookbook: Quick and Easy Dishes to Prepare at Home",
  "description": "America’s love affair with Chinese food dates back more than a century. Today, such dishes as General Tso’s Chicken, Sweet and Sour Pork, and Egg Rolls are as common as hamburgers and spaghetti. Probably at this moment, a drawer in your kitchen is stuffed with Chinese takeout menus, soy sauce packets, and wooden chopsticks, right?    But what if you didn’t have to eat your favorites out of a container?    In The Chinese Takeout Cookbook, Chinese food blogger and cooking instructor Diana Kuan brings Chinatown to your home with this amazing collection of more than eighty popular Chinese takeout recipes—appetizers, main courses, noodle and rice dishes, and desserts—all easy-to-prepare and MSG-free. Plus you’ll discover how to   • stock your pantry with ingredients you can find at your local supermarket • season and master a wok for all your Chinese cooking needs • prepare the flavor trifecta of Chinese cuisine—ginger, garlic, and scallions • wrap egg rolls, dumplings, and wontons like a pro • steam fish to perfection every time • create vegetarian variations that will please everyone’s palate • whip up delectable sweet treats in time for the Chinese New Year  The Chinese Takeout Cookbook also features mouthwatering color photos throughout as well as sidebars that highlight helpful notes, including how to freeze and recook dumplings; cooking tidbits, such as how to kick up your dish with a bit of heat; and the history behind some of your favorite comfort foods, including the curious New York invention of the pastrami egg roll and the influence of Tiki culture on Chinese cuisine. So, put down that takeout menu, grab the wok, and let’s get cooking!Here for the first time—in one fun, easy, and tasty collection—are more than 80 favorite Chinese restaurant dishes to make right in your own    • Cold Sesame Noodles • Kung Pao Chicken • Classic Barbecue Spareribs • Beef Chow Fun • Homemade Chili Oil • Hot and Sour Soup • Chinatown Roast Duck • Moo Shu Pork • Dry-Fried String Beans • Black Sesame Ice Cream • And of course, perfectly fried Pork and Shrimp Egg Rolls!\n“Diana Kuan chronicles America’s love affair with Chinese food. The Chinese Takeout Cookbook is the perfect reason to throw out those menus cluttering your kitchen drawers!”—Patricia Tanumihardja, author of The Asian Grandmothers Cookbook",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Nonfiction",
    "Food",
    "Reference",
    "China",
    "Asia"
  ],
  "author": "Diana Kuan",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/15797840-the-chinese-takeout-cookbook"
}