{
  "title": "Once Tempted",
  "description": "Sweeping passions, family drama, and searing scandal play out at the magnificent Silver Creek Ranch as the heirs to a powerful dynasty seize their legacy of love. Oldest son Ward Knowles feels the sprawling California ranch in his blood. And now that the family business has expanded to include a popular resort, he’s working harder than ever. Silver Creek is his legacy and his life, which is fine for the ruggedly sexy ladies’ man and committed bachelor. Love and trust don’t come easily for Ward since he lost his heart to a gold digger—until he meets a shy, unpretentious beauty whose sweet grace is about to turn his jaded heart into a hungry one. Tess Casari has found sanctuary at Silver Creek, working as an assistant to Ward’s mother, Adele. Grateful for her busy new life running the ranch’s spa and resort, Tess can escape the heartbreak, humiliation, and secret shame of her failed marriage. The last thing she needs is temptation—especially from a man who reminds her so much of the husband who shattered her faith in love. But passion and destiny are about to change the rules for two people who have stopped believing in the healing power of love.Praise for Once Tempted “[Laura] Moore’s first in her new Silver Creek series is packed with plenty of great, realistic dialogue and features two main characters whose actions and choices are easy to sympathize with. The glimpses of the hero’s two siblings will leave readers eager for their stories.”— RT Book Reviews “When I read [Moore’s] books, I'm transported to the peaceful countryside with ranch homes and barns dotting the landscape. Once Tempted has all that and more.”— USA Today “Ward is the perfect cowboy hero for a twenty-first century romance.”—Heroes and Heartbreakers “Moore is a fantastic storyteller ensnaring your interest from the first page.”—Fresh Fiction “ Once Tempted is a sexy new read by author Laura Moore that not only gives us a tantalizing tale of undeniable love but also is a great start to a new series that's sure to speak to contemporary romance lovers everywhere.”—The Romance Reviews",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Westerns",
    "Adult",
    "Western Romance",
    "Fiction"
  ],
  "author": "Laura Moore",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/15798088-once-tempted"
}