{
  "title": "Freedomland",
  "description": "The celebrated author of Clockers delivers his most compelling and accomplished novel to date.A white woman, her hands gashed and bloody, stumbles into an inner-city emergency room and announces that she has just been carjacked by a black man. But then comes the horrifying Her young son was asleep in the back seat, and he has now disappeared into the night.So begins Richard Price's electrifying new novel, a tale set on the same turf--Dempsey, New Jersey--as Clockers. Assigned to investigate the case of Brenda Martin's missing child is detective Lorenzo Council, a local son of the very housing project targeted as the scene of the crime. Under a white-hot media glare, Lorenzo launches an all-out search for the abducted boy, even as he quietly explores a different Does Brenda Martin know a lot more about her son's disappearance than she's admitting?Right behind Lorenzo is Jesse Haus, an ambitious young reporter from the city's evening paper. Almost immediately, Jesse suspects Brenda of hiding something. Relentlessly, she works her way into the distraught mother's fragile world, befriending her even as she looks for the chance to break the biggest story of her career.As the search for the alleged carjacker intensifies, so does the simmering racial tension between Dempsey and its mostly white neighbor, Gannon. And when the Gannon police arrest a black man from Dempsey and declare him a suspect, the animosity between the two cities threatens to boil over into violence. With the media swarming and the mood turning increasingly ugly, Lorenzo must take desperate measures to get to the bottom of Brenda Martin's story.At once a suspenseful mystery and a brilliant portrait of two cities locked in a death-grip of explosive rage, Freedomland reveals the heart of the urban American experience--dislocated, furious, yearning--as never before. Richard Price has created a vibrant, gut-wrenching masterpiece whose images will remain long after the final, devastating pages.",
  "genres": [
    "Fiction",
    "Mystery",
    "Crime",
    "Mystery Thriller",
    "Thriller",
    "American",
    "The United States Of America"
  ],
  "author": "Richard Price",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/105786.Freedomland"
}