{
  "title": "VB6: Eat Vegan Before 6:00 to Lose Weight and Restore Your Health . . . for Good",
  "description": "If you’re one of the millions who have thought of trying a vegan diet but fear it’s too monotonous or unfamiliar, VB6 will introduce a flexible way of eating that you can really live with for life.Six years ago, an overweight, pre-diabetic Mark Bittman faced a medical directive: adopt a vegan diet or go on medication. He was no fan of a lifelong regimen of pills, but as a food writer he lived—and worked—to eat. So neither choice was appealing. His solution was a deal with himself. He would become a “flexitarian.”He adopted a diet heavy in vegetables, fruits, and grains by following a healthy vegan diet (no meat, dairy, or processed foods) all day. After 6:00 p.m. he’d eat however he wanted, though mostly in moderation. Beyond that, his plan involved no gimmicks, scales, calorie counting, or point systems. And there were no so-called forbidden foods—he ate mostly home-cooked meals that were as varied and satisfying as they were delicious.He called this plan Vegan Before 6:00 (VB6 for short), and the results were swift and impressive. Best of all, they proved to be lasting and sustainable over the long haul. Bittman lost 35 pounds and saw all of his blood numbers move in the right direction.Using extensive scientific evidence to support his plan, the acclaimed cookbook author and food policy columnist shows why his VB6 approach succeeds when so many other regimens not only fail, but can actually lead to unwanted weight gain. He then provides all the necessary tools for making the switch to a flexitarian diet: lists for stocking the pantry, strategies for eating away from home in a variety of situations, pointers for making cooking on a daily basis both convenient and enjoyable, and a complete 28-day eating plan showing VB6 in action.Finally, Bittman provides more than 60 recipes for vegan breakfasts, lunches, and snacks, as well as non-vegan dinners that embrace the spirit of a vegetable- and grain-forward diet.",
  "genres": [
    "Food",
    "Cookbooks",
    "Nonfiction",
    "Health",
    "Cooking",
    "Vegan",
    "Nutrition"
  ],
  "author": "Mark Bittman",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/15798321-vb6"
}