{
  "title": "Scatter, Adapt, and Remember: How Humans Will Survive a Mass Extinction",
  "description": "In its 4.5 billion–year history, life on Earth has been almost erased at least half a dozen times: shattered by asteroid impacts, entombed in ice, smothered by methane, and torn apart by unfathomably powerful megavolcanoes. And we know that another global disaster is eventually headed our way. Can we survive it? How?As a species, Homo sapiens is at a crossroads. Study of our planet’s turbulent past suggests that we are overdue for a catastrophic disaster, whether caused by nature or by human interference.It’s a frightening prospect, as each of the Earth’s past major disasters—from meteor strikes to bombardment by cosmic radiation—resulted in a mass extinction, where more than 75 percent of the planet’s species died out. But in Scatter, Adapt, and Remember, Annalee Newitz, science journalist and editor of the science Web site io9.com explains that although global disaster is all but inevitable, our chances of long-term species survival are better than ever. Life on Earth has come close to annihilation—humans have, more than once, narrowly avoided extinction just during the last million years—but every single time a few creatures survived, evolving to adapt to the harshest of conditions.      This brilliantly speculative work of popular science focuses on humanity’s long history of dodging the bullet, as well as on new threats that we may face in years to come. Most important, it explores how scientific breakthroughs today will help us avoid disasters tomorrow. From simulating tsunamis to studying central Turkey’s ancient underground cities; from cultivating cyanobacteria for “living cities” to designing space elevators to make space colonies cost-effective; from using math to stop pandemics to studying the remarkable survival strategies of gray whales, scientists and researchers the world over are discovering the keys to long-term resilience and learning how humans can choose life over death.     Newitz’s remarkable and fascinating journey through the science of mass extinctions is a powerful argument about human ingenuity and our ability to change. In a world populated by doomsday preppers and media commentators obsessively forecasting our demise, Scatter, Adapt, and Remember is a compelling voice of hope. It leads us away from apocalyptic thinking into a future where we live to build a better world—on this planet and perhaps on others. Readers of this book will be equipped scientifically, intellectually, and emotionally to face whatever the future holds.",
  "genres": [
    "Nonfiction",
    "Science",
    "History",
    "Audiobook",
    "Environment",
    "Anthropology",
    "Nature"
  ],
  "author": "Annalee Newitz",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/15798335-scatter-adapt-and-remember"
}