{
  "title": "The Highlander Series",
  "description": "From a rising star in Scottish romance comes a breathtaking trilogy of forbidden passion, legendary heroes, and sacred bonds. In Maya Banks’s Highlander series, collected here in one must-have eBook bundle, three unforgettable brothers risk everything to save their clan and their legacy—and to surrender their hearts to love.   Contains a thrilling preview of Maya Banks’s sensual new novel, Never Seduce a Scot!   IN BED WITH A HIGHLANDER   Ewan McCabe is poised to take back what is his—until a blue-eyed, raven-haired temptress is thrust into his life. The illegitimate daughter of the king, Mairin is wary of love. But her attraction to her ruggedly powerful new husband makes her crave his surprisingly tender touch. And as war draws near, Mairin’s strength, spirit, and passion challenge Ewan—a man who dreams only of revenge—to confront his demons and  conquer the strangest territory of his heart.   SEDUCTION OF A HIGHLAND LASS   Fiercely loyal to his family, Alaric McCabe is prepared to wed for duty as well. But on his way to claim the daughter of a neighboring chieftain, he is ambushed and left for dead—only to be saved by the soft touch of a Highland angel. An outcast from her own clan, Keeley McDonald is drawn to the wounded warrior and his strong, lean body. As forbidden love draws them into pleasures of the flesh, conspiracy and danger circle closer. Alaric must make an impossible Will he betray his blood ties for the woman he loves?   NEVER LOVE A HIGHLANDER   Caelen McCabe’s young, reckless heart nearly destroyed his clan—now he must marry to salvage an uneasy alliance. But Caelen trusts no woman, especially not the beauty who torments him with white-hot longing. Rionna McDonald had vowed to protect her heart—until she finds herself craving the sensual delights of a husband who guards his emotions as fiercely as his clan. When the ultimate battle for the McCabe legacy is upon them, Rionna risks her life to prove to Caelen that their love is too precious to lose.",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Erotica",
    "Historical Fiction",
    "Medieval",
    "Fiction"
  ],
  "author": "Maya Banks",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/15798511-the-highlander-series"
}