{
  "title": "Attempting Normal",
  "description": "NATIONAL BESTSELLERPeople make a mess.  Marc Maron was a parent-scarred, angst-filled, drug-dabbling, love-starved comedian who dreamed of a simple life: a wife, a home, a sitcom to call his own. But instead he woke up one day to find himself fired from his radio job, surrounded by feral cats, and emotionally and financially annihilated by a divorce from a woman he thought he loved. He tried to heal his broken heart through whatever means he could find—minor-league hoarding, Viagra addiction, accidental racial profiling, cat fancying, flying airplanes with his mind—but nothing seemed to work. It was only when he was stripped down to nothing that he found his way back.  Attempting Normal is Marc Maron’s journey through the wilderness of his own mind, a collection of explosively, painfully, addictively funny stories that add up to a moving tale of hope and hopelessness, of failing, flailing, and finding a way. From standup to television to his outrageously popular podcast, WTF with Marc Maron, Marc has always been a genuine original, a disarmingly honest, intensely smart, brutally open comic who finds wisdom in the strangest places. This is his story of the winding, potholed road from madness and obsession and failure to something like normal, the thrillingly comic journey of a sympathetic f***up who’s trying really hard to do better without making a bigger mess. Most of us will relate.Praise for Attempting Normal\n \n “I laughed so hard reading this book.”—David Sedaris   “Funny . . . surprisingly deep . . . laced with revelatory insights.”\n—Los Angeles Times\n   “Superb . . . A reason that [it] is a superior example of an overcrowded genre—the comedian memoir—is Mr. Maron’s hardheaded approach to his history, the wisdom of experience.”—The New York Times   “Marc Maron is a legend because he is both a great comic and a brilliant mind. Attempting Normal is a deep, hilarious megashot of feeling and truth as only this man can administer.”—Sam Lipsyte  Praise for Marc Maron and WTF “The stuff of comedy legend.”—Rolling Stone  “Marc Maron is a startlingly honest, compelling, and hilarious comedian-poet. Truly one of the greatest of all time.”—Louis C.K.   “I’ve known Marc for years and I can tell you first hand that he’s passionate, fearless, honest, self-absorbed, neurotic, and screamingly funny.”—David Cross  “Revered among his peers . . . raw and unflinchingly honest.”—Entertainment Weekly“Devastatingly funny.”—Los Angeles Times  “For a comedy nerd, this show is nirvana.”—Judd ApatowFrom the Hardcover edition.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Humor",
    "Comedy",
    "Biography",
    "Audiobook",
    "Biography Memoir"
  ],
  "author": "Marc Maron",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/15798477-attempting-normal"
}