{
  "title": "The Age",
  "description": "Following the international success of the edgy and critically-acclaimed, Dead Girls, Nancy Lee’s highly-charged debut novel, The Age is an ambitious and poignant exploration of the collapse of family, the price of friendship, and the human struggle to find meaning in life and death. A coming of age novel for today, The Age will appeal to readers of Annabel Lyon, Lisa Moore, Heather O'Neill.Set in Vancouver in 1984, as Soviet warships swarm the North Atlantic, The Age follows Gerry, a troubled teenager confronted with her single mom’s newest relationship. When she takes solace in a ragtag group of activists planning a subversive protest at the city’s upcoming peach march, her fascination with the group’s leader, and her struggle with sexual identity creates a rift between Gerry and her best friend, Ian. Bolstered by her grandfather, an eccentric ex-news anchor in the throes of a bitter divorce, Gerry tries to put herself at the centre of the protest group’s violent plot. When the demands of these complex relationship become too difficult, Gerry escapes to the role she knows best, survivor in a post-nuclear dystopia of her own creation. Gerry’s real life and fantasy life alternate and accelerate until a collision of events and consequences forces her towards life or death decisions in both worlds.Electric and engaging, with piercing observation, subversive wit, and the same fearlessness that caused a sensation amongst critics and fans of Dead Girls, The Age is at once a startling post-apocalyptic drama, a harrowing journey through adolescent recklessness and desire, and a dark portrait of a generation molded by nuclear anxiety. Its arrival confirms Nancy Lee as one of Canadian Literature’s most thrilling and compelling voices.",
  "genres": [
    "Fiction",
    "Canada",
    "Post Apocalyptic",
    "Coming Of Age"
  ],
  "author": "Nancy  Lee",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/15799002-the-age"
}