{
  "title": "Midnight at Marble Arch",
  "description": "NEW YORK TIMES BESTSELLER • NAMED ONE OF THE BEST BOOKS OF THE YEAR BY RT BOOK REVIEWSIn this superbly accomplished new Charlotte and Thomas Pitt adventure, Anne Perry takes us beneath the glittering surface of wealthy Victorian society into a nightmare world of fear and intimidation, where women are too often blamed for the violent attacks against them, and powerful men take what they want, leaving others to pay the price.   The horrifying rape and apparent suicide of Catherine Quixwood, wife of a wealthy merchant banker, falls outside the jurisdiction of new Special Branch head Thomas Pitt, but so pervasively offensive are the rumors about the victim that Pitt quietly takes a hand in the investigation.   Yet even with the help of his ingenious wife, Charlotte, and his former superior, Victor Narraway, Pitt is stumped. Why did high-minded, cultured Catherine choose not to accompany her husband to a grand party on the night of her demise? Why did she dismiss all her servants for the evening and leave the front door unlocked? What had been her relationship with the young man seen frequently by her side at concerts and art exhibits? And what can be done to avenge another terrible crime: the assault on Angeles Castelbranco, beloved teenage daughter of the Portuguese ambassador?   As an ordinary policeman, Pitt used to enter London’s grand houses through the kitchen door. Now, as a guest in those same houses, can he find the steel in his soul to challenge the great men of the world with their crimes? The path to the truth takes him in deeply troubling directions, from the lofty world of international politics and finance to his own happy home, where his own teenage daughter, Jemima, is coming of age in a culture rife with hidden dangers.   In this rich, emotionally charged masterpiece, Anne Perry exposes yet another ugly secret of Victoria’s proud empire. And in a courtroom battle of unparalleled brilliance, we thrill at the chance to witness a massive wrong righted.Praise for Midnight at Marble Arch\n \n“Sweeping and scandalous . . . Perry has perfected a delicate touch.”—The New York Times Book Review   “Fresh and vibrant . . . Perry captures Victorian England with flair, and her storyline is fascinating.”—Wichita Falls Times Record News“Perry is a master at illuminating the wrongs of the Victorian age.”—Booklist (starred review)  “Bestselling author Perry continues her Charlotte and Thomas Pitt series with another splendid success. She is so familiar with life at this time that history, attitudes and culture are slipped in seamlessly so the reader sees the world as Victorians did. Not only are Inspector Pitt and his wife fully realized, their circle of friends and acquaintances also feel real and alive. This is a series to read from the beginning.”—RT Book Reviews (Top Pick)  “May be [Perry’s] most intense and thrilling novel to date . . . Midnight at Marble Arch is stunning and insightful from start to finish.”—Bookreporter   “This book is packed with intrigue.”—The Huffington Post   “The monsters Anne Perry creates are not easy to live with, and their actions linger long after the book is closed.”—New York Journal of Books   “Engrossing . . . intriguing . . . Perry does a nice job exploring late Victorian attitudes toward sex crimes.”—Publishers Weekly",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Fiction",
    "Historical Mystery",
    "Historical",
    "Mystery Thriller",
    "Crime"
  ],
  "author": "Anne Perry",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/15798985-midnight-at-marble-arch"
}