{
  "title": "The Vast Unknown: America's First Ascent of Everest",
  "description": "By the author of the New York Times bestselling Everest: Mountain Without Mercy , this chronicle of the iconic first American expedition to Mt. Everest in May 1963 – published to coincide with the climb's 50th anniversary­ – combines riveting adventure, a perceptive analysis of its dark and terrifying historical context, and revelations about a secret mission that followed.  In the midst of the Cold War, against the backdrop of the Bay of Pigs fiasco, the space race with the Soviet Union, and the quagmire of the Vietnam War, a band of iconoclastic, independent-minded American mountaineers set off for Mt. Everest, aiming to restore America's confidence and optimism.  Their objective is to reach the summit while conducting scientific research, but which route will they take?  Might the Chinese, in a public relations coup, have reached the top ahead of them?  And what about another American team, led by the grandson of a President, that nearly bagged the peak in a bootleg attempt a year earlier? The Vast Unknown is, on one level, a harrowing, character-driven account of the climb itself and its legendary team of alternately inspiring, troubled, and tragic climbers who suffered injuries, a near mutiny, and death on the mountain.  It is also an examination of the profound sway the expedition had over the American consciousness and sense of identity during a time when the country was floundering.  And it is an investigation of the expedition's little-known outcome: the selection of a team to plant a CIA surveillance device on the Himalayan peak of Nanda Devi, to spy into China where Defense Intelligence learned that nuclear missile testing was underway.",
  "genres": [
    "Nonfiction",
    "Adventure",
    "Mountaineering",
    "Travel",
    "History",
    "Climbing",
    "Historical"
  ],
  "author": "Broughton Coburn",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/15799344-the-vast-unknown"
}