{
  "title": "Zenith Man: Death, Love, and Redemption in a Georgia Courtroom",
  "description": "Like a nonfiction John Grisham thriller with echoes of Rainman, Just Mercy, and a captivating smalltown Southern setting, this is the fascinating true story—sometimes humorous, sometimes heartbreaking—of an idealistic young lawyer determined to free an innocent neurodivergent man accused of murdering the wife no one knew he had.An inspiring argument for compassion in the pursuit of true justice for readers of Midnight in the Garden of Good and Evil and Just Mercy.Was this small-town TV repair man “a harmless eccentric or a bizarre killer” (Atlanta Journal Constitution). For the first time, Alvin Ridley’s own defense attorney reveals the inside story of his case and trial in an extraordinary tale of friendship and an idealistic young attorney’s quest to clear his client’s name—and, in the process, rebuild his own life.In October 1997, the town of Ringgold in northwest Georgia was shaken by reports of a murder in its midst. A dead woman was found in Alvin Ridley’s house—and even more shockingly, she was the wife no one knew he had.McCracken Poston had been a state representative before he lost his bid for U.S. Congress and returned to his law career. Alvin Ridley was a local character who once sold and serviced Zenith televisions. Though reclusive and an outsider, the “Zenith Man,” as Poston knew him, hardly seemed capable of murder.Alvin was a difficult client, storing evidence in a cockroach-infested suitcase, unwilling to reveal key facts to his defender. Gradually, Poston pieced together the full story behind Virginia and Alvin’s curious marriage and her cause of death—which was completely overlooked by law enforcement. Calling on medical experts, testimony from Alvin himself, and a wealth of surprising evidence gleaned from Alvin’s junk-strewn house, Poston presented a groundbreaking defense that allowed Alvin to return to his peculiar lifestyle, a free man.Years after his trial, Alvin was diagnosed with autism spectrum disorder, a revelation that sheds light on much of his lifelong personal battle—and shows how easily those who don’t fit societal norms can be castigated and misunderstood. Part true crime, part courtroom drama, and full of local color, Zenith Man is also the moving story of an unexpected friendship between two very different men that changed—and perhaps saved—the lives of both.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "History",
    "Crime",
    "Mystery",
    "Audiobook",
    "Book Club"
  ],
  "author": "McCracken Poston Jr.",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/157995299-zenith-man"
}