{
  "title": "This American Ex-Wife: How I Ended My Marriage and Started My Life",
  "description": "A manifesto on the gender politics of marriage (bad) and divorce (actually pretty good!) in America today, and an argument that the former needs a rebootStudies show that nearly 70 percent of divorces are initiated by women—women who are tired, fed up, exhausted, and unhappy. Journalist Lyz Lenz is one such woman whose life fell apart after she reached a breaking point in her twelve-year marriage. In this exuberant and unapologetic book, Lenz flips the script on that narrative and preaches the good gospel of the power of divorce.The end of a marriage is often seen as the failure of the individual—most often the woman. We've all seen how media portray divorced women: sad, lonely, drowning their sorrows in a bottle of wine, desperate for a new man. It’s as though they did something wrong, so they’ve been cast out from society. Lenz sees divorce as a practical and powerful solution for women to take back the power they are owed, while examining why we call divorce a failure when it's heterosexual marriage that has been flawed all along. How can women succeed in marriage when most relationships are based on inequality?This book weaves reportage with sociological research, literature with popular culture, and personal stories of coming together and breaking up to create a kaleidoscopic and poignant portrait of American marriage today. Lenz argues that the mechanisms of American power, justice, love, and gender equality remain deeply flawed, and that marriage, like any other cultural institution, is due for a reckoning. Unlike any other book about divorce, this raucous manifesto for acceptance, solidarity, and collective female refusal takes readers on a riveting ride—all while pointing us toward something a little freer.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Feminism",
    "Audiobook",
    "Biography Memoir",
    "Womens",
    "Biography"
  ],
  "author": "Lyz Lenz",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/157995996-this-american-ex-wife"
}