{
  "title": "Sisters of Fortune",
  "description": "Based on the true story of the Fortune sisters, three young women each at a crossroads when they boarded the RMS Titanic in the spring of 1912 – and how that fateful maiden voyage would change their lives in profound and unexpected ways.USA Today bestselling author Anna Lee Huber expertly weaves real historical figures and anecdotes into this vivid, emotionally powerful, surprising novel about the longing for independence and love—and the events that can irrevocably change even the best laid plans . . .April,1912: It’s the perfect finale to a Grand Tour of Europe—sailing home on the largest, most luxurious ocean liner ever built. For the Fortune sisters, the voyage offers a chance to reflect on the treasures of the past they’ve seen—magnificent castles and museums in Italy and France, the ruins of Greece and the Middle East—and contemplate the futures that await them.For Alice, there’s foreboding mixed with her excitement. A fortune teller in Egypt gave her a dire warning about traveling at sea. And the freedom she has enjoyed on her travels contrasts with her fiancé’s plans for her return—a cossetted existence she’s no longer sure she wants.Flora is also returning to a fiancé, a well-to-do banker of whom her parents heartily approve, as befits their most dutiful daughter. Yet the closer the wedding looms, the less sure Flora feels. Another man—charming, exasperating, completely unsuitable—occupies her thoughts, daring her to follow her own desires rather than settling for the wishes of others.Youngest sister Mabel knows her parents arranged this Grand Tour to separate her from a jazz musician. But the secret truth is that Helen has little interest in marrying at all, preferring to explore ideas of suffrage and reform—even if it forces a rift with her family.Each sister grapples with the choices before her as the grand vessel glides through the Atlantic waters. Until, on an infamous night, fate intervenes, forever altering their lives . . .",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Romance",
    "Historical",
    "Audiobook",
    "Book Club",
    "Historical Romance"
  ],
  "author": "Anna Lee Huber",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/157995338-sisters-of-fortune"
}