{
  "title": "Hat Trick",
  "description": "Gordon Lake doesn't know who he is or what he should do with his life. For the past twenty-six years, he's been a mirror image of his father, and it's never occurred to him to live any other way. When Gordon finds himself alone, faced with a life all his own, he realizes for the first time that he is a blank slate. Determined to find definition and purpose, he moves to Los Angeles, the city of lost souls, and embarks on a social and psychological living three completely separate lives as three completely different roommates to some of the most disparate, confused people in LA.With Ash, a Venice Beach artist who sells her sculptures on the sidewalk, Gordon holds to the mantra, \"Do not deny.\" Together they follow both conviction and whimsy wherever it leads them, until a case of vandalism drives Ash to take her work to a whole new level.Shawn and Cedric have been living together for ages, but they might as well be complete strangers for all their mutual antagonism. From the moment Gordon walks in on their residential disputes, he's determined to find a way to reconcile their differences. But the battle between them quickly escalates beyond anything Gordon can handle, and he begins to wonder if his efforts at peacemaking might be doing more harm than good.Dean has everything figured out. From his well-organized white boards to his taciturn fiancée, his life is exactly what he makes of it. Gordon is sure that Dean can teach him to improve himself, if he could just keep from showing his true feelings towards Dean's bride-to-be.The project was never meant to be easy. The point was to find - or perhaps create - a new identity. Nowhere in his strange imagination did he ever expect it to get this hard this fast. At the end of his three month experiment, Gordon will have to decide who he really is. But what if the answer to his most pressing question turns out to be three more questions, each as broken and confused as the last?In Hat Trick, author Brad Keene explores love, grief, and the importance of knowing who you are in this remarkable debut set in the sprawling urban heart of Los Angeles.",
  "genres": [
    "Fiction",
    "Realistic Fiction",
    "Contemporary"
  ],
  "author": "Brad Keene",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/15799631-hat-trick"
}