{
  "title": "J.A. Jance's Ali Reynolds Mysteries 3-Book Boxed Set, Volume 1",
  "description": "Web of EvilFired from her dream job as a Los Angeles new anchor and still recovering from the truth about her cheating husband, Ali is content to lick her wounds far away in Sedona, Arizona. But before she can leave the past behind, she must return to L.A.: her ex, Paul, is in a hurry for a divorce so he can marry his very young, very pregnant fiancée. But the day before the final proceedings, Paul's bound and broken body is found in the Palm Springs desert. Ali finds herself the sole heir to his wealthy estate—and the prime suspect in his brutal murder. As the evidence piles up against her, she must navigate a torturous path strewn with danger—and bodies—to expose the real cold-blooded thriller.Hand of EvilAli Reynolds is grieving. The newscasting job she once delighted in is gone and so is the philandering husband she loved and thought she knew. When a member of the family who gave Ali a generous scholarship for her education decades earlier suddenly asks her for a meeting, Ali wonders what it can mean. Before she can satisfy her curiosity, though, Ali receives another startling call: a friend's teenage daughter has disappeared. Ali offers to help, but in doing so, she unknowingly begins a quest that will reveal a deadly ring of secrets, at the center of which stand two undiscriminating killers…Cruel IntentEx–television journalist Ali Reynolds just wants a break from excitement to remodel her new home. But when the savagely murdered body of stay-at-home mom Morgan Forester is found, Ali’s contractor Bryan is the prime suspect. Bryan swears he has nothing to do with his wife’s murder—but as the investigation progresses, Ali seems to be the only person who believes him. Determined to prove Bryan’s innocence, she logs onto singleatheart.com, a dating site for \"married singles,\" and unknowingly lands herself directly in the path of a calculating killer.",
  "genres": [
    "Mystery"
  ],
  "author": "J.A. Jance",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/15800087-j-a-jance-s-ali-reynolds-mysteries-3-book-boxed-set-volume-1"
}