{
  "title": "The New Mind of the South",
  "description": "This ground-breaking, thought-provoking exploration upends stereotypes and fallacies to reveal the true heart of the South today—a region still misunderstood by outsiders and even by its own society.There are those who say the South has disappeared. But in her groundbreaking, thought-provoking exploration of the region, Tracy Thompson, a Georgia native and Pulitzer Prize finalist, asserts that it has merely drawn on its oldest tradition: an ability to adapt and transform itself. Thompson spent years traveling through the region and discovered a South both amazingly similar and radically different from the land she knew as a child. African Americans who left en masse for much of the twentieth century are returning in huge numbers, drawn back by a mix of ambition, family ties, and cultural memory. Though Southerners remain more churchgoing than other Americans, the evangelical Protestantism that defined Southern culture up through the 1960s has been torn by bitter ideological schisms. The new South is ahead of others in absorbing waves of Latino immigrants, in rediscovering its agrarian traditions, in seeking racial reconciliation, and in reinventing what it means to have roots in an increasingly rootless global culture. Drawing on mountains of data, interviews, and a whole new set of historic archives, Thompson upends stereotypes and fallacies to reveal the true heart of the South today—a region still misunderstood by outsiders and even by its own people. In that sense, she is honoring the tradition inaugurated by Wilbur Joseph Cash in 1941 in his classic, The Mind of the South. Cash’s book was considered the virtual bible on the origins of Southern identity and its transformation through time. Thompson has written its sequel for the twenty-first century.",
  "genres": [
    "Nonfiction",
    "History",
    "Sociology",
    "Politics",
    "Southern",
    "American History",
    "African American"
  ],
  "author": "Tracy Thompson",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/15801663-the-new-mind-of-the-south"
}