{
  "title": "Young Titan: The Making of Winston Churchill",
  "description": "In modern memory, Winston Churchill remains the man with the cigar and the equanimity among the ruins. Few can remember that at the age of 40, he was considered washed up, his best days behind him. In Young Titan, historian Michael Shelden has produced the first biography focused on Churchill’s early career, the years between 1901 and 1915 that both nearly undid him but also forged the character that would later triumph in the Second World War. Between his rise and his fall, Churchill built a modern navy, experimented with radical social reforms, survived various threats on his life, made powerful enemies and a few good friends, annoyed and delighted two British monarchs, became a husband and father, took the measure of the German military machine, authorized executions of notorious murderers, and faced deadly artillery barrages on the Western front. Along the way, he learned how to outwit more experienced rivals, how to overcome bureaucratic obstacles, how to question the assumptions of his upbringing, how to be patient and avoid overconfidence, and how to value loyalty.He also learned how to fall in love. Shelden gives us a portrait of Churchill as the dashing young suitor who pursued three great beauties of British society with his witty repartee, political f lair, and poetic letters. In one of many never-before-told episodes, Churchill is seen racing to a Scottish castle to prepare the heartbroken daughter of the prime minister for his impending marriage.This was a time of high drama, intrigue, personal courage, and grave miscalculations. But as Shelden shows in this fresh and revealing biography, Churchill’s later success was predicated on his struggles to redeem the promise of his youth.",
  "genres": [
    "Biography",
    "History",
    "Nonfiction",
    "Politics",
    "Historical",
    "Biography Memoir",
    "British Literature"
  ],
  "author": "Michael Shelden",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/15801677-young-titan"
}