{
  "title": "Bullies: How the Left's Culture of Fear and Intimidation Silences Americans",
  "description": "From the editor-in-chief of The Daily Wire comes a galvanizing and alarming look at the strategy and tactics of leftist thuggery. While President Obama and the left like to pretend that they oppose bullying with all their hearts and souls, the truth is far darker: the left is the greatest purveyor of bullying in modern American history. Bullying has morphed into the left’s go-to tactic, as they attempt to quash their opponents through fear, threat of force, violence, and rhetorical intimidation on every major issue facing America today. Ben Shapiro uncovers the simple strategy used by liberals and their friends in the media: bully the living hell out of conservatives. Play the race card, the class card, the sexism card. Use any and every means at your disposal to demonize your opposition—to shut them up. Then pretend that such bullying is justified, because, after all, conservatives are the true bullies, and need to be taught a lesson for their intolerance. Hidden beneath the left’s supposed hatred of bullying lies a passionate love of its vulgar tactics. The left has created a climate of fear wherein ordinary Americans must abandon their principles, back abhorrent causes, and remain silent. They believe America is a force for evil, that our military is composed of war criminals, and that patriotism is the deepest form of treason. They incite riots and threaten violence by playing the race card, then claim they’re advocates for tolerance. Disagree with Obama? You must be a racist. They send out union thugs and Occupy Wall Street anarchists to destroy businesses and redistribute the wealth of earners and job creators. No target is off limits as liberal feminists declare war against stay-at-home moms, and gay activists out their enemies, destroy careers, and desecrate personal privacy. These are the most despicable people in America, bullying their opponents while claiming to be the victims. Shapiro takes on the leftist bullies, exposes their hypocrisy, and offers conservatives a reality check in the face of what has become the gravest threat to American liberty: the left’s single-minded focus on ending political debate through bully tactics.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Philosophy",
    "Cultural",
    "Political Science",
    "Audiobook"
  ],
  "author": "Ben Shapiro",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/15801796-bullies"
}