{
  "title": "Double Feature",
  "description": "“Double Feature is a beautiful, wrenching beginning, and Owen King is a young writer of immense promise.” – Larry McMurtryAn epic debut novel about a young man coming to terms with his life in the process and aftermath of making his first film—from critically acclaimed short story writer Owen King—for readers of Joshua Ferris, Sam Lipsyte, and Chad Harbach. Filmmaker Sam Dolan has a difficult relationship with his father, B-movie actor Booth Dolan—a boisterous, opinionated, lying lothario whose screen legacy falls somewhere between cult hero and pathetic. Allie, Sam’s dearly departed mother, was a woman whose only fault, in Sam’s eyes, was her eternal affection for his father. Also included in the cast of indelible characters: a precocious, frequently violent half-sister; a conspiracy-theorist second wife; an Internet-famous roommate; a family friend and contractor who can’t stop expanding his house; a happy-go-lucky college girlfriend and her husband, a retired Yankees catcher; the morose producer of a true crime show; and a slouching indie film legend. Not to mention a tragic sex monster.Praise for Double Feature: “[Double Feature]… is epic, ambitious, and dedicated to the uncontainable… [King] has a captivating energy, a precision and a fondness for people that are rare…” – David Thomson, The New York Times Book Review 4/7/13“What a kinetic, joyful, gonzo ride – Double Feature made me laugh so loudly on a plane that I had to describe the plot of Sam’s Spruce Moose of a debut film (it stars a satyr) to my seatmate by way of explanation. Booth and Sam are an unforgettable Oedipal duo. A book that delivers walloping pleasures to its lucky readers.” – Karen Russell, author of Swamplandia!“The literary and the popular can coexist. Double Feature makes this point, and proves it too.” — Brian Gresko, The Rumpus 7/2/13\"I liked [Double Feature] so much that it sort of pisses me off – the fact that Owen King, who is something like 142 years younger than I am, is such a skilled, imaginative and complete writer. This is a well-wrought and thoroughly satisfying novel, which manages, at the same time, to be both moving and – this is what pisses me off the most – very funny.\" - Dave Barry, author of Insane City“… [A] darkly humorous and often heartfelt work that’s part ode to low-budget movies, part family drama and part screwball comedy with a slew of oddball characters…” — Brian Truitt, USA Today, 3/22/13",
  "genres": [
    "Fiction",
    "Humor",
    "Contemporary",
    "Literary Fiction",
    "Horror",
    "Film",
    "Audiobook"
  ],
  "author": "Owen King",
  "average_rating": "3.39",
  "url": "https://www.goodreads.com/book/show/15802120-double-feature"
}