{
  "title": "The Insurgents: David Petraeus and the Plot to Change the American Way of War",
  "description": "The Insurgents is the inside story of the small group of soldier-scholars, led by General David Petraeus, who plotted to revolutionize one of the largest, oldest, and most hidebound institutions - the United States military. Their aim was to build a new Army that could fight the new kind of war in the post-Cold War age: not massive wars on vast battlefields, but small wars - in cities and villages, against insurgents and terrorists. These would be wars not only of fighting but of \"nation building\" -often not of necessity but of choice.Based on secret documents, private emails, and interviews with more than one hundred key characters, including Petraeus, the tale unfolds against the backdrop of the wars against insurgents in Iraq and Afghanistan. But the main insurgency is the one mounted at home by ambitious, self-consciously intellectual officers - Petraeus, John Nagl, H. R. McMaster, and others - many of them classmates or colleagues in West Point's Social Science Department who rose through the ranks, seized with an idea of how to fight these wars better. Amid the crisis, they forged a community (some of them called it a cabal or mafia) and adapted their enemies'techniques to overhaul the culture and institutions of their own Army.Fred Kaplan describes how these men and women maneuvered the idea through the bureaucracy and made it official policy. This is a story of power, politics, ideas, and personalities - ;and how they converged to reshape the twenty-first-century American military. But it is also a cautionary tale about how creative doctrine can harden into dogma, how smart strategists today can win the battles at home but not the wars abroad. Petraeus and his fellow insurgents made the US military more adaptive to the conflicts of the modern era, but they also created the tools, and made it more tempting, for political leaders to wade into wars that they would be wise to avoid.",
  "genres": [
    "History",
    "Nonfiction",
    "War",
    "Military Fiction",
    "Military History",
    "Politics",
    "Biography"
  ],
  "author": "Fred  Kaplan",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/15802422-the-insurgents"
}