{
  "title": "Sex, Drugs, Ratt & Roll: My Life in Rock",
  "description": "A jaw-dropping tell-all from the lead singer of the 1980s supergroup the groupies, the trashed hotel rooms, the drugs—and just how much you can get away with when you’re one of the biggest hair metal stars of all time.Women. Spandex. Drugs. Hair spray. . . . Welcome to heavy metal rock ’n’ roll, circa 1980, when all you needed was the right look, burning ambition, and a chance. Stephen Pearcy and supergroup Ratt hit the bull’s-eye. What they did with their fame and fortune is a riotous tale of . . .SEX, DRUGS, RATT & ROLLPearcy was a scrawny, horny, thrill-seeking teenager with an electric guitar who had graduated from backyard parties in San Diego to half-empty dives in Los Angeles before he and his band broke through at Whiskey a Go Go. Cranking out metal just as metal got hot, Ratt was the perfect band at the perfect time, and their hit single “Round and Round” became a top-selling anthem. The bigger Ratt got, the more excessive Pearcy and his “pussy pirates” became. There was nothing these guys wouldn’t snort, drink, bed, or break. And the fans were just as bad, as husbands and mothers offered up nubile wives and daughters as tribute to their rock ’n’ roll idols.On a journey that could happen only in America, Pearcy met everyone from Michael Jackson to Drew Barrymore (at age twelve, at a New York nightclub, at 2 a.m.) to Rodney Dangerfield. His infamous partner-in-crime, Ratt guitarist Robbin Crosby, a blond Viking with an unsurpassed appetite for drugs and women, cuts a towering and tragic figure throughout.As Ratt scrambled up a wall of fame and wealth, so they experienced the gut-wrenching free fall, after too many hours in buses, planes, and limos; too many women; too many drugs; and all the personality clashes and ego trips that marked the beginning of the end. Pearcy offers a stunningly honest selfportrait of a man running on the fumes of ambition and loneliness as the party crashed. His rock ’n’ roll confessional, by turns incredible, hilarious, and lyrical, is a story of survival—and a search for the things that matter most.",
  "genres": [
    "Music",
    "Biography",
    "Nonfiction",
    "Memoir",
    "Autobiography",
    "Audiobook",
    "Rock N Roll"
  ],
  "author": "Stephen Pearcy",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/15802409-sex-drugs-ratt-roll"
}