{
  "title": "All the Great Prizes : The Life of John Hay, from Lincoln to Roosevelt",
  "description": "From secretary to Abraham Lincoln to secretary of state for Theodore Roosevelt, John Hay remained a major figure in American history for more than half a century. His private life was as glamorous and romantic as it was privileged. This first full-scale biography since 1934 is a reflection of American history from the Civil War to the emergence of the nation as a world power as Woodrow Wilson is about to take office.Much of what we know about Lincoln’s years in the White House is drawn from the writings of the young John Hay, the president’s secretary, who was with Lincoln at the Gettysburg Address and at his bedside when he died.Afterward, Hay successfully worked to elect fellow Ohioans James Garfield, Rutherford B. Hayes, and William McKinley for president. As McKinley’s Secretary of State, he plotted the nation’s emergence as a world power after the Spanish-American War. Hay arranged the annexation of the Philippines, the treaty for a canal across Panama, the Open Door policy for China.After McKinley’s assassination, Theodore Roosevelt persuaded the aging Hay to stay on. The relationship between Hay and Roosevelt, which has not been explored, is of lasting interest. If Lincoln was a second father to Hay, Hay was a second father to TR—Roosevelt the bully wielder of the big stick; Hay the polished, urbane diplomat who walked softly, carried out TR’s policies, and helped him win the Nobel Peace Prize.Hay is one of the most pivotal figures in American public life. But, as Taliaferro writes, that is only half the story. He knew everybody from Mark Twain to Henry James, and every president and world leader. He was best friends with Henry Adams, and the two were in love with the same married woman, Lizzie Cameron, the Madame X of Washington Society. Both wrote her voluminous letters.All the Great Prizes chronicles a life that reflects the story of America from the devastation of the Civil War to its emergence as a world leader and power.",
  "genres": [
    "Biography",
    "History",
    "Nonfiction",
    "American History",
    "Politics",
    "Biography Memoir",
    "Civil War"
  ],
  "author": "John Taliaferro",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/15802427-all-the-great-prizes"
}