{
  "title": "Golden Boy",
  "description": "\"This is a gripping and fully-realized novel.\" —Emily St. John Mandel, National Book Award-nominated author of Station Eleven2014 LAMBDA LITERARY AWARD FINALIST WINNER OF THE 2014 ALEX AWARD BOOKLIST TOP 10 FIRST NOVEL OF 2013 SCHOOL LIBRARY JOURNAL BEST BOOK OF 2013 Max Walker is a golden boy. Attractive, intelligent, and athletic, he’s the perfect son, the perfect friend, and the perfect crush for the girls in his school. He’s even really nice to his little brother. Karen, Max’s mother, is determined to maintain the façade of effortless excellence she has constructed through the years, but now that the boys are getting older, she worries that the façade might soon begin to crumble. Adding to the tension, her husband Steve has chosen this moment to stand for election to Parliament. The spotlight of the media is about to encircle their lives. The Walkers are hiding something, you see. Max is special. Max is different. Max is intersex. When an enigmatic childhood friend named Hunter steps out of his past and abuses his trust in the worst possible way, Max is forced to consider the nature of his well-kept secret. Why won’t his parents talk about it? What else are they hiding from Max about his condition and from each other? The deeper Max goes, the more questions emerge about where it all leaves him and what his future holds, especially now that he’s starting to fall head over heels for someone for the first time in his life. Will his friends accept him if he is no longer the Golden Boy? Will anyone ever want him—desire him—once they know? And the biggest one of all, the question he has to look inside himself to Who is Max Walker, really?Golden Boy is a novel you’ll read in one sitting but will never forget; at once a riveting tale of a family in crisis, a fascinating exploration of identity, and a coming-of-age story like no other.",
  "genres": [
    "Fiction",
    "Young Adult",
    "LGBT",
    "Contemporary",
    "Queer",
    "Coming Of Age",
    "Adult"
  ],
  "author": "Abigail Tarttelin",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/15802886-golden-boy"
}