{
  "title": "Shadow of Freedom",
  "description": "New York Times, USA Today, Wall Street Journal and international bestselling phenomenon David Weber delivers book #18 in the multiple New York Times best-selling Honor Harrington series. Honor Harrington’s Royal Manticoran Navy fights space battles alongside planetary rebels as its old rival, the corrupt Solarian League, begins to crumble.#18 in the multiply-bestselling Honor Harrington series.Wrong number? There are two sides to any quarrel . . . unless there are more. Michelle Henke, Queen Elizabeth of Manticore's first cousin, Honor Harrington's best friend, and the commanding officer of Manticore's Tenth Fleet, is just a bit surprised when a messenger arrives from the Mobius System to inform her that the Mobius Liberation Front is prepared to rise in rebellion against the hated regime President Svein Lombroso. She can understand why anyone would want to rebel against someone like Lombroso, but why tell her about it? After all, she has problems of her own, like the minor matter of a life-or-death war against the Solarian League. Michelle has just handed the \"invincible\" Solarian League Navy the most humiliating, one-sided defeat in its entire almost thousand-year history in defense of the people of the Star Empire's Talbott Quadrant. But the League is the most powerful star nation in the history of humanity. Its navy is going to be back – and this time with thousands of superdreadnoughts.  Yet she also knows scores of other star systems — some independent, some controlled by puppet regimes, and some simply conquered outright by the Solarian Office of Frontier Security — lie in the League's grip along its frontier with the Talbott Quadrant. As combat spreads from the initial confrontation, the entire frontier has begun to seethe with unrest, and Michelle sympathizes with the oppressed populations wanting only to be free of their hated masters.  And that puts her in something of a quandary when the messenger from Mobius arrives, because someone's obviously gotten a wrong number. According to him, the Mobians’ uprising has been carefully planned to coordinate with a powerful outside ally: the Star Empire of Manticore. Only Manticore — and Mike Henke — have never even heard of the Mobius Liberation Front. It's a set-up . . . and Michelle knows who's behind it. The shadowy Mesan Alignment has launched a bold move to destroy Manticore's reputation as the champion of freedom. And when the RMN doesn't arrive, when the MLF is brutally and bloodily crushed, no independent star system will ever trust Manticore again. Mike Henke knows she has no orders from her government to assist any rebellions or liberation movements, that she has only so many ships, which can be in only so many places at a time . . . and that she can't possibly justify diverting any of her limited, outnumbered strength to missions of liberation the Star Empire never signed on for.  She knows that . . . and she doesn't care. No one is going to send thousands of patriots to their deaths, trusting in Manticoran help that will never come.  Not on Mike Henke's watch.About Shadow of Freedom: “This entry is just as exciting as Weber’s initial offering. . . .The result is a fast-paced and action-packed story that follows [our characters] as they move from reaction to command of the situation. Weber builds Shadow of Freedom to an exciting and unexpected climax.”—Daily News of GalvestonAbout Mission of Honor, #13 in the Honor Harrington series:  “Weber combines realistic, engaging characters with intelligent technological projection and a deep understanding of military bureaucracy in this long-awaited Honor Harrington novel…Fans of this venerable space opera will rejoice to see Honor back in action.”–Publishers Weekly   “This latest Honor Harrington novel brings the saga to another crucial turning point…Readers may feel confident that they will be Honored many more times and enjoy it every time.”–Booklist About David Weber and the Honor Harrington series:  “. . .everything you could want in a heroine …. Excellent … plenty of action.”–Science Fiction Age  “Brilliant! Brilliant! Brilliant!”–Anne McCaffrey  “Compelling combat combined with engaging characters for a great space opera adventure.”–Locus  “Weber combines realistic, engaging characters with intelligent technological projection . . . Fans of this venerable space opera will rejoice . . .”–Publishers Weekly",
  "genres": [
    "Science Fiction",
    "Space Opera",
    "Fiction",
    "Military Fiction",
    "Military Science Fiction",
    "Space",
    "Audiobook"
  ],
  "author": "David Weber",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/15802917-shadow-of-freedom"
}