{
  "title": "Out with It: How Stuttering Helped Me Find My Voice",
  "description": "A fresh, engaging account of a young woman’s journey, first to find a cure for a lifelong struggle with stuttering, and ultimately to embrace the voice that has defined her character.A vividly powerful memoir of a young woman who fought for years to change who she was until she finally found her voice and learned to embrace her imperfection.Imagine waking up one day to find your words trapped inside your head, leaving you unable to say what you feel, think, want, or need. At the age of seven that happened to Katherine Preston. From that moment, she began battling her stutter and hiding her shame by denying there was anything wrong. Seventeen years later, exhausted and humiliated, she made a life-changing to leave her home in London and spend a year traveling around America meeting hundreds of stutterers, speech therapists, and researchers. What began as a vague search for a cure became a journey that debunked the misconceptions shrouding the condition, and a love story that transformed her conception of what it means to be normal.Shedding light on an ancient condition that affects approximately 4 million people in the United States and 60 million people worldwide, Preston has assembled an anthology of expertise and experience. In addition to specialists in the field, she interviews celebrities, writers, musicians, social workers, psychologists, and financiers—men and women from all walks of life battling their difficulties with speech. A heartwarming memoir and a journalistic feat, Out With It is more than a chronicle of one of the most prevalent speech problems in the world; it’s a story about understanding yourself, and learning to embrace the voice within.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Biography",
    "Biography Memoir",
    "Communication"
  ],
  "author": "Katherine  Preston",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/15803013-out-with-it"
}