{
  "title": "King of Cuba",
  "description": "Told with wry wit and keen insight, this entertaining and richly satisfying story about a fictionalized Fidel Castro and an octogenarian Cuban exile obsessed with seeking revenge against the dictator—from the National Book Award finalist and author of Dreaming in Cuban .Vivid and alive, Cristina García’s new novel transports readers to Cuba, to Miami, and into the heads of two larger-than-life men—a fictionalized Fidel Castro and an octogenarian Cuban exile obsessed with seeking revenge against the dictator. In King of Cuba, the National Book Award finalist and author of Dreaming in Cuban, writing at the top of her form with humor and humanity, returns to the territory of her homeland.El Comandante, an aging dictator, shambles about his mansion in Havana, visits a dying friend, tortures hunger strikers in one of his prisons, and grapples with the stale end of his life that is as devoid of grandeur as his nearly sixty-year-old revolution. Across the waters in Florida, Goyo Herrera, a Miami exile in his eighties, plots revenge against his longtime enemy—the very same El Comandante—whom he blames for stealing his beloved, ruining his homeland, and taking his father’s life. Herrera would gladly “wear chains on his ankles, chisel stones for his remaining days, even become a goddamn Democrat for the gratification of personally expediting the tyrant’s journey back to the Devil, with whom he’d obviously made a pact.”With her masterful twinning of El Comandante and Herrera, along with the rabble of other Cuban voices that combine to create a chorus of history’s unofficial stories, García plumbs the passions and realities of these two Cubas—on the island and off—and offers a pulsating story that entertains and illuminates.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "International",
    "Travel",
    "Book Club",
    "Novels"
  ],
  "author": "Cristina García",
  "average_rating": "3.37",
  "url": "https://www.goodreads.com/book/show/15803094-king-of-cuba"
}