{
  "title": "The Emerald Mile: The Epic Story of the Fastest Ride in History Through the Heart of the Grand Canyon",
  "description": "From one of Outside magazine’s “Literary All-Stars” comes the thrilling true tale of the fastest boat ride ever, down the entire length of the Colorado River and through the Grand Canyon, during the legendary flood of 1983.In the tradition of The Perfect Storm and Seabiscuit , the engrossing tale of the fastest boat ride ever down the Colorado River through the Grand Canyon.In the winter of 1983, the largest El Niño event on record—a chain of “superstorms” that swept in from the Pacific Ocean—battered the entire West. That spring, a massive snowmelt sent runoff racing down the Colorado River toward the Glen Canyon Dam, a 710-foot-high wall of concrete that sat at the head of the most iconic landscape feature in America, the Grand Canyon. As the water clawed toward the parapet of the dam, worried federal officials desperately scrambled to avoid a worst-case one of the most dramatic dam failures in history.In the midst of this crisis, beneath the light of a full moon, a trio of river guides secretly launched a small, hand-built wooden boat, a dory named the Emerald Mile, into the Colorado just below the dam’s base and rocketed toward the dark chasm downstream, where the torrents of water released by the dam engineers had created a rock-walled maelstrom so powerful it shifted giant boulders and created bizarre hydraulic features never previously seen. The river was already choked with the wreckage of commercial rafting injured passengers clung to the remnants of three-ton motorboats that had been turned upside down and torn to pieces. The chaos had claimed its first fatality, further launches were forbidden, and rangers were conducting the largest helicopter evacuation in the history of Grand Canyon National Park.An insurgent river run under such conditions seemed to border on the suicidal, but Kenton Grua, the captain of that dory, was on an unusual a gesture of defiance unlike anything the river world had ever seen. His aim was to use the flood as a hydraulic slingshot that would hurl him and two companions through 277 miles of some of the most ferocious white water in North America and, if everything went as planned, catapult the Emerald Mile into legend as the fastest boat ever propelled—by oar, by motor, or by the grace of God—through the heart of the Grand Canyon.Grua himself was already something of a mythic figure, a fearless boatman obsessed with the mysteries of the canyon. His quest embraced not only the trials of the speed run itself but also the larger story of his the men who had first discovered the canyon and pioneered its exploration, as well as those who waged a landmark battle to prevent it from being hog-tied by a series of massive hydroelectric dams—a conflict that continues to this day.A writer who has worked as a river guide himself and is intimately familiar with the canyon’s many secrets, Kevin Fedarko is the ideal narrator for this American epic. The saga of The Emerald Mile is a thrilling adventure, as well as a magisterial portrait of the hidden kingdom of white water at the bottom of the greatest river canyon on earth. This book announces Fedarko as a major writing talent and at last sets forth the full story of an American legend—the legend of The Emerald Mile .",
  "genres": [
    "Nonfiction",
    "Adventure",
    "History",
    "Travel",
    "Nature",
    "Book Club",
    "Outdoors"
  ],
  "author": "Kevin Fedarko",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/15803144-the-emerald-mile"
}