{
  "title": "Imperial Dreams: Tracking the Imperial Woodpecker through the Wild Sierra Madre",
  "description": "Naturalist Tim Gallagher journeys deep into the savagely beautiful Sierra Madre, home to rich wildlife and other natural treasures—and also to Mexican drug cartels—in a dangerous quest to locate the rarest bird in the world—the possibly extinct Imperial Woodpecker, the largest of all carpinteros. Explorer and noted bird expert Tim Gallagher is no stranger to the obsession for adventure. In the early 2000s, Gallagher rediscovered the legendary Ivory-billed Woodpecker—which most scientists believed had been extinct for sixty years—causing an international stir.Now, in Imperial Dreams, Gallagher once again hits the trail, with a “natural treasure” map of sightings of the Imperial bestowed on him by a friend on his deathbed. Charged with continuing the quest of a line of distinguished naturalists, including the great Aldo Leopold, to find and protect the Imperial woodpecker in its last habitat, Gallagher ventures deep into isolated territory, the high pine forests of Mexico’s Sierra Madre Occidental. In this mysterious, historically wild area, Geronimo led Apaches in their last stand and William Randolph Hearst inherited a storied ranch, which Pancho Villa looted. Today, drug lords rule the land.Here in the Sierra, the giant Imperial’s pounding drumbeat once echoed like the blows of an ax through the Sierra as it bored into the massive, grub-infested pines, hammering on them powerfully for weeks at a time until they groaned, shuddered, and finally toppled with a thunderous impact that shook the ground. The bird had largely disappeared by the early 1950s, yet rumors of Imperial Woodpeckers flying through remote forests persist.Gallagher’s quest takes a terrifying turn as he encounters armed drug traffickers, burning houses, and fleeing villagers. His passionate mission, now a life-and-death drama, will keep armchair adventurers on the edge of their seats as he chases truth in the most dangerous of habitats.",
  "genres": [
    "Nonfiction",
    "Nature",
    "Birds",
    "Science",
    "Animals",
    "Natural History",
    "Travel"
  ],
  "author": "Tim Gallagher",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/15803182-imperial-dreams"
}