{
  "title": "How Dark the World Becomes",
  "description": "Original Trade Paperback. The exciting debut of a nonstop noir SF from legendary game creator Frank Chadwick. With one single act of kindness, a tough-as-nails hood with a heart of gold saves two alien children from assassination—and resets the balance of galactic power in the process.Sasha Naradnyo is a gangster. He’s a gangster with heart, sure, but Sasha sticks his neck out for no man. That’s how you stay alive in Crack City, a colony stuffed deep into the crust of the otherwise unlivable planet Peezgtaan. Alive only—because if you’re human, you don’t prosper, at least not for long. Sasha is a second generation City native. His parents came to this rock figuring to make it big, only to find that they’d been recruited as an indentured labor force for alien overlords known as the Varoki.Now a pair of rich young Varoki under the care of a beautiful human nanny are fleeing Peezgtaan, and Sasha is recruited to help. All things considered, he’d rather leave the little alien lordlings to their fate, but certain considerations—such as Sasha’s own imminent demise if he remains—make it beneficial for him to take on the job.But Sasha discovers his simple choice has thrust him into the midst of a political battle that could remake the galactic balance of power and save humanity from slow death by servitude. Now all he has to do is survive and keep his charges alive on a hostile planet undergoing its own revolution.But it’s the galaxy that had better watch out. For now the toughest thug in Crack City has gotten his first taste of real freedom. He likes it, and wants more.The stunning debut of a nonstop science fiction noir thriller from legendary game creator Frank Chadwick.About How Dark the World Becomes :“ How Dark the World Becomes is a crackling debut novel that speaks of great things to come! It's whip-smart, lightning-fast and character-driven—in short it has everything required to be totally satisfying. Highly recommended.\" –Jonathan Maberry, New York Times best-selling author of Assassin’s Code“. . . [a] far off, hard scrabble intergalactic underworld . . . fast-paced intergalactic adventure full of far-flung alien intrigue.”— Astroguyz\" . . . thrilling space adventure . . . I was reminded of Jack McDevitt's Alex Benedict novels and Mark L Van Name's Jon & Lobo adventures.\"— SFCrowsnest",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Space Opera",
    "Science Fiction Fantasy",
    "Aliens",
    "Thriller"
  ],
  "author": "Frank Chadwick",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/15803177-how-dark-the-world-becomes"
}