{
  "title": "Machiavelli for Moms: Maxims on the Effective Governance of Children*",
  "description": "An enlightening parenting manifesto showing how the strategies used in Machiavelli’s masterpiece, The Prince , can be employed to reign in a rambunctious family.Newly remarried, with four kids under the age of eight, Suzanne Evans is fed up with tantrums, misbehaving, and general household chaos. Desperate to get the upper hand, she turns to Machiavelli’s iconic political treatise, The Prince, and inspiration strikes. Maybe, she thinks, I can use his manipulative rules to bring order to my boisterous family.Soon her experiment begins to play out in surprisingly effective ways. She starts off following Machiavelli’s maxim “It is dangerous to be overly generous” and soon realizes that for all its austerity, there is a kernel of truth in it. Her kids do behave when they are given clear limits. From there, she starts tackling other rules— “Tardiness robs us of opportunity” and “Study the actions of illustrious men” —and she is surprised at how quickly her brood falls in line once she starts adapting his advice to child rearing.As she tries more and more of Machiavelli’s ideas on her family, Evans figures out this You can get more out of your kids, with less fighting, if you figure out how to gently manipulate them to get what you want (and let them think it’s their own idea). But when events in her life start to spiral out of control and some of her earlier techniques are no longer working, she has to figure out her own answer to the ultimate Machiavellian Is it better to be feared than loved?***Do the Ends Justify the Meanness?Machiavelli for Moms is the story of a rash, even crazy a year of using Machiavelli’s The Prince to “rule” one disobedient family. As mother-of-four Suzanne Evans soon found out, a little bit of coercion, manipulation, and cunning can go a long way when running a kingdom— and a household. Wouldn’t we all like to have kids • Consistently obey our commands . . . without our having to nag?• Stop talking back . . . and start getting along with each other?• Eagerly complete their homework . . . without our having to ask?• Sleep soundly through the night . . . while we regain our sanity, sex drive, and peace of mind?In Machiavelli for Moms, Evans offers one woman’s unorthodox solution to the messy, chaotic, and confusing world of modern motherhood. It’s a tale of her own experiment in “power parenting” and a manifesto for other moms willing to act on Machiavelli’s famously manipulative advice.",
  "genres": [
    "Parenting",
    "Nonfiction"
  ],
  "author": "Suzanne  Evans",
  "average_rating": "3.29",
  "url": "https://www.goodreads.com/book/show/15803181-machiavelli-for-moms"
}