{
  "title": "Once Upon a Flock: Life with My Soulful Chickens",
  "description": "This delightful memoir about life with a spirited, sometimes reckless flock of backyard chickens—inspired by the author’s popular blog, “Scratch and Peck”—includes color photographs and imaginative illustrations throughout.When longtime illustrator and lover of power tools Lauren Scheuer was looking for a project, she got the idea to raise backyard chickens. Her husband and teenage daughter looked on incredulously as coop sketches and chicken-raising books filled their New England home. But when the chicks arrived, the whole family fell in love with the bundles of fluff and the wild adventures began.Once Upon a Life with My Soulful Chickens stars Scheuer’s backyard chickens—with their big personalities, friendships, rivalries, and secrets—and the flock’s guardian, Marky the terrier. The flock includes Hatsy, the little dynamo; Lil’White, the deranged and twisted Buff Orpington; Pigeon, the fixer-upper chicken; and Lucy, the special-needs hen who bonds with Lauren and becomes a fast friend.This charming story of Lauren’s life with her quirky flock is filled with moments of humor and When Lucy is afflicted with a neurological disease, Lauren builds Lucy a special-needs coop. When Lucy’s nesting instinct leadsLauren to act as a chicken midwife of sorts, Lauren hatches a chick in her home. And when Lucy’s best friend Hatsy falls ill, Lauren finds an unlikely friend for Lucy in a chicken named Pigeon, who requires an emergency bath and blow-dry. Enthusiastically immersing herself in the world of her flock, Lauren discovers that love, loss, passion, and resilience are not only parts of the human experience, but of the chicken experience as well. Throughout it all, Lauren documents the laughter and drama of her flock’s adventures with her own whimsical photos and illustrations. At once humorous, poignant, and informative, Once Upon a Flock is a feathered tale like no other.",
  "genres": [
    "Nonfiction",
    "Animals",
    "Memoir",
    "Birds",
    "Humor",
    "Biography Memoir",
    "Nature"
  ],
  "author": "Lauren Scheuer",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/15803190-once-upon-a-flock"
}