{
  "title": "Edge Effects",
  "description": "Spanning a millennium, the Dominant Species Series is a panoramic story of human and alien species locked in mortal conflict. Against this backdrop of deadly biological rivalry, humankind will fight an inner battle whose outcome is as final--and as brutal--as natural selection itself.Volume Two - Edge EffectsIt is the year 3012. The human incursion begins.40 warp days from Earth is the newly discovered planet, Verde's Revenge - a jungle planet green, thriving, and fertile. Containing a wealth of natural resources, it is the chosen location for a new off-world colony. Earth's enormous colonizing machinery is beginning preparations for the coming human invasion. But by law, the planet's flora and fauna must be inventoried for biological hazards before human feet can tread there. An apparent glitch in the system has put the surveys behind schedule - and contractors are already on the planet's surface.Biologist Rachel Sanders thinks she has drawn a lucky card when she's hired to perform the biological surveys on Verde's rich ecosystems. She will soon discover new and diverse species - and long the way reveal a growing threat more perilous than she could ever have imagined._______________________________In this volume of the story we are transported to a new world populated with a lush panoply of plant and animal life. The story takes place in an environment both physically and sociologicallyremoved from our daily experience. With a strong and highly detailed sense of place, the story transports us into a world matchless in its richness and mystery. Within this context, humankind struggles against perils both inside and outside its tribal milieu. The relationship between humankind and the organic world is still an ever-present theme in the story's narrative. Like the first volume, the story is a voyage of discovery. It is horrific and cerebral at the same time, offering up both thrills and ideas for all to enjoy.",
  "genres": [
    "Science Fiction",
    "Aliens",
    "Fiction"
  ],
  "author": "David Coy",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/15803677-edge-effects"
}