{
  "title": "Amethysts of Wisdom 1",
  "description": "This edition is no longer available. The book has been rereleased on January 31, 2013 by Diversity Novels.\"True love is more precious than the rarest of gemstones.\" --The CollectorAngus loves ancient languages and sharing his knowledge with high school kids, but his true passion is linguistic research. Love doesn't come easy for him, despite the amethyst ring his grandmother gave him to help him heal from the traumatic experience that still haunts him. He desperately wants a loving relationship with Ayden, despite their different temperaments, but cannot seem to overcome his fears. Ayden is not a patient man, and Angus is afraid he'll lose him, so he decides to open up. Ayden hates the fact he can't seem to get closer to Angus. When he is shot at on a secret mission to free a hostage in Central America, he resolves to find out what is stopping Angus from accepting physical intimacy. Ayden finds him a gift, a mysterious amethyst-covered book, hoping it will show Angus how much he loves him.But the book has a mind of its own. Mysterious letters appear and disappear. Weird dreams challenge their very understanding of reality. Can they overcome their differences and discover the amethysts' wisdom? This book is the second in a series called the Gemstone Chronicles, a collection of unique love stories and romances brought to you from the Void Outside Space and Time. These volumes are hand-selected by the Chroniclers, a team of beings working tirelessly to bring you interesting sensory experiences, works of art and music, as well as entertaining stories. With several dimensions and all of time at their disposal to find the most fascinating tales, the range of adventures is as unique as each individual Collector. A special being with extraordinary imagination, he is the focal point and provides new and interesting ideas that are put together in the Hall of Collections for all to admire and enjoy.Read more about the Gemstone Chronicles and its various worlds in the special brochure coming soon to the Silver Publishing web site! The Gemstone Chronicles Companion will showcase the entire collection as it is built story by story, updated each time a new one joins the group. Don't miss it! CONTENT ADVISORY: This title contains rape themes.",
  "genres": [
    "M M Romance",
    "Fantasy",
    "Paranormal"
  ],
  "author": "Serena Yates",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/15804110-amethysts-of-wisdom-1"
}