{
  "title": "Acquired Traits",
  "description": "Spanning a millennium, the Dominant Species Series is a panoramic story of human and alien species locked in mortal conflict. Against this backdrop of deadly biological rivalry, humankind will fight an inner battle whose outcome is as final--and as brutal--as natural selection itself.Volume Three - Acquired TraitsIt is the year 3014. A pivotal battle looms.Branded as murderers and forced into hiding in the jungle planet's deepest recesses, pilot John Soledad, biologist Rachel Sanders, and medic Donna Applegate survive on their wits, frequent field remedies applied by Donna, and late-night raids on the colony's storage warehouses for needed supplies.While the trio struggles to survive, another threat--one more virulent than the jungle's life forms--threatens the very survival of the new colony. Rachel's venom-induced visions are telling her something--revealing the terrible nature of the danger--and awakening memories of things and events ancient, dark and monstrous._________________________________Like the second volume, the third is constructed in vignettes and subplots woven around a central theme. The subplots are designed to introduce new and interesting characters who playcrucial roles in the outcome of the story or to carry the central theme forward. Each subplot is interwoven serially, weaving an evermore-complex tale of intrigue and mystery where questions are posed and answers provided in a rich and fascinating alien environment. We discover in the third volume that the story is much more than the sum of its parts. The place, the context, and the subtext define the story too and the message embedded in it is about our role and place in the biological world. For those of us who may never have known in the first place, or for those who may have forgotten, it is a story that reminds us that we are, at our most basic, a species with a place in the great biological hierarchy.",
  "genres": [
    "Science Fiction"
  ],
  "author": "David Coy",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/15805001-acquired-traits"
}