{
  "title": "I Zombie: The Collection",
  "description": "The apocalypse is upon us and there's only one route to survival -- I Zombie! If you've not read the series, then you are meat for the beasts. Never fear, the entire I Zombie trilogy is now entombed in one volume, easy enough to carry with you as you run from the zombie horde. Keep this book close as the ensuing chaos battles to take you down. Good luck. You'll need it.Just don't let the Zero Day Collective know where you are. Within this tome you will find:I Zombie I: In a moment of pure chaos, the majority of the Earth's population became the walking dead. One man promises to unveil the truth.When journalist Jacob Plummer is bitten by one of the undead he turns to the written word not only to ease the pain of change, but to reveal a truth that could spare the world from extinction.As Jacob attempts to reveal the conspiracy behind the virus he fights off the undead masses to save the planet from a collision with entropy. My Zombie My: The City of Lights is crawling with the undead who care nothing for love or wine and are hell-bent on getting the one thing they want - your brains. The living have only one hope – Bethany Nitshimi who carries with her an encrypted file containing the key to the cure. Unfortunately Bethany is battling the undead, the apocalypse, and a group who will stop at nothing to keep her from curing the plague.My Zombie My picks up where I Zombie I left off and heads into Paris. Bethany’s gang of heroes has picked up a few more strays and mankind is getting dangerously close to the end. As Bethany battles the zombie horde she must crack the file, get the cure, and save the human race, before we are just meat for the beasts. Die Zombie Die: The final book in the I Zombie trilogy has arrived. The Zero Day Collective holds Bethany Nitshimi prisoner and is closing in on the final phase of the Great Cleansing.But chaos cannot be contained.As a rogue biologist works from within to bring down the ZDC, commander Sam Leamy and his small army of misfits plot to storm the gates of the Collective’s Headquarters.Caught between zombies, the ZDC, and a mysterious new syndicate, Leamy is in a race against the clock to rescue the one woman who could save the planet from complete chaos.",
  "genres": [
    "Zombies"
  ],
  "author": "Jack Wallen",
  "average_rating": "4.61",
  "url": "https://www.goodreads.com/book/show/15806066-i-zombie"
}