{
  "title": "All She Ever Wanted",
  "description": "Chelsea Maynard has spent her lifetime planning for the much awaited start of her family, the joy of caring for a new life in the world, the intimacy of bonding with a child. But after a difficult birth, her careful planning is shattered by exhaustion. Numbness replaces her connection to the people around her and the baby daughter who needs her. Her husband Leo Green, her sister Emma and friends keep telling her she’s not herself, but no one can seem to help her find her way back to the happiness that had warmed her life before little Annabelle came along. When Leo heads off for a business trip, Chelsea is overwhelmed by the endless duties of caring for a crying baby and the dark mood that pulls her down, immobilizing her. Her sister says it’s postpartum depression, but the doctor passes it off as the baby blues and encourages her to get exercise and eat right. Easy for him to say. He doesn’t have a soft, pink baby shrieking at the top of her lungs, eliciting looks of annoyance and horror at the park and the grocery store. Chelsea’s collapse is inevitable, but what’s the harm in letting a baby cry it out? She collapses in bed. Restored by sleep, Chelsea goes to the crib in the morning but finds it empty. Her baby is gone? Maybe she left her in the stroller…or the swing…or the bouncy chair? But her panicked search turns up no sign of Annabelle. Her baby is gone... And Chelsea doesn’t have a clue as to who would have taken her away. When the police respond with a thorough search and endless questions, Chelsea realizes she can’t clearly recall the details of that night. Why can’t she remember? Has she blocked it out? Could she have done something to make her own baby stop crying? Did she act on the dark visions that have paraded through her fractured mind? The race is on to find baby Annabelle. Time is of the essence in a case like this. Her baby is out there…somewhere…and Chelsea is determined to cooperate with the police, even if the evidence points right back to her.",
  "genres": [
    "Fiction",
    "Mystery",
    "Chick Lit",
    "Drama",
    "Mental Illness",
    "Psychology",
    "Book Club"
  ],
  "author": "Rosalind Noonan",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/15806996-all-she-ever-wanted"
}