{
  "title": "The Caning: The Assault that Drove America to Civil War",
  "description": "A Turning Point in American History, the Beating of U.S. Senator Charles Sumner and the Beginning of the War Over SlaveryEarly in the afternoon of May 22, 1856, ardent pro-slavery Congressman Preston S. Brooks of South Carolina strode into the United States Senate Chamber in Washington, D.C., and began beating renowned anti-slavery Senator Charles Sumner with a gold-topped walking cane. Brooks struck again and again—more than thirty times across Sumner’s head, face, and shoulders—until his cane splintered into pieces and the helpless Massachusetts senator, having nearly wrenched his desk from its fixed base, lay unconscious and covered in blood. It was a retaliatory attack. Forty-eight hours earlier, Sumner had concluded a speech on the Senate floor that had spanned two days, during which he vilified Southern slaveowners for violence occurring in Kansas, called Stephen A. Douglas of Illinois a “noise-some, squat, and nameless animal,” and famously charged Brooks’s second cousin, South Carolina Senator Andrew Butler, as having “a mistress. . . who ugly to others, is always lovely to him. . . . I mean, the harlot, Slavery.” Brooks not only shattered his cane during the beating, but also destroyed any pretense of civility between North and South.One of the most shocking and provocative events in American history, the caning convinced each side that the gulf between them was unbridgeable and that they could no longer discuss their vast differences of opinion regarding slavery on any reasonable level.The Caning: The Assault That Drove America to Civil War tells the incredible story of this transformative event. While Sumner eventually recovered after a lengthy convalescence, compromise had suffered a mortal blow. Moderate voices were drowned out completely; extremist views accelerated, became intractable, and locked both sides on a tragic collision course.The caning had an enormous impact on the events that followed over the next four years: the meteoric rise of the Republican Party and Abraham Lincoln; the Dred Scott decision; the increasing militancy of abolitionists, notably John Brown’s actions; and the secession of the Southern states and the founding of the Confederacy. As a result of the caning, the country was pushed, inexorably and unstoppably, to war. Many factors conspired to cause the Civil War, but it was the caning that made conflict and disunion unavoidable five years later.",
  "genres": [
    "History",
    "Civil War",
    "American History",
    "Nonfiction",
    "Politics",
    "American Civil War",
    "Biography"
  ],
  "author": "Stephen Puleo",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/15807860-the-caning"
}