{
  "title": "Mugged: Racial Demagoguery from the Seventies to Obama",
  "description": "“This isn’t a story about black people—it’s a story about the Left’s agenda to patronize blacks and lie to everyone else.” For decades, the Left has been putting on a play with themselves as heroes in an ongoing civil rights move­ment—which they were mostly absent from at the time. Long after pervasive racial discrimination ended, they kept pretending America was being run by the Klan and that liberals were black America’s only protectors. It took the O. J. Simpson verdict—the race-based acquittal of a spectacularly guilty black celebrity as blacks across America erupted in cheers—to shut down the white guilt bank. But now, fewer than two decades later, our “pos­tracial” president has returned us to the pre-OJ era of nonstop racial posturing. A half-black, half-white Democrat, not descended from American slaves, has brought racial unrest back with a whoop. The Obama candidacy allowed liberals to engage in self-righteousness about race and get a hard-core Leftie in the White House at the same time. In 2008, we were told the only way for the nation to move past race was to elect him as president. And 53 percent of voters fell for it. Now, Ann Coulter fearlessly explains the real his­tory of race relations in this country, including how white liberals twist that history to spring the guilty, accuse the innocent, and engender racial hatreds, all in order to win politically. You’ll learn, for instance, howA U.S. congressman and a New York mayor con­spired to protect cop killers who ambushed four police officers in the Rev. Louis Farrakhan’s mosque.The entire Democratic elite, up to the Carter White House, coddled a black cult in San Francisco as hun­dreds of the cult members marched to their deaths in Guyana.New York City became a maelstrom of racial hatred, with black neighborhoods abandoned to crimi­nals who were ferociously defended by a press that assessed guilt on the basis of race.Preposterous hoax hate crimes were always believed, never questioned. And when they turned out to be frauds the stories would simply disappear from the news.Liberals quickly switched the focus of civil rights laws from the heirs of slavery and Jim Crow to white feminists, illegal immigrants, and gays.Subway vigilante Bernhard Goetz was surprisingly popular in black neighborhoods, despite hysterical denunciations of him by the New York Times.Liberals slander Republicans by endlessly repeating a bizarro-world history in which Democrats defended black America and Republicans appealed to segregationists. The truth has always been exactly the opposite.Going where few authors would dare, Coulter explores the racial demagoguery that has mugged America since the early seventies. She shines the light of truth on cases ranging from Tawana Brawley, Lemrick Nelson, and Howard Beach, NY, to the LA riots and the Duke lacrosse scandal. And she shows how the 2012 Obama campaign is going to inspire the greatest racial guilt mongering of all time.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Audiobook",
    "Race",
    "Cultural",
    "American"
  ],
  "author": "Ann Coulter",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/15808231-mugged"
}