{
  "title": "Jane Eyre",
  "description": "From A to Z, the Penguin Drop Caps series collects 26 unique hardcovers—featuring cover art by type superstar Jessica Hische It all begins with a letter. Fall in love with Penguin Drop Caps, a new series of twenty-six collectible and gift-worthy hardcover editions, each with a type cover showcasing a gorgeously illustrated letter of the alphabet by superstar type designer Jessica Hische, whose work has appeared everywhere from Tiffany & Co. to Wes Anderson's film  Moonrise Kingdom  to Penguin's own bestsellers  Committed and  Rules of Civility . A collaboration between Jessica Hische and Penguin Art Director Paul Buckley,  the series design encompasses foil-stamped paper-over-board cases in a rainbow-hued spectrum across all twenty-six book spines and a decorative stain on all three paper edges. Penguin Drop Caps debuts with an “A” for Jane Austen’s  Pride and Prejudice , a “B” for Charlotte Brontë’s  Jane Eyre , and a “C” for Willa Cather’s  My Ántonia , and continues with more classics from Penguin.B is for Brontë.  A novel of intense power and intrigue,  Jane Eyre  dazzles and shocks readers with its passionate depiction of a woman's search for equality and freedom. Orphaned Jane Eyre grows up in the home of her heartless aunt, where she endures loneliness and cruelty, and at a charity school with a harsh regime. This troubled childhood strengthens Jane's natural independence and spirit—which proves necessary when she takes a position as governess at Thornfield Hall. But when she finds love with her sardonic employer, Rochester, the discovery of his terrible secret forces her to make a choice. Should she stay with him and live with the consequences, or follow her convictions, even if it means leaving the man she loves?",
  "genres": [
    "Fiction",
    "Gothic",
    "Historical Fiction",
    "Literature",
    "Historical",
    "Audiobook",
    "School"
  ],
  "author": "Charlotte Brontë",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/15808236-jane-eyre"
}