{
  "title": "Beyond Nostalgia",
  "description": "Praised as a monumental romance, a Gone with the Wind for the 20th Century, Beyond Nostalgia  is an unforgettable love story that shows us what it is like to love and be loved so intensely that life can never be the same again.New York teenagers Dean Cassidy and Theresa Wayman live in a world of hard concrete, dark bricks and tough breaks.They both come from dysfunctional families at the bottom rungs of the social ladder, where happiness never comes easy. Theresa's father was shot dead at a bank robbery a few years ago. Dean's father is alive, but he has a mean temper and a nasty tongue that constantly cuts into the heart of his family. And as if all that isn't enough to deal with, Dean's mother is a paranoid schizophrenic and Theresa's is a hardcore alcoholic.But on a cold, damp night in the spring of 1967, things suddenly look up for the underprivileged kids. It seems fate is finally in a benevolent mood when the free-spirited Dean and downright gorgeous Theresa meet at a high school dance. From there things only get better.For the next year the youths, who've always been knocked around, bring the light of hope into each other's hearts. Together they manage to beat back all the negativity that keeps coming at them, and they have the time of their lives.Unfortunately, though, fate is an unpredictable force. And when Dean's better judgement lapses, just one time, the mistake he makes causes Theresa to be pulled from his arms. After that the years slip away and the two lovers push on with their lives the best they can. They both get married, and Dean has two lovely kids, but the sun never sets on a day that they don't think of one another.Is it possible that destiny might reunite Dean and Theresa someday? If it does, what would the consequences be for them and their families? If it doesn't, could they ever be truly happy again?",
  "genres": [
    "Romance",
    "Fiction",
    "Contemporary",
    "Unfinished"
  ],
  "author": "Tom Winton",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/10583955-beyond-nostalgia"
}