{
  "title": "Shake Down the Stars",
  "description": "When you’re in trouble, and sinking fast, who do you call? Piper Nelson is stuck. She can’t quite stay away from the husband she divorced. She isn’t always attentive to the high school students she teaches. And even she admits that she’s been drinking too much and seeking out unsuitable men. Piper’s mother, married to a celebrity evangelist, and her sister, immersed in plans to wed a professional football player and star in a reality TV show, are both too self-absorbed to sympathize with Piper’s angst. They tell her to get a grip. But how can Piper ever really recover from the blow she suffered five years ago, when a car accident took the life of her young daughter? When Piper’s ex-husband announces his new girlfriend is pregnant, Piper is forced to take stock. Realizing that it’s time for a change is one step, but actually making it happen is quite another. And despite what she thinks, Piper can’t do it alone Lucky for her, a couple of crazy, funny new friends are ready to step in when she needs them most…and show her how to live and laugh again. \"Shake Down the Stars is a treat. Renee Swindle’s writing is funny, sharp, heartbreaking, and quirky, and her non-stock characters wonderfully memorable…Enjoy the ride.”— Lalita Tademy, New York Times bestselling author of Can River and Red River“Renee Swindle’s Shake Down the Stars is a rich, savvy exploration of the many kinds of love, loss, and dysfunction that can unearth us or save us, bedevil us or deliver us… as complex and hilarious as it is surprising and lovely. Shake Down the Stars holds a mirror up to our best and worst selves and Swindle writes with unflagging compassion and irresistible humor.”— ZZ Packer, author of Drinking Coffee Elsewhere“I love, love, love Renee Swindle’s Shake Down the Stars! It’s fresh and unfamiliar— which is quite the trick these days! I love the protagonist and the very unlikely yet charming love interest. The novel manages to be both light and heavy all at the same time. I cannot tell you how much I like it. Well, I can… I LOVED IT. Seriously. One of my favorite reads of the past couple years.”— Nichelle Tramble Spellman, author of The Dying Ground and The Last King“You are about to get a big treat… Renee Swindle’s novel Shake Down the Stars is funny, bitter as coffee, sweet as sugar and as moving as an earthquake. Enjoy!”— Farai Chedya, author of Kiss the Sky“I love this story of a woman trying to pull herself together after a tragic incident. Renee Swindle is a great writer and storyteller. Her characters are smart and witty and will stay with readers long after the novel ends. I hope you love Shake Down the Stars as much as I do!”— Jackllyn Luckett, author of Searching for Tina Turner and Passing Love“Renee Swindle’s novel Shake Down the Stars has lyrical, poignant prose that promises to resonate with readers. The characters are emotionally and culturally charged, and their lives remind me of my own. While reading, I was transported inside an unbelievable world of crazy, wonderful folks.”— Deborah Santana, author of Space Between the Stars",
  "genres": [
    "Fiction",
    "Contemporary"
  ],
  "author": "Renee Swindle",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/15808589-shake-down-the-stars"
}