{
  "title": "The Children of Kings",
  "description": "A Novel of Darkover®Millennia ago, the planet Darkover, a cold world orbiting a giant red sun, was settled by a lost colony ship from the Terran Federation. Alone on a new world, survivors interbred with the native chieri, psychically Gifted alien humanoids. The children of these matings were Gifted with telepathy and other psychic abilities, and their descendants, the aristocratic Comyn, forged a civilization in which the arts of the mind were cultivated and cherished. When the Terrans rediscovered Darkover, the seven Domains of the Comyn struggled to maintain their unique culture and independence, often at a terrible price. More than once, assassins and environmental saboteurs from the Terran Empire attempted to bring Darkover to its knees and erode the native culture for the benefit of the Federation—seeing Darkover as nothing more than a port of call for Terran mili-tary and trade. Eventually, a vicious interstellar war forced Federation forces to withdraw from Darkover, but Darkovans knew that it was only a matter of time before they would return.Prince Gareth Elhalyn has grown up in the shadow of his legendary grandfather, Regis Hastur, one of the greatest leaders Darkover has ever known. But he is also haunted by fear of the insanity that is so prevalent in his Elhalyn family line. His world has become an unbearable counterpoint of meaningless aristocratic frivolity and dangerous political schemes—plots in which powerful lords attempt to use him to further their own ambitions. Overwhelmed by the memory of his famously brilliant ancestor, and fearful of the family's genetic weakness, he tries his best to better himself through the study of languages, swordplay, and training his psychic laran with his grandmother, Linnea Storn-Hastur, Keeper of Comyn Tower. But Gareth cannot stop dreaming about a future without fame or family specters. His romantic spirit longs for escape from a life he feels is unfulfilling and limited. In a desperate attempt to remove himself completely from the restricted life of the Comyn,'Gareth confesses his desires to his powerful grandmother, and with her blessing, disguises himself as a simple trader and travels to Carthon, on the border of the barbarous, warlike Dry Towns. The Dry Towns do not live under the rule of the Comyn, and no one in this isolated part of Darkover will recognize a Comyn lord.In Carthon, protected by his guise of anonymity, Gareth overhears rumors of deadly, illegal Terran blasters being used in the barren lands beyond Shainsa—one of the main Dry Towns. If the Federation has returned and is now arming the bellicose Dry Towners with banned technology, it will mean a disastrous conflict for the Comyn of the Domains, who have long sworn themselves to the Compact, an oath of honor that forbids the use of distance weaponry. Venturing deeper and deeper into the desert lands, Gareth stumbles upon a terrible reality no one could have suspected and he is ill-prepared to deal with. But in fact Gareth holds the key to protecting his world, if he can only stay alive in the deadly Dry Towns long enough to discover what it is....Cover art by Matthew Stawicki",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Fiction",
    "Science Fiction Fantasy",
    "Adventure",
    "Sci Fi Fantasy",
    "Magic"
  ],
  "author": "Deborah J. Ross",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/15808618-the-children-of-kings"
}