{
  "title": "Modernist Cuisine at Home",
  "description": "The culinary revolution that has transformed restaurant menus around the world is also making its way into home kitchens. The Cooking Lab, publisher of the encyclopedic six-volume set Modernist Cuisine, which immediately became the definitive reference for this revolution, has now produced a lavishly illustrated guide for home cooks, complete with all-new recipes tailored for cooking enthusiasts of all skill levels.Modernist Cuisine at Home, by Nathan Myhrvold with Maxime Bilet, is destined to set a new standard for home cookbooks. The authors have collected in this 456-page volume all the essential information that any cook needs to stock a modern kitchen, to master Modernist techniques, and to make hundreds of stunning recipes. The book includes a spiral-bound Kitchen Manual that reprints all of the recipes and reference tables on waterproof, tear-resistant paper. Drawing on the same commitment to perfection that produced Modernist Cuisine, Modernist Cuisine at Home applies innovations pioneered by The Cooking Lab to refine classic home dishes, from hamburgers and wings to macaroni and cheese. More than 400 new recipes are included, most with step-by-step photos that make it easy to bring dining of the highest quality to your own dinner table.Among the amazing techniques you’ll find are:how to cook fish and steak perfectly every time, whether you’re in the kitchen, the backyard, or tailgating in a parking lot;how to use a pressure cooker to make stocks in a fraction of the usual time while capturing more of the flavor;the secret to making quick, sumptuous caramelized vegetable soups and purees;how to outfit your home oven to make pizzas as crispy as you would get from a wood-fired brick ovenalong with recipes for:perfect eggs and breathtaking omelets that remove the guesswork for stress-free breakfasts, even for a crowd;gravies and a hollandaise sauce that are wonderfully rich, perfectly smooth, and never separate;a flawless cheeseburger and an ultrafrothy milk shake;chicken wings made better with Modernist techniques, plus seven great sauces and coatings for them;macaroni and cheese, including stove-top, baked, and fat-free versions, that can be made with any cheese blend you like, from gouda and cheddar to jack and Stilton.Cooking like a Modernist chef at home requires the right set of tools, but they’re less expensive and easier to find than you might think. You’ll also learn how to get the best out of the kitchen appliances you already own. Learn how to use your microwave oven to steam fish and vegetables to perfection, make exceptional beef jerky, and fry delicate herbs.The first 100 pages of the book are a trove of useful information, such as:how to test the accuracy of a thermometer, and why it’s time to switch to digital;how to use (and not to use) a blowtorch to sear food fast and beautifully;how to marinate meats more quickly evenly by injecting the brine;the myriad uses for a whipping siphon beyond whipped cream;why those expensive copper pans may not be worth the price;how to deep-fry without a deep fryer;how to stop worrying and get the most out of your pressure cooker;how to cook sous vide at home with improvised equipment, a special-purpose water bath, or a home combi oven.Modernist Cuisine at Home is an indispensable guide for anyone who is passionate about food and cooking.",
  "genres": [
    "Cooking",
    "Cookbooks",
    "Food",
    "Nonfiction",
    "Reference",
    "Culinary",
    "Food and Drink"
  ],
  "author": "Nathan Myhrvold",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/15809443-modernist-cuisine-at-home"
}