{
  "title": "Jesus Potter Harry Christ: The Fascinating Parallels Between Two of the World's Most Popular Literary Characters",
  "description": "LET’S SKIP THE INTRODUCTIONS. You don’t need me to tell you that Jesus Christ and Harry are two of the most famous celebrities in the world, whose stories have been translated into dozens of languages and found international support in diverse cultures. What you may not be aware of, however, is the mysterious, complicated and intriguing relationship between them. For example, did you know that the topics “I read Harry Potter and Jesus still loves me,” “Even Jesus reads Harry Potter” and “Harry Potter will return sooner than Jesus” each have their own Facebook group, or that Wikipedia has a page dedicated to “Religious debates over the Harry Potter Series”? Much more remarkable than their respective popularity is the significant tension – and unexpected affinity – between them... At first glance it may seem that J.K. Rowling’s boy wizard and the crucified Jesus prophet who became the Christian savior have absolutely nothing to do with each other – and yet the unease and sometimes outright animosity between the followers of these two figures suggests otherwise. Harry has been banned, burned, and abused by religious fundamentalists for over a decade. At the release of Rowling’s final book, however, many readers were surprised to discover parallels between Jesus and Harry that, in such apparently diverse world-views, had no right to be there. As a result, recent years have witnessed a revolution in Christian responses to Harry, with many groups, writers and religious leaders praising Rowling’s young sorcerer as ultimately Christian and a clear metaphor for Jesus Christ. And yet the most spine-tingling question has so far been ignored: Why do these similarities exist at all? Although it is easy to accept that Rowling crafted the literary character of Harry Potter after the figure of Jesus, shouldn’t it pique our interest that Jesus – a monumental figure in modern world religion generally believed to have been historical – has so much in common with the obviously fictional fantasy world and character of Harry Potter?The main distinction, it will be argued, is that Jesus Christ is real: Jesus has traditionally been viewed as a historical figure, while Harry is instantly recognized as fiction. But does this distinction apply to the many seemingly mythical elements in the gospels? Can Jesus’ miracles be separated from Harry’s magic tricks because they really happened – or will we allow that certain features of the gospels were exaggerated or intended to be literary. And if so, where do we stop? What protects Jesus from the claim that he is, like Harry, a fictional character?This is the starting point of Jesus Potter Harry Christ; an innovative treatise into religious history, comparative mythology, astrological symbolism and contemporary culture. From ancient mystery religions to modern fairy tales, from fictional Hogwarts to the ruins of Jerusalem, Derek Murphy, PhD in Comparative Literature at one of the world's top universities, narrows in on one crucial question: How do we separate the obviously mythical literature of Jesus Christ from the historical man himself?PRAISE FOR JESUS POTTER HARRY CHRIST:\"My initial response to reading the title was that this was a joke of some sort. But I encourage anyone interested in the gospels and Jesus as literature to read the content below and see that it does seek to be a serious contribution to an understanding of the literary and mythical character of Jesus. Neither is this a slur against Christianity. The author rightly explains that the fictional nature of characters does not detract from the positive influence that character can have on those who love them. The author also answers pertinent questions about his rationale for writing such a book, the status, history and grounds of Jesus-mythicism. I particularly like the main idea of this book: Our question then is not whether Jesus Christ existed, but whether the literary character recorded in the New Testament was primarily inspired by a historical figure or previous literary traditions and characters.\" Neil Godfrey\"Particularly absorbing and highly topical: namely, the idea that nothing substantially separates Jesus of Nazareth from Harry Potter except that most human beings believe in the historical reality of the former. Instead, both figures entertain astonishingly parallel personality traits that derive from universal myths. As part of the continuing debate over the nature of Christ, not only among Christians but between them and today's wave of atheist thinkers, Jesus Potter, Harry Christ is timely. Linking this analysis, moreover, to J. K. Rowling's globally popular character further heightens its relevancy.\" Jeff Crouse, Ph.D - Parmenides\"This is probably the first time a book encapsulates the works of contemporary mythicists such as G.A. Wells, Timothy Freke, Tom Harpur, Acharya S., Earl Dougherty, and Robert Price. Murphy bares a scalpel intellect in his first scholarly venture, dissecting the figure of Jesus Christ while peeling open the wonderful tales the other rising-dying godmen that once upon a time captivated pagan audiences across western civilization. Murphy never explicitly denies the historicity of Jesus Christ, but indicates that he has been basically swallowed whole by imagination and legendry.\" Aeon Byte Gnostic Radio\"Absolutely loved it! With so much misinformation being disseminated about Jesus Christ, this book was refreshing. Derek pulls from notable and reliable sources to frame his arguments in a way that is both intriguing and satisfying. His insights into the phenomena that captivate the fans of literary characters like Harry Potter and Jesus Christ are extraordinary. To anyone who enjoys a mystery being unraveled, Harry Potter Jesus Christ is a must read.\" Andrea Griffith, The Social I.Q. Lady\"I'm impressed. A lot. I figured that \"Jesus Potter, Harry Christ\" would focus on the commonalities between Jesus Christ and Harry Potter, but Murphy's aims are a lot more ambitious. And interesting. In a highly readable yet semi-scholarly style, he sets out to examine the origins and evolution of Christianity, seeking evidence for a historical Jesus who is akin to the mythical figure revered by believers today. While unreal in an objective sense, Murphy demonstrates that the myths told in the New Testament and the Harry Potter series can point to personal truths that offer comfort, solace, and courage to anyone (which, really, is everyone) seeking to live life more fully, happily, and boldly. \"Jesus Potter, Harry Christ\" demolishes part of the foundation of Christianity, Jesus' purported uniqueness and godly heritage, but leaves the most important part: our capacity as humans to become more and better than we are now.\" Brian Hines, author of best-selling book on Plotinus, \"Return to the One\"",
  "genres": [
    "Nonfiction",
    "Religion",
    "Mythology",
    "Skepticism"
  ],
  "author": "Derek S. Murphy",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/10585061-jesus-potter-harry-christ"
}