{
  "title": "A Good Man",
  "description": "\"[Vanderhaeghe is] the best all-round novelist at work in Canada today. . . A Good Man is the kind of impeccably crafted, Dickensian charmer we have come to expect from Vanderhaeghe. . . . Remarkable . . . Deeply satisfying . . . Vanderhaeghe's descriptions of the natural world [are] often as striking as Cormac McCarthy's. . . . A towering achievement worthy of celebration as loud as our humble voices can declare.\"— The Globe and MailBest-selling author Guy Vanderhaeghe’s final installment in his frontier trilogy is at once a riveting account of personal and historic revenge, and the endearing story of an unlikely love affair.Wesley Case, a former soldier and the son of a Canadian lumber baron, sets out into the untamed borderlands between Canada and the United States to escape a dark secret from his past. He settles in Montana where he hopes to buy a cattle ranch, and where he begins work as a liaison between the American and Canadian militaries in an effort to contain the Native Americans’ unresolved anger in the wake of the Civil War. Amid the brutal violence that erupts between the Sioux warriors and U.S. forces, Case’s plan for a quiet ranch life is further compromised by an unexpected he falls in love with the beautiful, outspoken, and recently widowed Ada Tarr. It’s a budding romance that soon inflames the jealousy of Ada’s quiet and deeply disturbed admirer, Michael Dunne. When the American government unleashes its final assault on the Indians, Dunne commences his own vicious plan for vengeance in one last feverish attempt to claim Ada as his own.Vanderhaeghe expertly weaves a gritty account of the end of the Wild West with an intimate tale of love, retribution, and rebirth. Beautifully imagined and deeply moving, A Good Man is Vanderhaeghe’s triumphant conclusion to his venerated turn-of-the-century epic.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Westerns",
    "Canada",
    "Canadian Literature",
    "Historical",
    "Native Americans"
  ],
  "author": "Guy Vanderhaeghe",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/15811127-a-good-man"
}