{
  "title": "The Test of Courage: Michel Thomas",
  "description": "The story of Michel Thomas reads like a thriller in which adventure and heartbreak combine to produce a unique form of wisdom. Until his death in 2005, he taught languages to ghetto kids, heads of industry and movie stars in a matter of days, succeeding even with people who considered themselves hopeless linguists. To those who have been taught by him, he seemed to be a miracle worker with a magical gift for unlocking the secret powers of the mind.This unique understanding was gained under extreme circumstances. Stateless in Vichy France at the beginning of the Second World War, he was incarcerated and starved in a concentration camp at the foot of the Pyrenees. Forced into slave labour in a coal mine in Provence, he avoided being sent to Auschwitz by hiding within the confines of a deportation camp for six weeks.He escaped death to join the Secret Army of the Resistance. He was arrested and interrogated by Klaus Barbie, Butcher of Lyon, whom he deceived into releasing him, and was later re-arrested by the French Gestapo and tortured. He held out by entering a psychological state in which he no longer registered pain and after six hours of torture, his tormentors threw him into a cell and he survived to re-join the Resistance. After the Allies invaded France he joined the American forces, fought his way into Germany and was with the troops who liberated Dachau. He personally interrogated the camp’s hangman and oversaw his handwritten confession.At the end of the war he became a Nazi-hunter. Working for American Counter Intelligence he posed as a Nazi himself to infiltrate and expose underground networks of SS men dedicated to the return of a Fourth Reich.In spite of the fact that his entire family had been murdered in Auschwitz, and many close friends killed in combat, at the very end of the war he staged an elaborate gala evening in Munich which he called a Reconciliation Concert. Using German musicians, and in defiance of strict Allied non-fraternisation laws, he brought friend and foe together in the belief that there had to be a different and better future.Author Christopher Robbins has dug deep to explore and substantiate the details of the Michel Thomas story. He has authenticated every episode through camp records, Vichy documents, Resistance papers, US Army reports and hundreds of hours of interviews with this extraordinary man. The result is one of the most inspirational stories of the 20th century.",
  "genres": [
    "Biography",
    "Nonfiction",
    "History",
    "War",
    "Memoir",
    "Holocaust",
    "World War II"
  ],
  "author": "Christopher Robbins",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/15810946-the-test-of-courage"
}