{
  "title": "City of Light",
  "description": "Set amid the glamour of Paris on the brink of La Belle Époque, City of Light is a tale of murder, mystery, and masks where no one is quite what they seem…City of Light, the second book in the City of Mystery series, opens in 1889 Paris on the eve of the Exposition Universelle, the ultimate World’s Fair which debuted Edison’s phonograph, Buffalo Bill’s Wild West Show, and the Eiffel Tower. Detective Rayley Abrams has traveled from Scotland Yard to France to study the new science of forensics with the Parisian police. Lonely and awkward, Rayley easily falls under the spell of a beautiful British expatriate named Isabel Blout, a woman with a murky past and suspicious social connections. Paris may be abuzz with excitement, but there are also rumors that the Exposition is running out of money and that Eiffel may not finish his celebrated tower in time for the opening day celebrations. The French police are so eager to present a perfect image to the eyes of the world that when a most unusual victim washes up on the banks of the Seine, they literally keep the murder under wraps. Back in London, Queen Victoria has rewarded Rayley’s friend and rival, Trevor Welles, for his work on the Jack the Ripper case by naming him head of Scotland Yard’s first forensics unit. Trevor scrambles to assemble his team: Tom Bainbridge, an aristocratic young medical student, Emma Kelly, sister of the Ripper’s last victim, and Davy Mabrey, a bobby with profound common sense and a knack for earning the trust of witnesses. The unit is investigating a raid on a male brothel when an alarming telegram draws them to Paris and into the drama and intrigue surrounding the Exposition. But will Trevor and his team be able to unravel the web of deception in time to save Rayley?",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Thriller",
    "France",
    "Historical Mystery"
  ],
  "author": "Kim   Wright",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/15811158-city-of-light"
}