{
  "title": "The Alchemists: Three Central Bankers and a World on Fire",
  "description": "When the first fissures became visible to the naked eye in August 2007, suddenly the most powerful men in the world were three men who were never elected to public office. They were the leaders of the world’s three most important central Ben Bernanke of the U.S. Federal Reserve, Mervyn King of the Bank of England, and Jean-Claude Trichet of the European Central Bank. Over the next five years, they and their fellow central bankers deployed trillions of dollars, pounds and euros to contain the waves of panic that threatened to bring down the global financial system, moving on a scale and with a speed that had no precedent.Neil Irwin’s The Alchemists is a gripping account of the most intense exercise in economic crisis management we’ve ever seen, a poker game in which the stakes have run into the trillions of dollars. The book begins in, of all places, Stockholm, Sweden, in the seventeenth century, where central banking had its rocky birth, and then progresses through a brisk but dazzling tutorial on how the central banker came to exert such vast influence over our world, from its troubled beginnings to the Age of Greenspan, bringing the reader into the present with a marvelous handle on how these figures and institutions became what they are – the possessors of extraordinary power over our collective fate.  What they chose to do with those powers is the heart of the story Irwin tells.Irwin covered the Fed and other central banks from the earliest days of the crisis for the Washington Post , enjoying privileged access to leading central bankers and people close to them. His account, based on reporting that took place in 27 cities in 11 countries, is the holistic, truly global story of the central bankers’ role in the world economy we have been missing.  It is a landmark reckoning with central bankers and their power, with the great financial crisis of our time, and with the history of the relationship between capitalism and the state. Definitive, revelatory, and riveting, The Alchemists shows us where money comes from—and where it may well be going.",
  "genres": [
    "Economics",
    "Finance",
    "History",
    "Nonfiction",
    "Business",
    "Politics",
    "Biography"
  ],
  "author": "Neil Irwin",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/15811499-the-alchemists"
}