{
  "title": "Inside Rehab: The Surprising Truth About Addiction Treatment—and How to Get Help That Works",
  "description": "What happens inside drug and alcohol rehabilitation centers and how rehab works are a mystery to those outside the industry – and sometimes even to those inside it.Anne M. Fletcher is a trusted New York Times bestselling health and medical writer who visited 15 addiction treatment centers—from outpatient programs for the indigent to famous celebrity rehabs; from the sites of renowned Twelve-Step centers to several unconventional programs—to find out what really happens. What she reveals ranges from inspirational to irresponsible, and, in some cases, potentially dangerous.Real Stories: As always with her books, Fletcher gets the inside story by turning to real people who “have been there,” interviewing more than 100 individuals whose compelling stories illustrate serious issues facing people in rehab and endemic in the rehab industry today.Connected Writer and Researcher who has earned the respect (and cooperation) of experts throughout the fields she’s taken on. Inside Rehab is no exception—Fletcher has interviewed more than 100 professionals working in the field, including a mix of rehab staffers and administrators as well as leading academics.Rehab is constantly covered in the media, as celebrities battle their drug and alcohol issues in the spotlight and reality TV puts recovery in prime time. Addiction is no longer only a personal struggle—it’s a pop culture phenomenon.Myth Busting: Fletcher exposes twelve supposed facts for the falsehoods they are, including “rehab is necessary for most people to recover from addictions;” “highly trained professionals provide most of the treatment in addiction programs;” and “drugs should not be used to treat a drug addict.” Fletcher’s most important finding is the alarming discrepancy between the treatments being employed at many rehab centers and the treatments recommended by leading experts and supported by scientific research.Guidance and Practical Solutions: Inside Rehab also highlights what is working, spotlights state-of-the-art programs and practices, and offers advice and guidance for people seeking quality care and treatment for themselves or those they care about.Inside Rehab is the first book to give readers a thoughtful, sensitive, and bracingly honest insider’s view of the drug and alcohol rehab industry in America. For people seeking quality care for themselves or a loved one, Inside Rehab is essential reading, offering a wealth of accurate information and wise guidance.",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Health",
    "Audiobook",
    "Science",
    "Self Help",
    "Medical"
  ],
  "author": "Anne M. Fletcher",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/15811498-inside-rehab"
}