{
  "title": "Present Shock: When Everything Happens Now",
  "description": "\"If the end of the twentieth century can be characterized by futurism, the twenty-first can be defined by presentism.\" This is the moment we've been waiting for, explains award-winning media theorist Douglas Rushkoff, but we don't seem to have any time in which to live it. Instead we remain poised and frozen, overwhelmed by an always-on, live-streamed reality that our human bodies and minds can never truly inhabit. And our failure to do so has had wide-ranging effects on every aspect of our lives.People spent the twentieth century obsessed with the future. We created technologies that would help connect us faster, gather news, map the planet, compile knowledge, and connect with anyone, at anytime. We strove for an instantaneous network where time and space could be compressed.Well, the future's arrived. We live in a continuous now enabled by Twitter, email, and a so-called real-time technological shift. Yet this now is an elusive goal that we can never quite reach. And the dissonance between our digital selves and our analog bodies has thrown us into a new state of anxiety: present shock.Rushkoff weaves together seemingly disparate events and trends into a rich, nuanced portrait of how life in the eternal present has affected our biology, behavior, politics, and culture. He explains how the rise of zombie apocalypse fiction signals our intense desire for an ending; how the Tea Party and Occupy Wall Street form two sides of the same post-narrative coin; how corporate investing in the future has been replaced by futile efforts to game the stock market in real time; why social networks make people anxious and email can feel like an assault. He examines how the tragedy of 9/11 disconnected an entire generation from a sense of history, and delves into why conspiracy theories actually comfort us.As both individuals and communities, we have a choice. We can struggle through the onslaught of information and play an eternal game of catch-up. Or we can choose to live in the present: favor eye contact over texting; quality over speed; and human quirks over digital perfection. Rushkoff offers hope for anyone seeking to transcend the false now.Absorbing and thought-provoking, Present Shock is a wide-ranging, deeply thought meditation on what it means to be human in real-time.",
  "genres": [
    "Nonfiction",
    "Technology",
    "Psychology",
    "Sociology",
    "Philosophy",
    "Science",
    "Cultural"
  ],
  "author": "Douglas Rushkoff",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/15811513-present-shock"
}