{
  "title": "Novels 2001–2007: The Dying Animal / The Plot Against America / Exit Ghost",
  "description": "The Library of America’s definitive edition of Philip Roth’s collected works continues with the novels written in his late sixties and early seventies.The Dying Animal (2001) completes the chronicle of the erotic metamorphoses of David Kepesh, depicted previously in The Breast and The Professor of Desire. Here Kepesh is over sixty when he sets out to seduce Consuela Castillo, his decorous student of twenty-four, the daughter of wealthy Cuban exiles. Unintentionally, Consuela subverts his well-ordered life with an adventure deformed by jealousy that evolves into a story of grim loss. Roth again entangles the fate of his characters with the social forces that shape our daily lives—in The Dying Animal, with the consequences of the sexual revolution of the 1960s.When the renowned aviation hero Charles A. Lindbergh defeated Franklin Roosevelt in the 1940 presidential election, fear invaded every Jewish household in America, first because Lindbergh had publicly blamed the Jews for pushing America toward a pointless war with Nazi Germany and then because, once having taken office, he negotiated a cordial “understanding” with Adolf Hitler. What followed for Jews during the Lindbergh presidency—most particularly in the Newark household of the boy Philip Roth—is the subject of The Plot Against America (2004), the fifth of the author’s Roth books.Exit Ghost (2007) presents the final chapter in the extraordinary literary odyssey of Nathan Zuckerman, begun in 1979’s The Ghost Writer. Like a latter-day Rip Van Winkle, Zuckerman returns to New York after eleven years to find a city radically changed by the dramatic events of the new century. A rash decision quickly propels him into a complex of relationships that will expose him once more to the irresistible force of attraction, the limits of art, and the inevitability of decay.Library of America #236",
  "genres": [
    "Fiction",
    "Novels"
  ],
  "author": "Philip Roth",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/15811620-novels-2001-2007"
}