{
  "title": "Antidisestablishmentarianism",
  "description": "The Bible is a Book of ScienceSecular Humanism is a Religion of MythologyAntidisestablishmentarianism is a word you might have kidded your friends with in your school days. People once thought of it as the longest word in English, but that's probably all the thought you ever gave it. As the title of a book it's a little cumbersome, a little intimidating, except that it's absolutely essential to the discussion of Secular Humanism as America's Established religion and how we can disestablish it.Follow the history of the founding of America and its degeneration into a secularist state. This secularism occurred in defiance of the greatest documentation in the world. The founding writings spelled out the dangers of Government-Church union. They also gave the simple preventive medicine for that historic poison. Christianity was the cure, and no, it wasn't a contradiction of the so-called \"separation principle \" that they supported biblical training and Christian conduct as essential to society's survival.Follow the trail back to the beginning of man's writings, to the Tower of Babel, then forward, to see the hand in hand relationship between men who would be gods and priests who would support and share the quest for ultimate power. All the eras of history, all the continents of the world echo the same message. Man cloaks secularism, the worship of himself, in religion. He demands protection, financial support, and unlimited power for his religion called Secular Humanism. He demands death or disgrace for all who oppose him.Secularists have hijacked words we once understood. Belief, faith, and trust are legal terms denoting tested and proven evidentiary facts. These words the secularists have redefined into mysticism and opinion, blindness and stupidity. Science is physical observation of the natural world. Secularists demand that Science belong only to them and encompasses presupposition, assumptions, and uniformitarianism or \"deep time. \" The Scriptures themselves prove their scientific nature and worth. More than a score of scientific facts prove that deep time is impossible. Over and over theories of pseudo-science have risen and fallen, refuted by true scientists.Secular Humanism has permeated government, the church and individuals in ways few fully realize or understand. People must understand it, and stop the progress before belief and freedom are things of the past in America. The Scriptures give many answers and we must heed them.The book includes multiple appendices and an exhaustive bibliography detailing the hundreds of sources researched to create this work. Founding documents, court cases, testimony from ancient Greece, India, Meso-America, Africa, and the works of respected scientists and historians all speak with one voice. Secularism, man's reason, and the marriage of government and church are deadly to man's survival.We believe this book is a necessary complement to the works of many conservative and faithful writers on the subject of why America is in such a decline, such a dangerous position to lose everything that matters.",
  "genres": [],
  "author": "Michael J. Findley",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/10585345-antidisestablishmentarianism"
}