{
  "title": "The City of the Dead",
  "description": "Being dead was just the beginning. Following the appearance of an entirely new and horrifying breed of corrupted being, Rom decides that she needs answers. Under the council of an old associate, she returns from her two year search for information about the Queen to seek help from her old friends Kari and Cousins. Together, they decide to seek out answers outside of Oldtown, which leads them far past the Wild and into the mysterious City of the Dead. What answers await them there? Or will they only uncover more questions? The adventures of Rom, the young angel of death, continue in the third book of the Chronicles of Aesirium, the YA Steampunk Fantasy “The City of the Dead”. Readjusting the parasol over her shoulder, she looked both directions on the street – a superfluous action driven by years of ingrained habit – and crossed to the other corner. On this block, the lights were out along her side of the street, casting large gaping shadows across her path. Her eyes scanned the buildings – lights were out in the buildings as well, but this wasn’t too unusual. Most of the city was asleep while she and her crew worked in one of the energy plants, and extraneous lights were kept off to conserve energy. Still, it had the effect of being a bit extra anxiety-inducing. She pulled her thin rain jacket tightly about her and began walking more briskly. At the halfway mark of the street, the rain suddenly stopped, her feet shuffling on nearly dry cement. She looked up, having forgotten about the skyway that connected these two buildings more than thirty stories up. Shaking her head at her nerves, she found herself laughing softly. After more than a year working on the night shift, she would’ve thought she’d be more comfortable with the darkness by now. But something just felt…not right. Her breath caught in her throat when she realized that although she’d stopped laughing, she could still hear it. Unlike her laughter, light and delicate, this was deep and guttural; it sounded more like someone coughing than laughing. She spun about, seeking the source of the sound, but though her eyes had mostly adjusted to the deep shadow, she could see no one. Additionally, no matter which way she turned, the laughter – distant though it may be – seemed to be coming equally in all directions. The blood all but drained from her face when the pieces fell together and she looked straight up. And that was when it attacked. Her scream tore through the rain, the sounds of distant machinery and the inevitable hiss of the steamways. The sound bounced from building to building, eventually filtering into the general hum of the city and dissolved into the core static to which all the citizens of Aesirium had become immune. The City of the Dead is book 3 of the young adult steampunk fantasy series, Chronicles of Aesirium.",
  "genres": [
    "Fantasy"
  ],
  "author": "Ren Cummins",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/10585895-the-city-of-the-dead"
}