{
  "title": "The Last Train to Zona Verde: My Ultimate African Safari",
  "description": "Following the success of the acclaimed Ghost Train to the Eastern Star and The Great Railway Bazaar , The Last Train to Zona Verde is an ode to the last African journey of the world's most celebrated travel writer.“Happy again, back in the kingdom of light,” writes Paul Theroux as he sets out on a new journey through the continent he knows and loves best. Theroux first came to Africa as a twenty-two-year-old Peace Corps volunteer, and the pull of the vast land never left him. Now he returns, after fifty years on the road, to explore the little-traveled territory of western Africa and to take stock both of the place and of himself.His odyssey takes him northward from Cape Town, through South Africa and Namibia, then on into Angola, wishing to head farther still until he reaches the end of the line. Journeying alone through the greenest continent, Theroux encounters a world increasingly removed from both the itineraries of tourists and the hopes of postcolonial independence movements. Leaving the Cape Town townships, traversing the Namibian bush, passing the browsing cattle of the great sunbaked heartland of the savanna, Theroux crosses “the Red Line” into a different “the improvised, slapped-together Africa of tumbled fences and cooking fires, of mud and thatch,” of heat and poverty, and of roadblocks, mobs, and anarchy. After 2,500 arduous miles, he comes to the end of his journey in more ways than one, a decision he chronicles with typically unsparing honesty in a chapter called “What Am I Doing Here?”Vivid, witty, and beautifully evocative, The Last Train to Zona Verde is a fitting final African adventure from the writer whose gimlet eye and effortless prose have brought the world to generations of readers.",
  "genres": [
    "Travel",
    "Africa",
    "Nonfiction",
    "Memoir",
    "Angola",
    "South Africa",
    "History"
  ],
  "author": "Paul Theroux",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/15814391-the-last-train-to-zona-verde"
}