{
  "title": "Lina and Serge: The Love and Wars of Lina Prokofiev",
  "description": "Serge Prokofiev was one of the twentieth century’s most brilliant composers yet is an enigma to historians and his fans. Why did he leave the West and move to the Soviet Union despite Stalin’s crimes? Why did his astonishing creativity in the 1930s soon dissolve into a far less inspiring output in his later years? The answers can finally be revealed, thanks to Simon Morrison’s unique and unfettered access to the family’s voluminous papers and his ability to reconstruct the tragic, riveting life of the composer’s wife, Lina.Morrison’s portrait of the marriage of Lina and Serge Prokofiev is the story of a remarkable woman who fought for survival in the face of unbearable betrayal and despair and of the irresistibly talented but heartlessly self-absorbed musician she married. Born to a Spanish father and Russian mother in Madrid at the end of the nineteenth century and raised in Brooklyn, Lina fell in love with a rising-star composer—and defied convention to be with him, courting public censure. She devoted her life to Serge and to art, training to be an operatic soprano and following her brilliant husband to Stalin’s Russia. Just as Serge found initial acclaim—before becoming constricted by the harsh doctrine of socialist-realist music—Lina was at first accepted and later scorned, ending her singing career. Serge abandoned her and took up with another woman. Finally, Lina was arrested and shipped off to the gulag in 1948. She would be held in captivity for eight awful years. Meanwhile, Serge found himself the tool of an evil regime to which he was forced to accommodate himself.The contrast between Lina and Serge is one of strength and perseverance versus utter self-absorption, a remarkable human drama that draws on the forces of art, sacrifice, and the struggle against oppression. Readers will never forget the tragic drama of Lina’s life, and never listen to Serge’s music in quite the same way again.www.hmhbooks.com/linaandserge",
  "genres": [
    "Biography",
    "Music",
    "History",
    "Nonfiction",
    "Russia",
    "Memoir"
  ],
  "author": "Simon Morrison",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/15814399-lina-and-serge"
}