{
  "title": "The Enchanted Forest Chronicles",
  "description": "Linderwall is a large kingdom, just east of the Mountains of Morning, where philosophers are highly respected and the number five is fashionable. The local knights keep their armor brightly polished mainly for show - it’s been centuries since they’ve had a dragon to fight - and though there are the usual periodic problems with royal children and uninvited fairy godmothers, all in all it’s a very pleasant place. Much to Cimorene’s disgust.Cimorene is the youngest child of the King and Queen of Linderwall, and they worry about her no end. Their other daughters are perfectly normal princesses, each more beautiful than the last, with long, golden hair and sweet dispositions. Cimorene is lovely enough, but as for her disposition - well, she is unbecomingly strong-minded and stubborn.Bored silly by her regular lessons in dancing, embroidery, etiquette and such, she often sneaks off and bullies members of the castle staff into teaching her more interesting things, like magic, fencing, cooking and juggling. Greatly worried by that, her parents decide a betrothal might be just the thing to straighten Cimorene out.How wrong they are...Dealing With Dragons, the story of how Cimorene becomes the princess of the dragon Kazul (who appreciates her organizational skills and culinary mastery), discourages the unwelcome attentions of assorted chivalrous but dull would-be rescuers, and discovers how to melt wizards...Searching for Dragons, in which Kazul disappears and Cimorene sets off to find her - in the company of the King of the Enchanted Forest - borrowing a flying carpet woven with a pink teddy bear motif...Calling on Dragons, about how Cimorene, a witch named Morwen, a couple of Morwen’s cats and a rabbit named Killer (who’s been magically transformed into a flying blue donkey) thwart some dastardly wizards’ plans to drain the Enchanted Forest of magic...And Talking to Dragons, in which Cimorene’s son, Daystar, learns some surprising things about his parents and then goes off on an adventure of his own.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Fiction",
    "Dragons",
    "Childrens",
    "Middle Grade",
    "Science Fiction Fantasy"
  ],
  "author": "Patricia C. Wrede",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/1058596.The_Enchanted_Forest_Chronicles"
}