{
  "title": "Catch Rider",
  "description": "Covington, Virginia is an industrial town in the Appalachian Mountains that is home to the Criser family, a tightly knit clan of hard-bitten horse traders. At the heart of this story is Sid, a teenage girl wise and tough like her mountain ancestors. Sid's father died tragically, leaving her with her grieving mother, her mother's abusive millworker boyfriend, and her Uncle Wayne.  Sid breaks and trains horses with Wayne, resisting the temptation to drop out and work at WestVaCo, the local paper mill that has reduced a generation of farmers to factory drones.  Wayne, a caretaker and legendary horse trader, is her only moral compass, although he's known to disappear on a drunk or to chase after a married woman. Wayne knows how to survive, and he instills Sid with the confidence and daring that he no longer has.  Sid realizes she can steer her family out of the ditch they're in by selling horses with Wayne.  But horse trading isn't for the faint of heart, and the money isn't easy.  Out of options, Sid takes a job with Wayne at Oak Hill, the elite show barn in Charlottesville.  At Oak Hill, the horses are worth more than the houses in Covington and the kids take the winter off of school for the Florida circuit. The show world, however, has a side even darker than what she's seen in the back auction lots and killing pens - a world of rich parents buying championships for their children, illegal doping, and fraud.  Sid thought that being from Covington, she'd seen it all, but when she finds herself competing in the upper echelon of the horse show world in New York City, she discovers how brutal the world of high level competition can be. Perseverance is a family trait, though, and Sid won't go down without a fight.",
  "genres": [
    "Horses",
    "Young Adult",
    "Fiction",
    "Realistic Fiction",
    "Animals",
    "Abuse",
    "Contemporary"
  ],
  "author": "Jennifer H. Lyne",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/15814473-catch-rider"
}