{
  "title": "Francona: The Red Sox Years",
  "description": "From 2004 to 2011, Terry Francona managed the Boston Red Sox, perhaps the most scrutinized team in all of sports. During that time, every home game was a sellout. Every play, call, word, gesture—on the field and off—was analyzed by thousands. And every decision was either genius, or disastrous. In those eight years, the Red Sox were transformed from a cursed franchise to one of the most successful and profitable in baseball history—only to fall back to last place as soon as Francona was gone. Now, in The Red Sox Years , the decorated manager opens up for the first time about his tenure in Boston, unspooling the narrative of how this world-class organization reached such incredible highs and dipped to equally incredible lows. But through it all, there was always baseball, that beautiful game of which Francona never lost sight.As no book has ever quite done before, Francona escorts readers into the rarefied world of a twenty-first-century clubhouse, revealing the mercurial dynamic of the national pastime from the inside out. From his unique vantage point, Francona chronicles an epic era, from 2004, his first year as the Sox skipper, when they won their first championship in 86 years, through another win in 2007, to the controversial September collapse just four years later. He recounts the tightrope walk of managing unpredictable personalities such as Pedro Martinez and Manny Ramirez and working with Theo Epstein, the general managing phenom, and his statistics-driven executives. It was a job that meant balancing their voluminous data with the emotions of a 25-man roster. It was a job that also meant trying to meet the expectations of three owners with often wildly differing opinions. Along the way, readers are treated to never-before-told stories about their favorite players, moments, losses, and wins.Ultimately, when for the Red Sox it became less about winning and more about making money, Francona contends they lost their way. But it was an unforgettable, endlessly entertaining, and instructive time in baseball history, one that is documented and celebrated in Francona , a book that examines like no other the art of managing in today’s game.",
  "genres": [
    "Sports",
    "Baseball",
    "Biography",
    "Nonfiction",
    "Memoir",
    "Audiobook",
    "Autobiography"
  ],
  "author": "Terry Francona",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/15814498-francona"
}