{
  "title": "Fallen From Grace",
  "description": "FALLEN FROM GRACE by Laura Leone was a Rita Award finalist for Best Contemporary Romance. It's the story of a woman, Sara, who befriends a younger man who conceals painful secrets and a double life behind his gentle charm and good looks. As their friendship blossoms into love, Sara gradually learns the truth about Ryan, who's trapped in a world of lies, danger, and sex-for-hire. With his spirit renewed by love, Ryan becomes determined to find a way out of the life he was drawn into as a runaway minor, and equally determined to rescue a street kid whom he finds falling into the same traps which once caught him. But Ryan's secret life is lived in a ruthless world which won't easily let him go. Having fallen so far from grace, can he find his way back?Praise for Fallen From * Rita Award Finalist for Best Contemporary Romance* Desert Island Keeper, AllAboutRomance.com* No. 29 on DearAuthor.Com's list of the Top 100 Romance Novels\"In this realistically gritty, sometimes violent, and gripping tale, Leone reveals the seamier side of society's manueuvering while she spins an unconventional romance between two unhappy people who find that love, like respect, can grow out of friendship and shared experiences and that new beginnings are indeed possible for those with the determination and courage to pursue them.\"—Booklist\"Fallen From Grace is a romance novel as rich and adult as coffee laced with brandy. Laura Leone has delivered a dangerous brew of sin and redemption that goes where few romances dare to wander—a refreshing and deeply satisfying book. I loved it!\"—Bestselling author, Barbara Samuel\"Fallen From Grace is an amazingly powerful, emotional and thought-provoking book... Leone's gift for storytelling shines in a truly provocative, gritty, tender and unforgettable story.\"—Romantic Times“Fallen From Grace is provocative, powerful, and passionate. Laura Leone leads the reader on a tender, sexy journey through the human heart.\"—New York Times bestselling author Teresa Medeiros“A fast-moving, compelling read…Fallen From Grace is recommended for its unusual pairing, its audacity to examine the seamier side and its ultimate message of hope and redemption.”—The Romance Reader\"Leone's characters are richly drawn and fully human, and she displays extraordinary skill in showing how Ryan and Sara, both individually and together, work through the complexities of their situation in a believable way.\"—AllAboutRomance.com\"Laura Leone will keep readers up all night with this fascinating, passionate and emotional novel.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Adult",
    "Friends To Lovers",
    "Erotica",
    "Abuse"
  ],
  "author": "Laura Leone",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/10586027-fallen-from-grace"
}