{
  "title": "Hidden Cities: Travels to the Secret Corners of the World's Great Metropolises: a Memoir of Urban Exploration",
  "description": "In this fascinating glimpse into the world of urban exploration, Moses Gates describes his trespasses in some of the most illustrious cities in the world from Paris to Cairo to Moscow. Gates is a new breed of adventurer for the 21st century. He thrives on the thrill of seeing what others do not see, let alone even know exists. It all began quite innocuously. After moving to New York City to pursue graduate studies in Urban Planning, he began unearthing hidden facets of the city—abandoned structures, disused subway stops, incredible rooftop views that belonged to cordoned-off buildings. At first it was about satiating a niggling curiosity; yet the more he experienced and saw, the more his thirst for adventure grew, eventually leading him across five continents. In this memoir of his experiences, Gates details his trespasses through underground canals, sewers, subways, crypts, through cities spanning four continents. In this finely-written book, Gates describes his immersion in the worldwide subculture of Urban Exploring; how he joined a world of people who create secret art galleries in subway tunnels, break into national monuments for fun, and travel the globe sleeping in centuries-old catacombs and abandoned Soviet relics rather than hotels or bed-and-breakfasts. They push each other further and further—visiting the hidden side of a dozen countries, discovering ancient underground Roman ruins, scaling the Brooklyn, Manhattan, and Williamsburg bridges, partying with mole people, sneaking into Stonehenge, and even finding themselves under arrest on top of Notre Dame Cathedral.    Ultimately, Gates contemplates why he and other urban explorers are so instinctively drawn to these unknown and sometimes forbidden places—even (and for some, especially) when the stakes are high. Hidden Cities will inspire readers to contemplate the potential for urban exploration available for anyone, anywhere—if they have only the curiosity (and nerve!) to dig below the surface to discover the hidden corners of this world.",
  "genres": [
    "Travel",
    "Nonfiction",
    "Memoir",
    "Adventure",
    "History",
    "Urban Studies",
    "Biography"
  ],
  "author": "Moses Gates",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/15814887-hidden-cities"
}