{
  "title": "Forbidden Gates: How Genetics, Robotics, Artificial Intelligence, Synthetic Biology, Nanotechnology, and Human Enhancement Herald The Dawn Of TechnoDimensional Spiritual Warfare",
  "description": "While Forbidden Gates includes fresh insights for traditional, tried and true methods of overcoming darkness, it also unveils for the first time how breakthrough advances in science, technology, and philosophy—including cybernetics, bio-engineering, nanotechnology, machine intelligence, synthetic biology, and transhumanism—will combine to create mind-boggling game-changes to everything you have ever known about spiritual warfare.How so?In recent years, astonishing technological developments have pushed the frontiers of humanity toward far-reaching morphological transformation that promises in the very near future to redefine what it means to be human. An international, intellectual and fast-growing cultural movement known as transhumanism intends the use of genetics, robotics, artificial intelligence and nanotechnology (GRIN technologies) as tools that will radically redesign our minds, our memories, our physiology, our offspring, and even perhaps, as Joel Garreau in his bestselling book Radical Evolution claims, our very souls. The technological, cultural, and metaphysical shift now under way unapologetically forecasts a future dominated by this new species of unrecognizably superior humans, and applications under study now to make this dream reality are being funded by thousands of government and private research facilities around the world. As the reader will learn, this includes among other things rewriting human DNA and combining men with beasts, a fact that some university studies and transhumanists believe will not only alter our bodies and souls but could ultimately open a door to contact with unseen intelligence.As a result, new modes of perception between things visible and invisible are expected to challenge the Church in ways that are historically and theologically unprecedented. Without comprehending what is quickly approaching in related disciplines of research and development, vast numbers of believers could be paralyzed by the most fantastic—and most far reaching—supernatural implications. The destiny of each individual—as well as the future of their family—will depend on their knowledge of the new paradigm and their preparedness to face it head on.",
  "genres": [
    "Science",
    "Nonfiction",
    "Spirituality",
    "Technology",
    "Quantum Mechanics"
  ],
  "author": "Thomas Horn",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/10586040-forbidden-gates"
}