{
  "title": "Presocratics & Plato: A Festschrift at Delphi in Honor of Charles Kahn",
  "description": "This celebratory Festschrift dedicated to Charles Kahn comprises some 23 articles by friends, former students and colleagues, many of whom first presented their papers at the international \"Presocratics and Plato\" Symposium in his honor (European Cultural Center of Delphi, Greece, 3–7 June, 2009). The conference was organized and sponsored by the HYELE Institute for Comparative Studies, Parmenides Publishing, and Starcom AG, with endorsements from the International Plato Society, and the Dean of the School of Arts and Sciences, University of Pennsylvania. While Kahn's work reaches far beyond the Presocratics and Plato, it is in these subject areas that the distinction of his scholarship has come to be regarded as virtually unrivaled. The articles contributed to this volume are by some of the most renowned scholars working on these topics today, their breadth and depth bearing witness to his profound impact and influence on the discipline of Ancient Greek Philosophy.Charles Kahn taught Classics and Philosophy at Columbia University from 1957 to 1965, and has since been teaching in the Philosophy Department of the University of Pennsylvania. He spent a year as Visiting Professor at the American School of Classical Studies in Athens, and had additional Visiting Fellowships at Balliol College, Oxford and Clare Hall, Cambridge, and a term as Visiting Professor at Harvard. He is the recipient of several prestigious research grants, from the American Council of Learned Societies (1963/64 and 1984/85), the National Endowment for the Humanities (1974/75 and 1990/91), and the Guggenheim Foundation (1979/80). In 2000 he was elected Fellow of the National Academy of Arts and Sciences. He is the author of Anaximander and the Origins of Greek Cosmology, The Verb “Be” in Ancient Greek, The Art and Thought of Heraclitus, Plato and the Socratic Dialogue, Pythagoras and the Pythagoreans, and Essays on Being. His latest book,Plato and the Post-Socratic Dialogue, is forthcoming from Cambridge University Press.\n\nContributors:Julia Annas Sarah Broadie Lesley BrownTomás Calvo-MartínezDiskin ClayJohn M. DillonDorothea FredeArnold HermannCarl A. Huffman Enrique Hülsz PicconeD. M. Hutchinson Paul KalligasVassilis KarasmanisAryeh KosmanAnthony A. LongRichard McKirahanSusan Sauvé MeyerAlexander P.D.MourelatosSatoshi OgiharaRichard PattersonChristopher J. RoweDavid SedleyRichard Sorabji",
  "genres": [
    "Philosophy"
  ],
  "author": "Richard Patterson",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/15815065-presocratics-plato"
}