{
  "title": "Collateral Damage",
  "description": "Stone Barrington returns in this stunning thriller by the 'New York Times' bestselling author, Stuart Woods.Barrington is back in Manhattan after the successful but eventful opening of the Arrington Hotel in L.A.. He's pleased to receive an unexpected visit from his friend and sometime lover Holly Barker, now an assistant director at the CIA. For her part, Holly is glad to leave the staid, official environs of Washington for the dining and atmosphere of New York. But her sojourn isn’t only for pleasure. An explosive incident requires her immediate attention—and Stone’s investigative expertise.What initially appears to be a clear-cut case soon becomes increasingly complex—and dangerous. For in the secretive world of government intelligence, national interests all too often conflict with power grabs and turf wars, and extreme wealth allows even the most pursued rivals to slip through the cracks. As Stone and Holly follow the trail from London’s posh embassy district to Manhattan’s Upper East Side, they learn just how well the most cunning plans can be disguised . . . and how far some people will go to wreak vengeance.Librarian's note: the characters, settings and other information are complete as best possible (corrections are welcome!) for: #1, New York Dead, 1991; #2, Dirt, 1996; #3, Dead in the Water, 1997; #4, Swimming to Catalina, 1998; #5, Worst Fears Realized, 1999; #6, L.A. Dead, 2000; #7, Cold Paradise, 2001; #8, The Short Forever, 2002; #9, Dirty Work, 2003; #10, Reckless Abandon, 2004; #11, Two Dollar Bill, 2004; #12. Dark Harbor, 2006; #13, Fresh Disasters, 2007; #14, Shoot Him if He Runs, 2007; #15, Hot Mahogany, 2008; #16, Loitering with Intent, 2009; #17, Kisser, 2009; #18, Lucid Intervals, 2010; #19, Strategic Moves, 2010; #20, Bel-Air Dead, 2011; #21, Son of Stone, 2011; #22, D.C. Dead, 2011; #23, Unnatural Acts, 2012; #24, Severe Clear, 2012; and #25, Collateral Damage, 2012.",
  "genres": [
    "Mystery",
    "Fiction",
    "Suspense",
    "Thriller",
    "Crime",
    "Mystery Thriller",
    "Audiobook"
  ],
  "author": "Stuart Woods",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/15815347-collateral-damage"
}