{
  "title": "Why Be Happy When You Could Be Normal?",
  "description": "\"Magnificent . . . A tour de force of literature and love.\"— Vogue\" Why Be Happy When You Could Be Normal? is raucous. It hums with a dark refulgence from its first pages. . . . Singular and electric . . . [Winterson's] life with her adoptive parents was often appalling, but it made her the writer she is.\"— The New York Times\"[Winterson is] one of the most daring and inventive writers of our time—searingly honest yet effortlessly lithe as she slides between forms, exuberant and unerring, demanding emotional and intellectual expansion of herself and of us. . . . In Why Be Happy, , [Winterson's] emotional life is laid bare . . . [in] a bravely frank narrative of truly coming undone. For someone in love with disguises, Winterson's openness is all the more moving; there's nothing left to hide, and nothing left to hide behind.\"— ElleJeanette Winterson’s bold and revelatory novels have earned her widespread acclaim, establishing her as a major figure in world literature. She has written some of the most admired books of the past few decades, including her internationally best-selling first novel, Oranges Are Not the Only Fruit , the story of a young girl adopted by Pentecostal parents, that is now often required reading in contemporary fiction classes.Why Be Happy When You Could Be Normal? is a memoir about a life’s work to find happiness. It is a book full of stories: about a girl locked out of her home, sitting on the doorstep all night; about a religious zealot disguised as a mother who has two sets of false teeth and a revolver in the dresser, waiting for Armageddon; about growing up in a north England industrial town now changed beyond recognition; about the universe as a cosmic dustbin. It is the story of how a painful past, which Winterson thought she had written over and repainted, rose to haunt her later in life, sending her on a journey into madness and out again, in search of her biological mother. It is also a book about other people’s literature, one that shows how fiction and poetry can form a string of guiding lights, a life raft that supports us when we are sinking.Witty, acute, fierce, and celebratory, Why Be Happy When You Could Be Normal? is a tough-minded search for belonging—for love, identity, home, and a mother.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Biography",
    "LGBT",
    "Queer",
    "Biography Memoir",
    "Autobiography"
  ],
  "author": "Jeanette Winterson",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/15815813-why-be-happy-when-you-could-be-normal"
}