{
  "title": "Our Occulted History: Do the Global Elite Conceal Ancient Aliens?",
  "description": "The iconoclastic journalist and bestselling author goes beyond the revelations of his classic Alien Agenda, interweaving science and authentic archaeological finds with provocative speculation to show how human civilization may have originated with nonhumans who visited earth eons ago . . . and may still be here today.We are not alone.And we never have been.For years we've been taught that human progress has been a long, slow climb from the primordial ooze to hunter-gathers to empires. But that's only part of the story says Jim Marrs. The author who has investigated the recent financial crisis, the JFK assassination, secret societies, the national socialist takeover of America, and other events now takes on his biggest subject-the history of mankind-offering mind-blowing information that will radically alter the way we think about the world and our place in it.Our Occulted History overturns conventional knowledge and beliefs, presenting compelling evidence that the earth once hosted prehistoric civilizations using technologies that very well may have surpassed our own-societies that may have originated with non-humans. Sounds unbelievable? So was the concept that the earth was round-and that it revolved around the sun-to our predecessors just a few hundred years ago.Marrs sifts through the historical, scientific, and cultural record, showing how numerous ancient texts and tablets tell of visitors from the stars colonizing the Earth. From the flying vimanas of the Hindu Vedic literature and the flying shields reported by the Romans to the mysterious airships of the 1800s and the UFOs of today, he argues that someone other than us is still present on this planet. But are these visitors simply observers-or do they play a much more active and controlling role? Jim Marrs raises this shocking question and more in the provocative and persuasive Our Occulted History.The truth is out there . . . and in here.",
  "genres": [
    "Conspiracy Theories",
    "Nonfiction",
    "History",
    "Aliens",
    "Occult",
    "Audiobook",
    "Paranormal"
  ],
  "author": "Jim Marrs",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/15818279-our-occulted-history"
}