{
  "title": "American Cornball: A Laffopedic Guide to the Formerly Funny",
  "description": "An irresistible survey of things the world used to find funny—from hiccups and hangovers to henpecked husbands and old maids—and what they tell us about the world, yesterday and todayFrom noxious skunks to shifty traveling salesmen, certain free-floating ideas have been passed down through our culture for generations, each decade becoming more deeply ingrained in our shared memory—while at the same time more mysterious and inscrutable. Often dating back to vaudeville (or even to the original Greek comedies), these ideas gallivanted across the comic landscape of vaudeville revues, early comic strips, silent movies, Warner Bros. and Disney cartoons, even the sitcoms of the 1950s and ‘60s, before eventually slipping back into the past. Christopher Miller’s riotous study of bygone humor revisits nearly 200 of these comic staples, unpacking the (often unseemly) contexts in which the ideas arose, why they were funny in their time, whom their target market was-and, just as interesting, why they fell out of favor. The result is a kind of taxonomy of humor during America’s golden age; yet it also transcends the specific to offer a deeper, more profound look about the prejudices, preoccupations, and peculiarities of what Greil Marcus has called “the old, weird America”—a nation that was still polarized between urban and rural, black and white, highborn and lowbrow. Among the running jokes Miller examines: • Alley Cats• Bigamy • Boarding Houses• Career Girls and Poor Working Girls• Castor Oil• Chamber Pots• Dishwashing Husbands• Drunks and Drunkenness• Fat Men• Gold Diggers and Sugar Daddies• Hash• Hillbillies• Hoboes• Limburger • Milquetoasts • Mothers-in-Law • Murphy Beds• Opera • Outhouses• Pie Fights• Pink Elephants• The Rich • Rolling Pins• Secret Societies • Shotgun Weddings• Stuffed Shirts• Tin Cans• Yes-Men• Yokels and Hicks• ZealotsAlong the way, Miller touches on issues of racism and sexism, stereotypes, even rape, revealing how dramatically our morals and morays have shifted in just the last few decades. At its heart, though, this is a richly entertaining survey—complete with more than 100 period illustrations—of our comic universe, and how it has shifted on its axis in the past century.",
  "genres": [
    "Humor",
    "Nonfiction",
    "Comedy",
    "History",
    "Reference"
  ],
  "author": "Christopher   Miller",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/15818394-american-cornball"
}