{
  "title": "Confessions of a Latter-day Virgin: A Memoir",
  "description": "When Nicole Hardy's eye-opening \"Modern Love\" column appeared in the New York Times , the response from readers was overwhelming. Hardy's essay, which exposed the conflict between being true to herself as a woman and remaining true to her Mormon faith, struck a chord with women coast-to-coast.Now in her funny, intimate, and thoughtful memoir, Nicole Hardy explores how she came, at the age of thirty-five, to a crossroads regarding her faith and her identity. As a member of the Church of Jesus Christ of Latter-day Saints, Nicole had held absolute conviction in her Mormon faith during her childhood and throughout her twenties. But as she aged out of the Church's \"singles ward\" and entered her thirties, she struggled to merge the life she envisioned for herself with the one the Church prescribed, wherein all women are called to be mothers and the role of homemaker is the emphatic ideal.Confessions of a Latter-day Virgin chronicles the extraordinary lengths Nicole went to in an attempt to reconcile her human needs with her spiritual life--flying across the country for dates with LDS men, taking up salsa dancing as a source for physical contact, even moving to Grand Cayman, where the ocean and scuba diving provided some solace. But neither secular pursuits nor LDS guidance could help Nicole prepare for the dilemma she would eventually a crisis of faith that caused her to question everything she'd grown up believing.In the tradition of the memoirs Devotion and Mennonite in a Little Black Dress , Confessions of a Latter-day Virgin is a mesmerizing and wholly relatable account of one woman's hard-won mission to find love, acceptance, and happiness--on her own terms.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Religion",
    "Biography",
    "Biography Memoir",
    "Mormonism",
    "Book Club"
  ],
  "author": "Nicole Hardy",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/15818562-confessions-of-a-latter-day-virgin"
}