{
  "title": "Scavengers",
  "description": "With Scavengers, Steven Havill begins his new series featuring former Gastner deputy Estelle Reyes-Guzman. Estelle played a supporting role in the Gastner books, then left New Mexico to follow her surgeon husband to cold, cold Minnesota. Now she is back, welcomed by the whole department and already swamped in her role of Undersheriff under the new sheriff, Bobby Torrez. But Gastner's readers have the best of both worlds. The setting is still Posadas County, and Gastner, having taken on the presumably less stressful job of State Livestock Inspector (\"What are those? Burros?\" \"Miniature donkeys.\" \"Oh.\") is prominently in the background, even though that seems like an oxymoron.Bobby Torrez is at a law enforcement conference, and Estelle, and early after her return Estelle is landed with the case of a body is found in the desert - that of a man who has been badly beaten and then shot. Estelle and her deputies begin the forensic process -- photographing, sending the body to autopsy, looking for identification and clues as to why the man was so badly beaten and then killed. Not long afterward, the discovery of another body yields more evidence of what happened and why. But Estelle is still a long way from finding answers to all the questions involved; meanwhile she is coping with an aging mother and a case of flu that has most of her family on their aching backs. Gastner, who is in the area tracking down a rumor of animals being illegally brought over the border, can help and does, but the horrifying and breathtaking climax is Estelle's burden alone, and she carries it off with honors. In the smoothest of segues Havill skillfully retains the well-loved familiar characters and setting while craftily turning the responsibility of carrying his compelling stories to a new and engaging star.",
  "genres": [
    "Mystery",
    "Westerns",
    "Crime",
    "Audiobook",
    "Fiction",
    "Mystery Thriller",
    "Family"
  ],
  "author": "Steven F. Havill",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/1581857.Scavengers"
}