{
  "title": "Butcher's Winter",
  "description": "The people of the lands of Darbeni live in perpetual fear and despair. Once every year the servants of their overlord, Blood Eye, come to take some of their children. These precious sons and daughters are taken to the great fortress that houses Blood Eye’s seat of power. Then the children are returned to the people. But when they return they look upon the world with dead eyes and expressionless faces. Upon their throats can be seen the butcher’s slit where he drew the knife and drained the blood from these innocents. Now these children are known as Voiceless Ones. They are the eyes, ears and hands of Blood Eye and they watch, keeping the men and women of Darbeni ever fearful, ever despairing.Exiled from sanctuary, the mercenary sorcerer, Blackstone, and his small band have been trudging through the snow covered plains and hills of the land. They chance upon a runestone that marks the boundary of Darbeni when they are chased across the borderline by an unknown presence of truly mighty sorcerous power. Set upon by a group of Voiceless Ones, Blackstone’s band take sanctuary in a nearby village where the villagers hide them, then elect Blackstone as their new savior to overthrow Blood Eye. As much as Blackstone wants nothing to do with either the ruler of this land or the people who wish to overthrow him, he and his companions have no choice for they are now trapped in Darbeni. There is only one way out, through Blood Eye or through death.Overthrowing an ancient sorcerer of such great power as Blood Eye will not be easy and Blackstone is still recuperating from injuries he had previously taken while saving his ward, Hiroe. Joined by Loralune the Moonhavoc and Musty the alchemist, Blackstone and Hiroe lead the charge for freedom. There is a slim chance at least one of them might survive…",
  "genres": [],
  "author": "Jason Beineke",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/15818706-butcher-s-winter"
}