{
  "title": "I Dreamed I Was a Very Clean Tramp",
  "description": "The sharp, lyrical, and no-holds-barred autobiography of the iconoclastic writer and musician Richard Hell, charting the childhood, coming of age, and misadventures of an artist in an indelible era of rock and roll...From an early age, Richard Hell dreamed of running away. His father died when he was seven, and at seventeen he left his mother and sister behind and headed for New York City, place of limitless possibilities. He arrived penniless with the idea of becoming a poet; ten years later he was a pivotal voice of the age of punk, starting such seminal bands as Television, the Heartbreakers, and Richard Hell and the Voidoids—whose song \"Blank Generation\" remains the defining anthem of the era. Hell was significantly responsible for creating CBGB as punk ground zero; his Voidoids toured notoriously with the Clash, and Malcolm McLaren would credit Hell as inspiration for the Sex Pistols. There were kinetic nights in New York's club demi-monde, descent into drug addiction, and an ever-present yearning for redemption through poetry, music, and art.\"We lived in the suburbs in America in the fifties,\" Hell writes. \"My roots are shallow. I'm a little jealous of people with strong ethnic and cultural roots. Lucky Martin Scorsese or Art Spiegelman or Dave Chappelle. I came from Hopalong Cassidy and Bugs Bunny and first grade at ordinary Maxwell Elementary.\" How this legendary downtown artist went from a prosaic childhood in the idyllic Kentucky foothills to igniting a movement that would take over New York's and London's restless youth cultures—and spawn the careers of not only Hell himself, but a cohort of friends such as Tom Verlaine, Patti Smith, the Ramones, and Debbie Harry—is just part of the fascinating story Hell tells. With stunning powers of observation, he delves into the details of both the world that shaped him and the world he shaped.An acutely rendered, unforgettable coming-of-age story, I Dreamed I Was a Very Clean Tramp evokes with feeling, clarity, and piercing intelligence that classic journey: the life of one who comes from the hinterlands into the city in search of art and passion.",
  "genres": [
    "Music",
    "Nonfiction",
    "Memoir",
    "Biography",
    "Punk",
    "Biography Memoir",
    "Autobiography"
  ],
  "author": "Richard Hell",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/15819523-i-dreamed-i-was-a-very-clean-tramp"
}