{
  "title": "One Last Strike",
  "description": "The team that refused to give up their manager in his final season A comeback that changed baseballAfter thirty-three seasons managing in Major League Baseball, Tony La Russa thought he had seen it all—that is, until the 2011 Cardinals. Down ten and a half games with little more than a month to play, the Cardinals had long been ruled out as serious postseason contenders. Yet in the face of those steep odds, this team mounted one of the most dramatic and impressive comebacks in baseball history, making the playoffs on the night of the final game of the season and going on to win the World Series despite being down to their last strike—twice.Now La Russa gives the inside story behind this astonishing comeback and his remarkable career, explaining how a team with so much against it was able to succeed on baseball's biggest stage. Opening up about the devastating injuries, the bullpen struggles, the crucial games, and the players who made it all possible, he reveals how the team's character shaped its accomplishments, demonstrating how this group came together in good times and in bad to become that rarest of things: a team that actually enjoyed it when the odds were against them.But this story is much more than that of a single season. As La Russa, the third-winningest manager in baseball history, explains, their season was the culmination of a lifetime spent studying the game. Laying bare his often scrutinized and frequently misunderstood approach to managing, he explains his counterintuitive belief in process over result, present moments over statistics, and team unity over individual talent. Along the way he shares the stories from throughout his career that shaped his outlook—from his first days managing the Chicago White Sox to his championship years with the Oakland A's, to his triumphant tenure as St. Louis's longest-serving manager. Setting the record straight on his famously intense style, he explores the vital yet overlooked role that his personal relationships with his players have contributed to his victories, ultimately showing how, in a sport often governed by cold, hard numbers, the secret to his success has been surprisingly human.Speaking candidly about his decision to retire, La Russa discusses the changes that he'd observed both in the game and in himself that told him, despite his success, it was time to hang up his spikes. The end result is a passionate, insightful, and remarkable look at our national pastime that takes you behind the scenes of the comeback that no one thought possible and inside the mind of one of the game's greatest managers.",
  "genres": [
    "Sports",
    "Baseball",
    "Nonfiction",
    "Biography",
    "Audiobook",
    "Leadership",
    "History"
  ],
  "author": "Tony La Russa",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/15819753-one-last-strike"
}