{
  "title": "The Lady and Her Monsters: A Tale of Dissections, Real-Life Dr. Frankensteins, and the Creation of Mary Shelley's Masterpiece",
  "description": "The macabre meets art in this startling blend of grotesque nineteenth-century science and fascinating literary creation that examines the actual Victor Frankenstein's and the real-life horrors behind Mary Shelley's gothic masterpiece, FrankensteinA highly entertaining blend of literary analysis, lore, and scientific history, told with the verve and ghoulish fun of a Tim Burton film, The Lady and Her Monsters traces the origins of the greatest horror story of all time-Mary Shelley's Frankenstein-using the novel as a centerpiece from which to explore the frightful milieu in which it was written. Roseanne Montillo recounts how Shelley's Victor Frankenstein mirrored actual scientists of the period-curious and daring iconoclasts, influenced by their predecessors in the scientific age, who were obsessed with the inner workings of the human body and how it could be reanimated after death.Montillo reveals how Shelley and her contemporaries were products of their time-intellectually curious artists, writers, poets, philosophers, and others intrigued by the occultists and daring scientists appearing across Europe who risked their reputations and their immortal souls to advance our understanding of human anatomy and medicine. But their remarkable experiments could not be undertaken without the cutthroat grave robbers who prowled cemeteries for fresh corpses. The newly dead were used for both private and very public autopsies and dissections, as well as the most daring trials of all: attempts at human reanimation involving electricity-experiments eagerly attended by the likes of Shelley and other onlookers compelled by the bloody and grotesque.Juxtaposing the monstrous mechanization and exploitation of rising industrialism with the sublime beauty and decadence of Romanticism embodied in the legendary artists who defined the age, Montillo takes us into a world where poets become legends in salons and boudoirs; where fame-hungry \"doctors\" conduct shocking performances for rabid, wide-eyed audiences; where maniacal body snatchers secretly toil in castle dungeons. The result is a unique, rich, and revealing look into the creation of a classic.",
  "genres": [
    "Nonfiction",
    "History",
    "Science",
    "Biography",
    "Horror",
    "Books About Books",
    "Victor Frankenstein"
  ],
  "author": "Roseanne Montillo",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/15820479-the-lady-and-her-monsters"
}