{
  "title": "Remembering Whitney: A Mother's Story of Life, Loss, and the Night the Music Stopped",
  "description": "On the eve of the 2012 Grammy Awards, the world learned of a stunning tragedy: Whitney Houston, unquestionably one of the most remarkable and powerful voices in all of music, had been silenced forever. Over the weeks and months that followed, family, friends, and fans alike tried to understand how such a magnificent talent and beautiful soul could have been taken so early and so unexpectedly.Glamorous and approachable, captivating and sweet, Whitney had long ago won the hearts of America, but in recent years her tumultuous personal life had grabbed as many headlines as her soaring vocal talents. Her sudden death left behind not only a legacy of brilliance, but also painful questions with no easy answers.Now, for the first time, the beloved superstar's mother, Cissy Houston — a gospel legend in her own right—relates the full, astonishing scope of the pop icon's life and career. From Whitney's earliest days singing in the church choir to her rapid ascent to the pinnacles of music stardom, from her string of number one hits to her topping the Hollywood box office, Cissy recounts her daughter's journey to becoming one of the most popular and successful artists of all time. Setting the record straight, Cissy also speaks candidly about Whitney's struggles in the limelight, revealing the truth about her turbulent marriage to singer Bobby Brown, her public attempts to regain her celebrated voice, and the battle with drugs that ultimately proved too much.In this poignant and tender tribute to her \"Nippy,\" Cissy summons all her strength to reveal not only Whitney the superstar, but also Whitney as a sweet girl, a bright-eyed young woman, and a deeply caring mother.Complete with never-before-seen family photographs, Remembering Whitney is an intimate, heartfelt portrait of one of our most revered artists, from the woman who cherished her most.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Memoir",
    "Music",
    "Audiobook",
    "Biography Memoir",
    "African American"
  ],
  "author": "Cissy Houston",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/15820544-remembering-whitney"
}