{
  "title": "The Rebbe's Army: Inside the World of Chabad-Lubavitch",
  "description": "“Excuse me, are you Jewish?” With these words, the relentlessly cheerful, ideologically driven emissaries of Chabad-Lubavitch approach perfect strangers on street corners throughout the world in their ongoing efforts to persuade their fellow Jews to live religiously observant lives. In The Rebbe’s Army, award-winning journalist Sue Fishkoff gives us the first behind-the-scenes look at this small Brooklyn-based group of Hasidim and the extraordinary lengths to which they take their mission of outreach.They seem to be everywhere—in big cities, small towns, and suburbs throughout the United States, and in sixty-one countries around the world. They light giant Chanukah menorahs in public squares, run “Chabad houses” on college campuses from Berkeley to Cambridge, give weekly bible classes in the Capitol basementin Washington, D.C., run a nonsectarian drug treatment center in Los Angeles, sponsor the world’s biggest Passover Seder in Nepal, establish synagogues, Hebrew schools, and day-care centers in places that are often indifferent and occasionally hostile to their outreach efforts. They have built a billion-dollar international empire, with their own news service, publishing house, and hundreds of Websites.Who are these people? How successful are they in making Jews more observant? What influence does their late Rebbe, Menachem Mendel Schneerson (who some thought was the Messiah), continue to have on his followers? Fishkoff spent a year interviewing Lubavitch emissaries from Anchorage to Miami and has written an engaging and fair-minded account of a Hasidic group whose motives and methodology continue to be the subject of speculation and controversy.",
  "genres": [
    "Judaism",
    "Nonfiction",
    "Jewish",
    "Religion",
    "History",
    "Judaica",
    "Cultural"
  ],
  "author": "Sue Fishkoff",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/158216.The_Rebbe_s_Army"
}