{
  "title": "I'm Not Really Here",
  "description": "In his number one New York Times bestseller, Don’t Stand Too Close to a Naked Man, Tim Allen regaled us with tales from the male-female front. Now, in I’m Not Really Here, he takes a look at men in midlife—and their relationship to wives, children, friends, the universe, God, and why it’s so tough to get a good night’s sleep.The book opens with Tim suddenly waking from a strange dream. He’s been reading late into the night about today’s hot scientific topic—quantum physics—and what he’s learned about the nature of reality really disturbs him. Fortunately, he’s got plenty of time to mull it over. Tim’s wife and daughter are going away on a camping trip, and Tim is left at home with their dog, Spot. At first, he’s excited at the opportunity to eat what he wants (bologna and potato chip sandwiches), watch the sci-fi videos he loves, and finish the 1946 Ford he’s been restoring so he can deliver it to a car show on Monday. Unfortunately, he can’t find the final part: a one-of-a-kind hood ornament. He encounters very strange coincidences, meets people he doesn’t know who seem to know too much about him, and wonders if his life is half full or half empty.As he roams from room to room, Tim ponders how we wind up sounding like our parents when we raise our own children (“Don’t stir your ice cream into soup!”), men’s fascination with pricey gadgets (“Does this drill bit set really cost $89,000?”), and how romantic “chemistry” really works (“It’s all based on salt”). He describes his own rise to celebrity and what it’s like to buy groceries without wearing a mask. He explores the allure of hot cars, the temptation of fast-food chain prizes which seem to be getting bigger ad bigger all the time (“I’ll have the happy meal and the Harley, please”), and his obsession with his place in the cosmos.I’m Not Really Here deals, in the Toolman’s inimitable way, with some of the urgent questions a man faces at midlife, from “What is real?” to what should he eat for breakfast (“The gummy cinnamon buns or the cereal no one can pronounce? Moose lips. Mouse licks”). This book is a culmination of a five-year journey of self-discovery. It will surprise and challenge, make you wonder and think, and induce laughter on every page.",
  "genres": [
    "Humor",
    "Nonfiction",
    "Biography",
    "Comedy",
    "Autobiography",
    "Memoir",
    "Philosophy"
  ],
  "author": "Tim Allen",
  "average_rating": "3.32",
  "url": "https://www.goodreads.com/book/show/1058798.I_m_Not_Really_Here"
}