{
  "title": "Micah's Calling",
  "description": "Author’s Note: This is a novella supplement to the All the King’s Men series. It is highly advised that you read Rise of the Fallen before reading this novella. Reading book two of the series, Heart of the Warrior, would also be beneficial, but not absolutely necessary before reading Micah’s Calling.With the threat of Apostle behind him and Samantha’s life finally out of danger, Micah’s mating phase, known as the calling, unfurls to full strength. Unable to resist the demands of his body and the hormonal heat that drive him to propagate the vampire race, Micah loses himself in the pleasure Sam gives him, yearning for her body to receive his seed to create new life. But after what Sam has been through – barely surviving Apostle’s venomous bite, and then Micah’s own venom to counter Apostle’s and make her immortal – Micah knows Sam’s body has suffered too much to accept a child so soon.But the desire to nest and start a family isn’t the only thing Samantha has awakened in Micah. She has also stirred Micah’s long-dormant love of domination. With Sam, Micah finds himself longing to re-open his dungeon, and Sam wants to know more about this kinky world she has heard so much about but never tried. When Micah takes Sam to a scene party to introduce her to the BDSM lifestyle, their lives are turned upside-down when Micah is asked to assist in dominating a fellow dom's submissive, only to discover the submissive is his friend, Traceon.Throughout her journey in this new world Micah has introduced her to, Sam begins to realize several hard truths about herself and what she wants. Will Micah allow her to explore her new interests? And will the new direction in his friendship with Traceon prove to be too much and break the bonds that have begun to tie them to one another? Micah’s Calling is a story of devotion beyond the level of friendship that will light your imagination on fire.Strong sexual content, voyeurism, exhibitionism, BDSM, knife play, mild ménage, and much more.",
  "genres": [
    "Vampires",
    "Paranormal Romance",
    "Romance",
    "Paranormal",
    "BDSM",
    "Fantasy",
    "Erotica"
  ],
  "author": "Donya Lynne",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/15822808-micah-s-calling"
}