{
  "title": "De tijgerkat",
  "description": "Giuseppe Tomasi, de laatste prins van Lampedusa (1896-1957) kan met recht de schrijver van één boek genoemd worden. Zijn leven lang heeft hij niet veel meer gedaan dan lezen en reizen. Desondanks heeft dat leven een prachtige, compact geschreven roman opgeleverd, een visionair, poëtisch en geestig werk: De tijgerkat, dé klassieker van de moderne Italiaanse literatuur. Sicilië, 1860. Garibaldi landt bij Marsala om het eiland in te lijven bij de nieuwe, liberale eenheidsstaat Italië. Het is gedaan met de Bourbons en met de feodaliteit: de platte, alles berekenende burgerij neemt de macht over. Don Fabrizio, prins van Salina, ziet deze ontwikkeling met lede ogen aan, maar voelt zich machteloos tegenover de geschiedenis en zoekt troost in zijn studie van sterren en planeten. Zijn pupil Tancredi echter weet zich aan te passen aan het nieuwe bestel. Hij sluit zich aan bij Garibaldi, trouwt met de dochter van een steenrijke dorpsburgemeester en zal hoge posities bekleden in de nieuwe staat. De roman schetst een bedwelmend beeld van Sicilië; het landschap wordt in geuren en kleuren beschreven, je hoort de honden blaffen, ruikt de verwaarloosde tuinen en de stoffige interieurs, de mensen komen tot leven, niet alleen de adellijke en de burgerlijke heren, maar ook de boeren, de priesters, de soldaten, de verliefde jonge meisjes, de verbitterde oude vrouwen. De beschrijving van de dood van de prins, in 1883, is een van de mooiste sterfscènes van de wereldliteratuur, in 1910 is het verval van de familie compleet, de grandioze aristocratische levenswijze verworden tot een bigotte vormendienst. De Tijgerkat heeft in Italië inmiddels meer dan zeventig drukken beleefd, is verfilmd door Visconti en in alle talen vertaald. Anthonie Kee levert met zijn nieuwe vertaling van deze klassieker een prestatie van topniveau.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Italy",
    "Italian Literature",
    "Literature",
    "Novels",
    "Classics"
  ],
  "author": "Giuseppe Tomasi di Lampedusa",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/15823816-de-tijgerkat"
}