{
  "title": "Knowledge and Power: The Information Theory of Capitalism and How it is Revolutionizing our World",
  "description": "Ronald Reagan’s most-quoted living author—George Gilder—is back with an all-new paradigm-shifting theory of capitalism that will upturn conventional wisdom, just when our economy desperately needs a new direction.America’s struggling economy needs a better philosophy than the college student's \"I can't be out of money, I still have checks in my checkbook!\" We’ve tried a government spending spree, and we’ve learned it doesn’t work. Now is the time to rededicate our country to the pursuit of free market capitalism, before we’re buried under a mound of debt and unfunded entitlements. But how do we navigate between government spending that's too big to sustain and financial institutions that are \"too big to fail?\" In Knowledge and Power , George Gilder proposes a bold new theory on how capitalism produces wealth and how our economy can regain its vitality and its growth.Gilder breaks away from the supply-side model of economics to present a new economic the epic conflict between the knowledge of entrepreneurs on one side, and the blunt power of government on the other. The knowledge of entrepreneurs, and their freedom to share and use that knowledge, are the sparks that light up the economy and set its gears in motion. The power of government to regulate, stifle, manipulate, subsidize or suppress knowledge and ideas is the inertia that slows those gears down, or keeps them from turning at all.One of the twentieth century’s defining economic minds has returned with a new philosophy to carry us into the twenty-first. Knowledge and Power is a must-read for fiscal conservatives, business owners, CEOs, investors, and anyone interested in propelling America’s economy to future success.",
  "genres": [
    "Economics",
    "Business",
    "Politics",
    "Philosophy",
    "Nonfiction",
    "Leadership",
    "Technology"
  ],
  "author": "George Gilder",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/15824264-knowledge-and-power"
}