{
  "title": "Islands of the Heart",
  "description": "What is it like to be a woman so exquisitely beautiful that no-one ever really sees her face…only the dark emotions it arouses? What is it like to be a man of such physical presence he fears no-one? Are these blessings or a curse? Could a woman love such a man? And when his world begins to fall apart, can their love survive the re-ignited violence of his past? Can a man forgive himself for an act that is unspeakable? Can you? Or are there limits to your forgiveness?Islands of the Heart is the story of tough ex-soldier, Wolf, who has always handled life’s problems with his fists. Wolf finds himself drawn into a series of events where that tactic no longer works. Things are made worse when he cuts a violent swathe through New Zealand and Samoa, desperate to hide secrets from his past.Islands is also the story of the women in his life who love and fear for Wolf, who are damaged by him yet will not close their hearts; who in the end are part of his salvation.Islands is ultimately however a story of the power of forgiveness – of the fact that we all need to forgive those who have wronged us, or forever live lives stunted by the poison of our hatred.“Islands of the Heart is a wonderful and powerful novel. It provides fascinating insights into the way of life and values of Pacific people, and the grim realities of a culture clash that can bring tragedy to people’s lives. A wise, moving, unflinching and thought-provoking book, beautifully written.” – Robin Lloyd-Jones, UK, Booker Prize Nominee for Lord of the Dance.“Having studied 20th Century NZ Literature at Auckland University, I am confident that in time to come ‘Islands of the Heart’ will stand alongside ‘Man Alone’ as an iconic NZ novel. It will certainly take pride of place on my bookshelf.” – Angela Sunde, Australian author.",
  "genres": [],
  "author": "David  Stringer",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/15825211-islands-of-the-heart"
}