{
  "title": "Shaman, Healer, Heretic",
  "description": "A lone healer breaks all the rules, defies the odds, and puts her life on the line in order to save the very people who try to stop her.  Even for a techno-shaman, a kachina in the bedroom isn’t exactly part of the drill. When Olivia Lawson wakes to find one towering over her, she panics. A Hopi god visiting the real world isn't just wrong. It's impossible.  Or is it?  Soon Olivia learns that the kachina is the least of her worries. As she struggles to save her clients, clashes with other shamans, and fends off the attacks of real-world vigilantes, Olivia finds herself in the destructive path of a malevolent ancient force intent on leaving the spiritual realm to conquer this one.  Left with few options, Olivia is forced to defy centuries of shaman prohibitions. As she and her allies risk everything in their bid for survival, Olivia ultimately learns that the rules are there for a reason and that breaking them has a terrible cost.   WHAT READERS ARE SAYING  “Unpredictable, un-put-down-able, addicting debut…this sci-fi / thriller cross is sure to please all readers of the contemporary urban fantasy genre.” Karielle @ Books a la Mode (Top 1000 Reviewer)  “Strong and original series debut…The plot combines action, mystery and a light touch of romance to involve the reader in Livvy's world.” Shelleyrae (Top 500 Reviewer)  “This book has you asking “What?” on every page — but in a good way. …Livvy, SK, and the shaman culture are interesting. This book could easily open a fresh new world of urban fantasy.” Publishers Weekly  “A most worthy read. A most worthy author.” Curtis M. Michaels  \"Shaman, Healer, Heretic\" is a flawless weave of legendary myth and modern urban life. It reads like an action thriller, and has a very believable cast of characters. I loved it! Fast-paced and suitable for younger readers, I recommend this book for tweens and up.” - Jaelle62  “A Kachina, Sumerian gods, spirit helpers, shamans, the multiverse, and an orange cat named Nacho. What is not to love about this book?” - Glenn R. Skinner  “I read it in one sitting because I couldn't put it down.” - Melayla  “Extremely well researched, Green draws on a vast pool of occult wisdom to drive this fantasy work. I enjoyed the unexpected twists and turns to the story. An inspired writing, and thoroughly enjoyed!” - Zoe  “Absolutely captivating, utterly addicting. The characters are very well written, utterly \"know-able\" and the story picks you up by the neck and shakes the stuffing out of you. In a genre saturated with the same old thing, this book is a wonderful fresh breeze blowing away its competition with the force of an F5 tornado.” - Jackie  “… a rollercoaster ride from the beginning to end.” - Denise Z  “Wow! Just wow! I could not put this book down! Olivia and I greeted the dawn together over the last few pages of this amazing adventure.” - Tenar  AMAZON BREAKTHROUGH NOVEL AWARD SEMI-FINALIST Top 1% of All Books",
  "genres": [
    "Fantasy",
    "Urban Fantasy",
    "Paranormal",
    "Fiction",
    "Science Fiction",
    "Amazon",
    "Magic"
  ],
  "author": "M. Terry Green",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/10589156-shaman-healer-heretic"
}