{
  "title": "The Perennial Wanderer: An American in the World",
  "description": "Many authors, in satisfying the reading public's insatiable need for escapist literature, invest much time and money in their efforts. Don't get me wrong--I read that literature myself. Why not? It is usually entertaining, if not suspenseful. In The Perennial An American in the World, however, it is my intent to demonstrate that life is indeed stranger than fiction, and I, not unlike the escapist writers, have invested much time and energy in bringing these life experiences to the reader. After working in so many countries--including war torn and conflictive countries such as Viet Nam, Colombia, Perú, Mozambique, Sudan and El Salvador--I have seen more than my share of violence, murder, mayhem, public corruption and chicanery. And none of my observations have taken place as a military man--my military experience, by the way, was in the peacetime Air Force in the beautiful Hawaiian Islands.Book Review, The Perennial An American in the World by Steven D.                         There's no need for trolling the aisles of the fiction section in your local bookstore or searching the countless lists of recommended fiction books online any longer. I've found your next undertaking. Steven Orr chronicles his adventures across the world in such countries as Panama, Vietnam, Columbia, and Sudan and takes the reader on exciting adventures that most novelists could not duplicate. Orr tosses readers in his backpack and takes them to places most people will never experience. His imagery and recollections are so thorough that they either force readers to call up their travel agents and book their next international vacations, or readers are satisfied with the feeling that they've already been there and turn the page, ready to embark on Orr's next escapade.                        How could one not admire the author's ability to transport himself from one hectic, thrilling circumstance to another while fulfilling business obligations and organizing startups and mergers? For those of us old, we'll remember blips of history as Orr journeys us through them. For those of us young, we will see history alive for the first time in this hold-nothing-back memoir. The Perennial An American in the World is a memoir that has not met its match.                                              --Willem Meiners                        President of PublishAmerica, Inc.",
  "genres": [
    "Inspirational",
    "Travel",
    "21st Century",
    "Drama",
    "Adventure"
  ],
  "author": "Steven D. Orr",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/10589240-the-perennial-wanderer"
}