{
  "title": "Keeper of the Sword",
  "description": "When the kingdoms of the Misty Lands are on the brink of destruction, only the intervention of two young teens from Vancouver Island can prevent bloodshed and death. Josh Campbell and Morgan Connelly stumble into their perilous journey when Josh discovers an ancient leather-bound book containing two scrolls. One is a legend about two coming to the Misty Lands from a far off place, finding the keeper of the sword, returning a king to an empty throne and preventing war.After drying the supper dishes, Josh watched TV with his mom until nine, returned to his room and booted up the computer. Gramps wasn’t online. No email from him either. He took a shower, brushed his teeth went to bed, placed his head on a pillowcase, smelling faintly of lilacs, closed his eyes and fell into a dream.He looked down through gaps in a canopy of carrot orange, palm like leaves, streaked with thick daffodil veins, at a boy about ten years old, lying beneath the tree on his back, cradling his knees against his chest and crying. Flowers the size and color of the brass bell in the United Church bell tower, filling the air with a pungent musky perfume dangled down from the spreading branches.Resting in branches high above the weeping child, four big birds, black wings folded, cyan heads flashing iridescent reds, purples and greens in the moonlight pouring through rents in the heavy clouds kept sharp eyes on their charge.The largest of the birds spoke in a hushed voice, “Poor young princeling, first his mother was poisoned, and now his father the king has been brutally murdered.”Another one grumbled, “We can’t take proper care of him. He needs to be with his own kind.”“Besides,” growled a third, it was as close to a growl as a bird can come, “We have our own younglings to tend to.”The fourth one asked, “What are we then to do?” If no one tends to him he’ll die, and we can’t let that happen, because he’s now king.”The large bird answered, “He’s far too young for us to take him back to the castle, because his enemies will kill him.”“I know, I know, I know what to do,” shouted the fourth one.The other three spoke as one, “Well, tell us.”“We can take him deep into the forest where the old man and old woman live. They don’t have younglings of their own. They’ll tend to him and give him their love.”“That’s a good plan,” the others said, “We’ll guide him on his journey when the sun wakes, but we can't tell them who he is.”The boy raised his right foot, scratched the instep, reveling the image of a red flower, starting at the ball and ending half way down the arch.Josh’s dream changed, and now he looked down through cracks in the roof of a moss covered, cedar-shingled hut. Four men, two with long, curling grey beards, looking old enough to be his great-grandfather, a third, dressed in mottled grey and green, and a forth, sporting a shamrock-green hat, adorned with a long blue feather, sat around a table looking like it would crumple beneath the lightest sneeze.The man with the hat asked, “How am I to find my way?”One of the old ones reached under the table and lifted up a leather bag. He took out a black stone with a laser sharp cyan light lancing out of one side. He spoke in a reverent quiet voice, “This is the seeing stone of kings. Sometimes it is called the finding stone, and it will guide you to where the two who are spoken of in the prophecy wait.”Away in the distance, carried by the breath of the wind came the wail of a single bagpipe, skirling a mournful dirge, reminding Josh of his great-grandfather, Donald McDonald. For a moment he saw the old man standing on a rocky promontory, silhouetted against the ruins of a castle, a kilt, bearing the tartan of the clan McDonald flapping around skinny legs, his dark eyes, eyes that always flashed when bonny Prince Charlie was mentioned, fixed towards a sun painting feathery clouds with vermillion, crimson and deep purple streaks.Over the tune, so familiar yet so strange came a voice, sweet, poignant, brushed with an Irish lilt, whispering at first, growing louder, filling him with an aching, a longing to go on board the great black ship she sang about. He held his breath in the depths of his dream, trying to burn each word, each haunting trill of the voice into his memory.\"In the moonlight gleaming/the Uniaedean rests, dreaming. Sails furled, captain sleeping/no one is watch guard keeping. Anchor set, gentle wind blowing, the great black ship dreams of going/to a mysterious, distant land/guided true by her captain's hand. Awake, awake, loud voice calling/war drums beat/flaming arrows falling. In fear Uniaedean awakens, shudders from deep wounds taken/looks long at moonlight gleaming/then returns to her dreaming.\"The men faded, the hut, and the words the men spoke faded , all the words of the song, except Uniaedean faded, but the aching caused by the voice lingered on, filling his dream with sadness, and he wept for the loss of the sweetness of the moment.He stirred in his sleep, tossed, turned, and found himself hovering over phosphorescent, midnight blue, and bathed in a river of moonbeams shimmering across the water. Josh struggled to wake up, but before he could, a ship sailed into view. How proud and bold she looked, with her black prow cleaving through tall white topped waves like a scimitar slicing through a pirate's neck.Her black sails filled with wind, struggling to free themselves from the ropes binding them, and a fiery-eyed black stallion figurehead, pawing the air with silver shod hooves glinting in the moonlight, seemed to urge the ship forward.Closer, ever closer came horse and ship, closer until he made out the name Uniaedean on the ship's side. The raised silver and turquoise letters glowed in the light of an unearthly green and silver flame surrounding them. For a moment he stood on the prow, looking over rippling muscled flanks, over the broad back, out between the black stallion's pointed ears, and heard a gruff loud voice shout, \"Trim the sails, hard to starboard,\" over the cracking of sails, the rushing of the wind.Salt spray stinging his eyes, cooled his brow. His heart thudded as if he'd just finished a ten-mile race, his throat tightened, he held his breath. Ahead of him, a mist gathering up from the sea spread out over the distant shore, swirling through strange looking trees, sweeping up towards far off snow covered mountains, not hiding the land, but adding a mystic fairy like quality to it. He blinked seawater from his eyes, and stood on a jagged dolomite tooth, banded by tourmaline and malachite, jutting out of the sea, surrounded by breakers pounding against his perch, soaking him, filling him with fear for the great black ship driving towards destruction. At the last moment, she turned sharp, heeling hard to starboard, heeling over until he thought she was doomed. He willed her to right herself before she foundered. The wind changed, catching her side, billowing out headsail, mizzen and main sails, righting her, and pushing her towards the east. He watched until the tip of the main mast dipped below the horizon, and just before he woke the voice, the sweet voice whispered, \"Come with me. Come with me.\"He sat up, sweat soaked, shivering, wiped tears from his eyes and tried to remember the voice, the words to the song, but the only thing remaining of his dream was the great black ship, and the fear and excitement of seeing her flying before the wind.",
  "genres": [],
  "author": "John William Rice",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/15828135-keeper-of-the-sword"
}