{
  "title": "Dark Lord",
  "description": "This is the complete serial novel containing Parts One through Five. It is an ALTERNATE EARTH story in a world that has been invaded by aliens in the past. In Flourda, only males with unblemished genetic profiles are allowed to breed. Lord Devereux Langley, grandson of the Queen of Flourda, knows he doesn't fit the profile. His dark hair and changeable eyes announce his impure bloodline, and his royal family have tried to keep him hidden from the public eye. If that wasn't bad enough, he has defects his family members are unaware of, including venomous fangs. He has managed to be evicted from three different harems, destroying his chances of acquiring a worthy mate. His mother, Princess Crimson, has made it clear to him that this is his LAST CHANCE to prove himself capable of following the strict dictates of Flourdan society or he will be castrated and made a eunuch. Devereux has no desire to be chosen by any of his mother's cronies and he doesn't wish to be the latest prize in their harems. He wants to choose his own mate, eventually. Flourdan males do not have that right, however. Briella Avenal, half-sister of the Countess Nefertiti Avenal, has had no choice but to throw herself on her sister's mercy. Nefertiti, as the head of the Avenal family, has complete control and authority over Briella's life. She is determined to prove her worth to her sister, which means identifying any threats to Avenal. When she learns of a hybrid alien threat, she takes it seriously. She has noticed the new Lord Langley demonstrates traits normally seen in hybrids, along with some other unusual characteristics. She is not sure how much of a threat he poses to Avenal, but she is determined to watch him closely. Keeping her eyes on the lust-inspiring Dark Lord is certainly no hardship. Despite her intention to serve Nefertiti with complete loyalty, she is beginning to understand that the Countess is sadistic and evil. When she is ordered to participate in a dishonorable assault on a fellow noblewoman's lands, she has no choice but to comply. However, the fallout will be brutal. Note: Although it does have a historical feel, this story is not pre-industrial. It is set in a modern-day alternate Earth. The hybrids have access to advanced technology as well as portals to other worlds/dimensions.",
  "genres": [
    "Erotica",
    "Paranormal",
    "Paranormal Romance",
    "BDSM",
    "Romance"
  ],
  "author": "Corinne Balfour",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/15829749-dark-lord"
}