{
  "title": "Winter Queen",
  "description": "There is one rule above all others:Never bargain with the fae . . . When a battle erupts in the heart of her village, Ilyenna looks into her enemy’s eyes and sees more than just cunning. There is also lust—lust for power and lust for her. She could escape. If she’s willing to take the fae’s impossible bargain.Dark magic in exchange for her soul.But she risks losing more than her soul. She would also lose Rone, the man she’s been in secretly in love with for years. But as things heat up between Rone and Ilyenna, so does her captor’s cruelty. Worse, the feud between clans is merely a distraction from something far worse. Is Ilyenna willing to sell her soul to save her people and the man she loves? Two immortal queens. A dying magic. A world to save . . . The FAIRY QUEENS SAGA is far more than a simple fairytale retelling. It's a deep dive into the Norse mythology surrounding Hans Christian Andersen's THE SNOW QUEEN. An origin story, the Fairy Queens Saga tells the stories of the Winter Queen (Ilyenna), her rival (Nelay), and Ilyenna's daughter (Elice). Reading order:1. Of Ice and Snow (Ilyenna's parents)2. Winter Queen (Ilyenna's story)3. Of Fire and Ash (prequel novella for Nelay's story)4. Summer Queen (Nelay's story)5. Of Sand and Storm (spin off novel)6. Daughter of Winter (Elice and Adar, star-crossed lovers desperate to escape the Winter Queen)7. Winter's Heir (Ilyenna, Nelay, Elice, and Adar all come together for the final showdown. Will they destroy each other or find a way to work together to save their dying world?)OTHER TITLES BY AMBER ARGYLEForbidden Forest SeriesLady of ShadowsStolen EnchantressPiper PrinceWraith KingCurse QueenWitch Song SeriesWitch SongWitch BornWitch RisingWitch Fall",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Fae",
    "Romance",
    "Paranormal",
    "Fairies",
    "Magic"
  ],
  "author": "Amber Argyle",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/15829917-winter-queen"
}