{
  "title": "Cutter's Revenge",
  "description": "HAUNTING MEMORIES...SECRETS...LIESA SERIAL KILLER STALKING...A man believing he has amnesia walks the streets in Haskell, Texas trying to remember who he is; where he came from. In reality, Stan Clark has blackouts where one or more personalities take over Stan's life, leaving him with no memories of that timeframe.Numerous men and women are vanishing from small area towns. Henry Frye, Munday's police chief, is at his wits end after one of his own officers' turns up missing and a \"secret\" town meeting is called. Henry fears his days as police chief are numbered. He doesn't know a serial killer will soon be stalking his own backyard.Jasmine Goldberg, a dispatcher Henry hires from Abilene is determined to find out all she can about the missing people. She uncovers an old Army report with a picture showing frightening, sadistic eyes of a Stan Clark, later nicknamed \"Cutter\" by the Army.A car fitting Clark's vehicle is spotted on the highway, but seeing the patrol car, he makes a run for it. Officers from area towns join the chase, pursuing the vehicle to a house high on a hill. Once inside, the officers stumble upon a delusional maniac hiding in the basement, and a gruesome sight upstairs.Before years of lies from the past can destroy him, Henry opens his heart and soul to the two women he loves deeply—Lori, his new mistress, and Sarah, his dead sister's daughter he adopted—praying Sarah can forgive him as she learns the truth.NOTE: Cutter's Revenge is book three in the Bitter Memories series, written as I wanted my life to turn out, turning tragedy into a happy ending. It is also book two in my new Revenge series.Please visit my website to learn about all my books: memoir series, revenge series, true crime, crime fiction, inspirational fiction, and the first in a fantasy series.http://sj2448.wix.com/suejulsen",
  "genres": [],
  "author": "Sue Julsen",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/15830547-cutter-s-revenge"
}