{
  "title": "The Mystic Saga Omnibus",
  "description": "Now you can buy the first FIVE volumes of the acclaimed sci-fi serial The Mystic Saga in one very affordable book. This omnibus contains Indentured, Legacy, Violation, Judgment, and the newest issue, Convergence!Indentured introduces you to the crew of the USS Pioneer – the world’s first superluminal spacecraft. It eventually leaves you with a question as to what happened to the majority of the crew of that ship when it became stranded in the Beta Hydri system.Legacy brings you the tale of those descendants of the original Pioneer colony in the Beta Hydri System, introducing for the first time, the Mystics. When Legacy is invaded by a fleet of spacecraft, the primitive colony, nine-hundred years in the making, reacts in the only way it knows how. When it comes to the Mystics, this reaction could be quite deadly.Violation finishes up the overall “introduction” to the true Mystic Saga, bringing you the tale of about a dozen USSC assassins sent to a 1940’s Earth. Their sole purpose is to slip in, kill their list of targets, and slip out as quietly as possible. Unfortunately, a disgruntled soldier and a vengeful Mystic raise a significant amount of ruckus along the way.Judgment introduces us to Cyan – an IX7 unit embodied by a triune of souls from the once primitive race living beneath Legacy. Elix has been returned safely to his people on Legacy. Unfortunately for him, his abductors returned him to an era far before his own lifetime. Fortunately, however for his people, Elix offers a plethora of knowledge about the future invaders and their technologies. He offers a fighting chance for his people.Convergence brings all four of the previous books together in 1940’s New York where the world itself may be on the brink of destruction. Apparently some laws are written into the very fabric of the universe, and breaking these laws can bring about some serious consequences.",
  "genres": [
    "Science Fiction",
    "M M Romance",
    "Amazon"
  ],
  "author": "Scott McElhaney",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/15830771-the-mystic-saga-omnibus"
}