{
  "title": "Luther",
  "description": "contains graphic language and graphic gay male, MMF, MF, and bisexual sex situations, where all participants enjoy themselves.Luther is a young man seeming to be happily tooling along on the edge of life in the beach resort town of Cape May, New Jersey, only half aware of what is happening around and to him because he was born slow-witted. But what he appears to have been shortchanged in brain cells has been more than made up in physical attributes he inherited from a mixed-race coupling.Those around him, from his priest to his former teachers to his current employers to jaded rich tourists and a social worker, are eager to take advantage of both of his most apparent traits—his innocence and good humored readiness to please and his arresting physical endowments. The few genuine friends he has—who aren’t so genuine that they shirk from getting in on what he has to offer themselves—feel sorry for his plight and worried for his future. But Luther himself seems happy as a clam and, perhaps, just perhaps, is more in control of what is going on, and less taken advantage of, than anyone suspects.Luther’s “normal” life as the furniture refinisher for the antique store-owning pair of Tim and Alfred and sometimes fishing trip second mate to the married Rob is set on edge by busybody and judgmental neighbor, Mrs. Watson, when Luther is visited in his home workshop by his former gym teacher, Grant, and by Luther’s new, “special” friend, Keith, who decides that what would make Luther even more perfect would be a Prince Albert ring. When rich, predator yachters Jonathan and Pamela appear on the scene to sail Luther away into a new life of service, Luther is faced with the decision to go with the flow with good humor as he’d always done before to fit into life or to assert his own wants and needs.",
  "genres": [
    "M M Romance"
  ],
  "author": "Habu",
  "average_rating": "3.38",
  "url": "https://www.goodreads.com/book/show/15830827-luther"
}