{
  "title": "American Midnight",
  "description": "Doc White wakes up in a Las Vegas hotel suite a very confused man with a massive tequila hangover. As he reflects on the previous day's events that included his wife walking out on him and with their joint savings, the return of the voice in his head, his subsequent loss of another $150,000 at the blackjack tables, and then waking up next to a total stranger, Doc's already damaged life has taken another serious dip downward. In order to pay off his new debt, Doc is forced to do something he vowed years ago never to do again; take a corporate job. Doc's new boss, an octogenarian Chinese casino owner with a taste for curling and political intrigue, along with the return of an old love help to reenergize Doc as he tries to rebuild his life in Sin City. At a major crossroads, Doc draws on the expertise of Merlin, his coke-addled, phobic colleague from a prior life and Summerman, a part-time ghost who is certain he can help Doc deal with the voice in his head. By the time this initial installment in B.R. Snow's Damaged Posse series is wrapped up, Doc, Merlin, and Summerman have joined forces and are armed and ready to wreak havoc on the bad guys as well as themselves.\"A really strong opening novel in what has real potential to become an incredibly popular series. It's unusual to see four fully-developed main characters juggled as seamlessly as they are here and B.R. Snow has set the Damaged Posse series up in a way that provides himself with a wide variety of directions to move in future volumes. The storylines are compelling, the characters pop off the page, and Snow displays a sense of irreverence which serves him well as he takes on greed, hypocrisy, and the vagaries of relationships. Best of all, he is one very funny writer. Don't miss this one and the ones that follow. Comic crime hasn't looked this good is a very long time.\"",
  "genres": [
    "Mystery",
    "Amazon",
    "Humor",
    "Fiction"
  ],
  "author": "B.R. Snow",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/15834797-american-midnight"
}