{
  "title": "Moral Combat: Black Atheists, Gender Politics, and the Values Wars",
  "description": "The word atheism elicits shock, dread, anger, and revulsion among most African Americans. They view atheism as “amoral,” heresy, and race betrayal. Historically, the Black Church was a leading force in the fight for racial justice. Today, many black religious leaders have aligned themselves with the Religious Right. While black communities suffer economically, the Black Church is socially conservative on women’s rights, abortion, same sex marriage, and church/state separation. These religious “values wars” have further solidified institutional sexism and homophobia in black communities. Yet, drawing on a rich tradition of African American free thought, a growing number of progressive African American non-believers are openly questioning black religious and social orthodoxies. Moral Combat provides a provocative analysis of the political and religious battle for America’s soul. It examines the hijacking of civil rights by Christian fascism; the humanist imperative of feminism and social justice; the connection between K-12 education and humanism; and the insidious backlash of Tea Party-style religious fundamentalism against progressive social welfare public policy. Moral Combat also reveals how atheists of color are challenging the whiteness of “New Atheism” and its singular emphasis on science at the expense of social and economic justice. In Moral Combat, Sikivu Hutchinson highlights the cultural influence of African American humanist and atheist social thought in America. She places this tradition within the broader context of public morality and offers a far-reaching vision for critically conscious humanism",
  "genres": [
    "Nonfiction",
    "Politics",
    "Feminism",
    "Religion",
    "Sociology",
    "Race",
    "Philosophy"
  ],
  "author": "Sikivu Hutchinson",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/10592754-moral-combat"
}