{
  "title": "Reno Splits: Mystery on a Nevada Divorce Ranch",
  "description": "Reno, the “Biggest Little City in the World,” was a mecca for divorce seeking women in 1949, particularly eastern socialites and Hollywood starlets wanting a quick and easy way to end an unhappy marriage. While establishing the six weeks residency required by the state of Nevada before being granted their freedom, most of the split-seekers lived a luxurious and pampered lifestyle sampling the city’s dazzling nightlife, high-stakes gambling, and majestic scenery. When New York lawyer Sam Carr’s twin sister, Sally, disappears on the day she’s scheduled to receive her divorce, and then is found dead in the desert, he travels west to track down her killer, in the process confronting his own troubled past and jeopardizing lives as he moves closer to uncovering a shocking secret.During the forty-two days of their Nevada hiatus many of the women lived on dude ranches, exclusive enclaves the locals call “divorce ranches.” Those rustic establishments catered to their guests’ every need, something Sam quickly realizes when his search begins peeling back the seamy layers of Reno’s unique Wild West culture. To his astonishment he learns Sally was an enthusiastic consumer of that way of life; or at least had been until she fell in love with a man whose identity no one seems to know—or is willing to reveal.Sam’s hunt for Sally’s murderer becomes more complicated when he discovers that his fiancée before the war, a woman he’s searched for since returning home from Europe, fled to Reno after he broke off their engagement. She now helps run the divorce ranch where Sally stayed.Struggling to come to grips with his feelings about rediscovering the woman he loves, Sam plunges ahead with his pursuit. Frustrated by the peculiarities of the Reno lifestyle, he soon stumbles into the sights of a madman, leaving himself with a choice—succeed in his quest or die.",
  "genres": [],
  "author": "Phillip Winberry",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/15838469-reno-splits"
}