{
  "title": "O Principezinho",
  "description": "Considerado um dos grandes clássicos da literatura infanto-juvenil, este livro de alcance intemporal, revela um segredo muito simples e ao mesmo tempo muito sábio: é que as coisas realmente importantes são muitas vezes invisíveis para os olhos e só podem ser vistas com o coração.Antoine de Saint-Exupéry publicou pela primeira vez O Principezinho em 1943, quando recuperava de ferimentos de guerra em Nova Iorque, um ano antes do seu avião Lockheed P-38 ter sido dado como desaparecido sobre o Mar Mediterrâneo, durante uma missão de reconhecimento. Mais de meio século depois, a sua fábula sobre o amor e a solidão não perdeu nenhuma da sua força, muito pelo contrário: este livro que se transformou numa das obras mais amadas e admiradas do nosso tempo, é na verdade de alcance intemporal, podendo ser inspirador para leitores de todas as idades e de todas as culturas.O narrador da obra é um piloto com um avião avariado no deserto do Sahara, que, tenta desesperadamente, reparar os danos causados no seu aparelho. Um belo dia os seus esforços são interrompidos devido à aparição de um pequeno príncipe, que lhe pede que desenhe uma ovelha. Perante um domínio tão misterioso, o piloto não se atreveu a desobedecer e, por muito absurdo que pareça - a mais de mil milhas das próximas regiões habitadas e correndo perigo de vida - pegou num pedaço de papel e numa caneta e fez o que o principezinho tinha pedido. E assim tem início um diálogo que expande a imaginação do narrador para todo o género de infantis e surpreendentes direções. O Principezinho conta a sua viagem de planeta em planeta, cada um sendo um pequeno mundo povoado com um único adulto.Esta maravilhosa sequência criativa evoca não apenas os grandes contos de fadas de todos os tempos, como também o extravagante Cidades Invisíveis de Ítalo Calvino. Uma história terna que apresenta uma exposição sentida sobre a tristeza e a solidão, dotada de uma filosofia ansiosa e poética, que revela algumas reflexões sobre o que de facto são os valores da vida.",
  "genres": [
    "Classics",
    "Fiction",
    "Fantasy",
    "Childrens",
    "France",
    "Philosophy",
    "Young Adult"
  ],
  "author": "Antoine de Saint-Exupéry",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/15838781-o-principezinho"
}