{
  "title": "Deception Peak",
  "description": "Deception Peak is now Book 1 in the Ian's Realm Saga.AISN: B01HHOM1XUISBN: 978-0692976128Part 1. Deception PeakIan's Realm Saga, is a young adult adventure fantasy about a teenager, Ian Wilson, who follows his father, Alex, through a portal that magically appears on their computer screen while they are creating a game engine. They travel into a deceptively beautiful Realm, where horses run wild, the wind sings prophetic melodies, and their computer avatar (Xylon) comes to life. But when the two are separated, Ian is abducted by a tribe of dragon worshipers. In his struggle to be released, he causes chaos in the village and is banished into the wilderness with two other residents. They come upon a group of people who live for the sole purpose to destroy the dragon. They agree to help Ian find his father deep in the caves of the dragon's lair.Alex is found, but not without sacrifice, causing a deepened relationship between Ian and the Kaempern leader, Amleth.Alex and Ian ride for the portal home with the dragon at their heels. Alex, his father stops in his tracks and goes back with the intent to slay the dragon, sending his son to the portal to wait for him with the instructions that if he doesn't return by morning, go home without him. Alex never returns.Part 2 Dragon ShieldIntegrity isn't something you do, it's who you are,\" Aren tells the confused Ian in The Dragon Shield.Now a young man, Ian returns to the magical Realm to fight against the tyranny that has befallen his friends. But the Realm is a different place, the forest is dying, the Kaemperns have lost the shield that protected them from the dragon, and Ian has a hard time proving his allegiance when trouble follows him through the portal. His struggle to do right buries him in confusion when he's confronted with a young boy who wields a powerful magical dagger which summons the dragon.Part 3 Rubies and Robbers\"I will not let fear weaken us, not now\" -says Ian as he dives into the cold waters of Moor Cove to find the escapees.Ian has proven his abilities as a warrior and now the most dangerous battle begins, the battle against the power of evil. Ian must unravel the secrets of the mountain and discern whom his real enemy is, the enemy both without and within. He tackles with the twelve-year-old boy who seems to hold the fate of the entire Realm in his hands, and yet the pressing Songs of Wisdom call for compassion in his dealings. Ian leads his men in the fight against the powers of darkness. But he must also be willing to sacrifice everything he ever hoped to have in order to save those he loves.",
  "genres": [
    "Young Adult"
  ],
  "author": "D.L. Gardner",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/15838964-deception-peak"
}