{
  "title": "Romantic Tales: Bedtime Stories Episode 1",
  "description": "Romantic Tales: Bedtime Stories has a little of everything. From Hot and Heavy Rockers CRAVE and your Sci-Fi/Paranormal with Erotic overtones…. (The Genesis Project) Each Episode will entice its readers, draw them in. A quick Bedtime story before they dream, keeping them pleasantly satisfied while peaking their interests for next month’s installment. All for 99 cents. During the interim there will be previews of next month’s Episode…By Author Ty Langston: CRAVEAs a reporter for the Wakefield Post, Harper Erkstine has seen everything. From murders to robberies, all of her recent stories have ended with tragic consequences so great, that she began to question if she made the right career choice for herself. While all of her friends were dating, or going to clubs, she was winning journalism awards for covering the latest drive-by shooting or a home invasion that cost someone she knew, their lives. She loved her job, it was rewarding to be a crime solver and get to the truth of the matter. As much as she loved her job, but the hours of a Metro beat reporter began to descend her into burn out mode. She craved balance. A break, a welcome distraction every now and then. She forgot what it was like to have fun, to take a breath, smell the roses. Was it wrong to want a great career and to have some kind of a personal life? She couldn’t remember the last time she had a date or danced with someone from the opposite sex. In the middle of working on a missing person’s story that has rocked her town to the core, Harper decides as a favor to her friend and colleague to do a feature on local an up and coming rock band, called ‘Crave.’ It was a break from her routine, but Harper soon discovers that this band may have ties to the missing person, not only does she question why, but she also finds there is more to this band than just their music. By Author Tigris Eden: The Genesis ProjectOld earth has been deemed unsuitable for life, New Earth is home. With the Uni-War over, races have joined together in order to sustain their way of life. All life was deemed worth saving, but only one race failed to submit. Humans. Now extinct, humans are a thing of the past, or at least their way of life. The people of New Earth won’t acknowledge their hand in the human’s eradication, but they have benefited from it. Dr. Vaggo Blackmore has found the answer, he’s restored his races way of life- sustenance through farming. The one thing that will give them back their long lives….. Blood: human blood. Biologically engineered in a lab, Genesis Blackmore has always been different. Her father has told her it’s due to her enhancements, the Federated Council sees her as a genetic mutation; and her fellow peers see her as the shiny new toy. Gen has had better days. Everyone on New Earth has milky white skin, platinum blonde hair, and electric blue eyes. It’s the norm. Genesis’ glossy, black hair, ice blue eyes ringed by gold, would have almost made her socially acceptable- if it wasn’t for her honey, almond skin and blue, gold veins. In a sea of milky white she alone is the dark anomaly. All Pars get their life’s nourishment through blood plasma. All Pars find their match through the tasting. Gen can do neither, forbidden by her father to do so. She can neither taste, nor be tasted. Something that’s never bothered her until now.",
  "genres": [],
  "author": "Ty Langston",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/15838943-romantic-tales"
}