{
  "title": "The Guardians",
  "description": "Got Wings?Elijah and Cassie aren’t your old-school angels chilling in the heavens and strumming harps. They’re members of the Guardians, an elite force of angels masquerading under the guise of high school teens.Their newest mission is no walk in the clouds. In an effort to seek out troubled teens, they, along with fellow angels, Rafe, Sophie and Gabriel, will pose as a family of adopted brothers and sisters and enroll in high school. Along with their gift of “emotional divination”, which is to take on the pain of those who are suffering, they experience their own roller coaster rides of teenage emotions.Accustomed to working with children, shy Elijah is overwhelmed when he is assigned to Abby, an honor roll cheerleader. When she discovers she is pregnant and her boyfriend abandons her, Abby turns to Elijah for support. As his feelings for Abby intensify, Elijah also struggles with the desire to be a guardian to Abby’s unborn baby. However, as Elijah is trying to do good, a dark force hovers over him in the form of Lucius—one of Satan’s demons. Things escalate when Elijah threatens Lucius. It will come to a fight to the finish with Elijah either being defeated or damning Lucius back to Hell.Song bird Cassie sings her way into the lead of the school musical and into the life of Zach, a guitar-strumming lost soul. After constant beatings from his step-father drive Zach to a suicide attempt, Cassie must teach him about hope and faith. However, a dark force in the area leads Cassie to mistakenly interpret that Zach is her assignment. Instead she was meant for Lauren, her musical rival and the girl who has an intense crush on Zach. Cassie must somehow find a way to befriend Lauren, help her along and continue to help Zach without destroying Lauren in the process.To fail means death for their assignments, and to fall in love ensures a fall from grace. No one ever said high school was easy.",
  "genres": [
    "Angels",
    "Fantasy",
    "Paranormal",
    "Urban Fantasy",
    "Romance",
    "Young Adult",
    "Paranormal Romance"
  ],
  "author": "Katie Ashley",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/15838965-the-guardians"
}