{
  "title": "Jack Shadow",
  "description": "Jack Shadow. He’s heard them – every one of them. The jokes. They all start out the same. \"See, this guy walks into a bar...\" Well, that's not him. That guy who walked into a bar.He’s the guy who walked out.It's not amnesia. Near as anyone knows, he just doesn’t have a past. Near as anyone knows - or admits to. He doesn’t walk round a corner, and some guy from a car shoots at him because of something he did long ago. Sure. Guys shoot at him. Hell, women too. But not for long ago. Mostly for last week. Where 'last week' is any week you choose. No, he just walked out of a bar.Were there piles of dead bodies behind him? A stacked deck he was dealing, or one he was dealt? He doesn’t know. Or care. But they were waiting, and they took him. The Dragon. Took him to make a difference. To wait for the time a beat of a gnat's wing could change tomorrow. And Jack’s the gnat.Jack walked out of a bar. The rest - the rest will be history. Some day. Not that he’ll be in it. Nobody remembers the gnats. Not if they did their job right. And Jack’s the best there is.Jack Shadow. Because some days – the last thing you need is a good guy.Jack Shadow is a character who will stay with you long after you turn the last page of Mr. Smith's eponymous book. He does not easily fit any ready-made mold - is he a good guy or an evil one? Does he care only about himself, or does he concern himself with the welfare of others? He commits some pretty brutal acts - are these justified, or are they the display of something seriously wrong inside? I kept asking myself these questions while reading the book, and thanks to Graeme Smith's mastery of his material, the answers were never easy.Indeed, the book does contain some breakneck paced action, it takes you to some pretty brutal and dark mental and physical spaces and it contains enough twists for several books, all deftly handled and all perfectly logical (I had to re-read some passages a few times, to ensure Mr. Smith was not cheating, but was following logical threads). The adventure is never boring, never dull, and always exciting.I will avoid giving any spoilers, but do give this book a chance to take you to a new place, and I bet you will be craving a sequel or three - I know I am! Kal KarastoyanovDaniel GrantJack is a terrific character and you really don't know what's going to happen next! Just when you think you know where the story is going, Jack makes sure that you're wrong.........or are you? This was truly a fun read and I really would love to know what Jack will get up to next. The only hint I'll give to new readers is read it and don't be afraid to question what's happening. That's half the fun! There are details within details and even some explanation for real life puzzles. I've said too much....Jack may object!",
  "genres": [],
  "author": "Graeme   Smith",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/15839846-jack-shadow"
}