{
  "title": "Operation Storm: Japan's Top Secret Submarines and Its Plan to Change the Course of World War II",
  "description": "The riveting true story of Japan's top-secret plan to change the course of World War II using a squadron of underwater aircraft carriers a generation ahead of their time.In 1941, the architects of Japan’s sneak attack on Pearl Harbor planned a bold follow-up: a potentially devastating air raid — this time against New York City and Washington, D.C. The classified Japanese program required developing a squadron of top-secret submarines — the Sen-toku or I-400 class — which were, by far, the largest and among the most deadly subs of World War II. Incredibly, the subs were designed as underwater aircraft carriers, each equipped with three Aichi M6A1 attack bombers painted to look like U.S. aircraft. The bombers, called Seiran (which translates as \"storm from a clear sky\"), were tucked in a huge, watertight hangar on the subs' deck. The subs' mission was to travel more than halfway around the world, surface on the east coast of the United States, and launch their deadly air attack. Although U.S. forces had broken the Japanese naval code, American intelligence knew nothing of the operation. And the amazing thing is how close the Japanese came to pulling off their mission.Meticulously researched and masterfully told, \"Operation Storm\" tells the harrowing story of the Sen-toku, their esperate push into Allied waters, and the U.S. Navy's dramatic chase of one of these juggernaut subs. Author John Geoghegan's first-person accounts from the lst surviving members of both the I-401 crew and the U.S. boarding party that captured her create a highly intimate portrait of this fascinating, and until now forgotten, story of the war in the Pacific.",
  "genres": [
    "History",
    "World War II",
    "Nonfiction",
    "Military Fiction",
    "Military History",
    "Japan",
    "Naval History"
  ],
  "author": "John J. Geoghegan",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/15841828-operation-storm"
}