{
  "title": "Mannahatta: A Natural History of New York City",
  "description": "More than a history, A Natural History of New York Ci ty is a book of science, natural history, and imagination, a call for us to stretch our thoughts back to 1609 when Henry Hudson first set foot on the island that would become Manhattan and ahead to 2409 to cities and a world where people and wildlife might thrive together.“See the salt marsh that is now Delancey Street, the grassy plains of Harlem, the water moving slowly through what is now Times Square to the forests along the banks of the Upper West Side. . . . The fact-intense charts, maps and tables offered in abundance here are fascinating, and even kind of sexy.” — New York TimesWhat did Henry Hudson see when he first walked through the forests that would become the heart of one of the world’s greatest, most iconic cities? It’s difficult for us to imagine that world, but for more than a decade, landscape ecologist Eric W. Sanderson has been working to bring that world back to us.In 1609, the island that is now Manhattan had more ecological communities per acre than Yellowstone, more native plant species per acre than Yosemite, more birds than the Great Smoky Mountains National Park. Manhattan was home to wolves, black bears, mountain lions, mink, and river otters. Whales, porpoises, seals, and the occasional sea turtle visited its harbor. Millions of birds of more than 150 different species flew over the island on their annual migration. Millions of fish—shad, herring, trout, sturgeon, and eel—swam past the island up the Hudson River and its stream as a rite of spring.Sanderson’s book is the astounding result of his efforts at reconstructing in words and images the wild island that millions now call home. By geographically matching an 18th-century map with one of modern New York City, examining volumes of historic documents, and collecting and analyzing scientific data, Sanderson re-creates the forests of Times Square, the meadows of Harlem, and the wetlands of downtown. His lively text guides readers through this abundant landscape, while Markley Boyer’s breathtaking illustrations transport them back in time.Mannahatta is a groundbreaking work that provides not only a window into the past but also inspiration for the future.",
  "genres": [
    "History",
    "Nonfiction",
    "New York",
    "Science",
    "Nature",
    "Environment",
    "Natural History"
  ],
  "author": "Eric W. Sanderson",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/15842709-mannahatta"
}