{
  "title": "Evangelical Catholicism: Deep Reform in the 21st-Century Church",
  "description": "The Catholic Church is on the threshold of a bold new era in its two-thousand year history. As the curtain comes down on the Church defined by the 16th-century Counter-Reformation, the curtain is rising on the Evangelical Catholicism of the third millennium: a way of being Catholic that comes from over a century of Catholic reform; a mission-centered renewal honed by the Second Vatican Council and given compelling expression by Blessed John Paul II and Pope Benedict XVI. The Gospel-centered Evangelical Catholicism of the future will send all the people of the Church into mission territory every day -- a territory increasingly defined in the West by spiritual boredom and aggressive secularism. Confronting both these cultural challenges and the shadows cast by recent Catholic history, Evangelical Catholicism unapologetically proclaims the Gospel of Jesus Christ as the truth of the world. It also molds disciples who witness to faith, hope, and love by the quality of their lives and the nobility of their aspirations. Thus the Catholicism of the 21st century and beyond will be a culture-forming counterculture, offering all men and women of good will a deeply humane alternative to the soul-stifling self-absorption of postmodernity. Drawing on thirty years of experience throughout the Catholic world, from its humblest parishes to its highest levels of authority, George Weigel proposes a deepening of faith-based and mission-driven Catholic reform that touches every facet of Catholic life -- from the episcopate and the papacy to the priesthood and the consecrated life; from the renewal of the lay vocation in the world to the redefinition of the Church's engagement with public life; from the liturgy to the Church's intellectual life. Lay Catholics and clergy alike should welcome the challenge of this unique moment in the Church's history, Weigel urges. Mediocrity is not an option, and all Catholics, no matter what their station in life, are called to live the evangelical vocation into which they were baptized: without compromise, but with the joy, courage, and confidence that comes from living this side of the Resurrection.",
  "genres": [
    "Catholic",
    "Religion",
    "Theology",
    "Nonfiction",
    "History",
    "Christianity",
    "Faith"
  ],
  "author": "George Weigel",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/15843124-evangelical-catholicism"
}