{
  "title": "July 1914: Countdown to War",
  "description": "When a Serbian-backed assassin gunned down Archduke Franz Ferdinand in late June 1914, the world seemed unmoved. Even Ferdinand’s own uncle, Franz Josef I, was notably ambivalent about the death of the Hapsburg heir, saying simply, \"It is God’s will.\" Certainly, there was nothing to suggest that the episode would lead to conflict—much less a world war of such massive and horrific proportions that it would fundamentally reshape the course of human events.As acclaimed historian Sean McMeekin reveals in July 1914, World War I might have been avoided entirely had it not been for a small group of statesmen who, in the month after the assassination, plotted to use Ferdinand’s murder as the trigger for a long-awaited showdown in Europe. The primary culprits, moreover, have long escaped blame. While most accounts of the war’s outbreak place the bulk of responsibility on German and Austro-Hungarian militarism, McMeekin draws on surprising new evidence from archives across Europe to show that the worst offenders were actually to be found in Russia and France, whose belligerence and duplicity ensured that war was inevitable. Whether they plotted for war or rode the whirlwind nearly blind, each of the men involved—from Austrian Foreign Minister Leopold von Berchtold and German Chancellor Bethmann Hollweg to Russian Foreign Minister Sergei Sazonov and French president Raymond Poincaré—sought to capitalize on the fallout from Ferdinand’s murder, unwittingly leading Europe toward the greatest cataclysm it had ever seen.A revolutionary account of the genesis of World War I, July 1914 tells the gripping story of Europe’s countdown to war from the bloody opening act on June 28th to Britain’s final plunge on August 4th, showing how a single month—and a handful of men—changed the course of the twentieth century.",
  "genres": [
    "History",
    "Nonfiction",
    "World War I",
    "War",
    "Politics",
    "Military History",
    "Military Fiction"
  ],
  "author": "Sean McMeekin",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/15843081-july-1914"
}