{
  "title": "Fame and Fortune: or, The Progress of Richard Hunter",
  "description": "In this tale Ragged Dick, now Richard Hunter, continues 'cultivating himself,' again meets with a set of lucky circumstances (with some unlucky ones thrown in there, but nothing too terribly shocking or unresolvable) and, in the end, meets with his Fame and Fortune.Excerpt:\"Well, Fosdick, this is a little better than our old room in Mott Street,\" said Richard Hunter, looking complacently about him. \"You're right, Dick,\" said his friend. \"This carpet's rather nicer than the ragged one Mrs. Mooney supplied us with. The beds are neat and comfortable, and I feel better satisfied, even if we do have to pay twice as much for it.\" The room which yielded so much satisfaction to the two boys was on the fourth floor of a boarding-house in Bleecker Street. No doubt many of my young readers, who are accustomed to elegant homes, would think it very plain; but neither Richard nor his friend had been used to anything as good. They had been thrown upon their own exertions at an early age, and had a hard battle to fight with poverty and ignorance. Those of my readers who are familiar with Richard Hunter's experiences when he was \"Ragged Dick,\" will easily understand what a great rise in the world it was for him to have a really respectable home. For years he had led a vagabond life about the streets, as a boot-black, sleeping in old wagons, or boxes, or wherever he could find a lodging gratis. It was only twelve months since a chance meeting with an intelligent boy caused him to form the resolution to grow up respectable. By diligent evening study with Henry Fosdick, whose advantages had been much greater than his own, assisted by a natural quickness and an unusual aptitude for learning, he had, in a year, learned to read and write well, and had, besides, made considerable progress in arithmetic. Still he would have found it difficult to obtain a situation if he had not been the means of saving from drowning the young child of Mr. James Rockwell, a wealthy merchant in business on Pearl Street, who at once, out of gratitude for the service rendered, engaged our hero in his employ at the unusual compensation, for a beginner, of ten dollars a week. His friend, Henry Fosdick, was in a hat store on Broadway, but thus far only received six dollars a week.",
  "genres": [
    "Fiction",
    "Classics",
    "Audiobook",
    "Business",
    "Childrens"
  ],
  "author": "Horatio Alger Jr.",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/10595699-fame-and-fortune"
}