{
  "title": "A Death in the Lucky Holiday Hotel: Murder, Money, and an Epic Power Struggle in China",
  "description": "The downfall of Bo Xilai in China was more than a darkly thrilling mystery. It revealed a cataclysmic internal power struggle between Communist Party factions, one that reached all the way to China's new president Xi Jinping.The scandalous story of the corruption of the Bo Xilai family -- the murder of British businessman Neil Heywood; Bo's secret lovers; the secret maneuverings of Bo's supporters; the hasty trial and sentencing of Gu Kailai, Bo's wife -- was just the first rumble of a seismic power struggle that continues to rock the very foundation of China's all-powerful Communist Party. By the time it is over, the machinations in Beijing and throughout the country that began with Bo's fall could affect China's economic development and disrupt the world's political and economic order.Pin Ho and Wenguang Huang have pieced together the details of this fascinating political drama from firsthand reporting and an unrivaled array of sources, some very high in the Chinese government. This was the first scandal in China to play out in the international media -- details were leaked, sometimes invented, to non-Chinese news outlets as part of the power plays that rippled through the government. The attempt to manipulate the Western media, especially, was a fundamental dimension to the story, and one that affected some of the early reporting. A Death in the Lucky Holiday Hotel returns to the scene of the crime and shows not only what happened in Room 1605 but how the threat of the story was every bit as important in the life and death struggle for power that followed. It touched celebrities and billionaires and redrew the cast of the new leadership of the Communist Party. The ghost of Neil Heywood haunts China to this day.",
  "genres": [
    "China",
    "Nonfiction",
    "True Crime",
    "Politics",
    "History",
    "Asia",
    "Reportage"
  ],
  "author": "Pin Ho",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/15843143-a-death-in-the-lucky-holiday-hotel"
}