{
  "title": "Interviews with Dead Celebrities",
  "description": "Darkly humorous, usually sarcastic, and always profane and offensive, Interviews with Dead Celebrities tears apart the pillars upon which we place celebrities, politicians, and entertainers with sharp social commentary in the form of interviews that are relentless in their pursuit of the raw, honest, (albeit completely fictional) truth. Written by humorist and comedian Adam Avitable, this book asks the questions you've always wanted to know. Why did Whitney Houston throw away her good will for drugs? Did Osama bin Laden really hate America? Can Steve Jobs tell a joke? Does Joe Paterno care about children? Would John Hughes have written a sequel to Ferris Bueller's Day Off?With over fifty posthumous interviews written entirely by Avitable, Interviews with Dead Celebrities will make you laugh, make you gasp, and may make you write him an angry letter telling him that he's evil for making you laugh.Read interviews with the following celebrities and public figures: Peter Graves, Lucille Ball, Adolf Hitler, Phil Hartman, Ed McMahon, Zelda Rubinstein, \"Macho Man\" Randy Savage, Sherman Hemsley, Jack Kevorkian, Barbara Billingsley, Corey Haim, Helen Keller, Leonard Stern, Osama bin Laden, Anna Nicole Smith, Gary Coleman, Heath Ledger, Patrick Swayze, Aaliyah, Tony Curtis, Greg Giraldo, Leslie Nielsen, Billy Mays, Brittany Murphy, George Carlin, Martin Luther King, Jr., Bob Guccione, Amy Winehouse, Roy Scheider, Dick Clark, Mark Twain, Elizabeth Taylor, Robert Novak, John Lennon, John Hughes, Amelia Earhart, Dennis Hopper, Michael Jackson, Oral Roberts, Farrah Fawcett, Walter Cronkite, Lisa \"Left Eye\" Lopes, Jack LaLanne, Kim Jong Il, Whitney Houston, Andy Rooney, Ted Kennedy, Sir Arthur Conan Doyle, Marilyn Monroe, Ronald Reagan, Joe Paterno, Nora Ephron, JD Salinger, Ray Bradbury, Princess Diana, and Steve Jobs.Adam Avitable is a blogger who has been writing at Avitable.com for thirteen years. He is a lawyer, a stand-up comedian, and a sucker for redheads. He loves bacon and chocolate but would give those up in a heartbeat just to make the world laugh until it collectively peed itself.",
  "genres": [],
  "author": "Adam Avitable",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/15845708-interviews-with-dead-celebrities"
}