{
  "title": "Rick Bayless's Mexican Kitchen",
  "description": "Bursting with bold, complex flavors, Mexican cooking has the kind of gusto we want in food today. Until now, American home cooks have had few authorities to translate the heart of this world-class cuisine to everyday cooking.In this book of more than 150 recipes, award-winning chef, author and teacher Rick bayless provides the inspiration and guidance that home cooks have needed. With a blend of passion, patience, clarity and humor, he unerringly finds his way into the very soul of Mexican cuisine, from essential recipes and explorations of Mexico's many chiles to quick-to-prepare everyday dishes and pull-out-the-stops celebration fare.Bayless begins the journey by introducing us to the building blocks of Mexican cooking. With infectious enthusiasm and an entertaining voice, he outlines 16 essential preparations-deeply flavored tomato sauces and tangy tomatillo salsas, rich chile pastes and indispensable handmade tortillas.Fascinating cultural background and practical cooking tips help readers to understand these preparations and make them their own. Each recipe explains which steps can be completed in advance to make final preparation easier, and each provides a list of the dishes in later chapters that are built around these basics. And with each essential recipe, Bayless includes several “Simple Ideas from My American Home”—quick, familiar recipes with innovative Mexican accents, such as Baked Ham with Yucatecan Flavors, Spicy Chicken Salad, Ancho-Broiled Salmon and Very, Very Good Chili.Throughout, the intrepid Bayless brings chiles into focus, revealing that Mexican cooks use these pods for flavor, richness, color and, yes, sometimes for heat. He details the simple techniques for getting the best out of every chile-from the rich, smoky chipotle to the incendiary but fruity habanero.Then, in more than 135 recipes that follow, Bayless guides us through a wide range of richly flavored regional Mexican dishes, combining down-home appeal and convivial informality with simple culinary elegance. It's all here: starters like Classic Seviche Tostadas or Chorizo-Stuffed Ancho Chiles; soups like Slow-Simmered Fava Bean Soup or Rustic Ranch-Style Soup; casual tortilla-based preparations like Achiote-Roasted Pork Tacos or Street-Style Red Chile Enchiladas; vegetable delights like Smoky Braised Mexican Pumpkin, or Green Poblano Rice; even a whole chapter on classic fiesta food (from Oaxacan Black Mole with Braised Chicken, Smoky Peanut Mole with Grilled Quail and Great Big Tamal Roll with Chard with the incomparable Juchitan-Style Black Bean Tamales); and ending with a selection of luscious desserts like Modern Mexican Chocolate Flan with KahIua and Yucatecan-Style Fresh Coconut Pie. To quickly expand your Mexican repertoire even further, each of these recipes is accompanied by suggestions for variations and improvisations.There is no greater authority on Mexican cooking than Rick Bayless, and no one can teach it better. In his skillful hands, the wonderful flavors of Mexico will enter your kitchen and your daily cooking routine without losing any of their depth or timeless appeal.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction",
    "Reference",
    "Food and Drink",
    "Culinary"
  ],
  "author": "Rick Bayless",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/158470.Rick_Bayless_s_Mexican_Kitchen"
}