{
  "title": "Maybe Too Good To Be True",
  "description": "When Georgia girl Gabrielle March is summoned to a country estate in Massachusetts, she is stunned when the corporate matriarch of the Atlantic-Hastings International makes an astounding revelation. Gabrielle is to receive a mega block of company stock valued in seven figures and a seat on the board; all as reparation for a conspiracy committed against her late father. Brothers Pierce and James Hastings, sons of Gabrielle’s benefactor, don’t take kindly to their mother giving away such a sizeable chunk of their company. James wants to have their mother committed, but Pierce, out of respect for her judgment, grudgingly agrees to take Gabrielle under his wing and acclimate her to Atlantic-Hastings International in New York City. Spending time with Gabrielle at work, and at the penthouse every night, is an eye opener for the sophisticated divorced bachelor who doesn’t seem able to get enough of her. Seeing Gabrielle’s unabashed pleasure in seeing and appreciating new things charms him. She is fast becoming an addiction to him; one he knows he can’t live without. He just has to convince Gabrielle. The only problem, she is focused on rousting the last living conspirator; a person equally focused on seeing her dead. Half romance, and half mystery, \"Too Good To Be True\" is full of twists and surprises that will keep your interest, and keep you guessing up until the very end. Krystal from Once Upon a Book Christy McKee is a new author to me but I can guarantee this will not be the last I read of her. An interesting and fun ride, McKee made a standard romance funny and utterly romantic. The story is wonderful, but truly the characters are a masterpiece. The Brunette Librarian You can visit Christy McKee's website at www.christymckee.com",
  "genres": [
    "Romance",
    "Mystery",
    "Contemporary"
  ],
  "author": "Christy McKee",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/15847786-maybe-too-good-to-be-true"
}