{
  "title": "Hoodie",
  "description": "From the moment Ben Chapman ( 'Hoodie' to the other Shady Boys) crashes out of school, determined never to return and, incidentally, seeking his revenge on the school's drug dealer by stealing and concealing his stash in his trousers on the way out, you know that this is a boy to whom caution and reticence are alien concepts. Outwardly, he maintains that all he wants is a job, his own money and to follow his heart towards the girl of his dreams, Isabelle. But, underneath that concealing hoodie, Ben has a rich inner life, fed by dope, wine and the belief that he is someone special. During his 'summer of love', we follow his attempts to engage with the real world with frustration and compassion. His adventures cause him to question today's competitive, consumer-based values, eventually challenging his perception of reality and prompting him to reflect upon who and what his purpose in life is before finding himself faced with the definitive test of resolve and bravery. Hoodie's blend of up-to-date realism, dream-like escapism, fast-paced, hard-hitting action, wistful musings, humour and tragedy, all while the story navigates its way on a magical mystery tour of Ben's mind, ensures an enjoyable read. It provides the perfect antidote to alarmist Daily Mail reporting of youth issues, exploring the problems facing modern day Britain from the perspective of a disempowered, disaffected teenager. On a deeper level, there is a moral/spiritual sub-text, fed by Ben's belief that he has a secret weapon; the simian lines (fused head and heart lines) on the palms of his hands. These are extremely rare and noted as being a genetic abnormality shared by drug addicts, mass murderers, scientific researchers and religious fanatics (and, by sheer coincidence, Tony Blair). Could these lines hold the key to his future?",
  "genres": [
    "Contemporary",
    "Young Adult"
  ],
  "author": "Brendon Lancaster",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/10596829-hoodie"
}