{
  "title": "মানবজমিন",
  "description": "আকারেই শুধু বড়-মাপের উপন্যাস নয় ‘মানবজমিন’, প্রকারেও ব্যাপ্ত, বিশাল বৈচিত্রময়। এ-যুগের অন্যতম শক্তিমান কথাকার শীর্ষেন্দু মুখোপাধ্যায়ের এ-যাবৎকাল প্রকাশিত যাবতীয় প্রধান রচনার প্রবল এক প্রতিস্পর্ধী এই মহান উপন্যাস, আধুনিক বাংলা কথাসাহিত্যের তাবৎ স্মরণীয় কীর্তিমালারও। ঐতিহ্যের সঙ্গে শিকড়ের যোগ এই দুর্লভ সৃষ্টির, সাম্প্রতিকের সঙ্গে আত্মার, আগামীর দিকে বাড়ানো এর কুঁড়ি-ধরানো ডালপালা।অসংখ্য ঘটনা, অজস্র চরিত্র, অফুরান সমস্যা এই উপন্যাসে। তবু কোথাও জট পাকায়নি। পরিণত লেখকের দক্ষ হাতের সুঠাম নিয়ন্ত্রণে প্রতিটি চরিত্র ও কাহিনী সুস্থির, স্বতন্ত্র লক্ষ্যাভিমুখী। লোভ, ঘৃণা, প্রেম, রিপুর তাড়না, বাঁচার ইচ্ছে, উচ্চাকাঙ্খা – এমন যে-সব কিছুর দ্বারা কুম্ভীপাকে নিয়ত সিদ্ধ হচ্ছে মানুষ, তারই উপর ভিত্তি করে গড়ে উঠেছে এই উপন্যাস। গড়ে উঠেছে মানুষে-মানুষে সম্পর্কের ভাঙচুর ও জোড়-মেলানো নিয়ে।অসংখ্য চরিত্রের ঘাত-প্রতিঘাতে দ্বন্দ্বময় এই উপন্যাসের অন্যতম নায়ক দীপনাথ, যাবতীয় চরিত্রের মধ্যে এক সাধারণ যোগসূত্রের মতো যে কিনা আবর্তিত, যার লড়াই চলেছে কর্মক্ষেত্রে। এক সওদাগরি আপিসের বিগ বসের পি.এ. দীপনাথ, আসলে এক বেতনভোগী ভৃত্য। এই দীপনাথের সঙ্গেই তার বসের বউ মণিদীপার এক বিচিত্র সম্পর্ক গড়ে উঠল। আপাতভাবে রাগের, কিন্তু অন্তঃশীল অনুরাগের। বস তাকে বিয়ে করার প্রস্তাবও দিয়েছিল। কিন্তু দীপনাথ কি সে-প্রস্তাব গ্রহণ করতে পারবে?এ-উপন্যাসের আরেকটি প্রধান চরিত্র তৃষা। মৃত ভাসুর তৃষাকে সব সম্পত্তি লিখে দিয়ে গেছে। লোকে বলে, তৃষার একমাত্র পুত্রের জনক তার ভাসুর। এমন-কি তৃষার স্বামীও। তৃষার বিরুদ্ধে তাই স্বামীর লড়াই।দুরারোগ্য ব্যাধির বিরুদ্ধে যার প্রতিমুহূর্তের একলা যুদ্ধ, সেই প্রীতম, দীপনাথের ভগ্নীপতি, এ-উপন্যাসের আরেক প্রধান চরিত্র। প্রীতমের স্ত্রী স্বামীর প্রতি সেবাপরায়ণা, কিন্তু আগে থেকেই অরুণ নামে এক যুবকের সঙ্গে তার সম্পর্ক।মুখ্যত এই তিন চরিত্রের লড়াই ‘মানবজমিন’। আর লড়াইয়ের অবসানে তিন রকমের যে-পরিণতি, তার মধ্যেই ফুটে উঠেছে অসামান্য এই উপন্যাসের অমোঘ সেই বার্তা, মানবজমিনে যা করতে শেখায় নতুন আবাদ, ভালবাসা ও বিশ্বস্ততার সোনা-ফলানো আবাদ।",
  "genres": [
    "Fiction",
    "Novels",
    "Drama",
    "Classics"
  ],
  "author": "Shirshendu Mukhopadhyay",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/15848697"
}