{
  "title": "Four Corners Dark",
  "description": "A compendium of four grim, terror-inducing tales, Four Corners Dark is like disturbing a long-hidden tomb. You know what you’ll find has been hidden away for years and will be horrible, but you can’t stop yourself. Human curiosity demands you step into the darkness—even though you may never reemerge.William McNally offers up four distinct pools of darkness, each with its own macabre attraction. In “Engine Eighteen,” Anna Sanchez and a scared group of Mexican immigrants put their trust in one of the human border smugglers known as coyotes. Anna knows trusting a coyote is risky; smugglers sometimes leave their cargo to die in the desert wastes of the border between Mexican and the United States. She’s willing to take that risk, but is she willing to hazard her soul?“Return to Nowhere” tells the story of Jack Reynolds, a huckster and card cheat with a unique ability. When his cheating attracts unwanted attention, Jack escapes by jumping to a different version of his life. But what happens if his new life turns out to be a dead end?New homes often have hidden flaws, but none as fatal as those found in “The Raven Mocker.” Terry and Abby James have more to worry about than faulty wiring or foundation cracks. Their new mountain property includes the grave of a vengeful and still-active witch, and she’s hungry.Finally, McNally reminds us it’s possible to find light even in the darkness. “The Spinning Wheel” tells the tale of John Roberts, whose love for his son leads to a fate-changing decision.Some react to the darkness with fear and panic, while others respond with bravery and self-sacrifice. Four Corners Dark invites you into the darkness. Don’t bother bringing a flashlight; you’ll have to find your own way out.",
  "genres": [
    "Horror",
    "Short Stories",
    "Paranormal",
    "Anthologies",
    "Fantasy",
    "Fiction",
    "Horror Thriller"
  ],
  "author": "William  McNally",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/15849777-four-corners-dark"
}