{
  "title": "If It's A Choice, My Zygote Chose Balls: Making Sense of Senseless Controversy",
  "description": "Jeremy Hooper's Good As You website (www.GoodAsYou.org) is known for blending passion and wit, making the case for LGBT equality worldwide. In If It’s a Choice, My Zygote Chose Balls: Making Sense of Senseless Controversy, Jeremy continues that style, blending a unique mix of memoir and social commentary that argues for equal rights based on relatable human principles.Hooper leads readers through his own life story, revealing the positive and unnecessarily encumbered aspects of growing up gay in contemporary society. The noted author and activist writes in a sometimes humorous, sometimes serious, but always sharply informed style, opening a window into the realities of family rejection and acceptance. Whether offering direct guidance for would-be straight allies or sharing the inner monologue of a boy who knew who he was long before early adulthood would allow him to own it, Hooper provides a wealth of insight and argument to push the equality conversation forward.“From constant talk about marriage to the popular parlor game ‘Which celebrity is gay?’ our world is, in many ways, obsessed with LGBT topics,” says Hooper. “However, there is serious neglect in terms of actually tackling the issues at hand. I want to address the weighty topics head on, but in a relatable way.”As someone who spends ten to twelve daily hours slogging through the \"culture war\" for his celebrated website, Jeremy Hooper knows better than anyone how far the LGBT community still has to go in order to obtain full equality. At the same time, his focused lens had led him to believe that some of the usual LGBT activism has isolated the fight and stories, leaving much of the continued struggle to go unrealized by the population at large. So Hooper's answer is to present relatable tales that are just as proactive in changing hearts and minds as any textbook gay rights treatment, but doing so in a package that pops with universal heart and wit. Hooper calls out the B.S. for what it is, while keeping an equal focus on uniting folks from all walks of life for the common causes of peace, equality, acceptance, and, ironically enough–family values. All of this while remembering to keep his tongue in or around the cheek region.Written to engage and entertain, as well as inspire further discussion and action, the book is aimed at a wide range of readers interested and open to learning.",
  "genres": [
    "LGBT",
    "Nonfiction",
    "Politics",
    "Gay",
    "Queer"
  ],
  "author": "Jeremy Hooper",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/15850229-if-it-s-a-choice-my-zygote-chose-balls"
}