{
  "title": "The Nations",
  "description": "THE NATIONS also known as \"Indian Territory\", \"Robber's Roost\" and \"No-Man's Land\", was regarded in the latter part of the 19th century as the bloodiest and most dangerous place in the world. It was a refuge for outlaws men from all over the North American continent. There were only 200 Deputy U.S. Marshals made up of whites, blacks and Indian to police the vast area of 74,000 square miles under Federal Judge Issac C. Parker, known as the hanging judge. The Nations is based on actual cases and is crammed full of excitement, suspense and the everyday humor that develops between men as they live and fight and sometimes die together. From the action and dialogue, the guns, wardrobe and historical authenticity, The Nations paints a story of the Old West as it really was. It is the year 1885. A notorious band of outlaws, known as the \"Larson Gang\", has been terrorizing Arkansas, Missouri and the Nations for years. When they kill five Deputy Marshals while rescuing Ben Larson, the vicious younger brother of the leader Wes Larson—it is too much for Judge Parker. He orders an all-out concerted effort to capture the Larson Gang and bring them to justice. \"If they will not respect the law; then by God we will make them fear it.\"Black Marshal Bass Reeves, the first black marshal west of the Mississippi, and white Marshals Jack McGann, Tobe Bassett and John L. Patrick recapture the youngest member of the gang, Ben Larson, a true sociopath. Along with two Indian Police, known as Lighthorse, the lawmen begin the treacherous journey to Fort Smith with their prisoners—Preacher Budlow, a gospel quoting, whiskey running and somewhat demented old scalawag, Jed Neal, a tough, but honorable black man mistakenly accused of killing a cowboy on the trail, and Ben—shackled to the bed of the Tumbleweed Wagon.In the small town of Checotah, the Marshals encounter the Larson gang unexpectedly. A wild gun battle ensues and when the smoke clears, all of the outlaws are dead, except Ben, who does indeed get to Fort Smith to stand trial under Judge Parker. \"It is not the severity of the punishment that is the deterrent… but the certainty of it.\" - Judge Issac C. Parker.",
  "genres": [
    "Westerns",
    "Historical Fiction",
    "Fiction"
  ],
  "author": "Ken Farmer",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/15850350-the-nations"
}