{
  "title": "De romantische koster van Rånö en andere verhalen van de scheren",
  "description": "Een bundel vrolijke korte verhalen, daarom had Strindbergs uitgever gevraagd. Na alle moeilijkheden die hij gehad had met het aan de man brengen van De zoon van een dienstbode (Tjänstekvinnans son) hoopten ze het succes van De bewoners van Hemsö (Hemsöborna), waarmee Strindberg in een klap weer bijna even populair was als met zijn eerste roman De Rode Kamer (Röda rummet), te kunnen herhalen.Hij woonde toen met zijn gezin in Denemarken, het laatste station op de terugreis naar Zweden na zijn jarenlange zwerftocht door Europa, die hem geruïneerd had maar geen einde had gemaakt aan zijn angsten en schuldgevoelens. Het werk aan de onpubliceerbare roman De apologie van een gek (de in het Frans geschreven Apologie d’un fou) had de laatste reserves opgeteerd.Strindberg besloot gehoor te geven aan het verzoek van zijn uitgever, en hij schrijft de lichtvoetige verhalen waar men hem om gevraagd had. Hij gebruikte daarvoor de verhalen die hij als jongeman tijdens zijn zomervakanties en zeiltochten in de archipel voor de kust van Stockholm (de scheren) gehoord had. Ondanks, of juist dank zij het feit dat het zo lang geleden is dat hij de scheren heeft gezien en voor het eerst van deze verhalen genoot, herleven ze in zijn herinnering met een frisse kracht en een tintelende rijkdom aan details.Het titelverhaal, een fraaie geschiedenis over een verlegen jongeman die voor organist wil studeren en, stoutmoedig in zijn dagdromen, het spoor tussen droom en werkelijkheid bijster raakt, met catastrofale gevolgen, werd door Strindbergs biograaf Olof Lagercrantz ‘een van de drie voortreffelijkste werken van Strindberg’ genoemd.Van August Strindberg (1849-1912) verschenen bij Meulenhoff de romans De Rode Kamer, De Gotische Kamers, Zwarte vaandels, Aan open zee, De paria, de novelle Eenzaam en Het occulte dagboek.",
  "genres": [
    "Short Stories",
    "Swedish Literature",
    "Fiction"
  ],
  "author": "August Strindberg",
  "average_rating": "3.23",
  "url": "https://www.goodreads.com/book/show/10597579-de-romantische-koster-van-r-n-en-andere-verhalen-van-de-scheren"
}