{
  "title": "The Dead Sheriff: Zombie Damnation",
  "description": "It probably started with the Lone Ranger.When I was a kid, westerns were everywhere, especially at our house. My dad was a nut for them. The table next to his chair always had a Louis L’Amour book on it. A John Wayne movie on a Saturday afternoon took precedence over everything else, even baseball games. Half the TV schedule was comprised of shoot-‘em-ups, including reruns of the Clayton Moore “Lone Ranger” series.Believe me, I grew up well versed in “Giddyup” and “Whoa!” and “Reach fer the sky, mister!”At some point, though, I’d had enough. I developed interests of my own, and the stuff my parents liked couldn’t be my favorites anymore. It just wasn’t cool.Among my growing passions were “Chiller Theater,” “Famous Monsters of Filmland,” Marvel Comics and pulp magazine reprints of “Doc Savage” and “The Spider.”Years later, I came across a DVD of “Lone Ranger” episodes. Giving in to a twinge of nostalgia, I bought it. It wasn’t great, but it was a classic part of my childhood. More importantly, it started the wheels rolling toward “What if?”A lot of writers will tell you that almost everything springs from “What if?” My moment came right after the Lone Ranger and his stoic sidekick, Tonto, had stopped the bad guys, thus earning the undying gratitude of the whole town. As the crime-fighting duo saddled up and rode off toward their next adventure, I thought, “What if everybody thinks the Lone Ranger is in charge, but he’s really just some guy hired by Tonto to be the face of their crime-fighting operation and later, after the Ranger is snoring in his bedroll, Tonto creeps back to town to collect the reward money that the Ranger always turns down?” Hey, a guy has to plan for his future. Maybe Tonto needs a down payment on that retirement condo in Boca. Something else writers will tell you is that the What If moment occurs maybe ten or twenty times a day. Out of those, maybe–maybe–one idea a week will become the germ for a story or novel or screenplay or poem.The Tonto-as-boss notion was one of those that seemed to offer nothing more than a moment’s amusement. “Nothing to see here,” it seemed to say, “so move along.” I did.But every now and then, the notion would resurface and I’d examine it and toss it back to wherever the lonely, unused concepts reside. It was incomplete—one half of an equation. One day, during a marathon of bad horror flicks, the other piece of the concept fell into place. “The faithful Indian sidekick has a magic talisman that he stole. He only understands it enough to do one magical thing: to reanimate a corpse and control it like a puppet. While the rest of the west believes The Dead Sheriff is a murdered lawman that dug his way out of his grave to bring to justice the killers of his family, the truth is much different. The undead avenger is simply a means for a young man with a mystical totem to earn a little cash. Unfortunately, where magic and money are concerned, things inevitably go wrong.”Despite a tendency for bits of himself to fall off along the dusty trail, I plan for The Dead Sheriff to be righting wrongs for many years to come, and encountering the oddest characters to ever saddle up, like the crazed cannibal brothers, a traveling vampire bordello and the posse made up of the West’s far less successful masked vigilantes. Did I mention the magic talisman’s original owner and his demonic sidekick? Or the time traveler?I hope you’ll stroll into the saloon, belly up to the bar and order of a shot of pulpy fun. The Wild West is about to get very weird. Mark JusticeIn the hills of Kentucky",
  "genres": [
    "Horror",
    "Fantasy"
  ],
  "author": "Mark Justice",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/15850196-the-dead-sheriff"
}