{
  "title": "Quest For the Moon Orb",
  "description": "Quest for the Moon Orb is a full-length, 130,000 word novel.When Karma Baraka first saw the sand dunes of Planet Rathira, little did she know that this apparently peaceful world with a civilization strangely like that of Ancient Egypt was under attack by demons from another dimension, that the strange-looking cross recently given to her was the Ti-Ank, a talisman of unbelievable power, or that her possession of the Ti-Ank and her remarkable ability to speak to the dead marked her as the long-prophesied Techu, whom the Rathirians believed would come to save their world.Accompanied by Nikura, a panther-sized gray and silver tabby cat of unknown age and origin who talks only to Karma but appears to know far more than he is telling, Karma sets out across the desert with a royal caravan on The Quest of the Orbs, a journey to find three mysterious Orbs of Power necessary to prevent Rathira from being overrun by escapees from the demons' world. To make things even more complicated, not only does Karma have to deal with palace intrigue and scheming courtiers, as well as repeated attacks by demons bent on killing her and stealing the Ti-Ank, she also must face off against the distant and forbidding, but undeniably gorgeous, Warrior Prince Zakiel, son of King Rhobar, who leads the caravan. His high handed manner puts her off, but there is something about him--maybe his startlingly blue eyes, not to mention the sight of him in those tight, black riding leathers--that stirs her as no other man ever has.In \"The Quest of the Moon Orb,\" Laura Jo Phillips builds on prior successes and yet goes in a new direction. Her thousands of fans will recognize the compelling romance, the bounding emotions, the convincing world-building, and the smoldering passions for which her books are known. Yet, unlike her previous works which involved multiple partners and advanced civilizations, this story is about the love of a man for a woman and a woman for a man, set on a world where that love must be fought for without technology, but with magic, sharp steel, stalwart courage, and true hearts.",
  "genres": [
    "Science Fiction",
    "Paranormal",
    "Aliens",
    "Fantasy",
    "Science Fiction Romance",
    "Romance",
    "Fantasy Romance"
  ],
  "author": "Laura Jo Phillips",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/15850720-quest-for-the-moon-orb"
}