{
  "title": "Le Sermon sur la chute de Rome",
  "description": "Dans un village corse perché loin de la côte, le bar local est en train de connaître une mutation profonde sous l’impulsion de ses nouveaux gérants. À la surprise générale, ces deux enfants du pays ont tourné le dos à de prometteuses études de philosophie sur le continent pour, fidèles aux enseignements de Leibniz, transformer un modeste débit de boissons en “meilleur des mondes possibles”. Mais c’est bientôt l’enfer en personne qui s’invite au comptoir, réactivant des blessures très anciennes ou conviant à d’irréversibles profanations des êtres assujettis à des rêves indigents de bonheur, et victimes, à leur insu, de la tragique propension de l’âme humaine à se corrompre.Entrant, par-delà les siècles, en résonance avec le sermon par lequel saint Augustin tenta, à Hippone, de consoler ses fidèles de la fragilité des royaumes terrestres, Jérôme Ferrari jette, au fil d’une écriture somptueuse d’exigence, une lumière impitoyable sur la malédiction qui condamne les hommes à voir s’effondrer les mondes qu’ils édifient et à accomplir, ici-bas, leur part d’échec en refondant sans trêve, sur le sang ou les larmes, leurs impossibles mythologies.Empire dérisoire que se sont constitué ceux qui l’ont toujours habité comme ceux qui sont revenus y vivre, un petit village corse se voit ébranlé par les prémices de sa chute à travers quelques personnages qui, au prix de l’aveuglement ou de la corruption de leur âme, ont, dans l’oubli de leur finitude, tout sacrifié à la tyrannique tentation du réel sous toutes ses formes, et qui, assujettis aux appétits de leur corps ou à leurs rêves indigents de bonheur ou d’héroïsme, souffrent, ou meurent, de vouloir croire qu’il n’est qu’un seul monde possible.",
  "genres": [
    "Fiction",
    "France",
    "Novels",
    "French Literature",
    "Contemporary",
    "Roman",
    "21st Century"
  ],
  "author": "Jérôme Ferrari",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/15851892-le-sermon-sur-la-chute-de-rome"
}