{
  "title": "The Music of the Temporalists",
  "description": "A Parisian drugstore owner (André Pogoriloffsky), a man in his early fifties, who is also a skilled amateur piano player, experiences a two year long mental trip to a parallel (Temporalist) world, as an avatar. He will soon find out that he was purposely \"imported” there in order to be taught the basics of that culture’s music theory. Pogoriloffsky is permanently accompanied by a local musicologist – Jean-Philippe, an expert in the European musical tradition – and, for a while, initiated by an old psychologist (Herr Sch… etc.) in the cognitive aspects of Temporalist music theory. The two men ask Pogoriloffsky to memorize as much as he is capable to from the theoretical notions that he is presented with so that, once returned to Paris, be able to transcribe all that information for the use of his own musical culture. In order to become more familiarized with Temporalist music and musical interpretation, in the following months Pogoriloffsky tours an important number of music schools, universities, musical libraries, concert halls and audition rooms or is encouraged to attend various lectures and conferences.The music of the Temporalists describes a journey into a parallel world that is populated with humans like us who just happened to have cultivated music as \"the art of time” and not as \"the art of sounds”. Pogoriloffsky recounts all that experience with honesty, doing his best to meet his two guides’ expectations. For this reason, with a very few exceptions, he only describes Temporalist music theory, pedagogy and practice – ignoring most of the unusual things that the parallel world (in which he spends more than two years) surprised him with.The book is composed of a 30 pages long fictional introduction, a 115 pages long description of the Temporalist music theory (and history), a 10 pages long fictional ending and a table of references.Evidently, the main focus of the book resides in the music theory chapters that contain a perceptual approach towards the way humans process the many possible aspects of discrete, musical time. The theory is the result of a 20 year long effort by its author to define an alternative system for the classical bar-rhythmical theory. In order to achieve that, he had to read literally thousands of pages of scientific contributions, articles and books on time perception/cognition and rhythm production – all that being consequently filtered down to a standalone theory, presented in the main section of the book.Thus, along the 28 theoretical chapters the book presents all the perceptual thresholds extant in the 20-3000 ms per musical pulsation range, along with the musical implications of each and every such threshold. It also introduces many other perceptual phenomena (e.g. entrainment, chunking, subjective accentuation, pulsatory inertia, temporal gap perception etc.), thus mapping all the aspects of temporal discretization that are relevant from a musical point of view.In order to achieve cohesion and accessibility, the theoretical system is presented as if it already constituted the basis of a complex, hands-on, musical tradition.The inherent shortcomings of this kind of fictional musicology are well counterbalanced by the fact that musicians who will read the book will benefit from the fact that the theory is presented as a real, fully functional system. It could never be stressed enough the fact that, despite the unusual approach, the theory itself is all but 100% based on real perceptual phenomena substantiated by the many scientific studies mentioned above and detailed in the list of references.",
  "genres": [
    "Music",
    "Humor",
    "Fiction"
  ],
  "author": "André Pogoriloffsky",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/15852076-the-music-of-the-temporalists"
}