{
  "title": "Blood Stone",
  "description": "Survival becomes a deadly game where lovers might be enemies.Nial orders Calum Garrett to get close to Hollywood producer Kate Lindenstream. Garrett reluctantly complies for he has held himself apart from humans for centuries. Kate doesn’t fall into Garrett’s arms, either. She already has someone for that. Roman Xerus—whom Kate knows as Adrian—and Garrett go way back to the sixteenth century Scottish highlands, but they parted bitterly two hundred years ago.With Roman’s support, Kate battles Garrett in wills and business as he methodically forces himself into her life. However, on the closed-in movie set in the Californian desert, Garrett’s calm, orderly world crumbles for Garrett is drawn to Kate. He has begins to experience real, human feelings.Kate doesn’t cooperate in the chess game Nial orchestrates, despite being unaware of the strategies swirling around her film set. Demanding and expecting only the best for her movie, Kate’s agenda forces Roman and Garrett to work together to protect her and keep the humans around her ignorant of the Pro Libertatus, the anonymous and all-powerful vampire group who nearly killed Nial, Sebastian and Winter, and shield Kate from the excesses of the League for Humanity. But could Roman really be with the Pro Libertatus?There’s hidden intentions everywhere, and centuries of repressed feelings, along with at least two different groups that mean them harm. Then there’s the rumours that Kate has found the mythical Blood Stone, the key to unlocking vampire history and lifting their curse. Who is Kate, really? Because once Garrett begins to notice, things about Kate don’t quite add up, either...This book is part of the Blood Stone SeriesBlood Stone 1.0: Blood Knot (#1 Amazon Best Seller, Fantasy Romance)Blood Stone 1.5: Amor Meus* (Blood Drops Collection)Blood Stone 2.0: Blood StoneBlood Stone 3.0: Blood UnleashedBlood Stone 3.5: Blood Drive – Blood Stone Boxed Set 1Blood Stone 4.0: Blood RevealedBlood Stone 5.0: Blood Ascendant[*Blood Drops are short and novella length stories featuring the characters and situations in the Blood Stone series. Droplet sized morsels for your reading pleasure.]These are continuing characters and storylines. Reading the series in order is strongly recommended.Reader Advisory: This MMF vampire romance contains two hot, sexy alpha heroes, frequent, explicit and frank sex scenes and sexual language.It includes heart-stopping sexual scenes between the aforementioned sexy heroes, menage scenes, anal sex and the use of sex toys. Don't proceed beyond this point if hot love scenes offend you.No vampires were harmed in the making of this novel.A Vampire Menage Urban Fantasy Romance__Praise for Blood StoneReviewer Top Pick. Blood Stone is a brilliant, awesome and fantastic read! The secrets were shocking. With so many different ways the story could play out it was exciting. I couldn’t stop thinking about the story and the characters! Night Owl ReviewsThis entertaining paranormal and erotic world of vampires has lots of great elements that make the perfect story, suspense, action, drama, characters, great story line, emotional issues, and unique elements that keep the reader on their toes.",
  "genres": [
    "Menage",
    "M M F",
    "Vampires",
    "Paranormal Romance",
    "Paranormal",
    "Romance",
    "Erotica"
  ],
  "author": "Tracy Cooper-Posey",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/15852429-blood-stone"
}