{
  "title": "Road Trip",
  "description": "An Xcite Books collection of five erotic stories with mixed cougar and jackals themes.Road TripEmma’s never had such good sex as when, in her university days, she found herself being banged, up against the wall in a grotty flat with an unknowing fellow student just a few feet away. Now that she’s older, wiser and worried about creasing her business suit, can a younger man persuade her to risk everything for a quickie in a public place?In Search Of BookcasesSophia works in an upmarket London department store. Enter Declan, a hot older man – he’s sexy, available and loaded, but down to earth too. As she helps him to furnish his luxury home, his purchasing frenzy is littered with flirting and double entendres, so when Declan leaves, Sophia’s left feeling more than a little flustered. But when she realises he’s left something behind, Sophia does the decent thing and returns it to him, with some seriously sexy results.Motion of the OceanSeduction isn’t part of the plan for newly-divorced Suzanne when she accepts an invitation for a relaxing weekend at the ocean – then she meets Mark, the 22-year-old son of a close friend. His hard young body proves to be too great a temptation and, using the pretext of a moonlight swim, she shows him a few of the tricks that only a more experienced older woman can offer.The GazeDale is an old cuss who works construction. At nearly 50 years old, this grizzled man is surprised to engage the attention of a 19-year-old boy, who gazes at him from the bus stop day after day. After nearly three weeks of scrutiny, it’s Dale who finds the confidence to finally make the first move.I’ve Got My Eyes On YouWho is the young man who repeatedly appears in the same places as Eleanor? As a woman in her late forties, she should be flattered. But is he just an admirer or could he be a stalker? Eleanor determines to find out. Her efforts lead her down the road to some unexpected revelations, not least concerning her own sexuality.These stories have also appeared in Cougars and Jackals published by Xcite Books.",
  "genres": [],
  "author": "Antonia Adams",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/15852727-road-trip"
}