{
  "title": "Dust: Collected Stories of Wonder",
  "description": "From the book's introduction:\"If you think about it, really every story’s a fantasy in the same way that every story is a mystery. But that’s not what I’m talking about. I’m talking about the actual (and I make air quotations with my fingers around this) \"fantasy genre\". See, nobody will suspect that I write so much fantasy next year when my first \"adult\" novel hits store shelves because it is most certainly not a fantasy. It is a pure mystery and really not indicative of the majority of my writing. Even though I had a blast writing that one, too. \"All in all, I think fantasy’s got to be the ultimate genre to write in because you have no limitations. There are so few limitations that a lot of the time I have to actually put artificial constraints on the story so that it is manageable, otherwise it can just take off on you like a wild horse.\"This little book contains a selection of four little fantasy stories of mine. Two are almost long enough to call novellas. One of those is also a bona-fide mystery. The other two are small pieces. The title work, Dust, is to me one of the most fragile things I’ve ever written. It very much relies on meter of every word I’ve included inside it and it’s definitely meant to be read aloud.\"I think short stories are meant to be delicate in a lot of cases. They depend on a very small framework to keep them together and all the pieces need to be there or they’ll collapse under their own pressure. With short stories, God really is in the details, and the smallest thing can mean the difference between brilliance and balderdash.\"I think you’ll find a little of both inside these pages. \"Hey, at least I’m being honest.\"I hope you enjoy these stories. I sure do.\"If you want information on where you can get a copy of Dust, check out Michael Hiebert's website at http://www.michaelhiebert.com/dangerb... While you're there, sign up for his newsletter. Members get incredible discounts on his books and other benefits.",
  "genres": [],
  "author": "Michael Hiebert",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/15853032-dust"
}