{
  "title": "Her Master Defender",
  "description": "Major Dos Masters deployed on counter drug operations more than he is on base or home in Colorado, prefers his no relationships, no broken hearts lifestyle. Then a mission went horribly wrong. Dos spent months in captivity and more in the hospital after his rescue. He has finally returned home to Colorado for some R&R. His time is spent getting back in shape, fighting attacks from a virus his captors pumped into him, and watching the redhead across the street from his brother's security office. Not that he plans to do more than watch. Between his vow not to marry, and his now questionable life expectancy, a relationship is the last thing he wants or needs.Copper Kerrigan, ex-Navy nurse turned massage therapist, likes her quiet life in the Colorado Rockies. Living in the house she inherited from her grandparents is a nice change from the horror of Iraq. Coming home to watch her mother's decline from cancer, confirmed her decision to leave nursing. With massage, she is still able to help people heal without all the red tape of hospitals. Her life is full with work and friends. Growing up an Army brat and watching her mother's heartbreak every time her father deployed, she knows love is not for her, especially not with a military man. At least, she did until someone breaks into her place of business and a wounded soldier comes to her rescue.When Dos receives a call from his commanding officer, who turns out to be the redhead's father, his mission becomes making certain Copper remains safe. His plan is to do it from a distance, but when later that night someone tries to break into her house, Dos finds himself with a very pretty, very tempting houseguest. Copper wishes she could argue the command that she spend the night at his house, but since he was injured trying to protect her it seems a bit childish. Besides, her father asked her to help with his rehab. A stay at his house for the night will give her a clearer view into the severity of his condition. What she sees instead are shadows of guilt in his eyes. She fears she won't be able to resist the pull of his wounded heart.",
  "genres": [
    "Romantic Suspense",
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Military Romance",
    "Military Fiction",
    "Suspense"
  ],
  "author": "Sandra S. Kerns",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/15853198-her-master-defender"
}