{
  "title": "Storie Orali: Racconto, immaginazione, dialogo",
  "description": "SinossiAlessandro Portelli è considerato uno dei padri fondatori della storia orale non solo italiana ma internazionale. Deve tale fama al paziente accumulo di decenni di viaggi e interviste a cavallo dei continenti ai protagonisti della storia non ufficiale, quella fatta attraverso le voci dei testimoni diretti di grandi eventi che hanno segnato epoche e svolte culturali. Solo oggi, però, i saggi di Portelli apparsi sul mercato editoriale americano sancendo la sua autorevolezza scientifica, vengono raccolti in una sorta di canone. Nell’ultimo quarto di secolo essi hanno contribuito a trasformare il metodo, gli obiettivi, le finalità stesse della storia orale, diventando riferimenti obbligati in ambito internazionale, sono ora per la prima volta tradotti in italiano.La storia orale ricostruisce gli eventi del passato, soprattutto del mondo popolare e non egemone; ma soprattutto ne esplora il significato, attraverso l’analisi del racconto, l’immaginazione, il desiderio, il sogno, la soggettività – e attraverso il dialogo fra culture e persone, intervistati e intervistatori, ricercatori e narratori. La storia orale si intreccia con la letteratura, la linguistica, l’antropologia, le religioni, la musica, la cultura di massa – e la politica. Ecco perché i saggi di Portelli percorrono un tempo che va dalle stragi naziste e i bombardamenti della seconda guerra mondiale all’impatto della globalizzazione sul mondo operaio e agli eventi del G8 di Genova, e uno spazio che va dalle acciaierie di Terni al Kentucky, da Roma all’India, passando per il Brasile o per il Vietnam. Partendo da eventi puntuali e da luoghi definiti essi elaborano proposte generali di teoria e di metodo. A tenerli insieme è una immutata passione, un unico stile, e una insaziabile curiositàche contagia il lettore pagina dopo pagina.Alessandro Portelli, nato a Roma nel 1942, è considerato tra i fondatori della storia orale. Professore di Letteratura angloamericana all’Università «La Sapienza» di Roma, ha fondato e presiede il circolo Gianni Bosio per la conoscenza critica e la presenza alternativa delle culture popolari. Collabora con la Casa della Memoria e della Storia di Roma e con «il manifesto», «Liberazione» e «l’Unità».",
  "genres": [],
  "author": "Alessandro Portelli",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/10072474-storie-orali"
}