{
  "title": "Lincoln's Code: The Laws of War in American History",
  "description": "In the fateful closing days of 1862, three weeks before Emancipation, the administration of Abraham Lincoln commissioned a code setting forth the laws of war for the armies of the United States. The code announced standards of civilized conduct in wartime concerning issues such as torture, prisoners of war, civilians, spies, and slaves. The code Lincoln approved ultimately shaped the course of the Civil War. And when the war was over, the same code reshaped warfare the world over. By the twentieth century, the 157 articles of Lincoln’s code had become the basis of a new international law of war. European powers adopted the American code. International agreements like the Geneva Conventions incorporated and expanded it. In this pathbreaking and deeply original book, John Fabian Witt tells the hidden story of the laws of war in the first century of the United States–and of the extraordinary code that emerged from it to change the course of world history. Lincoln’s Code is the haunting and inspiring story of an idea in American the idea that conduct in war can be regulated by law. For many, the very idea of a law for war has seemed like an oxymoron. But with sweep and vitality, Witt unfolds the story of the cast of characters who invented the modern laws of war. Washington, Jefferson, and Franklin championed Enlightenment rules for civilized warfare. James Madison went to war in 1812 to vindicate them. Indian conflicts challenged and distorted them. The Mexican War quietly revolutionized them. In the Civil War, Lincoln and a small band of now forgotten figures helped remake those same laws to support Emancipation and advance the Union war effort. Three decades later, a new generation of Americans went into a war of American empire in the Philippines equipped with the very rules Lincoln had laid down. In beautifully crafted prose, Witt brings to life the soldiers and the presidents, the war makers and the pacifists, the Indians and the slaves, the cynics, the utopians, and the pragmatists who struggled with enemies and with one another to shape the United States’ vision of the laws of war. A narrative of expansive range and significance, Lincoln’s Code depicts the drama of armed conflict and the anguish of human beings grappling with such vexing questions as whether prisoners could be executed; whether there were rules in Indian wars; whether military commissions could try unlawful combatants; whether torture might ever be justified; and whether slaves could be freed in wartime. The code Lincoln issued prohibited cruelty and the infliction of pain for its own sake but left room for vast destruction in the name of a just cause. It condoned the devastation inflicted in Sherman’s march to the sea. Yet it also provided a moral foundation for Emancipation and insisted that doing the right thing in situations of grave crisis was indispensable to the legitimacy of modern armies. Witt’s engrossing exploration of the dilemmas at the heart of the laws of war is a prehistory of our own era. Today the world once again confronts raging legal and moral controversy over the conduct of war. Lincoln’s Code reveals that the controversies of the twenty-first century have roots going back to the beginnings of American history. In a time of heated controversy about the nation’s conduct in wartime, Lincoln’s Code is a compelling story of ideals under pressure and a landmark contribution to our understanding of the American experience.",
  "genres": [
    "History",
    "Law",
    "Nonfiction",
    "American History",
    "Civil War",
    "Politics",
    "Military Fiction"
  ],
  "author": "John Fabian Witt",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/15854335-lincoln-s-code"
}