{
  "title": "HR from the Outside In: Six Competencies for the Future of Human Resources",
  "description": "“This definitive work on HR competencies provides ideas and tools that help HR professionals develop their career and make their organization effective.”―Edward E. Lawler III, Professor, University of Southern California “This book is a crucial blueprint of what it takes to succeed. A must have for every HR professional.”―Lynda Gratton, Professor, London Business School “One single concept changed the HR world forever: ‘HR business partner’ . Through consistent cycles of research and practical application, Dave and his team have produced and update the most comprehensive set of HR competencies ever.”―Horacio Quiros, President, World Federation of People Management Associations \"Packed with facts, evidence, and prescriptive advice. It is about being a business leader first, and an HR professional second.”―Randy MacDonald, Senior Vice President, Human Resources, IBM Corporation \"The concepts and competencies presented in this book provide HR leaders with new insights.\"―Gina Qiao, Senior Vice President, HR Lenovo “Powerful, relevant and timely! Defines \"new HR\" in a pragmatic way. This book is a must for leaders and HR folks who seek to create sustainable competitive advantage.”―Satish Pradhan, Chief, Group Human Resources, Tata Sons Limited “You can’t argue with the data! This book is a definitive and practical guide to learning the HR competencies for success.”―John Lynch, Senior Vice President, HR, General Electric “A must read for any HR executive. This research-based competency model is particularly compelling because it is informed by the perspective of non-HR executives and stakeholders.”―Sue Meisinger, Distinguished speaker and author, former CEO of SHRM \"Read this book for a unique long-term perspective on where HR competencies have brought us and must take us in future.\"―John Boudreau, Professor, University of Southern California and Research Director, Center for Effective Organizations",
  "genres": [
    "Historical Romance",
    "Business",
    "Human Resources",
    "Nonfiction",
    "Management",
    "Leadership"
  ],
  "author": "Dave Ulrich",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/15854810-hr-from-the-outside-in"
}