{
  "title": "Overheated: The Human Cost of Climate Change",
  "description": "Deniers of climate change sometimes quip that claims about global warming are more about political science than climate science. They are wrong on the science, but may be right with respect to its political implications. A hotter world, writes Andrew Guzman, will bring unprecedented migrations, famine, war, and disease. It will be a social and political disaster of the first order. In Overheated, Guzman takes climate change out of the realm of scientific abstraction to explore its real-world consequences. He writes not as a scientist, but as an authority on international law and economics. He takes as his starting point a fairly optimistic outcome in the range predicted by scientists: a 2 degree Celsius increase in average global temperatures. Even this modest rise would lead to catastrophic environmental and social problems. Already we can see how it will work: The ten warmest years since 1880 have all occurred since 1998, and one estimate of the annual global death toll caused by climate change is now 300,000. That number might rise to 500,000 by 2030. He shows in vivid detail how climate change is already playing out in the real world. Rising seas will swamp island nations like Maldives; coastal food-producing regions in Bangladesh will be flooded; and millions will be forced to migrate into cities or possibly \"climate-refugee camps.\" Even as seas rise, melting glaciers in the Andes and the Himalayas will deprive millions upon millions of people of fresh water, threatening major cities and further straining food production. Prolonged droughts in the Sahel region of Africa have already helped produce mass violence in Darfur. Clear, cogent, and compelling, Overheated shifts the discussion on climate change toward its devastating impact on human societies. Two degrees Celsius seems such a minor change. Yet it will change everything.",
  "genres": [
    "Climate Change",
    "Science",
    "Nonfiction",
    "Environment",
    "Sustainability"
  ],
  "author": "Andrew T.  Guzman",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/15856813-overheated"
}