{
  "title": "Pataphysics: A Useless Guide",
  "description": "Of all the French cultural exports over the last 150 years or so, 'pataphysics--the science of imaginary solutions and the laws governing exceptions--has proven to be one of the most durable. Originating in the wild imagination of French poet and playwright Alfred Jarry and his schoolmates, resisting clear definition, purposefully useless, and almost impossible to understand, 'pataphysics nevertheless lies around the roots of Absurdism, Dada, futurism, surrealism, situationism, and other key cultural developments of the twentieth century. In this account of the evolution and influence of 'pataphysics, Andrew Hugill offers an informed exposition of a rich and difficult territory, staying aloft on a tightrope stretched between the twin dangers of oversimplifying a serious subject and taking a joke too seriously. Drawing on more than twenty-five years' research, Hugill maps the 'pataphysical presence (partly conscious and acknowledged but largely unconscious and unacknowledged) in literature, theater, music, the visual arts, and the culture at large, and even detects 'pataphysical influence in the social sciences and the sciences. He offers many substantial excerpts (in English translation) from primary sources, intercalated with a thorough explication of key themes and events of 'pataphysical history. In a Jarryesque touch, he provides these in reverse chronological order, beginning with a survey of 'pataphysics in the digital age and working backward to Jarry and beyond. He looks specifically at the work of Jean Baudrillard, Georges Perec, Italo Calvino, J. G. Ballard, Asger Jorn, Gilles Deleuze, Roger Shattuck, Jacques Pr?vert, Antonin Artaud, Ren? Clair, the Marx Brothers, Joan Mir?, Max Ernst, Marcel Duchamp, James Joyce, Flann O'Brien, Raymond Roussel, Jean-Pierre Brisset, and many others.",
  "genres": [
    "Philosophy",
    "Nonfiction",
    "Art",
    "France",
    "History",
    "Theory",
    "Reference"
  ],
  "author": "Andrew Hugill",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/15857469-pataphysics"
}