{
  "title": "Our Aesthetic Categories: Zany, Cute, Interesting",
  "description": "The zany, the cute, and the interesting saturate postmodern culture. They dominate the look of its art and commodities as well as our discourse about the ambivalent feelings these objects often inspire. In this radiant study, Sianne Ngai offers a theory of the aesthetic categories that most people use to process the hypercommodified, mass-mediated, performance-driven world of late capitalism, treating them with the same seriousness philosophers have reserved for analysis of the beautiful and the sublime.Ngai explores how each of these aesthetic categories expresses conflicting feelings that connect to the ways in which postmodern subjects work, exchange, and consume. As a style of performing that takes the form of affective labor, the zany is bound up with production and engages our playfulness and our sense of desperation. The interesting is tied to the circulation of discourse and inspires interest but also boredom. The cute’s involvement with consumption brings out feelings of tenderness and aggression simultaneously. At the deepest level, Ngai argues, these equivocal categories are about our complex relationship to performing, information, and commodities.Through readings of Adorno, Schlegel, and Nietzsche alongside cultural artifacts ranging from Bob Perelman’s poetry to Ed Ruscha’s photography books to the situation comedy of Lucille Ball, Ngai shows how these everyday aesthetic categories also provide traction to classic problems in aesthetic theory. The zany, cute, and interesting are not postmodernity’s only meaningful aesthetic categories, Ngai argues, but the ones best suited for grasping the radical transformation of aesthetic experience and discourse under its conditions.",
  "genres": [
    "Philosophy",
    "Art",
    "Nonfiction",
    "Theory",
    "Sociology",
    "Literary Criticism",
    "Criticism"
  ],
  "author": "Sianne Ngai",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/15861548-our-aesthetic-categories"
}