{
  "title": "The Strange Case of Dr. Doyle: A Journey Into Madness and Mayhem",
  "description": "London. 1910. A procession of well-attired gentlemen and ladies are clearly out of place among the stalls and pushcarts of the Whitechapel District. As the group makes its way through the crowded streets, the tour guide stops now and then to point out various places where the mutilated bodies of the women had been found. Although the murders occurred twenty-two years prior, the man leading the group seems to know every detail and aspect of each slaying. Of those things he does not know, he offers freely his own insightful conjecture. This is, however, no average tour of brutal acts. It is a close look at infamous serial killer Jack the Ripper s trail of blood. And the man leading the group is none other than Sir Arthur Conan Doyle famous creator of fictional character Sherlock Holmes, the world s greatest detective. In The Strange Case of Dr. Doyle, we learn what draws one famous Englishman to another in ways that are as fascinating as they are shocking. Sir Arthur Conan Doyle actually led a tour group to the sites of the Whitechapel Murders in the year 1910. While we do not have an existing description of that tour, authors Daniel Friedman, MD, and Eugene Friedman, MD, have meticulously pieced together Doyle s own words to create a riveting account of his publicly stated beliefs on each of these horrific murders. As Doyle takes the group on his tour, the reader learns about the victims and the way each died. The authors have also included new pieces of evidence to understand better the murderer known to history only as Jack the Ripper. Interspersed throughout the tour is the Friedmans unique and well-researched account of the life of the young Conan Doyle, which was shrouded in more mystery than any of his own works of fiction. The authors have uncovered facts about which few, if any, Doyle biographers have ever been aware. Doyle was able to reinvent himself so fully through his own writings that few recognized the more disturbing elements that were cut out of his own life story. What these two authors have uncovered in their investigation of Jack the Ripper and Sir Arthur will no doubt spark passion and debate among Sherlockians for years to come. The Strange Case of Dr. Doyle proves once again that truth elementary as it may be is always stranger than fiction.\"",
  "genres": [
    "History",
    "Nonfiction",
    "True Crime",
    "Biography",
    "Mystery"
  ],
  "author": "Daniel Friedman MD",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/15862643-the-strange-case-of-dr-doyle"
}