{
  "title": "The Thistle and the Drone: How America's War on Terror Became a Global War on Tribal Islam",
  "description": "In the wake of the 9/11 attacks, the United States declared war on terrorism. More than ten years later, the results are decidedly mixed. Here world-renowned author, diplomat, and scholar Akbar Ahmed reveals an important yet largely ignored result of this war: in many nations it has exacerbated the already broken relationship between central governments and the largely rural Muslim tribal societies on the peripheries of both Muslim and non-Muslim nations. The center and the periphery are engaged in a mutually destructive civil war across the globe, a conflict that has been intensified by the war on terror.Conflicts between governments and tribal societies predate the war on terror in many regions, from South Asia to the Middle East to North Africa, pitting those in the centers of power against those who live in the outlying provinces. Akbar Ahmed's unique study demonstrates that this conflict between the center and the periphery has entered a new and dangerous stage with U.S. involvement after 9/11 and the deployment of drones, in the hunt for al Qaeda, threatening the very existence of many tribal societies.American firepower and its vast anti-terror network have turned the war on terror into a global war on tribal Islam. And too often the victims are innocent children at school, women in their homes, workers simply trying to earn a living, and worshipers in their mosques. Battered by military attacks or drone strikes one day and suicide bombers the next, the tribes bemoan, \"Every day is like 9/11 for us.\"In The Thistle and the Drone, the third volume in Ahmed's groundbreaking trilogy examining relations between America and the Muslim world, the author draws on forty case studies representing the global span of Islam to demonstrate how the U.S. has become involved directly or indirectly in each of these societies. The study provides the social and historical context necessary to understand how both central governments and tribal societies have become embroiled in America's war. Beginning with Waziristan and expanding to societies in Central Asia, the Middle East, North Africa, and elsewhere, Ahmed offers a fresh approach to the conflicts studied and presents an unprecedented paradigm for understanding and winning the war on terror.The Thistle and the Drone was the 2013 Foreword Reviews Gold winner for Political Science.",
  "genres": [
    "Politics",
    "History",
    "Nonfiction",
    "War",
    "Islam",
    "Religion",
    "Terrorism"
  ],
  "author": "Akbar Ahmed",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/15864058-the-thistle-and-the-drone"
}