{
  "title": "Wish",
  "description": "The tale is set in an alpine region at no specified time. Depending on age and disposition, humans freely commune with creatures and plants. Valley farming people are haunted by the malice and thieving of Faengler, a cunning, embittered enchanter who abuses an ancient wishing chain of potent stones. All people hope that a hero will cross the high pass into the villain's shadowy, fortified valley, seize the chain and realise everyone's dreams of wealth and security. Adam the forester typifies this simplistic view. His wife, Maria, is more reflective and cautious. The contrast is reflected in their children, Berwald and Clara.Influenced by Adam, the children leave the shelter of their home and valley unprepared and in secret to take the chain and return triumphant. Their journey through an inhospitable landscape is peopled by plants and creatures who show puzzling extremes of pride, greed and generosity, and who reveal that the colour of wishes determines our outlook and actions. Berwald reacts by becoming more egotistic and ruthless, whereas the experience brings out Clara's gentler, more intuitive nature.Once they enter Faengler's realms this difference affects the children's treatment by the villain, his stunted guards and captive spirits. Clara's 'rose-hearted' benevolence instils fear; Berwald's insolence and 'red' wishes redouble their power and enable Faengler to imprison the children in a dead forest, depriving them of all contact with their 'natural' allies. They try to escape only to be pitched into an inaccessible marshy valley among captured herds.Meanwhile, Adam and Maria assume their children have been stolen by Faengler. All else failing, Adam tramps many miles to consult Well-Wisher, an old but ageless seer. Her lightly held yet profound insight and knowledge seem to derive from a preoccupation with dreams. Adam demands a quick solution but he must reject the power of his axe and accept improbable leads.He follows a beetle on a treacherous mountain journey to Faengler's borders. Her forthright but moving narrative of the old thief's disillusioned life evokes his pity and understanding, 'rose-heartedness' that breaks a spell cast by Faengler. The beetle is transformed to her former glory as Alpenrose, and Adam is inclined to doubt whether violence and vengeance will secure his children's release, though he has more to learn. They enter the hostile forest and caves unopposed. The benevolent rose-coloured aura shed by Alpenrose frees spirits and guards from gloom and captivity, and reduces the tyrant to a defenceless old cipher. Concern for his children and stolen flock kindles righteous anger in Adam but he forgets the magic necklace as he punishes the thief by locking him in a cloven pine.It is Clara who confronts her father and brother (now quietly ashamed of his role) with Faengler's defencelessness, and makes them agree to his release. In a moment of redemption the cowering villain hands the chain to Clara who makes her father its guardian. Adam looks at the suddenly untarnished and diminished set of stones and wonders what they can achieve now he has won back his children and flock and can restore them all to his anxious wife. The future of the chain and of Faengler is left in abeyance.",
  "genres": [],
  "author": "Michael Tolkien",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/15864681-wish"
}