{
  "title": "The Evolution of Wealth: An Economic History of Innovation and Capitalism, the Role of Government, and the Hazards of Democracy",
  "description": "What magic has made our nation so wealthy, and left so many behind? The most common explanation is that ours is a capitalist nation and theirs is not. So what is it about capitalism that has made it so successful in creating wealth? If it is so successful, then why is capitalism so disliked and mistrusted by so many people?More fundamentally, what is capitalism and where did it come from? Why, for the average person, was there almost no improvement in material well-being for thousands and thousands of years, then in the last two hundred, the rate of change accelerated, bringing people in the advanced nations wealth beyond the wildest fantasies of any Roman Emperor?The answers to these questions emerge from the history of our economic system’s evolution. This story, told in the first half of the book, illuminates how people’s natural behavior gave rise to particular economic practices, and gives clear insight into the whole process of change and the production of wealth.WE are at NOW in that continuing evolution. With its focus narrowed to the United States, the book discusses our current circumstances. We seem to have great difficulty in governing ourselves prudently. Our collective instinct is to blame our politicians. This implies, though, that the nation has repeatedly elected the five hundred or so persons to be our federal leaders who are the only citizens unable to face hard, unpleasant problems and do something about them. The book presents the case that the problem lies less in the inadequacy of politicians than in the perverse incentives put in place by the nature of the democratic system in which they must perform. Specific actions are suggested to smooth this and other bumps in the road of our future evolution. Discussed at some length is a complete restructuring of our K-12 education system.This easy-to-read book is just long enough to tell the essential story of the evolution of wealth and convey a broad understanding of how our economy works, its problems, and fruitful directions for its future evolution.",
  "genres": [
    "History",
    "Economics",
    "Nonfiction",
    "Microhistory",
    "Business"
  ],
  "author": "Jerry D. Ward",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/15867045-the-evolution-of-wealth"
}