{
  "title": "In His Image",
  "description": "FORETOLD IN THE BIBLE: Two nuclear wars. Three asteroids. Demonic madness. Into this, a savior will rise, cloned from Christ. It's not fiction. It's prophecy. The Messiah of the New Age. His coming is prophesied by more than a dozen major religions. Cloned from live cells of Jesus Christ found on the Shroud of Turin, Christopher Goodman was born into the most turbulent time in human history. Mentored by former UN Assistant Secretary-General Robert Milner, Christopher rises in position and power, and displays remarkable wisdom and compassion. But through disjointed bits of dreams that sometimes haunt him, Christopher reveals significant troubling errors in the biblical record of Jesus life. Soon the reason for Robert Milner 's interest in Christopher becomes clear: the world is about to undergo a time of destruction and chaos darker than any in history, with impending nuclear war merely a faint precursor. Milner explains that without Christopher, humanity will not long survive. Under Christopher 's leadership, however, mankind stands on the threshold of a final great evolutionary leap that will bestow on the human race god-like powers. This is the reason, Milner says, that Christopher was born. In Israel, an unexpected threat to Christopher 's ascension is growing: two men, possessed of incredible supernatural powers, one claiming to be the 2000-year-old Apostle John, the other an apostate Hasidic rabbi named Saul Cohen. Together, the men lead an outlawed cult of 144,000 followers, each branded with the names Yahweh and Yeshua on their foreheads. PRAISE FOR THE CHRIST CLONE TRILOGY \"BeauSeigneur knows how to write, deploying a tough, driving style in perfect cadence.\" -Booklist (Starred Review)\"Astoundingly intelligent...inventive...dizzyingly well-described.\" -Kirkus Reviews (Starred Review) \"Undeniably riveting... daring...wonderfully creepy...Readers will be enthralled by the author's science-fortified vision of the Apocalypse.\" -Publishers Weekly PUBLICATION HISTORY IN HIS IMAGE is Book One of a revised, expanded, and re-edited release of THE CHRIST CLONE TRILOGY, originally published in 1997 by SelectiveHouse and in 2003 by Warner Books. This new edition includes a Study Guide and an extensive Prophecy Cross Reference. THE CHRIST CLONE TRILOGY has been translated and published in 12 languages. Book Two is BIRTH OF AN AGE. Book Three is ACTS OF GOD.",
  "genres": [
    "Christian Fiction",
    "Fiction",
    "Christian",
    "Science Fiction",
    "Religion",
    "Fantasy",
    "Thriller"
  ],
  "author": "James BeauSeigneur",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/15867426-in-his-image"
}