{
  "title": "Birth Of An Age",
  "description": "FORETOLD IN THE BIBLE: Two nuclear wars. Three asteroids. Demonic madness that kills one third of the world 's population. Into this, a savior will rise, cloned from Christ. It 's not fiction. It 's prophecy. The Messiah of the New Age. His coming is prophesied by more than a dozen major religions. Cloned from live cells of Jesus Christ found on the Shroud of Turin, Christopher Goodman was born into the most turbulent time in human history. Already two nuclear holocausts have shaken the planet the first destroying much of the Russian Republic, and the second killing nearly a billion people in China, India, and Pakistan. Unknown to the world 's inhabitants, an even greater threat is waiting just beyond Earth 's horizon a threat that may annihilate the entire human race. Three asteroids are hurtling toward the planet, thrown from their orbits by the supernatural powers of two religious madmen, one who claims to be the 2000-year-old Apostle John. Fated to remain alive from biblical times until Christ 's return, the Apostle John has awaited fulfillment of the visions he described in the book of Revelation. But John and his cohort, apostate Hasidic rabbi Saul Cohen, are not satisfied to merely witness the Apocalypse they intend to cause it. Though Christopher can stop the destruction, he must allow it to happen, for he says that scattered throughout the Bible and other religious texts are clues pointing to an incredible hidden truth a secret of devastating universal importance that reveals the astonishing future of man and the true nature of God. It is far more than life and death that hang in the balance. It is the fulfillment of galactic destiny, humankind 's final evolutionary step: the birth of a New Age!PRAISE FOR THE CHRIST CLONE TRILOGY \"BeauSeigneur knows how to write, deploying a tough, driving style in perfect cadence.\" -Booklist (Starred Review) \"Astoundingly intelligent...inventive...dizzyingly well-described.\" -Kirkus Reviews (Starred Review) \"Undeniably riveting... daring...wonderfully creepy...Readers will be enthralled by the author's science-fortified vision of the Apocalypse.\" -Publishers Weekly PUBLICATION HISTORYBIRTH OF AN AGE is Book Two of a revised, expanded, and re-edited release of THE CHRIST CLONE TRILOGY, originally published in 1997 by SelectiveHouse and in 2003 by Warner Books. This new edition includes a Study Guide and an extensive Prophecy Cross Reference. THE CHRIST CLONE TRILOGY has been translated and published in 12 languages. Book One is IN HIS IMAGE. Book Three is ACTS OF GOD.",
  "genres": [
    "Christian Fiction",
    "Fiction",
    "Science Fiction",
    "Christian",
    "Religion",
    "Fantasy",
    "Christian Fantasy"
  ],
  "author": "James BeauSeigneur",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/15867427-birth-of-an-age"
}