{
  "title": "The Russian Nanny, Real and Imagined: History, Culture, Mythology",
  "description": "This book examines why and how nannies have appeared in Russian literature from 1700 to the late 20th century, and why they have engendered a set of myths. It is principally about women - women who care for small children - and about ideas or myths surrounding both individual nannies and nannies in the abstract. Its two major themes are thus reality and constructed reality. It examines how a figure that fell all too easily into a near caricature still retained tremendous emotional power and specificity in the lives of so many Russians, especially creative writers and artists. Secondarily, the book concerns the limits of autobiography and biography, the conscious and unconscious manipulation of memory, and the autobiographical fallacy. An important subtext that recurs frequently is that of intellectuals seeking to (super)impose their own notions, values, and ideals upon others to satisfy their personal needs and desires. One part concerns real-life nannies, the role(s) they played in and the impact they had on their charges' lives - mostly in childhood. This story of real-life caretakers is documented in all kinds of ego-documents and illustrated in a great deal of fiction. Another part explores the ways in which the idea and myths of the nanny played out in Russia, in history and culture, particularly in literature but also in other spheres of art. This section demonstrates that not-so-real stories about many of these caretakers have grown in Russian culture to the point of taking on a life of their own. The final part is a discussion of how and why the nanny figure, in Russia as elsewhere, became a cultural phenomenon and symbol. \"The author has an impressive grasp of the primary sources and he writes well. The subject is interesting and important and has been overlooked by historians and literature scholars.\" -Barbara Evans Newman, Professor of History Emeritus, The University of Akron.",
  "genres": [],
  "author": "Steven A. Grant",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/15867591-the-russian-nanny-real-and-imagined"
}