{
  "title": "The Moroni Deception",
  "description": "Michael Chenault, award-winning investigative journalist with the New York Times, is rousted in the middle of the night by NYPD detectives and accused of the bizarre murder of a complete stranger. After clearing himself, Chenault finds that Martin Koplanski, the retired history professor he’d been accused of murdering, was likely killed for a mysterious Mormon relic long thought to be just a myth. Twenty-four hours later, Chenault receives an email with a photo of the recently murdered wife of Presidential candidate, Brockston Ratchford. She too appears to have been ritually killed in the exact manner as Koplanski, right down to having the same cryptic character scrawled in blood across her forehead. With way more than just a hunch to now go on, Chenault heads out to Salt Lake City, the site of the Ratchford murder investigation, to find out what, if any, connection there is between the murders.With the help of a beautiful young reporter he meets along the way, Chenault comes to learn the dark family secrets of a rising political star, along with the rather strange but true history of the Mormon church. As he pieces the story together of what appears to be an ever-growing conspiracy, Chenault is pursued by The Brothers, two murderous zealots who will stop at nothing to retrieve the Mormon relic Chenault is also trying to find. What Chenault eventually discovers is that what he’s uncovered may not only affect the outcome of the next Presidential election, but decide the fate of an entire religion–if he can manage to stay alive.In the tradition of Raymond Khoury, Brad Meltzer, Dan Brown and Steve Berry, The Moroni Deception is a cleverly conceived, twisting tale of deceit and political and religious intrigue by a new master of the conspiracy thriller.",
  "genres": [
    "Fiction",
    "Mystery",
    "Thriller"
  ],
  "author": "Jack L. Brody",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/15869626-the-moroni-deception"
}