{
  "title": "The Kategan Alphas Vol. 1",
  "description": "The Kategan Alphas Vol. 1 by T. A. Grey BREEDING CYCLE Each year lykaen princess Sarina Brunes goes through her breeding cycle?a powerful force that makes the desire to mate nearly inescapable. When Sarina is sent away by her father to endure the breeding cycle alone, she never expects a sexy Alpha to come to her doorstep. When Alpha Vane Kategan stumbles upon Sarina in her breeding cycle, he is determined to help her, if only to ease her pain. However, she denies them both what they so desperately want. But Vane won?t give up on his seduction until they both find bliss. What neither of them count on is falling in love. Right when they need each other the most, they are torn apart by her father?s cruelty. Now Sarina must fight to be with the one she loves and risk losing the only family she has left in the process. Can Sarina escape her father?s grasp for the arms of the man she loves? DARK AWAKENING Once a vibrant woman, Alison Bennson suffered a terrible trauma at the hands of her ex. When her ex crashes back into her life with terrifying consequences, Alison must turn to the Kategans for help. Rome Kategan has been a haunting thought in her mind ever since she met the grinning rogue. If only she was the woman she used to be she could relax and enjoy the sexy male, but instead she is haunted by the past and fearful for the future. Her past has emerged though with vengeance and with one purpose in mind for Alison?death. Rome Kategan swears to protect Alison with a passionate determination that frightens Alison almost more than her past. WICKED SURRENDER The sight of her happily mated brothers has Vera biting her nails in frustration. When the opportunity arises for her to get away from it all she takes it?with one catch?Jackson Marsh. Jackson Marsh has been a pain in her ass from the moment she laid eyes on him. And now to repair his broken trust with her brother Rome, Jackson has agreed to protect Vera as she goes into enemy territory to negotiate the treaty between the Kategan Pack and the vampires. However the change of scenery doesn?t do anything to help Vera?s mood for there was one thing she didn?t think about when she came up with her brilliant plan?seeing her ex vampire lover. Now with her ex vying for her affections again and Jackson sending her body and heart through a loop, Vera must decide with her heart, which has never fully healed itself from the past. In the midst of all the chaos, a vampire clan is threatening to take Kategan land. Together Vera and Jackson must fight to save Kategan land while trying to save each other from falling in love.",
  "genres": [
    "Paranormal",
    "Paranormal Romance",
    "Romance",
    "Fantasy",
    "Shapeshifters",
    "Vampires",
    "Supernatural"
  ],
  "author": "T.A. Grey",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/15871735-the-kategan-alphas-vol-1"
}