{
  "title": "Dying in Indian Country: A Family Journey from Self-destruction to Opposing Tribal Sovereignty",
  "description": "Wilson grew up watching members of his family die of alcoholism, child abuse, suicide, and violence. Like many others, he blamed all the problems on \"white people.\" Beth Ward grew up in a middle-class home in the suburbs. Raised in a politically left family, she also believed that all problems on the reservation originated with cruel treatment by settlers and the stealing of land. Meeting Wilson, her first close experience with a tribal member, she stepped out of the comfort of suburban life into a wholenew, frightening world. After almost ten years of living with Wilson's alcoholism and the terrible dangers that came with it, they both came to realize that individual behavior and personal decisions were at the root of a man's troubles, including their own. Further, corrupt tribal government, dishonest federal Indian policy, and the controlling reservation system had more to do with the current despair in his community than what had happened 150 years ago. Here is the plain truth in the eyes of one family, in the hope that at least some of the dying -- physical, emotional, and spiritual -- may be recognized and prevented. What cannot be denied is that a large number of Native Americans are dying from alcoholism, drug abuse, suicide, and violence. Popular belief is that the white culture and its past sins are to blame. However, tribal government as it behaves today, coupled with current federal Indian policy, may have more to do with the present condition. Unfortunately, persistent public misconceptionsabout Indian Country, misconceptions sometimes promoted by tribal government and other enjoying unaudited money and power, have worked to keep the situation just as it is.",
  "genres": [
    "Nonfiction",
    "Native American",
    "History",
    "Indigenous",
    "Memoir",
    "Cultural",
    "Native American History"
  ],
  "author": "Beth  Ward",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/15873220-dying-in-indian-country"
}