{
  "title": "Peste & Choléra",
  "description": "Quand Louis Pasteur expérimente avec succès le vaccin contre la rage, il ouvre de nouvelles etformidables perspectives à la biologie et à la médecine. Il chargera plus tard ses élèves ou disciples de prolonger ses recherches à travers le monde. Les jeunes pasteuriens partent pour de longs périples.Parmi eux, Alexandre Yersin, d’origine suisse (il est né à Morges en 1863), naturalisé Français pour les besoins de la science, qui se forme sur le tas et part très vite en Indochine, où il passera le plus clair de sa vie, loin des brouhahas parisiens et des fracas guerriers. Il multiplie là-bas les observations épidémiologiques mais aussi bien géographiques, astronomiques ou météorologiques. C’est que ces jeunes gens sont curieux de tout, Yersin en particulier.Ami du politicien Doumer, Yersin se trouve à l’origine de la ville de Dalat, dans l’actuel Vietnam, puis il s’installe à Nha Trang pour y mener passionnément ses multiples activités de chercheur. Elevage bovin, culture de l’hévéa, des orchidées, de la quinine : il pourrait faire fortune mais tout va au financement des recherches et de l’Institut Pasteur créé entre-temps. La science l’absorbe, il n’aura ni femme ni enfant. Parfois il revient en Europe, mais c’est le plus souvent de loin, à la radio ou par les journaux, qu’il reçoit l’écho des conflits mondiaux et de leurs atrocités. Il meurt en 1943, conscient mais pas tout à fait amer que son nom n’aura pas la même gloire posthume que son maître, Louis Pasteur, et demeurera essentiellement attaché à la découverte du bacille de la peste à Hong-Kong en 1894.C’est cette formidable aventure scientifique et humaine que raconte Deville en croisant les périodes et les personnages autour de la figure de Yersin.",
  "genres": [
    "Science",
    "Biography",
    "France",
    "Roman",
    "Nonfiction",
    "Historical",
    "History"
  ],
  "author": "Patrick Deville",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/15874968-peste-chol-ra"
}