{
  "title": "The Brigade: An Epic Story of Vengeance, Salvation & WWII",
  "description": "An epic true story of three men & one woman who set out to fight a war & in the process help to create a nation. 11/1944. The European war is drawing to a close when the British government agrees to send a brigade of 5000 Jewish volunteers from Palestine to Europe to fight the German army. Among these soldiers are Israel Carmi, a veteran of the Haganah underground, one who serves one army but whose loyalties belong to another; Johanan Peltz, raised on a vast Polish estate, he dreams of returning home as a British officer & gentleman; & Arie Pinchuk, a former student who's returned to Europe with a secret agenda--to rescue his last remaining family member: the little sister he left behind. At the Senio River, Peitz leads the troops in a daring bayonet charge into the German line. When the hand-to-hand combat is finished, the brigade emerges triumphant. At a time when Jews are being victimized, these soldiers--yellow Stars of David emblazoned on their uniform sleeves--show that a Jewish army can fight back & win. But when the war ends they witness 1sthand the horrors their people have suffered in the concentration camps, they launch a calculating campaign of vengeance, forming secret squads to identify, locate & kill Nazi officers in hiding. Their own ferocity threatens to overwhelm them until a fortuitous encounter with an orphaned girl sets the men on a course of action--rescuing Jewish war orphans & transporting them to Palestine--that will not only change their lives but also alter the course of history. Blum has written his most harrowing book to date--a story that will make headlines as well as provoke debate about the moral elements of justice, the line between good & evil, & the possibility of redemption.",
  "genres": [
    "History",
    "Nonfiction",
    "World War II",
    "War",
    "Military Fiction",
    "Holocaust",
    "Israel"
  ],
  "author": "Howard Blum",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/1587591.The_Brigade"
}