{
  "title": "American Wop -  Beaver Buffalo Buttons Brass Boxing and Beer: That's why you're here!",
  "description": "“American Wop: Beaver Buffalo Buttons Brass Boxing and Beer: That’s why you’re here” shouts out our human history and social dilemma that contributed the rise of the American Wop (and American Flop.) The stories come from Jack’s Grandfather who taught the foundations of life through the art of boxing’s history and discipline, which couples with his Great Grandfathers story about colonialism, industrialization, marketing, and technological change. Jack’s Uncle Joe a boxing savant tells the worlds history of boxing that meshes with the fabric of our history, storytelling, comedy and politics. Joe ties the stories together illuminating the hubris of the times. The hero’s vignettes with their situations, shortfalls and downfalls are artfully woven together showing them to be vibrant stoic characters that are suffering bitterly in the wake of the changing technological landscape. Interactions of four generations simultaneously give a needed wide view lacking in today’s works.The first part of the book American Wop begins with the authors experience in his ancestral Scotland while his Grandfather lay dying in the US. A phone call signaled his Grandfathers impending end was really an announcement made years before. The surreal events leading to death drives his Grandfathers departure home.The author weaves their history together in a form that brings together the first-rate appeal of the characters, their forgotten society and our Americana. Jacks time spent brushing shoulders with World Champion Boxers with hilarity and tear-jerking results shows the famous characters never published true colors.As Uncle Joe always said - there's a story in here - for everyone! Please enjoy the story while learning something of why you're here.",
  "genres": [
    "Nonfiction",
    "History"
  ],
  "author": "Jack Tar",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/10601538-american-wop---beaver-buffalo-buttons-brass-boxing-and-beer"
}