{
  "title": "What Cops Know",
  "description": "s/t: Cops Talk About What They Do, How They Do It & What It Does to ThemChicago cops report from the front lines in Fletcher's fascinating oral dispatch. \"Cops know things you & I don't,\" writes Fletcher (Journalism/Loyola U.), a claim borne out by this well-meshed compilation of cop talk--altho not to the degree that, as she says, \"a cop who works traffic has peered deeper into the recesses of the human psyche than most shrinks.\" Hyperbole aside, the hundred of testimonies presented here--ranging in length from a sentence to several pages, & distilled from three years of interviews with 125 Chicago cops, from beat-walkers to brass--provide an intense nose-to-navel confrontation with society's underbelly. She arranges her material into six sections--\"The Street,\" \"Violent Crimes,\" \"Sex Crimes,\" \"Narcotics,\" \"Property Crimes\" & \"Organized Crime\"--each offering commentary that regrettably is credited not individually but only to the score or so cops given brief biographies at each chapter's end. The testimony itself is what you'd expect from cops--punchy, sad, blackly humored, nearly always interesting: \"There are different ways to handle the smell at a scene,\" explains one cop. \"A lot of homicide dicks stick cigarette filters up their nostrils\"; \"Only two kinds of people stare at other people: nuts & police. If you want to be safe on the streets, make eye contact\" says another; \"The only Americans who have ever accepted the metric system are the dope dealers,\" says a 3rd; \"There is no bottom. There is no low. You never know what you're going to see next,\" laments a 4th--& so on. Not quite as candid--that is, self-critical--as Mark Baker's similar 1985 oral report, Cops (NB: Fletcher's sister is a cop), but still an engrossing, hard-nosed briefing from the men in blue.--Kirkus (edited)",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Crime",
    "Law",
    "Sociology",
    "Collections",
    "Police"
  ],
  "author": "Connie Fletcher",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/1588588.What_Cops_Know"
}