{
  "title": "The Cat Who'll Live Forever: The Final Adventures of Norton, the Perfect Cat, and His Imperfect Human",
  "description": "The final, poignant chapter in a trilogy of bestselling true stories about a floppy-eared Scottish Fold named NortonPeter Gethers was a confirmed cat hater until the day he received a six-week-old kitten as a gift. Walking the streets of New York with Norton tucked into his pocket, Gethers began forming an intense attachment to his new pet. Before long Norton was flying with his owner on the Concorde to Europe, sipping milk in Parisian cafés, and eating custom-made pounce pizzas at Spago. Soon Gethers began to detail Norton’s adventures in print, and with The Cat Who Went to Paris and A Cat Abroad the duo made history as well as many, many friends around the world.The Cat Who’ll Live Forever chronicles the latest in Norton’s astonishing adventures, celebrity encounters, and worldwide excursions, culminating in his heartwarming and heartbreaking final cross-country trip. The first half of this book will have you smiling and laughing as Norton changes the lives of the Italian owners of a thirteenth-century abbey in Sicily, attends movie premiers with Sir Anthony Hopkins in the chic Hamptons, and relaxes at the dog run in Greenwich Village’s Washington Square Park. But as Norton gets older his schedule slows down and he struggles with the aches and pains and physical inconveniences that go along with age, teaching his human the essentials of loving and caring and coping with illness. Ultimately Norton passes along to his owner the most valuable lessons of all¯how to deal with death and grief, how to live life on your own terms, and how to appreciate and savor the joyful times that come along while we’re here on earth.The Cat Who’ll Live Forever is, on one level, a touching meditation on love and relationships and dealing with the pain of inevitable loss. Above all, it is a deeply moving and life-affirming tribute to a humble little animal who never let stardom go to his head and always understood the meaning of true friendship.",
  "genres": [
    "Animals",
    "Cats",
    "Nonfiction",
    "Memoir",
    "Biography",
    "Biography Memoir",
    "Travel"
  ],
  "author": "Peter Gethers",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/158898.The_Cat_Who_ll_Live_Forever"
}