{
  "title": "Beyond the Journey - Life in the Hereafters",
  "description": "Book 5 of The God Book Series Introduction-God1-Understanding the Journey2-The Self you meet along the way in the Hereafters3-Soliloquies4-The Dark Night of a Soul’s Journey5-Destiny and Experience6-The Power Binge7-Life as You know it8-Angels DO play this Harp9-The Long Ride Home10-A Party of the Infinite KindFrom the PathThe LuminescentsNow that I’ve EvolvedRead excerpts below God's Introduction-No this book could not have been written before now. Too many lives are at stake now and the others who have already passed over from mortal form were aware of why they could not partake of this information before they began their most recent journey beyond the journey. Perhaps this may not mean much to you now, but I assure you, it will. I will give you all a cautioning statement from MySelf NOW this is it, this is your last opportunity to read and learn about what really happens before you came here and after you leave. I have agreed with the decision of the Creator and the unanimous approval of all the other Luminescents that, enough is enough!1-The repetitive story of humankind is that there are millions of people who have for so many life experiences sought only titillating fantasies and have always been burdens on other people. But even they have found that something is missing although they are not capable enough to phrase it into better words. No I am not speaking about your individual Karmic implications. Although some of these do need to be addressed this day. You really do not understand Karma any better than you do the journey2-I feel the need to remind you that in the last book of the series that you may have read, The Code, I did tell you in the latter part of the book, that I had decided to \"raise the bar.\" Not to intimidate you, BUT you should know that the Creator also stated that it was time for the bar to be raised. As He said to Me, \"God, if not now, then WHEN? There is NO time left for them to continue on their journey in ignorance of these realities.\"3-While you are in the Hereafters there are many avenues for you to explore while you are seeking more conclusive ways of defining yourselves as Souls4-Children, there are many, many incidents that occur as you travel to and fro on your individual journey. If you bear in mind that the journey incorporates all aspects of the individual journey which is part of the composite of the whole journey, it may be easier for you to understand the cause and effect chain reaction which occurs here on Earth while simultaneously occurring in the Hereafters5-I do not Create destinies for most of My Children, although I have been known to help them along a bit. Please remember I said, Not for most Children6-What the mind sees hears and feels it always reacts to. How many times must I repeat this to you? How many times have I cautioned you to be careful of what you think? How many times have you responded to Me by saying, I will, but then you don't?7-One of the many benefits you receive in the Hereafters is KNOWING not only the true meaning of life but also understanding that all life and each life experience has multiple meanings8-The Angelic magnetics interact with each Soul from each Cluster therefore the magnetics are adding to the radiance each Soul has and amassing greater properties of not only Light but also infusing the Matrix of the Tapestry of Life with greater and greater macrocosmic segments of each Luminescent9-there are so many Souls here on Earth now who have made it quite clear probably because they screamed it so loudly, that they do not want to ever return to Earth again, not even as part of the new people, it has been decided that this Episode is a necessity10- I have long ago stated to You each, as you change your present life you are also changing your past. Yet again though - many were called to listen but few heeded the call",
  "genres": [],
  "author": "Celestial Blue Star",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/15890626-beyond-the-journey---life-in-the-hereafters"
}