{
  "title": "The Ice Queen",
  "description": "Recipient of the prestigious SILVER MOM'S CHOICE AWARDS® and the FIVE STARS READERS' FAVORITE® AwardA fun exciting read-aloud for kids of any age...with wolves, magic, an icy evil queen and her giant body-guard spider, sacrifice, and friendship, plus a great message for kids---and the hero triumphs by reading!“The story is filled with chills, thrills, adventure, mystery, and excitement and will keep children glued to the pages. What I like about the book is the messages of friendship, unity, and cooperation it conveys to young readers, encouraging them to develop their good points while growing up. The illustrations are fascinating and they capture the starkness and chill of the Ice Queen beautifully. The pictures also bring the story alive to readers. It is a good book for interactive sessions in classrooms and school libraries because of the messages, and the story is exciting for bedtime story-telling. The Ice Queen, wolves, spider webs, Infurious, the man-eating spider, and the illustrations make it a wonderful book for children.” -- Readers’ Favorite® Five Stars \"Wonderful book! I just finished reading THE ICE QUEEN and loved every gripping, touching, frightening, loving, powerful moment experienced from reading the written words and enjoying the fantastic drawings.\"-Pamela Jung-Amazon Customer\"Heroes triumph by reading--what a great message for children! Additionally, John and Yukon uniquely demonstrate the value of sacrifice, friendship, and cooperation.\" -- CS EditorTHE The forest near quaint little Pickit Town is stirring with an evil power! The Ice Queen has taken over the forest and is attempting to take over the world. One cold look or touch by this terrible Queen would instantly turn one into solid ice, and as the forest turns frozen and dark, all hope seems to be lost. Until Yukon, a wise gray wolf and his friend John Willing try to put a stop to this dreadful Queen with courage and an old book to help them. On their bone-chilling adventure, Yukon and John learn the importance of standing up against evil, and that an answer can always be found by flipping through the yellowed pages of a book.",
  "genres": [],
  "author": "Liana-Melissa Allen",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/15891510-the-ice-queen"
}