{
  "title": "The Euro is Dead; Long Live the Solid!: A Proposal for a New Monetary System for the Eurozone",
  "description": "This booklet addresses the question, “How can we provide a feasible, long term solution for the current serious problem troubling all Eurozone member countries? The author contends that this will be hardly achieved by traditional mainstream economics recipes, not only because these have in the past proved to be mere “patches” providing short term solutions, but because in this particular case, there is another new element nonexistent within previous fiat money environments. We refer to the element of sovereignty. The author contends that this is the fatal flaw of the Euro monetary system, which was conceived by politicians in search of a legacy, and by mainstream economists advising them, who did not realize the flaw or decided to sweep it under the rug. Amazingly, politicians in economically stronger countries are proposing to solve the problem by taking away yet more sovereignty from country members, in order to impose economic measures to governments in those countries suffering from acute recessionary forces. Aware of the limits and deficiencies wrought by government controlled money as well as the particular political challenges presented by having one sole currency spanning many independent countries in Europe, the author puts forth a proposal involving the issuance of a new supranational currency backed by a 100 percent gold reserve, circulating side-by-side with the local re-issued currencies (DM, Franc, Drachma, etc.) at variable rates of exchange. The author explains how the DLCCS-Dual Level Currency Competition System he proposes addresses the need some countries have to act asymmetrically vis-a-vis other Eurozone members, from an economic point of view. He explains further how this will allow any Eurozone country member to set its own economic policy independently from Brussels, without wrecking havoc in the Eurozone.",
  "genres": [],
  "author": "Eduardo J. Belgrano",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/15891867-the-euro-is-dead-long-live-the-solid"
}