{
  "title": "Silver's Threads, Book 1 Spinning Colours Darkly",
  "description": "The first in a series books that weave the lives of predominantly four women, charged with the task to unravel and re-weave the ‘Skeins of Tyme.’An urban fantasy set in Australia that takes the reader to other countries and into other realms.What if someone fell off the edge of their own personal tapestry of life …disappearing into uncharted places …hiding from sadness perhaps …and what if mirroring that sorrow, a small being of light became corrupted by the pollution on earth; falling through the time space continuum lost and confused. If other realms are affected how would our world respond …would we fall into chaos or would we finally look for solutions?A tale of the Wytchways …the Craft of the Wise …how ancient Rites can be the tool to reweave this world in order to harmonise with other realms and find oneness with all life.The journey unfolds with......the discovery of a strange and ancient skeleton, hidden in the mud for centuries ...found in a landscape of secrets on the Plains of Holderness in Yorkshire....a grove of Wytches gather on a sacred mount to celebrate the Mabon Rite but something is very amiss ...strange forces are at work that go beyond mortal understanding....with four young women and the fifth; their teacher, a seer a Wytch and a Wise Woman who has trained the four in the Wytchways. She has vanished inexplicably and with all their combined skills they need help from the other realms to discover where she is. All they have are a set of cryptic instructions to be deciphered....one of the four must change her understanding about how the world works ...one must learn the tools of her trade anew ...one must learn to trust that Magick is real and one must find the answers to their teachers disappearance by travelling to other realms where the Old Ones walk....the Birthing Tree is the place of soul renewal ...all must return here but with the fall of an ancient immortal the web of life has been torn; the Tree is wounded casting a blight that echoes throughout all the realms.…within the twists and turns on the warp and weft of time the young women meet other aspects of themselves, where clues are hidden and where they find within those clues the secrets of other worldly lives, connections to each other and ancient ancestry. These findings will weave and re-weave their stories together and apart throughout the Skeins of Tyme to manifest a new way of living …for one of the things humans fear the most is that…Magick might indeed be real and it might be hidden within each of us.",
  "genres": [],
  "author": "Penny Reilly",
  "average_rating": "4.75",
  "url": "https://www.goodreads.com/book/show/15892249-silver-s-threads-book-1-spinning-colours-darkly"
}