{
  "title": "Learning to Cook with Marion Cunningham",
  "description": "Here at last is a much needed cookbook designed to instruct and inspire beginning cooks who don't know how to cut up an onion or scramble an egg--and who are reluctant to try.Marion Cunningham, today's Fannie Farmer--who embodies the best of American home cooking--is the perfect guide for the uncertain cook. Not only are her recipes simple, they are easy to master, because she writes in clear, straightforward language that anyone can understand. She addresses the needs and concerns of beginning cooks: how to shop, how to determine the quality of ingredients, how to store fresh produce and to ripen fruits, what basic kitchen utensils to use, and how not to waste food.With 150 recipes woven through eleven seductive chapters, such as Soup for Supper, A Bowlful of Salad, Thank Goodness for Chicken, and Extras That Make a Meal, Ms. Cunningham reveals the secrets of relaxed and efficient home cooking. She stresses the importance of thinking ahead--not just one recipe at a time. Today's dinner can be recycled into a lunch treat for tomorrow, Sunday's leftover polenta is fried up and topped with Parmesan for a weekday supper dish, small treasures in the fridge can make an omelet filling, a pasta garnish, or stuffing for a baked potato, and homemade biscuits can be transformed into strawberry shortcake.The side dishes she recommends are simple and are coordinated with the timing of the main dish. Often she gives us a recipe in which everything is cooked together--for instance, a chicken is roasted along with onions, carrots, and potatoes, so everything is ready at once, and when you're finished there's only one pan to clean; easy fish is baked over a bed of vegetables; a steak supper combines watercress, mushrooms, bread, and a delicious steak all in one.Above all, Ms. Cunningham demonstrates that the satisfaction of cooking lies not only in the good taste of all these wonderful home-cooked dishes but also in the pleasure of sharing them with friends and family.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction"
  ],
  "author": "Marion Cunningham",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/158932.Learning_to_Cook_with_Marion_Cunningham"
}