{
  "title": "Heroines",
  "description": "\"I am beginning to realize that taking the self out of our essays is a form of repression. Taking the self out feels like obeying a gag order - pretending an objectivity where there is nothing objective about the experience of confronting and engaging with and swooning over literature.\" - from HeroinesOn the last day of December, 2009 Kate Zambreno began a blog called Frances Farmer Is My Sister, arising from her obsession with the female modernists and her recent transplantation to Akron, Ohio, where her husband held a university job. Widely reposted, Zambreno's blog became an outlet for her highly informed and passionate rants about the fates of the modernist \"wives and mistresses.\" In her blog entries, Zambreno reclaimed the traditionally pathologized biographies of Vivienne Eliot, Jane Bowles, Jean Rhys, and Zelda Fitzgerald: writers and artists themselves who served as male writers' muses only to end their lives silenced, erased, and institutionalized. Over the course of two years, Frances Farmer Is My Sister helped create a community where today's \"toxic girls\" could devise a new feminist discourse, writing in the margins and developing an alternative canon.In Heroines, Zambreno extends the polemic begun on her blog into a dazzling, original work of literary scholarship. Combing theories that have dictated what literature should be and who is allowed to write it - from T. S. Eliot's New Criticism to the writings of such mid-century intellectuals as Elizabeth Hardwick and Mary McCarthy to the occasional \"girl-on-girl crime\" of the Second Wave of feminism - she traces the genesis of a cultural template that consistently exiles female experience to the realm of the \"minor\" and diagnoses women for transgressing social bounds. \"ANXIETY: When she experiences it, it's pathological,\" writes Zambreno. \"When he does, it's existential.\" By advancing the Girl-As-Philosopher, Zambreno reinvents feminism for her generation while providing a model for a newly subjectivized criticism.",
  "genres": [
    "Nonfiction",
    "Feminism",
    "Essays",
    "Memoir",
    "History",
    "Biography",
    "Womens"
  ],
  "author": "Kate Zambreno",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/15893653-heroines"
}