{
  "title": "This Is Not a Writing Manual: Notes for the Young Writer in the Real World",
  "description": "Real-world writing advice, minus all the lectures. You're an aspiring writer. Maybe you've just discovered your love of words and dream of being a novelist someday. Maybe you've been filling notebooks with science-fiction stories since middle school. Maybe you're contemplating a liberal arts degree, but you don't know what the heck you're going to do with it. The last thing you need is another preachy writing manual telling you how you should write. This book isn't a writing manual. It is a series of candid and irreverent essays on the writing life, from a writer who's lived it. Kerri Majors shares stories from her own life that offer insights on the realities all writers developing a writing voice, finding a real job (and yes, you do need to find one), taking criticism, getting published, and dealing with rejection. Don't have enough time to write? Learn how to plan your days to fit it all in. Not sure how your guilty pleasures and bad habits translate into literature? Kerri explains how soap operas and eavesdropping can actually help your writing. Need a reader for your first novel? Find a writing buddy or a writing group that will support you. Nervous about submitting your first piece? Learn from Kerri's own roller coaster journey to find an agent and get published. This Is Not a Writing Manual is the writing memoir for young writers who want to use their talents in the real world. ATTENTION TEACHERS! The Teacher's Edition for This Is Not a Writing Manual is now available! This FREE supplemental PDF includes a series of lesson plans and writing class essentials that will improve the writing of students in middle and high school--and beyond. To access, e-mail us at writersdigest@fwmedia.com to receive your free download, or visit Kerri Majors's website.",
  "genres": [
    "Writing",
    "Nonfiction",
    "Research"
  ],
  "author": "Kerri  Majors",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/15894357-this-is-not-a-writing-manual"
}