{
  "title": "Doms of Dark Haven 2: Western Nights",
  "description": "A Good sub Would... by Sierra CartwrightGenre: BDSM Erotic ContemporaryShelby, a wanna-be sub, hasn’t found a Dom strong enough to push past her need to be in control. Her experiences as a sub have been yawn-inducing. She’s fantasized plenty, though, about Trevor Lawton, one of Dark Haven’s legendary, mouthwateringly firm Doms.As the stakes get higher at the charity poker match, Dom Trevor Lawton is fascinated by the woman kneeling across the table from him. Problem is, she’s not a good sub. Oh, she tries, and she’s lovely. But she’s not very good at following orders. The woman needs a firm, unyielding hand...his.Hunting Holly by Belinda McBrideGenre: BDSM Shape-shifter Paranormal MenageRelated Titles: Educating Evangeline, part of the Doms of Dark Haven anthologyWhen Holly left the Truckee pack, she left her family, her safety, and the two men she loved. Now she's in San Francisco training as a Domme at Dark Haven. She thinks she's found herself, but tonight, Tex and Hunter have found her. And they are not happy with their little wolf. She's been keeping secrets from them. Tonight, someone's gonna beg.Additional Publisher's Warning: This book contains explicit sexual content, graphic language, and situations that some readers may find objectionable: anal play/intercourse, caning, sensory deprivation.Welcome to the Dark Side by Cherise SinclairGenre: BDSM Erotic ContemporaryRelated Titles: Master of the Mountain; Master of the Abyss; Simon Says: Mine, part of the Doms of Dark Haven anthologyReal Doms terrify her, so Summer plays with lightweights only. And only in the safety of her club, Dark Haven. But on Western Night, the tough cop who wins her in a sub-roping game is as powerful as they come.Virgil's first taste of BDSM was disturbingly enticing. Hoping to burn out his interest, he visits an infamous San Francisco club, where he wins himself the prettiest little sub he’s ever seen. He’s in a quandary. A man shouldn’t render a woman helpless, let alone spank her ass. But the nervous little submissive clearly loves being in his ropes. Her need to be controlled is as powerful as his need to control. So he indulges himself, and her.That one night could be the beginning, but instead it's the end. She won't play outside the club and he lives too far to come play. He'll just have to find a way to forget her...or get her in his ropes to stay.Publisher's Note: All of the stories within this anthology contain explicit sexual content, graphic language, and situations that some readers may find objectionable: strong BDSM theme and elements (including/not limited to: bondage and spanking).Cover Art by April Martinez(less)",
  "genres": [
    "BDSM",
    "Erotica",
    "Romance",
    "Anthologies",
    "Contemporary",
    "Erotic Romance",
    "Adult"
  ],
  "author": "Sierra Cartwright",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/15896049-doms-of-dark-haven-2"
}