{
  "title": "Venice Vampyr: The First 2 Novellas",
  "description": "The first 2 Novellas in the Venice Vampyr series, a historical, erotic romance about a group of vampires in 1800s Venice, Italy.Novella #1 (Venice Vampyr)Isabella Tenderini, a wealthy merchant's widow rescues a stranger from drowning in one of Venice's canals. And how does the man repay her selfless act? By kissing her - her, a respectable woman.Not only is Raphael di Santori grateful for his life being saved, he would also like to thank his rescuer very intimately - more intimately than decorum allows. But then, Raphael has never been one to play by the rules - as a vampire he doesn't have to.Novella #2 (Venice Vampyr: Final Affair)Viola Costa has been given three months to live but she refuses to die a virgin. She travels to Venice where she wants to experience physical pleasure with a man without causing a scandal for her family. Afterward, she plans to take her own life to ensure she exits the world painlessly and with dignity. Unfortunately, the man she meets in a disreputable club couldn’t be a worse choice for her plans.Dante di Santori, a hedonistic vampire, saves Viola from a violent rake. To stop her from seeking out even more dangerous men to find carnal pleasures, he offers her a night of passion in his arms, only to discover she’s a virgin.Viola flees, disdainful of the sex act and determined to end her life. Horrified, Dante stops Viola from harming herself and proceeds to deliver the pleasure he promised – one kiss and one touch at a time until she’s ready to take all of him, over and over again.Then events force Dante’s hand ...Total Length: approx. 59,000 words / 231 pages on the NookWarning: These vampire novellas are sexually more explicit than my other books. So, if you're a little squeamish about things like voyeurism, bondage, and other sexual taboos, it's safe to assume you won't like this one.These novellas are also available separately.EXCERPT of Novella #2:“That was a terrible thing you did.”He gave her a bemused look. “You should be grateful to me, not badgering me.”“Grateful? You got me thrown out of the club.”“As I said, you should be grateful for that. You don’t belong there. You’re an innocent.”Anger churned up in Viola. “I’m not an innocent,” she lied. “I’m a widow, and I’m here to find some … pleasures.” It was the same lie she’d given Salvatore, even though he hadn’t questioned her motives.The man arched an eyebrow and raised one side of his mouth, mocking her.“Now you’ve destroyed my chances of being with a man tonight.”The man took a step closer, his body almost touching hers. His voice was low when he replied, “And you listen to me now, woman. The man you wanted to be with tonight beats the women he beds. It’s part of what get’s him off. He’s violent, and he enjoys seeing women suffer. Was that what you were looking for?”Instinctively, Viola took a step back.Was the stranger telling the truth? Had he truly saved her from being beaten? She shook off the thought. No, the two men probably had had some prior quarrel. “No matter. Now I have to go somewhere else to find what I need.”“Are you crazy? Didn’t you hear what I just said?”“I heard you loud and clear. Now, would you please direct me to where I might find another place like this? You owe me that much.” She thrust her chin up and waited.The stranger shook his head. “I will do no such thing. Go home and be glad you didn’t get hurt tonight.”She narrowed her eyes. “Fine ... Maybe somebody else can advise me.” Viola turned on her heels but before she could even take one step, a hand clasped over her forearm and pulled her back. She snapped her head back to him, surprised by his boldness, and clenched her jaw.“Signore, I suggest you remove your hand now.”He did not yield to her threat. “You have no idea of the dangers out there. A woman like you shouldn’t be prowling the night alone.”“It’s none of your business. So, unless you want to bed me yourself, let go of me.”",
  "genres": [
    "Vampires",
    "Romance",
    "Erotica",
    "Historical Romance",
    "Fantasy",
    "Paranormal"
  ],
  "author": "Tina Folsom",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/10603079-venice-vampyr"
}