{
  "title": "Dear Father, Dear Son: Two Lives... Eight Hours",
  "description": "\"Stunning ... a wonderful read ... a page-turner ... a handbook for life.\" Those words of advance praise from another celebrated author scarcely convey just how powerfully mesmerizing is the latest book by New York Times best-selling author and nationally syndicated radio talk show host Larry Elder.Dear Father, Dear Son is a personal memoir of Elder's troubled ― one might even say tortured ― relationship with his father, and the astonishing outcome that develops when Elder, at long last, confronts him.Says \"A man's relationship with his father ― every boy, every man lucky enough to have a father in his life has to figure that out. My own father? I thought I knew him ― even though he seldom talked about himself. And what I knew I hated ― really, really hated. Cold, ill-tempered, thin-skinned, my father always seemed on the brink of erupting. Scared to death of him, I kept telling myself to find the courage to 'stand up to him.' When I was fifteen, I did.\" After that, said Elder, \"We did not speak to each other for ten years.\"\"And then we did ― for eight hours.\" The result can't be described. It has to be experienced.As reflected in the book's subtitle ― \"Two Lives ... Eight Hours\" ― one extraordinary, all- day conversation between Elder and his long- estranged father utterly transformed their relationship. It is no exaggeration to say the book will likewise transform readers. Indeed, calling it \"stunning,\" Burt Boyar, co-author of the bestselling autobiography on Sammy Davis, Jr., says of Dear Father, Dear Son : \"Above all it is a wonderful read. I am tempted to call it a page-turner but in my case I hated to turn every page because that meant I was getting closer to the end and I did not want it to end. ... The book is filled with emotion. It is, of course, a handbook for life. I guess it is that above all things. Any kid who reads it and follows the advice of how to live his life just has to come out well.\"Dear Father, Dear Son is the story of one man discovering a son he never really knew. And of the son finding a man, a friend, a father who had really been there all along.",
  "genres": [
    "Biography",
    "Memoir",
    "Nonfiction",
    "Parenting",
    "History",
    "Autobiography",
    "Biography Memoir"
  ],
  "author": "Larry Elder",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/15904654-dear-father-dear-son"
}