{
  "title": "Linnet and the Prince",
  "description": "SynopsisSixteen-year-old Linnet has been given a grave task. If she succeeds, it could end her life. If she fails, it could destroy her people.She must kill a prince.But first, she must marry him.Prince Rajak of the Badi, son of the tyrannical desert king, has given Linnet’s Highland kingdom of Hilrigard an give him a princess for his bride, or be slaughtered. Linnet’s older sister is his first choice, but when she begs not to be sent, Linnet volunteers, to save her people.Her mother, however, sees an opportunity. She secretly instructs Linnet to gain Rajak’s trust and then assassinate him, before he discovers the legendary chamber that will resurrect the Badi’s greatest king.Linnet is united with Rajak and goes to his court determined to obey her mother’s command, though repulsed by the strange customs and bizarre foods. But the more she learns of the prince, the more she realizes that his brooding exterior conceals a good heart. And the more she learns of the chamber, the more she suspects that the legend is not what it seems.But time runs short when Linnet’s mother sets the coup in motion, and Linnet is faced with a heart-rending choice—for the one sent to kill the prince is now the only one who can save him.Excerpt“Linnet! Come down!”“But I can see it from here!”“You will tear your clothes. Mother’s told you not to climb trees anymore. You’re too old.”I ignored my older sister far below me and adjusted my hold on the beech tree, amongst whose pale branches I stood. It was early spring, so the leaves did not obstruct my view of the vast rolling emerald hills in the east. I smiled as I gazed over them, and saw the gray ruins of Tilmidel skirted in mist. It was cloudy, so the morning sun did not get in my eyes. I had never seen Tilmidel so clearly before.“How far away is it, do you think?” I called, not taking my eyes from the distant castle. My sister, Aeleth, sighed.“Too far for you to try to make it there before it is time to get ready for tonight, so don’t even think about it.”“I wasn’t,” I lied, smiling at the castle.“You are ridiculous.” I could just see Aeleth shaking her blonde head as she picked berries from the thicket below. “Most girls of fifteen are more interested in chasing boys than exploring haunted ruins.”“Sixteen,” I reminded her. “I’m offended, I think.” I glanced down at her, arching an eyebrow. “You arranged my birthday party.”She lifted her head and her azure eyes sparked at me, set out by her plain blue dress. I had always thought that my sister was uncommonly pretty, what with her perfect, pale skin, slender form, plaited golden hair and graceful hands, and she could be pleasant to be around if she was not in one of her mothering moods.I, on the other hand, had chestnut hair—which was not considered as beautiful as gold by anyone I knew—and though I was slender too, and had blue eyes, I was shorter than she was. Besides which, I had calloused hands from handling bow and blade, and I was one of the few girls allowed to wear a long tunic and trousers instead of a dress. And I was not always known for being pleasant.“Anyway, you’re a princess,” Aeleth said. “Which means that you should not be climbing trees.",
  "genres": [
    "Romance",
    "Fantasy",
    "Young Adult",
    "Fiction",
    "Love Story"
  ],
  "author": "Alydia Rackham",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/10603958-linnet-and-the-prince"
}