{
  "title": "Our Former Lives in Art: Stories",
  "description": "Set against the backdrop of the Deep South, these nine haunting stories explore big themes–authenticity, the relinquishing of childhood, the acceptance of dreams lost–in a way that ultimately affirms the act of living and the value of human relationships. In “Giving Up the Ghost,” a man sits beside a fatal car wreck to share the last moments of a stranger’s life. In “Witnessing,” a young woman befriends her lover’s ailing wife. In “Rapture,” a housewife’s unexpected romantic encounter during a tornado rocks her tidy suburban existence.How do we become who we are? And what makes us love one another? With empathy, wit, and beautiful language, Davis blends the real and the imagined to create a kaleidoscope of the human heart.Praise for Our Former Lives in Art“Davis creates magnificently conflicted characters with low key stylistic panache.”– Publishers Weekly“Davis shares with other southern female short-story writers, such as Flannery O’Connor and Eudora Welty, a sense of relish of the absurdity running through the human condition.”– Booklist (starred review)\"A work of deep emotional resonance and acute psychological power\"– Holiday Reinhorn, author of Big Cats“Jennifer Davis’s stories have a wry sensibility in them, and compassion, a sweet perversity, and a sense of wonder about just being alive. Her tales mark the craziness and sadness of adolescence as it collides inevitably with failed wishes, loss, and sexual desire.”– Lynne Tillman, author of American Genius, A Comedy\"Unusually insightful and gorgeously written, these powerful stories reveal how sometimes the most unexpected discoveries in the present can illuminate the past and change a person forever.  Jennifer Davis is not only an author to watch, she's one to read–now.\"– Cristina Henriquez, author of Come Together, Fall Apart",
  "genres": [
    "Fiction",
    "Short Stories"
  ],
  "author": "Jennifer S. Davis",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/1590950.Our_Former_Lives_in_Art"
}