{
  "title": "Contraception and Abortion in 19-Century America",
  "description": "In pocket-sized, coded diaries, an upper middle-class American woman named Mary Poor recorded with small x's the occasions of sexual intercourse with her husband Henry over a twenty-eight-year period. Janet Farrell Brodie introduces this engaging pair early in a book that is certain to be the definitive study of family limitation in nineteenth-century America. She makes adroit use of Mary's diaries and letters to lift a curtain on the intimate life of a Victorian couple attempting to control the size of their family.Were the Poors typical? Who used reproductive control in the years between 1830 and 1880? What methods did they use and how did they learn about them? By examining a wide array of sources, Brodie has determined how Americans gradually were able to get birth control information and products that allowed them to choose among newer, safer, and more effective contraceptive and abortive methods.Brodie's findings in druggists' catalogues, patent records, advertisements, vice society'' documents, business manuscripts, and gynecological advice literature explain how information spread and often taboo matters were made commercial. She retraces the links among obscure individuals, from itinerant lecturers, to book publishers, to contraceptive goods manufacturers and explains the important contributions of two nascent networks-medical practitioners known as Thomsonians and watercurists, and iconoclastic freethinkers.Brodie takes her narrative to the backlash at the end of the century, when American ambivalence toward abortion and contraception led to federal and state legislative restrictions, the rise of special purity legions, the influence of powerful reformers such as Anthony Comstock, and the vehement opposition of medical professionals. In this balanced and timely book Brodie shows a keen sensitivity to the complex factors behind today's politically, emotionally, and intellectually charged battles over reproductive rights.",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Womens",
    "Historical",
    "Microhistory",
    "Feminism"
  ],
  "author": "Janet Farrell Brodie",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/1591729.Contraception_and_Abortion_in_19_Century_America"
}