{
  "title": "Mobilizing Women for War: German and American Propaganda, 1939-1945",
  "description": "To discover how war can affect the status of women in industrial countries, Leila Rupp examines mobilization propaganda directed at women in Nazi Germany and the United States. Her book explores the relationship between ideology and policy, challenging the idea that wars improve the status of women by bringing them into new areas of activity.Using fresh sources for both Germany and the United States, Professor Rupp considers the images of women before and during the war, the role of propaganda in securing their support, and the ideal of feminine behavior in each country. Her analysis shows that propaganda was more intensive in the United States than in Germany, and that it figured in the success of American mobilization and the failure of the German campaign to enlist women's participation. The most important function of propaganda, however, consisted in adapting popular conceptions to economic need. The author finds that public images of women can adjust to wartime priorities without threatening traditional assumptions about social roles. The mode of adaptation, she suggests, helps to explain the lack of change in women's status in postwar society. Far-reaching in its implications for feminist studies, this book offers a new and fruitful approach to the social, economic, and political history of Germany and the United States.Originally published in 1978.The Princeton Legacy Library uses the latest print-on-demand technology to again make available previously out-of-print books from the distinguished backlist of Princeton University Press. These editions preserve the original texts of these important books while presenting them in durable paperback and hardcover editions. The goal of the Princeton Legacy Library is to vastly increase access to the rich scholarly heritage found in the thousands of books published by Princeton University Press since its founding in 1905.",
  "genres": [
    "History",
    "World War II",
    "American History"
  ],
  "author": "Leila J. Rupp",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/1591846.Mobilizing_Women_for_War"
}