{
  "title": "Taj Mahal Foxtrot: The Story of Bombay's Jazz Age",
  "description": "First ever history of Jazz in India - matched with rare archival images never-before published Packaged with a free CD of original jazz recordings of the time 'Fernandes is among the best narrative historians in India today, and his new book is a triumph of storytelling. Taj Mahal Foxtrot's got the beat.' Suketu Mehta 'The pictures match the words, producing this jewel of a book, which I read with pleasure, profit, and, above all, admiration.' Ramachandra Guha 'For several months now I've been looking forward to the publication of Taj Mahal Foxtrot by Naresh Fernandes. The extracts were fascinating - intensively researched and extremely well written.' Amitav Ghosh In 1935, a violinist from Minnesota named Leon Abbey brought the first 'all negro' jazz band to Bombay, leaving behind a legacy that would last three decades. In a decade, swing would find its way to the streets of India as it influenced Hindi film music - the very soundtrack of Indian life. The optimism of jazz became an important element in the tunes that echoed the hopes of newly independent India. This book tells a story of India - and especially of the city of Bombay - through the lives of a menagerie of geniuses, strivers, and eccentrics, both Indian and American, who helped jazz find a home in the sweaty subcontinent. They include the African- American pianist Teddy Weatherford; Goan trumpet player Frank Fernand, whose epiphanic encounter with Mahatma Gandhi drove him to try to give jazz an Indian voice; Chic Chocolate, who was known as the Louis Armstrong of India; and Anthony Gonsalves, who lent his name to one of the most popular Bollywood tunes ever; and many more. Taj Mahal Foxtrot, at its heart, is a history of Bombay in swing time.",
  "genres": [
    "Nonfiction",
    "History",
    "Music",
    "India",
    "Indian Literature"
  ],
  "author": "Naresh Fernandes",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/15919806-taj-mahal-foxtrot"
}