{
  "title": "Forbidden Quest",
  "description": "Wouldn't it be cool to suddenly have the battle skills of a seasoned warrior? Wouldn't that be even better if the battles felt real but there was no physical risk to you? Wouldn't it be perfect if the hypnotist in charge of your session was not insanely evil and using you as a weapon in a plot for revenge? Four friends, two in love, two in hate enter into a Group Hypnosis study attempting to introduce fantasy adventures to small groups. They are promised a video game type of adventure rescuing an Elf Queen from her crystal prision as elf warriors, a sorceress and a fairy. As soon as they fall under the good doctors spell they begin to realize the adventure is more real than they could have ever imagined. They find themselves in a hostile world they can't seem to escape from. When Nicole Waters’ boyfriend Tom becomes ill the prominent St Louis Assistant DA is forced to take Tom’s best friend Jack Tyler, a local travel agent on a business vacation. Certain she’s discovered the next hot trend in adventure vacations Nicole takes Jack and two others; Sarah Sims, a shy nurse practioner and Todd Hopper, a professional hockey player into a test program for group hypnosis. They travel to a small town in the middle of Kansas to meet Dr. Strong, the psychologist researching group hypnosis at his clinic . Undaunted by the fact that the so called clinic is housed in an ancient looking run down hotel and Dr. Strong’s creepy assistants the group is eager to get started with their ‘adventure’. Dr. Strong introduces the soon to be adventurers to an equipment filled gym explaining, “The wall of netting might become a series of vines or perhaps the side of a rock cliff. The weight machine will serve as stimulus if you are required to lift or push a heavy object. The stair climber will act as a tree, fortress wall or perhaps a rock incline you must scale.” He then offers Nicole and her friends a mild sedative to aid in their simultaneous entry into hypnosis. Yet instead of experiencing an action packed fantasy adventure akin to a video game quest; they find themselves trapped in a deadly world of elves and monsters that is more real than they could ever imagine. Where a cry for help is left unheard.",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Elves"
  ],
  "author": "Alaina Stanford",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/15923045-forbidden-quest"
}