{
  "title": "Here Comes Trouble",
  "description": "This book is Moore's most personal to date—and will be irresistible to fans and foes alike. A sort of anti-memoir, Moore breaks the autobiographical mode while he hilariously presents 20 far-ranging, irreverent vignettes from his own life. Moore is his own meta-Forrest Gump, as one moment he's an 11-year old boy stuck on an Senate elevator with Bobby Kennedy, and the next moment he's inside the Bitburg cemetery with a dazed and confused Ronald Reagan. Changing planes in Vienna, he escapes death at the hands of the terrorist Abu Nidal (others weren't so lucky). In search one day for a bag of Ruffles potato chips, he ends up eliminating racial discrimination at private clubs all across America. He founded his first underground newspaper in fourth grade. He refused to be on the CBS Evening News with Walter Cronkite at 16 (\"There's not enough Clearasil in the world for that to happen\"). And he became the youngest elected official in the country at age 18 by enlisting an \"army of local stoners\" who had no idea what they were doing as his campaign staff. And none of that even comes close to the night the friendly priest at the seminary decided to show him how to perform his own exorcism. All of this is the stuff that makes for great fiction -- but every one of these stories is true and from the life of one Michael Moore, a son of Flint, Michigan, who became an iconic voice for American progressives everywhere. But before that Michael Moore became the Oscar-winning filmmaker and all-round rabble rouser and thorn-in-the-side of corporate and right-wing America, there was the guy who had an uncanny knack of just showing up where history was being made. Like the night he was passing through Berlin and some crazies started chiseling on a very large wall. The next thing he knew he was on top of that wall, taunting soldiers who apparently thought he wasn't worth wasting a bullet on. This book is a wild, revealing, take-no-prisoners ride through the early life of Michael Moore. Alternately funny, eye-opening, and moving, this is a book Michael Moore has been writing -- and living -- for a very long time.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Memoir",
    "Politics",
    "Autobiography",
    "Audiobook",
    "Biography Memoir"
  ],
  "author": "Michael Moore",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/15924950-here-comes-trouble"
}