{
  "title": "One Sexual Season - in the middle of my quite ordinary life",
  "description": "Another in the Series of Germaine Gibson's Erotic Adventures -Women's JournalsUpdated 2013Adult ContentI never thought about it like that – have you? – maybe you have – thought about sex like that? Sex as an activity to learn and explore and become proficient with, engaged in the pursuit of learning with? Have you? Never occurred to me. Sex as a sport - to get good at. And sex as a power that can seek you out.It occurs to me now – but not then. Not that I was a virgin or disinterested – and I would say not that I was without, in my opinion, significant experience. I thought. There was a time in my life when I was very interested – if not for the sex (or let’s say NOT JUST for the sexual experience) but also for all it brought. Men, companionship,-good times. Some great hotels, some great parking lotsSo it was surprise when there was a moment - well more than a moment, a whole series of moments, that offered, well different opportunities, different possibilities of – achievement. A season.I wasn’t really expecting to find the asparagus this early in the season – but then I wasn’t expecting to find a porn studio set up at the farm either. And more importantly I wasn’t even in my wildest dreams (imagination) a person that would watch, be captivated by a porn show. Not that I haven’t watched them, in company, private company, for the added boost, but then I was drunk or trying to impress the guy, or just wanted a convincingly sexual evening of it. But that was a while back, and the action of the screen, had never done much to me – but it usually helped the man I was with, and the more I seemed into it, the better the overall result, I found.But as I say, that was then, a while ago, my club years, the laser lights and the shooters like crouching tiger or buttery nipple ( was it really buttery nipple?) and the short short dresses and come-fuck-me pumps. That was then, not now. Not these days...But here I was, unmoving, stuck somehow - watching the intertwining, the progress of these two young women, girls, bodies too shinny and sleek, perfect – their hair nicely cut, even their cute nails glowing, and the wonderful bright camera ready lipstick (actually was that lipstick on their nipples?)...My gaze slid over their slim tanned smooth flesh, down from the nipples, now I see suspiciously ruby red, the areola lightly shaded against their young bright breasts, one dark one so light I could barely make it out, down their curved smooth stomachs, the cute shadow of the navel in this land of no shadows and no wrinkles, down where each hands roamed on the other, down passed the flat land between the hips, as they lay back now, down to the playground of their sex they were gently, and I mean gently –exploring- as they kissed each other on the lips, and neck and then lips again, mouths open, groaning for the camera I am sure (though I could hear nothing)and kissing...Her buttocks and the shaded puckered hole of the her anus, and the lips of her sex, out in the open between her legs, clean and simple and perfect –God I can feel heat rising in me. Yes I am embarrassed to say ( Embarrassing to me, as there is no-one else out here) –embarrassed to find myself so- titillated, I couldn’t believe – and the heat was settling between my own legs and now I notice my rising nipples. My God.",
  "genres": [
    "Erotica"
  ],
  "author": "Germaine Gibson",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/15926043-one-sexual-season---in-the-middle-of-my-quite-ordinary-life"
}