{
  "title": "An Obedient Father",
  "description": "Sins of the FatherAkhil Sharma's An Obedient Father is a first novel of surprising depth and complexity; rich and disturbing, its twists and revelations continually challenge the reader's preconceptions. Ram Karan, the protagonist and primary narrator, is an inspector for the corrupt Delhi school system. For all intents and purposes, he is a bribe-collector, although not a particularly good one. \"My panic in negotiations was so apparent,\" he explains, \"that even people who were eager to bribe me became resentful.\" Anxious and overweight, recently widowed, he is driven by fear rather than political convictions. The Congress Party sustains him, but when Rajiv Gandhi is assassinated, Karan finds himself caught precariously between the party and the rising Bharatiya Janata Party. If he switches parties, and the BJP loses the election, he will be attacked by Congress and tried on corruption charges. If he doesn't switch parties, he will lose his job.This decision is complicated by the drama of his home life. Karan shares his apartment with his daughter Anita, whose husband has just died, and their relationship is far from civil. \"My mind was adept at reducing its presence,\" he admits, \"when my body did something shameful.\" In the past, his body has often been beyond his control. When Anita was a girl, he raped her repeatedly and now 20 years later he begins to find the presence of her 12-year-old daughter Asha extremely provocative.Anita notices this attraction and brings her memories into the open, using them to demand money and other concessions from her father. The bribes Karan pays Anita mount as he, now working for the BJP, begins selling the very land out from under schools, and filters the money back to the party for election funding. He believes in nothing but his own preservation and even seeks to bribe both parties to protect himself.An Obedient Father chronicles these personal and political dramas and their intersections. While both storylines are engrossing, neither is particularly encouraging or uplifting. It is the subtlety of Sharma's prose that makes the novel so compelling and so readable. For example, here is Karan describing his own appearance: \"I wore a blue shirt that stretched so tight across my stomach that the spaces between the buttons were puckered open like small hungry mouths.\" In a book that concerns itself with unnatural, unhealthy appetites, even inanimate objects speak of dissolution.Ram Karan is a monstrous character, in both his public and private life, yet he is so carefully depicted that his motivations and emotions are perfectly understood. If he cannot be sympathetic, he is very nearly so. His narrative dominates the novel, imbuing it with his anxiety and helplessness; his guilt is palpable, as is his desire to change or at least control his behavior. Part of the reason he is unable to realize a change, or draw nearer to happiness, is the lack of forgiveness that Anita shows him. In the sections she narrates, she reveals herself as a somewhat sinister, scarred figure whose only desire is to free herself by tormenting her father. The depth of her hatred and the extent of her revenge are chilling and utterly believable.An Obedient Father may be too dark for some readers; however, its power is undeniable, and its story fascinating. At its close, the remaining characters are left with the effects of terrible causes, and the hope that the future may bring, with its knowledge of the past, less destructive actions. Peter RockPeter Rock is the author of the novels Carnival Wolves and This Is the Place. Born in Salt Lake City, Utah, he now lives in Philadelphia.",
  "genres": [
    "Fiction",
    "Indian Literature",
    "Novels",
    "Asia",
    "Family",
    "Literature",
    "Contemporary"
  ],
  "author": "Akhil Sharma",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/159258.An_Obedient_Father"
}