{
  "title": "Baby Time",
  "description": "Over the course of four stories, Kelly is about to be transformed from an independent woman to a docile baby girl who does whatever her boyfriend wants.It starts with a bet. The wager is Kelly’s idea. Feeling naughty, she suggests they play a game. Whoever wins gets to be in complete control for the night. The loser will have to obey any order, no matter how absurd. Convinced she’ll win, Kelly dares Jared.They play. She loses.Now she has to do whatever he wants. At first, Kelly thinks he’ll make her wear some slinky lingerie or play out some other guy fantasy. No, he has something else in mind. Ever since they started dating, Jared has teased his short girlfriend about really being a little girl at heart.Now he has the chance to completely regress her. First, he says that she’d make an excellent preschooler. He thinks she’s really around four at heart, so he picks out a ruffled dress for her to wear. To her completely embarrassment, he then takes her out to the movies. Kelly might think her humiliation is at an end when they get back to his car, but it’s not.She wets herself on the way home, which gives Jared the perfect excuse to diaper her. Before Kelly knows it, she’s back in diapers and forced to drink from a bottle. He doesn’t stop there. Jared is determined to make sure she understands what it means to be a baby girl. By the time he’s done, she will be totally regressed.When she’s good, she gets play time. When she’s bad, she gets spanking time. But no matter how she behaves, she is going to stay in diapers and on her hands and knees until her Daddy allows her to grow up. That might be a long time.Publisher’s Note: This 24,000 word book contains graphic sexual content and is intended for mature audiences only. This work features extensive humiliation, sex, domination, and age play scenarios. This series is intended for mature audiences only.",
  "genres": [],
  "author": "Lauren Kay",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/15927491-baby-time"
}