{
  "title": "Run",
  "description": "For fans of Stephen King, Dean Koontz, and Thomas Harris...Picture A landscape of American genocide...5 Days AgoA rash of bizarre murders swept the country…Senseless. Brutal. Seemingly unconnected.A cop walked into a nursing home and unloaded his weapons on elderly and staff alike.A mass of school shootings.Prison riots of unprecedented brutality.Mind-boggling acts of violence in every state.4 Days AgoThe murders increased ten-fold…3 Days AgoThe President addressed the nation and begged for calm and peace…2 Days AgoThe killers began to mobilize…YesterdayAll the power went out…TonightThey’re reading the names of those to be killed on the Emergency Broadcast System. You are listening over the battery-powered radio on your kitchen table, and they’ve just read yours.Your name is Jack Colclough. You have a wife, a daughter, and a young son. You live in Albuquerque, New Mexico. People are coming to your house to kill you and your family. You don’t know why, but you don’t have time to think about that any more.You only have time to….RunThis 80,000-word thriller also contains a bonus interview with Blake, and excerpts from his other novels.About the Blake Crouch was born near the piedmont town of Statesville, North Carolina in 1978. He attended the University of North Carolina at Chapel Hill and graduated in 2000 with degrees in English and Creative Writing. Blake is the author of five novels and numerous short stories. He lives with his family in southwest Colorado, where he is at work on a new book. His website is www.blakecrouch.com.Praise for the Works of Blake Crouch[In Snowbound], Crouch builds suspense as lines blur between good and bad, and plot twists continue to the last sentence. Absolutely compelling.Booklist (Starred Review)Abandon...demands to be read in one sitting, so you can better appreciate the beauty of Crouch’s storytelling…[O]ne of those books that almost instantly puts you in the mind of a classic.BookreporterWeaving the past and present together with such seamless skill that from the prologue to the last page, this book captures the imagination. [Abandon] has the arc and flow of a master storyteller. Easily my favorite book of this year.Crimespree MagazineHighly recommended, this is easily one of the best this year.New Mystery Reader MagazineAbandon is terrific…a great storyteller hitting his stride.Lee ChildGut wrenching...the writing is tight, the plots exciting, the suspense unending...Crouch tops my list.Ottawa SunExpertly paced and viscerally effective, with many surprises and genuine chills.Kirkus ReviewsBlake Crouch is the most exciting new thriller writer I've read in years.David MorrellHarrowing...terrific...a whacked out combination of Stephen King and Cormac McCarthy.Pat ConroyCrouch delivers his description of place with vivid prose...his carefully crafted characters make the story immediate, intense and thoroughly believable.Denver PostThis is a complex, cleverly constructed novel of motive, and Crouch takes his time bringing us through the story...a great debut. Crouch is an author to watch.The Globe and Mail",
  "genres": [
    "Horror",
    "Thriller",
    "Fiction",
    "Science Fiction",
    "Dystopia",
    "Audiobook",
    "Mystery"
  ],
  "author": "Blake Crouch",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/10605098-run"
}