{
  "title": "Eleanor of Aquitaine and the Four Kings",
  "description": "The story of that amazingly influential and still somewhat mysterious woman, Eleanor of Aquitaine, has the dramatic interest of a novel. She was at the very center of the rich culture and clashing politics of the twelfth century. Richest marriage prize of the Middle Ages, she was Queen of France as the wife of Louis VII, and went with him on the exciting and disastrous Second Crusade. Inspiration of troubadours and trouveres, she played a large part in rendering fashionable the Courts of Love and in establishing the whole courtly tradition of medieval times. Divorced from Louis, she married Henry Plantagenet, who became Henry II of England. Her resources and resourcefulness helped Henry win his throne, she was involved in the conflict over Thomas Becket, and, after Henry’s death, she handled the affairs of the Angevin empire with a sagacity that brought her the trust and confidence of popes and kings and emperors. Having been first a Capet and then a Plantagenet, Queen Eleanor was the central figure in the bitter rivalry between those houses for the control of their continental domains, a rivalry that excited the whole period: after Henry’s death, her sons, Richard Coeur-de-Lion and John Lackland (of Magna Carta fame), fiercely pursued the feud up to and even beyond the end of the century. But the dynastic struggle of the period was accompanied by other stirrings: the intellectual revolt, the struggle between church and state, the secularization of literature and other arts, the rise of the distinctive urban culture of the great cities. Eleanor was concerned with all the movements, and closely connected with all the personages; she knew every city from London and Paris to Byzantium, Jerusalem, and Rome.Amy Kelly’s story of the queen’s long life—the first modern biography—brings together more authentic information about her than has ever been assembled before and reveals in Eleanor a greatness of vision, an intelligence, and a political sagacity that have been missed by those who have dwelt on her caprice and frivolity. It also brings to life the whole period in whose every aspect Eleanor and her four kings were so intimately and influentially involved. Miss Kelly tells Eleanor’s absorbing story as it has long waited to be told: with verve and style and a sense of the quality of life in those times, and yet with a scrupulous care for the historic facts.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "France",
    "Medieval",
    "Medieval History",
    "Biography Memoir"
  ],
  "author": "Amy  Kelly",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/159296.Eleanor_of_Aquitaine_and_the_Four_Kings"
}