{
  "title": "KnitLit (too): Stories from Sheep to Shawl . . . and More Writing About Knitting",
  "description": "Knitters are a breed unto themselves. They speak their own language, and they harbor a passion for their craft that takes a strong hold, blocking out troubles and worry, whenever they pick up the needles. But knitters are not exclusionary—all are welcome into the warm circle once you appreciate the beauty of hand-spun and dyed yarn, the sense of focus that comes with starting a new project, and the joy of creating something beautiful to share with a loved one. In their first book, Sweaters and Their Stories , Linda Roghaar and Molly Wolf brought together a heaping stash of stories by knitters and for knitters that spoke to the power of knitting in people’s lives. Now, without a single dropped stitch, here is KnitLit Stories from Sheep to Shawl .Featuring another rich array of contributors, KnitLit Too includes folksinger Christine Lavin and writers Perri Klass, Lesléa Newman, and Suzanne Strempek Shea. Featured as well are stories by a third-grader who picks up the needles for the first time, a mother waiting to wrap her soon-to-be-adopted child in the blanket she made for him, a sister upstaged by her Merchant Marine brother who just so happens to be a natural knitter, a man who is forced to admit to the new woman in his life that, yes, he knows how to knit, and a young girl living with her mother in a battered women’s shelter who is brought back from the brink when she learns to knit. Rounding out these heartwarming true tales are original poetry, meditations, fiction, and even a mystery, all about knitting. KnitLit Too features more than 70 pieces, some sweet and touching, others inspirational or hilarious, and all woven together by the dedication and devotion that knitters feel for a cherished hobby that is for many a way of life.",
  "genres": [
    "Knitting",
    "Nonfiction",
    "Short Stories",
    "Crafts",
    "Essays"
  ],
  "author": "Molly Wolf",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/159301.KnitLit_too_"
}