{
  "title": "Bride of the MacHugh",
  "description": "This is the story of Elspeth Lamond and the MacHugh. Elspeth is a provocative and feminine lass who lived in a turbulent time in Scotland's history, a period crowded with romance, intrigue, battles and characters that are memorable for their vitality and charm, their lust, strength and willfulness. Alexander MacHugh was head of one of Scotland's mightiest clans when the rebellious Highlanders rallied around the MacDonald banner. He was a man of massive will but gravely courteous demeanor, and he clashed with Elspeth at every encounter, his will pitted against hers, neither of them willing to surrender to an irresistible attraction.It was early in the seventeenth century in Scotland, and the men and women who lived, loved and fought then were no less stormy and unpredictable than the violent events which caught them up and determined their fates. In these pages you will meet the corrupt and ambitious Earl of Argyll, Elspeth's wily guardian, who epitomizes an insatiable greed for power and wealth; Kate MacLachlan, the beautiful and treacherous redhead, whose passion for Alexander MacHugh would stop at nothing for fulfillment; Gavin, the grim and mysterious youth with a scar across his cheek; Elspeth's half-sister, Jeanie Lamond, as fair and fresh as a May morning, and, of course, the many brave and gallant Scottish rebels, led by the MacDonalds, who harried the Campbells and would not be subdued by England.It seemed just another day when Elspeth Lamond rode into the wild and untameable hills and moors of the Highlands on a quiet mission from London, but within a few hours she was a captive riding in the rain toward an unknown destination. From the day of her abduction by a band of rough horsemen till the day she fled the thick walls of her guardian's castle, Elspeth's fate was irrevocably linked with the Lamonds and with their friend, the MacHugh, whose name reverberates through these pages with the vigor of a clash of arms.",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical Fiction",
    "Historical",
    "Scotland",
    "Adventure",
    "Fiction"
  ],
  "author": "Jan Cox Speas",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/1593126.Bride_of_the_MacHugh"
}