{
  "title": "The Undead Day Six",
  "description": "My name is Howie. I was named after my father Howard, but it became too confusing to have two Howards, so I became Howie. I am 27 years old and I work as a night’s manager in a supermarket.I will tell you what happened.On Friday the world fell apart. A zombie infestation has ravaged Europe. Howie was at home and quickly had to learn to fight and survive in this new world as he battled through hordes of undead, desperately trying to reach his family...The Undead Day One.On Saturday he went back to his town but an undead stripper and her psychotic boyfriend awaited him. Then he met Dave and everything changed as they went to war on the undead...The Undead Day Two.On Sunday, Howie and Dave have to travel across country still searching for Howie’s family. Their travels bring them into contact with many strange people as they battle with zombies and other survivors...The Undead Day Three.Monday. Day Four. Howie and Dave have to battle their way out of the police station and make a disturbing discovery. They finally reach Salisbury Army Training Centre and find a massive army of undead soldier zombies, new recruits, an arrogant and cowardly officer and more battles. Meanwhile the infection is learning to control new species…The Undead Day Four. Tuesday, Day Five. Howie, Dave and the teenage army recruits drive the Armoured Personnel Carrier through villages, killing every horde they find. The infection evolves and learns more skills and starts to target Howie and his group of resistors. Introducing Sarah, Howie’s sister at home in her apartment in London. Fighting to survive with any method available. Howie and his group find a fuel station when things go horribly, horribly wrong…The Undead Day Five.Wednesday, Day Six. Howie, Dave and their group travel to London to find Sarah, Howie’s sister. Meeting more wonderful and strange characters on the way. They find another commune led by the enigmatic Big Chris which lead to an amazing adventure. The infection continues to evolve in a shocking twist. The zombies get faster, meaner and tougher and the battles more intense as they fight to survive. The tragedy strikes…. The Undead Day Six",
  "genres": [
    "Zombies",
    "Horror",
    "Audiobook",
    "Fiction",
    "Post Apocalyptic",
    "Dystopia"
  ],
  "author": "R.R. Haywood",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/15937012-the-undead-day-six"
}