{
  "title": "Fantoma",
  "description": "For decades, Fred Burton, a key figure in international counterterrorism and domestic spycraft, has secretly been on the front lines in the fight to keep Americans safe around the world. Now, in this hard-hitting memoir, Burton emerges from the shadows to reveal who he is, what he has accomplished, and the threats that lurk unseen except by an experienced, world-wise few.In the mid-eighties, the idea of defending Americans against terrorism was still new. But a trio of suicide bombings in Beirut–including one that killed 241 marines and forced our exit from Lebanon–had changed the mindset and mission of the Diplomatic Security Service (DSS), the arm of the State Department that protects U.S. embassy officials across the globe. Burton, a member of DSS’s tiny but elite Counterterrorism Division, was plunged into a murky world of violent religious extremism spanning the streets of Middle Eastern cities and the informant-filled alleys of American slums. From battling Libyan terrorists and their Palestinian surrogates to having facing down hijackers, hostages, and Hezbollah double agents, Burton found himself on the front lines of America’s first campaign against Terror.In this globe-trotting account of one counterterrorism agent’s life and career, Burton takes us behind the scenes to reveal how the United States tracked Libya-linked master terrorist Abu Nidal; captured Ramzi Yusef, architect of the 1993 World Trade Center bombing; and pursued the assassins of major figures including Yitzhak Rabin, Meir Kahane, and General Muhammad Zia-ul-Haq, the president of Pakistan–classic cases that have sobering new meaning in the treacherous years since 9/11. Here, too, is Burton’s advice on personal safety for today’s most powerful CEOs, gleaned from his experience at Stratfor, the private firm Barron’s calls “the shadow CIA.”Told in a no-holds-barred, gripping, nuanced style that illuminates a complex and driven man, Ghost is both a riveting read and an illuminating look into the shadows of the most important struggle of our time.",
  "genres": [
    "Nonfiction",
    "History",
    "Memoir",
    "Espionage",
    "Audiobook",
    "Biography",
    "Military Fiction"
  ],
  "author": "Fred    Burton",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/15941604-fantoma"
}