{
  "title": "Trade Secrets",
  "description": "TRADE SECRETS is the financial story that has never been told – it takes the reader on thetrading floor of the world’s largest Exchange where money was pocketed before a trade wasprocessed.When Remy Masterman becomes a member of the Exchange to unearth the details about herfather’s car crash, she comes head to head with Zach Silverman, once her father’s partner andnow Chairman of the Exchange. During the crash of 1987 when Zach’s bagman, Jason, facesbankruptcy, his high-heeled wife, Sarna, learns to trade in order to save their mansion fromforeclosure. As the lives of these two women intersect, Remy falls in love with Ken Baldwin,never imagining how their careers will collide. Sarna begins a steamy affair with another traderwho turns out to be an undercover agent for the FBI during its probe into trading infractionsat the Chicago exchanges. When Jason’s clerk is pummeled, along with those investors whomisplaced their money with their faith, he and Sarna create a bold, sexy scheme to save Remyand rid the Exchange of those who try to get away with murder.Kirkus says of Trade Secrets:Rozner’s debut novel peeks into the high-powered world of insider trading.Hoping to discover more about her father’s mysterious death in a car crash, Remy Masterman enters the secretive, male-dominated world of stock trading, where she learns to assert herself and value her femininity. Readers will be captivated by her journey, and also by the men whom she falls in love with and the conflicted, sometimes erotic relationships that develop between them. When Sarna, the high-strung wife of a fellow trader, joins the Chicago Stock Exchange, Remy at first feels as though she’s been displaced as the sole female at the Exchange. However, the women’s lives intimately intersect as a striking female friendship is born. With multiple storylines and finely tuned characters, the elegantly fashioned novel amounts to more than its pieces would suggest. Rozner skillfully creates complex, provocative characters, with particularly strong female leads. Women call the shots; Rozner subtly indicates that, although the stock exchange appears to be a man’s world, women possess an intoxicating, seemingly irresistible power: their allure. At times, however, the vivid, sometimes gratuitous sex scenes may distract readers from the well-crafted plot. Female characters—specifically Sarna and Rosa—utilize sex to achieve their goals, with men like putty in their hands. For instance, in one explicit scene, Sarna convinces her husband to let her trade stocks simply by having sex with him. For the most part, though, shrewd, sharp-witted intelligence parallels the steamy sensuality. Fans of Fifty Shades of Gray (2011) will approve.A smart, sexy debut.",
  "genres": [
    "Mystery",
    "Thriller",
    "Suspense",
    "Fiction",
    "Mystery Thriller",
    "Contemporary Romance",
    "Romance"
  ],
  "author": "Holly Rozner",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/15940831-trade-secrets"
}