{
  "title": "The Village",
  "description": "In her award-winning debut novel, Gifted, Nikita Lalwani crafted a brilliant coming-of-age story that “[called] to mind the work of such novelists as Zadie Smith and Monica Ali” ( The Washington Post Book World ). Now Lalwani turns her gimlet eye on an extraordinary village in India, and explores the thin boundary between morality and evil, innocence and guilt. After a long trip from London, twenty-seven-year-old BBC filmmaker Ray Bhullar arrives at the remote Indian village of Ashwer, which will be the subject of her newest documentary. From the outside, the town projects a cozy air of domesticity—small huts bordering earthen paths, men lounging and drinking tea, women guiding bright cloth through noisy sewing machines. Yet Ashwer is far from traditional. It is an experimental open prison, a village of convicted murderers and their families. As Ray and her crew settle in, they seek to win the trust of Ashwer’s residents and Nandini, a women’s counselor and herself an inmate; Jyoti, a prisoner’s wife who is raising her children on the grounds; Sujay, the progressive founder and governor of the society. Ray aims to portray Ashwer as a model of tolerance, yet the longer she and her colleagues stay, the more their need for a dramatic story line intensifies. And as Ray’s moral judgment competes with her professional obligation, her assignment takes an uneasy and disturbing turn. Incisive, moving, and superbly written, The Village deftly examines the limits of empathy, the slipperiness of reason, and the strength of our principles in the face of personal gain.Praise for The Village “Powerful . . . One of the novel’s great strengths is how it maintains an ambience of mystery and menace.” — The New York Times Book Review “Extraordinary . . . Lalwani writes with wonderful clarity and intelligence.” —The Times (U.K.) “ The Village can creep up and grab you unawares.” —Toronto Star “[Lalwani’s] prose is evocative and excellent.” — Publishers Weekly “Thoughtful and beautifully written.” — The Guardian (U.K.) “Gripping.” — Marie Claire (U.K.)“Intelligent and disturbing . . . a sharply observed, highly personal book.” — Pittsburgh Post-Gazette“A thoughtful novel that envelops us in the oppression and beauty of the rural prison . . . Each voice is distinct, believable and stubborn in its refusal to be easily known. . . . Touchingly evocative.” — Financial Times “Thoughtfully and often beautifully written . . . a candid exploration of journalistic ethics.” — The Observer",
  "genres": [
    "Fiction",
    "India",
    "Contemporary",
    "Literary Fiction",
    "Indian Literature",
    "Adult Fiction",
    "Adult"
  ],
  "author": "Nikita  Lalwani",
  "average_rating": "2.77",
  "url": "https://www.goodreads.com/book/show/15942546-the-village"
}