{
  "title": "My Chinese Dream - From Red Guard to CEO",
  "description": "This new book takes the old tried and true sent-down-to-the-countryside Chinese Cultural Revolution memoir and turns it on its head by infusing the story with entrepreneurial flair: using years of turmoil and despair as the launching point for an incredible true story of dedication and single-minded determination. Far from riding the pro-China propaganda train, My Chinese Dream is instead a startlingly frank, warts-and-all, rags to riches fairy tale that reveals the excruciating years of mass social reform in China in the 1960s and 1970s, while at the same time perfectly capturing the early entrepreneurial spark of the \"opening up\" period of the 1980s and 1990s, when many hard working, forward thinking Chinese businesspeople rewrote the rule book for achieving success within the rigidly-defined social structure. This incredible true story is a must-read for anyone interested not only in China, but in entrepreneurship, personal development, and overcoming adversity. Liu Ping was born in Liaoning Province, China, in 1955. When she was 15, she was sent to work in a phosphate mine. After graduating from college she became a teacher as well as an interpreter for China's Ministry of Chemical Industry. When she was in her 30s, she joined one of China's largest travel and tourism companies and was heavily involved in professional and cultural exchanges with many foreign companies. Her interpersonal skills would eventually launch her on a solo career as one of China's most successful female entrepreneurs. Today she is CEO of a private company the China Star Group, one of China's most successful DMC (Destination Management Company ) and PCO ( Professional Conference Organizer ) companies with offices in Beijing, Shanghai, and Hong Kong.",
  "genres": [
    "China",
    "Nonfiction",
    "History"
  ],
  "author": "Ping Liu",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/15944394-my-chinese-dream---from-red-guard-to-ceo"
}