{
  "title": "L Is for Lion: An Italian Bronx Butch Freedom Memoir",
  "description": "A 1960s Bronx tomboy learns how to survive her brutal but humorous Italian family and all the rest that life throws her. The harder you hit the pavement, the higher you fly.This vivid memoir speaks the intense truth of a Bronx tomboy whose 1960s girlhood was marked by her father’s lullabies laced with his dissociative memories of combat in World War II. At four years old, Annie Rachele Lanzillotto bounced her Spaldeen on the stoop and watched the boys play stickball in the street; inside, she hid silver teaspoons behind the heat pipes to tap calls for help while her father beat her mother. At eighteen, on the edge of ambitious freedom, her studies at Brown University were halted by the growth of a massive tumor inside her chest. Thus began a wild, truth-seeking journey for survival, fueled by the lessons of lasagna vows, and Spaldeen ascensions.From the stoops of the Bronx to cross-dressing on the streets of Egypt, from the cancer ward at Memorial Sloan-Kettering to New York City’s gay club scene of the ’80s, this poignant and authentic story takes us from underneath the dining room table to the stoop, the sidewalk, the street, and, ultimately, out into the wide world of immigration, gay subculture, cancer treatment, mental illness, gender dynamics, drug addiction, domestic violence, and a vast array of Italian American characters. With a quintessential New Yorker as narrator and guide, this journey crescendos in a reluctant return home to the timeless wisdom of a peasant, immigrant grandmother, Rosa Marsico Petruzzelli, who shows us the sweetest essence of soul.“If you want to know what it means to be a real human being, read Annie Lanzillotto’s memoir, L Is for Lion, the title delivered to her directly in a dream from her dead father. As its subtitle implies, the book is a lesbian coming-of-age story, but like Whitman before her, Annie is vast; she contains multitudes. In spite of the privation and scarcity that have always dogged her, she lives out of abundance. You will love this lion as I do, and she will make you roar.” — Jean Feraca, author of I Hear Voices: A Memoir of Love, Death, and the Radio“Annie’s adventures as a Bronx-born tomboy are one-of-a-kind. The writing is exuberant and lyrical; the characterization masterful. Told with pathos, wit, and unflagging energy. If you’re looking for a memoir in high-definition surround sound, look no further.” — Margaux Fragoso, author of Tiger, Tiger: A Memoir“Annie Lanzillotto, the bard of Bronx Italian butch, is an American original, a performance artist and cultural anthropologist whose work is unique in theme, sound, affect, and effect. This memoir reveals her to be something more: an astonishing writer possessed of an utterly inimitable voice, a voice at once as richly soulful as her mother’s lasagna and as bracingly unsentimental as her father’s Marine masculinity. Lanzillotto’s stories bounce and stretch with the elasticity of her trusted Spaldeen, keeping us just a step ahead of the flying emotional shrapnel of an intensely lived life as we move from the mean streets of 1970s Bronx to the Ivy League, the Memorial Sloan-Kettering cancer ward, the banks of the Nile, and the Italian mezzogiorno. A landmark of ethnic expressivity, L Is for Lion indelibly portrays the iconic Italian American spaces of kitchen, stoop, sidewalk, and street; the body as a site of humor and tragedy; and, above all, the family war zone as an uncanny intermingle of poignancy and brutality.” — John Gennari, author of Blowin’ Hot and Cool: Jazz and Its Critics“L Is for Lion is a book about a girl named ‘Daddy’ who goes to Brown but never leaves the Bronx.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "LGBT",
    "Lesbian",
    "Queer"
  ],
  "author": "Annie Rachele Lanzillotto",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/15945661-l-is-for-lion"
}