{
  "title": "Commitments: SuperNatural",
  "description": "This story is a continuance of a series that began with a young vampire, finding her life-mate, then having to battle through a deranged hybrid to save his life. In the first book of the SuperNatural Novel series, Italia (young vampire) is the youngest in her family in human years, but second oldest in eternal years. She and her family befriended a group of local witches in order to defeat the hybrid, who happens to be part witch and part vampire. Shortly there after, their new friends' secret identity is threatened when a pack of angry werewolves seek them out, blaming them for the strange things happening to the kids at their school. Many troubles this young vampire experiences all in order to make a life with her eternal mate, all while hoping to convince him to accept her lifestyle in order for them to be together. The troubles didn't stop there, as in the second book to the series, Italia's family takes Jarrett(Italia's life-mate) on a vacation to Africa where his life becomes endangered due to the thirst of human blood drinkers who find the smell of his blood extremely intoxicating. Doing everything in their power to keep Jarrett alive and getting him back to the United States unharmed, proved to be more difficult than the Boghelis could have imagined. Constant attacks from the relentless vampires and their counterparts, brought them to Georgia where they lived, and to the third book in this series.... Commitments. Challenges arise not only with the vampire family, but also the group of witches, encountering a new member, and the wolf pack in division of turmoil within the pack as one of their members falls head over hills in love with the love interest of one of the witches. You will find yourself unable to pull yourself away from any book in this series. It is full of drama, action, suspense, romance, and even comedy.",
  "genres": [],
  "author": "Tamala Callaway",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/15951152-commitments"
}