{
  "title": "Riddle of the Red Bible",
  "description": "Riddle of the Red Bible is one of the latest science fiction books to tackle time travel and ghosts together, and with a new twist. Set in Hertfordshire, England, Manila, Philippines and California, USA this exciting novel also deals with adventure, religiosity, teen romance, love for family, and courage.Like many youngsters today, Courtney Nivots is a British teenager with a dream - although she doesn’t dream of being rich, winning the latest T.V. talent contest or becoming famous. No, she actually dreams of something even more challenging; meeting her deceased father.At the very young age of five, she takes her first step on a truly wonderful and life changing journey. Sitting alone in her room one fateful evening, she encounters a truly terrifying thing - her worst nightmare - a ghost. From the way it behaves, she’s convinced that the apparition definitely isn’t friendly after it violently lashes out and destroys her only remaining link to her father – a porcelain figurine of Jesus Christ with a personalised message inscribed on the bottom. However, what transpires in that very moment takes her on a rollercoaster ride of epic proportions; both physically and emotionally, as everything she has ever known to be ‘real’ is truly put to the test.As she enters her teens and develops a deep rooted desire to find out who visited her all those years ago, she discovers a cryptic red book that might somehow make that possible. So with the help of some charming, brainy and downright geeky transatlantic friends, she sets out on a perilous time travel adventure to discover answers to questions nobody thought could ever be Can you truly lay out the path of your own destiny at the tender age of five or do you re-write your future with every brave step you take? When Courtney encounters the most tremendous and tangible example of how it can really be possible to see her own future by looking into the past (without far-fetched time machines and extravagant contraptions) she is forced to find out those answers head on as she journeys to discover who visited her all those years ago and what part her long lost dad might play in her life. However, with the very physics of time combatting against her, there will be many substantial costs to pay before she can really find out who she is and whether she truly belongs in this world.",
  "genres": [],
  "author": "K.T. Jae",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/15951146-riddle-of-the-red-bible"
}