{
  "title": "The Bodhisattva Path of Wisdom and Compassion",
  "description": "The second volume in this landmark series presents the bodhisattva teachings of the mahayana. At this point, having trained and seen the benefits of looking within, the student begins to shift their focus outward to the broader world. Formal entry into the mahayana occurs with taking the bodhisattva vow. Mahayana practitioners dedicate themselves to the service of all sentient beings, aspiring to save them from sorrow and confusion, and vowing to bring them to perfect liberation. This stage of the path emphasizes the cultivation of wisdom through the view and experience of emptiness, or shunyata , in which all phenomena are seen to be unbounded, completely open, ungraspable, and profound. From the ground of shunyata, compassionate activity is said to arise naturally and spontaneously. In addition to mindfulness and awareness, the mahayanist practices lojong , or “mind training,” based on the cultivation of the paramitas , or “transcendent virtues”: generosity, discipline, patience, exertion, meditation, and prajna, or “knowledge.” As a component of lojong, tonglen , or “sending and taking,” is practiced in order to increase maitri , or loving-kindness. Other topics covered in detail in this volume include bodhichitta , skillful means, Buddha nature and basic goodness, Madhyamaka, the ten bhumis , the three kayas , and more.The Profound Treasury of the Ocean of Dharma represents meditation master Chögyam Trungpa’s greatest contribution to Western Buddhism. This three-volume collection presents in lively, relevant language the comprehensive teachings of the Tibetan Buddhist path of the hinayana, mahayana, and vajrayana. This work will resonate with new students of Buddhism as well as the most senior students.",
  "genres": [
    "Buddhism",
    "Religion",
    "Spirituality",
    "Philosophy",
    "Nonfiction"
  ],
  "author": "Chögyam Trungpa",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/15953435-the-bodhisattva-path-of-wisdom-and-compassion"
}