{
  "title": "River Notes: A Natural and Human History of the Colorado",
  "description": "Plugged by no fewer than twenty-five dams, the Colorado is the world’s most regulated river drainage, providing most of the water supply of Las Vegas, Tucson, and San Diego, and much of the power and water of Los Angeles and Phoenix, cities that are home to more than 25 million people. If it ceased flowing, the water held in its reservoirs might hold out for three to four years, but after that it would be necessary to abandon most of southern California and Arizona, and much of Colorado, New Mexico, Utah and Wyoming. For the entire American Southwest the Colorado is indeed the river of life, which makes it all the more tragic and ironic that by the time it approaches its final destination, it has been reduced to a shadow upon the sand, its delta dry and deserted, its flow a toxic trickle seeping into the sea. In this remarkable blend of history, science, and personal observation, acclaimed author Wade Davis tells the story of America’s Nile, how it once flowed freely and how human intervention has left it near exhaustion, altering the water temperature, volume, local species, and shoreline of the river Theodore Roosevelt once urged us to “leave it as it is.” Yet despite a century of human interference, Davis writes, the splendor of the Colorado lives on in the river’s remaining wild rapids, quiet pools, and sweeping canyons. The story of the Colorado River is the human quest for progress and its inevitable if unintended effects—and an opportunity to learn from past mistakes and foster the rebirth of America’s most iconic waterway. A beautifully told story of historical adventure and natural beauty, River Notes is a fascinating journey down the river and through mankind’s complicated and destructive relationship with one of its greatest natural resources.",
  "genres": [
    "Nonfiction",
    "History",
    "Travel",
    "Nature",
    "Environment",
    "Natural History",
    "Science"
  ],
  "author": "Wade Davis",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/15954297-river-notes"
}