{
  "title": "Continental Divide: Wildlife, People, and the Border Wall",
  "description": "The topic of the border wall between the United States and Mexico continues to be broadly and hotly on national news media, by local and state governments, and even in coffee shops and over the dinner table. By now, broad segments of the population have heard widely varying opinions about the wall's effect on illegal immigration, international politics, and the drug war.But what about the wall's effect on the Sonoran pronghorn antelope herds and the kit fox? On the Mexican gray wolf, the ocelot, the jaguar, and the bighorn sheep? In unforgettable images and evocative text, \"Continental Wildlife, People, and the Border Wall\" helps readers understand all that is at stake.As Krista Schlyer explains, the remoteness of this region from most US citizens' lives, coupled with the news media's focus on illegal immigration and drug violence, has left many with an incomplete picture. As she reminds us, this largely isolated natural area, stretching from the Pacific Ocean to the Gulf of Mexico, hosts a number of rare Arizona's last free-flowing river, the San Pedro; the grasslands of New Mexico, some of the last undeveloped prairies on the continent; the single most diverse birding area in the US, located along the lower Rio Grande River in Texas; and habitat and migration corridors for some of both nations' most imperiled species.?In documenting the changes to the ecosystems and human communities along the border while the wall was being built, Schlyer realized that the impacts of immigration policy on wildlife, on landowners, and on border towns were not fully understood by either policy makers or the general public. The wall not only has disrupted the ancestral routes of wildlife; it has also rerouted human traffic through the most pristine and sensitive of wildlands, causing additional destruction, conflict, and death--without solving the original problem.",
  "genres": [
    "The United States Of America",
    "Nonfiction",
    "Politics",
    "Nature"
  ],
  "author": "Krista Schlyer",
  "average_rating": "4.78",
  "url": "https://www.goodreads.com/book/show/15953844-continental-divide"
}