{
  "title": "King of Angels, A Novel About the Genesis of Identity and Belief",
  "description": "By Perry Brass, the acclaimed author of How to Survive Your Own Gay Life , Carnal Sacraments , The Substance of God , Warlock , and Ippy-Award Gold Medalist The Manly Art of Seduction comes a novel in the setting of Midnight in the Garden of Good and Evil , in the Man Men period. \"Perry Brass is a literary polymath who enthralls readers no matter the genre.\" Richard Labonte, syndicated book columnist, Book Marks King of Angels is a novel about the difficult and often tragic relationship of fathers and sons, or about one particular father and his attachment to his son, and his son s own unwavering attachment to him, despite scandals, secrets, and problems, and everything that will hold them apart, and yet keep them together forever. It is a coming-of-age story not just of one boy, but of a culture and an emerging gay community. It is the story of Benjamin Rothberg, a 12-year-old master of shape-shifting, of changing identities while steadfastly grasping the unique features of his own. The child of a marriage between a handsome Northern Jewish father and a classic-WASP-beauty Southern mother, Benjamin must change identities from Jewish to non-Jewish, from being a smart, precocious self-aware kid to masquerading and passing as a regular boy, from growing into a sexually curious (and possibly gay) young man to experiencing a fragile adolescent innocence, almost in love with a pretty girl. Set in Savannah, Georgia, during the tumultuous Kennedy years, King of Angels explores the role of Southern Jews in the still-segregated South, the explosive race relations and racial consciousness of this era, and the emergence of a genuine gay community with its own honest, outsider viewpoint. It is also a realistic story of the underground world of boys who must fool their parents and each other in order to achieve any form of unguarded closeness. As a half-Jew attending Holy Nativity, a Catholic military school in Savannah, Benjy will form some of the most important friendships of his life, and experience the full brutality of boys bullying each other. He will also become aware of many forms of seduction and the seductions of a secret sexual life in the school, the seductions of his own heart taken with a quiet handsome Puerto Rican male student, and the attractions of the Spirit itself in all of its revealed forms. This is truly a novel about the mysterious origins of identity and belief, in a questioning heart and questioning time, while growing up in the changing South in the early 1960s.",
  "genres": [
    "Gay Fiction"
  ],
  "author": "Perry Brass",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/15958342-king-of-angels-a-novel-about-the-genesis-of-identity-and-belief"
}