{
  "title": "Widder's Landing: Life & Love on the Kentucky Frontier",
  "description": "A young man loses his job and is forced to relocate. No one is hiring in such bleak economic times. America finds itself threatened by a world superpower firmly in control of global trade. Money is scarce, businesses fail, and the Bank of the United States closes its doors. The country will soon be embroiled in another war. This is not present day the year is 1811. Craig Ridgeway, a 21-year old gunsmith from Pennsylvania, rides a flatboat down the Ohio River and settles in Breckinridge County, Kentucky to try his hand at farming. Through an accidental association with a notorious widow (the past proprietor of a liquor vault and prostitution den), he inherits a patch of rich bottomland, embraces a nearby family, and falls in love with the abandoned wife of a violent outlaw. Overcoming inexperience and hardships, Craig builds a promising new life, learning how to raise corn, tobacco and hemp. Inspired by the Widder's recipe, he and his wife Mary manufacture bourbon whiskey, which he markets profitably in New Orleans. A new steamboat embarks on its first journey down the Ohio and Mississippi Rivers, ushering in a new economic era. But good fortune comes at a high price. The looming war with Great Britain disrupts the economy and soon overshadows Craig's life. He must make choices that affect others in times of conflict. Will he risk everything by fighting on the northern frontier? Will he use his special talents as a gunsmith and marksman to help his nation? After twice refusing to fight on the northern frontier, he has one last chance to join his fellow Kentuckians in the heroic defense of New Orleans. The epic battle on the sugarcane plantations below the city provides redemption for the young American nation and for Craig, as he returns home to continue his adventure in life with Mary. Widder's Landing is a story of life, love and survival set against the rugged Kentucky frontier.",
  "genres": [
    "Historical Fiction"
  ],
  "author": "Eddie Price",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/15959816-widder-s-landing"
}