{
  "title": "Better Off Dead",
  "description": "If there’s such a thing as luck, Lily Harper definitely doesn’t have it. Killed in a car accident before it’s her time to go, Lily learns that the hereafter isn’t exactly what she hoped it might be. First, there’s AfterLife Enterprises, the company responsible for sorting out the recently dead and sending them on their way to the Kingdom, (aka happily ever after,) or to the Underground City, (not so happily ever after.) Learning that Lily’s death was indirectly their fault (her guardian angel, Bill, was MIA during her accident and was one of their employees,) Afterlife Enterprises offers Lily the chance to live again. But, as with most things involving the afterlife, beware the fine print. Most notably, Lily will have to become a soul retriever, venturing into the bowels of the Underground City to retrieve souls that were mistakenly sent there by Afterlife Enterprises during a Y2K computer glitch. Second, there’s angel Bill. As if risking her second life in the Underground City wasn’t enough, Lily’s guide to the Underground is none other than her incompetent, alcoholic, womanizing guardian angel, Bill, the antithesis of anything wholesome. With only Dante’s Inferno and Bill to help her in her quest, Lily’s future isn’t looking bright.Finally, there’s the legendary bladesmith, Tallis Black. As Scottish as his kilts and heavy brogue, Tallis Black is a centuries-old Celt who, for reasons only known to him, offers to train Lily and act as her escort into the depths of the Underground City. Dark, brooding and definitely dangerous, Lily knows she shouldn’t trust Tallis, but she also can’t deny her attraction to him. Between soul retrieving in hell, dealing with Bill and trying to figure out what’s in it for Tallis, Lily wonders if maybe she would’ve just been better off dead.",
  "genres": [
    "Paranormal",
    "Fantasy",
    "Urban Fantasy",
    "Romance",
    "Paranormal Romance",
    "Fiction",
    "Angels"
  ],
  "author": "H.P. Mallory",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/15962381-better-off-dead"
}