{
  "title": "TERRITORY Book One: The Red Thunder Clan",
  "description": "The rogue vampire factions of North America have come under the scrutiny of the 13th Coven, the ruling class of vampire society; a rapidly failing leadership quickly losing control over their kind. They have begun to seek new lands dangerously close to the borders of three werewolf clans of the three breeds.  Leading the endeavor is a fallen Red Marshal of the 13th Coven with her own agenda that could ignite a war. She is pursued by the werewolves of The Red Thunder Clan as well as a pack of Pure-Bloods; vampires sworn to hunt and destroy their own kind. Allied with an army of diseased and exiled vampires known as Shadow-Walkers, the fallen Red Marshal Sophia will stop at nothing in her quest to wage war against The Red Thunder Clan and any who stand against her; werewolf and vampire alike._____________________________________________________________Mason Balfour's 'The TERRITORY Anthology' weaves an elaborate and epic tale of horror, suspense and drama unlike others of the genre. It offers a fresh look at the werewolf/vampire myths and legends of history, literature and film while giving fans and readers what they expect from the genre.  'TERRITORY' is a worth-while read for any fan of the genre, but will appeal most strongly to fans of 'BLADE', 'UNDERWORLD', 'TRUE BLOOD' and the 'WEREWOLF: the APOCALYPSE' mythology. 'TERRITORY' has been described as \"Bloody and unrelenting! Every bit as entertaining and thrilling as 'UNDERWORLD' A must-read for werewolf and vampire fans.\" It's a hard, fast and brutal story packed with action and bloody violence, but maintains a careful balance with well-paced drama and well-crafted characters; all of which is sure to captivate the reader from the very first page and not let go.  The story is set primarily in the state of Washington and the state of Oregon and makes careful, extensive and deliberate use of real geography in the story telling to add a texture of realism, believability and authenticity seldom seen in stories of its kind. If you're a hard-core fan of the genre or reading for the first time, you're sure to become a fan of the 'TERRITORY' anthology!",
  "genres": [
    "Horror"
  ],
  "author": "Mason Balfour",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/15980356-territory-book-one"
}