{
  "title": "Green Eyed Temptation",
  "description": "How does one Creole beauty choose between the two men who’ve both captured her heart?Meet Angelique Baptiste…Happy with her career, her friends, and her man…sans the sex life, thanks to her shrink. After years of relying far too much on sex appeal to choose her partners, she accepts her therapist’s opinion that it’s done nothing but hinder her ability to make wise choices. As a result, she’s spent the last six months as chaste as a nun in a monastery, much to the chagrin of one particular ‘friend-with-potential’ to be much more.  Michael Harper is a man of integrity, as well as a detective for the Lafayette Police Department. He doesn’t hide the fact that he’s crazy about Angelique, and he’s willing to wait for her to serve out her sentence of self-imposed celibacy. As trying as it is to be around her, he knows the reward for his perseverance will be a lifetime with the woman he loves. Or will it?Liam Nash, ex-Navy Seal turned body guard, has the unfortunate reputation of being the last man to break Angelique’s heart. More than a year earlier they’d been a couple, but rather than commit to a lifetime with her, he’d high tailed it back to Texas. Within minutes of swaggering back into her life, he proves his reason for leaving was justified. He’s defeated the demons from his past and is all too willing to work at a happily ever after with her. Torn between the two men she loves equally, Angelique agonizes over the choice she knows she must make. Just when she decides she can’t break one heart over another, fate steps in to decide for her. This novel includes a chilling subplot of a young mother, Sarah Richard, and her efforts to free herself and her twin infant daughters from the abuse of her estranged husband.Note from the author:The Halos and Horns series is filled with new characters you’ll love, along with recurrent appearances of old favorites from my La Fleur de Love series. Enjoy! ~ Lori Leger ~",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary"
  ],
  "author": "Lori Leger",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/15980486-green-eyed-temptation"
}