{
  "title": "Kicker",
  "description": "This is an alternate cover edition of isbn 9781477142. Based on actual experiences and official records from World War II, Kicker is a thrilling war novel of a man’s journey into hell. From the pleasant hills of Pennsylvania to the torrid jungles of Burma, Sam endures relentless enemy attacks against his unarmed aircraft while his family struggles with shortages and rationing at home. This is the tale of \"the forgotten front\", the bloody, grueling campaign to push the Japanese out of Burma.Although Kicker is an epic work of historical fiction, this World War 2 thriller is based on official military aviation history records and the real experiences of United States veterans who fought in the China-Burma-India Theater (CBI) \"the forgotten front\". Through unforgettable scenes in Burmese skies filled with monsoon storms and enemy fighter planes, Kicker tells the story of the brave Army Air Corps soldiers who risked their lives in unarmed aircraft to drop supplies to Merrill's Marauders and over 750,000 allied soldiers fighting in the perilous jungles of Burma.In effort to keep Japanese forces occupied in China, the Allies flew unarmed supply missions over the treacherous Himalayan Mountains between India and China. Their route, known as The Hump, saw the loss of over 1500 airmen and 2000 planes due to endless attacks by Japanese Zeros and some of the world's worst flying conditions. The Hump became known as \"the skyway to hell\" and \"the aluminum trail\" from the large amount of aircraft wreckage strewn across the Himalayan slopes.Allied soldiers in the jungles of Burma fought everyday just to survive. They faced elite, fearless Japanese soldiers and man-eating beasts. The Allies were surrounded by poisonous snakes, insects, and plants. These brave men suffered through monsoon seasons, so wet and humid, their uniforms rotted off their bodies as they fought fanatical Kamikaze armies through jungle and swamplands.From the Forgotten Front to the Homefront, Kicker brings you the story of America's Greatest Generation through the eyes of the men and women who would be forever haunted by their experiences.Reviews from fans of Kicker:\"I could not put this book down, as the story of Sam, the young volunteer and aspiring pilot, unfolds. The author delivers his story telling with a rich back drop of historical details reflecting a thoroughly researched knowledge of the subject matter.\" Elray\"Would recommend this not only to history buffs and WWII aficionados (like myself) but to any reader interested in being transported to another time and place, one that shaped all of our lives and fortunes today, worldwide.\" W.M. Driscoll\"What an interesting story! I learned so much about heroes not mentioned in history books.\" Jacquie Rhoades\"History made real through the telling of one soldier's story. This book made me miss my father and all of the stories he never told me.\" Linda S. Browning\"Hoover leaves nothing out. He shows the sacrifices made on the battle front, as well as sacrifices made on the home front.\" Candi Silk",
  "genres": [
    "Historical Fiction"
  ],
  "author": "R. Grey Hoover",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/15980748-kicker"
}