{
  "title": "Darwin - The Power of Observation and Reflection",
  "description": "Whereas most people know that Charles Robert Darwin stands for the Theory of Evolution, hardly any know anything about his life. Who was this man, and how come it was he who finally worked out what we today call the Darwinian Theory of Evolution? What was his professional and social background? If and when one asks such questions, one receives the most diverse answers. Darwin was English, that is fairly general knowledge, but that is about all. What about a few details about his life? Well, didn't he travel on the Beagle? After all, there was the well-made documentation of the BBC about the voyage of HMS Beagle. Where did Darwin study? Now, now, is that all that important? And after all, he was just the companion of the Captain, wasn't he? If one then asks about a poet by the name of Erasmus Darwin, one gets but surprised looks. The general knowledge about Darwin is, to say the least, nothing but fragmentary.The biologist and historian of science Prof Guido J. Braem answers all these questions in his biography of Charles Robert Darwin. He supplies detailed information about all aspects of his life in the context of Victorian England. The book begins with some notes about his pedigree and with an account of his schooldays in Shrewsbury after which his time at the universities in Edinburg and Cambridge are described. The famous voyage of HMS Beagle that lasted nearly five years is documented as well as his evolution from a young gentleman intended for the cloth to one of the best know naturalists of our planet. The genesis of his theory of evolution cumulating into the publication of his masterpiece about the origin of species is discussed at length, as are all his other works and the reception thereof during his days. The book also describes Darwin’s interactions with the geologist Charles Lyell, the botanists Joseph Dalton Hooker and Asa Gray, the anatomist Thomas Henry Huxley as well as many other famous and influential 19th century individuals.Today, the issue “Darwin and his work” remains just as controversial as it was 150 years ago. But most arguments against Darwin result from ignorance about his person and his life and work. This book is the answer.",
  "genres": [],
  "author": "Guido J. Braem",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/15984536-darwin---the-power-of-observation-and-reflection"
}