{
  "title": "Aris Returns: A Vampire Love Story",
  "description": "ARIS RETURNS - A Vampire Love Story Psychologist Sarah Hagan thought she had her life under control. She pulled herself together after a painful (and unexpected) divorce. She’s currently dating a successful but neglectful attorney—a relationship that is adequate, if not totally satisfying. She has a few good friends, lives in a beautiful condo in the heart of Chicago, and loves her work as a therapist. From the outside, it looks like her life is almost perfect. it only takes one patient -- a handsome younger man named Carlos who is on parole for car theft -- to put her well-ordered life into a tailspin. As she regresses him with hypnotherapy, she discovers an unusual presence. Is this some elaborate alter ego that Carlos has created or is something much stranger going on? In Sarah’s attempt to help Carlos deal with his issues of anger and a troubled past, she is captivated by the persona she uncovers through hypnosis Aris. Aris reveals that he is a vampire whose story begins in the time of Alexander the Great. His retelling of his lives, involvement and apparent demise in the court of Henry VIII keep her spellbound and hungry for more. On top of grappling with a phantom vampire, Sarah begins to have the most disturbing (and sensual) dreams. They awake the emotion, passion and vulnerability that she thought she had buried for good. The dreams both terrify and excite her as she struggles to make sense out of her world turned upside down. Sarah genuinely cares about Carlos as a patient and wants to help him find his way to a better life, but he has brought chaos, confusion and danger into her neatly buttoned-up reality. And if that’s not enough to deal with, she is inexplicably drawn to Aris in a way she can’t begin to rationalize. Can Sarah possibly love this vampire ghost or will he destroy everything she treasures?",
  "genres": [
    "Romance",
    "Vampires",
    "Paranormal",
    "Fantasy",
    "Paranormal Romance",
    "Supernatural",
    "Historical Fiction"
  ],
  "author": "Devin Morgan",
  "average_rating": "3.42",
  "url": "https://www.goodreads.com/book/show/15985432-aris-returns"
}