{
  "title": "I'll Gather My Geese",
  "description": "In 1916, Hallie Crawford went to teach school in Presidio, just across the Rio Grande from Ojinaga, Mexico, which had been recently captured by Pancho Villa. Hallie's father, considering this a dangerous place for a young woman of nineteen to live alone, told her he thought she was going on a wild goose chase. \"Then I'll gather my geese,\" she told him, with determination and independence. These traits stayed with Hallie all her life, and were indispensable in her role as a ranch wife. Raised as a \"proper\" Southern woman, Hallie was not prepared for the difficulties she faced when she moved to her new home, the Stillwell Ranch, in 1918. But she quickly became an invaluable part of the workings on the ranch. She watched and learned from her husband, Roy Stillwell, and she adjusted to the new life-style that she grew to love. The ranch hands, who thought she would only last six months, came to respect her and her abilities to do as much work as any man on the ranch. They became a family. Then Roy and Hallie started a family of their own. Three children were a handful, and the Stillwell family split its time between the ranch and a home in town. On the ranch outside Marathon, near the Mexican border, work was hard and joy came in the simple things. After working cattle all day, relaxing under the arbor in front of the house was a pleasure. Hallie had a favorite rock out behind the house, and she often sat on it to watch the sun set, take a break from her energetic youngsters, or otherwise gain some tranquility and perspective.The ranch and its inhabitants survived two world wars, the depression, droughts, an influenza epidemic, as well as the everyday troubles of ranching in the Big Bend country. Hallie's story, told in a personal and engaging way, is fascinating reading for anyone interested in the history of pioneering ranching in Texas.",
  "genres": [
    "Nonfiction",
    "Nature",
    "History",
    "Biography",
    "Memoir"
  ],
  "author": "Hallie Crawford Stillwell",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/1061138.I_ll_Gather_My_Geese"
}