{
  "title": "The Burning Maiden",
  "description": "MARCH 2013 TOP TEN PAID ANTHOLOGYTHE BURNING MAIDENWhere Literature and the Supernatural MeetSixteen new short stories from bestselling authors...Joe R. Lansdale (Edge of Dark Water, Bullets and Fire)Matthew Pearl (The Dante Club, The Technologists)Louis Bayard (The School of Night, The Black Tower)Lyndsay Faye (The Gods of Gotham, Dust and Shadow)Charles Johnson (Middle Passage, Oxherding Tale)AND MORE!* EXCLUSIVE BONUS MATERIAL INCLUDED *Three extended book excerpts from Bram Stoker Award Winner Mike Oliveri and acclaimed writers John Urbancik and Mark Justice.FROM THE INTRODUCTION BY ANTHOLOGY EDITOR, GREG \"The Blurred Line\"Publishers love categories, as do bookstores. They want a writer’s work to fit neatly into a specific genre. The motivation for this, of course, lies in commerce, as well as questionable (and outdated) notions about the consumer mind.But this can be an unfair burden, as writers are far less compartmentalized in their thinking. They strive to tell a story. To enlighten. To entertain. The genre in which the story falls is not nearly as important as the story itself. After all, how would one categorize \"A Clockwork Orange\"? Is it horror? Yes. Science Fiction? Yes. Literature? Yes. And yet I’ve never heard Anthony Burgess referred to as a “horror” writer or a “science fiction” writer.How about Cormac McCarthy? No one would ever deem him a “horror” writer, but then how does one categorize \"The Road\"? Is Robert Louis Stevenson a “horror” writer because he wrote \"The Strange Case of Dr. Jekyll and Mr. Hyde\"? Is George Orwell either a “horror” or “science fiction” writer in light of his two most famous works, \"1984\" and \"Animal Farm\"? Let’s face it, many of the novels we consider classics today simply transcend genre, in no small part due to the fact that they manage to mash more than one together, producing works that resonate in our imaginations. \"Slaughterhouse Five.\" \"Lord of the Flies.\" \"Fahrenheit 451.\" \"Deliverance.\" These stories all contain skin-prickling elements of horror; yet none are categorized as “horror” novels. If such works can fit into the horror mold, then it begs the What is literature?And to analyze the other side of the coin, what do we make of works that are unquestionably horror but clearly transcend the boundaries of genre? Is \"Something Wicked This Way Comes\" any less a piece of fine literature because it also happens to be a work of dread-inducing horror? How about \"The Haunting of Hill House,\" \"I Am Legend\" or \"The Shining.\" What of some of the masterfully macabre short stories of Harlan Ellison? Or the works of Poe and Lovecraft? Certainly anyone would categorize them as glorious works of literature, all of which happen to squarely fall into the genre of horror.\"The Burning Maiden\" was born of this conundrum. When is horror simply “horror” and when does it cross over into “literature”? What happens when writers of unparalleled talents put their minds (and writing chops) to telling stories of the supernatural, of the darkness in the human soul, of the sadness and longing that sometimes supersedes the grave—all the while telling stories with the hearts and souls of poets?Contributors to this anthology have been nominated for or awarded (to name a few) with the American Mystery Award, the British Fantasy Award, the Bram Stoker Award, the Horror C",
  "genres": [
    "Horror"
  ],
  "author": "Greg Kishbaugh",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/15988776-the-burning-maiden"
}