{
  "title": "DADspirations: The 1st 100 Days of Fatherhood. Tips for Parenting Every New Dad and Dad-to-Be Should Know.",
  "description": "DADspirations: The 1st 100 Days of Fatherhood. Tips for Parenting Every New Dad and Dad-to-Be Should Know. News/Awards—PEOPLE named it one of the hottest baby products on the market —PEOPLE selected it in their 2013 Father's Day Gift Guide—Selected as a Finalist in the Parenting & Family category in the 2013 National Indie Excellence Awards—Telly Award winner for the DADspirations Book TrailerA dad-to-be book that helps dads answer the tough questions—Do you know why the first months of parenthood are critical for a Dad-to-be or new father?—Do you want to be a new dad who is dependable, but still fun?—Are you a father to be who is anxious for, or unsure about, the arrival of your newborn?This dad-to-be book will help you:—Understand how having a plan can help you deal with the unknown—Develop a strategy that will make your first 100 days as positively impactful as possible —Recognize how effective of a dad you’re likely to be after your first 100 days as a new fatherThis father to be book includes an actionable checklist of ideas to help dads become the best father they can be at the most important time. Illustrated with photographs, this book for new dads showcases 35 ideas to help dads quickly succeed in fatherhood. Some of these ideas, referred to as DADspirations, include:—Develop a baby birth time capsule, which captures all of the precious moments from a day a parent is likely to forget. —Send a wife to the spa, which secures for dad an afternoon of introducing the art of football to the baby. —Build a toy box, which gives a dad the excuse to spend an entire day alone in the garage with power tools & beer.—Organize a GNO for a wife, which allows a dad an evening of personal snuggling with his newborn.This dad-to-be book also address common issues and challenges that a dad encounters while also ensures they can be effective at the most critical time of being a dad, including:—How to always remember your first few days with baby—How to bond quickly with your baby —How to avoid the baby blues —How to capture precious moments and baby’s firsts—How to shower your love towards mom and baby—How to keep the romance with mom fresh and lively—How to easily stay (or become) fit without leaving the house—How to plan for your baby’s future security —How to keep your wife smiling and baby engaged A gift idea for the dad-to-be!Humorist & Author, Pete Densmore: \"It’s exciting for DADspirations: The 1st 100 Days of Fatherhood to be honored with an award and listed as one of the hottest baby products,” said Densmore. \"It’s rewarding because this opens the door for more dads to read the book and inspire their own aspirations. This dad-to-be book provides a strategy that will give dads the important things to know and some fun, creative ideas they can for dad, mom and baby to make sure they become a Rock Star new dad, right out of the gates.”For more information on Pete Densmore or DADspirations: The 1st 100 Days of Fatherhood. Tips for Parenting Every New Dad and Dad to Be Should Know, please visit these websites:—Website: www.DADspirations.com—Book Trailer: http://youtu.be/CtIUWO27C0M—Facebook Page: www.facebook.com/DADspirations—Pinterest Page: www.pinterest.com/DADspirations—Twitter Page: www.twitter.com/DADspirations—Ordering Pages: o Paperback: http://www.amazon.com/dp/061566363Xo Kindle http://www.amazon.com/dp/B008U0MSHU",
  "genres": [
    "Parenting",
    "Self Help"
  ],
  "author": "Pete Densmore",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/15989036-dadspirations"
}