{
  "title": "The Ghosts of Hopewell: Setting the Record Straight in the Lindbergh Case",
  "description": "In this illustrated examination of the Lindbergh kidnapping case, Jim Fisher seeks to set the record straight regarding Bruno Hauptmann's guilt in \"the crime of the century.\" In February 1935, following a sensational, six-week trial, a jury in Flemington, New Jersey, found German carpenter Hauptmann guilty of kidnapping and murdering the twenty-month-old son of Charles and Anne Lindbergh. Although circumstantial, the evidence against Hauptmann—the handwriting on the ransom notes, the homemade kidnapping ladder, Colonel Lindbergh's money found in his garage, his matching the description of the man who accepted the ransom payoff in the Bronx cemetery, his inability to prove an alibi, and his incredible explanation of his possession of the ransom money—was overwhelming, leaving few to doubt his guilt. After a series of appeals and stays, Hauptmann died fourteen months later in the electric chair. A confession would have spared him the death sentence, but Hauptmann chose to die maintaining his innocence. It was not until the mid-1970s that revisionists began to challenge the conventional wisdom in the case: that Hauptmann was the lone killer. Revisionist books and articles appeared, as did plays, TV shows, and a movie, all portraying Hauptmann as the victim of a massive police and prosecution frame-up. At this point, the focus shifted from the evidence to the conduct of the police. By the 1980s, most people familiar with the case were convinced of Hauptmann's complete innocence. Many denied the murder, believing that the Lindbergh baby remained alive. Several men claimed to be the firstborn son of Charles and Anne Lindbergh, one of whom sued to claim his share of the Lindbergh estate after Charles Lindbergh's death in 1974. Another group held that the kidnapping was an elaborate hoax to cover up the murder of the baby by his parents. Anna Hauptmann¹s series of federal lawsuits against New Jersey and others in the mid-1980s fueled further interest in the case. Although Hauptmann's widow lost all of her lawsuits, she had won the hearts and minds of the American people before her death at the age of ninety-four. Former FBI agent Fisher discusses the hard evidence, such as the ransom notes and the wood of the kidnapping ladder. He analyzes and debunks the various revisionist theories and presents new evidence that, coupled with the undisputed facts, prove beyond a reasonable doubt that Hauptmann was guilty as charged: he kidnapped and murdered the infant son of Charles and Anne Lindbergh.",
  "genres": [
    "True Crime",
    "History",
    "Nonfiction"
  ],
  "author": "Jim Fisher",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/1061204.The_Ghosts_of_Hopewell"
}