{
  "title": "صور الوجود: السينما تتأمل",
  "description": "نبذة النيل والفرات:يقدم الروائي والشاعر والناقد الفلسطيني \"إبراهيم نصر الله\" الطبعة الثانية من كتابه \"صور الوجود: السينما تتأمل\" وهي طبعة مزيدة ومنقحة للطبعة الأولى التي كانت قد صدرت في نهاية العام 2007 ضمن سلسلة (آفاق السينما) فجاءت الطبعة الثانية (صور الوجود: السينما تتأمل) قراءة لثمانية أفلام أخرى ضمن هذا المحور أراد من خلالها الكاتب أن يبرز أهمية دور السينما في احتضان أسئلة الأدب، مدعومة بالتطور التكنولوجي، الذي جسدها أمام أعيننا بعبقرية فذة وهو يخرجها من الكلمات ومن الخيال برؤية فنية عالية وقدرة استثنائية على الربط بين مشروع السينما ومشروع الأدب في طرحهم وتأملهم لقضايا الحياة والموت، الوجود والعدم، الجريمة والعقاب، الحب والكراهية، الحرية والعبودية، الحقيقة والخيال، العدالة والظلم، في كل تلك الثنائيات التي أرقت البشر جاءت السينما لتفكر وترينا كيف تفكِّر، وتسأل وترينا مدى السؤال، وتجيب وترينا دم الإجابة وعبثيتها متكئة في ذلك على الأدب فيقول: إننا نعيش في تلك المنطقة من الحد الفاصل بين تلك الثنائيات فيتسرب طرفا تلك الثنائيات الواحد إلى الآخر ليخلق مساحة أخرى، هي \"المساحة الإنسانية\" التي يختبر بها البشر روحهم ويتأكدون من أرضيتهم ويعثرون على أخطائهم ومساحات تمردهم، علاقاتهم بأنفسهم وبالآخر، مع الواضح الذي يصبح مجهولاً كلما اتضح، ومع المجهول الذي كلما أوغل في غموضه لإثبات حقيقة حضوره أوجد مساحة أكثر اتساعاً تتصارع فيها هذه الثنائيات. يتضمن هذا الكتاب قراءة لمختارات من أفلام تشكل جزءاً من الفكر التأملي الذي يطرحه المؤلف في اختياره لقراءة هذه الأفلام فإلى \"فكرة الاختيار يذهب فيلم (أسطورة 1900) وهو بمثابة مديح مرٍّ لكل هذا التعدد الذي تلقيه الحياة أمامنا، طالبة منا أن نختار من كل البلاد بلداً واحداً! ومن بين كل النساء امرأة واحدة! ويغدو المكان أكثر اتساعاً كلما ضاق في هذا المنظور، وأكثر ضيقاً كلما اتسع، وتغدو الموسيقى قادرة بمفردها على احتضان كل العوالم، كما لو أن الذي يريد كل شيء لن يحصل على أي شيء فعلاً في النهاية، وكما لو أن الذي اختار شيئاً واحداً قد فقد كل شيء أيضاً. في فيلم (منصة الجمال) للمخرج ريتشارد إير تبدو معضلة الكائن كبيرة وهو يلعب الأدوار، دوراً بعد آخر في مسيرة حياته، بحيث يختلط (القناع بالوجه أو يتلاشى الوجه ويبقى القناع) لفرط ما التصق المطاط باللحم، ويمكن أن نرى ذلك في أفلام أخرى مثل (كاغيموشا) لكوروساوا و(أرض الخوف) لداوود عبد السيد. كما يمكن أن نتأمل المكان المثال في (الربيع) الصيف، الخريف، الشتاء والربيع أيضاً، و(ملقى بعيداً)، وتلك المساحة المُربكة ما بين تلك الفراديس وجحيمها، وتلك المقولة الملتبسة المنبثقة من لعنة الوجود في المكان الأمثل: (يوم لعين في الفردوس أم يوم جميل في الجحيم؟) أو بين (اجتماعية الفرد وفردية المجتمع) وتلك القدرة الفائقة التي يبديها المجموع للتخفّف بسهولة من أي كائن، بمجرد أن يتوارى، لا تحت التراب فقط، بل عن العين أيضاً (...) كما يمكن أن نتأمل (العهد) الذي يقطعه الكائن على نفسه لكي يصل بهذه النفس إلى توازنها، ولكنه لفرط اندفاعه يتحول إلى نقيض لذاته ويغدو العثور على نجاته هو هلاكه المُحتّم. كما يمكن أن نتأمل تلك المسافة الملتبسة بين الجريمة والعقاب، بين المجرم والبريء وبحيث القوة المطلقة بالمصائر، وفكرة العدالة عن ذاتها وتلك الأسئلة الحارقة التي تبزغ أمامنا ونحن نرى الذين يستحقون الحياة يموتون وأعداءها يعيشون لينعموا بانتصارات لا حدود لها. يمكن أن نتأمل آلية البشر أمام إنسانية الآلة، وذلك الجنون الذي يقود إلى دمار ينتظر العالم على عتبات اليوم التالي. وتلك المسافة الفاصلة بين واقعية الخيال وخيالية الواقع أو بين جدوى الخيال ولا جدوى الحقيقة. كما يمكن أن نتأمل في النهاية تلك المعضلة الشائكة: حيث لا بد من الجنّة الآن، بعد أن تحولت الأرض إلى جحيم\". أسئلة كثيرة تؤرق هذه التأملات برأي الكاتب، وهو يبحث عن أفلام عربية تذهب لتتأمل هذه القضايا، حيث الشح الشديد في الأفلام العربية التي تتناول قضايا جادة تعكس هذه الثنائيات والمتناقضات التي يحياها الإنسان العربي. كتاب أكثر من رائع، قراءة لعدة أفلام عالمية يبين من خلالها الكاتب كيف تأملت السينما الوجود البشري وأسئلته على هذه الأرض؟ وكيف استطاعت التعبير عن أزمات هذا الوجود وهي تفتح أفقاً جديداً وواسعاً يؤاخي بين شرعية السؤال وحيرة الإجابة، الإجابة التي ما تلبث أن تتحول إلى سؤال.. وهكذا؟!",
  "genres": [
    "Nonfiction",
    "Film"
  ],
  "author": "Ibrahim Nasrallah",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/10073972"
}