{
  "title": "Kings of Infinite Space",
  "description": "See alternate cover edition hereI open the door to the corridor and check that it is clear before crossing to and into the room opposite. Immediately blood and wizardry hammer my senses making me dizzy with lust and need. Starvation has brought my vampire very close to the surface. Somehow I maintain a desperate, tenuous grasp on my humanity and force my mind to calm down.My whole self is focused on the new-born who fills my ears with screams of complaint and fear. He is still covered with his amniotic fluid but his white patches are clearly visible, violating the black purity that he is otherwise. His eyes are tight shut and will remain so for many days, but they will be blue like the sea. What threatens to overwhelm me, though, is the intensity of his blood. Already he is a stronger wizard than most wizards ever become and his blood is correspondingly rich — so rich that the baby does not look like a baby to me.It looks like food. Blood. Power. Life.Many millennia ago, the gods created the great ringworld OhLo, but the Dancer twisted their divine design to her own ends. When the Oracle told the emperor that the Dancer held the key to the destruction of OhLo, he uprooted his empire and has since driven it relentlessly in pursuit of her. To find the Dancer, he must find the place she seeks - the mythical city of Alina Meridon.For over a thousand years the empire has moved slowly westward, crushing civilizations in its path. Its next step, inevitably, will be to cross the great barrier range of the Mountains of the East, and descend to ravage the lands of the Crimson Goddess. The Crimson Order and its allies are determined to stop the emperor's advance.On the eve of war, the outcast wizard Witternig returns to his homeland in search of his mother. His friend Meliyne sets out to stop him, but her ship is destroyed and she is washed up on a distant shore. Taran, a court wizard, is jailed for blinding the princess he loves. And Tara, valiant Daughter of Hope, watches the forests at night for the beautiful vampire Hrana.With powerful gods and wizards on both sides, nothing is certain except conflict, and now that the Dancer herself has come out of hiding, the very existence of OhLo is at stake.",
  "genres": [],
  "author": "Francis James Franklin",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/15992321-kings-of-infinite-space"
}