{
  "title": "Portsmouth A Love Story",
  "description": "Portsmouth A Love Story delivers a robust and transcendent love story as well as the metaphysical message that mystical forces can guide readers to their destiny even when the landscape looks barren and bleak. Severine Champagne, a professional business woman who moves to the historic city of Portsmouth, New Hampshire, where she finds that messages from beyond lead her into a complex romantic relationship with Peter Nicholas, a Greek real estate developer with a secret past. Peter must wrestle with his own fears and experiences with the spirit world before he is able to accept the gift of real love that was waiting for him all along. For Severine, Spirit had always been there to protect and guide her from an abusive childhood into a happy adult life until one day, she is guided in a direction that turns out to be one of the most painful but enlightening journeys of her life. She starts to question her faith and her own intuitive guidance until she learns that life and love sometimes take many unexpected twists and turns. Portsmouth A Love Story takes the reader on a journey through the main streets and back doors of New Hampshire's historic seacoast both past and present. Meet the real ghost of Hannah at the Three Chimneys Inn in Durham. Attend the Portsmouth Jazz Festival at Prescott Park and walk on the beautiful beach at Wallis Sands. For our last stop, climb aboard for a boat ride down the Piscataqua River and visit Star Island and Gosport Chapel at the Isles of Shoals. You're sure to fall in love with Portsmouth too!Portsmouth A Love Story is about falling in love in Portsmouth and falling in love with Portsmouth. \"Whenever I tell someone that I live in Portsmouth, New Hampshire, I get the same response, 'I LOVE Portsmouth!' It's never 'I Like Portsmouth,' or 'Oh yes...good place to visit.' People always use the word LOVE. Over the years, many authors have written about the mystique of Portsmouth. It's a city I love and I know you will too once you read my novel Portsmouth A Love Story.\" - R. Ann RousseauABOUT THE AUTHORR.Ann Rousseau is a business consultant, writer and blog owner. She lives with her family in the beautiful city of Portsmouth, New Hampshire. She is currently working on the sequel to her debut novel Portsmouth A Love Story.Facebook: Portsmouth a Love StoryFacebook: R. Ann RousseauTwitter: @PortsmoutALoveTwitter: @RAnnRousseauBook Cover Photo by Sharon SeawardAvailable in Trade paperback and ebook: Amazon(paperback and ebook), Barnes and Noble (paperback and ebook), Smashwords (all ebook formats)",
  "genres": [],
  "author": "R. Ann Rousseau",
  "average_rating": "3.29",
  "url": "https://www.goodreads.com/book/show/15994171-portsmouth-a-love-story"
}