{
  "title": "Crossing Mother's Grave",
  "description": "About the book:Popalia and her protectors may have escaped the Regulator’s fortress, but not without consequences. Tensions worsen within the priestess’s group. Despite her gangs reproach, stubborn Popalia is determined to recover the holy artifact from the thieves who’d stolen it. Further along this stretch of road is one of the responsible thieves, and she hides within a merchant’s caravan less than a day ahead. By catching that thief, Popalia believes a bargain could be made for their lives, as well as secure the next link in recovering her church’s priceless relic.Not far behind, and pursuing the outlaw priestess is Commandant Saviid Benning, who rages, “Damn her church, I want that priestess’s head – the crows can eat her remains.” The head-hunting party is closing in for the kill. Popalia is pinched between the hunters giving chase, and the fortress at Faradell Pass—gated, walled, and housing half a platoon of formidable soldiers.Popalia’s group, hungry to split up and make the run for their lives, stumble upon the merchant’s caravan—looted and abandoned in the middle of the road. Out-running the blood-bounty behind them, and hoping for a miracle to get around the soldiers waiting atop the summit—preparing a reckless rescue mission wasn’t fitting anyone’s plans.Excerpt:Raenyl moved steadily on soundless feet. The tightness of the cavern was intensified by the radius of his torchlight. He hated the damn torch, and this damn cave. If anything waited in the shadow at the end of his light, his silence would be pointless. “Damn this stupidity,” he muttered under his breath.He travelled beyond the bend maybe seventy, or a hundred paces, when his thoughts struck him. Why hadn’t they ditched the stupid and annoying priestess? The two of them should have split as soon as they saw the empty caravan. Good luck priestess, but we got to go, but here he was––down in this rotten cave––looking for dead people.Arguing with himself, he knew exactly why he was here. The priestess manipulated all of them into this shit-deal. They had good reason to run for their lives. The Regulators would come for them. You can’t burn down a military base without retaliation. It was like smacking a bee hive with a stick, someone would get stung.Raenyl looked deep within himself. Shaking his head he knew Seth was right. Deep down, he knew if only one survivor from that caravan was down here, and they just walked away...No, that weight would be far too heavy to carry. Even if his last day came soon, thoughts like that would haunt him until his final sunset. Conscience dragged him here. Popalia only fanned the flames.Conscience did not stand alone; there was also the terrible seed of hope. Once again, the fault lay at Popalia’s feet. Curse her and her feeble hope. The variable promises of ‘what if’ rattled in his mind. Seth made it clear what if also bounced around in his own skull. What if Katia was still alive? What if Popalia’s church could free them from their death sentence? What if crawling in this damn cave could alter their inevitable fates?",
  "genres": [
    "Fantasy"
  ],
  "author": "Jake  Elliot",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/15996897-crossing-mother-s-grave"
}