{
  "title": "Trauma Junkie",
  "description": "What happens when a suicidal paramedic falls in love with an ambulance chasing reporter?Brian is going through a rough patch in his life. His wife, Amber, has divorced him and is remarrying a rich wall streethedge fund manager. His boss hates him, his partner tolerates him, and he likes to stand on the ledge ten storiesup, bottle in hand.Four years ago his infant son passed away in his crib sending his life into a tail spin.All he has left is saving lives, and saving them on his terms. That's not enough.Enter Brooklyn, a fiery red headed stringer, who works the overnight selling video and stills to the New York media andshe's had a long standing crush on Brian.She's out to prove that a paramedic isn't the only one who can save a life.Excerpt: Three Alarm Fire in Brooklyn.Brian looked up as he and Mel moved up Garfield with their stretcher, lifting it over fat tan hoses as they did. Another ladder was moving into place along with two others. The hose attachments on the ladders were raining thousands of gallons water down on the top of the building. At street level, teams of firemen in twos and threes assaulted the flames spewing out the windows with hoses stiff with tremendous water pressure. Standing behind them on the other side of the yellow tape were several people in a crowd, some of them in robes and pajamas. Men, women and children - whole families were huddling together. Some were crying hysterically, others were in shock. Husbands wrapped their arms around wives and tried to comfort them. Mothers picked up small children, who pointed innocently at the burning building. Some panicked, pacing back and forth. Others stood numb with shock, their faces a bright orange illuminated by the flames.Then, Brian saw Brooklyn in the center of it all - her video camera aimed at the flames of the building. She was capturing the entire scene in small newsworthy bites from her side of the yellow tape. She moved from one point to the next with amazing agility, slipping in and out of the crowd and capturing them as well.From the entrance door, a fireman burst through the grey black smoke carrying something limp across his shoulder — something light in color, a human sized ragdoll covered with black sludge. It was a young woman, possibly 15 or 16. Reggie and Carlos turned their stretcher toward the charging fireman like a catcher's mitt. Each planted one foot on the bottom rail to counter the incoming impact. The fireman laid the woman down on the stretcher at full forward speed, forcing them to recoil. Then he yanked his Scott Air Pack mask off of her face. The fireman coughed, bent over, and then coughed some more.Mel ran to the fireman placing an oxygen mask over his nose and mouth. He sucked in deeply a couple of times and then waved her off and continued coughing.Reggie listened for a breath at the girl's mouth and finding it, though shallow, quickly cut open the young girl's Twilight: Breaking Dawn nightshirt and placed his stethoscope above her heart. The fireman coughed up some more sludge and took another deep breath from Mel's mask.\"Yo, Carlos, get a tube in her. She’s breathing shallow, and she's tachycardic!\" He felt her wrist.\"Fast and thready. She's crashing!\"Carlos was already on it, but seemed to be having trouble getting the tube in.\"Yo, Brian, give me some cric pressure! I can't get the tube!\" Carlos yelled over the roar of the chaos.Brian gently pressed down on the young woman's Adam's apple, moving her larynx into place for the intubation tube. He looked at her fingernails; they were cherry red.\"Carlos, look at her fingernails.\"\"Smoke inhalation, Yo. I'm in!\"Carlos taped down the tube, attached the oxygen, and turned it up above the usual flow of 12 LPS to 16.\"She ain't gonna make it,\" Carlos said.\"Don't say that, Carlos! Don't ever fucking say that!\"\"Yo, I'm just sayin'.\"\"Yeah, I know what you're saying, but you can't think that way.\"\"Head's up, Brian!\" Mel shouted.Brian looked up to see another fireman running toward them. This one was carrying a small child cradled in his arms, it's face swallowed by his Scott mask. Brian and Mel turned the stretcher toward the fireman to catch their patient. It was a small girl, perhaps four years old, in a nightgown. Black streaks scattered across the white cotton material. She wasn't breathing. Brian felt for a pulse; there was none. He listened for a heartbeat and found none as well. Mel blew two quick breaths into the child's mouth and hooked up the monitor to the child's chest. It read asystolic. Brian looked into her wide open eyes, and there was nothing there.\"Brian?\"\"Begin CPR.\"\"Brian, she's gone.\"\"BEGIN CPR!\"Brian moved toward her to begin compressions. He felt a strong hand grab him from behind, but in a gentle way. It was Reggie.A woman in a nightgown burst across the line followed by a man in pajamas.\"Oh nooooo! Anna!\" She cradled the head of the young girl. \"HELP HER!\"\"Brian, she's flat in two leads. She's gone,\" Reggie said softly.\"You can't think like that…\"Brian’s world began to move in blurry single frame still shots.\"Come on, man. You know it.\"\"Reggie! We got to go!\" Carlos screamed.Reggie looked at Mel; she nodded.\"What are you people doing?! Do something! Why isn’t anyone helping her?!”Her husband tried to settle her by wrapping his arms around her from behind. She struggled, trying to get loose. Two police officers moved in their direction.Like a robot, Brian turned to her.\"I'm sorry for your loss.\"\"You son of a bitch! You let my baby die! My Anna!\"\"Ma'am there was nothing...\"\"You killed her! You! You let her die!\"The woman collapsed to the wet pavement, sobbing.The flames were dying out under the relentless flooding of the three ladder hoses. No one else came out of the building. Brian looked around; everyone seemed to be looking at him standing next to the mother on the pavement and her husband with his arms wrapped around her. She was sobbing, repeating over and over:\"You let her die... You let her... die\"Brian watched as two coroners from the Medical Examiner's office gently lifted the child’s limp body onto their stretcher, place it into the waiting body bag and then zip it up. They said nothing as they did so. The woman watched as they did. Finally, one of them walked over to the woman and her husband. Brian remembered the coroner by his face. He had been the one from the train tracks in East New York months ago who had cracked the joke about “how he could use a little head tonight.” He spoke gently to Anna's father.\"Are you the next of kin?\"The man nodded.\"We're taking your daughter to Methodist Hospital. They are going to need to do an autopsy. I'm very sorry for your loss.\"The man nodded.Amber and Beth were kneeling down next to the woman. Amber looked up as Brian and Mel started back toward their ambulance. She exchanged a look with Beth, who nodded. Amber stood up and quickly followed Brian.In that moment, when he turned around, she saw it in his eyes. It was returning with all its fury. Brian was sliding backwards into that place he had clawed his way out of only a short time ago when he had begun seeing Brooklyn.Call it God, the universe, or fate, but whatever forces that moved the events around them had spat out a curse on these people with cruel randomness as it had on Brian and Amber almost three years ago.Anna's mother didn't know it, but Brian had bonded with her, anchored himself to her the instant she realized that her daughter had passed away. Amber could see him slipping away as he had back then, and there wasn't a single thing she could do about it. She knew, too, the fate of Anna's parents: the sleepless nights, the fights, and the placement of blame that had no rightful place. She wondered where they would be in a year - two - or four? Would they be together or like them, leading separate lives as two broken halves? She feared for them and for Brian, who was fading before her eyes in that very moment.\"Hey,” she started for she felt she had to saysomething.\"You know she didn't mean that. What she said. She's in shock.\"\"I know.\"\"You sure?\"\"Yeah.\"He was sure. He knew the steps: the shock, the anger, the bargaining, the time before the acceptance, the final phase when the real grief set in.Right now, at this very moment, Anna's mother was making a deal with God to do whatever it took to bring her back. Standing on the outside, he knew from experience that it would do no good, but she had to try. That's just what people did. Logically, he knew that she was in shock, but the logic did him no good. This was not a logical time.\"You okay?\"\"I think I'm pretty fuckin' far from okay.\"",
  "genres": [
    "Fiction",
    "Romance",
    "Contemporary Romance",
    "Contemporary"
  ],
  "author": "Tom Hobbs",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/15996836-trauma-junkie"
}