{
  "title": "Brazil",
  "description": "This is book seven of an eighty part series. ***Books one through five are currently available individually and in a complete collection***Morgan Holland is a beautiful, young, waitress who has struggled to find her way in life. Unlucky in love and unsure about her future, she has a chance meeting with someone who offers to change her life. In book seven, we follow Morgan as she ventures into Rio de Janeiro , Brazil to meet Giovani Mateus. He's sexy and he knows it. Will Morgan bring him back to reality? Enjoy an except:Angel left the room with the bird, saying that he had to get things ready for the night, and that left the two of them leaning against the large kitchen island. Gio bent forward and put his elbow on the marble top, and rested his chin on his fist.“My girl, if you keep looking at me like that then I'm afraid we'll never make it out of here tonight.” He scanned her body with approval as he spoke.Morgan bent forward and mirrored his position. “Considering the consequences, I hardly see that as a threat.” They stared at one another in silence before Angel bellowed from the second floor.“Are the two of you going to get ready, or should I stay up here while you play hide-the-Brazilian-nuts on my clean counter?!” *****Special Note to readers*****Morgan is a high-end call girl. Her clients are gorgeous, wealthy and they know how to please a woman. This contains hot, super hot, boiling lava hot, scenes! Here's what's not going to happen: They gazed at each other longingly, desire filling them to the core. She blushed and offered her hand to his. With her head hung low, the two retreated to the bedroom for some adult time. Here's what will happen: Oh, just kidding, I can't write that here! What are you waiting for??? Click the button and follow Morgan as she goes around the world in 80 men.This is a novella, with a word count over 26,000. Enjoy!",
  "genres": [
    "Erotica"
  ],
  "author": "Brandi Ratliff",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/15996951-brazil"
}