{
  "title": "Hawaii",
  "description": "This is book six of an eighty part series. ***Books one through five are currently available individually and in a complete collection***Morgan Holland is a beautiful, young, waitress who has struggled to find her way in life. Unlucky in love and unsure about her future, she has a chance meeting with someone who offers to change her life. The young woman finds her next client in the wonderful city of Waikiki, Hawaii, where she meets the sweetest man she has ever met. Morgan discovers Kole has a little problem, but don't worry, the problem is the only thing that's little about our Kole. Enjoy an except:His smile started to twitch at the corners of his mouth, then grew wider before he spoke. “Does that mean you'll get naked with me when you come back?” He squeezed her ankle when she tried to kick him. She laughed out loud and put her head against the seat.“When I was a kid, I didn't have enough money to go to the local fair...so, I crawled under the fence. Once I was inside, I ran into a girl from school who was leaving and she gave me her wrist band, you know, the thing you get when you pay and it lets you get on the rides all day. Anyway, I put that wrist band on and ran straight to the Ferris wheel ...which by the way, was my favorite ride. I tell ya, I must have rode that darn thing at least twenty times that day.” She smiled, trying to stop her laughter at the memory. “So, if you can imagine that day then try to imagine this..” she scooted forward and put her chin on his shoulder, “I plan to ride you more than that Ferris wheel.” She kissed his bare shoulder, then leaned back against the door.*****Special Note to readers*****Morgan is a high-end call girl. Her clients are gorgeous, wealthy and they know how to please a woman. This contains hot, super hot, boiling lava hot, scenes! Here's what's not going to happen: They gazed at each other longingly, desire filling them to the core. She blushed and offered her hand to his. With her head hung low, the two retreated to the bedroom for some adult time. Here's what will happen: Oh, just kidding, I can't write that here! What are you waiting for??? Click the button and follow Morgan as she goes around the world in 80 men.This is a novella, with a word count just shy of 29,000. Enjoy!",
  "genres": [
    "Erotica"
  ],
  "author": "Brandi Ratliff",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/15996948-hawaii"
}