{
  "title": "Ireland",
  "description": "This is book five of an eighty part series. Morgan Holland is a beautiful, young, waitress who has struggled to find her way in life. Unlucky in love and unsure about her future, she has a chance meeting with someone who offers to change her life. Morgan meets Sean Burke, a gorgeous carefree man that teaches her what the finer things in life really are. He also happens to be the best friend of...you guessed it...Finlay Campbell. What kind of drama did Morgan just unleash upon Ireland? Find out, as Morgan goes around the world in 80 men. Excerpt:“Ah, here we are.” Sean pulled the wooden door open in front of her, and Morgan walked in. She felt a very large hand rub gently across her ass as she passed him.She kept walking but turned her head for him to hear her, “do that again, and you'll be finding a nice little alley for us to play in.” Her walking came to an abrupt end when Sean's arm came around her waist from behind.“ Turn around, love.” He directed her back toward the door. When she turned again to look up at him, his face made his intentions clear, he was going to find them an alley.Morgan giggled, “are you serious?” She kept her voice low, but made sure that he heard her.*****Special Note to readers*****Morgan is a high-end call girl. Her clients are gorgeous, wealthy and they know how to please a woman. This contains hot, super hot, boiling lava hot, scenes! Here's what's not going to happen: They gazed at each other longingly, desire filling them to the core. She blushed and offered her hand to his. With her head hung low, the two retreated to the bedroom for some adult time. Here's what will happen: Oh, just kidding, I can't write that here! What are you waiting for??? Click the button and follow Morgan as she goes around the world in 80 men.This is a novella, with a word count just shy of 26,000. Enjoy!",
  "genres": [
    "Erotica",
    "Short Stories"
  ],
  "author": "Brandi Ratliff",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/15996936-ireland"
}