{
  "title": "Medieval Underpants and Other Blunders: A Writer's (and Editor's) Guide to Keeping Historical Fiction Free of Common Anachronisms, Errors, and Myths",
  "description": "this is not a book on how to write historical fiction. It is a book on how not to write historical fiction.If you love history and you’re hard at work on your first historical novel, but you’re wondering if your medieval Irishmen would live on potatoes, if your 17th-century pirate would use a revolver, or if your hero would be able to offer Marie-Antoinette a box of chocolate bonbons...(The answer to all these is “Absolutely not!”)...then Medieval Underpants and Other Blunders is the book for you.Medieval Underpants will guide you through the factual mistakes that writers of historical fiction—-both beginners and professionals—-most often make, and show you how to avoid them. From fictional characters crossing streets that wouldn’t exist for another sixty years, to the pitfalls of the Columbian Exchange (when plants and foods native to the Americas first began to appear in Europe, Asia, and Africa, and vice versa), to 1990s slang in the mouths of 1940s characters, Susanne Alleyn exposes the often hilarious, always painful goofs that turn up most frequently in fiction set in the past.Alleyn stresses the hazards to writers of assuming too much about details of life in past centuries, providing numerous examples of mistakes that could easily have been avoided. She also explores commonly-confused topics such as the important difference between the British titles “Lord John Smith” and “John, Lord Smith” and why they’re not interchangeable, and provides simple guidelines for getting them right. In a wide assortment of chapters including Food and Plants; Travel; Dialogue, Expressions, and Slang; Guns; Money; and, of course, Underpants, she offers tips on how to avoid errors and anachronisms while continually reminding writers of the necessity of meticulous historical research.",
  "genres": [
    "Nonfiction",
    "History",
    "Writing",
    "Reference",
    "Research",
    "Historical",
    "Medieval"
  ],
  "author": "Susanne Alleyn",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/15997779-medieval-underpants-and-other-blunders"
}