{
  "title": "Duel with the Devil: The True Story of How Alexander Hamilton and Aaron Burr Teamed Up to Take on America's First Sensational Murder Mystery",
  "description": "Duel with the Devil is acclaimed historian Paul Collins’ remarkable true account of a stunning turn-of-the-19th century murder and the trial that ensued – a showdown in which iconic political rivals Alexander Hamilton and Aaron Burr joined forces to make sure justice was done. Still our nation’s longest running “cold case,” the mystery of Elma Sands finally comes to a close with this book, which delivers the first substantial break in the case in over 200 years.In the closing days of 1799, the United States was still a young republic. Waging a fierce battle for its uncertain future were two political parties: the well-moneyed Federalists, led by Alexander Hamilton, and the populist Republicans, led by Aaron Burr. The two finest lawyers in New York, Burr and Hamilton were bitter rivals both in and out of the courtroom, and as the next election approached—with Manhattan likely to be the swing district on which the presidency would hinge—their animosity reached a crescendo. Central to their dispute was the Manhattan water supply, which Burr saw not just as an opportunity to help a city devastated by epidemics but as a chance to heal his battered finances.But everything changed when Elma Sands, a beautiful young Quaker woman, was found dead in Burr's newly constructed Manhattan Well. The horrific crime quickly gripped the nation, and before long accusations settled on one of Elma’s suitors, handsome young carpenter Levi Weeks. As the enraged city demanded a noose be draped around the accused murderer’s neck, the only question seemed to be whether Levi would make it to trial or be lynched first.The young man’s only hope was to hire a legal dream team. And thus it was that New York’s most bitter political rivals and greatest attorneys did the unthinkable—they teamed up.At once an absorbing legal thriller and an expertly crafted portrait of the United States in the time of the Founding Fathers, Duel with the Devil is a masterpiece of narrative nonfiction.",
  "genres": [
    "History",
    "Nonfiction",
    "True Crime",
    "Mystery",
    "American History",
    "Crime",
    "Biography"
  ],
  "author": "Paul  Collins",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/15998328-duel-with-the-devil"
}