{
  "title": "The Doll",
  "description": "“A heroine every bit as provocative as Stieg Larsson’s Lisbeth Salander.” –The Dallas Morning News    Haunted by a life of violence and as proficient with languages as she is with knives, Vanessa Michael Munroe, chameleon and hunter, has built her life on a reputation for getting things done—dangerous and often not-quite-legal things. Born to missionary parents in lawless Africa, taken under the tutelage of gunrunners, and tortured by one of the jungle’s most brutal men, Munroe was forced to do whatever it took to stay alive.   The ability to survive, fight, adapt, and blend has since taken her across the globe on behalf of corporations, heads of state, and the few private clients who can afford her unique brand of expertise, and these abilities have made her enemies.    On a busy Dallas street, Munroe is kidnapped by an unseen opponent and thrust into an underground world where women and girls are merchandise and a shadowy figure known as The Doll Maker controls her every move. While trusted friends race to unravel where she is and why she was taken, everything pivots on one simple choice: Munroe must use her unique set of skills to deliver a high-profile young woman into the same nightmare that she once endured, or condemn to torture and certain death the one person she loves above all else.   Driven by the violence that has made her what she is, cut off from help, and with attempts to escape predicted and prevented, Munroe will hunt for openings, for solutions, and a way to strike back at a man who holds all the cards. Because only one thing is certain: she cannot save everyone.    In this high-octane thriller for fans of Lee Child, Stieg Larsson, and Robert Ludlum's Bourne trilogy, Vanessa Michael Munroe will have to fight fast, smart and furiously to overcome a dangerous nemesis and deliver her trademark brand of justice.",
  "genres": [
    "Thriller",
    "Mystery",
    "Fiction",
    "Suspense",
    "Mystery Thriller",
    "Audiobook",
    "Crime"
  ],
  "author": "Taylor Stevens",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/15998316-the-doll"
}