{
  "title": "Enchantments: A novel of Rasputin's daughter and the Romanovs",
  "description": "A NEW YORK TIMES NOTABLE BOOK“Part love story, part history, this novel is a tour de force [told] in language that soars and sears.”—More  St. Petersburg, 1917. After Rasputin’s body is pulled from the icy waters of the Neva River, his eighteen-year-old daughter, Masha, is sent to live at the imperial palace with Tsar Nikolay and his family. Desperately hoping that Masha has inherited Rasputin’s healing powers, Tsarina Alexandra asks her to tend to her son, the headstrong prince Alyosha, who suffers from hemophilia. Soon after Masha arrives at the palace, the tsar is forced to abdicate, and the Bolsheviks place the royal family under house arrest. As Russia descends into civil war, Masha and Alyosha find solace in each other’s company. To escape the confinement of the palace, and to distract the prince from the pain she cannot heal, Masha tells him stories—some embellished and others entirely imagined—about Nikolay and Alexandra’s courtship, Rasputin’s exploits, and their wild and wonderful country, now on the brink of an irrevocable transformation. In the worlds of their imagination, the weak become strong, legend becomes fact, and a future that will never come to pass feels close at hand.  Praise for \nEnchantments\n\n“A sumptuous, atmospheric account of the last days of the Romanovs from the perspective of Rasputin’s daughter, [told] with the sensuous, transporting prose that is Kathryn Harrison’s trademark.”—Jennifer Egan   “[A] splendid and surprising book . . . Harrison has given us something enduring.”—The New York Times Book Review  “[Harrison delivers] this oft-told moment with shocking freshness. . . . Masha re-invents our ideas of Rasputin, and the world of Nicholas and Alexandra is imbued with a glow whose fierceness is governed by the imminence of its loss.”—Los Angeles Times  “A mesmerizing novel.”—O: The Oprah Magazine   “Bewitching . . . Harrison sets historic facts like jewels in this intricately fashioned work of exalted empathy and imagination, a literary Fabergé egg. . . . [A] dazzling return to historical fiction.”—Booklist (starred review)Look for special features inside. Join the Random House Reader’s Circle for author chats and more.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Russia",
    "Historical",
    "Romanovs",
    "Romance",
    "Adult"
  ],
  "author": "Kathryn Harrison",
  "average_rating": "3.20",
  "url": "https://www.goodreads.com/book/show/15998347-enchantments"
}