{
  "title": "What Soldiers Do: Sex and the American GI in World War II France",
  "description": "How do you convince men to charge across heavily mined beaches into deadly machine-gun fire? Do you appeal to their bonds with their fellow soldiers, their patriotism, their desire to end tyranny and mass murder? Certainly—but if you’re the US Army in 1944, you also try another tack: you dangle the lure of beautiful French women, waiting just on the other side of the wire, ready to reward their liberators in oh so many ways.That’s not the picture of the Greatest Generation that we’ve been given, but it’s the one Mary Louise Roberts paints to devastating effect in What Soldiers Do. Drawing on an incredible range of sources, including news reports, propaganda and training materials, official planning documents, wartime diaries, and memoirs, Roberts tells the fascinating and troubling story of how the US military command systematically spread—and then exploited—the myth of French women as sexually experienced and available. The resulting chaos—ranging from flagrant public sex with prostitutes to outright rape and rampant venereal disease—horrified the war-weary and demoralized French population. The sexual predation, and the blithe response of the American military leadership, also caused serious friction between the two nations just as they were attempting to settle questions of long-term control over the liberated territories and the restoration of French sovereignty. While never denying the achievement of D-Day, or the bravery of the soldiers who took part, What Soldiers Do reminds us that history is always more useful—and more interesting—when it is most honest, and when it goes beyond the burnished beauty of nostalgia to grapple with the real lives and real mistakes of the people who lived it.",
  "genres": [
    "History",
    "Nonfiction",
    "World War II",
    "War",
    "Gender",
    "American History",
    "France"
  ],
  "author": "Mary Louise Roberts",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/15999534-what-soldiers-do"
}