{
  "title": "Dressing the Queen: The Jubilee Wardrobe",
  "description": "Under grey skies, more than one million people gathered for the Thames River Pageant of the 2012 Diamond Jubilee. Huddled under a sea of umbrellas, some had even spent the night there to secure prime seats. But the wait proved worthwhile. As the parade passed, there atop the splendid Spirit of Chartwell stood the Queen, resplendent against the wind and rain in a smart crystal encrusted white coat and pashmina shawl. The effect was one of breathtaking beauty, and it struck just the right note with the rain-dampened crowd, reinforcing Britain as a noble maritime nation. Dressing the Queen reveals the careful planning and preparation that went into the Queen’s wardrobe for the Diamond Jubilee, the first such celebration since that of Queen Victoria in 1897 and made all the more momentous by London’s hosting of the 2012 Olympics. The secret to the Queen’s unfailing style is royal couturier Angela Kelly, whose team of dressmakers and milliners spent two years designing and bringing to fruition the creations seen in the events leading up to and during the Diamond Jubilee, as well as at the Olympics. In addition to presenting the right image, the Queen’s clothing must address a great many practical concerns—and all of her garments must be pristinely maintained. Of course, no outfit is complete without the perfect hat, and a chapter of the book is devoted entirely to their intricate and highly detailed creation. Whether the day holds a historic state visit or an afternoon at Royal Ascot, the Queen commands attention wherever she appears. If you’ve ever wondered how she maintains such impeccable personal style, this well-illustrated book will answer that question and many more.",
  "genres": [
    "Nonfiction",
    "Fashion",
    "Biography",
    "History",
    "British Literature",
    "Art",
    "Photography"
  ],
  "author": "Angela   Kelly",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/16000036-dressing-the-queen"
}