{
  "title": "The Saga of Hrolf Kraki",
  "description": "The Saga of Hrolf Kraki and his Champions is notable particularly for its links with the Old English poem Beowulf, and it shows the close links between Anglo Saxon mythology and legend and those of the Vikings. Characters and locations are common to both the saga, a late work of the fourteenth century Icelandic literary tradition, and the poem, whose manuscript dates from the eleventh century (although it is said to have been composed in the seventh century). Both are set in Denmark and Sweden, c. 500 AD. The Hrolf of the saga is identical to the Hrothulf of the poem; the saga’s Hroar is the poem’s Hrothgar. Although there is no Beowulf in the saga, he has a counterpart in Bodvar Bjarki, a bear-like warrior who rescues the Danish king’s hall from a monster.  However, it is also a distinct work in its own right, the culmination of a storytelling tradition, no doubt mainly in oral form, which also appears in earlier writings such as the Danish historical works of writers such as Saxo Grammaticus and Sven Aggesen. Central to the saga are the exploits of the champions of the Danish king Hrolf Kraki, a group of heroes who, like King Arthur’s knights and Charlemagne’s paladins, who come to outshine their liege lord, who sometimes seems an oddly mild mannered ruler. Villain of the piece is Adils, king of Sweden, comparable to the Sherriff of Nottingham in his wickedness, his theft of Hrolf’s patrimony and his attempt to murder the king on his visit to the Swedish capital at Uppsala. Both this conflict and that which leads to Hrolf’s downfall, the battle of Skuld, have their origins in the sins of Hrolf’s father, Helgi, brother of Hroar (Beowulf’s Hrothgar), a warrior in the Viking mould who rapes queens, unwittingly marries his own daughter, and later sleeps with an elf woman, whose daughter—Hrolf’s half-sister—brings about the downfall of the kingdom.  As well as the magic and the mayhem of the saga, its author includes other touches. At several times characters from humble beginnings are seen triumphing over more powerful men, including the cowardly Hott, who Bodvar Bjarki, himself the son of a peasant, transforms into a fearless warrior. Another strand is the contemporary (14th century) Christian interpretation of heathen tradition; berserks are portrayed as ogre-like bullies, mainly there to be defeated by heroes; King Adils’ paganism is another mark against him; and finally we are told that King Hrolf did not worship Odin—he even renounces the pagan god’s gifts when he meets him in disguise—and that his only fault was that he did not know of his Creator.  It is a work of many strands, in some ways episodic, mixing pagan antiquity with Christian theology, heroism and cowardice, monsters and witches and villains. It is no surprise that in more recent times the saga has provided an inspiration to fantasy writers such as JRR Tolkien and Poul Andersen.",
  "genres": [],
  "author": "Anonymous",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/16002475-the-saga-of-hrolf-kraki"
}