{
  "title": "Gangs, Illegals, and a Rose Tattoo",
  "description": "It's double the trouble, with tons more suspense, and steaming with lots of romance. The second novel in the Lilly M. Mystery series proves that Lilly Millenovanovich gets things done in the most entertaining, exciting, and often comical way. Lilly Millenovanovich is an over forty, struggling author, trying to make financial ends meet by working as a night school instructor, teaching English to immigrants, while freelancing during the day for the Barton Gazette. When one of her students is shot, life goes from boring to frighteningly exciting as Lilly is thrown into the chaotic turmoil of murder and mystery.She begins making new friends; only they aren't all the nice kind. Diving into cultural waters, she can't refuse a heartfelt plea to help find the young Mexican boy, Luis Gallos, and reunite him with his mother. Of course, she will have to dodge the dangerous hands of the Mexican Mafia and it's ruthless but clever jefe, Carlos Ruido. Lilly finds her sleuthing will keep leading to the south side of town, appropriately named the Peligroso. It is home to many Hispanics, but also to the Mexican Mafia gangs and rampant crime. Barton authorities are preparing for the eventual showdown with the infamous Ruido, hoping to finally capture him. The only problem, according to Lilly, is who they're using for bait to lure him in. Luis Gallos, the crime leader's grandson. If Lilly could just focus on helping to get Luis back together with his mother, her search might not be so frustrating. However, when the hot and handsome bad boy Latino, Nick Galina, pops into her life, Lilly's emotions kick into overdrive. She's hopelessly drawn to him, though it doesn't help that he might be working for the wrong side of the law. When Lilly finally decides she can handle her feelings and whatever Nick dishes out, another romantic ingredient is added to her life. Former fiancé, Jake Kline comes back into town. The challenges are demanding and the dangers are increasing, but Lilly can depend on her cousin, Mona, as well as her crazy but loving team of aunts, Irene, Sadie, and Fran, to lend a bit of help. The chase is on to save Luis before his grandfather can manage to dupe the authorities and steel the boy away. If all goes according to plan, Lilly and company are just the ones to accomplish the task and bring life a happy ending. For more in this mystery series, read WHIPS, CUFFS, AND LITTLE BROWN BOXES.",
  "genres": [],
  "author": "Kathryn   Long",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/16003852-gangs-illegals-and-a-rose-tattoo"
}