{
  "title": "Grafted Vines",
  "description": "It’s often said, when one door closes another opens. But what if, in the end, you’re left standing alone in its threshold?At fifteen, Dani Valdez lost the most important man in her life—her father. After years of therapy, she’s continued to make one bad choice after another, desperate to soothe the emptiness his death left behind. Even with a fulfilling career as an in-home nurse and caregiver, her personal life is less than stellar. Now in her early thirties, not only is Dani the oldest and curviest girl in her group of friends, but she’s also the last childless, single female. It’s time for her to take a new path, so she’s pushing past her self-doubts and taking control of her destiny. And with her close friend, Zachary, there to support her, she’s confident in her decision. That is, if she can get over the fact that Zachary is the love she’s not meant to have.Zachary will never forget what it felt like to be hungry and abandoned by his mother in their rundown, dirty apartment. He still couldn’t believe he’d been given a second chance as a teen when Joel Evanwood not only adopted him, but also taught him how to run his vineyard. After an impulsive one night stand with Dani, his best friend, Zachary decides to shut everything out and throw himself into work. He can’t take a risk on a relationship with her, even if he wanted to. But when a devastating diagnosis alters his world, he will reach for the only steady thing in his life—her.It doesn’t take long before their relationship heads down an uncomfortable road, reminding him of why he can’t give her everything she wants. In order for him to stand by her, he’ll have to deal with old memories he’d rather leave buried.But is Zachary strong enough to let Dani in to see the painful burden he’s carried from his past? Or will his stubbornness kill any chance they will ever have?",
  "genres": [
    "Contemporary Romance",
    "Romance"
  ],
  "author": "Kimi Flores",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/16004623-grafted-vines"
}