{
  "title": "Bitten",
  "description": "In BITTEN (Book #3 of the Vampire Legends), Rachel Wood wakes to find herself in an ancient castle, all alone. She wakes to realize she is now a vampire.Rachel searches for answers. She wants to know where she is, how she got there, where Benji is, and what will become of her. She wants to be human again, to go back home, to make this all go away.But it’s too late.She meets other vampires in the castle, makes new friends, and begins to learn what it’s like to be a vampire. She learns that she has powers she never imagined possible.But all that is not enough. She longs for home, for her high school, her friends. And she escapes.She heads back and sees all of her friends, and fights with her parents, and goes back to school—and tries to settle back into normal life. She even meets up with Rob again, who still has feelings for her, and who invites her to the big Halloween ball.But normal life is not meant to be for Rachel anymore. She is changing too fast, and she can’t control what’s happening to her body. She comes to realize she is not the same person she once was. After her home is ransacked by an evil coven, her parents kick her out of the house for good, leaving her nowhere to go.In the meantime, Violet and her people are coming after Rachel, determined to use her to find and kill Benji. Benji is searching for the famed Blue Tablet that might save them all from the coming war. And Rachel, when she learns how in danger Benji is, realizes she has to be by his side. She will stop at nothing to be with him—even if that means having to choose between life and death.BITTEN is book #3 of the Vampire Legends series (following Book #1, SWORN and Book #2, TAKEN), and is also a standalone novel.",
  "genres": [
    "Vampires",
    "Young Adult",
    "Paranormal",
    "Fantasy",
    "Paranormal Romance",
    "Fiction"
  ],
  "author": "Emma Knight",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/16005312-bitten"
}