{
  "title": "Rinai",
  "description": "Ia menolehkan kepala ke arah mereka yang duduk diam. Menjelaskan secara runut peristiwa penyerangan Israel yang selalu dilakukan tiba-tiba, menyebabkan sebagian warga Palestina eksodus atau tewas.Rinai tak begitu memperhatikan struktur kalimat. Mengamati kedip mata berikut perubahan raut muka, jauh lebih menegangkan, memberi informasi. Wajah Montaser tetap ramah, penjelasannya tenang. Rinai mengumpulkan warna-warni yang dikenalnya untuk menjelaskan retina Montaser. Hitam jelaga, coklat tanah, karamel, biru Laut Mediterrania. Terkesiap tiba-tiba. Apa ia melihat sekilas percik api di matanya? Aaah, lelaki pemilik sepasang mata bersayap bagai Toyor al Jannah itu membuat dunia ini seakan berhenti berputar. Matahari mengalami musim salju, angin berayun berirama. Rinai menggigit bibir dalam-dalam, mencoba menenangkan diri. Superego berusaha memandu agar tak satupun tindakan bodoh dilakukan. Pemuda Gaza ini memberinya rasa menggigil, serupa ia terpaksa melaju kencang di atas sepeda motor, menembus derasnya hujan.Sebuah novel menggugah jiwa tentang bagaimana perjalanan sebuah tim relawan menembus Gaza Palestina. Tentang intrik-intrik di internal tim relawan, rahasia anak-anak dan warga Gaza, juga tentang bunga-bunga cinta yang tumbuh mekar. Cinta yang tak harus memiliki, tapi terus harum mewangi.Novel di tangan Sinta Yudisia tidak sekadar rekaan cerita, tetapi juga alat negosiasi efektif bagi peradaban tandingan atas peradaban yang ada. Melalui konflik kontekstual Palestina, kali ini Sinta mengahdirkan upaya negosiasinya dalam setiap lapis struktur cerita….Selamat dan salut atas energi dan upaya yang terus menyala.(Irfan Hidayatullahi – Dosen Sastra Unpad, penulis Sang Pemusar Gelombang)Kami sangat merindukanmu dan terus mengingat Anda; mengingatkan Anda untuk mengunjungi kami di Gaza Palestina.Selamat atas upaya dalam penyusunan buku ini.Kami akan bekerja sama dengan Anda, insya Allah, saya akan mengirim link untuk buku ini ke Menteri dan budaya Palestina, Muhammad Madhoun.Dan kita akan tetap berhubungan.(Mrs. Ittimad et Tharshawi – Ministry of Women Affairs, Gaza - Palestina)“RINAI bukan hanya menjadi bukti kepiawaian Sinta meramu- leburkan solidaritas global ke dalam konflik ideologi dan bersenyawa, tapi juga menawarkan sudut pandang yang seksi : metamorfosa seseorang ke arah kebaikan – menemukan jati diri, memahami nasionalisme, dan spiritualitas sosial—justru tidak berproses dalam kepompong yang bernama Tanah Air, namun terjadi di tanah para anbiya sana : Palestina!”(Benny Arnas – Sastrawan Muda, penulis Jatuh dari Cinta)",
  "genres": [],
  "author": "Sinta Yudisia",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/16005373-rinai"
}