{
  "title": "Cha-Ching!",
  "description": "Theo, our scruffy, big-hearted and quick-witted heroine, is not so much down on her luck as delivered luckless into a culture where the winners and losers have already been decided. Her adventures in getting over take her from SF to NYC, from dyke bars to telemarketing outfits, casinos to free clinics. With the signature poet's voice that has won her awards and acclaim, Liebegott investigates the conjoined hearts of hope and addiction in an unforgettable story of what it means to be young and broke in America.Praise for Cha-Ching!\"Cha-Ching! is a rush - the clatter of youth on the angry move, the rattling of dreamy gambles in crappy apartments, the desperate crash of falling for someone despite the million reasons why and the bang! bang! bang! of our tender hearts.\"—Daniel Handler, author of Why We Broke Up\"Cha-Ching! is so raw with need that I found myself itching that addict's itch to chase the seemingly impossible.\"—Karolina Waclawiak, deputy editor of The Believer and author of How to Get Into the Twin Palms\"An open-hearted, deeply romantic story about a fucked-up dyke, her pit bull, her search for love, her tenuous grasp on hope, a pretty girl and the literal spin of the wheel.\"—Sarah Schulman, author of The Gentrification of the Mind: Witness to a Lost Imagination\"In the game of American-life-on-the-go hopscotch, Ali Liebegott's heroine Theo just jumped a square ahead of Dean Moriarty. . . . The author's fine writing about gambling is as good as I ever read, including Dostoevski's and the Barthelme Bros. In the end, love, in whatever twisted, pallid form, a love that has little to do with sexuality, is the only answer. . . .Wonderful book.\"—Andrei Codrescu, author of So Recently Rent a World: New and Selected Poems",
  "genres": [
    "Fiction",
    "Queer",
    "LGBT",
    "Audiobook",
    "Contemporary",
    "Queer Lit",
    "Lesbian"
  ],
  "author": "Ali Liebegott",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/16006605-cha-ching"
}