{
  "title": "Payback - a time of Revenge and Desire",
  "description": "Chapter 1I cannot say it was a good time in my life, I cannot say I learnt anything, nor can I say , yet, still, at this point, that I regret anything. Maybe I will in the future. Maybe on my death bed , I do not know, all I can say is I did it – it was done. And that’s that.I was certainly in a strange place, mentally for those few weeks before it happened - maybe legally some well-paid lawyer could say it was not me who did the deeds, but some version of me, that was not legally responsible – or some such.However they are now long gone, and I am sure no-one will say anything.Chapter 4Yes she had a wonderful body, but then I am also sure it was wasted in her – she was young – she probably thought she would have it and be able to use it forever. Movement artist – what was that? Yes I was getting angry. Yes. Rage and anger and shame and disillusionment and frustration, and also something quite sharp and strong and painful rising up in my chest, something red and wet and full of desire – to do something. AnythingI was pacing between them –Kristi’s buttocks now seemed white and arrogant –bitch -I pushed my hand around, grabbed her breast and pulled her to me.She cried out – after all my other had had the gun- and I had her by a nipple.I didn’t know what I was going to do now, yet here I was with her body, her ass pressed against me, and her breast warm in my handI caressed her, moved my free hand up and down her stomach, up over her nipple to her neck, stroking her neck, so her head came back to mineAhh - she relaxed, I am sure seeing a way out of this now. Her usual way?She turned to me, and carefully, slowly put her hands to my face. I let my hands slide around body and down her backI let her kiss me, though I kept my gun hand behind my back, away from her hands.I slapped her buttocks hard, she jerked against me, her breasts and face pushing against me. I slapped again, and again. I wanted to hurt, instead she reached her face up and kissed me.The kiss went on for a long time, and I was surprised at the intensity – my intensity. All the suppressed emotion was flowing through my hands and lips as I played and groped and kissed this flesh infront of me.I slid my hand down between her legs, and felt the lips and softness and then, inside her and felt the wetness cover my fingers in a warm shudder of juice . She trembled and almost seemed to squat down onto my finger, her face sliding down to my breasts (quite loose in this dress). She squatted down against me hand, then pulled up and panted soft and warm against my ear.What can I do for you ?she whispered in my ear – what do you want me to do?-Kneel I said (inside me things were surging and raging and full of desire and anger and rage and heat and strange light) - kneel, and lift up my skirt and lick meThere was a hesitation. She seemed to glance away (at Sebastian?)There was hesitation and then she did.She knelt down before me, so I could look down at her hair – and she had beautiful luscious hair, and she carefully lifted up my dress, and began to fumble between my legs at the pantyhoseSebastian I could see out of the corner of my eye was rocking back and forth amongst his grey man tapeShe pulled my pantyhose down to my knees",
  "genres": [],
  "author": "Germaine Gibson",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/16007193-payback---a-time-of-revenge-and-desire"
}