{
  "title": "فرسان الحياة",
  "description": "(هكذا أراه )هكذا أرى فارس الحياة :- أراه في كل مكان تطؤه قدماه فارسا ، أراه في كل عمل يقوم به فارسا ، في عملهأو دراسته فارس، في ثقافته فارس ،في علاقاته فارس ، في أخلاقه فارس ، في حسن معاملته للآخرين فارس ، في عبادته فارس ، في أداء رسالته فارس .هكذا أراه :- أراه يقدم للناس نموذجا مختلفا ومتميزا بل ورائعا يجعلهم غير مصدقين ما يرون ، ويجعل ألسنتهم تنطق \" هو لسه كده\".وهكذا أراه :- أراه مبتسما أراه متحمسا ، أراه نشيطا ، أراه قويا متحفزا ، أراه للمعالي ساعيا ، أراه محبا غير كاره ، ودودا غير حاقد ، متسامحا غير منتقم ، أراه للآخرين مصدر سعادة وقوة وتحفيز .وهكذا أراه :- أراه في عمله مجدا مجتهدا ، وفي مجتمعه فاعلا مبتسما ، وفي محرابه باكيا مبتهلا ؛ إذ هو في كل ميدان فارس الحلبة ، وفي كل مكان ضوء الشمعة الذي يبدد الظلمة .هكذا أراه وأتمنى :- أتمنى أن نسعى جميعا للوصول إلى هذه الفروسية التي نستطيعها ونستحقها ...فهيا يا فرسانفقد آن الأوانحتى لا يصمد أحد ولاشي أمامكلاشي يستطيع أن يصمد في وجه ..((لاترى ماهو هذا الشئ))؟؟(( لاشئ يستطيع أن يصمد في وجه ابتسامه صافية))فأمام الابتسامة الصافيه لاشئ يصمد، لن يستطيع الاخرون الصمود أمام إبتسامتك الصافية الحقيقية دو أن يحبوك ، لن تستطيع همومك أن تصمد أمامك إذا ابتسمت أمامها وكنت على ثقة من حلها، لن تصمد هموم الاخرين في وجه ابتسامتك الصافية التي تبث فيهم الامل والطمأنينة ، لذلك إذا أردت أن لايصمد شي أمامك ، وأن يميل إليك كل شي فارسم على وجهك ابتسامة صافية صادقة ، ابتسامة حب لآخرين وصفاء ونقاء تجاههم ، ابتسامة أمل وتفاؤل بمستقبل أفضل ، ابتسامة رضا لما يحدث لك، أحب الحياة وابتسم لها ، أحب الاخرين وابتسم لهم ، أحب ذاتك وابتسم لها ولن يصمد شئ أمامك.( هيا نختار هذا الرجل )عندما سئل جورج برنارد شو عن الشخصية التي كان سيختار أن يكونها لو كان بوسعه أن يعيش حياته من جديد أجاب إجابة فريدة ورائعة حيث قال :( سأختار الرجل الذي كان بوسع جورج برناردو شو أن يكونه لكنه لم يستطع أبدا )كم أراها إجابة فريدة رائعة وبليغة ، وكم أراها كذلك مؤلمة وحزينة ، سر ورعتها وبلاغتها في تفردها وحكمتها ، أما سر إيلامها فهو في الحقيقة التي تشي بها ، إذ إن قلة من البشر على مدار التاريخ كله هي التي أصبحت كل ما تستطيع أن تكونه ، قلة من البشر هي التيس نجحت في استثمار كل طاقتها وقدراتها وصولا إلى كل ما يستطيع الوصول إليه أو على الأقل معظمه ، إن من المؤلم والمبشر في ذات الوقت أننا نستخدم تبعا للدراسات حوالي 10% فقط من إمكاناتنا وقدراتنا أما الباقي فهو غير مستثمر أو مستغل ، وهي بالطبع حقيقة مؤلمة ؛ لأنهاتجعل معظمنا يقف في حياته عند أسفل سلم كان يستطيع بتفعيل المزيد من إمكاناته وقدراته للوصول إلى قمته ، لكنها كذلك مبشرة ؛ لأنها تعني أن أمامنا الكثير لتحقيقه ، وأننا لم نصل حتى الآن إلا إلى أقل القليل مما يمكننا الوصول إليهيمكن تحميل نسخة الكتاب كاملة على الرابط التاليhttp://www.4shared.com/office/VKpufd3...وايضا متوفر على موقع ( نيل وفرات ) لمن يرغب بشراءه على الرابط التاليhttp://www.neelwafurat.com/itempage.a...",
  "genres": [],
  "author": "أشرف شاهين",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/16007379"
}