{
  "title": "This Is How You Lose Her",
  "description": "Pulitzer Prize-winner Junot Díaz’s first book, Drown, established him as a major new writer with “the dispassionate eye of a journalist and the tongue of a poet” (Newsweek). His first novel, The Brief Wondrous Life of Oscar Wao, was named #1 Fiction Book of the Year” by Time magazine and spent more than 100 weeks on the New York Times bestseller list, establishing itself – with more than a million copies in print – as a modern classic. In addition to the Pulitzer, Díaz has won a host of major awards and prizes, including the National Book Critic’s Circle Award, the PEN/Malamud Award, the PEN/O. Henry Prize, the Dayton Literary Peace Prize, and the Anisfield-Wolf Award.Now Díaz turns his remarkable talent to the haunting, impossible power of love – obsessive love, illicit love, fading love, maternal love. On a beach in the Dominican Republic, a doomed relationship flounders. In the heat of a hospital laundry room in New Jersey, a woman does her lover’s washing and thinks about his wife. In Boston, a man buys his love child, his only son, a first baseball bat and glove. At the heart of these stories is the irrepressible, irresistible Yunior, a young hardhead whose longing for love is equaled only by his recklessness--and by the extraordinary women he loves and loses: artistic Alma; the aging Miss Lora; Magdalena, who thinks all Dominican men are cheaters; and the love of his life, whose heartbreak ultimately becomes his own. In prose that is endlessly energetic, inventive, tender, and funny, the stories in the New York Times-Bestselling This Is How You Lose Her lay bare the infinite longing and inevitable weakness of the human heart. They remind us that passion always triumphs over experience, and that “the half-life of love is forever.”",
  "genres": [
    "Fiction",
    "Short Stories",
    "Contemporary",
    "Book Club",
    "Romance",
    "Literary Fiction",
    "Adult Fiction"
  ],
  "author": "Junot Díaz",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/16007873-this-is-how-you-lose-her"
}