{
  "title": "Cowboys Know Best",
  "description": "As the only daughter of a powerful mafia Don, Perlita Moretti is accustomed to a life of pampered luxury, but on the evening of her nineteenth birthday the family home is brutally attacked by another mob boss, her father is killed, and her entire life is forever changed.Saved from the carnage by her beloved uncle, she flees for her life. She quickly discovers that the world outside her Long Island mansion is quite different and much larger than she had expected. She soon finds herself lost, and very much alone, somewhere in western Pennsylvania.At a small diner, a desparate, terrified Perl runs into Henry ‘Hank’ Billings, a cowboy from a small Texas town who is finishing up some personal business in the region. After a rocky introduction, Hank comes to her rescue when a pair of mob goons show up.Hank reluctantly allows Perl to accompany him back to his ranch to hide her until the mob gives up their hunt. It does not take long for the serious-minded Texan to place the willful, spoiled young lady across his knee for a bare-bottom spanking and some basic lessons in good manners. As time passes, Perl allows herself to submit to the old-fashioned hard work and discipline of Texas ranch life.Having been hurt by a woman before, Hank resists his growing desire for Perl, convincing himself that the almost twenty year age difference between them would make any advances on his part ungentlemanly. Perl, however, has fallen for him with all her heart, and she does not intend to let him keep her at arm's length. With the mob still hunting her, can she convince Hank that she needs him as much more than just her firm, caring protector?This book contains sexual scenes and spankings, including domestic discipline in a historical setting. There are also mild ageplay elements. If such material offends you, please do not buy this book!Book Length: 11 chapters / 42,600 words",
  "genres": [
    "Westerns",
    "Erotica",
    "BDSM",
    "Romance"
  ],
  "author": "Breanna Hayse",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/16010489-cowboys-know-best"
}