{
  "title": "Zen Yoga: A Path To Enlightenment Through Breathing, Movement and Meditation",
  "description": "Zen Yoga is the culmination of the more than twenty-five years Aaron Hoopes has spent studying and training in the practical and spiritual arts of Japan, China and India. In this book, he combines the mindful serenity of Zen meditation, the graceful movements of Tai Chi, the energizedbreathing of Qigong, and the peaceful stretching exercises of Shanti Yoga. He then blends breathing, moving, stretching, and relaxation exercises into a unique discipline that opens up to anyone, regardless of age or physical condition, the potential for experiencing a new way of living. But ZenYoga is more than a simple exercise program. It offers a formula to guide us toward a healthier, happier, fitter, and more peaceful state of being.In engaging, easily-understood prose, Hoopes begins by defining the concepts and explaining his ideas on Zen, Yoga, the Chakras, Chi energy, and the Tao. The next part of the book focuses on breathing, moving, and relaxing exercises, with a final section on spiritual deepening that shows how theexperience of Zen Yoga can be merged with the personal spiritual inclinations of the individual. The book includes detailed photographs showing correct positions and sequence of movements.The Zen Yoga program promotes a healthy body, mind, and spirit. At a deeper level, a commitment to Zen Yoga can illuminate ways to encourage enlightenment, radiate harmony and live in full awareness of the present moment.Aaron Hoopes book contains simple breath and mind-body exercises that are not out of the reach of ordinary people. Zen Yoga has worked for my patients. I plan to use this book for them (and myself) and to recommend it to anyone looking for an honest and practical, yet sophisticated book on yoga.--Reza Yavari, M.D., author of It Must Be My Metabolism",
  "genres": [
    "Nonfiction",
    "Self Help"
  ],
  "author": "Aaron Hoopes",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/1601420.Zen_Yoga"
}