{
  "title": "The Call of Cthulhu and Other Weird Stories",
  "description": "A definitive collection of stories from the unrivaled master of twentieth-century horror.\"I think it is beyond doubt that H. P. Lovecraft has yet to be surpassed as the twentieth century's greatest practitioner of the classic horror tale.\" - Stephen King.Frequently imitated and widely influential, Howard Philips Lovecraft reinvented the horror genre in the 1920s, discarding ghosts and witches and instead envisioning mankind as a tiny outpost of dwindling sanity in a chaotic and malevolent universe. S. T. Joshi, Lovecraft's preeminent interpreter, presents a selection of the master's fiction, from the early tales of nightmares and madness such as \"The Outsider\" to the overpowering cosmic terror of \"The Call of Cthulhu.\" More than just a collection of terrifying tales, this volume reveals the development of Lovecraft's mesmerizing narrative style and establishes him as a canonical- and visionary-American writer.For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.H. P. Lovecraft was born in 1890 in Providence, Rhode Island, where he lived most of his life. Frequent illnesses in his youth disrupted his schooling, but Lovecraft gained a wide knowledge of many subjects through independent reading and study. He wrote many essays and poems early in his career, but gradually focused on the writing of horror stories, after the advent in 1923 of the pulp magazine Weird Tales, to which he contributed most of his fiction. His relatively small corpus of fiction—three short novels and about sixty short stories—has nevertheless exercised a wide influence on subsequent work in the field, and he is regarded as the leading twentieth-century American author of supernatural fiction. H. P. Lovecraft died in Providence in 1937.S. T. Joshi is a freelance writer and editor. He has edited Penguin Classics editions of H. P. Lovecraft’s The Call of Cthulhu and Other Weird Stories (1999), and The Thing on the Doorstep and Other Weird Stories (2001), as well as Algernon Blackwood’s Ancient Sorceries and Other Strange Stories (2002). Among his critical and biographical studies are The Weird Tale (1990), Lord Dunsany: Master of the Anglo-Irish Imagination (1995), H. P. Lovecraft: A Life (1996), and The Modern Weird Tale (2001). He has also edited works by Ambrose Bierce, Arthur Machen, and H. L. Mencken, and is compiling a three-volume Encyclopedia of Supernatural Literature. He lives with his wife in Seattle, Washington.",
  "genres": [
    "Horror",
    "Classics",
    "Fiction",
    "Short Stories",
    "Fantasy",
    "Science Fiction",
    "Lovecraftian"
  ],
  "author": "H.P. Lovecraft",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/160149.The_Call_of_Cthulhu_and_Other_Weird_Stories"
}