{
  "title": "Black Noise: Rap Music and Black Culture in Contemporary America",
  "description": "From its beginnings in hip hop culture, the dense rhythms and aggressive lyrics of rap music have made it a provocative fixture on the American cultural landscape. In Black Noise: Rap Music and Black Culture in Contemporary America, Tricia Rose, described by the New York Times as a \"hip hop theorist,\" takes a comprehensive look at the lyrics, music, cultures, themes, and styles of this highly rhythmic, rhymed storytelling and grapples with the most salient issues and debates that surround it.Assistant Professor of Africana Studies and History at New York University, Tricia Rose sorts through rap's multiple voices by exploring its underlying urban cultural politics, particularly the influential New York City rap scene, and discusses rap as a unique musical form in which traditional African-based oral traditions fuse with cutting-edge music technologies. Next she takes up rap's racial politics, its sharp criticisms of the police and the government, and the responses of those institutions. Finally, she explores the complex sexual politics of rap, including questions of misogyny, sexual domination, and female rappers' critiques of men.But these debates do not overshadow rappers' own words and thoughts. Rose also closely examines the lyrics and videos for songs by artists such as Public Enemy, KRS-One, Salt N' Pepa, MC Lyte, and L. L. Cool J. and draws on candid interviews with Queen Latifah, music producer Eric \"Vietnam\" Sadler, dancer Crazy Legs, and others to paint the full range of rap's political and aesthetic spectrum. In the end, Rose observes, rap music remains a vibrant force with its own aesthetic, \"a noisy and powerful element of contemporary American popular culture which continues to draw a great deal of attention to itself.\"",
  "genres": [
    "Music",
    "Nonfiction",
    "Hip Hop",
    "History",
    "Race",
    "Cultural Studies",
    "Sociology"
  ],
  "author": "Tricia Rose",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/160195.Black_Noise"
}