{
  "title": "مسخ الكائنات",
  "description": "إن \"التحولات\" نوع من الكتابة الثانية للميثولوجيا الإغريقية والرومانية ومتأثرة بهوميروس وڤيرجيل خاصة. وقد أعاد أوڤيد إحياء الأساطير وأبطالها حين ألحّ على المضمون الإنساني عبر وصف دقيق حيّ للعواطف والأهواء والهواجس وما تمليه من سلوك، ويتبين للقارئ أن \"التحولات\" جذر رئيسي من جذور فن السرد قديماً وحديثاً، بدءاً من \"ألف ليلة وليلة\" مروراً برواية \"دون كيشوت\" وانتهاءً بفن السرد عن بورخيس وماركيز. هذا عدا التأثير الذي مارسته في عالمي المسرح والشعر وفي فن التصوير في عصر النهضة الأوروبي. أما كاتب هذا العمل فهو \"پبليوس أوڤيديوس ناسو\" المعروف بـ\"أوڤيد\". ولد أوڤيد سنة ٤٣ قبل الميلاد في سولمونا ودرس في مسقط رأسه وفي روما، وسرعان ما اشتهر بفضل كتبه عن الحب. كتب \"التحولات\" وهو في قرابة الأربعين، وبدأت ترجمتها إلى اللغات الأوروبية الحديثة بدءاً من القرن السادس عشر. نفي أوڤيد في السنة الثامنة للميلاد إلى مدينة توميش على البحر الأسود، والتي تعرف اليوم باسم كونستانزا في رومانيا، ومات فيها سنة ٧١ ميلادية. أما فيما يتعلق بالترجمة وتحديداً في ما يتعلق بالأسماء، آلهة وأشخاصاً وأماكن، اعتمد المترجم \"أدونيس\" اللفظ الأصلي يونانياً كان أم لاتينياً كأساس إلا أنه آثر الصورة التي اشتهر الاسم بها مع مراعاة القياس والنطق العربيين.تضم هذه المجموعة القصصية عدة أساطير يونانية ورومانية تروي حكايات من التحولات، حيث تحتوى على أكثر من خمسين قصة شيقة لتروي لنا أساطير الملك ميداس وديدالوس وإيكاروس وهرقل وحرب طروادة، مما يجعل من هذا العمل أحد أروع ما سجل بالتاريخ حول الأساطير الكلاسيكية.\"لقد ظل هذا العمل الكبير الذي يعتبر من شوامخ الأدب القديم ألفين من الأعوام دون أن تقدم الأقلام العربية على ترجمته إلى لغة الضاد حتى ظهر هذا الكتاب المترجم الأنيق ليملأ هذا الفراغ. لقد أقبل الدكتور ثورت عكاشة على هذا الجهد الشاق حبا وعشقا لمادته وإيمانا بأهميته للاكتمال والنضج الثقافي، مضيفا إلى معطياته الثقافية السابقة هذا العمل الجاد والممتع والمفيد.\"-حسين بيكار (أخبار اليوم ١٦/١٢/١٩٧٢)",
  "genres": [
    "Poetry",
    "Mythology",
    "Fiction",
    "Literature",
    "Fantasy",
    "Greek Mythology",
    "Philosophy"
  ],
  "author": "Ovid",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/16028970"
}