{
  "title": "Royal Desire",
  "description": "With the sudden death of his father, Alex must now assume the role of King. This puts his marriage proposal to shy former hotel maid, Liz, on the backburner. They have to keep their engagement silent from the public for six months, as is seemly for a mourning period.But as Liz correctly predicts, a lot can happen in six months.Just as they announce their happiness to the world, an ancient law forbidding them to marry brutally surfaces. Liz and Alex must make a painful choice. Will they fight honored tradition or destroy everything in following their hearts?ROYAL DESIRE, a 16,000-word erotic romance novelette, is the fourth and final book in the ‘MAID TO THE BILLIONAIRE PRINCE’ series.BOOKS IN THE SERIESMysterious DesireForbidden DesireInfamous DesireRoyal DesireREAD AN EXCERPTHe leads me through a maze of turns. I swear I will never be able to find my way back blindfolded. A tiny frisson of uncertainty fleets through me. Has Alex really changed? Or has he always been this way and he’s showing his true self to me for the first time? I don’t doubt that we love each other, but I’ve always wondered about Alex’s dominant side. The side he showed when he took me and slammed me against the bathroom wall for the very first time when we met.Later, as we became lovers, we became more giving to each other. More solicitous of each other’s needs. More loving. But I’ve always wondered about the side of him he showed me that day. I’ve thought about it often. Even fantasized about him taking me in a very public place once again.Ooooh.I’m a little nervous.He is, after all, the King, and he can do whatever he wants. I am only his damsel in mock distress.OK, I will be distressed if he doesn’t throw me on some bed and take me soon.We finally stop. My shoes are perched upon deep, lush carpeting. I have no idea where I am.“Where are we?”“No peeking or I’ll have to tie you up,” he chastises. “Just enjoy the ride, sweetheart, wherever I’m taking you. Now keep very, very still. And don’t peek.”I recall what he said about the hogtying and spanking, and a shudder passes through my groin. Alex has never tried the bondage and domination route before. At least not with me. An excited tingle flushes through my body as I envision being bent over his knee and spanked.Oh! I don’t think I would mind being spanked by Alex at all!I’m a statue as he starts to unbutton my blouse. My Moldavian designer blouse, the one with the gold Chanel-like buttons, only they are shaped like roses. The cool air caresses my skin as he peels my blouse off oh-so-slowly. I’m hyperaware of every sensation, every nuance in the charged air particles around us. I suck in my breath and hold it. My diaphragm beneath my ribs is tensed and ready.He unsheathes my blouse, dragging the inverted sleeves off my hands. I’m wearing a pretty brassiere underneath with matching panties. La Perla. The only non-Moldavian pieces of clothing I have allowed myself since this whole Public Relations image-grooming thing started.He rubs his thumb pads across my collarbones. His touch is so warm, so sensuous that a fresh gush of cream spills forth from my pussy. He reaches behind me to unhook my brassiere. He’s purposefully prolonging this. Teasing me so that I will experience everything in magnification. I hear the plop of my brassiere as he drops it on the carpet. His warm thumbs and fingers latch on to my nipples, already as hard as stones, and compresses my ultra-sensitive tips.He scissors my nipple tips in between his fingers and thumbs, rubbing them back and forth. The sensations these movements evoke are exquisite and toe curling. Hell, they are clit curling. I moan with the erotic pleasure.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Erotic Romance"
  ],
  "author": "Artemis Hunt",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/16029630-royal-desire"
}