{
  "title": "The Scientific Sherlock Holmes: Cracking the Case with Science and Forensics",
  "description": "La ciencia de Sherlock Holmes, de Jim O’Brien, nos enseña cómo descifrar casos con ciencia y medicina forense. Admiramos a Sherlock Holmes por ser el más astuto de los detectives pero, ¡elemental, querido lector!: no solo era inteligente, sabía mucho de ciencia...Pocos personajes de la literatura son más reconocidos universalmente que Sherlock Holmes, el detective surgido de la imaginación de Arthur Conan Doyle. Cautivados por sus poderes de observación y deducción, muchos lectores pasan por alto el uso que Holmes hacía de la ciencia para resolver sus casos. Remediar semejante limitación, al mismo tiempo que introduce a los lectores en los fundamentos científicos de las técnicas forenses, es el propósito de este libro. Así, y tras introducir a los principales personajes del mundo de Holmes – Watson y Moriarty, en especial –, James F. O'Brien, un distinguido químico, desentraña los conocimientos científicos de Holmes, especialmente los químicos, materia en la que sobresalió. Analiza, por ejemplo, venenos como el monóxido de carbono, cloroformo y ácido prúsico (el nombre histórico del ácido cianhídrico), y muestra que Sherlock Holmes fue un pionero de la ciencia forense, utilizando las huellas dactilares mucho antes de que Scotland Yard adoptase este método. Consciente de que la realidad no se puede encapsular en la literatura, O'Brien también incluye descripciones de casos reales, en dominios como el análisis grafológico, explicando cómo se utilizó para capturar al denominado \"asesino del Zodiaco\" de Nueva York y para determinar el responsable del secuestro (1932) y posterior asesinato del hijo del aviador Charles Lindbergh.",
  "genres": [
    "Science",
    "Nonfiction",
    "Mystery",
    "True Crime",
    "History",
    "Reference",
    "Crime"
  ],
  "author": "James F. O'Brien",
  "average_rating": "3.42",
  "url": "https://www.goodreads.com/book/show/16031765-the-scientific-sherlock-holmes"
}