{
  "title": "La leggenda della nave di carta. Racconti di fantascienza giapponese",
  "description": "Lungo una linea che risale fino alle leggende e ai miti tradizionali del Sol Levante, pur non disconoscendo la lezione dei grandi autori europei della seconda metà dell’Ottocento, come Verne o Wells, i sedici racconti che compongono La leggenda della nave di carta rappresentano una finestra su un mondo, una società, una cultura che sono altro da noi e che, proprio per questo, ci risultano affascinanti, sorprendenti. Distanti dagli stereotipi più diffusi, che vogliono la fantascienza giapponese legata all’epopea di mostri leggendari come Godzilla o alle saghe anime, questi racconti esplorano territori più accidentati e stimolano suggestioni profonde su temi complessi e insoluti come la rapida modernizzazione della società, gli strascichi del militarismo degli anni Trenta e Quaranta, l’inquinamento ambientale, l’isolamento culturale, la condizione femminile, la fiducia – spesso tradita – nel progresso tecnologico. Il ritratto che se ne ricava è quello di un mondo vulnerabile, scosso, proiettato verso il futuro e allo stesso tempo ancorato al suo passato recente, all’evento che ne ha sconvolto l’attualità, segnandone per sempre l’identità e l’immaginario: l’apocalisse atomica su Hiroshima e Nagasaki.Una raccolta di sedici racconti curata da Carlo Pagetti e Ilaria M. Orsini. Tra di essi, quelli dei tre grandi della fantascienza giapponese, ossia Ryo Hanmura, Shinichi Hoshi e Sakyo Komatsu; poi Kobo Abe, che apre l’antologia con il suo caratteristico tocco kafkiano, e Tetsu Yano, che firma il racconto che dà il titolo alla raccolta, probabilmente il più prossimo alla letteratura tradizionale giapponese. Brevissimo e struggente il racconto di Takashi Ishikawa, tragicomici con sfumature nere quelli di Sakyo Komatsu. Straniante Yasutaka Tsutsui, in cui l’assurdo si rivela possibile. Infine i racconti di tre autrici: Shono Yoriko, Sei Takekawa e Mariko Ohara, che lasciano spazio a temi legati all’immaginario femminile.",
  "genres": [
    "Short Stories",
    "Science Fiction",
    "Japan",
    "Fiction"
  ],
  "author": "Ilaria M. Orsini",
  "average_rating": "2.92",
  "url": "https://www.goodreads.com/book/show/16031828-la-leggenda-della-nave-di-carta-racconti-di-fantascienza-giapponese"
}