{
  "title": "The Jinx",
  "description": "“Blending a flair for history, a convincing sense of the inner workings of law firms, and more than a touch of Y2K apocalyptic folderol, Kahn has concocted a highly readable thriller…The Jinx is a remarkably well-crafted book.”—Jonathan Groner, \nLegal Times\nOne dead client. A cryptic poem. Seven dead presidents.This gripping tale of murder, politics, conspiracy and passion takes aim at the American political system, the white supremacy movement and racial stereotypes while offering a sinister explanation for the “20-Year Jinx” that has claimed the lives of seven presidents.Young estate lawyer Benjamin Franklin Kravner discovers a cryptic poem among his murdered client's possessions that hints at a 160-year vendetta against the American presidency. Ben's skepticism wanes when he discovers an unusual phenomenon: the presidents elected every twenty years from 1840 through 1960 died in office, and Ronald Reagan barely survived an assassination attempt. Ben's perilous journey leads him to the answer to his question: is the poem merely a dead man's wacky conspiracy theory or is a powerful cabal primed to claim the White House as vengeance for their ancestor’s death?“The Jinx dares us to set aside partisan politics and awaken the slumbering dream of Martin Luther King to mark the millennium presidential election. I can think of no better way to celebrate the new millennium than to elevate the eradication of racism to the nation’s top priority.”—Nadine Strossen, \nPresident, ACLU and Professor of Law, New York Law School\n“Fast-paced action scenes move the drama along at a good clip…Kahn’s debut effort packs a punch.”—\nPublishers Weekly\n“Kahn has produced a first-rate novel that ranks with John Grisham and Frederick Forsyth.”—\nMidwest Book Review\n“The Jinx is a clever, well-crafted pageturner that weaves history, politics and the law into an unconventional Washington novel, which, at its best, raises important questions about the state of overt, systemic and subtle racism in the U.S. and in the minds of its citizens and leaders…As campaign rhetoric has taken a tone of renewal for the next millennium, with each candidate offering a vision of America’s future, The Jinx also offers its own vision of America’s future that includes working toward the eradication of racism in the next millennium.”—\nEvening Times\n“In a superb blend of logic and suspenseful adventure, Larry Kahn methodically outlines a fictional conspiracy that is believably scary, made all the more real by his protagonist, mild-mannered Ben Kravner. While Ben is no swashbuckling suspense-thriller hero, he takes us through chase scenes that play like a wide-screen movie.”—\nAmarillo Globe-News",
  "genres": [],
  "author": "Larry Kahn",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/1603207.The_Jinx"
}