{
  "title": "Night Marchers",
  "description": "Librarian Note: Alternate Cover Edition for B005W464WC.An all new Young Adult paranormal series that will have you averting your eyes for years to come!This special edition of Night Marchers was professionally edited in September 2012. It includes newly edited scenes, a special Kai P.O.V., the first chapter of the sequel: Redemption, the first chapter of the first book in our new apocalyptic series: Project ELE and more! This new Young Adult paranormal series will have you averting your eyes for years to come! NEVER, EVER lock eyes with a Night Marcher! Everyone in Hawaii has heard this warning, except for seventeen-year-old Emma Townsend that is. For most Hawaiians know that looking into the eyes of Night Marcher can strike a curse that will end in death or eternal servitude. Even though her father, who is a paranormal investigator, solely raised Emma, she has little experience in the realm of the supernatural. When she is forced to move with her father to Hawaii, only months before her graduation, Emma finds that her world as she knows it, is shaken when she starts seeing the unexplainable: fire balls in the distance, beating drums in the middle of nowhere and strangers who vanish into thin air. Then one day when she has a run in with a procession of Night Marchers, ancient Hawaiian spirits wandering from their burial grounds to their locations of battles past, Emma has no choice but to believe that the unbelievable does exist. Now Emma must go on the run with the help of a mysterious stranger, as they seek out how to free Emma from the curse of a Night Marcher, who will stop at nothing to get her soul.*We hope you enjoy this new edition of our free book which has had more than 60,000 downloads since February 2012.",
  "genres": [
    "Paranormal",
    "Young Adult",
    "Fantasy",
    "Romance",
    "Magic",
    "Paranormal Romance",
    "Mythology"
  ],
  "author": "Rebecca Gober",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/16032211-night-marchers"
}