{
  "title": "Anarchoshnitzel schrieen sie: Ein Punkroman für die besseren Kreise",
  "description": "Oliver Maria Schmitt hat mit seinen zarten vierzig schon Einiges auf dem Buckel. Titanic-Chefredakteur, Musicalschreiber, diverse Buchveröffentlichungen im Dunstkreis der Neuen Frankfurter Schule. Nachdem er „die Schnauze voll“ hatte, wie die Klappentext-Bio verkündet, besann Schmitt sich auf eine lang zurückliegende Episode seines Lebens, die wilden Jahre in seiner Heilbronner Punkband „Tiefschlag“. Da man, obgleich man inzwischen saturiert auf eine gänzlich unpunkige Erfolgsbilanz zurückblicken kann, im Herzen immer Punk geblieben ist, nennt OMS seine Spurensuche nach der fiktiven „Gruppe Senf“ und ihrer hübschen Sängerin Itty Lunatic einen „Punkroman für die besseren Kreise.“ Willkommen also im Club der wilden Dichter Jaud, Illies, Lottmann und Co. Peter Julius Hein (Schmitt himself) und Dr. Hollenbach, weder als Drummer Hollo noch als Arzt sonderlich respektabel, geraten auf eine Revival-Tour der seltsamen Art. Bodo, der Ex-Bassist, residiert inzwischen als bräsiger Immobilien-Mensch in einer Protzvilla mit Überwachungskameras in bester Stuttgarter Hanglage. Gleichermaßen verstörend wie süß, dieser menschliche Hai hätschelt und hegt in seinem Hochsicherheitstrakt Südwestdeutschlands drittgrößte Sammlung von Überraschungseiern! Immerhin weiß der Neureichen-Punk, dass Itty mit Rolfi, einem weiteren Ex-Senfkorn in der „Ostzone“ untergetaucht sei. Bad news für Peter Hein, dem die „Zone“ nach wie vor angstbesetztes Feindgebiet ist. Doch wo die Angst ist, ist der Weg! Im dauerironisierenden, zuweilen gestelzt herablassenden Tonfall geht nun ein wahres Gagfeuerwerk auf den Leser herab. Wie Ethnologen im unbekannten Dschungel treiben Hein und Hollo im thüringischen Fettnebelmeer von „Ilka’s Iss Was!?“-Wurstbude Verhaltensstudien. Kritisch vermerkt werden die „Störkraft“- und „Oithanasie“-Tattoes von Ilkas erlauchtem Kundenkreis, die jedem echten Punk bitter aufstoßen. Westliche Aufklärungsarbeit tut Not. In dem folgenden, kein Ost-Klischee auslassenden Roadmovie hagelt es Merkel-Beleidigungen, die jedem Anwalt Schweißausbrüche verursachen dürften, fliegende Rostbratwürste als Slapstick-Requisiten, sowie Rückblenden in die glorreichen Tage der „Gruppe Senf“ auf dem 7. Brackinger Backhausfeschtle, jenem magischen Ortstermin, bei dem Hein seiner Itty auf offener Bühne seine Liebe erklärte. In besinnlicheren Momenten ist Anarchoshnitzel (Senfs zeitweiliger Zweitname) ganz einfach ein sentimental journey in die Regionen früher Rebellion und verloren gegangener Träume. Ob „Gruppe Senf“ ihren zweiten Frühling erlebt, Hein Itty bekommt --, der Leser mag über die Bedeutung beider Ereignisse entscheiden. --Ravi Unger",
  "genres": [],
  "author": "Oliver Maria Schmitt",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/1603277.Anarchoshnitzel_schrieen_sie"
}