{
  "title": "The Dragon Lords",
  "description": "It was not every day that Mrs Delhany found a naked man in the driveway.So the book begins. This man neither remembers his name nor where he came from so Sandra Delhany takes him in. From then on things get only stranger ...The Dragon Lords by Silvia Hartmann was written entirely on Google Docs allowing anyone with a web-browser to see each sentence being typed word-by-word in real-time. Alison Flood from The Guardian called the process \"mesmerising\" whilst The New Yorker called this “the best technological-literary stunt in recent memory”.At 9am, Wednesday 12th September (BST), Silvia Hartmann began writing the first words of her new fantasy fiction novel The Dragon Lords and in doing became the world's first author to pen a book whilst letting readers see every word being typed.With the rise of eBooks and print-on-demand paperbacks, many authors are now using the web to bypass traditional publishing houses in favour of self-publishing. This project, known as The Naked Writer, aims to go one step further and give fans the chance to not only see the manuscript being typed, but to also comment on the storyline and provide feedback as the novel develops.Before penning the opening paragraph, the author announced to her social network followers that the first session was about to begin. By using the Google Docs cloud-based office suite, the author started with a blank document and begin to write. Fans have been provided with a public web page (Open The Dragon Lords Manuscript: Part 1–4) to see the book being written before their eyes. This represents a completely new level of interaction between readers and their author and was made possible by the advanced collaboration tools built into Google's software.The week before, the author asked her fans to suggest titles for the new book and she chose The Dragon Lords from those suggested. The winner was from the UK and is due to receive a signed copy of the finished paperback once the title is published by DragonGold, with target publication date of Monday, 26th November 2012.",
  "genres": [
    "Magic",
    "Gender",
    "M M Romance"
  ],
  "author": "Silvia Hartmann",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/16032849-the-dragon-lords"
}