{
  "title": "The Oxford History of the British Empire: Volume IV: The Twentieth Century",
  "description": "The fourth installment in this distinguished and unprecedented series brings us to the twentieth century. As with the other volumes, this book includes the work of leading scholars.  Here, readers confront the many facets of the imperial experience in the final century of the British Empire, above all the rapid processes of decolonization that began at mid-century. Volume IV attempts to understand the men who managed the empire, their priorities and visions as leaders, and the mechanisms of control which held the empire together. There are chapters on imperial centers of activity, on the geographical periphery of the empire, and on the entirety of its connecting mechanisms, including institutions and the flow of people, money, goods, and services. Contributors also explore the experiences of Britain's imperial subjects in culture, politics, and economics--those experiences which fostered the growth of vibrant, and often new, national identities and movements as well as--ultimately--new nation-states. It concludes with decolonization and the reshaping of the political map of the world. About the Series The Oxford History of the British Empire is a major new assessment of the Empire in the light of recent scholarship and the progressive opening of historical records. It deals with the interaction of British and non-western societies from the Elizabethan era to the late twentieth century, provides a balanced treatment of the ruled as well as the rulers, and takes into account the significance of the Empire for the peoples of the British Isles. All five of the volumes in this series fully explore economic and social as well as political trends.",
  "genres": [
    "History",
    "British Literature",
    "Nonfiction",
    "World History"
  ],
  "author": "Judith M. Brown",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/1062012.The_Oxford_History_of_the_British_Empire"
}