{
  "title": "Mary Queen of Scotland and The Isles",
  "description": "She became Queen of Scots when she was only six days old. Life among the warring factions in Scotland was dangerous for the infant Queen, however, and at age five Mary was sent to France to be raised alongside her betrothed, the Dauphin Francois. Surrounded by all the sensual comforts of the French court, Mary's youth was peaceful, charmed, and when she became Queen of France at the age of sixteen, she seemed to have all she could wish for. But by her eighteenth birthday, Mary was a widow who had lost one throne and had been named by the Pope for another. And her extraordinary adventure had only begun. Defying her powerful cousin Elizabeth I, Mary set sail in 1561 to take her place as the Catholic Queen of a newly Protestant Scotland. A virtual stranger in her volatile native land, Mary would be hailed as a saint, denounced as a whore, and ultimately accused of murdering her second husband, Lord Darnley, in order to marry her lover, the Earl of Bothwell. She was but twenty-five years old when she fled Scotland for the imagined sanctuary of Elizabeth's England, where she would be embroiled in intrigue until she was beheaded \"like a criminal\" in 1587. In her stunning first novel, The Autobiography of Henry VIII, Margaret George established herself as one of the finest historical novelists of our time. Now she brings us a new, mesmerizing blend of history and storytelling as she turns the astonishing facts of the life of Mary Queen of Scots into magnificent fiction that sweeps us from the glittering French court where Mary spent her youth, to the bloodstained Scotland where she reigned as Queen, to the cold English castles where she ended her days. Never before have we been offered such arich and moving portrayal of the Scots Queen, whose beauty inspired poetry, whose spirit brought forth both devotion and hatred, and whose birthright generated glorious dreams, hideous treachery, and murdered men at her feet.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Scotland",
    "British Literature",
    "Tudor Period",
    "16th Century"
  ],
  "author": "Margaret George",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/16033.Mary_Queen_of_Scotland_and_The_Isles"
}