{
  "title": "Up Is Up, But So Is Down: New York's Downtown Literary Scene, 1974-1992",
  "description": "Among The Village Voices 25 Favorite Books of 2006Winner of the 2007 AAUP Book, Jacket, and Journal Show in the Trade Illustrated Book Design category.Sometime after Andy Warhol’s heyday but before Soho became a tourist trap, a group of poets, punk rockers, guerilla journalists, graffiti artists, writers, and activists transformed lower Manhattan into an artistic scene so diverse it became known simply as “Downtown.“ Willfully unpolished and subversively intelligent, figures such as Spalding Gray, Kathy Acker, Richard Hell, David Wojnarowicz, Lynne Tillman, Miguel Piñero, and Eric Bogosian broke free from mainstream publishing to produce a flood of fiction, poetry, experimental theater, art, and music that breathed the life of the street.The first book to capture the spontaneity of the Downtown literary scene, Up Is Up, But So Is Down collects more than 125 images and over 80 texts that encompass the most vital work produced between 1974 and 1992. Reflecting the unconventional genres that marked this period, the book includes flyers, zines, newsprint weeklies, book covers, and photographs of people and the city, many of them here made available to readers outside the scene for the first time. The book's striking and quirky design—complete with 2-color interior—brings each of these unique documents and images to life.Brandon Stosuy arranges this hugely varied material chronologically to illustrate the dynamic views at play. He takes us from poetry readings in Alphabet City to happenings at Darinka, a Lower East Side apartment and performance space, to the St. Mark's Bookshop, unofficial crossroads of the counterculture, where home-printed copies of the latest zines were sold in Ziploc bags. Often attacking the bourgeois irony epitomized by the New Yorker’s short fiction, Downtown writers played ebulliently with form and content, sex and language, producing work that depicted the underbelly of real life.With an afterword by Downtown icons Dennis Cooper and Eileen Myles, Up Is Up, But So Is Down gathers almost twenty years of New York City’s smartest and most explosive—as well as hard to find—writing, providing an indispensable archive of one of the most exciting artistic scenes in U.S. history.",
  "genres": [
    "Poetry",
    "Nonfiction",
    "New York",
    "History",
    "Art"
  ],
  "author": "Brandon Stosuy",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/160334.Up_Is_Up_But_So_Is_Down"
}