{
  "title": "The Mother of All Viruses",
  "description": "\"Let the record reflect that this deposition commenced at 9:15 am on December the 3rd, 2004 at the FBI offices in Atlanta, Georgia. Present for this recording are Special Agent Alvin Dirk, the Honorable Judge Ramiro Vasquez, and the witness, Robert O. Blain. This deposition is merely a recording of the events which transpired at Norwood University and is not now nor ever will be part of any trial or prosecution. Go ahead.\"\"My name is Bobby Blain. Most people seem to think it all started when Dr. Jennings hired me, and all the computers started getting hacked. It was easy for people to think that, because I have a history and got myself in some trouble when I was younger. I hacked some computers and almost got the president impeached, but it really started before that, when I still worked for Dr. Karlyn.\" \"Dr. Karlyn gave me a chance to redeem myself by allowing me to work on his computer for him. Then one day, this scientist I had never seen before comes and gives Dr. Karlyn a device. I was never told what he wanted, but I think he wanted Dr. Karlyn to help him reverse engineer it. I was only asked to build an interface to attach it to the computer. Dr. Karlyn did the rest. I think he figured out how to turn it on, but when he did, strange things started to happen.\"\"We didn't know it then, but it turns out the device was stolen from a government facility. I don't know where they got it, that is more classified than this deposition. I can tell you with absolute certainty that they didn't make it themselves. I'd like to tell you more, but I don't think I'm allowed.\"\"Anyway, someone at the university needed to get Dr. Karlyn out of the way and falsely accused him of inappropriate conduct with a student. He could have fought it, the dean believed him, but he decides to leave the school anyway. Before he goes, he gives his computer to Professor Jennings and he gives me a letter of recommendation, so after I help deliver and setup the computer, she agrees to hire me.\"\"The first night it is up and running, at least two attempts are made to hack into the computer. I forgot to mention that even before I deliver the computer, this guy tries to break in and steal something from it, but I was there and he didn't get anything.\"\"I can't divulge any secrets about Professor Jennings' project here, but my part is to prove that her process would work if she were given enough computer resources, so I re-write her process to work across a network and run on thousands of computers.\"\"That's when things got really crazy. Someone keeps trying to hack into our computer; someone hacks the entire school and the phone company. Professor Jennings' secretary is kidnapped. The FBI gets involved, but they're chasing the wrong people for reasons only they can tell you.\"\"Then someone plants a virus on our computer and the next thing we know, it's spread all over the internet, including some very sensitive government computers. Meanwhile, our project continues to gain speed and surpass anyone's expectations.\"\"When the FBI come in and learn that the device that was given to Dr. Karlyn is actually some super cool futuristic computer that is able to grow and build more circuits for itself, they want to disconnect the computer and confiscate it.\"\"That's when computers all over the world go out of control. The pentagon and all the armed forces are helpless. Air traffic is grounded. All the computer problems are traced back to the professor's computer. The FBI want it dismantled more than ever, but the academics involved want to get the device to relinquish control over the world before they do.\"\"And, well, I guess that's all I'm allowed to say, thank you.\"",
  "genres": [],
  "author": "Jonni  Jordyn",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/16034284-the-mother-of-all-viruses"
}