{
  "title": "The Guardians of Time",
  "description": "Food riots. Resource wars. Catastrophic storms. Unprecedented mass extinctions. Coincidence? By the middle of the twenty-first century, the world is out of time. On the brink of a global environmental cataclysm, a physicist attempting to harness the ultimate renewable clean-energy source offers the only remaining option to delay the imminent time travel. But while helping to save the world through the method he develops-a mysterious and otherworldly combination of physics and metaphysics-Mark Lawson unwittingly plants the seeds for its misuse by those who have everything to gain from engineering a future where they make the rules. He has discovered the key to the most extreme potential weapon of mass destruction ever known to man, and now it must be controlled. Forty-five years later, in a fragile world still recovering from near devastation, in which the secret of 'relativistic diving' has fallen into the wrong hands, the men and women of a covert intelligence organization quietly fight an undeclared war against a new kind of enemy-one that wields temporal terrorism as a weapon. Using the techniques first developed by Lawson, the Guardians are engaged in a life-and-death struggle to preserve the integrity of world history. But while they battle to prevent civilization as they know it from being changed forever, they begin to discover that the enemy may not be who, or what, they think it is. Set largely in Greece, the riveting first novel in The Guardians series by author DAMIAN LAWRENCE deftly blends history and fiction to guide the reader through a thrilling web of intrigue and adventure spanning three centuries. From the heroism and tragedy of the Greek War of Independence, to the Great Game between the world's major powers and the ascendance of a New World Order, The Guardians of Time explores social, moral and spiritual questions that are highly relevant to our own time in an exciting and thought-provoking narrative.",
  "genres": [],
  "author": "Damian Lawrence",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/10620637-the-guardians-of-time"
}