{
  "title": "Of the Knowledge of Good and Evil",
  "description": "Operation: Middle of the Garden is a top secret government and military operation running under the nose of the American public in Washington, D. C. Eight years ago, troops in Afghanistan stumbled upon the remains of what looked to be the Garden of Eden. The skeletal remains of two trees peeked through centuries-worth of sand and debris. The soldiers who discovered the trees were coerced into being test subjects for the trees’ fruit. The fruit from the supposed Tree of Eternal Life turned the men immortal. Now, the Operation seeks to test the fruit from the second tree: the Tree of the Knowledge of Good and Evil.Jericho Edwards was the first test subject at the inception of Operation: Middle of the Garden. When he viewed his nurse Emily Kent for the first time, a mysterious Voice whispered, “The One,” to him. Jericho and Emily immediately became soul mates, a phenomenon caused by the fruit that became known as Impulse pairing, but Emily died a short while later due to a complicated pregnancy. Jericho has never been the same. He remains in the compound of the Operation because he has no desire to live, yet no other option but to live. He agrees to test the fruit of the Tree of the Knowledge of Good and Evil so he is of some use to the compound. Dahlia Gutierrez is a convicted criminal. When faced with prison or joining Operation: Middle of the Garden, Dahlia immediately chooses to become a test subject for both trees. She has a secret, and she needs the kind of potential freedom to flee at the drop of a hat that prison would impede. One thing’s for sure: she’s learned a lot from her past, and she’s going to do whatever it takes to make sure she never makes those mistakes again. The biggest lesson she’s learned? That she can only depend on herself.",
  "genres": [
    "Paranormal",
    "Paranormal Romance"
  ],
  "author": "Micah Persell",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/16035810-of-the-knowledge-of-good-and-evil"
}