{
  "title": "Violeta y el Camino de los 22 Arcanos",
  "description": "La protagonista, Violeta, es una joven psicóloga que parte de la Argentina durante el año 1977, época de éxodos y exilios. Se va a Europa, sin demasiada claridad acerca de sus metas o del rumbo a seguir. En Santiago de Compostela, gracias a las instrucciones de una maestra de Tarot, María de Ouro (personificación de La Sacerdotisa), tiene un primer atisbo del porqué de su viaje. Ese porqué se irá desvelando de a poco, mientras viaja por España y otros lugares de Europa a lo largo de nueve años.  Tiene encuentros con diferentes personajes, como Simón (mago chileno), Vidya-das (maestro espiritual), Lupe (pintora valenciana), Pocho Méndez (exiliado argentino), y muchos otros, que la ayudan o le enseñan o avanzan junto a ella. Hay romances, pareja, amigos, aventuras, mientras aprende, crece interiormente, se transforma.  La evolución de Violeta (y de algunos otros personajes), sus experiencias y comprensiones, son un tránsito por veintidós espacios arquetípicos: los veintidós capítulos de la novela expresan e ilustran a los 22 Arcanos Mayores del Tarot, símbolos perfectos de Arquetipos universales. Y a medida que la protagonista transita por esos veintidós espacios, sintoniza -tanto internamente como en lo que experimenta externamente- con las energías arquetípicas correspondientes.  La lectura de la novela, de por sí iniciática -porque inicia en el conocimiento de las cosas ocultas y sagradas- permite que los lectores también sintonicen con dichas energías. Sus veintidós capítulos se convierten en una estructura simbólica que nos conecta con los Arquetipos que representan.  Con fuertes elementos autobiográficos, la escritura de la novela suscitó curiosas experiencias en su autora, experiencias que dieron lugar a una larga y profunda investigación en el tema de los Arquetipos, a talleres de autodescubrimiento, y posteriormente al manual vivencial Camino de los 22 Arcanos.",
  "genres": [],
  "author": "Savitri Ingrid Mayer",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/16036078-violeta-y-el-camino-de-los-22-arcanos"
}