{
  "title": "Almost a Turkish Soap Opera",
  "description": "Adel and Kamil, two young good looking Turkish men try to immigrate to North America. Adel's ruthless grand uncle arranges him to marry Yonka (his spoiled obnoxious cousin) in exchange for his immigration status in Canada. The problem is Yonka and Adel hate each other. The drama heats up even more when Adel has an affair with Nora, his beautiful English teacher which ruins Yonka's plans. And to add to this, his best friend Kamil has a big secret of his own. How did his life turn into a Turkish soap opera?Available on Amazon, Kobo, Barnes and Noble, Smashwords, iTunes, All Romance, and www.anne-raevasquez.com.The novel paints a vivid portrayal of the lives and struggles of young modern Muslim adults trying to make a life in the West. The story will attract audiences of popular contemporary movies such as the Kite Runner and the Brick Lane. Anne-Rae Vasquez, a freelance journalist for an online magazine, wrote the novel, Almost a Turkish Soap Opera, Gathering Dust - a collection of poems, and Teach Yourself Great Web Design in a Week, published by Sams.net (a division of Macmillan Publishing).Almost a Turkish Soap Opera is a directorial debut, an original screenplay and novel by Anne-Rae Vasquez. Her love of watching Turkish soap opera series (dubbed in Arabic) inspired her to write a story in the style of a modern day Turkish soap opera.The feature film screenplay was produced by Joseph Khalil, Sababa Emporium Film Productions (http://www.sababaemporium.com) with AR Films into an award winning feature film, short film and series.Season 1 of the Web series, which is a prequel to the feature film, was launched in December 2011 as a weekly one 5 minute episode released on their YouTube channel and has since been syndicated on BlipTV, iTunes Video podcast, Web Series Channel, Mingle Media TV, Open Film channel, Viki Channel, Daily Motion, Web Series Network and more.The interest in the film and the web series is reflected on the Almost a Turkish Soap Opera Facebook fan page which now has over 9300 fans and their YouTube channel has over 8200 subscribers and 215,000+ views. The movie is available on DVD, BluRay and Video on Demand (online) www.almostaturkishsoapopera.com.Updated information can be found at www.almostaturkishsoapopera.com .",
  "genres": [
    "Fiction"
  ],
  "author": "Anne-Rae Vasquez",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/16038867-almost-a-turkish-soap-opera"
}