{
  "title": "Always You",
  "description": "Anne has always done what her family has asked of her, including giving up her own dreams of being a vet and breaking up with the perfect boyfriend...the one who just returned to town richer, hotter, and more heartbreaking than ever. With nothing to lose, will Anne finally ignore what everyone else tells her and go after her heart's desires? * * * Dive into the fabulous, fun lives of six Academy girls as their friendships are tested, torn and ultimately triumph… The last thing that the girls at the elite Jane Austen Academy need is hot guys to flirt with. But over the summer the school has been sold, and like it or not, the guys are coming. And it’s about to turn the Academy—and the lives of its students—totally upside down… The Jane Austen Academy series are modern retellings of Jane Austen classics set at a beachside California boarding school. Don't miss the rest of the Jane Austen Academy, where sassy girls, hot guys and Jane Austen collide! Book 1: Fall For You (Lizzie – Pride and Prejudice) Book 2: So Into You (Ellie – Sense and Sensibility) Book 3: When I'm With You (Kat – Northanger Abbey) Book 4: Suddenly You (Fanny – Mansfield Park) Book 5: Only With You (Emma – Emma) Book 6: Always You (Anne – Persuasion) Now with a reader's discussion guide for your book club, student group, or Jane Austen fan club. * * * Praise for The Jane Austen Academy A What’s Hot Pick – RT Book Reviews A unique twist on a classic… A compelling mix of action, drama and love. – Kirkus Reviews (starred review) Engaging characters, a gentle romance, budding friendships, and a payoff that is incredibly rewarding. – Indie Jane The same modern and young feel as The Lizzie Bennett Diaries. – Lost Beyond The Wall I love Cecilia Gray's Jane Austen Academy books! I recommend them to my students regularly - what a great way to bring Austen's classic stories forward for a modern audience. . – Pimples. Popularity and Protagonists Cute. Adorable. Genius. Amazing. I'm running out of synonyms...I loved all the friendships! Girl power! – Monique Morris, Goodreads Another awesome Austen innovation! – Cheryl Beck, Educator An incredibly charming novel - a heroine worth cheering for! – Growing Up YA \"An instant favorite!\" —Electively Paige Reviews Whether you’re a romantic or a Jane Austen fan, you can’t help falling for this book.. - EZ Read I can visualize a cult following. Bravo! – Reader’s Favorite Its own story cleverly woven within the classic. ~ Book Haven Extraordinaire The series is getting better and better. – Nikki Harriet, Goodreads Gray's characters are so full of life, hope and dreams, it's a pleasure to read about them. – Schenni's Book Nook You should read this book if you like sweet romances and great friendships that are strong enough to last through anything. ~ Wonderous Reviews",
  "genres": [
    "Young Adult",
    "Romance",
    "Contemporary",
    "Teen"
  ],
  "author": "Cecilia Gray",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/16039714-always-you"
}