{
  "title": "Churchill: The Unexpected Hero",
  "description": "Churchill was the only British politician of the twentieth century to become an enduring national hero. His unique image, complete with V-sign, giant cigar, and outlandish costumes, was as universally famous as Charlie Chaplin's tramp. Now, in Churchill, The Unexpected Hero , Paul Addisonoffers a major reassessment of this highly charismatic figure, focusing largely on the life-long battle over Churchill's reputation.\"Churchill's career,\" notes Addison, \"was one of snakes and ladders.\" The longest of the \"snakes\" was Gallipoli, the ill-starred military campaign that all but destroyed his career in 1915. After Gallipoli, Churchill's reputation plummeted, and he was attacked as a shameless egotist, anopportunist without principles or convictions, an unreliable colleague, an erratic policy-maker who lacked judgement, and a reckless amateur strategist with a dangerous passion for war and bloodshed. Indeed, throughout his career, at one time or another, Churchill offended every party and faction inthe land. Yet all but the most hostile also conceded that he possessed great abilities, remarkable eloquence, and a streak of genius, and with the coming of World War II, the man long excluded from high office--on the grounds that he was a danger to King and Country--became the savior of thatcountry, a truly great war leader. As Churchill's reputation skyrocketed, Addison shows how his heroic self-image was communicated to the world through a stupendous public relations campaign in which oratory, journalism, and history were all pressed into service.Churchill won two great victories in World War II. The first was a victory over Nazi Germany. The second, a victory over the legion of skeptics who derided his judgement and denied his claims to greatness.",
  "genres": [
    "Biography",
    "History",
    "Nonfiction",
    "Politics",
    "World War II"
  ],
  "author": "Paul Addison",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/1604091.Churchill"
}