{
  "title": "Age/Sex/Location \"Love is just a click away\"",
  "description": "Spiraling out of control after her fiancé Steve calls off their wedding, Jo locks herself in her office, powers up her computer, and begins searching for something to take her mind off of the pain. Fueled by tequila and a broken heart, the abandoned bride-to-be logs into a chat room where she tries in vain to ignore the overwhelming feelings of loss, pain, and frustration.Despite the uncontrollable tears and swirled vision, Jo finds herself chatting with Navyman2000, a young sailor stationed on the opposite coast who is studying for the submarine service in the U.S. Navy. He bends a sympathetic virtual ear as she describes her relationship woes, cheers her on when she exaggerates the success of her small business, and shares his own story about growing up in the Midwest and joining the military.Jo has difficulty coming to grips with the many obstacles in her life and finds herself constantly masking the sting of truth with the comforts of her addiction to pills and alcohol. With halfhearted attempts at reconciliation with her former fiancée and the economic downturn that threatens to destroy her hotel supply company, life becomes an emotional rollercoaster which seems, to her, impossible to survive.Despite her habit of telling half-truths, denial of her addictive disease, and a pattern of pulling up stakes when things get rough, Navyman2000 continues to meet with Jo online. Through the blinking curser in an instant message box Jo finds herself suffocating beneath the tenderness of a man she’s never met, running from the possibility of a love rekindled, and chasing a high that could cost the ultimate price—her life.Follow Jo’s misguided quest for love as she ignores the yearning of her heart, chases lustfully after risky strangers, and searches to find her true self in the most unexpected places.",
  "genres": [],
  "author": "Denise Kawaii",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/16041175-age-sex-location-love-is-just-a-click-away"
}