{
  "title": "Best Served Cold",
  "description": "Dust jacket and interior illustrations by Raymond SwanlandFrom the Author's Website:“Revenge is a dish best served cold.”—Pierre Choderlos de LaclosSpringtime in Styria. And that means war.There have been nineteen years of blood. The ruthless Grand Duke Orso is locked in a vicious struggle with the squabbling League of Eight, and between them they have bled the land white. While armies march, heads roll, and cities burn, behind the scenes bankers, priests and older, darker powers play a deadly game to choose who will be king.War may be hell, but for Monza Murcatto, the Snake of Talins, the most feared and famous mercenary in Duke Orso's employ, it's a damn good way of making money too. Her victories have made her popular—a shade too popular for her employer's taste. Betrayed, thrown down a mountain and left for dead, Murcatto's reward is a broken body and a burning hunger for vengeance. Whatever the cost, seven men must die.Her allies include Styria's least reliable drunkard, Styria's most treacherous poisoner, a mass-murderer obsessed with numbers and a barbarian who just wants to do the right thing. Her enemies number the better half of the nation. And that's all before the most dangerous man in the world is dispatched to hunt her down and finish the job Duke Orso started…Springtime in Styria. And that means revenge.Limited: 500 signed numbered hardcover copiesLettered: 26 signed lettered hardcover copiesIf you would like us to match your number or letter for Before They are Hanged, please send an email to subpress@gmail.com with this information when ordering.From George R. R. Martin:“Joe Abercrombie's Best Served Cold is a bloody and relentless epic of vengeance and obsession in a grand tradition, a kind of splatterpunk sword 'n sorcery Count of Monte Cristo, Dumas by way of Moorcock. His cast features tyrants and torturers, a pair of poisoners, a serial killer, a treacherous drunk, a red-headed warrior and a blood-soaked mercenary captain. And those are the good guys… The battles are vivid and visceral, the action brutal, the pace headlong, and Abercrombie piles the betrayals, reversals, and plot twists one atop another to keep us guessing how it will all come out. This is his best book yet.”From Publishers Weekly (Starred Review):“Abercrombie is both fiendishly inventive and solidly convincing, especially when sprinkling his appallingly vivid combat scenes with humor so dark it's almost ultraviolet.”From the Times:“Joe Abercrombie is probably the brightest star among the new generation of British fantasy writers… Abercrombie never underestimates the horrors that people are prepared to inflict on one another, or their longlasting, often unexpected, consequences. Abercrombie writes a vivid, well-paced tale that never loosens its grip. His action scenes are cinematic in the best sense, and the characters are all distinct and interesting.”",
  "genres": [
    "Fantasy",
    "Fiction",
    "Audiobook",
    "Epic Fantasy",
    "Dark Fantasy",
    "High Fantasy",
    "Adventure"
  ],
  "author": "Joe Abercrombie",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/16041084-best-served-cold"
}