{
  "title": "Theory U: Leading from the Future as it Emerges",
  "description": "In this ground-breaking book, Otto Scharmer invites us to see the world in new ways. Fundamental problems, as Einstein once noted, cannot be solved at the same level of thought that created them. What we pay attention to, and how we pay attention - both individually and collectively - is key to what we create. What often prevents us from attending is what Scharmer calls our blind spot, the inner place from which each of us operates. Learning to become aware of our blind spot is critical to bringing forth the profound systemic changes so needed in business and society today. First introduced in Presence, the U methodology of leading profound change is expanded and deepened in Theory U. By moving through the \"U\" process we learn to connect to our essential Self in the realm of presencing - a term coined by Scharmer that combines the present with sensing. Here we are able to see our own blind spot and pay attention in a way that allows us to experience the opening of our minds, our hearts, and our wills. This wholistic opening constitutes a shift in awareness that allows us to learn from the future as it emerges, and to realize that future in the world. Theory U explores a new territory of scientific research and personal leadership, one that is grounded in real life experience and shared practices. Scharmer shares much from his own personal and professional development, and draws from a rich diversity of compelling stories and examples. Readers will find themselves drawn to new ways of thinking and acting as they read, completing a parallel journey of exploration and discovery. The final chapters lay out principles and practices that allow everyone to participate fully in co-creating and bringing forth the desired future that is working to emerge through us.",
  "genres": [
    "Leadership",
    "Business",
    "Nonfiction",
    "Psychology",
    "Management",
    "Self Help",
    "Philosophy"
  ],
  "author": "C. Otto Scharmer",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/1062310.Theory_U"
}