{
  "title": "Island Girls",
  "description": "NATIONAL BESTSELLERNancy Thayer returns to her beloved Nantucket in a highly emotional, wholly entertaining tale of three sisters forced to confront the past over one event-filled summer on the island.  \nLook for special features inside. Join the Random House Reader’s Circle for author chats and more.\n\nCharming ladies’ man Rory Randall dies with one last trick up his sleeve: His will includes a calculating clause mandating a summer-long reunion for his daughters, all from different marriages—that is, if they hope to inherit his posh Nantucket house. Relations among the three sisters are sour thanks to long-festering jealousies, resentments, and misunderstandings. Arden, a successful television host in Boston, hasn’t been back to the island since her teenage years, when accusations of serious misbehavior led to her banishment. College professor Meg hopes to use her summer to finish a literary biography and avoid an amorous colleague. And secretive Jenny, an IT specialist, faces troubling questions about her identity while longing for her sisters’ acceptance.   To their surprise, the three young women find their newfound sisterhood easier to trust than the men who show up to complicate their lives. And if that weren’t problematic enough, their mothers descend on the island. When yet another visitor drops by the house with shocking news, the past comes screaming back with a vengeance. Having all the women from his life under his seaside roof—and overseeing the subsequent drama of that perfect storm—Rory Randall might just be enjoying a hearty laugh from above.   Nancy Thayer’s novel insightfully illustrates how the push and pull of family altercations make us whole. It’s how the Randall sisters come to forgive, and learn to open their hearts to love.Praise for Island Girls“Nancy Thayer is one of my favorite writers, and Island Girls is one of her best. The Randall sisters are like your own family members or your best friends: funny, smart and emotional, infuriating and good-hearted. Here is a book to be savored and passed on to the good women in your life.”—New York Times bestselling author Susan Wiggs   “Full of emotion and just plain fun, this novel is delightful.”\n—Romance Reviews Today\n“In this touching summer read, forgiveness benefits both the person bestowing it and the recipient.”—Kirkus Reviews",
  "genres": [
    "Fiction",
    "Chick Lit",
    "Romance",
    "Audiobook",
    "Womens Fiction",
    "Contemporary",
    "Adult Fiction"
  ],
  "author": "Nancy Thayer",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/16041844-island-girls"
}