{
  "title": "Shores of Tripoli",
  "description": "BarbarianSpy contains frequent rough sex, punishment, and BDSM.Coming into his majority in the Boston merchant world of 1801 and having been brutally initiated into man sex during a roadside encounter, the merchant’s son and printer’s apprentice, Billy, begins a life of discovery of what he wants from another man. He thinks he wants—and deserves—rough taking and punishment, but not all of his lovers agree. The call of the sea and early linking up with a pirate chieftain lead him into a life where, though he is deemed too small and fair of looks to be trusted among common seaman, the men of the sea win through on finding their own purposes for him.Billy’s story leads him from nominally prim Boston to hedonist Charleston and the slaves of a South Carolina rice plantation and then on across the Atlantic to the Azores and the Mediterranean.The saga of Billy’s sexual adventures and seekings are backdropped in Shores of Tripoli by piracy on the East Coast of the young United States, piracy on the Atlantic at the beginning of the nineteenth century, and American’s engagement in the Barbary Coast antipiracy wars in the Mediterranean. The Barbary Coast wars, storming up on the shores of Tripoli, provided the first foreign land battles that the young United States engaged in as well as the first use of U.S. Marines—and our young Billy was there to see and experience it all.Billy’s story is one of possession by a succession of naval chieftains—pirate and U.S. Navy alike, as well as randy and fit Marines and Arab potentates—and also of men who try to convince him that sex can be more equal and romance based. The question remains of what maturity and time leads him to believe and accept as the sexual experience he most wants.(Also available in paperback)Review Black Tulip (Confessions from Romaholics) - 4 STARS but it’s more like 4.5\"I swear I don't remember having read a novella with so many twists and turns! There was already a lot going on in Dirk Hessian's last book \"Constantinople\", but I think this one sets a new record ... and in my opinion, the pacing is a tour de force! The author definitely has the knack of grabbing you and drawing you into his story and not letting you go until it ends.\"",
  "genres": [
    "Pirates"
  ],
  "author": "Dirk Hessian",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/16042170-shores-of-tripoli"
}