{
  "title": "Romantic Tales: Bedtime Stories Episode 2",
  "description": "Author Ty Langston's: CRAVEPreview of Episode 2Exhausted and burnt out due to a mix of long hours and a steady diet of working hardened news stories, left Harper at a loss when she met the magnetic and mysterious lead singer of Crave, Cass St. Marie.She was drawn to him, yet frightened. What was he? Who was he? Did he have anything to do with Darien’s disappearance?Desperate for the truth, the more she talked with him, the more attracted she became. Did he really have the answers she sought or was he a distraction of something more sinister. Author Tigris Eden's: The Genesis ProjectPreview of Episode 2Xander Treegold sees something in Genesis that he can’t explain. Is it her oddity that captures him or her innocence? Xander’s never taken no for an answer when it comes to getting what he wants and at every opportunity that is given to him Xander seems to fail miserably. That is until he pulls Genesis into a dark alcove in the Great Hall where others are preparing for their journey back to New Earth for Luna.Will Genesis succumb to his attentions or will she once again deny him the only thing he’s ever truly wanted…. Her.Politics and other’s seem to get in the way of his every intentions and as Luna approaches so does the private tasting he’s invited Genesis to. Will she indulge like the rest of them, or will she stand in the back, watching, wanting, and needing to be tasted as much as the next female. Gen is happy to finally be back home with her father Vaggo, and as short as this homecoming is, she is determined not to let the outside influence of Xander Treegold convince her of his intentions. With Adam constantly showing up at her door step, attempting to sway her away from his soon to be brother –in-law she finds that Professor Aylet is correct in her assumptions. There are two males that make her question her every feeling.Adam’s sultry scent and Xander’s fire.",
  "genres": [],
  "author": "Ty Langston",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/16042325-romantic-tales"
}