{
  "title": "En episode i en landskabsmalers liv",
  "description": "«Una pequeña máquina de fabricar belleza, una manera feliz de describir la a veces invisible luz argentina» Guillermo Saavedra, La NaciónJohan Moritz Rugendas, a quien el mismo Humboldt admiraba como un maestro en el arte pictórico de la fisonomía de la naturaleza, fue el mejor de los pocos pintores viajeros que hubo en Occidente. De su segundo viaje a América resultaron miles de óleos, acuarelas y dibujos cuyo objeto fueron primordialmente las selvas y las montañas tropicales. Pero el objetivo secreto de su viaje fue Argentina: solo allí, pensaba, podría encontrar el reverso de su arte. La visitó en dos ocasiones: en 1847, en Buenos Aires, registró en abundancia los paisajes y tipos rioplatenses, y fue ésta su visita más fructífera. Diez años antes, sin embargo, una breve y dramática visita a Mendoza le dio la ocasión de aventurarse al centro soñado. Sobre el rastro de las carreteras gigantes, Rugendas se puso en el camino de la recta interpampeana a la espera de aquello que, por fin, desafiara a su lápiz y lo obligara a crear un procedimiento nuevo.Lo acompañó el pintor alemán Robert Krauze. Sin duda, Rugendas rozó, al menos por unos instantes, ese centro imposible, solo que a un precio muy alto, casi exorbitante. Un extraño episodio, que no pudo evitar absorber, salvajemente, en su cuerpo entero, interrumpió la travesía y marcó de un modo irreversible, y fulminante, su vida, su arte y su juventud.La crítica ha dicho...«El personaje de este libro es el paisajista Rugendas, el pintor que registra con lápices febriles una realidad donde todo lo excede. Aira lo sigue de cerca; el retratista tiene un testigo no menos preciso. Rugendas contempla las carretas enormes y lentísimas que tardan varias generaciones en ir de una aldea a otra: la vida parece medirse en eras geológicas hasta que una tarde de borrasca el artista es alcanzado por un rayo. Su carne se electriza y tuerce y deforma. El pintor cae del caballo, en plena combustión...»Juan Villoro",
  "genres": [
    "Fiction",
    "Art",
    "Historical Fiction",
    "Latin American",
    "Spanish Literature",
    "Literature",
    "Novella"
  ],
  "author": "César Aira",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/16042397-en-episode-i-en-landskabsmalers-liv"
}