{
  "title": "The Gatekeeper on the Docks",
  "description": "Nigel isn’t finding his work particularly fulfilling these days. Being a Gatekeeper to the dead and living on a specially commissioned narrow boat on a specially built canal annex to Gloucester Docks sounded fun at first but the years of service to the recently re-branded after-life have left him isolated and bored of life. Only ever getting to meet dead people, demons and Grim Reapers doesn’t give him much opportunity to make friends and have a social life. At least his job is recession proof. Increasingly losing faith in the competency of his superiors on the other side and rapidly developing a case of boat envy to the other boats in the docks, Nigel is getting more and more desperate for some sort of a normal life. Nigel gets his chance to befriend and interact with real, living, human beings when he has a chance meeting with Charlie, a familiar face from his past. Although Charlie and her friends aren’t especially grounded in reality either, they do seem to welcome Nigel into their small group. Nigel’s little corner of the Mortal world is in for a bit of a shock though. A political storm from beyond the grave is threatening to spill over into Nigel’s world. Nigel’s bosses are locked in a bitter power struggle and conspiring to take over the after-life, which could lead to big changes to the rules that govern death and the spiritual world. Can Nigel lead the normal life he so craves and keep his job as a Gatekeeper to the Dead? Can he keep his friends from finding out the truth of what he does? Just why does Charlie have such a vendetta against Ringo Starr? Are demons really all evil? The Gatekeeper on the Docks is a comedy fantasy about music, apathy, conspiracy and death. *Contains adult language, gratuitous tea use and scenes of a demonic nature.",
  "genres": [],
  "author": "Tess Stenson",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/16042562-the-gatekeeper-on-the-docks"
}