{
  "title": "All Hell Breaks Loose",
  "description": "In the City, the Werewolves are restless. Gabi is striving to get back to life as usual. Dealing with the aftermath of being kidnapped and tortured by Dantè, wrapping her head around being a Dhampir, and trying to figure out Julius’s unexpected attitude as he withdraws from her and becomes cool and distant. As if that isn’t enough to cope with, she receives the disturbing news that someone she cares about has been dragged unwillingly into her world after a brutal and calculated Werewolf attack. As rogue Werewolves run rampant through the City, it becomes clear there will be no gentle reintroduction to Gabi's duties as Hunter for the Societas Malus Venatori. Once again the Vampires join forces with the SMV to contain the threat, but the odds seem stacked against them and the casualties keep mounting. Tensions run high as the perpetrators manage to stay one step ahead of the Hunters and the senseless violence continues. No one suspects betrayal from within, until Gabi’s pets unmask a traitor. But the traitor isn’t the real threat and the war has only just begun.This time their nemesis isn’t playing by any rules and no one is safe in this deadly, new game. Not even the Master Vampire of the City. As the undeniable chemistry between Gabi and Julius reignites, they realise the danger isn’t only to the human population of the City, but threatens to overwhelm them all. What they finally uncover brings Gabi into very real conflict with the SMV Council and leaves her questioning her life-long allegiances. Not all monsters come in obvious monster packages and sometimes what you’re fighting to protect is what you should be fighting against. Not everyone will walk away from this fight intact. Strap in, hang on and grab a breath while you can. All hell is about to break loose!\"The Hellcat series is one wild ride ... one of the best new series to hit the dark urban fantasy world, ever! Two words: more, please.\" Diane Nelson (Sand in my Shoes Reviews)",
  "genres": [
    "Urban Fantasy",
    "Vampires",
    "Paranormal",
    "Magic",
    "Fantasy",
    "Romance",
    "Werewolves"
  ],
  "author": "Sharon Hannaford",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/16042996-all-hell-breaks-loose"
}