{
  "title": "How to Create the Perfect Wife: Britain's Most Ineligible Bachelor and His Enlightened Quest to Train the Ideal Mate",
  "description": "Thomas Day, an 18th-century British writer and radical, knew exactly the sort of woman he wanted to marry. Pure and virginal like an English country maid yet tough and hardy like a Spartan heroine, she would live with him in an isolated cottage, completely subservient to his whims. But after being rejected by a number of spirited young women, Day concluded that the perfect partner he envisioned simply did not exist in frivolous, fashion-obsessed Georgian society. Rather than conceding defeat and giving up his search for the woman of his dreams, however, Day set out to create her.So begins the extraordinary true story at the heart of How to Create the Perfect Wife, prize-winning historian Wendy Moore’s captivating tale of one man’s mission to groom his ideal mate. A few days after he turned twenty-one and inherited a large fortune, Day adopted two young orphans from the Foundling Hospital and, guided by the writings of Jean-Jacques Rousseau and the principles of the Enlightenment, attempted to teach them to be model wives. After six months he discarded one girl, calling her \"invincibly stupid,” and focused his efforts on his remaining charge. He subjected her to a number of cruel trials—including dropping hot wax on her arms and firing pistols at her skirts—to test her resolve but the young woman, perhaps unsurprisingly, eventually rebelled against her domestic slavery. Day had hoped eventually to marry her, but his peculiar experiment inevitably backfired—though not before he had taken his theories about marriage, education, and femininity to shocking extremes.Stranger than fiction, blending tragedy and farce, How to Create the Perfect Wife is an engrossing tale of the radicalism—and deep contradictions—at the heart of the Enlightenment.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "18th Century",
    "British Literature",
    "Historical",
    "Womens"
  ],
  "author": "Wendy Moore",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/16043567-how-to-create-the-perfect-wife"
}