{
  "title": "After Hamelin",
  "description": "Implicit in many folk and fairy tales is the question, 'Then what?' After Hamelin picks up the story where the Robert Browning poem - or other tellings of The Pied Piper of Hamelin - leaves off. In a quest that is both contemporary and timeless, Bill Richardson creates a magical world through inventive wordplay, uninhibited imagination and a facility with rhyme. Here is a raconteur who spins a narrative tale that takes readers into strange lands inhabited by unusual characters, both good and evil, where adventure abounds and unlikely saviors emerge. Penelope is 101 years old, but she can remember the story like it happened yesterday. On the morning of her eleventh birthday, she wakes to discover she can no longer hear. It is on this same day that the Piper returns to Hamelin to spirit the children away in an evil act of revenge upon the townspeople. Spared because she is deaf to the Piper's bewitching tune, Penelope is left to grieve the loss of her friends and beloved sister Sophy until Cuthbert, the wise man of the village, reveals that Penelope possesses the unusual gift of deep dreaming. Armed only with a charm from Cuthbert and her own courage, Penelope enters the land of sleep on a treacherous quest to rescue the stolen children. There is suspense, humor and high excitement (wrapped in dark undercurrents) as Penelope and the companions she meets along the way - Scally, her trusted cat; Alloway, the blind harpist; Ulysses, a three-legged dog; and Quentin, a dragon who loves skipping - journey to the Piper's mountain fortress. Their combined wits and talents see them through strange landscapes and close calls. In a thrilling climax played out in a mysterious place between dreaming and waking, they triumph over the Piper and set the children of Hamelin free.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Childrens",
    "Fiction",
    "Retellings",
    "Fairy Tales",
    "Canada"
  ],
  "author": "Bill Richardson",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/1604437.After_Hamelin"
}