{
  "title": "The Zombie Always Knocks Twice",
  "description": "Hollywood, California, is known for swimming pools,movie stars…and now the risen dead.Hollywood can be a difficult place to grow up, especially if you’re Kristine Golden, a fifteen-year-old necromancer with a sworn duty to lay the risen dead back to rest and no desire to be in the movie business.When handsome deadie Alex Romero swaggers into her life, Kris must keep her promise, despite her growing feelings for him. If that’s not enough to give a girl a headache, a murderous zombie comes knocking at Kris’s door, rocking her world and threatening her family.Can Kris solve the mystery of the rampaging zombie before someone else winds up dead? Or will the walking dead take over Hollywood and turn it into…Hollyweird?REVIEWS:\"The Zombie Always Knocks Twice is your 'backstage pass' to the hidden underbelly of Hollywood, the one few tourists get to see, where there are almost as many 'Deadies' as there are starlets. In this trailblazing mash-up of zombies and movie buffs, E. Van Lowe puts the 'weird'—not to mention totally awesome—in Hollyweird! It's Buffy meets Entourage—with a little Columbo thrown in for good measure—in this incredibly hilarious, twisted, action-packed mash-up of zombies, necromancers, murder, made for TV movies and a fair sprinkling of old Hollywood lore for good measure. Whip-snap pacing, a kick butt heroine, a plot involving zombies, starlets, movie studios, murder, mystery and enough shady characters to fill Central Casting, The Zombie Always Knocks Twice is your ticket to a grand adventure worthy of the big screen.\" —Rusty Fischer, author of Zombies Don't Cry\"If you want an insight into the secret underworld of Hollyweird, complete with zombies, grave goblins and fast-talking necromancers then look no further than The Zombie Always Knocks Twice. E. Van Lowe is a writing force to be reckoned with and you are in masterful hands from the first page to the last. I loved everything about this fabulous, funny, snarky book and am giving it a big zombie thumbs up!\" —Amanda Ashby, author of Zombie Queen of Newbury High\"Hooray for E. Van Lowe's The Zombie Always Knocks Twice, which breathes new life into the YA Paranormal genre with more than a little bit of tongue in cheek and a whole lot of fun. Lead by a teenage necromancer who loves to quote movie themes, wears pink fuzzy ear muffs and is desperately trying not to fail algebra, the cast of characters keeps the reader engaged and breathlessly awaiting the next installment.\" —The Paranormal Romance Guild",
  "genres": [
    "Young Adult",
    "Zombies",
    "Paranormal",
    "Humor"
  ],
  "author": "E. Van Lowe",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/16044735-the-zombie-always-knocks-twice"
}