{
  "title": "The Spy Who Loved: The Secrets and Lives of Christine Granville",
  "description": "Acclaimed biographer Clare Mulley tells the extraordinary story of Britain's first female special agent of World War II, a charismatic, difficult, fearless, and altogether extraordinary woman.The Untold Story of Britain's First Female Special Agent of World War IIIn June 1952, a woman was murdered by an obsessed colleague in a hotel in the South Kensington district of London. Her name was Christine Granville. That she died young was perhaps unsurprising; that she had survived the Second World War was remarkable. The daughter of a feckless Polish aristocrat and his wealthy Jewish wife, Granville would become one of Britain's most daring and highly decorated special agents. Having fled to Britain on the outbreak of war, she was recruited by the intelligence services and took on mission after mission. She skied over the hazardous High Tatras into occupied Poland, served in Egypt and North Africa, and was later parachuted behind enemy lines into France, where an agent's life expectancy was only six weeks. Her courage, quick wit, and determination won her release from arrest more than once, and saved the lives of several fellow officers - including one of her many lovers - just hours before their execution by the Gestapo. More importantly, the intelligence she gathered in her espionage was a significant contribution to the Allied war effort, and she was awarded the George Medal, the OBE, and the Croix de Guerre. Granville exercised a mesmeric power on those who knew her. In The Spy Who Loved, acclaimed biographer Clare Mulley tells the extraordinary history of this charismatic, difficult, fearless, and altogether extraordinary woman.",
  "genres": [
    "Nonfiction",
    "Biography",
    "History",
    "War",
    "Espionage",
    "World War II",
    "Book Club"
  ],
  "author": "Clare Mulley",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/16045166-the-spy-who-loved"
}