{
  "title": "Lincoln: How Abraham Lincoln Ended Slavery in America: A Companion Book for Young Readers to the Steven Spielberg Film",
  "description": "A new book—and companion to the Steven Spielberg film—tracing how Abraham Lincoln came to view slavery...and came to end it.Steven Spielberg focused his movie Lincoln on the sixteenth president's tumultuous final months in office, when he pursued a course of action to end the Civil War, reunite the country, and abolish slavery. Invited by the filmmakers to write a special Lincoln book as a companion to the film, Harold Holzer, the distinguished historian and a consultant on the movie, now gives us a fast-paced, exciting new book on Lincoln's life and times, his evolving beliefs about slavery, and how he maneuvered to end it.The story starts on January 31, 1865—less than three months before Lincoln's assassination—as the president anxiously awaits word on whether Congress will finally vote to pass the Thirteenth Amendment to the Constitution. Although the Emancipation Proclamation two years earlier had authorized the army to liberate slaves in Confederate territory, only a Constitutional amendment passed by Congress and ratified by three-fourths of the states would end slavery legally everywhere in the country.Drawing from letters, speeches, memoirs, and documents by Lincoln and others, Holzer goes on to cover Lincoln's boyhood, his moves from Kentucky to Indiana to Illinois, his work as a lawyer and congressman, his unsuccessful candidacies for the U.S. Senate and his victory in two presidential elections, his arduous duties in the Civil War as commander in chief, his actions as president, and his relationships with his family, political rivals, and associates. Holzer provides a fresh view of America in those turbulent times, as well as fascinating insights into the challenges Lincoln faced as he weighed his personal beliefs against his presidential duties in relation to the slavery issue.The passage of the Thirteenth Amendment would become the crowning achievement of Abraham Lincoln's life and the undisputed testament to his political genius. By viewing his life through this prism, Holzer makes an important passage in American history come alive for readers of all ages.The book also includes thirty historical photographs, a chronology, a historical cast of characters, texts of selected Lincoln writings, a bibliography, and notes.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography"
  ],
  "author": "Harold Holzer",
  "average_rating": "3.36",
  "url": "https://www.goodreads.com/book/show/16045326-lincoln"
}