{
  "title": "Parasylum",
  "description": "Parasylum originated from a montage of Paranormal Encounters over the many years I have researched deeply into the field of work. Working with integral individuals from scientists to investigators, it lends that factor of credence to the work itself within the book. What I have done is take the factual based element, twisted it with as much Horror/Thriller intent as I could give, which actually wouldn't be exaggerating what truly took place at some of the asylums I have investigated. The many experiments government agencies conducted on society during the early years of shock treatment, Thorazine drugging's and more are only a small portion of what cruelty did take place. You're going to find yourself involved deeply within the pages, becoming part of the investigative team that encounters a night of terror that will warp your mind beyond belief.A team of inexperienced paranormal investigators find themselves involved in the deepest darkest recesses of the unknown when they enter into Grandview's Asylum. The souls of yesteryear seek revenge on whomever enter into the abyss of no return. The horrors are plenty with many twists and turns and an ending that will keep you shaking your head. Enter into the mindscape where a dream turns into a nightmare and the nightmare is your reality.The mind is a complex yet simple frame to be in. We travel many different corridors to understanding, which at some point we become enlightened to what it is that plagues us. Enter the mindscape that transforms dreams into nightmares and nightmares into reality. The way we perceive life is only a perception with some, who share in the illusion of disillusionment. We create the path in which we walk, yet the trail upon which one steps could very well be a story that is never ending. Welcome to Parasylum, where what may seem impossible is possible and what might seem sinister is just plain evil! Anchored in the subjective mindset, he relinquishes his will to the inevitable. Everything seems to be of a set memory, glimpses from the past, forged into the now, leaving only the permeated sense of nothingness. Hung like a ragdoll in abject misery, the echoes of many shake the very foundation upon which the hallowed grounds cry. He closes his eyes, only to recount once more, everything over, and over again. There's no escaping this torture from within, welcome to your Nightmare!",
  "genres": [],
  "author": "Robbie Thomas",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/16045748-parasylum"
}