{
  "title": "A Cape May Diamond",
  "description": "A story of life, love, and a journey of a thousand years…It was Monday, May 19th, 1975. I’ll never forget that day. The Vietnam War had ended with the fall of Saigon that April, and the world was mired in one of its worst recessions ever. Unemployment in the United States was nearly nine percent, inflation even higher, and leadership lacking. The Watergate scandal had cast a smear across American politics, resulting in Richard Nixon’s resignation in August 1974 to avoid impeachment, and his successor’s immediately pardoning him to close the book on an unhappy chapter in U.S. history.It was not a good time for anyone and a particularly hard time for the old Victorian town of Cape May. The crown jewel of the New Jersey shore had fallen into neglect and disrepair and was dying a slow death. Once the elegant summer home to presidents and kings, it had become the last refuge of the deposed.That’s where I met Tom Ryan. Tom was a king, or so he would have you believe, but unlike Richard Nixon, when Tom was dethroned, he wasn’t sent home with a slap on the wrist. He was sent to prison. He was a convicted draft dodger, but one of the lucky ones released early by President Ford as part of his mass clemency after Nixon’s pardon. The problem was, Tom had nowhere to go when he got out, so he took the money his dad mailed to him and spent it on a bus ticket to get as far away as possible to a place where nobody cared who he was or what he had done, a place where nobody cared about anything. That place was Cape May.As hard a time as it was for everyone, it was harder for me because that was the day I met Tom Ryan. I should have turned and walked away. I knew it when he first looked at me, but I didn’t, not my first mistake, but one that would make Monday, May 19th, 1975 the hardest day of my life. This is the story of how Tom Ryan and I met and how things never quite work out the way you think. You might find a love story in here somewhere. You might not. You might find a message hidden in one of the nickel pop bottles collected by the beachcombers from some of the most beautiful white sand beaches in the world. You might even find a little mystery, but life is a mystery, isn’t it?",
  "genres": [
    "Fiction",
    "Historical Fiction"
  ],
  "author": "Larry Enright",
  "average_rating": "3.46",
  "url": "https://www.goodreads.com/book/show/16046559-a-cape-may-diamond"
}