{
  "title": "Black Art",
  "description": "\"I would have married her before I went away to war too, just to make sure that someone else didn’t. She was beautiful. It started in her eyes and spread to the set of her mouth and the tilt of her chin. In both pictures there was a confidence, a courage, a spirit of defiance... Not the “smile though your house is rubble and you’re sleeping in a tube station” spirit of the Blitz, but real steel. The kind of backbone that would make you do extraordinary things. Things that the rest us of wouldn’t do.\"Arty Shaw, a genealogist working on a peculiarly British island in the English Channel, is asked by a television company to research Helen Valentine's family tree. The award-winning British actress wants to know the truth about her grandmother's wartime exploits and Arty is her choice to do the digging; which is just fine by Arty. When a beautiful blonde like Helen Valentine asks, you don't say no.Arty’s investigation reveals that Helen’s grandmother, Kay Marett, was half-Jewish and running resistance ops against the German forces occupying her Island. When Kay disappears in 1942, a concentration camp seems to be her likely destination, until Arty uncovers a trail stretching from the Island, across Europe, to Cold War Dresden. As Arty learns more about Kay’s extraordinary wartime adventures, obstacles to the truth begin to appear in the form of a star of the Island’s amateur theatre, and two menacing East Europeans in suits. Arty must challenge his deepest beliefs to discover what happened to Kay.Written in the hard-boiled, noir style of detective fiction from the 1940's, Arty Shaw is the kind of investigator you want on your side. Transsexual and proud of it, with a moral code that means breaking the rules now and again, and a world weary cynicism that takes nothing at face value, Arty won't stop until the truth is out. And that can make you unpopular with the wrong sort of people.",
  "genres": [
    "Transgender",
    "Mystery",
    "LGBT",
    "Historical Fiction",
    "Fiction"
  ],
  "author": "V.T. Davy",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/16046406-black-art"
}