{
  "title": "Haven",
  "description": "This is an alternate Cover Edition for ASIN: B00C42TWTC.NEW YORK TIMES and USA TODAY BESTSELLING AUTHOR, ELLE CASEY, brings readers Book 4, the final installment in the YA Dystopian APOCALYPSIS Series, suitable for older teens and adults. HAVEN. My name’s Bryn Mathis. I'm seventeen years old, and I'm alive at a critical time in our world's history, unlike all the adults and babies who didn't survive the virus that almost wiped out the human race. Alliances are building, enemies are gathering, and everything's about to reach the boiling point. I'm in a race against time to get Haven ready for the final showdown, a confrontation that could very possibly destroy everything my friends and I have worked so hard to create. People I trusted have betrayed me. People who I thought were my enemies are not. Nothing is as it seems, and nothing will ever be the same for me, now that I've embarked on this one last adventure that could be the undoing of everything that is me.Content Warning: Mild violence and some foul language. Meant for older Young Adult readers (age 15+). This book is in the Dark Science Fiction / Horror / Post-Apocalyptic genres, featuring teen characters only.\nAPOCALYPSIS SERIES READING ORDER\nKahayatle (Apocalypsis Book 1) **Special introductory ebook price**Warpaint (Apocalypsis Book 2)Exodus (Apocalypsis Book 3)Haven (Apocalypsis Book 4)This series is dedicated to the amazing, wonderful Native Americans who populate our nation, continuing their traditions and reminding the rest of us that sometimes, progress isn’t always the best thing for our people. I invite you to learn more about the Miccosukee tribe, their history, culture, and lifestyle by visiting this website: http://www.miccosukee.com/indian-vill...",
  "genres": [
    "Dystopia",
    "Post Apocalyptic",
    "Young Adult",
    "Apocalyptic",
    "Survival",
    "Romance",
    "Science Fiction"
  ],
  "author": "Elle Casey",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/16047619-haven"
}