{
  "title": "The Bishop's Wife",
  "description": "Bishop HENRY BROUGHAM doesn't know how he will find a capable archdeacon to help raise money to build a \"great\" cathedral for his overcrowded parish. Though his beautiful wife JULIA fulfills her marital duties, their relationship has no passion. To fill the void, she heaps affectionate praise on their four-year old daughter JULIET, embarrassing the proper Bishop. Meanwhile, the Bishop prays for help, and it comes in the form of MICHAEL, a handsome goldenhaired angel, who takes the position of archdeacon. Michael exudes love which draws new and unexpected emotions from Julia. Michael's pure limitless capacity for love is stifled by his mortal duties of manipulating money from wealthy religious patrons, including MRS. LANYARDE and MR. COHEN. With the holidays approaching the Bishop senses the mutual attraction between Julia and Michael. His intuition is right as Julia almost succumbs to Michael before her sense of marital duty ultimately prevails. During a conversation with the scholarly PROFESSOR WUTHERIDGE, Michael learns that an angel can't fulfill \"mortal love\" as it is unrelated to the divine version. With that, he returns to Heaven after completing his fundraising mission. Julia, realizing she will never have a passionate relationship with the Bishop, decides to have another child with whom to share her love. \"Mr. Nathan's method of approach is the way of the goldfinch with the thistledown, or of the unconcerned robin guilelessly cocking his head before the peck. Moreover the words that he uses are as cobwebs that catch the dew of his thought delicately patterned filaments exactly adequate to the burden glistening upon them. In short, to say that 'The Bishop's Wife' has beauty, charm, wit, and wisdom is not to over praise the book.\" --Grace Frank, Saturday Review of Literature",
  "genres": [
    "Fiction",
    "Christmas",
    "Fantasy",
    "Classics",
    "Audiobook",
    "Holiday",
    "Family"
  ],
  "author": "Robert Nathan",
  "average_rating": "3.10",
  "url": "https://www.goodreads.com/book/show/16048002-the-bishop-s-wife"
}