{
  "title": "Naughty & Nice: Room at the Inn / All I Want for Christmas is You / One Perfect Christmas",
  "description": "’Tis the season for romance with three original holiday-themed novellas! Unwrap this festive eBook bundle and discover why these authors are quickly becoming the biggest names in the genre. Ruthie Knox tells a heartwarming contemporary story of first loves given the gift of a second chance; Molly O’Keefe releases the ghosts of Christmas past with a prequel to her novel Crazy Thing Called Love; and Stefanie Sloane weaves an irresistible Regency tale of fiery passion that burns deep on a cold winter’s night.ROOM AT THE INN by Ruthie KnoxCarson Vance couldn’t wait to get out of Potter Falls, but now that he’s back to spend Christmas with his ailing father, he must face all the people he left behind . . . like Julie Long, whose heart he broke once upon a time. Now the proprietor of the local inn, Julie is a successful, seductive, independent woman—everything that Carson’s looking for. But despite several steamy encounters under the mistletoe, Julie refuses to believe in happily ever after. Now Carson must prove to Julie that he’s back for good—and that he wants her in his life for all the holidays to come. (30,000 words; approx. 100 pages)ALL I WANT FOR CHRISTMAS IS YOU by Molly O’KeefeMaddy Baumgarten and Billy Wilkins are spontaneous, in love, and prepared to elope the day after Christmas—that is, if Maddy’s family doesn’t throw a wrench in their plans. After all, Maddy’s barely out of high school and Billy’s a notorious bad boy. Maddy doesn’t care about Billy’s rough past—all she cares about is living in the here and now. But after Maddy’s mother stops speaking to her in protest, and a Christmas Eve heart-to-heart with her father leaves her with butterflies, Maddy starts to get cold feet. She loves Billy, but is she taking this big step too soon? ONE PERFECT CHRISTMAS by Stephanie SloaneAfter being jilted by her fiancé, Jane Merriweather turns to her dear childhood friend, the Honorable Lucas Cavanaugh, for support—and unlocks the smoldering desire simmering in the man’s troubled heart. Frightened by his newfound feelings, Lucas flees to Scotland. But when the Christmas season brings them together again, one glance is all that’s needed to reignite his yearning. If Lucas can convince Jane that his intentions are as pure as the falling snow, they’ll turn a dreary December into a joyous Yuletide affair.",
  "genres": [
    "Romance",
    "Christmas",
    "Contemporary",
    "Anthologies",
    "Contemporary Romance",
    "Holiday",
    "Novella"
  ],
  "author": "Ruthie Knox",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/16048625-naughty-nice"
}