{
  "title": "La vie sans fards",
  "description": "« La Vie sans fards répond à une double ambition. D’abord je me suis toujours demandé pourquoi toute tentative de se raconter aboutissait à un fatras de demi-vérités. Trop souvent les autobiographies et les mémoires deviennent des constructions de fantaisie. Il semble que l’être humain soit tellement désireux de se peindre une existence différente de celle qu’il a vécue, qu’il l’embellit, souvent malgré lui. Il faut donc considérer La Vie sans fards comme une tentative de parler vrai, de rejeter les mythes et les idéalisations flatteuses et faciles. C’est aussi une tentative de décrire la naissance d’une vocation mystérieuse qui est celle de l’écrivain. Est-ce vraiment un métier ? Y gagne-t-on sa vie ? Pourquoi inventer des existences, pourquoi inventer des personnages sans rapport direct avec la réalité ? Une existence ne pèse-t-elle pas d’un poids déjà trop lourd sur les épaules de celui ou celle qui la subit ? La Vie sans fards est peut-être le plus universel de mes livres. J’emploie ce mot universel à dessein bien qu’il déplaise fortement à certains. En dépit du contexte très précis et des références locales, il ne s’agit pas seulement d’une Guadeloupéenne tentant de découvrir son identité en Afrique ou de la naissance longue et douloureuse d’une vocation d’écrivain chez un être apparemment peu disposé à le devenir. Il s’agit d’abord et avant tout d’une femme cherchant le bonheur, cherchant le compagnon idéal et aux prises avec les difficultés de la vie. Elle est confrontée à ce choix capital et toujours actuel : être mère ou exister pour soi seule. Je pense que La Vie sans fards est surtout la réflexion d’un être humain cherchant à se réaliser pleinement. Mon premier roman s’intitulait En attendant le bonheur : Heremakhonon, ce livre affirme : il finira par arriver. »",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Africa",
    "France"
  ],
  "author": "Maryse Condé",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/16049772-la-vie-sans-fards"
}