{
  "title": "The Eclective: The Haunted Collection",
  "description": "Empty Vessel by M. Edward McNally: Captain Wil has command of his own ship, the respect of his crew, and his wife is expecting their first child. But at sea, the winds always become calm just before the storm breaks.The Smell of Death by Tara West: Maggie's unusual powers bring new threats to her already troubled childhood.Safe by Emma Jameson: In Victorian London, a grave robber makes a nice living off the dead, until he opens the wrong crypt.Soulfully Sweet by Shéa MacLeod: As if helping the living isn’t enough of a pain in her divine hindquarters, Branwen (former goddess of love and beauty) is stuck helping the dead on All Hallow’s Eve.May I Go Play? by Heather Marie Adkins: Micah inherits a southern mansion where ancestors long dead relive their violent deaths. And now, they want company...Blehdward, the Vampire who Couldn't Sparkle by Pj Jones: Blehdward desperately wants to fit in with the cool vamps. If only he could learn how to sparkle.Franscesca by Alan Nayes: Break a promise to a feiticeira and you will live to regret it.Soul Eaters by R.G. Porter: Kaitlyn never believed in the existence of other worlds. Now she's in the middle of one where humans aren't the hunters but the hunted.The Eclective is a group of authors dedicated to the premise that The Story is The Thing, and classifications of genre are mostly a matter for bookshelves. While the following stories share a \"Haunting\" theme, they might variously be filed as Horror, Paranormal, Fantasy, YA, etc., or anything else. Our idea is that the story itself is more important than whatever label somebody feels like giving it, and by bringing our work together in collections like this one, we hope readers may find a story they might like. Even if it is not in \"their\" genre.",
  "genres": [
    "Horror",
    "Paranormal",
    "Anthologies",
    "Short Stories",
    "Halloween",
    "Ghost Stories",
    "Amazon"
  ],
  "author": "Alan Nayes",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/16050800-the-eclective"
}