{
  "title": "The Cabin",
  "description": "This ebook edition has been proofed and corrected for errors and compiled to be read with without errors!***An excerpt (modestly edited) from the This author of \"The Four Horsemen of the Apocalypse\" is not a regional novelist. He is not a literary disciple of the late Don Juan Valera. He is not a literary anarchist, nor a follower of the Catalan Ferrer. He has not reformed Spain. He is not associated with a group of novelists or other writers who have done so. Had this desirable end been attained, and attained through the efforts of a novelist, that novelist may have been Don Benito Perez Galdos. The author of The Cabin cannot in modesty accept of foreigners the laurels of all the writers of Spain. The Spanish is an ancient, complex, strongly characteristic civilization, of which he happily is a product. It is his hope that mericans may become some day better acquainted with the spirit and rich heritage of a great national literature through his pages. As his works have long been translated into Russian and have been familiar for many years in French, perhaps it is not too early to anticipate the attention of the enterprising American public. Unfortunately standards of translation do not exist in this country. Many believe that there is no such thing as translation, that the essence of a book cannot be conveyed. The professor seizes his dictionary, the lady tourist her pen; the ingenious publisher knows that none is so low that he will not translate;the less the experience, the more the translator, a maxim in the application of which Blasco Ibáñez has suffered appalling casualties. When Sangre y arena (\" Blood and Sand \") comes from the press as The Blood of the Arena, the judicious pause;this is to thunder on the title page, not in the index;but when we meet die eunuch of Sonnica transformed into an \"old crone,\" error passes the bounds of decency and deserves punishment which is callipygian. Nor are these translations worse than their fellows. Blunders of this sort ought no longer to be possible. If American scholarship is not a sham, this reform, which is imperative, must be immediate. Blasco Ibáñez was born in Valencia, that most typical of the cities of the eastern littoral along the Mediterranean, known as the Spanish Levant. The Valencian dialect is directly affiliated with the neighboring Catalan, and through it with the Provencal rather than with the Castilian of the interior plateau. In the character of the people there is a facility which suggests the French, while an oriental element is distinctly evident, persisting not only from the days of the Moorish kingdoms, but eloquent of the shipping of the East and the lingua franca of the inland sea. Blasco Ibáñez is a Levantine touched with a suggestion of Cyprus, of Alexandria, with an adaptability and mobility of temperament which have endowed him with a faculty of literary improvisation which is extraordinary. He has been a novelist, a controversialist, a politician, a member of the Cortes, a republican, an orator, a traveller, an expatriate, a ranchman, a duellist, a journalist. \"He writes,\" says the Argentine Manuel Ugarte, \"as freely as other men talk. This is the secret of the freshness and charm of the unforgettable pages of The Cabin, of the sense of fraternity and camaraderie which springs up immediately, uniting the author and his readers. He seems to be telling us a story between cigarettes at the cafe table. In these times when mankind is shaking itself free from stupid snobbery to return to nature and to simple sincerity, this gift of free and lucid expression is the highest of merits.\"",
  "genres": [
    "Spanish Literature",
    "Fiction",
    "Classics",
    "Spain",
    "Drama",
    "Novels",
    "20th Century"
  ],
  "author": "Vicente Blasco Ibáñez",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/10627417-the-cabin"
}