{
  "title": "Torren Between",
  "description": "Torren Stewart lived the seemingly perfect life with her husband Peter, a Senior VP for a local financial institution and her two older sons Eric and James in an affluent ocean front community. Torren had it all, a beautiful home, luxury vehicles and a picture perfect family but what she was missing was the love and attention from her husband that she craved.Torren ran her household like a finely tuned machine. Taking care of her family was her first priority for nearly twenty years.During a routine shopping trip Torren meets someone that takes her breath away. This person is gorgeous, rich and sophisticated and the chemistry between them was evident immediately. There are feelings inside Torren stirring that she has never felt before and she was very confused because this person...is a female.Kristine Boyd is new to town and she is there to open a restaurant near the beach. She is tall, blonde, wealthy,confident and incredibly sexy. From the moment that she sees Torren she is hooked. She wants her...but she is married.When Torren is close to Kristine she melts inside. She can't figure out how this woman can have such a powerful effect of on her, so powerful that she gives in and experiences the mose incredible passionate feelings she has ever had.Kristine shows Torren what it's like to feel desired and sexy again. Feelings that have been dormant for a lot of years.Kristine loves teaching Torren new things and pulling her out of her shell. Hot steamy sex in various naughty locations keeps the reader craving more.Torren struggles to juggle her two worlds and keep them as far apart as possible. Until one day her worlds collide. There is suspense, blood rushing passion and tragedy all bundled up into one sexy story.Does Torren get caught? Does she choose a new life with this amazing woman? Can she keep things going?You'll have to read and see.",
  "genres": [
    "Erotica"
  ],
  "author": "J.L. Edwards",
  "average_rating": "3.28",
  "url": "https://www.goodreads.com/book/show/16052993-torren-between"
}