{
  "title": "Straits Academy",
  "description": "At long last! A new full-length novel from Alice Liddell, the mistress of erotic BDSM and best-selling author of Childebride Island and The Harlot Bride.Straits Academy is a lengthy thriller, combining mystery and romance with lots of spanking and delectably twisted school discipline, delivers a hot, kinky read as only Alice can. Straits Academy is one title you won’t soon forget. The year is 1921 and a young Englishwoman named Adelaide has sailed halfway around the world to marry, only to learn that her fiancé has been brutally murdered. She is alone in a faraway colony and doesn’t know a soul -- except Drake, a friend of her intended. Adelaide poses as his orphaned niece so she may help him solve the mystery. To complete the deception, before she's been with Drake even a day, he subjects her to an embarrassing public spanking.Drake wishes to enroll her in Straits Academy, a mysterious girls’ school he believes is somehow connected to the murder. Before she agrees, he warns her that she will have to trade her smart London fashions for a schoolgirl uniform, and she'll be subject to the strictest bare-bottom discipline both at home and at school. But it’s only when Adelaide actually enrolls in the Academy that they realize just how peculiar the school really is. Will Adelaide submit to genuine punishment, mortifying examinations, physical restraint and intimate touching at the hands of women -- all for the sake of the investigation? Will Drake allow Adelaide to go into real danger, despite his growing feelings for her? And worst of all, Adelaide is a proper young English lady. Why is everything that is being done to her so terribly exciting?Blushing Books and Alice Liddell do it again with a story that is a romance, a mystery and scorchingly hot erotica all at the same time. Straits Academy includes explicit descriptions of spankings and punishments, including anal penetration, most of which are conducted with dubious consent. It includes elements of “age play,” in which an adult woman is controlled and disciplined by both men and women. If such themes offend you, please do not buy this book.",
  "genres": [
    "BDSM",
    "Erotica",
    "Mystery",
    "School",
    "Historical"
  ],
  "author": "Alice Liddell",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/16053620-straits-academy"
}