{
  "title": "Providence Trilogy Bundle",
  "description": "Now available in a single volume, Jamie McGuire's best selling trilogy has been hailed by Tough Critic Review's Mollie Harper as 'Beautifully talented writing\". Beginning with Night Owl Reviews' Top Pick, Providence, the Providence Trilogy will ignite your curiosity, break your heart, and have you looking over your shoulder.This bundle includes the following novels:#1- PROVIDENCE (Published November 2010): In the old world shadows of Providence, Rhode Island, Nina Grey finds herself the center of a war between Hell and Earth.Struggling with her father’s recent death, Nina meets Jared Ryel by chance…or so she believes. Although his stunning good looks and mysterious talents are a welcome distraction, it soon becomes clear that Jared knows more about Nina than even her friends at Brown University. When questions outnumber answers, Jared risks everything to keep the woman he was born to save—by sharing the secret he was sworn to protect.When her father’s former associates begin following her in the dark, Nina learns that her father is not the man she thought he was, but a thief who stole from demons. Searching for the truth behind her father’s death, Nina stumbles upon something she never expected—something Hell wants—and only she holds the key. #2- REQUIEM (Published December 2011): Dreaming of the dead might mean a restless night for anyone, but for Nina Grey it was a warning.Still healing from her last run-in with Hell, Nina struggles with not only her life as a Brown University student, but also as an intern at Titan Shipping, her father's company. Recurring nightmares about her father's violent death have become a nightly event, but being overwhelmed with guilt from Ryan's unexpected departure to the Armed Forces, and heart ache over Claire being across the ocean to protect him, Nina believes her sleepless nights are the least of her problems—but she's wrong.Worried about Nina's declining health, Jared must steal back Shax's book for answers. Fighting new enemies, and with the help of new friends, Jared's worst fear comes to fruition. Desperate, he is faced with a choice: Fight Hell alone, or start a war with Heaven.#3- EDEN (Published May 2012): She had seen the unspeakable. She had learned the unknowable. Now, she would fight the invincible.In the third and final installment of the Providence series, Nina Grey will marry the wrong man, carry the child that was never supposed to be born, and fight a war she can’t win.Faced with the impossible task of protecting his new wife and unborn child against the throes of Hell, Jared Ryel is allowed no mistakes. Pressured to return the Naissance de Demoniac to Jerusalem, he revisits St. Ann’s to learn the answers were in front of him all along.Together, they must survive long enough to let their child save them—and the world.",
  "genres": [
    "Paranormal",
    "Romance",
    "Fantasy",
    "Angels",
    "Paranormal Romance",
    "New Adult",
    "Young Adult"
  ],
  "author": "Jamie McGuire",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/16053922-providence-trilogy-bundle"
}