{
  "title": "Ferdinand De Soto, the Discoverer of the Mississippi",
  "description": "Mr. Theodore Irving, in his valuable history of the \"Conquest of Florida,\" speaking of the astonishing achievements of the Spanish Cavaliers, in the dawn of the sixteenth century says: \"Of all the enterprises undertaken in this spirit of daring adventure, none has surpassed, for hardihood and variety of incident, that of the renowned Hernando de Soto, and his band of cavaliers. It was poetry put in action. It was the knight-errantry of the old world carried into the depths of the American wilderness. Indeed the personal adventures, the feats of individual prowess, the picturesque description of steel-clad cavaliers, with lance and helm and prancing steed, glittering through the wildernesses of Florida, Georgia, Alabama, and the prairies of the Far West, would seem to us mere fictions of romance, did they not come to us recorded in matter of fact narratives of contemporaries, and corroborated by minute and daily memoranda of eye-witnesses.\" These are the wild and wondrous adventures which I wish here to record. I have spared no pains in obtaining the most accurate information which the records of those days have transmitted to us. It is as wrong to traduce the dead as the living. If one should be careful not to write a line which dying he would wish to blot, he should also endeavor to write of the departed in so candid and paternal a spirit, while severely just to the truth of history, as to be safe from reproach. One who is aiding to form public opinion respecting another, who has left the world, should remember that he may yet meet the departed in the spirit land. And he may perhaps be greeted with the words, \"Your condemnation was too severe. You did not make due allowance for the times in which I lived. You have held up my name to unmerited reproach.\" Careful investigation has revealed De Soto to me as by no means so bad a man as I had supposed him to have been. And I think that the candid reader will admit that there was much, in his heroic but melancholy career, which calls for charitable construction and sympathy. The authorities upon which I have mainly relied for my statements, are given in the body of the work. There is no country on the globe, whose early history is so full of interest and instruction as our own. The writer feels grateful to the press, in general, for the kindly spirit in which it has spoken of the attempt, in this series, to interest the popular reader in those remarkable incidents which have led to the establishment of this majestic republic.",
  "genres": [
    "Biography",
    "Nonfiction",
    "History"
  ],
  "author": "John S.C. Abbott",
  "average_rating": "3.35",
  "url": "https://www.goodreads.com/book/show/16054246-ferdinand-de-soto-the-discoverer-of-the-mississippi"
}