{
  "title": "Mysterious Acts by My People",
  "description": "Mysterious Acts by My People, winner of the Lambda Literary Award, is a fearless exploration of love, grief, violence, and humor. Wetlaufer documents the search for comfort and deliverance in language rich with materiality and great pleasure. The lyrical vivacity of these poems reveals a world where bodies are capable of miracles and deterioration, tremendous loss, and grace.Mark Wunderlich, author of The Earth Avails says of the book: \"The mysterious acts in Valerie Wetlaufer’s striking debut are many, and those acts are magnified by her keen attention to the ruptures and illusions of human longing. Love and Eros are threaded through her taut lines, her finely crafted stanzas. Perhaps most startling are the poems in which Wetlaufer takes her readers back into a reconstructed and imagined past in which a 19th century Midwestern woman’s psyche and passion, her madness and her revenges and loves are made manifest, imagined, shaped and voiced. History here is harrowed, made new, made strange by being brought into language, into the light. Mysterious Acts by My People marks the arrival of a poet who possess great gifts of imagination, spirit, music and heart.\"\"Oh, to be Valerie Wetlaufer and write poems perfectly. Mysterious Acts by My People will make you think: this is love—no, this is violence; this is violence—no, this is love; this is comfort—no, this is harm; this is harm—no, this is comfort. The stories she shares and the secrets she imparts are harrowing and vivid, frighteningly beautiful in their metaphorical renderings. There is no other way to say what these poems say: Valerie got it hauntingly right. Her images strike so hard and so true and will stay with you forever.\"—Jenny Boully, author of The Body, The Book of Beginnings and Endings, and more",
  "genres": [
    "Poetry",
    "LGBT",
    "Queer",
    "Contemporary",
    "Lesbian"
  ],
  "author": "Valerie Wetlaufer",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/16055445-mysterious-acts-by-my-people"
}