{
  "title": "Alyssa's Wolves",
  "description": "Alyssa, Tyler, and Michael are shocked to find their destiny lies in being mated as a trio. None of the three is interested in a ménage, but fate has stepped in. Now they must find a way to merge their paths while vanquishing the threats from their pasts.After fleeing an arranged marriage in a polygamist society in Oklahoma, Alyssa Franklin wants nothing more than to enjoy her early twenties, take some classes at the local college, and learn about the world outside the confines of her childhood pack. Embraced by the loving Masters family in Oregon, Alyssa is beyond grateful for her good fortune. Nothing can upset her new life, except maybe the scent of her mate wafting toward her at a local rodeo.Tyler Evans has been sent from Alyssa’s Oklahoma pack to ensure she is indeed mated to one of the Masters. He’s completely unprepared to realize Alyssa is his mate. In a rash, split-second decision, he flees her presence, not wishing to upset the perfect life his mate is living. Tortured with the need to be with Alyssa and unable to avoid the pull she has on him, he abandons his family in Oklahoma and treks to Oregon to claim his mate.Michael Masters has been living in Spain for two years, knowing Alyssa is his mate and wishing to give her time to mature and experience life before claiming her. When he learns she believes another man is destined for her, he returns from abroad to claim his mate. Hoping she was mistaken, Michael treads lightly with his fingers crossed that fate has not deemed it necessary to share her.When these three souls collide, tension rises. None of them are interested in a ménage. However, fate has other plans. Can the three lovers, drawn to each other by a power they can’t deny, work together to become a unit? Or will outside forces be able to tear them apart before they’ve even had a chance to consummate their mating?",
  "genres": [
    "Menage",
    "Paranormal",
    "Paranormal Romance",
    "Shapeshifters",
    "Erotica",
    "Werewolves",
    "M F M"
  ],
  "author": "Becca Jameson",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/16055541-alyssa-s-wolves"
}