{
  "title": "V-Positive: the Bloodbaby Chronicles",
  "description": "Vengeance! Betrayal! So horrific are the Vampire’s actions, he unwittingly creates his own vampire hunters who pursue him in this relentless action thriller. Annie quickly regained her composure and pushed the crucifix further, “Get away from those babies,” she repeated. He backed away quickly without taking his eyes off the crucifix. He placed the toweled baby girl on Karina’s belly, beside her two brothers. “These are my children,” he growled, “I am Raum, the last disciple, creator of legions, commander of all. I am their father. They are my heirs.” “You are not their father,” Annie sneered, “You are a monster. You are nothing more than a rapist and a murderer.” She pointed the crossbow at him, “Now get away from those babies.” “And what do you suppose you are going to do with those toys?” He scoffed in his usual guttural rasp. “I’ll kill you, I swear,” Annie threatened. The vampire grinned while studying her. Once again her reverted to using Annie’s voice. “Why – you are shaking, dear girl,” he ridiculed her. “You seem to be trembling all over; even your voice wavers.” He picked up the lifeless body of a nurse, took another giant bite out of her neck, and then tossed her across the room with one hand. He said in a deep snarl, “Am I supposed to be afraid of you?” The vampire mocked. He used his middle finger to trace a deep, hemorrhaging laceration extending from his shoulder to his stomach. The Vampire grimaced like a rabid dog. “These are lashes from the whips of Satan! The Devil himself shreds my skin; with whips made from the skins of his own serpents. Some are centuries old.” His mighty chest heaved when he inhaled, and then he exhaled ferociously, “So tell me, dear girl, am I supposed to be afraid of you?” He repeated. Annie physically shook at the terror standing in front of her. She tightened her jaw. “Not of me,” she said, “But of God and the faith I have in God.” She poised with the crossbow, “Now I’m telling you for the last time; get away from those babies.” The vampire snickered, “Now, now dear girl, the thought of your faith in God never entered your mind until you saw me tonight.” He made a step toward her. Annie pulled the trigger. The once gentle and timid caretaker, Annie Willow, forced to care for her late mistress’ triplets, and takes on the roll as “Miss Lullaby.” As caretaker of the bloodbabies, they hunt and kill Raum’s legions as fast as he creates them, while trying to rid themselves of the V-Positive vampire’s blood.Show More Show Less",
  "genres": [],
  "author": "Matt Ponticello",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/16055611-v-positive"
}