{
  "title": "The Forbidden Trilogy",
  "description": "Those inside are special, gifted with unique abilities, abilities that make them dangerous to the outside world. Since childhood, they're trained to control their powers, to show restraint, and to defend themselves. For years they practice, honing their gifts for one purpose: to be rented out to the highest bidder as a spy, to be used as a weapon against others.Sam never questions her role at the secret organization dubbed Rent-A-Kid.Until she meets Drake.She reads minds. He controls minds. Together, they might get out alive.THIS SPECIAL EDITION INCLUDES:*Award-Winning Book #1 - Forbidden Mind*Book #2 - Forbidden Fire*Book #3 - Forbidden Life*In-Depth Q&A with Author Kimberly Kinrade*Extensive Bonus Content (Available ONLY in this Special Edition)Get the whole trilogy, plus bonus content and save money... even if you already bought Forbidden Mind. This special edition gives readers the best deal with the best content!Excerpt:This was the moment. Our first meeting. What if the chemistry we had in our minds didn't translate to our bodies? What if he looked at me and ran away?Ana, reading my mind, tugged me to the door with a motherly smile. My heart clenched at the thought that Lucy and Luke should have basked in that smile over the last eighteen years. The injustice of it all renewed my motivation.She opened the door and Drake stepped forward, and for that moment, the world stopped spinning and time stood still.In my imagination, he hadn't been so tall. Tall and muscular. His blond-highlighted hair lay casually messy, and his crystal blue eyes held me in a long stare. He'd found a way to shave, and the chiseled strength of his jaw made my knees weak.When he smiled, warmth filled my stomach.\"Sam.\" That was it, just one word, but he made it sound like it held all the secrets of the universe. His voice was deeper, huskier, than it had been in my mind. \"Drake, it's really you.\" He reached for my hand. \"It's really me.\" When his skin touched mine, lightning danced between us. He pulled me close, breathing in the scent of me as our bodies touched. I nearly cried right there in his arms, just being held, feeling him. I never wanted to let go.But I had to.***",
  "genres": [
    "Paranormal",
    "Romance",
    "Fantasy",
    "Science Fiction",
    "Young Adult",
    "Urban Fantasy"
  ],
  "author": "Kimberly Kinrade",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/16056060-the-forbidden-trilogy"
}