{
  "title": "Beyond the Bear: How I Learned to Live and Love Again after Being Blinded by a Bear",
  "description": "The unbelievable true story of a man who narrowly survived one of the most brutal grizzly bear attacks, and the love that separated his blindness from the dark.--A 25-year-old backcountry wanderer, a man happiest exploring wild places with his dog, Dan Bigley woke up one midsummer morning to a day full of promise. Before it was over, after a stellar day of salmon fishing along Alaska’s Kenai and Russian rivers, a grizzly came tearing around a corner in the trail. Dan barely had time for “bear charging” to register before it had him on the ground, altering his life forever. “Upper nose, eyes, forehead anatomy unrecognizable,” as the medevac report put it. Until then, one thing after another had fallen into place in Dan’s life. He had a job he loved taking troubled kids on outdoor excursions. He had just bought a cabin high in the Chugach Mountains with a view that went on forever. He was newly in love. After a year of being intrigued by a woman named Amber, they had just spent their first night together. All of this was shattered by the mauling that nearly killed him, that left him blind and disfigured. Facing paralyzing pain and inconceivable loss, Dan was in no shape to be in a relationship. He and Amber let each other go. Five surgeries later, partway into his long healing journey, they found their way back to each other. The couple’s unforgettable story is one of courage, tenacious will, and the power of love to lead the way out of darkness. Dan Bigley’s triumph over tragedy is a testament to the ability of the human spirit to overcome physical and emotional devastation, to choose not just to live, but to live fully. Official Beyond The Bear Website",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Survival",
    "Biography Memoir",
    "Disability",
    "Biography",
    "Animals"
  ],
  "author": "Dan Bigley",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/16056199-beyond-the-bear"
}