{
  "title": "Miss Mole",
  "description": "Miss Mole is set between the wars and is the story of Hannah Mole, a fortyish spinster who ekes out a living as a companion or housekeeper -- she has a sharp tongue and quirky spirit that sometimes get her into trouble. At the beginning of the novel she's returned after a long absence to the fictional town of Radstowe (which is a thinly disguised portrait of Bristol). Miss Mole is not getting along well with her current employer and after a few days in a boarding house, gets a new job via her cousin Lilla, who is from the wealthier side of the family and has some good contacts. Without revealing the family connection, Lilla recommends her for a job as a housekeeper of sorts for a rather stuffy, pompous minister named Robert Corder, whose wife has recently passed away. The household consists of Reverend Corder, a nonconformist; daughter Ethel, who's rather desperately looking for a man so she can escape the house; young Ruth, who is still in school and longing for a mother figure; and their sassy cousin Wilfred, who's attending medical school nearby. Wilfred's presence in the house is rather awkward and raises a few eyebrows, but his mother is wealthy and the Reverend can't risk offending her. A spinster housekeeper/chaperone is exactly what they need to keep the house respectable -- or so they think. Miss Mole moves in and simultaneously elevates their lives and yet turns things upside-down. She's comforting and yet slyly subversive, and Reverend Corder doesn't quite know if he should appreciate her or fear her, as Hannah is smarter than he is. Wilfred takes to her instantly, recognizing her sharp with, and Ruth grows to love her. Eventually, though, there are whispers about Miss Mole's background which much be addressed, and we learn the real reason for her long absence from her hometown.",
  "genres": [
    "Fiction",
    "Classics",
    "Historical Fiction",
    "British Literature",
    "Humor",
    "20th Century",
    "Female Authors"
  ],
  "author": "E.H. Young",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/1062898.Miss_Mole"
}