{
  "title": "Savage Coast",
  "description": "\"At first “Savage Coast” is a train-of-fools comedy; later, it’s a cross-cultural love story Hemingway would have envied for its suddenness.\" —New York Times Book Review\"Rejected by her publisher in 1937, poet Rukeyser’s newly discovered autobiographical novel is both an absorbing read and an important contribution to 20th-century history.... Ironically, the factors that led to the novel’s rejection—Rukeyser’s avant-garde impressionistic prose style, alternating with realistic scenes of brutal death and a few descriptions of sexual congress—are what make the book appealing today.\"—Publisher's WeeklyAs a young reporter in 1936, Muriel Rukeyser traveled to Barcelona to witness the first days of the Spanish Civil War. She turned this experience into an autobiographical novel so forward thinking for its time that it was never published. Recently discovered in her archive, this lyrical work charts her political and sexual awakening as she witnesses the popular front resistance to the fascist coup and falls in love with a German political exile who joins the first international brigade.Rukeyser's narrative is a modernist investigation into the psychology of violence, activism, and desire; a documentary text detailing the start of the war; and a testimony to those who fought and died for freedom and justice during the first major battle against European fascism.Muriel Rukeyser (1913–1980) was a prolific American writer and political activist, influencing generations of poets including Anne Sexton, Adrienne Rich, Sharon Olds, and Alice Walker, to name a few. She wrote on the Scottsboro trial in Alabama, the Spanish Civil War, the Vietnam War, and the imprisonment of poet Kim Chi-Ha in South Korea. She was one of the few modernist writers to champion social justice issues, showing the place of memory and feelings in politics. Rukeyser's centenary will be celebrated in 2013.Rowena Kennedy-Epstein is a PhD candidate in English at the Graduate Center of the City University of New York.",
  "genres": [
    "Fiction",
    "Spain",
    "Historical Fiction",
    "American",
    "Novels"
  ],
  "author": "Muriel Rukeyser",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/16057098-savage-coast"
}