{
  "title": "The Roving Tree",
  "description": "\"A gorgeous new novel about a Haitian adoptee finding her way in many different corners of the world.\"--Edwidge Danticat, New York Times\"Augustave, a first-time novelist, pens a well-balanced story about a young woman, caught between two worlds, who struggles to connect with her heritage...a polished narrative that addresses racism and cultural and class differences and provides a wealth of information about vaudou beliefs.\"--Kirkus Reviews\"Augustave… illustrates the devastating rootlessness of cultural disaffiliation.\"--World Literature Today\"The Roving Tree is both a song and a social essay. It provides a window on a world and rounds out by circling back to the prologue.\"--Asheville Citizen-Times\"Augustave creates a stunning tale with beautiful language that dwells in the realm of magical realism…The characters are rich, complicated and full of color and nuance.\"--Mosaic Magazine\"The Roving Tree is truly an enthralling debut novel that deserves a wide audience; readers will undoubtedly be enriched by their engagement with it.\"--SX Salon\"The beauty of this book lies in its simplicity. An engaging read that packs a powerful punch.\"--Historical Novel Review\"The Roving Tree is Elsie Augustave’s debut novel, and I can’t wait to see what she writes next. Augustave writes beautifully and it’s obvious that she cares a lot about the subject matter she chooses. I definitely recommend The Roving Tree to anyone who likes reading literary fiction and/or to anyone who is interested in the ideas and history portrayed in the book.\"--Between the Covers\"Augustave is a talented writer who brings her varied characters to life and shows readers parts of the world that few of us have experienced. Her book is an excellent anecdote to books about immigration that, intentionally or not, present the western world as the favored or inevitable destination…I strongly recommend The Roving Tree to all those who are interested in Haiti, Zaire, and African traditions more generally.\"--Me, You, and Books\"A beautiful, layered, nuanced story about a woman finding herself.\"--NBC COZI TV, Essence Magazine summer reading pick\"A fulfilling, exciting and ultra-lyrical read, The Roving Tree is really a novel about a lost soul’s identity quest.\"--Kreyolicious.com\"A fresh new voice who adds her own charming, beguiling brand of lyricism to the growing body of Haitian American stories. The Roving Tree is a unique and fascinating book, and I for one look forward to hearing more from this writer.\"--Lorna Goodison, author of From Harvey RiverElsie Augustave's debut novel explores multiple themes: separation and loss, rootlessness, the impact of class privilege and color consciousness, and the search for cultural identity. The central character, Iris Odys, is the offspring of Hagathe, a Haitian maid, and a French-educated mulatto father, Brahami, who cares little about his child. Hagathe, who had always dreamed of a better life for her child, is presented with the perfect opportunity when Iris is five years old. Adopted by a white American couple, Iris is transported from her tiny remote Haitian village, Monn Neg, to an American suburb.The Roving Tree illuminates how imperfectly assimilated adoptees struggle to remember their original voices and recapture their personal histories and cultural legacy. Set between two worlds—suburban America and Haiti under Papa Doc's repressive regime—the novel offers a unique literary glimpse into the deeply entrenched class discrimination and political repression of Haiti during the Duvalier era, along with the subtle but nonetheless dangerous effects of American racism.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Race"
  ],
  "author": "Elsie Augustave",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/16057215-the-roving-tree"
}