{
  "title": "Manila Noir",
  "description": "\"While certain cities in past Akashic volumes might appear to lack an obvious noir element, Manila (like Mexico City, which shares many of the same problems) practically defines it, as shown by the 14 selections in this excellent anthology. As Hagedorn points out in her insightful introduction, Manila is a city burdened with a violent and painful past, with a long heritage of foreign occupation. The specters of WWII (during which the city suffered from U.S. saturation bombing), and the oppressive 20-year reign of dictator Ferdinand Marcos live on in recent memory. The Filipino take on noir includes a liberal dose of the gothic and supernatural, with disappearance and loss being constants.\"--Publishers Weekly (starred review)\"This Southeast sampler is unique, possessing an overall gritty tone. Each slice of supernatural splendor pulls the reader in with their nontraditional heroes…Ultimately, readers get a strong taste of the real Manila and all her dark secrets, wanting more of while being slightly afraid of what she might do next. Manila is the perfect place for noir scenes to occur, and it is easy to get sucked into its deadly nightshade of doom.\"--Criminal Class PressBrand-new stories by: Lourd De Veyra, Gina Apostol, Budjette Tan and Kajo Baldisimo, F.H. Batacan, Jose Dalisay Jr., Eric Gamalinda, Jessica Hagedorn, Angelo Lacuesta, R. Zamora Linmark, Rosario Cruz-Lucero, Sabina Murray, Jonas Vitman, Marianne Villanueva, and Lysley Tenorio.Manila provides the ideal, torrid setting for an Akashic Noir series volume. It's where the rich rub shoulders with the poor, where five-star hotels coexist with informal settlements, where religious zeal coexists with superstition, and where politics is often synonymous with celebrity and corruption.From the Introduction by Jessica Hagedorn:Manila is not for the faint of heart. Built on water and reclaimed land, it’s an intense, congested, teeming megalopolis, the vital core of an urban network of sixteen cities and one municipality collectively known as Metro Manila. Population: over ten million and growing by the minute. Climate: tropical. Which means hot, humid, prone to torrential monsoon rains of biblical proportions.I think of Manila as the ultimate femme fatale. Complicated and mysterious, with a tainted, painful past. She’s been invaded, plundered, raped, and pillaged, colonized for four hundred years by Spain and fifty years by the US, bombed and pretty much decimated by Japanese and American forces during an epic, month-long battle in 1945.Yet somehow, and with no thanks to the corrupt politicians, the crime syndicates, and the indifferent rich who rule the roost, Manila bounces back. The people’s ability to endure, adapt, and forgive never ceases to amaze, whether it’s about rebuilding from the latest round of catastrophic flooding, or rebuilding from the ashes of a horrific world war, or the ashes of the brutal, twenty-year dictatorship of Ferdinand Marcos . . .Many years have passed since the end of the Marcos dictatorship. People are free to write and say what they want, yet nothing is different. The poor are still poor, the rich are still rich, and overseas workers toil in faraway places like Saudi Arabia, Israel, Germany, and Finland. Glaring inequities are a source of dark humor to many Filipinos, but really—just another day in the life . . .Writers from the Americas and Europe are known for a certain style of noir fiction, but the rest of the world approaches the crime story from a culturally unique perspective. In Manila Noir we find that the genre is flexible enough to incorporate flamboyant emotion and the supernatural, along with the usual elements noir fans have come to expect: moody atmospherics, terse dialogue, sudden violence, mordant humor, a fatalist vision.",
  "genres": [
    "Short Stories",
    "Fiction",
    "Anthologies",
    "Mystery",
    "Noir",
    "Crime",
    "Historical Fiction"
  ],
  "author": "Jessica Hagedorn",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/16057198-manila-noir"
}