{
  "title": "Only the Longest Threads",
  "description": "Only the Longest Threads presents dramatic and lucid accounts of the great breakthroughs in the history of physics—classical mechanics, electromagnetism, relativity, quantum mechanics, quantum field theory, and string theory—each from the viewpoint of a (fictional) witness to the events.Tasneem Zehra Husain re-imagines the pivotal moments in the history of physics when radical new theories shifted our perception of the universe, and our place in it. Husain immerses the reader in the immediacy and excitement of the discoveries—and she guides us as we begin to understand the underlying science and to grasp the revolutionary step forward each of these milestones represents.Tasneem Zehra Husain is a writer, educator, and Pakistan’s first female string theorist. She holds a PhD from Stockholm University and did post-doctoral research at Harvard University.Husain is fascinated by scientific theories, how we engage with them, and how they change us. She explores these themes in her fiction and nonfiction writing, her popular talks, and the educational workshops she conducts for science teachers. Husain is actively involved in science outreach, and frequently delivers talks about theoretical physics to students and lay audiences. She lives in Cambridge, Massachusetts.Advance praise for Only the Longest Threads:“Science is done by real human beings, with human concerns. Only the Longest Threads tells a story that conveys the human side of science in a way that is as moving as it is accurate.”—Sean Carroll, theoretical physicist at Caltech and author of The Particle at the End of the Universe“Tasneem Zehra Husain writes lyrically, poetically about life, love, and physics. I highly recommend this wonderful book for anyone interested in what physics, and indeed all of science, is about. She masterfully describes the most momentous moments in physics history with verve and talent.”—Amir D. Aczel, bestselling author of Fermat’s Last Theorem“A delightful meditation on the development of modern physics, culminating in the discovery of the Higgs. Husain follows the thread of its creation through a dialog between a journalist and young theory student, and as seen through the eyes of witnesses.”—John Huth, Donner Professor of Science, Harvard University“How do theoretical physicists think? Tasneem Zehra Husain knows. She knows their purpose, feels their passions, articulates their frustrations, shares their triumphs. Through the device of fiction Only the Longest Threads communicates the history of physical thought—its roots in inquisitiveness and essential disinterest in outcome—with greater clarity than any popular science text.” —Michael Duff FRS, Abdus Salam Professor of Theoretical Physics, Imperial College London“Well-written and cleverly constructed, this book takes us on a journey through the history of physics as a series of fictional adventures, loosely linked by another fiction, the storytellers’ emails to each other. Some books are praised because ‘I couldn’t put it down,’ but this one merits a deeper reading, one that stops, muses on, and savors each story before going on to the next. Each one captures not only the emergence of a significant idea in physics, but also something of the characters, culture, and times surrounding that development. So take your time, pause to ponder, but persevere, you will be well rewarded!”—Helen R. Quinn, Physicist, Science Educator, and Co-author of The Mystery of the Missing Antimatter, Professor Emeritus SLAC National Accelerator Laboratory“Tasneem Zehra Husain’s writing is both enlightening and entertaining as it captivates the challenge and excitement of working at the forefront of paradigm-shifting discoveries. Book-ended by the history-making discovery of the Higgs field, this tale offers a sparkling account of our understanding of fundamental physics. Through many voices rich with evocative metaphors, the threads woven through time and place that make up our current understanding of reality are revealed.”—Elizabeth F. McCormack, Professor of Physics, Bryn Mawr College“Only the Longest Threads describes the process of scientific discovery by focusing on the human elements: the bold conjectures, the wrong turns in the road, the competitiveness among scientists, the strength of their community, all seen from the point of view of the writers of letters and journals who make up the narrative. The clear, flawless prose is laced with a gentle wit when human behavior is described in the terms of physics—a welcome, light-handed nerdiness. Everyone who has studied physics but is unable to see the forest for the trees—and that means most of us—will relish this lovely little volume as it brings into perspective, through its accessible yet substantive treatment of the grand unifications, a magnificent edifice created by the human mind.”—Asad Abidi, Distinguished Chancellor’s Professor, UCLA Engineering“Tasneem Zehra Husain skillfully weaves a poetic tapestry from tight threads of science and richly imagined strands of time. A weft of physics and warp of love makes a delightfully gripping read. Her flowing prose conducts us by some unfamiliar force from falling apples to colliding protons where the Higgs boson looms.”—Joseph Mazur, author of Enlightening Symbols“This highly original book puts a fresh perspective on humanity's inevitable obsession with understanding the laws of Nature. On an artfully constructed journey through space and time, Tasneem Zehra Husain gives us a tantalizing taste of how physicists struggle to find ‘true nuggets of gold, and the only immortal elixir.’”—Freddy Cachazo, Perimeter Institute for Theoretical Physics“Tasneem Zehra Husain’s observant narrators are witnesses to the intellectual revolutions of Newton, Maxwell, Einstein, Bohr, and others, the drama building to the mysteries of the present day. She uses her deep knowledge of physics to create a new genre—true science fiction, imagined vignettes of physics in all its humanity, woven together as a story within a story.”—Mark A. Peterson, author of Galileo’s Muse",
  "genres": [
    "Science",
    "Nonfiction"
  ],
  "author": "Tasneem Zehra Husain",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/16057430-only-the-longest-threads"
}