{
  "title": "They Called Me Number One",
  "description": "Xat'sull Chief Bev Sellars spent her childhood in a church-run residential school whose aim it was to \"civilize\" Native children through Christian teachings, forced separation from family and culture, and discipline. In addition, beginning at the age of five, Sellars was isolated for two years at Coqualeetza Indian Tuberculosis Hospital in Sardis, British Columbia, nearly six hours' drive from home. The trauma of these experiences has reverberated throughout her life.The first full-length memoir to be published out of St. Joseph's Mission at Williams Lake, BC, Sellars tells of three generations of women who attended the school, interweaving the personal histories of her grandmother and her mother with her own. She tells of hunger, forced labour, and physical beatings, often with a leather strap, and also of the demand for conformity in a culturally alien institution where children were confined and denigrated for failure to be White and Roman Catholic.Like Native children forced by law to attend schools across Canada and the United States, Sellars and other students of St. Joseph's Mission were allowed home only for two months in the summer and for two weeks at Christmas. The rest of the year they lived, worked, and studied at the school. St. Joseph's Mission is the site of the controversial and well-publicized sex-related offences of Bishop Hubert O'Connor, which took place during Sellars's student days, between 1962 and 1967, when O'Connor was the school principal. After the school's closure, those who had been forced to attend came from surrounding reserves and smashed windows, tore doors and cabinets from the wall, and broke anything that could be broken. Overnight their anger turned a site of shameful memory into a pile of rubble.In this frank and poignant memoir, Sellars breaks her silence about the institution's lasting effects, and eloquently articulates her own path to healing.",
  "genres": [
    "Nonfiction",
    "Indigenous",
    "Memoir",
    "History",
    "Canada",
    "Biography",
    "Book Club"
  ],
  "author": "Bev Sellars",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/16057250-they-called-me-number-one"
}