{
  "title": "Chosen by Fate",
  "description": "Don't miss out on National Bestselling Author Virna DePaul's intriguing Para-Ops world! \"Incredibly well-written, different, and hot.\" --NYT Bestseller Larissa Ione \"DePaul is amazing! Chosen by Blood is a unique, hot, spellbinding treat for all paranormal romance fans. I can't wait for the next book in the series!\" --NYT Bestseller Author Lori Foster\"A gripping tale!...DePaul creates the perfect blend of danger, intrigue, and romance. You won't be able to put this book down!\" --NYT Bestseller Brenda NovakOverview of Chosen By Although he keeps company with a vampire and a were, human Shaman Caleb O'Flare can definitely hold his own. But neither his psychic ability nor his healing powers can help his sexy-as-hell teammate, Wraith-a ghost with no memory of her human existence, who cannot experience touch without pain.  No wraith has managed to exist past its tenth year, so her time is about to run out. She wants only two things before accepting her to learn her human identity, and experience one night with Caleb...More  \"If you have not yet started this [Para-Ops] series...you are really missing out.\"  --The Book Reading Gals\"Readers who love Lara Adrian, JR Ward will love this new Para-Ops series -- this author is a rising star.\" --Sue Grimshaw (Romance At Random) on GoodreadsTry Virna's novels if you love True Blood, Supernatural and heart-pounding thrillers!  Read the other books in the Para-Ops   Chosen By Blood (Book 1) Chosen By Sin (Book 3)Virna's other **If you enjoy sexy paranormals, try the paranormal novella,  A Vampire's Salvation. \"I only have one request--when is the next installment due?\" **To try a contemporary romance with humor and heat, Joyfully Reviewed had this to say about  This Magic  \"[B]eautifully written...an unforgettable hit.\"  **The contemporary novella,  Wild For Him, is \"well written...and steamy!\" **And if you enjoy hot cops, try Virna's super sexy erotic romances under the name Ava Meyers (The Red-Hot Cops Series)",
  "genres": [
    "Paranormal Romance",
    "Paranormal",
    "Vampires",
    "Urban Fantasy",
    "Romance",
    "Magic",
    "Fantasy"
  ],
  "author": "Virna DePaul",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/10629328-chosen-by-fate"
}