{
  "title": "Advice to Little Girls",
  "description": "Tzim Tzum Books a pregătit pentru voi o cărticică semnată de însuși marele povestitor american și tradusă în română de Florin Bican: Sfaturi pentru fetițe. Un text obraznic, nu tocmai pe placul părinților, cu ilustrații pe măsură, semnate de Adelina Butnaru.Așa cum marele general chinez Sun Zu a scris Arta războiului, Twain a scris Sfaturi pentru fetițe. Dar nu trebuie să fii neapărat fetiță pentru a profita de sfaturile lui Mark Twain — ele sunt la fel de valabile și pentru băieți. Vă avertizăm însă că punerea lor în aplicare poate fi riscantă. Reclamațiile ulterioare se vor adresa direct autorului.Foarte important, pentru cine are pereți prea albi și uși prea serioase — supracoperta cărții se transformă în afiș!Contraindicații: nu se recomandă celor sensibili la ironie. Cartea se adresează oamenilor cu vârste peste 6 ani, până la 100+, dar neapărat cu simțul umorului. Este potrivită atât pentru părinții care știu să treacă cu vederea greșelile copiilor, cât și pentru copiii care pot să treacă cu vederea seriozitatea părinților și lipsa spiritului ludic.Mark Twain — „Sfaturi pentru fetițe” este câștigătoarea Marelui Premiu la concursul național de design de carte „Cele mai frumoase cărți din România” ediția 2017.Autor: Mark TwainTraducere și text supracopertă: Florin BicanRedactor: Ioana GruenwaldDesign: Faber Studio — Adelina Butnaru, Radu Manelici, Dinu DumbrăvicianIlustrații: Adelina ButnaruEditura: Tzim Tzum Books, Bucureşti, 2017Tipografia: Fabrik, BucureștiTzim Tzum Books has prepared for you a little book, signed by Mark Twain and translated into Romanian by Florin Bican: Advice to Little Girls.A naughty text, not exactly to parents' liking, with illustrations to match the text, done by Adelina Butnaru.Attention please!You don't have to neccessarily be a little girl to take advantage of Mark Twain's advice — they are valid for little boys as well.We warn however that putting these into practice can be risky.Any subsequent complaints should be addressed to the author directly.Mark Twain — Advice for Little Girls is the winner of the Great Prize at the national competiton 'The Most Beautiful Books in Romania 2017'.",
  "genres": [
    "Picture Books",
    "Humor",
    "Childrens",
    "Classics",
    "Nonfiction",
    "Short Stories",
    "Family"
  ],
  "author": "Mark Twain",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/16057518-advice-to-little-girls"
}