{
  "title": "The Blue Death: Disease, Disaster, and the Water We Drink",
  "description": "With the keen eyes of a scientist and the sensibilities of a seasoned writer, Dr. Robert Morris chronicles the fascinating and at times frightening story of our drinking water. His gripping narrative vividly recounts the epidemics that have shaken cities and nations, the scientists who reached into the invisible and emerged with controversial truths that would save millions of lives, and the economic and political forces that opposed these researchers in a ferocious war of ideas. In the gritty world of nineteenth-century England, amid the ravages of cholera, Morris introduces John Snow, the physician who proved that the deadly disease could be hidden in a drop of water. Decades later in the deserts of Africa, the story follows Louis Pasteur and Robert Koch as they raced to find the cause of cholera and a means to prevent its spread. In the twentieth century, burgeoning cities would subdue cholera and typhoid by bending rivers to their will, building massive filtration plants, and bubbling poisonous gas through their drinking water. However, with the arrival of the new millennium, the demon of waterborne disease is threatening to reemerge, and a growing body of research has linked the chlorine relied on for water treatment with cancer and stillbirths. In The Blue Death , Morris dispels notions of fail-safe water systems. Along the way he reveals some shocking the millions of miles of leaking water mains, constantly evolving microorganisms, and the looming threat of bioterrorism, which may lead to catastrophe. Across time and around the world, this riveting account offers alarming information about the natural and man-made hazards present in the very water we drink.",
  "genres": [
    "Nonfiction",
    "Science",
    "History",
    "Medical",
    "Medicine",
    "Environment",
    "Health"
  ],
  "author": "Robert D. Morris",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/1605762.The_Blue_Death"
}