{
  "title": "They Call Me...Montey Greene",
  "description": "\"A promising - awkwardly executed thriller\" - (kirkus reviews)\"Very enjoyable crime caper crossing Italy and France and ending back in the US. A very refreshing central character and plenty of twists and turns. A fun and pacy read with lots to like. A very promising start to a new series\" - (thebookbag.co.uk)\"A straightforward thriller written for the everyday man. A fun story - not overly complex but enough to chew on.\" - (bestsellersworld.com)WHO IS MONTEY GREENE? WHY DOES EVERYBODY WANT TO KNOW HIS NAME THEN WANT HIM DEAD?“You should have followed your first instincts,” a voice echoed off the walls of his unconscious mind. \"All I wanted was a pair of shoes,” he told the spirit that he could feel struggling to free itself of its flesh and blood avatar stretched out on this piece of cold highway leading to Lake Como with four bullet holes in his back. Montey didn’t want to die. Not here. Not Now.Something told him not go, but he hopped on that plane anyway. All expenses paid they said. First class all the way on an open-ended ticket. You would have taken that flier too if you just got laid off for the third time in as many months and recently separated from your wife. Did I forget to mention the kids? An all expenses paid vacation 4000 miles across the Atlantic, to hang out with some old friends while you try to put the pieces of your crumbling life back together, seemed to be just the remedy for the once again unemployed security systems analyst, Montey Greene. Up until the point he walked into that high end women's boutique on Via Della Spiga he was just a regular guy like you and me. Him being a tourist he did what tourists do and that's why he found himself on one of the most touristy fashion corridors in all of Milan. If only he had gone to Venice or Naples instead. Maybe he wouldn't have inadvertently botched the kidnapping of a reputed drug kingpin's daughter. If only it could have been just been that, but Montey Greene didn't have that type of luck. His life as of late wasn't that black and white simple. Now he found himself locked in the cross-hairs of some unknown assailants gun-sight and at the top of some unknown government agency's most wanted list questioning his name. Life is rarely what it seems as perception is usually greater than ones reality. Even a broke clock shows the right time two times a day so be careful what you wish for. Be careful what you wish for when you take a person's name. Be careful what you wish for if the person you want dead doesn't die. Europe. A pair of shoes. A beautiful Colombian woman. Pink pills. A false passport. Four bullets in the back. The makings of EVERY LEGEND HAS TO BEGIN SOMEWHERE -!!!!",
  "genres": [],
  "author": "A.R. Yoba",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/16057787-they-call-me-montey-greene"
}