{
  "title": "Kiss Me, Kill Me",
  "description": "Voyage into the realm of the paranormal with this nine author short story anthology and please note that all proceeds will be donated to GreaterGood.org charity!Sink your teeth A Ghoulish Valentine by H.P. Dulcie O'Neil can't help her attraction to Knight Vander, much though she tries to fight her feelings. When she begrudgingly accepts his invitation to dinner and a movie, she can't imagine her evening will be derailed by a cemetery full of hungry ghouls and one incredibly sexy man.Cat Fight by Zoe Cat Fight takes place in Zoe Winters' \"PretVerse\". Greta is a cat therian (shifter). She's been involved with Dayne, a local sorcerer since she sought his protection from her murderous tribe. After a fight, Greta shifts into cat form and refuses to come back out.Impulse Control by Susan In the world of the Talent Chronicles, kids born with supernatural powers are taken from their families and forced into government research facilities called State Schools. At one such school, a group of Talents must work together to stop a dangerous experiment that’s already killed two of their peers and threatens others. If they’re caught they face Detention, and Detention at a State School has a whole different meaning.Wild Passion by Lori James is a treasure hunter intent on collecting a deadly, priceless statue. Then he meets Adelaide, a stubbornly beautiful and mysterious woman who knows more about the statue than she admits. Suddenly, James is tempted to give up everything for the one treasure he can’t seem to own … Adelaide.A Fairytale Ending by M.T. An unlucky actress discovers that there is no good and bad when it comes to vampires and werewolves, only bad and worse.Blind Sight by Kait Isla’s ability as a Seer has made her a life-long captive of a paranormal crime lord. Fae assassin, Ransom, offers her a chance at escape, but when she touches his hand she sees only blood, horror, apocalypse. What reason can Ransom have for wanting to rescue her, and can she possibly trust a man who deals in death?The Sacrifice by Toni After a chance meeting with the mysterious Alfred Barstow, Jennifer is swept off her feet by his whirlwind courtship of her, so much so that she accepts his proposal of marriage. Leaving her boyfriend Peter behind, she heads off to start a new life in California, unaware there’s more to Alfred than meets the eye – and a sinister plot behind his proposal. The Sacrifice is a story about what happens when the man of your dreams turns out to be your worst nightmare…and then some!Until the Breaking of the Day by Daniel The Underground. A realm of flame, blood, and knives in the dark. When its prince returns from exile, a young demon girl will learn his secrets.If You Leave by Stacey Wallace Despite their devotion to one another, Gabrielle and Jorge have been living separate lives. That is, until Gabrielle's life ends. Reunited and it feels so...complicated?Please All proceeds from this anthology will be donated to GreaterGood.Org charity",
  "genres": [
    "Paranormal",
    "Paranormal Romance",
    "Anthologies",
    "Romance",
    "Fantasy",
    "Short Stories",
    "Magic"
  ],
  "author": "H.P. Mallory",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/10629471-kiss-me-kill-me"
}