{
  "title": "The Mystery of Hurtleberry House",
  "description": "An alternate cover edition can be found here and here.Most people would be excited to be hosting their own TV show. However, most people do not work for Reboot, a television station better known for employing the rejects of the “legitimate media” than the quality of its programming. Such is the fate of Irene Waters, a once promising Christian reporter struggling to recover from a counterfeit scandal that ruined her career and left her questioning her trust in God. As her employment options are limited, she finds herself assigned to a cheesy paranormal investigation show called “Irene's Eerie Adventures”. She and her cameraman, the talented but reckless Troy Stenson, are quickly dispatched to their first assignment, a rumored haunted house. At first glance their subject, Hurtleberry House, does not look promising even for the less than ambitious goal of “Good Television”. Putting aside the nonsensical name, the house is undergoing major renovations making filming itself a challenge. Even worse, the residents are cliché and the ghost is camera shy. Fortunately for the Reboot team, all is not as it first appears as circumstances soon take a turn for the weird if not the supernatural. For Irene soon discovers that everything they thought they knew about the house and its ghost has been brought into question with the apparent goal of tricking a low budget TV show into coming out to film. But why and who is behind it? The flamboyant owner who appears to be a true believer in the family ghost? Her sensible sister with the grating personality who seems determined to protect her flamboyant sibling? The helpful but cranky elderly caretaker who could have ulterior motives? Or the handsome, but oddly redundant handyman who appears to have few skills and no apparent part in the renovations? Irene will have to draw upon her until now unknown deductive skills and renewed faith in God to solve the real mystery of Hurtleberry House. A goal somewhat hampered by her efforts to curtail, with varying degrees of success, the enthusiasm of her cameraman to exploit the sensational. Whether it actually exists or not.",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "Christian Fiction",
    "Paranormal",
    "Fantasy",
    "Christian",
    "Ghosts"
  ],
  "author": "C.L. Ragsdale",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/10629520-the-mystery-of-hurtleberry-house"
}