{
  "title": "Teaching the Cat to Sit: A Memoir",
  "description": "Nuanced and poignant, heartrending and funny, Michelle Theall’s thoughtful memoir is a universal story about our quest for unconditional love from our parents, our children, and most important, from ourselves.  Even when society, friends, the legal system, and the Pope himself swing toward acceptance of the once unacceptable, Michelle Theall still waits for the one blessing that has always mattered to her the most: her mother’s. Michelle grew up in the conservative Texas Bible Belt, bullied by her classmates and abandoned by her evangelical best friend before she’d ever even held a girl’s hand. She was often at odds with her volatile, overly dramatic, and depressed mother, who had strict ideas about how girls should act. Yet they both clung tightly to their devout Catholic faith—the unifying grace that all but shattered their relationship when Michelle finally admitted she was gay. Years later at age forty-two, Michelle has made delicate peace with her mother and is living her life openly with her partner of ten years and their adopted son in the liberal haven of Boulder, Colorado. But when her four-year-old’s Catholic school decides to expel all children of gay parents, Michelle tiptoes into a controversy that exposes her to long-buried shame, which leads to a public battle with the Church and a private one with her parents. In the end she realizes that in order to be a good mother, she may have to be a bad daughter. Michelle writes with wry wit and bald honesty about her life, seamlessly weaving her past and her present into a touching commentary on all the love, pain, and redemption that families inspire. Teaching the Cat to Sit makes us each reflect on our sense of humanity, our connection to religion, and our struggles to accept ourselves—and each other—as we are.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "LGBT",
    "Biography",
    "Biography Memoir",
    "Queer",
    "Lesbian"
  ],
  "author": "Michelle Theall",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/16058667-teaching-the-cat-to-sit"
}