{
  "title": "A Girl Like You",
  "description": "In the 1930s and '40s in Angelina, California, Satomi is the only girl with one white parent and one Japanese parent. There are Japanese families, but Satomi is neither a part of the white community nor the Japanese one. She is \"other\" to both. Things get worse for Satomi—and all people with even a drop of Japanese blood—when Japan poses a threat to the United States. Her father joins the Navy, in part to fight for his country, and in part to protect his wife and daughter from racist citizens, but dies in the bombing of Pearl Harbor. Rather than being celebrated as a hero, his death is ignored by the neighbors who shun Satomi and her mother. Shortly thereafter, they are taken to internment camps where they are treated like animals.Satomi's sudden loss of freedom is a terrible thing to bear, and she is disgusted by the utter lack of privacy, the open latrines, the sewage that runs behind their barrack, and the poorly built hovels that allow stinging dirt and dust to enter during frequent storms. But in the camp she finds a community for the first time. Not all of the Japanese residents welcome her, but Satomi and her mother find good friends in the family housed next to them in the barracks, and in the camp doctor, who is drawn to Satomi's spirit and her mother's grace. Satomi cares for Cora, one of the young orphans at the camp, as a daughter.Throughout it all, Satomi yearns for love. When she is finally freed from the internment camp, she heads east, finding a job, a shabby room, and several suitors in New York. There are men who would make her life easier, those who would take care of her, but Satomi insists on love—and finds it, in unexpected places.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Cultural",
    "Adult Fiction",
    "Japan",
    "Historical",
    "World War II"
  ],
  "author": "Maureen Lindley",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/16059335-a-girl-like-you"
}