{
  "title": "The Art of Joy",
  "description": "Goliarda Sapienza's The Art of Joy was written over a nine year span, from 1967 to 1976. At the time of her death in 1996, Sapienza had published nothing in a decade, having been unable to find a publisher for what was to become her most celebrated work, due to its perceived immorality. One publisher's rejection letter exclaimed: 'It's a pile of iniquity.' The manuscript lay for decades in a chest finally being proclaimed a \"forgotten masterpiece\" when it was eventually published in 2005.This epic Sicilian novel, which begins in the year 1900 and follows its main character, Modesta, through nearly the entire span of the 20th century, is at once a coming-of-age novel, a tale of sexual adventure and discovery, a fictional autobiography, and a sketch of Italy's moral, political and social past. Born in a small Sicilian village and orphaned at age nine, Modesta spends her childhood in a convent raised by nuns.Through sheer cunning, she manages to escape, and eventually becomes a princess. Sensual, proud, and determined, Modesta wants to discover the infinite richness of life and sets about destroying all social barriers that impede her quest for the fulfilment of her desires. She seduces both men and women, and even murder becomes acceptable as a means of removing an obstacle to happiness and self-discovery.Goliarda Sapienza (1924-1996) was born in Catania, Sicily in 1924, in an anarchist socialist family. At sixteen, she entered the Academy of Dramatic Arts in Rome and worked under the direction of Luchino Visconti, Alessandro Blasetti and Francesco Maselli. She is the author of several novels published during her lifetime: Lettera Aperta (1967), Il Filo Di Mezzogiorno (1969), Università di Rebibbia (1983), Le Certezze Del Dubbio (1987). L'Arte Della Gioia is considered her masterpiece.Anne Milano Appel, Ph.D., a former library director and language teacher, has been translating professionally for nearly twenty years, and is a member of ALTA, ATA, NCTA and PEN. Her translation of Giovanni Arpino's Scent of a Woman (Penguin, 2011) was named the winner of The John Florio Prize for Italian Translation (2013).",
  "genres": [
    "Fiction",
    "Italian Literature",
    "Feminism",
    "Italy",
    "Historical Fiction",
    "Womens",
    "Classics"
  ],
  "author": "Goliarda Sapienza",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/16059403-the-art-of-joy"
}