{
  "title": "The Adventures of Henry Thoreau: A Young Man's Unlikely Path to Walden Pond",
  "description": "Henry David Thoreau has long been an intellectual icon and folk hero. In this strikingly original profile, Michael Sims reveals how the bookish, quirky young man who kept quitting jobs evolved into the patron saint of environmentalism and nonviolent activism.Working from nineteenth-century letters and diaries by Thoreau's family, friends, and students, Sims charts Henry's course from his time at Harvard through the years he spent living in a cabin beside Walden Pond in Concord, Massachusetts.Sims uncovers a previously hidden Thoreau-the rowdy boy reminiscent of Tom Sawyer, the sarcastic college iconoclast, the devoted son who kept imitating his beloved older brother's choices in life. Thoreau was deeply influenced by his parents-his father owned a pencil factory in Concord, his mother was an abolitionist and social activist-and by Ralph Waldo Emerson, his frequent mentor. Sims relates intimate, telling moments in Thoreau's daily life-in Emerson's library; teaching his neighbor and friend, Nathaniel Hawthorne, to row a boat; exploring the natural world and Native American culture; tutoring Emerson's nephew on Staten Island and walking the streets of New York in the hope of launching a writing career.Returned from New York, Thoreau approached Emerson to ask if he could build a cabin on his mentor's land on the shores of Walden Pond, anticipating the isolation would galvanize his thoughts and actions. That it did. While at the cabin, he wrote his first book, A Week on the Concord and Merrimack Rivers , and refined the journal entries that formed the core of Walden . Resisting what he felt were unfair taxes, he spent the night in jail that led to his celebrated essay “Civil Disobedience,” which would inspire the likes of Gandhi and Martin Luther King.Chronicling Thoreau's youthful transformation, Sims reveals how this decade would resonate over the rest of his life, and thereafter throughout American literature and history.",
  "genres": [
    "Biography",
    "Nonfiction",
    "History",
    "Nature",
    "Philosophy",
    "Memoir",
    "Autobiography"
  ],
  "author": "Michael Sims",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/16059701-the-adventures-of-henry-thoreau"
}