{
  "title": "Gumbo Goes Downtown",
  "description": "For the serious young reader - ages 6-9 This version of GUMBO GOES DOWNTOWN does not include the illustrations. The text itself carries the story completely...no pictures necessary for the serious young reader. This is a high level reading experience, and the quick turning pages keep the story moving. If the luminous illustrations are better for your needs, then please click on GUMBO GOES DOWNTOWN in the Fully Illustrated Version. SELF ESTEEM - DISCOVERING HAPPINESS WHERE YOU ARE Running away from home! Who doesn't sometimes dream of it? To go someplace else, to be somebody else! Here is the story of a loveable mutt named Gumbo, who-longing to be SOMEBODY-abandons his watchdog duties and follows the streetcar tracks downtown to the historic French Quarter of New Orleans. There he discovers a world of new experiences and meets a colorful cast of canine characters, including a dancing poodle and self-appointed tour guide named Pompon, the blue-ribboned Champion Stella de Chateau Blanc, the fearsome Catahoula Hound and, finally, a nameless, homeless dog who visits Gumbo on the moonlit levee like a sad dream. On his journey, Gumbo learns that the identity he seeks is not to be found in new places, however exciting, or in new acquaintances, however distinguished. For Gumbo, the road to self-esteem leads right back home, where he loves and is loved and where he is, after all, somebody very important. Author Carol Talley, a former resident of New Orleans, returned to this picturesque city, tracing Gumbo's journey down St. Charles Avenue and through the French Quarter to Jackson Square and the riverfront. From Gumbo's own shotgun house with its rose-bedecked chain-link fence to the sun-drenched Mississipi with its mighty ships and paddle wheelers, Carol has captured the kaleidoscopic magic of New Orleans for this classic tale of running away and returning. Gumbo thinks he leads a pretty dull life. Maybe that's why he decides one day to run away from home, to leave his watchdog duties and go Downtown. Children will delight in following Gumbo as he finds adventure aplenty in the historic French Quarter and meets a delightful cast of canine characters. And they will learn-as Gumbo does-that wherever he goes and whomever he meets, everyone seems to be looking for the very thing he has left behind-a place called home. This is such a popular book in New Orleans, especially since the tragedy of Katrina. With its beautiful descriptions of the famous spots in the city, it has become especially dear to tourists and those with happy memories of fabulous New Orleans. GUMBO GOES DOWNTOWN will help young readers examine the importance of their own homes, and help them explore sources of inner contentment. A SURPRISE and added bonus is the \"Enrichment Information\" which includes lots of facts about Louisiana, the Mississippi River, New Orleans, a ShotGun House, the French Quarter, Jackson Square, The St. Charles Streetcar, and Gumbo (not the main character, but the spicy stew made with shrimp, crabs, oysters, chicken, ham, or even rabbit or squirrel! Seasoned with thyme, bayleaf, chilies, and cayenne pepper and thickened with okra or file, it is delicious!) This is fascinating detail that did not make it into the story itself, but is very rich in colorful descriptions of many famous places in and around New Orleans. A second big plus is the \"Letter to Parents and Educators\" which includes many relevant questions and comments to facilitate conversation with the young reader about the message of the story...the importance of home...right where you are.",
  "genres": [
    "Picture Books",
    "Childrens",
    "Animals"
  ],
  "author": "Carol Talley",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/10630687-gumbo-goes-downtown"
}