{
  "title": "A Season in Carcosa",
  "description": "H.P. Lovecraft. Karl Edgar Wagner. Peter Straub. Those are a few of the names that stand tall in our genre and when it comes to Robert W. Chambers and his King in Yellow they agree, Chambers' beguiling tales of the King In Yellow and Carcosa are among the best in “weird” fiction. Miskatonic River Press and Joseph S. Pulver, Sr. are proud and delighted to present an anthology of all new tales inspired by Chambers.In haunted and splintered minds… Minds shackled to lonely places…In the unbound shadows infesting hearts of beautiful woman with frantic sensations…In an old house where biblical thrived…In threadbare truths, disturbed by despair, cobwebbed with illusions…In far cold Carcosa…Lies madness.In A Season In Carcosa readers will find the strange and mysterious places of heart and mind that spring from madness, and those minds and the places touched by it are the realms that are mined. Chambers' legacy of the worms and soft decay that spring from reading the King In Yellow play stir both new and established talents in the world of weird fiction and horror to contribute all new tales that pay homage to these eerie nightmares. In Carcosa twilight comes and minds lost in the mirrors of lust and fear, are awash in legacies of shadows, not mercy…Table of Contents“My Voice is Dead” by Joel Lane“Beyond the Banks of the River Seine” by Simon Strantzas“Movie Night at Phil's” by Don Webb“MS Found in a Chicago Hotel Room” by Daniel Mills“it sees me when I’m not looking” by Gary McMahon“Finale, Act Two” by Ann K. Schwader“Yellow Bird Strings” by Cate Gardner“The Theatre & Its Double” by Edward Morris“The Hymn of the Hyades” by Richard Gavin“Slick Black Bones and Soft Black Stars” by Gemma Files“Not Enough Hope” by Joseph S. Pulver, Sr.“Whose Hearts are Pure Gold” by Kristin Prevallet“April Dawn” by Richard A. Lupoff“King Wolf” by Anna Tambour“The White-Face at Dawn” by Michael Kelly“Wishing Well” by Cody Goodfellow“Sweetums” by John Langan“The King is Yellow” by Pearce Hansen“D T” by Laird Barron“Salvation in Yellow” by Robin Spriggs“The Beat Hotel” by Allyson Bird",
  "genres": [
    "Horror",
    "Short Stories",
    "Weird Fiction",
    "Fiction",
    "Anthologies",
    "Fantasy",
    "Lovecraftian"
  ],
  "author": "Joseph S. Pulver Sr.",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/16062930-a-season-in-carcosa"
}