{
  "title": "Why Am I Still Single? A Tough Love Guide for Single Women",
  "description": "[Jacket Text]: How many times have you listened to a friend or coworker drone on about her disastrous love life, completely baffled by the fact that she is still single while you politely bite your tongue to keep from revealing what you're really thinking-Really?' Cause boy do I know why you're single, lady! It's obvious to you and everyone else in her life why she can't keep a man. After all, if you had a Y-chromosome (or batted for the other team), you wouldn't date her either. She is too [Fill in the blank]. Clingy? Depressing? Obsessive? Slutty? Self-absorbed? Insecure? But of course, you could never tell her that. No one can. Not her mom, sister, or best friend. She would hate you if you did. Or maybe you are the annoying friend or coworker. Maybe you've been so busy venting about your last breakup that you missed those glazed over expressions on your friends' faces. Did they mumble things like \"He wasn't good enough for you\" and \"There are plenty of fish in the sea\"? Maybe that's code for \"Pardon me. Sorry to interrupt. Could you please hand me that fork? I want to jab it in my eye.\" Whether you're the lonely one on date night or your drama-filled friend is, this book will help you to arm yourself with information for your next relationship or to learn new phrases for that heart to heart talk with your girl who is tired of the single life. It's time to cut the crap. It's time for advice from someone who doesn't sugar coat and who has listened attentively for more than 20 years to her male friends vent about what women do that drives them crazy. She isn't a girly girl dishing advice. She isn't a man trying to explain to women why they suck. She is a woman interpreting a man's perspective to help women who don't love the single life to get back out there and be a better partner. You'll find anecdotes, explanations, homework, and even quotes from the author's male friends about each type of woman discussed. Are you ready to take a good hard look at what women really do to sabotage their own happiness?",
  "genres": [
    "Self Help"
  ],
  "author": "Shay Stone",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/16062603-why-am-i-still-single-a-tough-love-guide-for-single-women"
}