{
  "title": "Dead Bob",
  "description": "A submerged body with a finger-severed hand waving atop the water is enough to prompt Bob Ryba to wade into the murky waters of the Gowanus Canal. Perhaps if Bob had seen the approaching dark clouds behind him he would have thought better of it. Within seconds a lightning bolt strikes him squarely in the head leaving him dead and floating in the canal. Or did it?“I woke up dead on a hot Thursday in August,” Bob says as he springs to wakefulness in the neighborhood funeral home, startling his friend, Gerry Cassapulla.Bob has a lot of explaining to do. Not only to Gerry, the gay funeral director, but to his one-armed, large breasted, sex charged girlfriend Loretta. But in time, she accepts that Bob has somehow entered the world of the paranormal. Romance still blooms, and sexual juices flow, between the living and the dead. Or perhaps, the undead?But what is Bob? He’s not a zombie because he doesn't crave human flesh. And he’s not a vampire since he can't so much as even move a muscle during the dark hours. But he’s certainly no longer human.As Bob, Loretta and Gerry work to uncover the reason for Bob’s uncanny transformation in this urban fantasy set in Brooklyn, New York, a plague of serial murders infects the borough. Mysteriously, Bob and his two friends are catapulted into the world of amateur detectives, drawn toward discovering who has initiated the series of vile killings and horrifying dismemberments.As the trio of friends draw closer to the identity of the murderer, Bob learns that he can’t easily be killed and Loretta and Gerry find out that they are somehow psychically connected to their dead friend. A new kind of super hero? Maybe. Certainly a new kind of being, one with remarkable healing powers and raging sexual desire.Along the way to the showdown with the villain the three friends encounter:•a guilt-ridden, traumatized priest that may hold the key to the identify of the serial killer;•a mysterious man and woman that appear and disappear at will but not without first hinting at the reason for the changes in the new Bob;•a beautiful, chain-smoking, bi-sexual FBI agent;•a hard-nosed, African-American hipster reporter who suspects that Bob is more than just a regular Joe;•and a variety of colorful characters from the neighborhood of Carroll Gardens, Brooklyn.And then, what does all of this have to do with the Bible?Who is Bob and why is he dead? Join Bob, Loretta and Gerry in their quest – sometimes funny, often grotesque, and always erotic - to find out why the three of them no longer are simply two guys and a girl from Carroll Gardens, but a formidable force against evil.",
  "genres": [],
  "author": "Leonard Norman",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/16063867-dead-bob"
}