{
  "title": "The Fire of Merlin",
  "description": "The Return to Camelot trilogy continues in The Fire of Merlin.Seventeen-year-old Natasha Roth and her older brother, Arthur, are reunited once more with the Knights of the Round Table. Unfortunately their joy is not shared by Arthur’s girlfriend, “Slurpy” Samantha, whose hatred of Natasha has not been lessened by time or distance since the Roth family relocated to London.But Natasha’s happiness is short-lived. The knights come with ill news from Logres: a magical darkness has fallen over the land. The Lady of the Lake, Nimue, is battling against her former lover, Merlin, whom she imprisoned before the enchanted sleep. He has been freed and Natasha soon discovers that her own actions the previous year unlocked more than just a gateway between the past and the present. When “Slurpy” disappears, a frantic Arthur decides they must leave the 21st century once more and return to Camelot. With her beloved Sir Bedivere at her side, Natasha follows the sound of the bells and leads Arthur and the knights back into Logres. But there are more than bells ringing in her head. Natasha starts to suffer from terrifying visions in which she sees the destruction of Logres.As the darkness continues to infect the living, the people start turning on each other, accusing outsiders of witchcraft. Terrified that Natasha will be hurt, Sir Bedivere takes her, the dwarf Byron and Byron’s sister, Guinevere, into the safety of his father’s castle. Yet nowhere in Logres is free from fear and suspicion, and Sir Bedivere unwittingly leads Natasha into a terrifying chain of events in which time itself is manipulated.Natasha must uncover the truth about the danger to Logres and those she loves. Who is the real threat to Arthur? Can myth and legend become fact? What is the secret that “Slurpy” is now hiding?And for the love of all things holy, when will Logres invent saddles?",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Time Travel",
    "Arthurian",
    "Romance",
    "Urban Fantasy",
    "Magic"
  ],
  "author": "Donna Hosie",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/16064438-the-fire-of-merlin"
}