{
  "title": "The Last Original Wife",
  "description": "Experience the sultry Southern atmosphere of Atlanta and the magic of the Carolina Lowcountry in this funny and poignant tale of one audacious woman’s quest to find the love she deserves, from New York Times bestselling author Dorothea Benton Frank.Leslie Anne Greene Carter is The Last Original Wife among her husband Wesley’s wildly successful Atlanta social set. His cronies have all traded in the mothers of their children they promised to love and cherish—’til death did them part—for tanned and toned young Barbie brides.If losing the social life and close friends she adored wasn’t painful enough, a series of setbacks shake Les’s world and push her to the edge. She’s had enough of playing the good wife to a husband who thinks he’s doing her a favor by keeping her around. She’s not going to waste another minute on people she doesn’t care to know. Now, she’s going to take some time for herself—in the familiar comforts and stunning beauty of Charleston, her beloved hometown. In her brother’s stately historic home, she’s going to reclaim the carefree girl who spent lazy summers sharing steamy kisses with her first love on Sullivans Island. Along Charleston’s live oak- and palmetto-lined cobblestone streets, under the Lowcountry’s dazzling blue sky, Les will indulge herself with icy cocktails, warm laughter, divine temptation and bittersweet memories. Daring to listen to her inner voice, she will realize what she wants . . . and find the life of which she’s always dreamed.Told in the alternating voices of Les and Wes, The Last Original Wife is classic Dorothea Benton an intoxicating tale of family, friendship, self-discovery, and love, that is as salty as a Lowcountry breeze and as invigorating as a dip in Carolina waters on a sizzling summer day.",
  "genres": [
    "Fiction",
    "Chick Lit",
    "Romance",
    "Audiobook",
    "Southern",
    "Contemporary",
    "Book Club"
  ],
  "author": "Dorothea Benton Frank",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/16065512-the-last-original-wife"
}