{
  "title": "Between Expectations: Lessons from a Pediatric Residency",
  "description": "When Dr. Meghan Weir first dons her scrubs and steps onto the floor of Children’s Hospital Boston as a newly minted resident, her head is packed with medical-school-textbook learning. She knows the ins and outs of the human body, has memorized the correct way to perform hundreds of complicated procedures, and can recite the symptoms of any number of diseases by rote. But none of that has truly prepared her for what she is about to experience. From the premature infants Dr. Weir is expected to care for on her very first day of residency to the frustrating teenagers who visit the ER at three in the morning for head colds, each day brings with it new challenges and new lessons. Dr. Weir learns that messiness, fear, and uncertainty live beneath the professional exterior of the doctor’s white coat. Yet, in addition to the hardships, the practice of medicine comes with enormous rewards of joy, camaraderie, and the triumph of healing. The three years of residency—when young doctors who have just graduated from medical school take on their own patients for the first time—are grueling in any specialty. But there is a unique challenge to dealing with patients too young to describe where it hurts, and it is not just having to handle their parents. In Between Expectations: Lessons from a Pediatric Residency, Dr. Weir takes readers into the nurseries, ICUs, and inpatient rooms of one of the country’s busiest hospitals for children, revealing a world many of us never get to see. With candor and humility, she explores the many humbling lessons that all residents must learn: that restraint is sometimes the right treatment option, no matter how much you want to act; that some patients, even young teenagers, aren’t interested in listening to the good advice that will make their lives easier; that parents ultimately know their own children far better than their doctors ever will. Dr. Weir’s thoughtful prose reveals how exhaustion and doubt define the residency experience just as much as confidence and action do. Yet the most important lesson that she learns through the months and years of residency is that having a good day on the floor does not always mean that a patient goes home miraculously healed—more often than not, success is about a steady, gradual discovery of strength. By observing the children, the parents, and other hospital staff who painstakingly provide care each day, Dr. Weir finds herself finally developing into the physician (and the parent) she hopes to become. These stories—sometimes funny, sometimes haunting—expose the humanity that is so often obscured by the doctor’s white coat.",
  "genres": [
    "Medicine",
    "Medical",
    "Nonfiction",
    "Memoir",
    "Biography",
    "Autobiography"
  ],
  "author": "Meghan MacLean Weir",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/10076317-between-expectations"
}