{
  "title": "The Tower",
  "description": "After the rise comes the fallWhen a cyber-attack at NASA's Goddard Space Flight Center in Maryland disables the Hubble telescope and the Nobel Prize-winning scientist in charge disappears, the only clues left behind are a cryptic countdown clock and a chilling message displayed on the missing man's computer: Mankind Must Look No Further.Newly appointed FBI agent Joe Shepherd, a former academic star with degrees in astrophysics and computer science, is uniquely qualified to handle the investigation, but he is also hiding some secrets of his own. He discovers a note in the missing scientist's handwriting that reads \"end of days\" and further evidence linking the cyber-attack to a series of strange events from eight months earlier—an explosion at the Citadel, an ancient monastery in Turkey; the deadly viral outbreak that occurred in its wake; and the disappearance of an American journalist named Liv Adamsen and ex–special forces operative Gabriel Mann.Liv has been trapped in the Syrian Desert, a prisoner of the prophecy that drove her there and now whispers of terrible things to come. Gabriel, infected and tormented by the deadly virus he carried out of the Citadel, is desperate to return before it spreads.Shepherd's investigation takes him on a journey to the secrets at the very edge of the universe and also deep into his own past as the countdown clock continues and extraordinary events begin to manifest around the globe—animals migrating out of season, extreme weather battering the planet, people deserting the cities as they answer a growing urge to return to their original homes. In this exhilarating conclusion to the internationally bestselling Ruin trilogy, one woman's destiny weaves the past and present together in a way that will change the future for us all. But what is the \"end of days\" and what does it really mean for humankind—will it be revelation or devastation?",
  "genres": [
    "Thriller",
    "Fiction",
    "Mystery",
    "Fantasy",
    "Science Fiction",
    "Historical Fiction",
    "Apocalyptic"
  ],
  "author": "Simon Toyne",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/16065633-the-tower"
}