{
  "title": "زيوس يجب أن يموت Zeus must die",
  "description": "زيوس يجب أن يموت هي رواية للكاتب الشاب أحمد الملواني تجمع عناصر من المثيولوجيا الاغريقية ولا معقولية السياسة المصرية عبر رصد كاتب مصري ممزق بين اتجاهات أصدقاءه السياسية المختلفة وبينما يبدو غارقا في اللامبالاة يخط رواية مستمدة من الاساطير الاغريقية حول كرونوس الناقم على الآلهة مثلما هو ناقم على الحالة السياسية. ويغرق القارئ بين متابعة أسطورية مبهورة لكرونوس ضد الآلهة ومعايشة حياتية خانقة للكاتب في السياسة المصريةالرواية قدم لها الناقد الكبير د-سيد البحراويZeus must die is an egyptian novel written by Ahmed el-Mallawany (1980, Alexandria) combines between the geek mythology and the unrational egyptian politics through a writer (main character) whom trapped between his friends with different ideologies and trying to write the story of Kronos the poor peasant tried to revange from gods. the reader follows both the legendary quest of Kronos against Olympian gods and the suffocating life of the writer in the Egyptian liveــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــــقالوا عن الروايةأحمد الملواني كاتب واعد قادر ـ بكل تأكيد ـ على أن يضيف إلى القص العربي إضافة حقيقية، سواء بقصصه القصيرة التي فازت في أكثر من مسابقة، أو بهذه الرواية الأولى المتميزة (زيوس يجب أن يموت). د.سيد البحراوي أستاذ الأدب العربي الحديث بكلة الآداب، جامعة القاهرةهذه رواية ذات دلالات سياسية اجتماعية ثقافية شديدة الأهمية، تتعرض لقضية نضال الانسان المقهور، لمقاومة استبداد الحكام وتسلطهم من أجل انتزاع الحرية المـسلوبة ، خاصة فى البلاد المتخلفة و المحكومة بعسكر يرون فى أنفسهم آلهة \"مخلدة\" لايمكن أن تموت ، بينما يرون فى أفراد الشعب مخلوقات \"فانية\" تعد فى نظرهم قطيعا من العبيدالروائي الكبير:سعيد سالمرواية تغري المتلقي بقراءة صفحاتها ، وتدفعه دفعا إلى التفاعل معها، والغوص في بحار معانيها، ومشاركة الكاتب تجربته الفنية... مما يدل دلالة قوية على أننا أمام كاتب موهوب لديه من الموهبة والقدرة على الإبداع ما يؤهله لإثراء السرد الروائي بإبداعات مستقبلية تضعه في مكانة متميزة بين المبدعين الذين أهلتهم موهبتهم لتصدر المشهد الإبداعي في عصرنا الحديث.د. أحمد محمود المصريالرواية تحوي رواية داخل الرواية، وهي عبارة عن أسطر قصيرة تبدو أشبه بالشعر وتستقي أجواءها من الأساطير اليونانية. أما الرواية الأصلية فهي قصة صداقة تجمع بين أصدقاء من الجامعة... ونتابع على طول الرواية مصائرهم وهي تختلف بهم، لتوحدهم جميعا داخل قبضة النظام، سواء كان نظام الدولة أو نظام المعارضة...عن جريدة أخبار الأدب",
  "genres": [],
  "author": "أحمد الملواني",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/16066050-zeus-must-die"
}