{
  "title": "Ambushing Ariel",
  "description": "Ariel Hamm has always had a tender heart. Her love for her sister, Carmen, and her best friend, Trisha, has always been a priority in her life. But at twenty-eight, she is ready to start focusing on what she wants. After her fiancée unexpectedly ends their engagement, she is searching to redefine who she really is. A pilot for Boswell International, she knows flying is not her first love. Unhappy, she finally makes a decision based on what she wants – to live on the property she purchased in Wyoming and care for the stray and neglected animals that have always captured her heart.Her plans change suddenly when she finds herself on a warship headed for a distant planet. Determined never to let another man distract her from her dream or break her heart, Ariel makes plans to escape and make her way back home no matter what. What she doesn’t expect is the alien male who is just as determined to keep her by his side! Mandra Reykill never expects to find his true mate so unexpectedly - or so painfully. He knows his older brother is returning home with his true mate and her friends but never suspected his true mate could be among the women. His dragon recognizes her immediately and falls in love with the delicate beauty. His symbiot is enchanted with her gentle touch and kindness. Unfortunately, all Mandra the man gets is a stubborn female refusing to acknowledge his claim on her and determined to escape him at the first available moment. To top it off, his nice, orderly life is suddenly turned upside down when he finds his home – and his warship – suddenly infested with creatures from all over the galaxy that are just as taken with his mate as his dragon and his symbiot.Now, he needs to find a way to convince Ariel he is the alien for her while trying to keep his sanity! But, he is not the only alien wanting to claim Ariel; another has set his sights on Ariel and is just as determined to claim her. Can Mandra convince the stubborn human female who has captured his heart their future together can be her new dream before she escapes him forever?",
  "genres": [
    "Aliens",
    "Romance",
    "Dragons",
    "Science Fiction",
    "Paranormal",
    "Fantasy",
    "Paranormal Romance"
  ],
  "author": "S.E. Smith",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/16066215-ambushing-ariel"
}