{
  "title": "Georgetown Academy: Book One",
  "description": "It’s the beginning of a new political administration. That might not mean much at most high schools, but at Georgetown Academy, Washington D.C.’s most elite prep school, January 20th means new alliances, new flings, and new places to party.  While freshmen—nicknamed “interns” for their willingness to jump into bed with anyone higher on the D.C. totem pole—navigate the not-so-friendly halls of GA searching for Algebra and Bio classes, the school’s lifers have other things on their minds.  For self-proclaimed D.C. royalty Brinley Madison (of those Madisons), the first day of school is all about establishing the social hierarchy and playing the part of perfect political wife to her boyfriend, the outgoing Vice President’s son. Too bad he has a wandering eye that puts Bill Clinton’s to shame. Can she keep him, and her own secret vice, in check?  Ellie Walker, Brinley’s best friend, floats through the halls on the arm of golden boy Hunter McKnight (the JFK of GA). But when her ex-boyfriend, Gabe, returns to town and her Senator mother’s political nemesis is reelected, Ellie’s life starts to snowball out of control.  Shy, quiet Evan Hartnett is more into books than beer, and her closet is full of t-shirts and jeans instead of Jason Wu and Jimmy Choo. No one’s ever really noticed her—but she’s been noticing them. When her star rises as an intern at D.C.’s most-watched political news show, she soon finds the two worlds colliding in ways that make her question what’s secret and what’s fair game.  New girl Taryn Reyes is all laid-back, California cool; with a father who’s in line to be the first Hispanic president, she’s ready to dive into the D.C. scene with an open mind. But when her fellow students turn out to be more interested in spreading rumors than making friends, she realizes that forging a drama-free path might be a lot harder than she thinks.  With so many new friends and former flames in the mix, things are bound to get a little heated. And while diplomatic immunity might keep the cops away, there’s not much it can do about the press.  In a town where one teenage misstep can turn into a national scandal, the students at Georgetown Academy will have to be on their best behavior—or, at least, they’ll have to make the world believe that they are.  Because there’s only one whatever you do, don’t get caught.",
  "genres": [
    "Young Adult",
    "Contemporary",
    "Fiction",
    "High School",
    "Romance",
    "Realistic Fiction",
    "Politics"
  ],
  "author": "Alyssa Embree Schwartz",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/16066149-georgetown-academy"
}