{
  "title": "Sappho's Fables, Volume 1: Three Lesbian Fairy Tale Novellas",
  "description": "The Sappho's Fables series takes well-known, beloved fairy tales and retells them from a lesbian perspective. Volume One contains the first three novellas in the series: SEVEN (Snow White), BRAIDED (Rapunzel) and CRUMBS (Hansel and Gretel), compiled together in an enchanting omnibus edition. * SEVEN: A Lesbian Snow White The strange witch girl Neve has skin as white as snow, lips as red as blood, and a dark secret. Her father Lexander, an alchemist, harbors an evil obsession, and Catalina, his newest bride, made the grave mistake of becoming his wife. When Catalina finds herself falling in love with his daughter, Neve, instead, the deepening bond between the women sets in motion the final chapter of a story that began long ago, with a desperate longing and a handful of apple seeds. Together, Neve and Catalina must venture into the Huntsman's haunted forest to undo what has been done and set themselves free. * BRAIDED: A Lesbian Rapunzel Zelda is cursed to spend her days on a platform in an ancient, holy tree, growing her hair long enough to touch the ground. But it wasn’t her curse to bear: Gray, the witch’s daughter, was meant for that lonely fate. Gray visits Zelda each day, mourning their switched fates, and falling deeper in love with the cursed girl, until one night, at the Not-There Fair, an extraordinary creature outlines a magical plan that could set both of them free. Will Gray’s love for Zelda be strong enough to survive the strange dream world of Chimera, or will Zelda remain a prisoner of the curse forever? * CRUMBS: A Lesbian Hansel and Gretel Greta's never ventured beyond the refuge of the Heap. Outside, the Ragers lurk, ever hungry and hunting. But Greta and her brother, half-starved and now alone, must risk death for the dream of safety they hope to find within the metal forest. Once there, nothing is as it seems: in the confines of a crumbling old candy factory, the woman who rescues them with sweet words and sweeter treats harbors a dangerous secret.",
  "genres": [
    "Fantasy",
    "LGBT",
    "Lesbian",
    "Short Stories",
    "Fairy Tales",
    "Romance",
    "Queer"
  ],
  "author": "Elora Bishop",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/16066474-sappho-s-fables-volume-1"
}