{
  "title": "Bewitching the Knight",
  "description": "Bewitching the KnightIn Medieval Scotland if she dresses, talks and curses like a witch....Archaeologist Dr. Samantha Ryan does not want or need the public relations firm her boss hired to give her advice on how to speak, act, or charm. She’s busy. She’s just found out where the Scottish Crown of the MacGregor’s is hidden and needs to beat her lying, cheating competitor, Jerry, to the Scottish highlands and claim it for her University! After finding it, and her nemesis, a struggle ensues and they travel back in time to medieval Scotland where Jerry calls her a very ugly name. Unfortunately the villagers think he said “witch”, tie her up, and start gathering wood for a bonfire. Thinking to play on their superstitions so she can save herself, she curses them all. Not her best idea yet. Perhaps she should have listened to that P.R. firm after all? ...it’s time to gather firewood!Laird MacGregor is a dead man walking. It’s only a matter of time before one of the many attempts on his life will succeed. When Ian is informed that the villagers are burning another witch, he is determined to save the hapless female. Unfortunately the stupid woman doesn’t know when to keep her mouth shut. Laird MacGregor rescues her anyway, ensuring any headway he’d made toward earning the villagers trust is shattered. Locking her up only makes his people fear the witch in possession of his tower.  A witch determined to teach him to win friends and influence people. While trying to find out who is trying to murder him, keep the crown entrusted to him by his father safe, and control a rowdy woman who may indeed be gifted with foresight, Ian decides he more than willing to give her the firstborn she’d initially demanded. As long as she marries him first.                                                             Past and present are about to ignite.                                                          When modern meets medieval, can there be a happily ever after?",
  "genres": [
    "Time Travel",
    "Romance",
    "Historical Romance",
    "Historical Fiction",
    "Fantasy",
    "Medieval",
    "Historical"
  ],
  "author": "Diane Darcy",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/16067655-bewitching-the-knight"
}