{
  "title": "Spending the Holidays with People I Want to Punch in the Throat",
  "description": "For fans of Laurie Notaro and Jenny Lawson comes an uproarious and oddly endearing essay collection for anyone trying to survive the holidays in one piece.When it comes to time-honored holiday traditions, Jen Mann pulls no punchesIn this hilariously irreverent collection of essays, Jen Mann, nationally bestselling author of People I Want to Punch in the Throat, turns her mordant wit on the holidays. On Mann’s naughty list: mothers who go way overboard with their Elf on the Shelf, overzealous carolers who can’t take a hint, and people who write their Christmas cards in the third person (“Joyce is enjoying Bunko. Yeah, Joyce, we know you wrote this letter.”). And on her nice list . . . well, she’s working on that one. Here, no celebration is off-limits. The essays include:• You Can Keep Your Cookies, I’m Just Here for the Booze• Nice Halloween Costume. Was Skank Sold Out?• Why You Won’t Be Invited to Our Chinese New Year PartyFrom hosting an ill-fated Chinese New Year party, to receiving horrible gifts from her husband on Mother’s Day, to reluctantly telling her son the truth about the Easter Bunny, Mann knows the challenge of navigating the holidays while keeping her sanity intact. And even if she can’t get out of attending another Christmas cookie exchange, at least she can try again next year.Praise for Spending the Holidays with People I Want to Punch in the Throat “Mann’s writing has transcended from witty anecdotes and complaints to notable satire. Hidden among the many laugh-out-loud zingers are lessons on how we relate to each other, and how ridiculous parenting culture has become.”—Associated Press “Following the success of her first book, she is now punching throats at holidays, starting from her being age two and continuing to the present, where she is a harried mother bemoaning not just Christmas but all holidays. . . . Harried holiday haters will chuckle and perhaps see themselves somewhere in Mann’s lifetime dislike of and misbehavior during America’s increasingly commercialized celebrations.”—Booklist “The cure for my cold holiday spirit this year is the sidesplitting new book by Jen Mann. . . . Mann delivers her signature punch lines and sharp critique on the oftentimes ridiculous shenanigans of the modern family. Her ability to make an otherwise boring subject come alive with colorful personalities, biting sarcasm, and impressively astute observations on suburban culture is what makes Mann so much fun to read and so easy to relate to.”—The Huffington Post “A lighthearted, laugh-out-loud book . . . with a feel of peeking into a diary.”—Mommy’s Memorandum “It really does make you laugh out loud.”—Shooting Stars Mag “A quick and delightful read that you can sneak in right before bed or when the kids are finally napping.”—FangirlNation “Grab a cup of hot cocoa, sit back and enjoy Jen’s latest collection of humorous rants dissecting the ‘most wonderful time’ of the year. She unleashes her biting wit and hilarious opinions on everything from cookie exchanges to annual humblebrag Christmas letters from overachieving moms to horrifying Christmases of her childhood.”—Creating Serenity “[Mann] has really mastered the short story format. . . . She packs the maximum amount of funny into the fewest words, and many of these essays are downright hilarious. . . . If you’ve read and liked her other books, you will definitely want to read this one, too.”—Bug Bug Book Reviews",
  "genres": [
    "Humor",
    "Nonfiction",
    "Christmas",
    "Memoir",
    "Holiday",
    "Essays",
    "Book Club"
  ],
  "author": "Jen Mann",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/16068287-spending-the-holidays-with-people-i-want-to-punch-in-the-throat"
}