{
  "title": "Mor",
  "description": "Bir bahçıvanın oğlu, eski solcu, yeni işadamı İlhan, gençlik yıllarında sıradan bir evlilik yapmış, ancak ellisini geçtikten sonra kendinden otuz yaş genç bir kapıcı kızına tutularak ondan bir de çocuk sahibi olmuştur. Hayatında yeni bir sayfa açma isteğiyle eşinden boşanma çabası içindedir. O gece sahip olduğu turistik otelde sevgilisi ve akrabalarıyla birlikte olduğunun birince yaşını kutlayacaklardır. Konuklar arasında İlhan'ın mutsuz kız kardeşi ve profesör erkek kardeşiyle onun karısı da vardır. İlhan'ın birlikte yaşadığı genç kadının, bir odada ölümü bekleyen babası ve birkaç yakını da oteldedirler. Öte yandan İstanbul'daki eş ve yazlıktaki baldız da sahnenin dışında, ama olayın içinde yer alırlar. Mor, İlhan'ın gördüğü tekinsiz bir rüyayla başlar ve yirmi dört saatlik bir sürede geçer; ancak kişilerin geçmişlerine ve geleceğe yönelik düşüncelerine doğru genişleyip yayılarak uzun bir zamanı kapsar. İnci Aral, derin gözlenmiş roman kişileri yoluyla, bireylerin bir noktada kesişen, iç içe geçen hayatlarını ve savrulma süreçlerini; ülkedeki insan, ilişki ve değerlerin çözülme koşulları içerisinde, herkesin kendinden çok şey bulacağı bir biçimde anlatıyor. Mor'un odak noktasında ise erkekler var. İnci Aral, gerilim dolu, gizemli, sürükleyici bir roman atmosferi kuruyor ve erkek dünyasının karmaşık labirentlerinde dolaşarak, onları yan tutmadan, şefkat ve incelikle anlamaya çalışıyor. Sevgiyle nefret; alışkanlıkla yenilik arzusu; değişme isteği ile korkular; içtenlik ve gizlenme gibi karşıtlıklar arasında bocalayan erkeklere yakından bakarken, edilgenlik ve var olma çabası; boşlukla gerçeklik; yaşamakla ölmek uçları arasında gidip gelen kadınları da erkeklerin dünyasındaki yerlerine oturtuyor. İnci Aral okurlarınca iyi bilinen kurgu, yazın ve dil ustalığı ile elbette.",
  "genres": [
    "Turkish Literature",
    "Turkish",
    "Roman",
    "Novels",
    "Fiction"
  ],
  "author": "İnci Aral",
  "average_rating": "3.25",
  "url": "https://www.goodreads.com/book/show/1606894.Mor"
}