{
  "title": "All That Glitters",
  "description": "Michelle Murphy and Alexis Vlodosky have been in love since they were teenagers, although their childhoods could not have been more different. Michelle is playful, determined and ambitious - Despite being the only child of a teenaged, alcoholic mother who sometimes lets her judgment of the men she allows in their home throw wrenches in her relationship with her daughter. Michelle knows what she has to do to leave the small, redneck surf town in Florida where she's lived her entire life to make it as a singer in Hollywood. Nothing - and nobody - will come between her and that goal.  Alexis, who moves to Florida from New York City with her Jewish father, French Catholic mother and autistic younger brother, is wildly intelligent and becomes instantly enamored with the feisty Michelle after she accidentally wipes out in their driveway on her skateboard.  Over the course of a year, the two girls become close, passionately involved best friends and, as high school starts, they begin to question whether their feelings toward one another are 'normal' and 'right', two things that Michelle desperately knows she needs to be in order to fit into their tiny, prying town.  As high school progresses, rumors of their relationship surface among the other students. Michelle throws their friendship - and everything else - to the wayside, shattering Alexis's heart in the process and forcing Michelle to realize that no matter how much she tries to control her actions, she still can't control her feelings.  Ten years after high school and Michelle is at the brink of stardom. Having just finished her first international tour, a guilty conscience forces the twenty-seven year old singer to return to Florida after her mother is involved in a bad car accident. Disillusioned with the direction of her career, she leaves her cautious, nit-picky agent and action movie star boyfriend - who is harboring a deep secret of his own that could ruin his image and career if it were to go public - to return home, tend to her mother and be back in Hollywood just in time to accompany Tyler to the premiere of his newest summer blockbuster. What on Earth could go wrong?  What nobody, not even Michelle, counts on is crossing paths with Alexis Vlodosky again. Alexis is eager to move on after finishing her residency at the hospital as the harsh memories of high school have soured her taste of this small town. After one night, they quickly realize that the fire is still burning deep within each of them. Michelle has to make a decision, but when faced with scores of paparazzi, an alcoholic mother desperate to make amends before her own secret is revealed, run-ins with unsavory past acquaintances, gossipy nurses, a neurotic agent and a fake boyfriend that needs Michelle for his image just as much as she needs him for hers, who will run first?",
  "genres": [
    "Lesbian",
    "Romance",
    "Young Adult"
  ],
  "author": "Ashley  Quinn",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/16069677-all-that-glitters"
}