{
  "title": "Ancient Wine: The Search for the Origins of Viniculture",
  "description": "The history of civilization is, in many ways, the history of wine. This book is the first comprehensive and up-to-date account of the earliest stages of vinicultural history and prehistory, which extends back into the Neolithic period and beyond. Elegantly written and richly illustrated, Ancient Wine opens up whole new chapters in the fascinating story of wine and the vine by drawing upon recent archaeological discoveries, molecular and DNA sleuthing, and the texts and art of long-forgotten peoples.Patrick McGovern takes us on a personal odyssey back to the beginnings of this consequential beverage when early hominids probably enjoyed a wild grape wine. We follow the course of human ingenuity in domesticating the Eurasian vine and learning how to make and preserve wine some 7,000 years ago. Early winemakers must have marveled at the seemingly miraculous process of fermentation. From success to success, viniculture stretched out its tentacles and entwined itself with one culture after another (whether Egyptian, Iranian, Israelite, or Greek) and laid the foundation for civilization itself. As medicine, social lubricant, mind-altering substance, and highly valued commodity, wine became the focus of religious cults, pharmacopoeias, cuisines, economies, and society. As an evocative symbol of blood, it was used in temple ceremonies and occupies the heart of the Eucharist. Kings celebrated their victories with wine and made certain that they had plenty for the afterlife. (Among the colorful examples in the book is McGovern's famous chemical reconstruction of the funerary feast--and mixed beverage--of \"King Midas.\") Some peoples truly became \"wine cultures.?When we sip a glass of wine today, we recapitulate this dynamic history in which a single grape species was harnessed to yield an almost infinite range of tastes and bouquets. Ancient Wine is a book that wine lovers and archaeological sleuths alike will raise their glasses to.",
  "genres": [
    "Wine",
    "History",
    "Food",
    "Nonfiction",
    "Food and Drink",
    "Science",
    "Anthropology"
  ],
  "author": "Patrick E. McGovern",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/1063323.Ancient_Wine"
}