{
  "title": "Lily Steps Out",
  "description": "Empty nest, retired husband ... after thirty-three years of marriage as wife, mother, nursemaid, and family mediator, Lily Gold has had it! There must be more to life than making beds and cooking dinners. A lot more, she discovers, when she decides she needs something of her very own – a job.Re-entering the work force is harder than it seems, and Lily has difficulty finding a position that’s just right for her. When she finally does, she knows it’s a perfect fit. But husband Leon wants no part of it, and off he goes to the bank to put the kibosh on her chance of opening her own antique center.This is marriage? This is war! Lily steps out of the tired old habit of always letting Leon have his way. This time she turns the status quo into quid pro quo and gives him a run for the money. And, while she’s at it, with a little help from her friends, she breaks the mold of Lily Gold. But does she have what it takes to create a new Lily – a Lily’s renaissance?Lily Gold’s journey is the journey of every woman who wants it all – love, respect, personal fulfillment, and real happiness.“...engagingly written. The voice is shrewd, sharp, funny, and yet tender.”–Joyce Carol Oates“Charming and carefully observed, LILY STEPS OUT is a First Wives Club for the new millennium. LILY will win your heart as she ‘comes of age.’ A great read!”–Kevin Misher, producer of Public Enemies“...the writing is lively and true to life.”–Francine Klagsbrun, columnist and author of Married People: Staying Together in the Age of Divorce“With wit and wisdom, Rita Plush proves F. Scott Fitzgerald wrong – there can be second acts in American lives.”–Charles Salzberg, author of Swann’s Last Song“It’s refreshing to read a novel about people whose desires and disappointments are so like our own.”–Phil Wagner, editor/publisher, The Iconoclast",
  "genres": [],
  "author": "Rita Plush",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/16069712-lily-steps-out"
}