{
  "title": "Storybook Travels: From Eloise's New York to Harry Potter's London, Visits to 30 of the Best-Loved Landmarks in Children's Literature",
  "description": "In their imaginations, children travel the world when they read such books as Madeline, A Bear Called Paddington, The Adventures of Tom Sawyer, and Little House on the Prairie. Make these imaginary journeys a reality for your children with visits to the actual settings of these and dozens more of the best-loved tales in children’s literature. Storybook Travels is the ultimate guide for book-loving parents in search of vacations the whole family will enjoy. Let Storybook Travels be your family’s companion on unforgettable excursions, including:A magical walk through London looking for the mysterious spots young Harry frequents in Harry Potter and the Sorcerer’s Stone A fun-filled visit to the Plaza Hotel in New York City, reliving the charmed existence of Eloise A busy day in the tiny Tuscan village of Collodi, watching a puppet show, exploring a hedge maze, and enjoying other activities in homage to The Adventures of Pinocchio A scenic trek following the same trail created by Brighty the Burro, a real-life hero whose story is told in Brighty of the Grand Canyon A wonderful sojourn in Paris and surrounding areas, visiting museums, eating at typical French cafés, and spotting the famous water lilies at Monet’s home in Giverny, all celebrated in Linnea in Monet’s Garden An afternoon of barbecue and music at the Chicago Blues Festival, in the imaginary company of Yolonda and her harmonica-playing little brother, the stars of Yolonda’s GeniusWith itineraries for more than thirty locales in North America and Europe, Storybook Travels explores destinations near and far, rural and urban. Whether you want to plan a trip that will mean as much to you as it will to your children (or grandchildren), are looking for ways to enrich already-planned trips, or want to bring to life the fondly remembered books of your own childhood, Storybook Travels is your guide to one enchanting journey after another.",
  "genres": [
    "Travel",
    "Nonfiction",
    "Books About Books",
    "Childrens",
    "Family",
    "Reference"
  ],
  "author": "Colleen Dunn Bates",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/1063333.Storybook_Travels"
}