{
  "title": "The Company",
  "description": "With a sharp eye for the pathos and absurdity of the Cold War, Robert Littell crafted his first novel, the now legendary spy thriller The Defection of A.J. Lewinter. Christopher Lehmann-Haupt of The New York Times called it \"a perfect little gem, the best Cold War thriller I've read in years,\" and the praise kept coming with critics hailing Littell as \"the American Le Carré\" (New York Times) and raving that his books were \"as good as thriller writing gets\" (The Washington Post).For his fourteenth novel, Robert Littell creates an engrossing, multigenerational, wickedly nostalgic yet utterly candid saga, bringing to life through a host of characters-historical and imagined-the over 40 years of the CIA-\"the Company\" to insiders. At the heart of the novel is a stunningly conceived mole hunt involving such rivals and allies as the MI6, KGB, and Mossad.Racing across a canvas that spans the legendary Berlin Base in the 1950s-the front line of the simmering Cold War-to the Soviet invasion of Hungary, the Bay of Pigs, the Afghan war, the Gorbachev putsch, and other major theatres of operation for the CIA, The Company tells a thrilling story of agents imprisoned in double lives, fighting an enemy that was amoral, elusive, formidable.Littell tells it like it CIA agents, fighting not only the good fight, but sometimes the bad one as well. Littell also brilliantly lays bare the warring within the Company to add another dimension to the spy vs. spy the battles between the counterintelligence agents in Washington, like the utterly obsessive real-life mole hunter James Angleton, and the covert action boys in the field, like The Company's Harvey Torriti-the Sorcerer-a brilliant and brash rule breaker and dirty tricks expert who fights fire with fire, and his Apprentice, Jack McAuliffe, recruited fresh out of Yale, who learns tradecraft and the hard truths of life in the field.As this dazzling anatomy of the CIA unfolds, nothing less than the world's future in the second half of the twentieth century is at stake. At once a celebration of a long Cold War well fought, an elegy for the end of an era, and a reckoning for a profession in which moral ambiguity created a wilderness of mirrors, The Company is the Cold War's devastating truth, its entertaining tale, its last word.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Espionage",
    "Thriller",
    "Audiobook",
    "Mystery",
    "Mystery Thriller"
  ],
  "author": "Robert Littell",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/16070379-the-company"
}