{
  "title": "Spellcasters",
  "description": "OMNIBUSWitches, Cabals, and Supernaturals...oh my! Paranormal superstar and internationally bestselling author Kelley Armstrong's second Otherworld omnibus includes Dime Store Magic and Industrial Magic, along with two short stories, Wedding Bell Hell & Case of the Half-Demon Spy. DIME STORE MAGIC: Paige Winterbourne was always either too young or too rebellious to succeed her mother as leader of one of the world's most powerful elite organizations--the American Coven of Witches. Now that she is twenty-three and her mother is dead, the Elders can no longer deny her. But even Paige's wildest antics can't hold a candle to those of her new charge--an orphan who is all too willing to use her budding powers for evil...and evil is all too willing to claim her. It's an initiation into adulthood, womanhood, and the brutal side of magic that Paige will have to do everything within her power to make sure they both survive. INDUSTRIAL MAGIC: Paige broke with the elite, ultraconservative American Coven of Witches and her goal is to start a new Coven for a new generation. But while she pitches her vision to uptight thirty-something witches in business suits, a more urgent matter commands her attention: someone is murdering the teenage offspring of the underworld's most influential Cabals--a circle of families that makes the mob look like amateurs. WEDDING BELL HELL: This story picks up three weeks before Paige and Lucas get married--and if you thought planning a wedding was complicated as a mere human, imagine being a witch marrying a sorcerer. CASE OF THE HALF-DEMON SPY: This story takes place when Paige and Adam were still in their early teens. Bored after being told to wait outside at a Council Meeting, they try to pass the time eavesdropping...until a stranger turns up, turns out to be an Exaudio demon, and things get really serious.",
  "genres": [
    "Fantasy",
    "Paranormal",
    "Romance",
    "Urban Fantasy",
    "Paranormal Romance",
    "Supernatural",
    "Werewolves"
  ],
  "author": "Kelley Armstrong",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/16071754-spellcasters"
}