{
  "title": "Confessions of a Fairy's Daughter: Growing Up with a Gay Dad",
  "description": "A moving memoir about growing up with a gay father in the 1980s, and a tribute to the power of truth, humour, acceptance and familial love. Alison Wearing led a largely carefree childhood until she learned, at the age of 12, that her family was a little more complex than she had realized. Sure her father had always been unusual compared to the other dads in the neighbourhood he loved to bake croissants, wear silk pyjamas around the house, and skip down the street singing songs from Gilbert and Sullivan operettas. But when he came out of the closet in the 1970s, when homosexuality was still a cardinal taboo, it was a shock to everyone in the quiet community of Peterborough, Ontario, especially to his wife and three children.Alison's father was a professor of political science and amateur choral conductor, her mother was an accomplished pianist and marathon runner, and together they had fed the family a steady diet of arts, adventures, mishaps, normal frustrations, and inexhaustible laughter. Yet despite these agreeable circumstances, Joe's internal life was haunted by conflicting desires. As he began to explore and understand the truth about himself, he became determined to find a way to live both as a gay man and also a devoted father, something almost unheard of at the time.Through extraordinary excerpts from his own letters and journals from the years of his coming out, we read of Joe's private struggle to make sense and beauty of his life, to take inspiration from an evolving society and become part of the vanguard of the gay revolution in Canada. Confessions of a Fairy's Daughter is also the story of coming out as the daughter of a gay father. Already wrestling with an adolescent's search for identity when her father came out of the closet, Alison promptly went in, concealing his sexual orientation from her friends and spinning extravagant stories about all of the great straight things they did together.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Canada",
    "LGBT",
    "Biography",
    "Gay",
    "Autobiography"
  ],
  "author": "Alison Wearing",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/16071752-confessions-of-a-fairy-s-daughter"
}