{
  "title": "Wrapped in the Flag: A Personal History of America's Radical Right",
  "description": "A narrative history of the John Birch Society by a daughter of one of the infamous ultraconservative organization’s founding fathers .Named a best nonfiction book of 2013 by Kirkus Reviews and the Tampa Bay Times Long before the rise of the Tea Party movement and the prominence of today’s religious Right, the John Birch Society, first established in 1958, championed many of the same radical causes touted by ultraconservatives today, including campaigns against abortion rights, gay rights, gun control, labor unions, environmental protections, immigrant rights, social and welfare programs, the United Nations, and even water fluoridation.Worshipping its anti-Communist hero Joe McCarthy, the Birch Society is perhaps most notorious for its red-baiting and for accusing top politicians, including President Dwight Eisenhower, of being Communist sympathizers. It also labeled John F. Kennedy a traitor and actively worked to unseat him. The Birch Society boasted a number of notable members, including Fred Koch, father of Charles and David Koch, who are using their father’s billions to bankroll fundamentalist and right-wing movements today.The daughter of one of the society’s first members and a national spokesman about the society, Claire Conner grew up surrounded by dedicated Birchers and was expected to abide by and espouse Birch ideals. When her parents forced her to join the society at age thirteen, she became its youngest member of the society. From an even younger age though, Conner was pressed into service for the cause her father and mother gave their lives the nurturing and growth of the JBS. She was expected to bring home her textbooks for close examination (her mother found traces of Communist influence even in the Catholic school curriculum), to write letters against “socialized medicine” after school, to attend her father’s fiery speeches against the United Nations, or babysit her siblings while her parents held meetings in the living room to recruit members to fight the war on Christmas or (potentially poisonous) water fluoridation. Conner was “on deck” to lend a hand when JBS notables visited, including founder Robert Welch, notorious Holocaust denier Revilo Oliver, and white supremacist Thomas Stockheimer. Even when she was old enough to quit in disgust over the actions of those men, Conner found herself sucked into campaigns against abortion rights and for ultraconservative presidential candidates like John Schmitz. It took momentous changes in her own life for Conner to finally free herself of the legacy of the John Birch Society in which she was raised.In Wrapped in the Flag , Claire Conner offers an intimate account of the society —based on JBS records and documents, on her parents’ files and personal writing, on historical archives and contemporary accounts, and on firsthand knowledge—giving us an inside look at one of the most radical right-wing movements in US history and its lasting effects on our political discourse today.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Memoir",
    "Biography",
    "Religion",
    "Social Justice"
  ],
  "author": "Claire Conner",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/16071820-wrapped-in-the-flag"
}