{
  "title": "Christmas Stories: Heartwarming Classics of Angels, a Manger, and the Birth of Hope",
  "description": "Experience the true meaning of Christmas with beloved storyteller Max Lucado. “ The Christmas Candle shines with a radiant insight. Written with Max Lucado’s signature style of sincerity and spiritual perception, this story will warm the reader’s heart with the wonders of God’s love and mercy.” — In the Library Reviews Heartwarming Classics of Angels, a Manger, and the Birth of Hope. These stories—like your favorite Christmas ornaments—come in all shapes and sizes. They unfold in a variety of settings, from ancient Bethlehem to rural England. From a small Texas town to the heavenly realms. Some are short. Others many chapters long. Some offer reflections. Others imagine Christmas through the eyes of a burnt-out candle maker, a lonely business man, or heavenly angels. Yet all are vintage Lucado, and all resonate with the wonder of the season. \"In the mystery of Christmas,\" Max writes, \"we find its majesty. The mystery of how God became flesh, why he chose to come, and how much he must love his people. Such mysteries can never be solved, just as love can never be diagrammed. Christmas is best pondered, not with logic, but imagination.\" That's what each of these unique Christmas stories help us do. In the midst of the bustle and hurry that often distracts us this time of year, these stories free us to explore the ways in which Christ's coming has forever changed history—and us. “A powerful reminder of the true meaning of faith and community, The Christmas Candle is a welcome respite from the harried commercialism of the holiday season.” — BookPage “Fans of Charles Dickens and Jan Karon, you’re in for treat! Max Lucado has penned a wholly original Christmas story complete with cobblestone streets, quirky characters, and a supernatural visit you’ll never forget.” —John C. Maxwell, New York Times bestselling author on The Christmas Candle",
  "genres": [
    "Christmas",
    "Christian",
    "Christian Fiction",
    "Fiction",
    "Christian Living",
    "Holiday",
    "Short Stories"
  ],
  "author": "Max Lucado",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/10634264-christmas-stories"
}