{
  "title": "What You Want Is in the Limo: On the Road with Led Zeppelin, Alice Cooper, and the Who in 1973, the Year the Sixties Died and the Modern Rock Star Was Born",
  "description": "An epic joyride through three history-making tours in 1973 that defined rock and roll superstardom—the money, the access, the excess—forevermore.  The Who’s Quadrophenia. Led Zeppelin’s Houses of the Holy. Alice Cooper’s Billion Dollar Babies. These three unprecedented tours—and the albums that inspired them—were the most ambitious of these artists’ careers, and they forever changed the landscape of rock and roll: the economics, the privileges, and the very essence of the concert experience. On these juggernauts, rock gods—and their entourages—were born, along with unimaginable overindulgence and the legendary flameouts. Tour buses were traded for private jets, arenas replaced theaters, and performances transmogrified into over-the-top, operatic spectacles. As the sixties ended and the seventies began, an altogether more cynical era took hold: peace, love, and understanding gave way to sex, drugs, and rock and roll.    But the decade didn’t become the seventies, acclaimed journalist Michael Walker writes, until 1973, a historic and mind-bogglingly prolific year for rock and roll that saw the release of countless classic albums, from The Dark Side of the Moon to Goat’s Head Soup; Goodbye Yellow Brick Road; Greetings from Asbury Park, N.J.; and The Wild, the Innocent & the E Street Shuffle. Aerosmith, Queen, and Lynyrd Skynyrd released their debut albums. The Roxy and CBGB opened their doors. Every major act of the era—from Fleetwood Mac to Black Sabbath—was on the road that summer, but of them all, Walker writes, it was The Who, Led Zeppelin, and Alice Cooper who emerged as the game changers.    Walker revisits each of these three tours in memorable, all-access detail: he goes backstage, onto the jets, and into the limos, where every conceivable wish could be granted. He wedges himself into the sweaty throng of teenage fans (Walker himself was one of them) who suddenly were an economic force to be reckoned with, and he vividly describes how a decade’s worth of decadence was squeezed into twelve heart-pounding, backbreaking, and rule-defying months that redefined, for our modern times, the business of superstardom.",
  "genres": [
    "Music",
    "Nonfiction",
    "History",
    "Pop Culture",
    "Rock N Roll",
    "Cultural",
    "Biography"
  ],
  "author": "Michael  Walker",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/16071829-what-you-want-is-in-the-limo"
}