{
  "title": "Trail of Crumbs: Hunger, Love, and the Search for Home: a memoir",
  "description": "Already hailed as \"brave, emotional, and gorgeously written\" by Frances Mayes and \"like a piece of dark chocolate--bittersweet, satisfying, and finished all too soon\" by Laura Fraser, author of An Italian Affair, this is a unique memoir about the search for identity through love, hunger, and food.Jim Harrison says, \"TRAIL OF CRUMBS reminds me of what heavily costumed and concealed waifs we all are. Kim Sunée tells us so much about the French that I never learned in 25 trips to \n  Paris\n, but mostly about the terrors and pleasure of that infinite octopus, love. A fine book.\"Kim Sunée was three years old when her mother took her to a crowded marketplace and left her on a bench with a fistful of food. Three terrifying days and nights later a policeman discovered Kim, who was clutching what was now only a fistful of crumbs.Nearly twenty years later, Kim's life is unrecognizable. Adopted by a family in New Orleans, she grew up as one of only two Asian children in her community. At the age of twenty-two, she becomes involved with a famous French businessman, and finds herself living in France, mistress over his houses in Provence and Paris, and stepmother to his eight year-old daughter.But despite this glamorous lifestyle, Kim never really feels at home. Trail of Crumbs follows Kim as she cooks her way into many makeshift homes and discovers that familiar flavors are the antidote to a lifetime of wandering. Ultimately, it is in food and cooking that Kim finds solace and a sense of place.Sensuous, intense, and intimate, this powerful memoir will appeal to anyone who is passionate about love, food, travel, or the ultimate search for self.",
  "genres": [
    "Memoir",
    "Food",
    "Nonfiction",
    "France",
    "Travel",
    "Biography",
    "Adoption"
  ],
  "author": "Kim Sunée",
  "average_rating": "3.26",
  "url": "https://www.goodreads.com/book/show/1607272.Trail_of_Crumbs"
}