{
  "title": "Himmelstiefe",
  "description": "Kühle Morgenluft und ein rosa verfärbter Himmel über Berlin. Als Kira (17) an diesem Morgen aufsteht, um den ersten Tag des letzten Schuljahres anzugehen und ausrechnet, dass sie jetzt nur noch 250 Schultage von der Freiheit trennen, endlich achtzehn zu sein und bei ihren Eltern auszuziehen, ahnt sie nicht, wie sehr ihre gewohnte Welt bald Kopf stehen wird.Zuerst trifft sie die Liebe zu dem neuen Schüler Tim wie ein Blitzschlag. Gleichzeitig überfallen sie fiebrig-aggressive Schübe und seltsame Wahrnehmungsstörungen. Was ist nur los? Will sie ihre Verknalltheit in Tim den Mädchenschwarm nicht wahrhaben, oder dreht sie durch? Nichts dergleichen trifft zu. Die Symptome sind erste Anzeichen dafür, dass Kira besondere Fähigkeiten für eins der Elemente Erde, Feuer, Wasser, Luft und Äther ausbildet. Seltsame Schatten beginnen sie zu verfolgen. Im letzten Moment gelingt ihr die Flucht aus einer psychiatrischen Anstalt, in die ihre Eltern sie gesteckt haben, und sie findet mit Hilfe ihrer Chatfreundin Atropa den Weg in die magische Welt an die Akademie der Elemente, wo sie Leute ihresgleichen trifft, die in ihrem jeweiligen Element ausgebildet werden. Doch Kira fühlt sich zwischen den Welten. Sie will zurück zu Tim, aber das ist unmöglich, bevor sie nicht gelernt hat, mit ihren erwachenden Kräften umzugehen. Gleichzeitig ist da Leo, Element Feuer, zu dem sie sich „magisch“ hingezogen fühlt.Atropa, Kiras Eltern, ihr Mentor Jerome, ihre Engelfreundin Neve oder der seltsame Pio - alle hüten sie Geheimnisse, die Kiras bisherige Identität völlig aus den Angeln heben. Doch nicht nur das: Kira ist auch an der Akademie der Elemente außergewöhnlich. Nach und nach entdeckt sie, dass sie nicht nur besondere Fähigkeiten besitzt, um ein Element zu beherrschen, sondern Talente in mehreren Elementen entwickelt. Das bedeutet sehr große Macht. Ein Geheimbund, der nicht nur die magische Welt bedroht, sondern auch die reale Welt, will sie mit allen Mitteln auf seine Seite ziehen. Die dringendsten Fragen, die sich Kira immer wieder stellen, sind: Wem kann sie vertrauen? Wer gehört zu ihren wahren Freunden? Was ist ihre Bestimmung? Und wen liebt sie wirklich, Leo oder Tim?",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Romance",
    "Urban Fantasy",
    "Magic",
    "German Literature",
    "Romantasy"
  ],
  "author": "Daphne Unruh",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/16073473-himmelstiefe"
}