{
  "title": "Sunfall Manor",
  "description": "Edgar is a ghost cursed to spend his nights at Sunfall Manor, an apartment complex that was once a farmhouse in the flatlands of Nebraska. Every night he must move through five different dwellings, haunted by the living--a drunken and paranoid writer, an abused housewife, a colder-than-ice web-mistress, a two-bit drug dealer, and a crazy old man who plays with puppets--trying to unlock the secrets of who he is. But tonight is different. The lost souls of Sunfall Manor are ready to give up the ghost, and the past is ready to open its cold, unforgiving arms.“Sunfall Manor is a gem of a story that reminds me of Sherwood Anderson’s Winesburg, Ohio ... vignettes of lives lived and lost with touches of sadness, regret, and vengeance. A tale sure to send more than a few shivers up your spine ... and your soul.”-Rick Hautala, author of Indian Summer and Little Brothers“Any horror fan who’s properly awake has been following the crazily productive visionary exactitude of Peter Giglio. He slings plainsong toughness pressurized by pop-eyed mania. Sunfall Manor’s not his debut, though it’s his debut masterpiece: A cold-trance-inducing, five-click merry-go-round about a rundown dwelling in the flatlands that feels more like a schizoid colony in outer space. This thing should be a major film, though we'll have to wake up Kubrick to do it right. A work of art that you’ll be judged for missing.”-Eric Shapiro, author of The Devoted and It’s Only Temporary“A lesser thinker might have been content with a haunted house story. A lesser storyteller might have been content with a tale of discovery, or perhaps of ghostly revenge. But Peter Giglio has more up his sleeve than ghosts and creepy old houses. He’s even got more than mere philosophy.”-Bram Stoker Award-winning author Joe McKinney,from his introduction“Let Peter Giglio’s odd protagonist, Edgar, take you on a surreal tour of the mysterious Sunfall Manor with its intriguing but flawed residents. Giglio’s prose is highly accessible and very engaging, his story line equally compelling. This is Giglio playing at the top of his game, shooting and making all 3s. Highly recommended.”-Gene O'Neill, author of The Burden of Indigo and Operation Rhinoceros Hornbill“Peter Giglio’s Sunfall Manor is a gripping ghost story that will possess your mind like a crazed poltergeist. Psychological horror at its best.” -Jeremy C. Shipp, Bram Stoker nominated author of Vacation and Cursed“A powerful, moving, intimate look into private lives we would rather deny, but all have lived, in one way or another. Giglio’s writing is clear, insightful, and fueled with a potent and intoxicating intimacy. To read Sunfall Manor is to take a poetic journey through truths, falsehoods, hopes, dreams and failures that comprise the human condition. And it’s truly haunting.” -Trent Zelazny, author of Butterfly Potion“Haunting and unforgettable, Sunfall Manor is Mr. Giglio’s finest work to date. Period! This vivid and revealing shocker begs to be made into a movie and further cements him as the rising star that he is.”-David Bernstein, author of Amongst the Dead and Tears of No Return“Sunfall Manor is as much a character study of lost and damaged souls as it is a horror story. Giglio is an excellent writer who is not afraid to show the bleak human condition at its ugliest. Well done!”-Tracy L. Carbone, co-chair of New England Horror Writers, author of The Soul Collector, and Bram Stoker nominated editor of Epitaphs.\"In Sunfall Manor, Peter Giglio reinvents the ghost story. Life and afterlife are examined through the eyes of a dead man, and it's like looking through a dust-filled kaleidoscope. Raw human emotion and exploration of the human condition in the rural midwest are Giglio's specialty. This story will stay with you long after you close the book. Very highly recommended.\"-S. S. Michaels, author of Revival House and Idols & Cons",
  "genres": [
    "Horror",
    "Paranormal",
    "Ghosts",
    "Ghost Stories"
  ],
  "author": "Peter Giglio",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/16073802-sunfall-manor"
}