{
  "title": "Venture: A Collection of True Microfinance Stories",
  "description": "Venture is a rich and readable collection of true microfinance stories. It is written for anyone who would like to better understand the realities faced by the the aspiring middle class in the world's least developed countries, the range of factors that affect their prospects for working their way out of poverty, and how microfinance can impact their lives.The entrepreneurs featured in this book are all members of Zidisha Microfinance, a web-based crowdfunding platform that allows low-income, computer-savvy entrepreneurs in developing countries to share their stories and negotiate microloans directly with individual lenders. As the world's first person-to-person lending service to eliminate intermediaries and connect individual web users and entrepreneurs across the international wealth divide, Zidisha is uniquely positioned to offer an undistorted depiction of the variety of individual stories and circumstances that come to play each time a microfinance loan is disbursed.Each story paints an unforgettable picture: A seventy-year-old goat farmer who relocates his home to better care for his ailing father, carrying the sticks and metal sheeting it was made from across the mountains on his back. A plump, beaming detergent saleslady who lives in a home no larger than an ordinary bathroom but has adopted five orphans. A cancer survivor who supports herself and two children by pounding millet for $1.58 per day. An irrepressible lady who supplies half of her neighborhood with much-needed IVs and other medical supplies by day, and by night checks into the local cybercafe to chat with Facebook friends on the other side of the world. A young man who has no arms but insists on working to support his able-bodied parents out of filial duty. An accounting student who pays for his university tuition by purchasing a taxi and splitting proceeds with a hired driver. A bright young lady who renounces college to care for her orphaned siblings and overcomes gender stereotypes to launch a thriving construction business.At its heart, Venture is a tribute to the remarkable community of Zidisha Microfinance entrepreneurs and countless others like them - a tribute to their grit, ambition and indomitable spirit in the face of overwhelming obstacles. We hope this book will help translate the statistics about poverty and the opportunities afforded by microfinance into human terms, and inspire readers to reach out and connect with their counterparts on the other side of the international wealth divide.",
  "genres": [
    "Finance"
  ],
  "author": "Julia Kurnia",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/16074156-venture"
}