{
  "title": "A Little Hair of the Dog",
  "description": "Ann Bixby was born and raised as an only child in a small village on the banks of the Erie Canal. When she was 15 years old, the unthinkable happened. Her mother died. Having been raised a devout Mormon, she knew that she and her father would see her mother again-because they know that families are meant to be together forever. After a year of unspeakable loneliness, however, her father decides that living in that town without his beloved wife was more than he could bear. He takes his teen aged daughter and goes to live in Eastern Oregon, where he had a sister. And so they moved to an even smaller town than the one they left. Ann thought it was at least \"a thousand miles from anywhere\". After she had graduated high school, she thought briefly of going off to college, but quickly dismissed the idea of leaving her lonely father even more alone. They lived there for more than ten years. After the sudden death of her father, she moves back home. Her best friend, who was more like a sister growing up, is Kell Harris. Kell and her family still live back in Charlestown, NY. The Harris family are an African American-Caucasion family and are also LDS. They are like a second set of parents to the tall, quirky, unpretentious Ann. During the process of looking for a place to live, Ann comes across a fellow orphan. She knows immediately that taking him in is the right thing to do. His name is Henry. He is two years old. He weighs 180 pounds. He is a Great Dane. She has never had a dog. She has never had so much as a hamster in her life. But doing the right thing comes naturally to her and she knows that he needs her. A dog that big needs a lot of walking, and she spends much of her time doing just that. Thanks to these walks, she meets people she never would have met, people that become as dear and dearer than anyone she has ever had in her life. Ann buys a house, and one day while out walking, she meets, unbeknownst to her, the town hermit. He doesn't look like a hermit to her. To her, he looks like a male cover model. That's how he looks to everyone else, too, but he isn't aware of it and wouldn't care anyway. His name is Kyle Mendez and he has had enough of people. He is corrosive, off-putting, large and intimidating. He tells her, \"I stay away from people. I don't know what they think. I don't care what they think. I don't ask them what they think and they don't tell me what they think.\" Ann is the first person in a long time who will look him straight in the eye and tell him exactly what she thinks. He knew the first time he saw her, she was different. She didn't know he was a hermit and she wasn't about to let him be one. She begins slowly drawing him out and he can't help but go with her. The story of his past peels back like the layers of an onion, and brings as many tears. Slowly she shows him how to forgive, how to love, and how to live again. She also introduces him to something he never would have predicted would interest him-the Mormon Church. She gives him the gift of something he had long forgotten-joy.",
  "genres": [
    "Romance",
    "Lds",
    "Contemporary"
  ],
  "author": "Jane McBride",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/16075364-a-little-hair-of-the-dog"
}