{
  "title": "Sea Wenches: Book 1",
  "description": "Series Title: Sea Wenches (3 novels)Author: Elle CaseyGenre: YA Fantasy/ParanormalThe year is 1717. Queen Ann's War has been fought and won by some, lost by others. Merchants and privateers run the seas, while pirates - the scourge of all who venture to sail - prowl the open waters for those who do not guard their ships as they should - with goodly care and an abundance of gunpowder.Cassandra. Eeking out a living near the docks as a scullery maid by day and a fiddling troubadour by night, she does whatever it takes to survive. She's sixteen, and for as long as she can remember, without a home, family, or future.Tatiana. She's known as the Ace of Hearts, even to the men who lose to her at the card table. Regardless of the game - Maw, One and Thirty, Bone Ace, Ruff and Honours - this eighteen-year-old nearly always wins, and she takes no prisoners while doing it. It's a dog-eat-dog world near the harbor, and she's determined to avoid an untimely end like her sister before her.Ruby. Give her a farthing and she'll read your palm, telling you what you want to know about your future. Perhaps she'll even share the whisperings of those spirits who may have secrets to reveal before you set sail. Mariners are a superstitious lot, and missing a stopover at Ruby's street corner before departing could be disastrous, or so they believe.A shipmaster is seeking crew members for his merchant vessel. Word spreads over the docks like wildfire. The pay is beyond anything that people from this place have ever known. Just one voyage could change a life forever. The risks are great, but the alternative could be worse.What they don't know is that the sea this ship will sail is a temperamental beast, deep and dark, calm and sparkling one moment, raging and exploding with the sound of a thousand crashing waves the next. And the mysterious inhabitants who live amongst those waves are always watching the land dwellers who share their home. Always.",
  "genres": [
    "Fantasy",
    "Young Adult"
  ],
  "author": "Elle Casey",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/16075199-sea-wenches"
}