{
  "title": "The Warning",
  "description": "The Warning (Sarah Roberts Book Two) Sarah Roberts has spent the last four years helping people stay alive and escape near-death experiences as messages from the dead come to her. She receives a daunting communication from the Other Side regarding her sister's murderer and where she can find him. The message isn't clear enough to confirm the man's identity, causing suspicion.When she receives The Warning, Sarah decides to disregard it. Then the tables turn, and now Sarah's being hunted instead of being the hunter. How many people have to die to catch one murderer? How far will Sarah go while talking to the dead to help the living?Here's what readers are saying about the Sarah Roberts ★★★★★ - “This is a great series! I love it, and you should definitely read it! Each Sarah Roberts story gets more intriguing and more intense! I feel as if I know all the main characters personally, and I can’t wait for the next thriller! Keep writing, Jonas Saul! Your fans await!”★★★★★ - “Jonas Saul is one of the most talented writers of our time.”★★★★★ - “First book I read by Jonas Saul. One of the best books I have ever read.”★★★★★ - “Amazing! I've been looking forward to starting this series for a while, and let me tell you, it does not disappoint! Absolutely filled to the brim with action, suspense, and thrills.”★★★★★ - “These books are an action-packed adrenaline rush that left me hungry for more! With each twist and turn, I got more invested in Sarah and her family, and I felt their struggles and pain! The series combines my two favorite things for a story - a great, heart-thumping journey and characters I can connect with emotionally. Sarah Roberts is the perfect strong, yet vulnerable, heroine for men and women everywhere to admire!”★★★★★ - “I love Jonas Saul - my new favorite author.”★★★★★ - “I am an avid reader of Stephen King and Dean Koontz, and Jonas Saul won me over with this book.”★★★★★ - “To me, this is the best series I have ever read.”★★★★★ - “Love the series. Can’t wait till another comes out. Jonas Saul is a great storyteller. Send more!”★★★★★ - “The way the Sarah Roberts character grows and evolves is superb. Jonas Saul is one of the best contemporary writers alive today.”★★★★★ - “I haven't read a book by Jonas Saul I haven't loved! Highly, highly, highly recommend!”★★★★★ - “This is one of the best mystery series ever written. Jonas Saul is amazing. I recommend the entire Sarah Roberts to any reader, whether you’re into mysteries or not.”",
  "genres": [
    "Mystery",
    "Paranormal",
    "Thriller",
    "Fiction",
    "Fantasy",
    "Amazon",
    "Horror"
  ],
  "author": "Jonas Saul",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/10635358-the-warning"
}