{
  "title": "Riverton Noir",
  "description": "Profound, profane and provocative, Riverton Noir is novel that might have been penned by Franz Kafka collaborating with Mickey Spillane and Phillip K. Dick. On one level it’s an action thriller; on another it poses basic existential questions on the nature of consciousness, madness, and the fabric of existence; on every level it’s a page-turner’s delight.When Mickey Black fixes the big Riverton-Haverhill basketball game by bribing Chucker Washington to shave just a few points, Mickey clears enough coin to persuade Mickey’s Haverhill associate, a leg-breaker named Danny Donnelly, to introduce Mickey to Aunt Sosha, the woman who controls the rackets in the Merrimack Valley. Seeing possibilities for OxyContin in Riverton, Aunt Sosha sends Mickey home to start the business, but Aunt Sosha and her friend, Avram, an interrogator once dismissed from the Mossad for excessive zeal, strictly as a matter of security hold Mickey’s buddy, Bughouse, hostage.Maybe it would have all worked out if Mickey hadn’t been traveling with Madge. Madge is obsessed with the idea that she and everyone else in Riverton may be unreal, and the girl may have a point. Her hymen grows back, no one in Riverton sickens or dies, and no one has substantial memories. Every day at Riverton High, the lessons are the same. She cuts herself to feel real, and her wounds heal overnight. Worst of all, Madge feels the Shadow on her far too often, an unseen power that resets reality, wipes memories clean, and robs Madge of life experience. Her memory lapses trouble her. So when Bughouse is terrified of the comic book he finds, something called Archie, though Madge won’t let on, she is concerned. What could be worse than being a minor character in someone else’s dream? What if someone else’s dream is her nightmare? Before Mickey can slide into his usual booth at Daddy Kane’s All-American Burger Shoppe and sell the first milligram of Oxy, on a moonless night outside the No-tel Motel Juice catches his old nemesis with his girl. Juice confuses Mickey’s head with a baseball, and since Juice is carrying a Louisville Slugger, he tries to hit a home-run. What else could Mickey do except reach for his Smith and Wesson .38?",
  "genres": [],
  "author": "Perry Glasser",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/16075870-riverton-noir"
}