{
  "title": "Walt Disney's Donald Duck: The Old Castle's Secret",
  "description": "With this volume, \"The Complete Carl Barks Disney Library\" loops back to Barks's earlier days, collecting the entirety of Barks's (astounding) 1948 output.The title story, \"The Old Castle's Secret,\" is notable not just for being the first full-length 32-page adventure instigated by Scrooge McDuck (in his second-ever appearance), but for featuring some of Barks's spookiest, lushest settings in old Clan McDuck castle of Dismal Downs. The other long story, \"The Sheriff of Bullet Valley,\" plunks Donald and the nephews in the Wild West, with Donald as an overconfident deputy having to deal with some high-tech rustlers. The book also includes the less-known \"In Darkest Africa,\" originally published in a giveaway and unreleased for decades.This volume also features an even 10 of Barks's dynamic \"Walt Disney’s Comics and Stories\" 10-pagers, including \"Wintertime Wager\" (the first appearance of a not-yet-lucky-but-still-obnoxious Gladstone Gander); \"Spoil the Rod\" (in which the exquisitely named educational professor Pulpheart Clabberhead is brought in to help tame the nephews); \"Rocket Race to the Moon\" (a rare full-on adventure — interplanetary, no less — in the short form); \"Gladstone Returns\" and \"Links Highjinks\" (two more Gladstone yarns); and five more stories... plus a half-dozen hilarious one-page gags.Of course, once again all the stories have been shot from crisp originals, then re-colored (and printed) to match, for the first time since their original release over 60 years ago, the colorful yet soft hues of the originals — and of course the book is rounded off with essays about Barks, the Ducks, and these specific stories by Barks experts from all over the world.",
  "genres": [
    "Comics",
    "Graphic Novels",
    "Humor",
    "Fiction",
    "Graphic Novels Comics",
    "Adventure",
    "Comic Book"
  ],
  "author": "Carl Barks",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/16077391-walt-disney-s-donald-duck"
}