{
  "title": "The Royal Sorceress",
  "description": "It’s 1830, in an alternate Britain where the ‘scientific’ principles of magic were discovered sixty years previously, allowing the British to win the American War of Independence. Although Britain is now supreme among the Great Powers, the gulf between rich and poor in the Empire has widened and unrest is growing every day. Master Thomas, the King’s Royal Sorcerer, is ageing and must find a successor to lead the Royal Sorcerers Corps. Most magicians can possess only one of the panoply of known magical powers, but Thomas needs to find a new Master of all the powers. There is only one candidate, one person who has displayed such a talent from an early age, but has been neither trained nor officially acknowledged. A perfect candidate to be Master Thomas’ apprentice in all ways but one: the Royal College of Sorcerers has never admitted a girl before. But even before Lady Gwendolyn Crichton can begin her training, London is plunged into chaos by a campaign of terrorist attacks co-ordinated by Jack, a powerful and rebellious magician.The Royal Sorceress will certainly appeal to all fans of steampunk, alternate history, and fantasy. As well as the fun of the ‘what-ifs’ delivered by the rewriting of our past, it delights with an Empire empowered by magic – all the better for being one we can recognise. The scheming and intrigue of Jack and his rebels, the roof-top chases and the thrilling battles of magic are played out against the dark and unforgiving backdrop of life in the sordid slums and dangerous factories of London. Many of the rebels are drawn from a seedy and grimy underworld, while their Establishment targets prey on the weak and defenceless. The price for destroying the social imbalance and sexual inequality that underpin society may be more than anyone can imagine.",
  "genres": [
    "Fantasy",
    "Alternate History",
    "Historical",
    "Magic",
    "Young Adult",
    "Urban Fantasy",
    "Steampunk"
  ],
  "author": "Christopher G. Nuttall",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/16077413-the-royal-sorceress"
}