{
  "title": "Coming Home",
  "description": "One man became her husband. The other became her best friend. Together, they were the holy trinity of rock and roll.  The year is 1974. Danny Fiore is a handsome, charismatic singer with huge ambitions and a voice that can peel the paper off the walls. Casey Bradley is just eighteen years old, but the songs she writes send an icy finger down the center of Danny's cynical spine. Danny knows exactly where he's going, and he has no intention of taking any woman along. A woman like Casey would want things he's not prepared to give. A home. Stability. Children. He's married to his music, and that's the way he likes it.  Casey is engaged to her childhood sweetheart, her wedding just four weeks away. She has Jesse, and Danny has his career. There's no room in her life or his for an extracurricular love affair. Besides, she's a good girl who doesn't believe in casual sex. But nothing between them could ever be casual, and the first time she looks into Danny Fiore's eyes, Casey is ready to toss away her entire future for a man who's almost certain to break her heart.  Neither of them plans on falling in love. But sometimes, the heart has a mind of its own.  Guitar wizard Rob MacKenzie doesn't have Danny's looks, or his charisma, or his sense of style. Tall and gaunt and bony, Rob isn't a god, just an ordinary mortal, an easygoing guy who wants nothing more than to write his songs, play his guitar, and find the right woman. But life is never quite as simple as it seems, and his search for Ms. Right keeps leading him down all the wrong roads.  When Rob MacKenzie and Casey Bradley Fiore begin writing songs together, the result is an unstoppable hit-making machine that catapults Danny Fiore to stardom. But the road to success is littered with land mines, and life with Danny isn't all that Casey expected. Rivers of darkness run through her troubled marriage, and every time Danny breaks her heart, it's Rob who picks her up, dusts her off, and glues the pieces back together.  It isn't until she suffers an unimaginable loss that Casey begins to question who she is and what she really wants from life. As she searches for herself amid the wreckage, she discovers the bittersweet truth that the choices a woman makes at thirty can differ vastly from those she made at eighteen.  Coming Home is a poignant story about the seasons of a woman's heart, and the roundabout route we sometimes have to take to get to where we're meant to be.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Chick Lit",
    "Music",
    "Fiction",
    "New Adult"
  ],
  "author": "Laurie Breton",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/16080213-coming-home"
}