{
  "title": "Beyond the Mayan Prophecy",
  "description": "***Featuring contributors such as: John Edward, Char Margolis, Sandy Anastasia,  Rick Levine, Glynis McCants, Mark Van Stone, Mary Jo McCabe,  Gahl Sasson, Dr. Alicia Tisdale, Maggie Kerr, Kala Ambrose, Mirabai Devi, Linda West, Derek O’Neill, Alan Oken , John Holland and Austyn Wells.***For the past forty years there have been a growing number of people who believe that nothing less than a cataclysmic change is coming in the evolution of Mankind.  From the dawning of the Age of Aquarius to cosmic forces—read Aliens—coming to engineer our DNA, to the doomsday scenarios triggered by the end of the Mayan calendar, there have been those who are sure that the world as we know it is coming to an end.  And soon.But that cataclysmic end has not (de)materialized, or has it? In 2012 new data was discovered in Guatemala that gives us concrete evidence of a new paradigm concerning the Mayans and their calendar.  We are now faced with the idea that perhaps we aren’t staring at Armageddon but stand in the middle of a 33-year transformative process. While the Mayans might have seen a change for humanity it isn’t an ending per se. And if there is change, why does that change need to imply destruction? Couldn’t it be an opportunity for mankind to assess their place in the universe and engage in a positive rebirth in a new era?Beyond The Mayan Prophecy posits that our modern day weakness or confusion can be attributed to a less spiritual way of thinking. Perhaps our left side brain thinking has held us back from discovering and accepting higher planetary secrets for centuries. To move forward with more balanced understanding, Paul Shavelson, a multi-media story teller and former Executive Producer of the hit psychic television show CROSSING OVER, has spent the last decade exploring the world of psychics and mystics.  Paul has assembled a “psychic dream team” to decode the past and to predict the future. With famed metaphysical experts such as Char Margolis, Rick Levine, Maggie Kerr, Alan Oken, and  Numerologist Glynis McCants, Paul covers everything from alien communication to instant collective thinking (The Collective Unconscious) being cultivated on the internet.  The dialogue and interviews will be discussed through sidebars by psychic medium, author, and TV personality, John Edward, who also provides the forward, and afterword of this provocative subject.With positive energy and a willingness to have us think outside the box (and a personal journey by the author that brings an unexpected and moving aspect to the experience), Beyond The Mayan Prophecy is an entertaining, thought provoking work that will let the reader embrace why the second half of this transition could be remarkable and inspiring.",
  "genres": [],
  "author": "Paul Shavelson",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/16080137-beyond-the-mayan-prophecy"
}