{
  "title": "Energy Vampires: How to Deal With Negative People",
  "description": "One of the best \"Vampire Books\" you will ever read!Especially if you are surrounded by negative thinking or negative people...After being around certain people do you ever find youself feeling: Emotionally exhausted Drained Tired or wanting to take a nap?If so, then this is a good book for you!Who exactly do energy vampires and negative people affect?Simple ... Everybody!So what is an energy vampire? You've probably heard the term \"energy vampires\" before, especially if you're at all interested in psychic ability or psychic development. But what exactly are energy vampires? They're not real vampires. Well, I guess they're real vampires, but not like the ones you see in Twilight ... \"Energy vampires\" feed upon your energy. In other words, their primary target is your spiritual body, not your physical body.\"Energy vampires\" are people who constantly draw upon other people's energy in order to help \"recharge\" their own system.So what do energy vampires and negative people have in common?They essentially do the same thing. They draw upon your energy, and they will have a very profound effect on your system, both spiritually and physically. Many times, they will wear you down to the point of exhaustion. However, unless you're aware of what is happening, you may not even notice the effects these people are having in your life, on a day-to-day basis.Empaths, this is the book for you!Empaths and sensitives are very susceptible to \"energy vampires\" more so than most other people. More and more people are discovering they are empaths in this new consciousness area. You may even be one and never knew it, until now. How do you find out if you are an empath? By reading this book!In The Book Find Out: *How to spot an \"energy vampire\" *How to protect yourself against negativity *What to do if you if you are surrounded by negative people *How to tell if you are an empath! *How to protect yourself if you are an empath *What effects \"energy vampires\" have on your spiritual and physical health *How to live in a world filled with \"energy vampires\" *And the very important...energy vampire first aid!",
  "genres": [
    "Self Help",
    "Nonfiction",
    "Spirituality",
    "New Age",
    "Amazon"
  ],
  "author": "Jennifer O'Neill",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/16081384-energy-vampires"
}