{
  "title": "Otherbound",
  "description": "Nolan doesn't see darkness when he closes his eyes. Instead, he’s transported into the mind of Amara, a girl living in a different world. Nolan’s life in his small Arizona town is full of history tests, family tension, and laundry; his parents think he has epilepsy, judging from his frequent blackouts. Amara’s world is full of magic and danger--she’s a mute servant girl who’s tasked with protecting a renegade princess. Nolan is only an observer in Amara's world--until he learns to control her. At first, Amara is terrified. Then, she's furious. But to keep the princess--and themselves--alive, they'll have to work together and discover the truth behind their connection. A fascinating premise, clearly and compellingly written and imagined by a startlingly original debut writer.\nPraise for Otherbound\nFOUR STARRED REVIEWS\"Original and compelling; a stunning debut.\" --Kirkus Reviews, starred review \"Numerous plot twists drive the story along, and it’s grounded in worldbuilding that creates a believable, authentic setting.  Duyvis makes ingenious use of a fascinating premise.\" --Publishers Weekly, starred review \"While Duyvis’s debut is an exciting take on the fantasy genre, as it alternates between our world and that of the Dunelands, the true strength of the novel is in its positive portrayal of LGBT issues.\" --School Library Journal, starred review \"Fantasy and speculative fiction fans will no doubt enjoy the ride, while authors should take note—this is how you do fantasy in a global world.\" --The Bulletin of The Center for Children’s Books, starred review \"Duyvis creates a humdinger of an adventure that contains the agony of loyalty, the allure of magic, and, most gratifyingly, the element of surprise.\" --The Horn Book Magazine \"Debut author Duyvis has written a nice twist on the classic bodysnatchers theme and keeps the pace moving smoothly, even when jumping between Nolan’s and Amara’s perspectives. Her racially diverse characters struggle with both disabilities and sexual identity, but she keeps her focus solidly on the story and character development so that diversity integrates naturally into both Nolan’s and Amara’s experiences.\" --Booklist",
  "genres": [
    "Fantasy",
    "Young Adult",
    "LGBT",
    "Science Fiction",
    "Disability",
    "Queer",
    "Fiction"
  ],
  "author": "Corinne Duyvis",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/16081758-otherbound"
}