{
  "title": "اسم الوردة",
  "description": "بين يدي القارئ كتاب هزّ الأوساط الأدبية، خلال الثمانينات، داخل إيطاليا وخارجها ولا يزال النقاد والدارسون يجتهدون في تأويله وفي دراسة خصوصياته الأسلوبية والمعنوية. وآخرهم أمبرتو ايكو نفسه الذي تناول بالدرس في كتابه \"حدود التأويل\" (ميلانو 1990) التحاليل والتأويلات المتأنية من مختلف القراءات التي حظي بها كتابه. حال ظهور رواية \"اسم الوردة\" سنة 1980 بميلانو، عملت الترجمة على نقله إلى جلّ اللغات الأوروبية والأمريكية، حيث كان ايكو معروفاً كواحد من أبرز دارسي السيميولوجيا، وجعلت منه في وقت وجيز معلماً أدبياً وفنياً معروفاً لدى الجميع، كما زاد في نجاح الكتاب وانتشاره ظهور الشريط السينمائي المستوحى من قصة \"ادسودا مالك\"، بطل الرواية، والذي لاقى بعض النجاح وان كان أقل بكثير من نجاح الكتاب نفسه. وتأتي هذه الترجمة لتمدّ القارئ العربي بأحد النصوص الهامة في هذا النصف الثاني من القرن، تتحتم عليه معرفته، خاصة وأن الرواية، وإن كانت تقص أحداثاً لا تهم في الظاهر العالم العربي الإسلامي، تعترف على لسان بطلها غوليالو دا باسكار خيل بعلم العرب وحكمتهم وبمساهمتهم في نشر العلوم والمعارف في أوروبا في القرون الوسطى، تلك المعارف التي هيأت أسس الاستفاقة الأوروبية اللاحقة. هذا الكتاب إذن يهمنا، يهمنا كقرّاء متطلعين إلى ما يجدّ على الساحة الأدبية والفنية من أعمال تستحق أن تترجم وأن يقع التعريف بها، ويهمنا كعرب ومسلمين لأنه بانتشاره عبر أنحاء الدنيا ينشر صورة للحضارة الإسلامية الماضية تتسم بتقدم العلوم والمعارف وبروح التسامح والتفتح. و\"اسم الوردة\"، إلى ذلك، هو بحق \"عمل مفتوح\" وبإمكان كل قارئ مهما كان انتسابه أن يجد فيه صورة من نفسه وصورة من عالمه. سيحسن فعلاً أثناء القراءة أنه المعين بالأمر \"de te fabula narratur\" كما يقول أمبرتو ايكو. أي أن الحكاية (أو الرواية) لا تقص في حقيقة الأمر إلا ما يجري من حولنا، بينما الوقائع التاريخية والجرائم والمتاهة المذكورة في الرواية لا تعدو أن تكون رموزاً ينفي فك أسرارها وفهم دلالاتها، ولعل هذا هو السبب في نجاح هذه الرواية أينما ترجمت ونشرت. في أواخر السنة الميلادية 1327 تعيش المسيحية أحلك فتراتها: البابا من أفينيون ينازع الامبراطور لودوفيك البافاري السلطة على إيطاليا، والكنيسة منشقة إلى شقين ينصرف أحدهما لجمع المال وتعاطي كل الرذائل ويثور الآخهر ضد المال معملاً أحياناً الحديد والنار لتطهير الكنيسة ولإرجاعها إلى نقاوتها الأصلية. ومجموعات من السذج والمتسكعين تجوب إيطاليا وفرنسا تنادي، وقد خرجت عن كل سلطة واشتبهت لديها الأمور، بحرب مقدسة ضد رجال الدين المنحرفين. والجميع من البابا إلى الأمبراطور إلى كبار التجار في المدن الإيطالية يستعملونهم لخدمة مصالحهم. في هذا الجو الذي يكاد يكون يؤذن بنهاية الكون يصل غوليالمودا باسكارفيل، عالم فرنشسكاني كان في السابق محققاً، صحبة تلميذه المبتدئ البندكتي أدسو إلى دير رهبان في شمال إيطاليا حيث يتهيأ لقاء بين بعثتين للتفاوض قصد الوصول إلى تصالح داخل الكنيسة. حال وصولهما إلى الدير يقع تكليف غوليالمو بالتحقيق في سلسلة من الجرائم الرهيبة ستتواصل طيلة الأيام السبعة التي سقضيانها في الدير، جاعلة من الدير المنعزل كأنه جزيرة أمان وسط عاصف هوجاء ومن مكتبته المصممة على شكل متاهة، ملتقى للفسق والجنون والحقد، ومكاناً ضربت فيه رسل المسيح الدجال موعداً لإقامة حقل الموت وقدّاس الشياطين. رواية شبه بوليسية شبه تاريخية شبه فلسفية عما ما كان سابقاً أو ما يحدث الآن أو ما سيأتي.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Mystery",
    "Historical",
    "Literature",
    "Italy",
    "Crime"
  ],
  "author": "Umberto Eco",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/16082109"
}