{
  "title": "Header",
  "description": "Grandpappy, what's a header?Header is a tale of consummate grotesquerie from the master of graphic horror -- the author of such books as: Succubi, Incubi and Creekers. It is a chapbook of the most extreme fiction you'll ever read! A horrific splatter mystery in the Joe R. Lansdale tradition... bathed in blood!An old man with no feet, a bumpkin rapist fresh out of prison, a federal cop who will do anything for money... They all have one thing in common...The ultimate revenge, the ultimate perversion. What kind of a mind could devise such a thing? What kind of evil?Deep in the hills, something hideous is going on. From the squalid shack you can hear it: the demented revel, the shrill, nerve-racking whine, and screams sailing away into an endless night. But don't look in the window unless you really want to know!Made Preliminary Stoker Award Ballot for Best Long Fiction of 1996. The classic Lee hardcore horror novella involves a most demented sex act as backwoods vengeance. Originally written for an aborted short story collection called TERRA DEMENTATA, Lee sold this outrageous piece to Necro Publications. He didn’t expect it to sell well. Instead it SOLD OUT and remains a highly sought-after collector’s item to this day. HEADER’s success, in fact, polarized Lee’s hardcore fan-base and is also credited by many of igniting the marketability of small-press novellas as single-project releases. “Necro had balls publishing this,” Lee says. “And I’m damn glad they did ‘cos it made me much more actively aware of the size of the small-press horror market.” This is also the first project to stamp Lee as the master of “redneck” horror, even after the large mass-market release of “Mr. Torso,” in Pocket’s HOT BLOOD: DEADLY AFTER DARK. HEADER has also been optioned for film (see www.whatsaheader.com). Lee’s novella collection, SEX, DRUGS, & POWER TOOLS contains a reprint of HEADER and THE PIG, plus the never-before-published but just as outrageous THE HORN-CRANKER.",
  "genres": [
    "Horror",
    "Splatterpunk",
    "Fiction",
    "Dark",
    "Novella",
    "Short Stories",
    "Horror Thriller"
  ],
  "author": "Edward Lee",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/16082997-header"
}