{
  "title": "The Devil You Know",
  "description": "Praise for The Devil You \"The first in a series, K.H. Koehler does a fantastic job of introducing a dynamic set of characters, tweaking the usual concept of good versus evil just enough to make it interesting, thus setting the stage for much-anticipated future installments.\" ~BookFetish \"...filled with characters that really come alive, with a fast paced storyline that will keep you fully enveloped in the story and will probably be the most fun you have reading this summer.\" ~Literary Mayhem \"Fans of the Dresden Files I think you will really enjoy this book. I am a big fan, and I can't wait for the next book.\" ~Jaime (Goodreads Review) About The Devil You Not only does the devil have an only begotten son, but he's currently residing in the rural town of Blackwater in northeast Pennsylvania.Semi-retired from law enforcement, the handsome, if cynical, Nick Englebrecht becomes quickly caught up in a local missing child case that seems mundane on the outside, but when the sheriff requests his help as a psychic detective to help find the missing girl, his off-the-books investigation quickly leads him to some terrible truths about life, love and the universe as we know it.And if that isn't bad enough, the angels have begun an ethnic cleansing of all beings with demonic blood. Of course, Nick is at the top of their to-do list.Like a bad detective novel, it started with a woman.Not just a woman. The woman.In the Dashiell Hammet books, it's always some curvalicious widow in black trailing behind her own particular brand of crawling chaos. I got the exact same feeling from the redhead, though she wasn't wearing the traditional black dress and veil when she barged into the shop, the door clomping shut behind her. Rather, she was dressed in the watery blue uniform of Molly's Steakhouse six blocks down on what's locally known here in Blackwater as The Strip. They serve overpriced porterhouse steaks and underpriced beer, which is its main attraction. You can drink yourself silly, and the bill won't hurt as bad.I didn't know her, but the redhead lurched to a stop in front of the display counter, looked me straight in the eyes, and said, \"There's a man following me.\"I immediately knew a few things about 1. she was out too late, 2. she wasn't local because locals have more sense than to walk alone on the Strip at 11:15 at night, and 3. she was curvalicious. Number 3 is irrelevant to this story, but I figured I'd mention it anyway.Emergencies have a way of solidifying a relationship between strangers. I felt responsible for her. The red hair and curves didn't hurt at all.\"Is he coming?\" I asked.\"Yes,\" she answered. She was breathless and disheveled from what was likely a brisk, terror-filled, six-block jog.\"Did he see you come in here?\"\"Maybe. I don't know!\"Before she could say another word, I slipped around the counter, snagged her by the wrist, then dragged her down into the kneehole beneath the counter where my partner Morgana and I keep the late-night shop essentials--keys, flashlight, special orders, the lock box, bottles of Aquafina, and a dented aluminum baseball bat.Don't ask about the bat; that's a rather grim and uneventful story for another day.The redhead fit like she was made for the kneehole. She started to protest, but I sat on the stool behind the counter, resumed piecing together the set of Egyptian bezel that Morgana had been ragging me about all day, and said in a casual whisper, \"Here he comes.\"Within seconds the hulking shadow of a man slowed outside the shop.",
  "genres": [
    "Urban Fantasy",
    "Fantasy",
    "Angels",
    "Mystery"
  ],
  "author": "K.H. Koehler",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/16083327-the-devil-you-know"
}