{
  "title": "Bill of Human Wrongs",
  "description": "Claire Winslow has nightmares nearly every night, reliving the event when her sister killed a man, and then shot herself. The man had been a prominent CEO of an electronics company, a powerhouse citizen in their small town, her sister’s rapist. Twenty years later, Claire Winslow, now a US Republican Senator from the state of Washington is an advocate for women’s rights. Her national platform gives her the power to be heard and make a difference in protecting women against unfair practices.Claire is about to be tested.Senate Bill 1257 is set to be released with only a week to read before the vote. This bill attempts to modify the constitution in a way that could change the future lives of not only women, but all non-white citizens in the country. The Senate is dominated by the Republican Party. The authors of the bill have every Republican on board to sign the bill. Except for Claire Winslow.And they need her vote.This thriller leads us through the life of Claire Winslow during a time when the people around her will stop at nothing to win her vote. The bill is full of changes that Claire cannot vote for. But her re-election is coming up. Is she more help to women as a Senator? Does she keep her position by voting for this horrendous bill?Then Claire meets Eve Hart.Eve lives in a different world from Claire’s, a place that might be the creation of SB 1257. Eve could be a product, a futuristic outcome from this SB 1257. Claire is having her nocturnal nightmares depicting the last moments of her sister’s life, her Party’s pressures; nasty tricks are taking a toll on her. There are only a few days left before the vote, when Claire learns something so dreadful, so unthinkable. What will Claire do with this knowledge?",
  "genres": [
    "Thriller",
    "Mystery Thriller",
    "Politics"
  ],
  "author": "C. Michaels",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/16083873-bill-of-human-wrongs"
}