{
  "title": "The Deadtime",
  "description": "Roman is a being without a memory, a being who cannot recall a beginning, though he’s planning an end. His earliest memory is of falling, landing in a world that has been ravaged by war and tormented by a fluctuating environment. An insatiable hunger greets him upon his arrival, a hunger that can only be satiated by the blood of evil mortals. After a year’s worth of killing, Roman has grown weary of murder, weary of the questions that constantly plague him. Who is he? Where did he come from? Why is he here?Guilt and self-loathing lead him to suicide’s door, a door that will not remain ajar for long, thanks to a kidnapped girl named Avalyn. After rescuing her, Roman discovers that there’s more to her, more to himself, and more to the world than he thinks. He will learn about the Seven Houses of Hell, who’s name correspond to the seven deadly sins, ruled by the seven demon lords. He will learn about the Deadtime, whose doorways lead to each and every all. He will begin to understand that he and Avalyn are somehow linked. And with the aid of his friend, his holy friend, his only friend, a priest named Father Purgeon, Avalyn and Roman will seek to find their connection and begin to understand their capabilities, all while being hunted.Among those tracking Roman, are Bailien, a demon with bound wings, and his former master Lucien, a demon who once led House Wrath’s legions upon the celestial realm, and is now imprisoned inside the body of a dead werewolf king. Though Roman doesn’t remember, he is the reason that Bailien and Lucien are serving a penance on earth, the mortal realm.As Roman struggles to discover who he is, why he’s here, and what role Avalyn plays in his shadowy past, Roman must race against adversaries both known and unknown to right the wrongs he committed in the past, a past filled with mistakes and betrayal, which are steadily catching up to him, rippling into a future that will affect everyone.",
  "genres": [
    "Horror"
  ],
  "author": "Robert Rosario",
  "average_rating": "4.70",
  "url": "https://www.goodreads.com/book/show/16083664-the-deadtime"
}