{
  "title": "Common Sense Conservative Prescriptions Solutions For What Ails Us, Volume 1",
  "description": "\"Common Sense Conservative Prescriptions Solutions for What Ails Us, (Book I)is quite timely especially given the presidential race and this election cycle which I talk about. This book is not solely about health care but looks at the broader pictures in America. I was intrigued that Karl Rove called it powerful especially since it engages in a discussion about the mindset of both political parties, consultants and pundits which can undermine democracy and efforts to do the right thing, stuck in the mud thinking sinking under its own weight and some of our problems as well as much of our promise. My local paper called the book my opus magnus given its length which is why it is written so that people can reference areas of interest or chose to use the SOAP to get to the heart of an issue without necessarily having to read current concerns and a historical perspective that is too often lacking in our political discourse.Common Sense Conservative Prescriptions has one of its chapters go through a brief synopsis examining the values of our 44 presidents. Conservative trends are identified dating to Andrew Jackson (reportedly one of my great great ancestors approximately 4 generations ago) and Dwight D. Eisenhower who was right on the mark in his farewell address to the nation. It also takes on what is in the US Constitution that folks are missing, why the tea party movement got legs and fairer ways to deal with the entitlements such as Social Security, Health Care, Education, Immigration, Tax Reform and other issues including embracing foreign policy and military changes which would save money and still allow superior national security. In taking a very different look at how we solve this nations problems while digging deeper to examine citizen impacts, best practices are explored.The book is broken up into sections which may be easier to digest as ones interest is peaked. Quite different in my work is also the historic demonstration of the pivotal impact of black Americans on this nation’s founding, laws and development as well as that for the Republican Party and many of its policies. Additionally a family practitioners methodology is used in coming to its conclusions and shows how such a vantage from politicians and other citizens can be used to objectively do the same. Hopefully reading this will give you a different perspective. I’ve lived and served in the black community when possible thereby having some credibility which others may not on issues of blacks and the Republican Party which is long standing and detailed. This work also demonstrates why the non-traditional media has so much difficulty in dealing with the Obama Phenomena.The solutions in the book will give all something to think about. The revealed realities of politics ought to make people want to get informed as well as more involved. I’ve lived and served in the black community when possible thereby having some credibility which others may not on issues of blacks and the Republican Party which is long standing and detailed. This work also demonstrates why the non-traditional media has so much difficulty in dealing with the Obama Phenomena.\" Dr. Ada Fisher via an interview with HHR http://www.hiphoprepublican.com/hhr-e...",
  "genres": [],
  "author": "Ada M. Fisher",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/16084709-common-sense-conservative-prescriptions-solutions-for-what-ails-us-volu"
}