{
  "title": "Carnal Thirst: Dark Kisses",
  "description": "MISLEDSpecial Task Force agent Derek Atkinson has a craving for luscious vampire Sable Taylor. But Sable's a bounty hunter, which makes him direct competition in the capture of wanted criminals. Despite the obvious attraction between them, she won't give him a chance and after two years, he's tired of waiting for her to come around.So he's got a plan to give them both what they want... each other.Sable's on a dangerous mission. She's not who Derek thinks she is, so anything personal just isn't possible. But like most master vampires, Derek's wily and used to having his way. When he traps her on his ship, she decides to indulge. Two straight days of mind-blowing sex should be enough, but it isn't, not for either of them. Her heart is involved now, but Sable can't let Derek get too close. If he finds out what she's doing, he'll never forgive her.Derek, however, refuses to let go.Now he's getting shot at and asking questions she shouldn't answer. Sable has to reveal the truth... Derek's love has been misled...KISS OF THE NIGHTSpecial Task Force agent Alexei Night has had a crush on Interstellar Council Representative Briana Michaels ever since the first time he saw her on the vid comm. But their lives are worlds apart. He's a vampire. She's not. There's no possibility of a relationship between them. Yet he still dreams of her...When Briana's unpopular position supporting vampiric rights threatens her family, Alex leaps at the chance to protect her and be with her. It's a two-week journey to her homeworld, and he'll spend it making love with the woman he can't keep, trying to get enough of her to last an eternity. Their erotic connection is easily established but their bond doesn't overshadow the danger surrounding Briana.A hopeless romance with a woman whose mortal life is threatened... Things can't get any worse for Alex.And then somehow...they do.",
  "genres": [
    "Romance",
    "Paranormal Romance",
    "Erotica",
    "Vampires",
    "Fantasy",
    "Paranormal"
  ],
  "author": "Sylvia Day",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/16084818-carnal-thirst"
}