{
  "title": "Preparing to Die: Practical Advice and Spiritual Wisdom from the Tibetan Buddhist Tradition",
  "description": "We all face death, but how many of us are actually ready for it? Whether our own death or that of a loved one comes first, how prepared are we, spiritually or practically? In Preparing to Die , Andrew Holecek presents a wide array of resources to help the reader address this unfinished business.Part One shows how to prepare one's mind and how to help others, before, during, and after death. The author explains how spiritual preparation for death can completely transform our relationship to the end of life, dissolving our fear and helping us to feel open and receptive to letting go in the dying process. Daily meditation practices, the stages of dying and how to work with them, and after-death experiences are all detailed in ways that will be particularly helpful for those with an interest in Tibetan Buddhism and in Tibetan approaches to conscious dying.Part Two addresses the practical issues that surround death. Experts in grief, hospice, the funeral business, and the medical and legal issues of death contribute chapters to prepare the reader for every practical concern, including advance directives, green funerals, the signs of death, warnings about the funeral industry, the stages of grief, and practical care for the dying.Part Three contains heart-advice from twenty of the best-known Tibetan Buddhist masters now teaching in the West. These brief interviews provide words of solace and wisdom to guide the dying and their caregivers during this challenging time. Preparing to Die is for anyone interested in learning how to prepare for death from a Buddhist perspective, both spiritually and practically. It is also for those who want to learn how to help someone else who is dying, both during the time of illness and death as well as after death.",
  "genres": [
    "Buddhism",
    "Death",
    "Spirituality",
    "Nonfiction",
    "Religion"
  ],
  "author": "Andrew Holecek",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/16085518-preparing-to-die"
}