{
  "title": "Armor and Blood: The Battle of Kursk, The Turning Point of World War II",
  "description": "One of America’s most distinguished military historians offers the definitive account of the greatest tank battle of World War II—an epic clash of machines and men that matched the indomitable will of the Soviet Red Army against the awesome might of the Nazi Wehrmacht. While the Battle of Kursk has long captivated World War II aficionados, it has been unjustly overlooked by historians. Drawing on the masses of new information made available by the opening of the Russian military archives, Dennis Showalter at last corrects that error. This battle was the critical turning point on World War II’s Eastern Front. In the aftermath of the Red Army’s brutal repulse of the Germans at Stalingrad, the stakes could not have been higher. More than three million men and eight thousand tanks met in the heart of the Soviet Union, some four hundred miles south of Moscow, in an encounter that both sides knew would reshape the war. The adversaries were at the peak of their respective powers. On both sides, the generals and the dictators they served were in agreement on where, why, and how to fight. The result was a furious death grapple between two of history’s most formidable fighting forces—a battle that might possibly have been the greatest of all time. In Armor and Blood, Showalter re-creates every aspect of this dramatic struggle. He offers expert perspective on strategy and tactics at the highest levels, from the halls of power in Moscow and Berlin to the battlefield command posts on both sides. But it is the author’s exploration of the human dimension of armored combat that truly distinguishes this book. In the classic tradition of John Keegan’s The Face of Battle, Showalter’s narrative crackles with insight into the unique dynamics of tank warfare—its effect on men’s minds as well as their bodies. Scrupulously researched, exhaustively documented, and vividly illustrated, this book is a chilling testament to man’s ability to build and to destroy. When the dust settled, the field at Kursk was nothing more than a wasteland of steel carcasses, dead soldiers, and smoking debris. The Soviet victory ended German hopes of restoring their position on the Eastern Front, and put the Red Army on the road to Berlin. Armor and Blood presents readers with what will likely be the authoritative study of Kursk for decades to come.Advance praise for Armor and Blood “The size and the brutality of the vast tank battle at Kursk appalls, this struggle that gives an especially dark meaning to that shopworn phrase ‘last full measure.’ Prepare yourself for a wild and feverish ride over the steppes of Russia. You can have no better guide than Dennis E. Showalter, who speaks with an authority equaled by few military historians.” —Robert Cowley, founding editor of The Quarterly Journal of Military History “A fresh, skillful, and complete synthesis of recent revelations about this famous battle . . . As a myth buster, Armor and Blood is a must-read for those interested in general and military history.” —David M. Glantz, editor of The Journal of Slavic Military Studies“Refreshingly crisp, pointed prose . . . Throughout, [Showalter] demonstrates his adeptness at interweaving discussions of big-picture strategy with interesting revelations and anecdotes. . . . Showalter does his best work by keeping his sights set firmly on the battle at hand, while also parsing the conflict for developments that would have far-reaching consequences for the war.” — Publishers Weekly",
  "genres": [
    "History",
    "Nonfiction",
    "World War II",
    "Military Fiction",
    "War",
    "Military History",
    "Russia"
  ],
  "author": "Dennis E. Showalter",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/16085515-armor-and-blood"
}