{
  "title": "Second Suns: Two Doctors and Their Amazing Quest to Restore Sight and Save Lives",
  "description": "From the co-author of Three Cups of Tea comes the inspiring story of two very different doctors—one from the United States, the other from Nepal—united in a common to rid the world of preventable blindness. In this transporting book, David Oliver Relin shines a light on the work of Geoffrey Tabin and Sanduk Ruit, gifted ophthalmologists who have dedicated their lives to restoring sight to some of the world’s most isolated, impoverished people through the Himalayan Cataract Project, an organization they founded in 1995. Tabin was the high-achieving bad boy of Harvard Medical School, an accomplished mountain climber and adrenaline junkie as brilliant as he was unconventional. Ruit grew up in a remote Nepalese village, where he became intimately acquainted with the human costs of inadequate access to health care. Together they found their life’s tending to the afflicted people of the Himalayas, a vast mountainous region with an alarmingly high incidence of cataract blindness. Second Suns takes us from improvised plywood operating tables in villages without electricity or plumbing to state-of-the-art surgical centers at major American universities where these two driven men are restoring sight—and hope—to patients from around the world. With their revolutionary, inexpensive style of surgery, Tabin and Ruit have been able to cure tens of thousands—all for about twenty dollars per operation. David Oliver Relin brings the doctors’ work to vivid life through poignant portraits of patients helped by the surgery, from old men who cannot walk treacherous mountain trails unaided to cataract-stricken children who have not seen their mothers’ faces for years. With the dexterity of a master storyteller, Relin shows the profound emotional and practical impact that these operations have had on patients’ lives. Second Suns is the moving, unforgettable story of how two men with a shared dream are changing the world, one pair of eyes at a time.Praise for Second Suns “As miracles go, it’s hard to beat making the blind see. Yet that’s exactly what the eye surgeon Dr. Geoffrey Tabin can do. He services poor people in the developing world who have developed cataracts—a clouding of the lens of the eye that is the world’s leading cause of blindness. . . . Second Suns is a hopeful work, a profile of two doctors who have dedicated their lives to bringing light to those in darkness.” — Time “A compelling and inspiring book . . . Second Suns portrays heroic health care delivered under harrowing Ruit and his teams carry their equipment on multi-day treks up steep mountain trails, sometimes hiking at night with flashlights or head lamps, to reach settlements where they typically spend several days operating on hundreds of villagers in makeshift surgical theaters.” — The Washington Post “ Second Suns should be required reading for anybody with an interest in humanitarian philanthropy—or, for that matter, a desire to feel a little better about the world.” — Outside “A detailed, heartfelt account of the work of [two] dedicated pioneers.” — Kirkus Reviews",
  "genres": [
    "Nonfiction",
    "Biography",
    "Medical",
    "Medicine",
    "Memoir",
    "Science",
    "Health"
  ],
  "author": "David Oliver Relin",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/16085516-second-suns"
}