{
  "title": "The Last Bad Job",
  "description": "The Last Bad Job is the story of a reporter with a hell of an assignment: Five months on a New Mexico desert compound to cover what may be the next Jonestown. For the reporter, it could be a career-maker. But when a cult member close to him drowns herself, he decides to run for it, and sets unimaginable events into motion. What ensues is a dark and comic journey through sex, drugs, cults, suicide, the apocalypse, and what comes after it. Available for the first time from the author of the widely acclaimed novels Another Broken Wizard and What Smiled at Him comes The Last Bad Job—a book the late Norman Mailer touted as showing “something that very few writers have; a species of inner talent that owes very little to other people.” Praise for Colin Dodds’ What Smiled at Him“The novel has an angry edge to it, recalling the spirit of the Beats. Many of the peripheral characters speak like prophets… Marv and Lynn are just as self-aware as their supporting cast, and their abundance of wisdom sometimes stretches believability; it’s tempered, however, by the flaw of their continually self-destructive behavior. Watching them ignore their better instincts… makes the characters more endearing.” -Kirkus ReviewsPraise for Dodds’ Another Broken Wizard“Dodds gets Worcester and shows it in all of its glories and cracks…He runs through the streets of the city and nearby towns and takes the reader with him…Dodds is a master of writing the town life and capturing all of the said and unsaid. His characters are so full of waiting, of pain, and of hope that never reaches past the next day.”-Worcester Pulse Magazine“Masterfully written with all the grit and grisly humor of returning to one’s dingy blue collar hometown, Another Broken Wizard is the compelling, tightly-woven story of a couple of 30-year old boyhood chums who don't grow up until it's too late.”-Boston Literary Magazine “It kept me nostalgic for something that isn't my story, isn't my town, and I got really emotionally involved. I may have shed a tear at the beautifully foreshadowed climax, and I do not cry easily! Seriously. Give it a read.” - Illiterarty.com“Another Broken Wizard is a terrific coming-of-age tale that rings utterly true. Dodds has a gift for conveying the sounds of his people and their world. He can make highway hypnosis as fascinating as a gang brawl. And he has a natural radar for locating the perfect detail to evoke the sense of what it feels like to be caught between the past and the future, between loyalty and logic, and between the security of the known and the impulse to evolve. Though I came of age in the primordial mists, it somehow felt like he was giving me a tour of my own past. Another Broken Wizard is compulsively readable. I’ll be giving this book to some of my friends.”- Jack O’Connell, author of The Resurrectionist, and Box Nine “Dodds has written a fine novel. He has a voice wholly his own, and he captures the elemental good and bad in the American male. Joe’s recklessness and gang feud creates a looming peril that keeps the reader on edge.” -Kevin Kosar, author of Whiskey: A Global History About the AuthorColin Dodds grew up in Massachusetts and completed his education at The New School in New York City. Dodds’ novels What Smiled at Him and Another Broken Wizard have been widely acclaimed by critics and readers alike. His screenplay, Refreshment – A Tragedy, was named a semi-finalist in 2010 American Zoetrope Contest. Two books of Dodds’ poetry—The Last Man on the Moon and The Blue Blueprint—are available from Medium Rare Publishing and his writing has appeared in a number of periodicals, including The Wall Street Journal Online, Folio, Explosion-Proof, Block Magazine, The Architect’s Newspaper, The Main Street Rag, The Reno News & Review and Lungfull! Magazine. He lives in Brooklyn, New York, with his wife Samantha.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Science Fiction",
    "Amazon"
  ],
  "author": "Colin Dodds",
  "average_rating": "2.81",
  "url": "https://www.goodreads.com/book/show/16086782-the-last-bad-job"
}