{
  "title": "The Glorious First of June",
  "description": "On 1 June 1794, after a week of skirmishing, the French and British fleets came to close quarters in the northwest Atlantic, some 400 miles off the coast of Brittany. No battle had ever been fought so far from land. The French, in ships painted blood-red and bearing banners proclaiming 'la Republique ou la mort!' were escorting a American grain convoy to Brest to feed a starving population; the British, under the command of Lord Howe, a radical innovator and tactical genius, were bent on destroying the battle fleet of the nascent French Republic. Both sides would claim victory in the ensuing battle; and both had reason to do so. For the French, 'le combat de prairial' was a strategic success since the convoy and its precious cargo made it safely through. But this outcome came at a heavy material cost. In numerical terms 'the Glorious First of June' was the greatest British naval victory over her oldest enemy for more than 100 years: 6 French ships were captured and another sunk; 4,200 French sailors were killed and 3,300 wounded - 10% of their entire maritime workforce. These were physical blows from which the French navy would never truly recover. In 'The Glorious First of June', Sam Willis not only tells, with thrilling immediacy and masterly clarity, the gripping story of an epic and complex battle, he also explains its critical importance for the development of British naval tactics and the concomitant growth of British sea-power. For it was in this battle that Lord Howe experimented successfully with the sophisticated line-breaking manoeuvres which, finessed and perfected by Horatio Nelson, would bring Britain to the apogee of its maritime supremacy with the defeat of Napoleon just 11 years later. With 'The Fighting Temeraire' and 'The Admiral Benbow', 'The Glorious First of June' forms part of 'The Hearts of Oak trilogy' of scholarly but accessible histories that, between them, encapsulate Britain's maritime achievement during the age of sail.",
  "genres": [
    "History",
    "Nonfiction",
    "Military Fiction",
    "Military History",
    "18th Century",
    "Naval History"
  ],
  "author": "Sam Willis",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/16089473-the-glorious-first-of-june"
}