{
  "title": "Barba ensopada de sangue",
  "description": "Neste quarto romance de Daniel Galera, um professor de educação física busca refúgio em Garopaba, um pequeno balneário de Santa Catarina, após a morte do pai. O protagonista (cujo nome não conhecemos) se afasta da relação conturbada com os outros membros da família e mergulha em um isolamento geográfico e psicológico. Ao mesmo tempo, ele empreende a busca pela verdade no caso da morte do avô, o misterioso Gaudério, que teria sido assassinado décadas antes na mesma Garopaba, na época apenas uma vila de pescadores.Sempre acompanhado por Beta, cadela do falecido pai, o professor esquadrinha as lacunas do pouco que lhe é revelado, a contragosto, pelos moradores mais antigos da cidade. Portador de uma condição neurológica congênita que o obriga a interagir com as outras pessoas de modo peculiar, o professor estabelece relações com alguns moradores: uma garçonete e seu filho pequeno, os alunos da natação, um budista histriônico, a secretária de uma agência turística de passeios. Aos poucos, ele vai reunindo as peças que talvez lhe permitam entender melhor a própria história.É também com lacunas e peças aparentemente díspares que Galera constrói sua narrativa. Dotado de um senso impecável de ritmo, ele alterna descrições ricas em sutileza e detalhamento com diálogos ágeis e de rara verossimilhança, que dão vida a um elenco de personagens inesquecíveis.Barba ensopada de sangue resgata e leva às últimas consequências temas e conflitos das obras anteriores do autor, tais como: a construção da identidade e, nesse processo, as dificuldades que enfrentamos para entender e reconhecer os outros; a necessidade inconfessa de uma reparação talvez inviável; a busca pela unidade entre mente e corpo; o consolo afetivo que o contato com a natureza e os animais é capaz de nos proporcionar; os diversos tipos de violência que podem irromper em meio a uma existência domesticada.",
  "genres": [
    "Fiction",
    "Brazil",
    "Portuguese Literature",
    "Romance",
    "Literature",
    "Mystery",
    "Contemporary"
  ],
  "author": "Daniel Galera",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/16089464-barba-ensopada-de-sangue"
}