{
  "title": "The Summer of France",
  "description": "When Fia Jennings loses her job at the local newspaper, she thinks she’ll have the chance to bond with her teenage twins. As she realizes she may be too late to pull her family together, her husband Grayson pressures her to find another job so they can pay the increasing bills. Relief comes with a phone call from Fia’s great Uncle Martin who runs a bed and breakfast in Provence. Uncle Martin wants Fia to venture to France to run the B&B so he and his wife Lucie can travel. He doesn’t tell Fia about the secret he hid in the house when he married Lucie after fighting in World War II, and he doesn’t mention the people who are tapping his phone and following him, hoping to find the secret. After much cajoling, Fia whisks her family to France and is stunned when Uncle Martin and Aunt Lucie leave the same day for a Greek cruise. She’s thrown into the minutiae of a running the B&B without the benefit of speaking the language. Her dreams of family bonding time fade as her teenagers make French friends. Kasie joins a local swim team, riding off to practice on the back of a scooter each morning, hips tucked next to the 18-year-old French boy who teaches her to smoke brown cigarettes and drink red wine. West accompanies a pouty French teenager around the city, playing his guitar in the town squares to earn spending money. Fia’s husband Grayson begins touring the countryside with a pretty French woman, and Fia resists the distractions of Christophe, a handsome French man. Why the whirlwind of French welcome, Fia wonders after she comes home from a day at the beach in Nice to find someone has ransacked the B&B. Fia parses Uncle Martin’s obscure phone calls, trying to figure out this WW II hero’s secret. Can she assuage Uncle Martin’s World War II guilt and build the family she’s always dreamed of?",
  "genres": [
    "France",
    "Historical",
    "Historical Fiction",
    "Amazon",
    "Fiction"
  ],
  "author": "Paulita Kincer",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/16089591-the-summer-of-france"
}