{
  "title": "Appalachian Undead",
  "description": "Almost Heaven...Or is it? The culture of the Appalachians is steeped with folktales, legends, and deep-rooted religion. There is much to love in the beauty of the rolling hills and friendly rural families, but something malicious hides just beneath the surface. Something dreadful. Something hungry... Can the people of the region stand up against the hordes of the Dead?Appalachian Undead takes a look at the dark side of Appalachia, where the undead walk, driven by old magic and their hunger for us. Can Appalachia stand against and army that never tires and is always hungry? With new intriguing tales of the undead, by some of the best names in horror, including Jonathan Maberry, Gary A. Braunbeck, Tim Lebbon, Elizabeth Massie, Lucy Snyder, Bev Vincent, Tim Waggoner, John Skipp and many more.Table of Contents:When Granny Comes Marchin' Home Again - Elizabeth MassieCalling Death - Jonathan MaberryHide and Seek - Tim WaggonerTwilight of the Zombie Game Preserve... - S. Clayton RhodesBeing in Shadow - Maurice BroaddusSitting up with the Dead- Bev VincentThe Girl and the Guardian - Simon McCafferyRepent, Jessie Shimmer! -Lucy SnyderAlmost Heaven -Michael Paul GonzalezOn Stagger - G. Cameron FullerWe Take Care of Our Own - John EversonSleeper - Tim LebbonReckless - Eliot ParkerCompany's Coming - Ronald KellyBlack Friday - Karin FullerSpoiled - Paul MooreMiranda Jo's Girl - Steve Rasnic TemTimes Is Tough in Musky Holler - John Skipp & Dori MillerLong Days to Come - K. Allen WoodHell's Hollow - Michael WestBrother Hollis Gives His Final Sermon from a Rickety Make-Shift Pulpit in the Remains of a Smokehouse that now Serves as His Church - Gary A. BraunbeckIntroduction by S.G. Browne, author of Breathers: A Zombie's LamentSpecial Afterword by Fangoria Magazine editor Rebekah McKendry",
  "genres": [
    "Zombies",
    "Horror",
    "Short Stories",
    "Anthologies"
  ],
  "author": "Eugene Johnson",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/16092058-appalachian-undead"
}