{
  "title": "Scarlette: A Gothic Folktale",
  "description": "Fans of Aaron Mahnke's \"Lore\" will be thrilled to read this historical-fantasy novel that blurs the line between folklore and reality.\n  Ninety years before the Brothers Grimm penned their version of \"Little Red Riding Hood,\" an historic, gruesome series of events shocked all of Europe. Starting in 1764, an unidentified wolf-like animal ferociously mauled dozens of peasants in the Gévaudan region of France. Whispered rumors of unnatural creatures blended with age-old superstition to cause mass hysteria. Alarmed, King Louis XV sent his best huntsmen to rid the province of the beastly scourge, but this legendary massacre had only just begun. Scarlette, a 19-year-old seamstress who is laboring to make ends meet, lives under this dark threat. Although fearful of the nightmarish monster lurking in the surrounding forest, she remains naive and skeptical of the supernatural gossip. Until her grandmother is attacked.Scarlette learns her grandmother has been infected by the animal's bite. Desperate to save her, Scarlette begins to uncover the dark secrets of her village and finds there are those who wish to keep their pasts hidden. As time grows short, Scarlette is befriended by a local nobleman and a woodcutter who both share an eerie history with the wolf. Scarlette must unravel the men's connection and solve a long-forgotten crime before her grandmother's infection spreads. Based on both the traditional Grimm fairy-tale and older known French versions of \"Little Red Riding Hood\", this Gothic novel is set against the historic 18th century Beast of Gévaudan attacks in a modern, accessible prose style. Unique to the genre, the novel revives the fable of the girl-in-the-red-cloak with a new historical angle.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Fairy Tales",
    "Paranormal",
    "Romance",
    "Retellings",
    "Fiction"
  ],
  "author": "Davonna Juroe",
  "average_rating": "3.47",
  "url": "https://www.goodreads.com/book/show/16092387-scarlette"
}