{
  "title": "The Undefeated Mind: On the Science of Constructing an Indestructible Self",
  "description": "Legions of self-help authors rightly urge personal development as the key to happiness, but they typically fail to focus on its most important objective: hardiness. Though that which doesn't kill us can make us stronger, as Nietzsche tells us, few authors today offer any insight into just how to springboard from adversity to strength. It doesn't just happen automatically; it takes practice. New scientific research suggests that resilience isn't something with which only a fortunate few of us have been born, but rather something we can all take specific action to develop. To build strength out of adversity, we need a catalyst. What we need, according to Dr. Alex Lickerman, is wisdom—wisdom that adversity has the potential to teach us.Lickerman's underlying premise is that our ability to control what happens to us in life may be limited, but our ability to surmount the suffering life brings us is not. The Undefeated Mind distills the wisdom we need to create true resilience into nine core principles, including:—A new definition of victory and its relevance to happiness—The concept of the changing of poison into medicine—A way to view prayer as a vow we make to ourselves. —A method of setting expectations that enhances our ability to endure disappointment and minimizes the likelihood of quitting—An approach to taking personal responsibility and moral action that enhances resilience—A process for managing pain—both physical and emotional—that enables us to push through obstacles that might otherwise prevent us from attaining our goals—A method of leveraging our relationships with others that helps us manifest our strongest selves Through stories of patients who have used these principles to overcome suffering caused by unemployment, unwanted weight gain, addiction, rejection, chronic pain, retirement, illness, loss, and even death, Dr. Lickerman shows how we too can make these principles function within our own lives, enabling us to develop for ourselves the resilience we need to achieve indestructible happiness. At its core, The Undefeated Mind urges us to stop hoping for easy lives and focus instead on cultivating the inner strength we need to enjoy the difficult lives we all have.",
  "genres": [
    "Psychology",
    "Self Help",
    "Nonfiction",
    "Philosophy",
    "Personal Development",
    "Buddhism",
    "Spirituality"
  ],
  "author": "Alex Lickerman",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/16092850-the-undefeated-mind"
}