{
  "title": "Two Presidents Are Better Than One: The Case for a Bipartisan Executive Branch",
  "description": "“Many Americans are unsatisfied with politics. Simultaneously, we are hesitant to question the basic soundness of our constitutional system. In this refreshingly provocative book, David Orentlicher explains why it is due time for us to reconsider dominant ideas about the presidency, now arguably our most powerful political institution. Challenging the conventional wisdom that the best executive is necessarily a unitary executive, Orentlicher makes a wonderful case for why ‘two presidents are better than one.’ Sure to be of interest to political scientists, legal scholars, as well as informed citizens justifiably worried about the fate of American democracy, this fascinating book dares to challenge everything you thought you knew about one of our favorite political institutions.”—William E. Scheuerman, Indiana University  “Can Orentlicher be serious in calling for a plural executive? The answer is yes, and he presents thoughtful and challenging arguments responding to likely criticisms. Any readers who are other than completely complacent about the current state of American politics will have to admire Orentlicher’s distinctive audacity and to respond themselves to his well-argued points.”—Sanford Levinson, author of \"Framed: America’s 51 Constitutions and the Crisis of Governance\" When talking heads and political pundits make their “What’s Wrong with America” lists, two concerns invariably rise to the top: the growing presidential abuse of power and the toxic political atmosphere in Washington. In Two Presidents Are Better Than One, David Orentlicher shows how the “imperial presidency” and partisan conflict are largely the result of a deeper problem—the Constitution’s placement of a single president atop the executive branch. Accordingly, writes Orentlicher, we can fix our broken political system by replacing the one person, one-party presidency with a two-person, two-party executive branch. Orentlicher contends that our founding fathers did not anticipate the extent to which their checks and balances would fail to contain executive power and partisan discord. They also did not foresee how the imperial presidency would aggravate partisan conflict. As the stakes in presidential elections have grown ever higher since the New Deal, battles to capture the White House have greatly exacerbated partisan differences. Had the framers been able to predict the future, Orentlicher argues, they would have been far less enamored with the idea of a single leader at the head of the executive branch and far more receptive to the alternative proposals for a plural executive that they rejected. Like their counterparts in Europe, they might well have created an executive branch in which power is shared among multiple persons from multiple political parties. Analyzing the histories of other countries with a plural executive branch and past examples of bipartisan cooperation within Congress, Orentlicher shows us why and how to implement a two-person, two-party presidency. Ultimately, Two Presidents Are Better Than One demonstrates why we need constitutional reform to rebalance power between the executive and legislative branches and contain partisan conflict in Washington.David Orentlicher is Samuel R. Rosen Professor at Indiana University Robert H. McKinney School of Law. A scholar of constitutional law and a former state representative, David also has taught at Princeton University and the University of Chicago Law School. He earned degrees in law and medicine at Harvard and specializes as well in health care law and ethics.",
  "genres": [],
  "author": "David Orentlicher",
  "average_rating": "2.00",
  "url": "https://www.goodreads.com/book/show/16093153-two-presidents-are-better-than-one"
}