{
  "title": "How Everyone Became Depressed: The Rise and Fall of the Nervous Breakdown",
  "description": "The book argues that psychiatry's love affair with the diagnosis of depression has become a death grip. Depression is a real illness, especially in its melancholic form. But most patients who get the diagnosis of \"depression\" are also anxious, fatigued, unable to sleep, have all kinds of physical symptoms, and tend to obsess about the whole thing. They do not have a disorder of \"mood.\" It is a travesty to call them all \"depressed.\" How did this happen? How did everyone become depressed? A well-known historian, Shorter describes how in the 19th century patients with those symptoms were considered \"nervous,\" and when they lost control it was a \"nervous breakdown.\" Then psychiatry turned its back on the whole concept of nerves, and - first under the influence of Freud's psychoanalysis and then the influence of the pharmaceutical industry - the diagnosis of depression took center stage. The result has been a scientific disaster, leading to the misdiagnosis and inappropriate treatment (with \"antidepressants\") of millions of patients. Urging that the diagnosis of depression be re-thought, the book turns a dramatic page in the understanding of psychiatric symptoms that are as common as the common cold. The book makes an immediate contribution to the debate about DSM5, which is scheduled to be published in May 2013 just as Shorter's book is launched: Shorter proposes replacing the diagnosis of \"major depression\" with \"melancholia\" and \"nonmelancholia\"; he argues that depression and anxiety usually occur together and are really the same disease; and he says that patients with so-called mood disorders really have a disorder of the entire body. All of this will be highly unwelcome to the official disease designers of DSM5 because it involves throwing out much of their schema.The book's edge is its ability to make the enormous well of psychiatry's past history in several languages relevant to burning issues today. No other writer has been able to glean nuggets of gold from this huge record of the past and apply them to important discussions today of diagnosis and treatment.",
  "genres": [
    "Psychology",
    "History",
    "Mental Health",
    "Nonfiction",
    "Mental Illness",
    "Psychiatry",
    "Disability"
  ],
  "author": "Edward Shorter",
  "average_rating": "3.39",
  "url": "https://www.goodreads.com/book/show/16093146-how-everyone-became-depressed"
}