{
  "title": "Hale Maree",
  "description": "GENRE: ADULT CONTEMPORARY ROMANCE Please be advised that this book is NOT suitable for Young Adult readers due to language and explicit sexual situations. Hale Simmons dreams of climbing out of her impoverished life, going to college, and getting herself a titanium crash helmet, so she can eventually bust through the Plexiglas ceiling of her crappy life. But for now, she’s just a 18-year-old girl with a flimsy hope, barely getting by with her alcoholic father, Jerry.But for Hale, ‘crappy’ suddenly takes a nosedive, when Jerry becomes the sole witness to a horrible accident. It is an event which means to effect everyone, especially Hale, who wasn’t even involved.\tWhile the depth of the accident has just begun to unfold, Otto Maree, a prominent business man and old family friend, stands to lose everything because of it. Otto is desperate for Hale’s father to stay quiet about what occurred the night the two men met for a drink. Out of mutual moments of desperation, the two fathers forge a deal. Jerry is desperate to gain financial stability for both himself and Hale, and Otto Maree is more than willing to pay to keep his secret just that. \tBut deals like this need to be made of the strongest vows and bound with the most faithful of loyalties. Otto proposes a marriage between Hale and his playboy-son, Oscar, in order to assure that the secret remains ‘in the family’. The mystery surrounding the accident continues to grow and Hale struggles against her own mysterious feelings that begin to develop for Oscar, who turns out to less of a playboy, but just as fiercely loyal and dedicated as his father.  As the pressure around her continues to escalate, Hale realizes that she’s got to decide if this arranged marriage is really just a big mistake or an amazing twist of fate that has been waiting around for this particular accident to happen.",
  "genres": [
    "New Adult",
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Chick Lit",
    "Adult",
    "Young Adult"
  ],
  "author": "Misty  Provencher",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/16094462-hale-maree"
}