{
  "title": "All Change Please",
  "description": "In modern day London, the lives of three close friends are instantly set off course when their mutual friend, Laura, is suddenly killed. The three friends – Ophelia, Elise and Kat – find that their current lives are far worse than they could ever fathom. In the light of Laura’s tragic death, do any or all of the women decide to grab life by the horns and do something about how their own existences have exactly lived up to expectations? In a peculiar sort of way, Laura’s death not only shakes the three to their foundations, but it also wakes them out of their own personal slumbers. One of them is suffering through a dead end job with no appreciation or any advancement coming anytime soon. All this after she had moved from the United States to the UK in search of a happy, meaningful life and career. She was wrong and now she feels trapped in a city she has slowly learned to loathe and isn’t sure if she’s going to try and move out of London or stick it out. Her love life is pitiful as well, which doesn’t help matters.Another of the three eventually finds herself questioning her marriage, though she deeply loves her husband. However, like many a marriage, her in-laws don’t respect her and she finds herself constantly walking on eggshells. It doesn’t help that her husband is a struggling writer who coops himself up in their house all day. Does the love of her husband help her endure her own troubles?The third woman is a struggling artist who can’t seem to ever catch a break. Her relationship with her parents isn’t what one would describe as peachy, either, because of how vastly different she is from them. Constantly at odds with herself and society, she desperately searches for answers to her questions that she’s struggled to find her entire life.All Change Please takes you on the journey these women find themselves on together over the period of a few months towards the end of the year. They lean on each other for support when grieving Laura’s death and they feed off each other in trying to make the best of their own situations. All Change Please is a story of life’s great failures and the lessons learned, and it’s told with a superb dark comedic undertone. Enjoy the tale of Ophelia, Elise and Kat as they try to overcome their lousy states of existence via turmoil, death, stumbling drunkenness, anger, sarcasm, love, expression, frustration, and the determination of breaking the shackles of monotony.",
  "genres": [],
  "author": "Danielle West",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/16094628-all-change-please"
}