{
  "title": "Kāśī maraṇānmukti",
  "description": "स्वरुप के द्वार पर खड़े तुम यह जानने के लिए जन्मे हो की सृष्टा, सृष्टि से अलग होकर भी उससे प्रत्येक कण में अपने को अभिन्न किये, समाए हुए है | - काशी मरणान्मुक्ति Our Guru Shri Manoj Thakkar and his disciple Ms Rashmi Chhazed have written a Hindi philosophical novel named ‘Kashi Marnan Mukti’ released by Smt. Indu Jain, Chairperson, Times Group. It is based on Maha’s (protagonist) spiritual journey in search of his guru towards enlightenment i.e. “Chita ko agni lagate hue ek jeev shiv ko prapt karta hai”, a Chandaal reaching the spiritual height of Buddha. It signifies aloud that you are born to realize that you and the energy that created thou are inseparable. ‘Guru, god and self are one’. I felt ‘One’ with Maha experiencing that energy within me uplifting and bringing me to another dimension. The work is permeated by what may be called as the zenith that a man can touch during his life span, irrespective of the background to which he belongs. This book does not provide any technique of life transformation rather it is an effort to enable each one of us to understand ourselves, to realise our obscured potential by constantly learning and developing insights into one’s life purely with the vision to reimburse the best back to our society. Today Indian youth is getting diverted towards western civilization when the west itself is looking upon Indian culture and India's spiritual teachings. This magnificent novel includes messages from Vedas, Purans and Upanishads which seem difficult to comprehend in their original form while here that same content is much more enjoyable to read and understand since it is available in a simpler narrative form like a story. These epics have been in the existence for ages together and this book follows the same path enriching Hindi literature and philosophy in its journey for enlightening the people through its messages and I feel it would be ‘amar’ in the minds of people. Shri Manoj Thakkar ji our Guru, leads our path towards self-awakening ,teaching through and beyond words , enabling us to live a fulfilling life to the utmost by maintaining the correct balance between spiritualism and materialism. His discussions are based on underlying causes of the problems faced by individuals and there solution, with a vision to bring about a positive change in the society. His first book named “PRARNKAVYA” was inaugurated by Bharat Ratna Shri Bismillah Khan Saheb. Ms. Rashmi Chhazed, a young and enthusiastic person symbolizes how an ideal youth of today should pursue their passions by putting in their best. She is a great source of inspiration; encouraging people to help themselves through their own understanding and improve each day through self observations. All the proceeds from the book shall be utilized for a social cause. A strong sense of spiritual upliftment, miracles and energy can be felt through the entire journey of Maha by living his experiences within. Since books are the best way of getting closer to one’s inner self, this book is a perfect example for such cause. काशी मरणान्मुक्ति तो एसी स्थिति है जो किसी अज्ञात गुफा में छिपी बैठी है और किसी किसी के लिए वह वहाँ से निकल, स्वप्रकाश में अभिव्यक्त हो उठती है| - काशी मरणान्मुक्ति",
  "genres": [],
  "author": "Manoj Thakkar",
  "average_rating": "4.61",
  "url": "https://www.goodreads.com/book/show/10640448-k-mara-nmukti"
}