{
  "title": "Bloodlust: A Gladiator's Tale",
  "description": "He strove for freedom. She fought for glory. Together, they are unstoppable.In the Domains of the Chosen, magic is power.For Gavin, this power comes with a heavy price. Those with magic are seen as living weapons of mass-destruction that must be controlled at all costs, due to their role in the Reckoning, an apocalyptic war that still scars the land. To keep his magic, Gavin must take up the path of the Gladiator, and earn his freedom by fighting for the bloodthirsty crowds that both adore and abhor his kind. It is a harsh life, but those favoured few who become champions have a chance to join the ranks of the immortal and exalted Chosen. Idealistic Gavin struggles with the brutal realities of the arena, wondering if he even has a chance at glory.Meeting Sadira, a peerless Gladiatrix who has already caught the eye of the Chosen, changes everything. Bold, deadly, and exciting, she sees greatness in Gavin and joins her destiny to his. This unlikely pair forms the nexus of a team of Gladiators destined for greatness. Together they will shed their blood, challenge nightmarish monsters, and strive to survive the deadly trials of the Great Games. And yet, none of this could prepare them for the challenges that await them outside the arena, where powerful forces seek to control those who would become champions. If they are to survive and prosper, they must do so by writing their fortunes in the sand of the arena with blood, spell and steel!But what price victory?About BloodlustBloodlust is an epic action-oriented fantasy series with elements of romance, coming of age, sports, and political intrigue.Bloodlust takes place in a world that has been devastated by a terrible war between magic-users (called the Gifted), and the uncontrolled wild magic that was released as a result. Even more than a thousand years later, the fallout from this wild magic still taints the land. The only (known) civilization to withstand this conflict was the city of Krass, where the surviving Gifted made a deal with the people of the city in exchange for shelter.Bloodlust: A Gladiator's Tale is my first novel, and the first book in the series. The art is done by a friend (Daniel barclay) and the Editing by myself, my parents, and friends. Although quite a bit of time was spent editing and formatting, it might not meet the expectations of some discriminating readers, so do read the sample chapters before buying.The first chapter starts off a little slow/unusual, but the changes to a more familiar style quickly.Each chapter centres around a match in the main character's career in the arena, which gives the book a unique structure but may offend some traditionalists.More information can be found on my Bloodlust blog -- DomainsOfTheChosen@wordpress.com",
  "genres": [
    "Fantasy"
  ],
  "author": "C.P.D. Harris",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/16095295-bloodlust"
}