{
  "title": "Lynyrd Skynyrd: Remembering the Free Birds of Southern Rock",
  "description": "The first complete, unvarnished history of Southern rock’s legendary and most popular band, from its members’ hardscrabble boyhoods in Jacksonville, Florida and their rise to worldwide fame to the tragic plane crash that killed the founder and the band’s rise again from the ashes.In the summer of 1964 Jacksonville, Florida teenager Ronnie Van Zant and some of his friends hatched the idea of forming a band to play covers of the Rolling Stones, Beatles, Yardbirds and the country and blues-rock music they had grown to love. Naming their band after Leonard Skinner, the gym teacher at Robert E. Lee Senior High School who constantly badgered the long-haired aspiring musicians to get haircuts, they were soon playing gigs at parties, and bars throughout the South. During the next decade Lynyrd Skynyrd grew into the most critically acclaimed and commercially successful of the rock bands to emerge from the South since the Allman Brothers. Their hits “Free Bird” and “Sweet Home Alabama” became classics. Then, at the height of its popularlity in 1977, the band was struck with tragedy --a plane crash that killed Ronnie Van Zant and two other band members.Lynyrd Remembering the Free Birds of Southern Rock is an intimate chronicle of the band from its earliest days through the plane crash and its aftermath, to its rebirth and current status as an enduring cult favorite. From his behind-the-scenes perspective as Ronnie Van Zant’s lifelong friend and frequent member of the band’s entourage who was also aboard the plane on that fateful flight, Gene Odom reveals the unique synthesis of blues/country rock and songwriting talent, relentless drive, rebellious Southern swagger and down-to-earth sensibility that brought the band together and made it a defining and hugely popular Southern rock band -- as well as the destructive forces that tore it apart. Illustrated throughout with rare photos, Odom traces the band’s rise to fame and shares personal stories that bring to life the band’s journey.For the fans who have purchased a cumulative 35 million copies of Lynyrd Skynyrd’s albums and continue to pack concerts today, Lynyrd Skynyrd is a celebration of an immortal American band.",
  "genres": [
    "Music",
    "Nonfiction",
    "Biography",
    "History"
  ],
  "author": "Gene Odom",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/1064057.Lynyrd_Skynyrd"
}