{
  "title": "Nearly True",
  "description": "It's 1938, post-Depression, pre-WWII Catholic Queens, NY. Ten year old Kenneth Cadogan leads silent film star Clara Bow, a deranged WWI veteran who’s obsessed with the actress, and his gang of friends who pretend to be cowboy heroes, in a search for missing television stock certificates. Kenneth also tries to solve the mystery of his father's disappearance after swimming in plain view of his son and his wife. Poking around in his father’s haunts in their neighborhood, Kenneth uncovers mysteries about his father’s life and marriage and demons. The search spreads to lower Manhattan and the Hoovervilles of Hoboken and Jersey City, culminating in the 1939 World’s Fair in Flushing Meadow, a monumental technology showcase when television was first displayed to the mass public, and where surprises and missed chances compound the mystery. \"What do Clara Bow, the World’s Fair, a shell-shocked WW1 veteran, and a father who walks into the ocean at Astoria Point one hot summer night in 1938 have to do with each other? Maybe nothing. Unless of course, you’ve entered the mordant whimsy of a Sean Enright novel. Nearly True tells the story of one boy’s passage from the make-believe of childhood, to the half-glimpsed, half-understood mysteries of adulthood as he comes to terms with his father’s disappearance. Enright is a master at capturing the tipping point of innocence, when the particular, heartbreaking way a child sees and then, refashions his world shows us more about what we have lost than we could imagine.\" Sarah Blake, New York Times best-selling author of The Postmistress. \"In the summer of 1938, a man goes for a swim in Turtle Bay in Queens and vanishes. This is the riveting mystery that propels Nearly True, an expansive, compassionate novel that is also the portrait of a boy and a country on the cusp of transformation. In search of his missing father, Kenneth Cadogan eavesdrops on the adult world and encounters an historical moment rife with venom, celebrity, shattering loss, and miraculous invention, including Radio Priest Father Coughlin, Clara Bow, the Hoovervilles, and the 1939 World’s Fair where television was born. In Kenneth, Sean Enright has given us a character as poignant and yearning as the era he describes.\" Maud Casey, author of Genealogy, a New York Times Editor's Choice Book \"You won’t soon forget Kenneth Cadogan, the character at the center of Sean Enright’s terrific new novel Nearly True. Set against the backdrop of the 1939 World’s Fair, Enright’s tale is a rollicking, riveting drama of an Irish family’s struggles in late Depression-era Queens and one boy’s heart-breaking quest to solve the puzzle of his father’s disappearance. Reminiscent of the works of Alice McDermott and E.L. Doctorow, Nearly True limns the joys and sorrows of the American immigrant experience with exuberant irreverence and wit. The result is a masterly portrait of familial love and sacrifice.\" Kate Walbert, author of A Short History of Women and the National Book Award nominee Our Kind",
  "genres": [],
  "author": "Sean  Enright",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/16095929-nearly-true"
}