{
  "title": "Soldat de la paix",
  "description": "David, qui a toujours rêvé de devenir soldat de la paix, a été admis à Éden, le seul collège de la Communauté des planètes (C.P.) sur Terre.Le maître qui a admis David et qui doit superviser son apprentissage à Éden se nomme Greg Ars. À demi Terrien à demi Darumien, maître Arsh est aussi télépathe. On dit de lui qu'il est l'un des maîtres les plus exigeants de tous ceux des différents collèges de la C.P. sur les planètes qui en font partie.Pour accepter définitivement David, maître Arsh lui a demandé de devenir l'ami de Jonathan, un jeune homme que David a maltraité pendant une année entière lorsqu'il était plus jeune.Ce deuxième tome de « Pas de paradis sans… l’enfer » raconte la rencontre de Jonathan et de David, et les efforts de ce dernier pour gagner le pardon et l'amitié du premier. Nous y voyons aussi David faire ses premiers et difficiles pas à Éden sous la tutelle de Greg Arsh.-------------------------------------------------------------NOTE SUR LA COMMUNAUTÉ DES PLANÈTES : Elle est une puissante collectivité née de la fusion d’organismes humanitaires et d’organisations de sécurité interplanétaire, mais aussi de groupements sociaux, économiques et culturels de nombreuses planètes. Elle dispose sur ces planètes de vastes territoires où elle a acquis le statut d’autorité souveraine. Sa mission est de même nature que celle des organismes fondateurs. On la verra, par exemple, porter assistance aux populations lors de cataclysmes, famines, pandémies et guerres, lutter contre l’oppression, soutenir les gouvernements et souvent même des associations indépendantes dans la réalisation de divers projets d’importance (alphabétisation de vastes populations, exploration de nouvelles planètes, etc.) et, bien sûr, former dans des collèges comme Éden jeunes et moins jeunes pour la réalisation de toutes ces tâches.",
  "genres": [
    "BDSM"
  ],
  "author": "Danielle Tremblay",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/16096003-soldat-de-la-paix"
}