{
  "title": "Finding Tranquility Base",
  "description": "When a young girl’s family in west Texas is torn apart by tragedy, she takes a volunteer position at the local VA hospital to escape the suffering that has enveloped her home. As a shocking truth threatens to tear the town apart, she falls for a convalescing GI and together they discover the healing power of love. A suspenseful and touching metaphor for the turmoil of the Vietnam War, Janet Rebhan’s debut captures the flavor of small town Texas life with the visceral understanding of Larry McMurtry’s Last Picture Show and the soul of Billie Letts’ Where the Heart Is. Sixteen year-old Riley Pritchard’s family is altered forever when a tornado destroys her home and triggers a series of dramatic events. When the ultimate tragedy punctuates their decimated lives, each family member, from her beautiful, self-centered mother and hardworking, sentimental father to her kick-ass, air-headed older brother, grieves alone, isolated in a suffocating sadness.In a desperate attempt to extricate herself from the pain and sorrow of a home where the walls seem to be closing in tighter every day, Riley volunteers at the local Veterans Administration hospital. There she meets Johnny, a young soldier and survivor of a helicopter crash in Vietnam who has returned home with severe burns covering the lower half of his body. Together they begin to discover the redemptive and healing power of love. A moving coming of age story about finding inner peace and fulfillment in the face of heartbreak and loss, Rebhan delivers a nuanced, captivating portrayal of blossoming adulthood. Showing remarkable felicity for time and place, she imbues her novel with the numbing desolation of west Texas as she explores the themes of self-reliance, self-preservation, and strength amidst adversity. As engaging as it is entertaining, Finding Tranquility Base is a thought-provoking, inspiring story that will change the way you view the world all over again.",
  "genres": [],
  "author": "Janet Rebhan",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/16095991-finding-tranquility-base"
}