{
  "title": "Our Children Are Watching: 10 Skills for Leading the Next Generation to SUccess",
  "description": "“This may just be one of the most important books you will ever read in your life, important for you and for your children. A positively stunning book, Our Children Are Watching captured both my heart and my mind. It could revolutionize the way we live in the world, and, quite possibly, revolutionize the world itself. Susan Ford Collins shares insights that will help us remember and revitalize our dreams. She speaks of learning to create the life we truly want, a life that serves our deepest selves and brings true success. To her, success is learning to live a life that springs directly from our hearts, a life that nurtures our relationship to our soul and its deepest longings; and, as parents, isn’t this what we all seek to teach our children?Collins’ writing is infused with vitality. In plain, direct language, Collins explains step-by-step the ten skills that lead to success, skills that apply to any situation or any person, whether a child or a CEO.I read hundreds of books every year and I can count on one hand how many books I have ever read that hold the potential to transform lives as deeply as this book does. Without any hesitation, I give Our Children Are Watching my absolute HIGHEST recommendation. Whether you read it for yourself or for your children, it has the power to change your life forever, if you are willing.—Chinaberry Book Service“I learned more from this book in a matter of hours than from all the management, leadership and team-building trainings I’ve taken in 18 years. And it works in my personal life too.”—Carl J. Flood, VP Worldwide Management, American Express “Our Children Are Watching is a book full of hope—a very valuable item.—Michael Fitzsimmons, Producer, The Weekend Today Show “Susan Ford Collins is the quintessential “good mother.” Her experience as a researcher, her warmth and sense of humor all contribute to a wonderful learning experience. Two thumbs up!”—Jerome H. Poliacoff, Ph.D. Child Psychologist“Finally we have a major-league success book written by a woman!” —Karin Klenke, Ph.D., author of Women in Leadership Jepson School of Leadership Studies, University of Richmond",
  "genres": [],
  "author": "Susan Ford Collins",
  "average_rating": "4.89",
  "url": "https://www.goodreads.com/book/show/16096135-our-children-are-watching"
}