{
  "title": "What Lies Beneath",
  "description": "Running parallel to the first five books in the series, this book is a behind the scenes, closer look at some of the characters and events. The Diamond Flux infection sweeps the world, leaving behind Reds who ghoulishly chase and eat those they can, biting the rest to spread the contagion. Survivors use what they have, axes, baseball bats, and hope to battle the undead. As the world changes, even a night of passion can lead to unbelievable terror. Survivors scramble for safety while avoiding both human and inhuman monsters.Full novel in a series that stands out for the characterization and the fact that no character is truly safe; it's the most honest zombie adventure available.The real story of Hannah is finally shared and explains why she is as mysterious as she is. The National Guard Armory fiasco is detailed, Len's background is explained, and a few new character are introduced for book 7. Readers wondered about the Hospital Rescue station and how Alex escaped and finally, we can read how it all went so wrong. For all who have read the first five books, this is a must-read to discover many of the secrets that had remained hidden. Also, enjoy the Z is for Zombie Wiki (with pictures of the characters) at http://zisforzombie.wikia.com/wiki/Z_...and the website at http://www.cattd.com for upcoming events and news about the series.referred to as \"Great series of books! Realistic perils and triumphs. Awesome and believable characters. Would reccomend to every zombie fan! Definite must read!\"\"I really enjoyed this book, mainly because of the great characters! And, when I say characters, I DO mean characters...\"\"This writer here can tell a good story and really knows how to capture the reader's emotions and attention. One last thing is that what sets this book apart from other books is that it relies on its characters and how they cope with the apocalypse, similar to the series: The Walking Dead. This book is far more then JUST a zombie book; In two words this book is: An emotional rollercoaster.\"",
  "genres": [],
  "author": "Catt Dahman",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/16096945-what-lies-beneath"
}