{
  "title": "Juden: Arbeit Macht Frei",
  "description": "Poland 1939. After Nazi Germany conquers the Polish army in just over two weeks, and one Jewish family fight for survival begins. Like the rest of the once thriving Jewish community, they are all forced to leave there beautiful home in Warsaw, and into the slums of the ghettos. Inside these walled cities disease and starvation are rife, which is a daily part of ghetto life. However despite of all the degradation, the family settles into their new surroundings, and they take solace as they remain as a family.After several years of living this life, their world is again thrown into chaos, when orders are received to ‘liquidate’ the ghettos.Isaac and his son Jacob during their ‘normal’ day are rounded up, as are the other families and residences, by the ruthless and barbaric Nazi regime. To Isaac and Jacob’s horror, they helplessly stand and watch as Isaac’s wife Judith, and their baby daughter Eve; are torn away from them, and taken away, into a life of slavery.Isaac and Jacob are also rounded up, their fate already decided, is one of the unknown. After several hours aboard a crammed cattle train, they arrive at their destination. They are now two prisoners amongst thousands of their own people at the Nazi’s most notorious concentration camps, which they now know to be Auschwitz.They are soon put to work, disposing of the countless victims, who have been brutally murdered by the Nazi’s. Although after being a part of the most harrowing and vile operations, Isaac and eventually Jacob are fortunately reprieved, and become part of the commandant personal staff at his attached villa, only a few meters away from the camp itself.Here they meet Mary another Jew, and housekeeper to the commandant Rudolph Höss. All three form a close bond, and perform their duties to the best of their abilities. With the fate of his wife and daughter unknown, Isaac and Jacob concentrate their efforts on appeasing the commandant.It is planned that Jacob uses his knowledge and understanding of accounts, to ‘siphon’ off funds, for the benefit of the commandant. Although inside the villa, things aren't always easy, and each of them suffers severe beatings, at the hands of the commandant. After several months they have receive news that Judith and her daughter Eve are safe, and are being transferred to Auschwitz.Isaac being determined that they should become a family unit once more, uses his influence to persuade the commandant to allow them both to be a part of the staff, therefore reuniting them all as a family again.",
  "genres": [],
  "author": "James  Stephens",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/16097185-juden"
}