{
  "title": "Killing Time",
  "description": "We have all the time in the world...until none exists at all...Eighteen months have passed since Aurélie Segler-DeMarche and her sister, runway model Trésor DeMarche, have spoken to one another. A posh event held at Tavern on the Green changes everything for the hot and happening investigative journalist. Cable News World, Aurélie's own employer and network, reports the famous model has died under mysterious circumstances, locked in a cage in the dungeon of a penthouse on the Upper East Side of Manhattan.Aurélie suspects foul play but when the police department is less forthcoming, she is forced to turn to the one person who might in fact have had something to do with her sister's death, Rory Krieger. Not only is the man sex on a stick but he is also a wealthy, elusive Dom in his early thirties who has kept Trésor as his submissive for the past two years.As Aurélie digs deeper into the world of sadomasochism -- including the community, Club X-Tasy, and the eccentric members she meets -- she finds it harder to control the feelings she has for Rory. Though her first priority is to find out what truly happened to her sister, she loses herself in a world of secrecy, seduction and a path of dark desires she might not be able to resist.Soon, she is wondering how deep is she willing to go to find out the truth and how easy will it be for a woman who prides self-control to give in to another's demands when it goes against the very grain of her personality? Some questions are best left unanswered but Aurélie soon learns the hard way she will have to lose herself to find herself...and the truth.Publisher's Note: This book contains explicit sexual situations, graphic language, and material that some readers may find objectionable: anal play/intercourse, strong BDSM theme and elements.",
  "genres": [
    "BDSM",
    "Erotica",
    "Erotic Romance",
    "Romantic Suspense",
    "Contemporary"
  ],
  "author": "Elle Chardou",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/16098227-killing-time"
}