{
  "title": "Eugene Onegin",
  "description": "Eugene Onegin'But whom to love? To trust and treasure?Who won’t betray us in the end?And who’ll be kind enough to measureOur words and deeds as we intend?’If a single book could be said to represent Russian literature, it is Alexander Pushkin's magnificent novel in verse, Eugene Onegin. First published in full in 1833, it is considered to be the fountainhead of literature in the language. Its fame is international: it has inspired films, television series and a ballet as well as an opera by Tchaikovsky. Pushkin's tour de force is as sparkling, witty and deeply moving today as when it was first written.Onegin, a dashing, cynical and bored nobleman who has taken over his uncle's estate in the country, spurns the love of the shy, bookish Tatyana Larina. But as Eugene's life unravels and Tatyana's blossoms, their roles are transformed. Eugene Onegin moves effortlessly between feeling and frivolity, delicious comedy and desperate sadness.The story's rich emotional range is perfectly conveyed through Pushkin's much-imitated 14-line Onegin stanza. This is also a wonderful portrait of Imperial Russia, from 'the crush, the glitter and the gladness' of St Petersburg balls to the peace of the snow-bound countryside.This Folio Society edition features James E. Falen's highly praised translation, which captures all of Pushkin's spirit and wit as well as the original rhyming scheme. In a new preface, poet and author Elaine Feinstein revisits the extraordinary life of Alexander Pushkin, the great-grandson of an African slave of Peter the Great, who died in a duel while fighting to defend his wife’s honour. Anna and Elena Balbusso have created a series of exquisite illustrations that convey the romance of the story and Onegin’s progress from idleness to tragedy.",
  "genres": [
    "Poetry",
    "Russia",
    "Fiction",
    "Russian Literature",
    "Classics",
    "Literature",
    "19th Century"
  ],
  "author": "Alexander Pushkin",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/16098155-eugene-onegin"
}