{
  "title": "The Abundance Book",
  "description": "The Lazy Way to Riches, Health and HappinessMost People are too Busy Worrying and Earning a Living to Have a LifeThis exciting book will help Rid yourself of stressManifest your dreams into realityRid yourself of fear, which is holding you back from having everything in lifeGet rid of the failure habits that are holding you back in life such as procrastinationRid yourself of worrying and spinningAccess answers from your higher self, instead of being frustrated with old answers or no answersRid yourself of the habit of beating yourself upClear away the years of accumulated confusionHave abundant health, joy and richesBe in total control of your life with easeHarvard and Columbia Universities study validates effectiveness of the Release ProgramHaving this book in your possession is like having an instructor at your beck and call, any time you want an instructor to help you, just open the book up! You will sit back and watch your limitations just fly out without effort on your part - it's that simple.Here's What You'll ReceiveYou'll receive \"The Abundance Book\" which will take you step by step in learning this life changing technique and change your life forever .You will learn in the privacy of your home how to eliminate any and all of life's burdens and obstacles that are in the way of getting what you truly want in life.By practicing these step by step techniques which will take you all the way to a place where you will experience abundance, riches, health and unlimited happiness, and eliminate stress from your life . You will reach the state of abundance ! A most powerful place to be. A place where everything and anything is possible.You'll discover Lester's secret and discover for yourself why it works for everyone.You'll receive power-packed information which details how to uncover your ability.You will receive absolutely FREE , 2 bonus audios! These audios will keep you on the right track... towards unlimited happiness and prosperity.",
  "genres": [
    "Spirituality"
  ],
  "author": "Lawrence Crane",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/106419.The_Abundance_Book"
}