{
  "title": "A Sincere Warning About the Entity in Your Home",
  "description": "\"Dear friend,This is no chain letter, hoax or prank.It is a sincere warning about your home and the entity which dwells within.Your home has been haunted for quite some time.I am sorry that I could not personally deliver this document. I did not even post it myself. The postmark on the envelope will not help you, should you ever attempt to locate me.When this letter is complete, I shall entrust a friend in another country with repackaging and sending it on my behalf. This letter also may or may not have been translated from its original language.You do not know me. You must never know me.Neither do I know you, beyond your name, address and appearance. I have seen you in person but you have not seen me.Think back to the day that you moved into your home. I contrived to casually pass by as you stood outside. I saw your face, but you did not so much as glance my way. I did not stop walking. I simply committed your face to memory and moved on before you became aware of my presence.Why did I want to see you?I suppose my conscience drove me to it. Just as it compels me to finally write this letter.I wanted to see exactly who I was passing the entity on to.\"A NEW CONCEPT IN FEAR...Imagine a supernatural horror story in which the paranormal activity happens within YOUR home. A SINCERE WARNING ABOUT THE ENTITY IN YOUR HOME takes the form of an anonymous letter sent to YOUR address. It details the terrifying events which happened in your home and which continue to this day.You have inherited a curse and are being preyed upon by a bone-chilling apparition. This 10,000-word letter from the previous resident advises you how to cope, while detailing the unthinkable ordeal they suffered before you.A SINCERE WARNING ABOUT THE ENTITY IN YOUR HOME is the ultimate way to scare yourself in your own home, because it's the only ghost story which takes place IN your home. Dare you read it?",
  "genres": [
    "Horror",
    "Short Stories",
    "Fiction",
    "Novella",
    "Paranormal",
    "Ghosts",
    "Supernatural"
  ],
  "author": "Jason Arnopp",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/16099937-a-sincere-warning-about-the-entity-in-your-home"
}