{
  "title": "The Mountain Between Us",
  "description": "9 hours, 57 minutesFrom the author of Where the River Ends, comes this page-turning story of love and survival.On a stormy winter night, two strangers wait for a flight at the Salt Lake City airport.  Ashley Knox is an attractive, successful writer, who is flying East for her much anticipated wedding.  Dr. Ben Payne has just wrapped up a medical conference and is also eager to get back East for a slate of surgeries he has scheduled for the following day.   When the last outgoing flight is cancelled due to a broken de-icer and a forthcoming storm, Ben finds a charter plane that can take him around the storm and drop him in Denver to catch a connection.   And when the pilot says the single engine prop plane can fit one more, if barely, Ben offers the seat to Ashley knowing that she needs to get back just as urgently.   And then the unthinkable happens.  The pilot has a heart attack mid-flight and the plane crashes into the High Uintas Wilderness-- one of the largest stretches of harsh and remote land in the United States.   Ben, who has broken ribs and Ashley, who suffers a terrible leg fracture, along with the pilot's dog, are faced with an incredibly harrowing battle to survive.   Fortunately, Ben is a medical professional and avid climber (and in a lucky break, has his gear from a climb earlier in the week).  With little hope for rescue, he must nurse Ashley back to health and figure out how they are going to get off the mountain, where the temperature hovers in the teens.   Meanwhile, Ashley soon realizes that the very private Ben has some serious emotional wounds to heal as well.  He explains to Ashley that he is separated from his beloved wife, but in a long standing tradition, he faithfully records messages for her on his voice recorder reflecting on their love affair.  As Ashley eavesdrops on Ben's tender words to his estranged wife she comes to fear that when it comes to her own love story, she's just settling.  And what's more: she begins to realize that the man she is really attracted to, the man she may love, is Ben. As the days on the mountains become weeks, their survival become increasingly perilous.  How will they make it out of the wilderness and if they do, how will this experience change them forever? Both a tender and page-turning read, The Mountain Between Us will reaffirm your belief in the power of love to sustain us.From the Hardcover edition.",
  "genres": [
    "Fiction",
    "Romance",
    "Book Club",
    "Contemporary",
    "Audiobook",
    "Survival",
    "Adventure"
  ],
  "author": "Charles Martin",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/10642313-the-mountain-between-us"
}