{
  "title": "Theme Park Erotica",
  "description": "It was my forty eight birthday and the girls were throwing me a party.When Jillian was thirty five we all went to Vegas, which was fun and crazy – but then we were thirty something’s and we could have been crazy anywhere. Think Jillian does Barstow for an example-At our peak ,we said.-Downhill from now on, we said.This would be more sedate, I imagined. Perhaps a little crazy - for the over forties , but not, well crazy crazy.............He leant in and kissed the top of each breast, and then pulled the bustier down to move his mouth over each nipple and just the slightest touch of his teeth, and then the other, and both nipples grew in his mouth.And then his hand slipped down around to my side and undid the bustier, and let it fall to the floor.He moved me back slightly and studied me. Christ was he seeing the flabby stomach and the sinking breasts, with the ridiculously hard nipples, almost out of place on this soft body?-May I he said, and with that he knelt between my legs and pulling my panties aside kissed my sexAnd his mouth and breath were warm on my pussy, and then then his tongue was moving past the guardians of lips and flesh, and moving inside me. My thighs quivered, and I involuntary let my legs open some more.-Now he said , please ,this way, and standing, he took my hand and led my away from the dance floor to a post in the floor, I was walking across polished dance for, in heels, stockings and panties and nothing else, with a beautiful man holding my hand, in this ridiculous musky amatory world. He leant me against the post-Arms please he saidAnd he lifted my arms up into the air, and strapped them into restraints-O my God –this was--Its okay, he said – you’ll seeHe was down at my feet moving my feet apart, wide apart and tying my ankles with restraints, to the floor-NowHe stood back and looked at me. He ran his fingers over my belly button again. Christ I was starting to giggle.Idiot.-Let’s take those panties off completely, he saidHe went to the table and picked up a knife, and turned , showing me the knife, walked back to me............This was: ‘Erotica- The Theme Park – featuring Femdom World, Slave World, Bondage World, Spanking World – and so much more!’ -according to the brochure Jillian and Rebecca handed me with great fanfare the next day.-Happy Birthday",
  "genres": [
    "BDSM",
    "Erotica"
  ],
  "author": "Germaine Gibson",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/16100255-theme-park-erotica"
}