{
  "title": "Erotic Women's Journals - the first three books",
  "description": "INCLUDES: PAYBACK,ONE SEXUAL SEASON & SENSATION AND MAGICCUSTOMER REVIEWS OF THE INDIVIDUAL BOOKS IN THIS VOLUME\"This is erotica at its best, with a story told as if the reader was there, first hand experiencing the events.. Or at least, that is how it felt for me, when I read this \"woman's erotic journey through Submission and Mastery.\"If you want a erotic story written as dirty as it can be, then this is not your story, as the author has carefully crafted each of the 7 chapters with words that not only tell more than their initial meaning, but also leave behind a feeling desire that you have missed something you wanted to be part of.\" Fred“ It makes you feel like running into your room, into your bed. ” I_am_Ysabelle“ Yes, it's a season of sex and lust found in this book. ” alone0615!“ This book has emotion, it feels, explains and understand women and sex. ” Harper Lavelle'Amazingly, the author had made each scene so real and natural. It's as if you're watching a movie on the wide screen. The cycle is like; you read, imagine, and then read it over and over again. It's not that you don't understand the story but because it's so erotic and flirty than you could loose yourself.:))'\"I am amazed and seduced\", mark31 \"markH\"\"A friend set me this book for a second opinion, she loved it, and wanted a male perspective on a woman's obvious viewpoint. I have no experience with women's erotica - but I know great writing when I read it. The language, certainly sexual and vivid, also at times is, in my opinion quite beautiful\"This One Volume Compilation of my first Three Stories – Payback, One Sexual Season and Sensation and Magic allows the reader to follow the first of my three erotic adventures – almost for the price of one.I am very pleased with these stories, and certainly enjoyed, imaging all the scenarios – and then writing them down.All are written from the first person perspective of the woman herself. The interior (and exterior monologue) of how she is experiencing these ‘adventures’. I enjoyed being able to use the interior voice as it allows a greater freedom both in the writing, the descriptions, and the ability to enlarge the image, as it were, of what is actually happening to her, or what she is causing to happen.As more than a few people have pointed out the interior monologue is not used to create massive backstory and or justification – I have tried as much as possible to keep everything – in the moment. So we feel as she feels, we experience as she experiences. At least that is the intention. Allowing us the readers to truly be ‘in the action’.",
  "genres": [],
  "author": "Germaine Gibson",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/16100494-erotic-women-s-journals---the-first-three-books"
}