{
  "title": "The Universe in the Rearview Mirror: How Hidden Symmetries Shape Reality",
  "description": "A physicist speeds across space, time and everything in between showing that our elegant universe—from the Higgs boson to antimatter to the most massive group of galaxies—is shaped by hidden symmetries that have driven all our recent discoveries about the universe and all the ones to come. Why is the sky dark at night? Is it possible to build a shrink-ray gun? If there is antimatter, can there be antipeople? Why are past, present, and future our only options? Are time and space like a butterfly's wings?No one but Dave Goldberg, the coolest nerd physicist on the planet, could give a hyper drive tour of the universe like this one. Not only does he answer the questions your stoner friends came up with in college, but he also reveals the most profound discoveries of physics with infectious, Carl Sagan–like enthusiasm and accessibility.Goldberg’s narrative is populated with giants from the history of physics, and the biggest turns out to be an unsung genius and Nazi holocaust escapee named Emmy Noether—the other Einstein. She was unrecognized, even unpaid, throughout most of her career simply because she was a woman. Nevertheless, her theorem relating conservation laws to symmetries is widely regarded to be as important as Einstein’s notion of the speed of light. Einstein himself said she was “the most significant creative mathematical genius thus far produced since the higher education of women began.”Symmetry is the unsung great idea behind all the big physics of the last one hundred years—and what lies ahead. In this book, Goldberg makes mindbending science not just comprehensible but gripping. Fasten your seat belt.",
  "genres": [
    "Science",
    "Nonfiction",
    "Physics",
    "Audiobook",
    "Popular Science",
    "History",
    "Mathematics"
  ],
  "author": "Dave Goldberg",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/16101087-the-universe-in-the-rearview-mirror"
}