{
  "title": "The Crocodile",
  "description": "This is Naples as you’ve never seen it before. A chaotic, shadowy city full of ominous echoes and dark alleyways where each inhabitant seems too absorbed by his or her own problems to give a damn about anybody else. And that is exactly what makes it possible for a cold, methodical killer to commit his atrocious crimes largely undisturbed, to merge with the crowd as if he were invisible. The newspapers call him “The Crocodile” because, like a crocodile, when he devours his own children, he cries. And like a crocodile he is a perfect killing machine: he waits and watches until his prey is within range, and then he strikes. Three young people with very diverse backgrounds have been found murdered in three different neighborhoods, each shot with a single bullet, execution style. While his colleagues see little or no connection, Inspector Giuseppe Lojacono, smells a rat. He is driven by his instincts and his own troubled recent history. He has just been transferred to Naples from Sicily where a Mafioso-turned-informant accused him of leaking sensitive information to the mob. Once an estimated member of the mobile unit of the Agrigento police force, Lojacono has lost everything, first and foremost the love of his wife and daughter. But now he’s been given a second chance and a shot at clearing his name. A young magistrate, the beautiful Laura Piras, wants him in Naples. She’s heard of his preternatural skills and his incredible powers of observation and she thinks a man like him is needed in Naples. So it is that Inspector Lojacono is charged with finding the link between the three dead bodies. At the root of these murders, he will discover, is a pain that still burns, a sense of guilt than cannot be purged, and one all-consuming love.",
  "genres": [
    "Mystery",
    "Fiction",
    "Crime",
    "Italy",
    "Thriller",
    "Italian Literature",
    "Noir"
  ],
  "author": "Maurizio de Giovanni",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/16101191-the-crocodile"
}