{
  "title": "Deep shit, Arkansas",
  "description": "Deep shit, Arkansas er en liten (i omfang) roman om de store (i omfang) spørsmål. Den er forma som et filmmanus og en roadmovie hvor vi følger en navnløs norsk jente tidlig i tjueåra, ikke helt ulik forfatteren selv, på tur fra Oslo til Mammoth Spring, Arkansas og tilbake. I USA besøker hun besteforeldrene sine, et kristenkonservativt par som lever veldig annerledes fra det hun gjør, og som har andre svar på spørsmålene hennes enn det hun har rukket å bli vant til. Og hele tida har hun mayakalenderen (som løper til 21. desember 2012) i bakhodet. Skal alt ta slutt da? Hvis ja, har det vi gjør nå noen mening? Hvem slår av lyset? Og hva skjer etterpå?Victoria Durnak (f. 1989) debuterte i 2010 med diktsamlinga Stockholm sier, fulgt opp samme år av boksingelen Så Berlin. Dette er hennes første roman.——Ext. Amargosa, Black Rock, sentrale Nevada, Mojave – dagTO JENTER er på vei vestover. Høye, brunrøde fjell, smalere på toppen. Route 66, svart-hvitt, Bobby Troup med lakksko, Dave Gahan på motorsykkel. Mot valmuer, solsikker, frodig skog, tømmer, rutete fleecejakker, Caterpillar-sko, sykkelpoliti og små, små kiosker formet som pølsebrød, kjeks, vafler. Som alle andre vil de til kysten. De hører på radio, spiller musikk fra en kassettspiller, har en kabel fra iPoden til høyttalerne. Jentene vender seg bakover, hyler. Strekker hendene i været, har (selvfølgelig) en kabriolet, kommenterer at de lukter svette, ler høyt, hyler mer og legger ned setene. Albuene utenfor kanten, føttene utenfor kanten, skjerf rundt hodet, solbriller som ikke matcher.Nei, forresten –——«Victoria Durnaks tekster er usedvanlig spenstige, sjarmerende og talentfulle. I motsetning til dikter-jeget virker ikke Durnak redd for å gi seg i kast med noe som helst. Det lover godt.»– Sigmund Jensen, Stavanger Aftenblad«Good shit, Durnak! (Hun) har kort og godt skrevet det beste Flamme Forlag har utgitt på svært lenge.»– Axel M.K. Hærland, Universitas«Til tross for at den korte romanen er full av referanser til alt fra Disney til Deleuze, flyter Deep shit, Arkansas fint av sted enten hovedpersonen befinner seg i Oslo, USA eller i et svart hull.»– Ellef Prestsæter, Klassekampen«Lesningen føles som en roadtrip.»– Erle Marie Sørheim, Dagbladet(http://www.flammeforlag.no/katalog/f96/)",
  "genres": [
    "Novels"
  ],
  "author": "Victoria Durnak",
  "average_rating": "3.08",
  "url": "https://www.goodreads.com/book/show/16101682-deep-shit-arkansas"
}