{
  "title": "A Corruption of Souls",
  "description": "\"A knight’s oath isn’t something that should be given lightly.\"Deklyn Delonir , Captain of the Order of the Redemptor and Knight of the Hawkeron Kingdom, has spent his entire life serving his goddess and realm to earn redemption for his past sins. Everything he does is in service to his King and the people under his protection and leadership. For his entire life, Deklyn pushed away the deepest desires of his heart, burying them and praying that they never come to the surface. When his King calls on him for the most important job of his career, one that would put an end to a war against an unknown enemy simply called The Corrupted, Deklyn doesn’t think twice before readily accepting it. Once the job is completed, the war will end and the people Deklyn swore an oath to serve will be safe and the bloodshed will end. Crown Prince Kai of Hawkeron has never known what freedom feels like. Everything has been lain before him before he was born. Swayed by the whims of a fate outside of his control and duty that is inescapable, Kai doesn’t know who he is. Kai is a political entity, used for his father’s gain. When his father calls on him to fulfill his duty as the Crown Prince, Kai knows he is defeated. He will be sent to a neighboring kingdom to marry its princess to create an alliance that will provide his father’s military with the resources needed to put an end to the war they waged against The Corrupted. Knowing that his failure to complete his duty would lead to the deaths of many people and the annihilation of the Hawkeron Empire, Kai resigns himself to his fate. As Deklyn and Kai travel together, they quickly learn that through the struggles they face and the desires that come to the surface, they are more than their duty. As secrets about The Corrupted come to light, they must come to terms with their fate while grappling with the very real fact that they are falling for each other. With the fate of their homeland in the balance, Deklyn and Kai must choose between duty and desire.",
  "genres": [
    "Fantasy",
    "Queer",
    "LGBT",
    "Romance",
    "High Fantasy",
    "Adult",
    "Fantasy Romance"
  ],
  "author": "Taylor   Hubbard",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/161024418-a-corruption-of-souls"
}