{
  "title": "Pleasing the Colonel",
  "description": "Trapped in a crevice after a carriage accident, Amanda Downy is not sure whether she'll ever see the light of day again. With her tongue loosened by a fellow passenger's flask of brandy, she reveals several well-guarded secrets about her life as a governess at Colonel Watson's residence, including the fact that she falsified her references to gain her employment.The next morning Amanda is horrified when she finds that the passenger who saved her life after the carriage crash is sitting at the breakfast table at Colonel Watson’s estate, and it appears that he is the long-absent Colonel himself! Amanda is certain that she will be immediately dismissed, but the Colonel has a different sort of discipline in mind for her…The Colonel soon learns that in spite of the deceitful manner with which she obtained the position, Miss Downy is an excellent governess and is much loved by his children. After a firm dose of the leather strap on her bare bottom, he lets her know that she may keep her position as long as she is truthful with him in the future. As time passes, though, the Colonel finds himself thinking of Amanda as he has not thought about any woman since his beloved wife passed away. Though he has no intention of ever marrying again, he cannot deny his growing need for her.Amanda has a longstanding dislike for stiff military men, yet she warms to the Colonel, discovering that underneath his gruff exterior he is kind and generous. As she wonders if the attraction is mutual, another suitor makes his interest known. Should she accept his offer? Or should she wait to see if the Colonel will ever make his move?This book contains sexual scenes and spankings, including domestic discipline in a historical setting. If such material offends you, please do not buy this book!",
  "genres": [
    "Romance",
    "Historical",
    "Historical Romance",
    "BDSM",
    "Erotica",
    "Regency",
    "Historical Fiction"
  ],
  "author": "Renee Rose",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/16102716-pleasing-the-colonel"
}