{
  "title": "The Second Daughter",
  "description": "Winner HONORABLE MENTION New England Book Festival!You try turning out all right after you overhear your mother wishing you hadn’t been born. It had started out well. Umbrellas tangled. A storybook romance followed. A wonderful wedding. A beautiful, sweet first daughter. They were complete, a family, happy. And then they went and had another daughter. Her charming and witty fraud of a father Theodore starts disappearing, then worse, coming back. Her once allegedly sweet older sister Regina angrily resents her, and the sisters are at constant war. Her poor harried mother Helen is so busy what-iffing about the life she might have had that she overlooks the life she is actually having. Everyone blames younger daughter Debra for pretty much everything as the family slowly, then quickly, then one day explosively disintegrates. Along the way there are secrets and lies, heartbreaks and betrayals, plus the dramatic unexpected death of a central character at a pivotal moment. Debra, now a young woman, finds herself living awkwardly alone with her embittered mother when the phone rings—and her mother’s secret past suddenly crashes back into the present. Their life may be about to change forever; or rather, perhaps, revert back to what it should have been all along. But not exactly because of that phone call, as it turns out. Because of the remarkable second daughter. For what Debra Gale has is unyielding determination. What she has is an irrepressible capacity to love.  And now at last what she has is a chance. The complex dynamics of a changing family. Mother, daughters, sisters, and the father who both divides and unifies them. That dramatic unexpected death, plus a fair amount of banana cream pie. Welcome to The Second Daughter: a funny but poignant, unusual but beautiful love story.",
  "genres": [
    "Family",
    "Fiction",
    "Coming Of Age"
  ],
  "author": "J. Jeffrey",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/16102502-the-second-daughter"
}