{
  "title": "Love You Forever Only In That Way",
  "description": "Saurabh presents interesting insights into the lives and thoughts of the millennial generation   -International Business Times (New York, US) Saurabh... life-transforming and outstandingly suspenseful plotline can well pull him to the league of International Bestselling Authors across the globe   -Homeshop18.com(India's Famous Online Shopping Store)People say- Love is tied to our fate. And that fate is something beyond our command, that fate is not our own... Is it so? Did you ever find this endlessly complex truth of love and fate, so intricately linked? This story unravels all these questions... TRUE STORY OF A LIFE, WHOM LOVE TURNED INTO A LEGEND... Sid is a world-class duffer embraced by love from all sides, yet misses love in his selfish life. Carefree Sid, never really caring for anyone, sees a terrifying nightmare of unrecognizable girl sinking deep into the ocean. Who is this girl? How is her destiny connected to him?Dragged suddenly to the twisted fate, by love as well as circumstances, Sid is stunned to find a hidden truth – a truth that can destroy his own life and many lives connected to him, or much worse, various lives across the globe. With every dying second of his life, will he fight back the clock, mend the broken bonds, and unfold the deceptively simple truth of love and life to all?Love is said to destroy evil. What your saviour love turns out to be your destroyer and darkens your fate? Will you be able to solve this endlessly complex truth of love and fate? Who will make you brave enough to see where fate lives? Fasten your seatbelts for a convoluted sky-ride fuelled by hilarious friendship, cute love, enmity, unacceptable deceit and lies, and the most important- twisted life.Sample Chapter- http://www.scribd.com/AuthorSaurabhto know more- http://en.wikipedia.org/wiki/Saurabh_...",
  "genres": [],
  "author": "Saurabh Dudeja",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/16103764-love-you-forever-only-in-that-way"
}