{
  "title": "Zombie Apocalypse 2012: A Political Horror Story",
  "description": "Zombie/Apocalypse 2012: A Political Horror Story is a zombie tale with a political background story -- not from a left- or right-minded perspective, but from that of an average American who feels left behind by the system. It is the tale of a regular guy -- an unemployed factory worker -- in the first days of the end of the world, a time in which the ways of doing things have become muddled between pre- and post-apocalypse. It may not be too late to save humanity, but any progress that is made gets sidetracked by the failings of the media and politicians, religious fanatics, left-wing zealots, right-wing zealots, political correctness, and bureaucracy. Will divisiveness and the failed policies of our past doom us in the future? Yes, but at least there will be some laughs along the way.I've always been a huge fan of the horror genre and the zombie sub-genre in particular. However, one thing always bothered me about zombie films. I believed that if such events were to take place, government agencies would step in and contain the situation before it reached apocalyptic proportions. After paying a little closer attention to politics in recent years, I now wonder how my garbage gets collected every week. The idea for this story occured to me as I watched a congressman argue that cuts needed to be made in some program (Social Security or N.P.R. or something along those lines) in order to fund aid to a community that had been devastated by a natural disaster. I wondered what he would do if the dead began to rise. I set out to write a short story with this idea in my head (I've written quite a few, and may publish a collection of them next) but just couldn't ever seem to stop writing.Zombie/Apocalypse 2012: A Political Horror Story is 280 pages long. It contains a decent amount of carnage, a few curse words, and some innuendo, but no sex.",
  "genres": [
    "Zombies",
    "Horror",
    "Fiction"
  ],
  "author": "Ian  McClellan",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/16104272-zombie-apocalypse-2012"
}