{
  "title": "New Zealand",
  "description": "This is book eight of an eighty part series. ***Books one through seven are currently available individually and books one through five are available in a complete collection***Morgan Holland is a beautiful, young, waitress who has struggled to find her way in life. Unlucky in love and unsure about her future, she has a chance meeting with someone who offers to change her life. In book eight, Morgan spends a few days with Tanner, the sexy man from down under, (I'm sure we all know how that goes) then she ventures over to New Zealand to meet her next client. Aiden has second thoughts about using Julianne's service, but when she books an early flight for Morgan, he doesn't have a choice. After he sees the beautiful blonde, will she be able to convince him to stay?Excerpt:“I live just outside of Auckland, on a farm.” That was all he said, and Morgan was ready to slide over and ask him to spell farm with his tongue all over her... “Have you ever been to Auckland?”“No, I've never even been to New Zealand, but I always wanted to.” She realized that she had been squeezing the life from her fingers, and wondered how long she had been strangling her own hands.*****Special Note to readers*****Morgan is a high-end call girl. Her clients are gorgeous, wealthy and they know how to please a woman. This contains hot, super hot, boiling lava hot, scenes! Here's what's not going to happen: They gazed at each other longingly, desire filling them to the core. She blushed and offered her hand to his. With her head hung low, the two retreated to the bedroom for some adult time. Here's what will happen: Oh, just kidding, I can't write that here! What are you waiting for??? Click the button and follow Morgan as she goes around the world in 80 men.This is a novella, with a word count over 27,000. Enjoy!",
  "genres": [
    "Erotica"
  ],
  "author": "Brandi Ratliff",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/16104743-new-zealand"
}