{
  "title": "حوارات الموتى",
  "description": "الكتاب مثل نقلة نوعية في كتابة التاريخ عبر حوار بمنطق العصر الحديث مع عدد عشر شخصيات وأحداث أحدثها باشا مصر محمد علي وأقدمها اسكندر المقدوني، مرورا بمعاوية بن ابي سفيان ومارتن لوثر ونابليون بونابرت والخليفة العباسي ابو العباس ومترنيخ وهوراشيو نلسون وخالد بن الوليد مرورا بعام 1492م الذي شهد سقوط غرناطة وفي نفس العام شهدت رحلات كريستو با اكولون (كريستوفر كولومبس) لاكتشاف الأمريكتين والعالم الجديد وتدور فكرة الكتاب لاستخلاص العبر من التاريخ والقاسم المشترك بين حوارات الكتاب أنها تدور مع رجال دولة.. والفكرة التي يسعي الكتاب لتشكيلها هي قضية الشرعية، وكما دون الاديب جمال الغيطاني عن الكتاب انه كتاب تتضافر فيه الصحافة بالادب. والبحث العلمي التاريخي بالإبداع بالخيال الخلاق الجميل، وأنه من أندر الحوارات التي يضمها الكتاب والتي قرأتها في مساري الطويل ذلك الذي اجراه مع عام، مع سنة ذهب المؤلف إلي القرون الوسطي ليحاور عام 1492 ميلاديا العام الذي وصل فيه كريستوفر كولومبس إلي أمريكا والذي خرج فيه العرب من الاندلس، عام فاصل حاسم.. الفكرة في حد ذاتها ابداع موح وجميل تحية للاديب محمد البدري الذي ابدع هذا العمل الجميل. بهذه الكلمات للاديب جمال الغيطاني لم اجد اروع منها في تقديم الكتاب.. واقتطف سطورا من مقدمة الكاتب لكتابه.. دعوته لله عز وجل أن يجعل من هذه الحوارات أداة للتعبير عن فكرة صناعة التاريخ، وأن يجعلها اداة لصناعة الحاضر والمستقبل.. وأنه آثر أن يكون موضوعيا فإن لم يستطع في بعض الأحيان فهذا لأنه انسان وله مشاعر ورأي وهي عناصر حاول تجسيدها قدر المستطاع، ومن الملامح الإنسانية في الندوة الحضور العائلي لأسرة الكاتب واعتزازه بدور والدته وزوجته وابنائه واساتذته في الحياة الاكاديمية والمهنية كأحد أبناء السلك الدبلوماسي والكتاب من نوع القطع الصغير ويقع بين طيات 223 صفحة، وان المتصفح للكتاب يشعر ويعيش رحلة مع الماضي السحيق مستفيدا من دروسه في الحاضر وأن القارئ يحاور شخصيات الكتاب بلقب (أنا).. أنه خطوة جديدة علي طريق قراءة التاريخ بحوارات مع صناع التاريخ ويمثل اضافة إلي المكتبة العربية.",
  "genres": [
    "History"
  ],
  "author": "محمد عبد الستار البدري",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/16104633"
}