{
  "title": "Florida",
  "description": "This is book ten of an eighty part series. Morgan spends the holiday with Julianne and confronts the woman about her past. Does Julianne remember? Then, Morgan meets her new client in Miami. She soon discovers the man might be too much for her to handle. Excerpt: “Morgan?” He held out flowers for the girl before getting his answer. Of course, she had to be Morgan.“Jake.” His name wasn't a question. She knew it was him and took the flowers and brought them up to her nose. Crisp, white roses. They were as gorgeous as the man himself. “Thank you, that's so nice!” No one had ever brought her flowers before, but the fact he had actually brought her to a new conclusion. New clothes-a suit for that matter-new shoes and flowers? He was new, and his next statement confirmed it.“I...uhm...I wasn't really sure how this all was supposed to go down...” he admitted, still blinding the Morgan with his smile.“Well, you're a boy, and I'm a girl, and we...” “Fair enough, smart ass.” They both laughed and Jake grabbed her bags so they could head outside. “I have a feeling you're going to be trouble,” he told her as they walked into the warm Florida air.*****Special Note to readers*****Morgan is a high-end call girl. Her clients are gorgeous, wealthy and they know how to please a woman. This contains hot, super hot, boiling lava hot, scenes! Here's what's not going to happen: They gazed at each other longingly, desire filling them to the core. She blushed and offered her hand to his. With her head hung low, the two retreated to the bedroom for some adult time. Here's what will happen: Oh, just kidding, I can't write that here! What are you waiting for??? Click the button and follow Morgan as she goes around the world in 80 men.This is a novella, with a word count just under 28,000. Enjoy!",
  "genres": [
    "Erotica"
  ],
  "author": "Brandi Ratliff",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/16104749-florida"
}