{
  "title": "Portugal",
  "description": "This is book twelve of an eighty part series. Morgan heads to Portugal to meet her next client, Carlos. He's new to the system, but not new to the game. The question is, will Morgan play along?Excerpt:He wore a perfectly fitted black suit and Morgan watched as he gruffly adjusted the collar, then run his hand through his shoulder length hair. She also noticed the long sigh that came afterward as his eyes scanned the room. Morgan turned quickly so he wouldn't see her staring and waited for her luggage to get closer. He looks...bothered? Angry? Oh, I don't think I want to do this...“You're mine, right?” Mine? The quick question came from behind her, right behind her, and she turned around to see her client staring down at her, almost expressionless. “Uh, I'm Morgan. You're Carlos, right?' She smiled nervously, extending her hand for a formal shake.“These yours?” His thick accent made it hard to understand at first, but then she nodded when she realized he was pointing at her bags. “Good, let's go.” Without looking at her again, Carlos grabbed her bags and started walking in the opposite direction.“Sure, I'd love to join you. Oh, you're pleased to meet me? How nice of you to not say.” She kept her eyes on his back that was nearly fifteen feet ahead of her as she had a quiet conversation with herself. “What's that? You're a total asshole who is going to treat me like a....” Whore. Her playful chatter to herself ended with her own reminder of what her job really was. Her mind flashed to her previous clients, all of them like photographs being handed to her memory, one after another. Not one of them treated her like a, well, that word that she wouldn't speak out loud. I knew I would get one eventually. They don't all want to be your friend, Morgan. Just do your freaking job and get out of here.*****Special Note to readers*****Morgan is a high-end call girl. Her clients are gorgeous, wealthy and they know how to please a woman. This contains hot, super hot, boiling lava hot, scenes! Here's what's not going to happen: They gazed at each other longingly, desire filling them to the core. She blushed and offered her hand to his. With her head hung low, the two retreated to the bedroom for some adult time. Here's what will happen: Oh, just kidding, I can't write that here! What are you waiting for??? Click the button and follow Morgan as she goes around the world in 80 men.This is a novella, with a word count just over 29,000. Enjoy!",
  "genres": [],
  "author": "Brandi Ratliff",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/16104751-portugal"
}