{
  "title": "Redwood Pack, Vol. 3",
  "description": "Redwood Pack Volume 3 contains the fourth book in the Redwood Pack series, plus a novella in a print copy and digital form. Enforcer’s Redemption – Redwood Pack Book 3 Adam Jamenson has suffered through the worst loss known to man. The only reason he lives day-to-day is to ensure the safety of his Pack. As the Enforcer of the Redwood Pack, it is his job to protect all in his path, though he was unable to protect the ones he held dear. The war with the Centrals is heating up and Adam must try and grit through it in order to survive. Though the broken man inside of him may not want to…Bay Milton is a werewolf with a past. And a secret. She’s met the Redwood’s Enforcer only once, but it left a lasting effect. Now she needs to find him or everything he had thought he lost, may be lost again.Together, they must struggle and find a way to fight their pasts and present in order to protect their future. But the Centrals have a plan that might make their path one of loss and destruction.Blurred Expectations – Redwood Pack Book 3.5Hannah Jamenson has babies on the brain. It seems that her sisters-in-law are expanding their family in the blink of an eye, but Hannah feels left behind. Every time that little test reads negative a little part of her dies and she feels like her Healing powers are failing her. Her mates, Josh and Reed, are doing everything they can to help her deal with their trials and losses, but they too feel like there is nothing they can do.Just when the lines of what they mean to each other go out of focus, an enemy from Josh’s past is back to prove the things that go bump in the night are real and everything they had held dear is now in jeopardy. In order to fight back and find their way, they’ll need to put everything on the line before they lose it all.Author’s Note: This is a novella set between books 4 and 5 to give you a taste of Reed, Josh, and Hannah. It is best that you have already immersed yourselves in the Redwood Pack world, however even new readers will enjoy a glimpse of the Redwood’s favorite triad.",
  "genres": [
    "Shapeshifters",
    "Paranormal Romance",
    "Romance",
    "Paranormal",
    "Contemporary Romance",
    "Magic",
    "Menage"
  ],
  "author": "Carrie Ann Ryan",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/16107209-redwood-pack-vol-3"
}