{
  "title": "The Salsa Connection",
  "description": "An International romantic thriller from one of Amazon’s bestselling authors.  THE SALSA CONNECTION  When you never give up hopelove will find a wayWhere ever you have to golove will lead youAnd all you have to dois simply--DANCE!  THE SALSA CONNECTION--AN INTERNATIONAL ROMANTIC THRILLER is a 93,000 word romantic thriller that has already won the Royal Palm Literary Award for best thriller. The story moves from the salsa clubs of St. Petersburg, Russia to New York to Louisiana and, finally, to Italy. The red-hot thread of the dance runs through a novel that explores the Russian mob, slavery and prostitution rings, and the art world, as well as love, loss, revenge and the strength of family ties.When Nickolay Panov left St Petersburg, Russia to go to New York City for an international ballet competition 25 years ago, he was considered one of the best ballet dancers in Russia. The Americans say he was murdered. The Russians say he defected. In any case, he never returned. Just before Nickolay disappeared, several priceless paintings and icons from a major museum were stolen. While he was accused of the theft, no solid proof has ever been offered to tie him to it. However, evidence shows that the stolen goods were shipped to America. The CIA and the Russian Government are still pursuing all leads connected to the heist, and so is the Russian mafia.Sveta was three years old when her father disappeared, so it’s a shock when, in the mail, she receives an invitation to a salsa dance competition in New York. At the bottom of the invitation is a “Please come to the competition and enter, my little lady.” No one but her father has ever called her that. Why has her father surfaced after all these years? Sveta wants answers, even if it means entering the late-night, sultry world of salsa dancing in St Petersburg and New York City and coming into uncomfortably close contact with the Russian mob.   Return to the upper right corner to purchase your copy now!",
  "genres": [
    "Romance"
  ],
  "author": "Johnny Ray",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/16107443-the-salsa-connection"
}