{
  "title": "Lessons of Love",
  "description": "Lessons of Love is an old fashion bodice ripper, full of passionate love scenes full of fire, and old fashioned discipline for those who refuse to obey. One with a beautiful, spirited heroine, and a dark, cruel rogue whose heart must be tamed. He takes her as his, and the battle of wills begins. One that has been fought for ages between a man who has no intention of ever feeling love, and a woman who must teach his heart to feel or be forever adrift in a life of cruelty.  In 1842 Louisiana, Jolie Dupree lives an oppressive life ruled by her strict and unloving stepfather. She has the luxuries of plantation life, but feels suffocated under his watchful eye. Fate brings an abrupt change in the form of Cole Jameson, a man full of wealth but short on acceptance into society. He needs the cloak of respectability to hide behind, and silence the rumors of girls gone missing while in his company. His business of selling genteel women to rich men with unsavory tastes, must not be discovered. When he comes upon the lovely Jolie bathing in a secluded glen, he sees in her the answer to his problem. A young bride with an old family name will provide an aura of propriety. She is a girl from a suitable family, but also one who is not loved. She's perfect for his scheme. He carries her home, bound, wet, and almost bare, with a story of saved virtue, and is granted her hand in marriage. Cole is a man who has never loved and has no plans to start. He doesn't give a care for the women whose lives he shatters, but Jolie isn't just any woman. Her beauty bewitches him even as her stubborn will defies him time after time. He weds her with plans to make her an ornament on his arm and a slave in his bed. He will teach her how to please a man with a hard hand and an unfeeling heart.  Will Cole be able to keep his cold heart and continue with his business of white slavery, treating his new wife as cruelly as he does all his captives? Or will Jolie's fiery spirit and beauty break through the ice that surrounds his heart and put an end to his cruel ways?",
  "genres": [
    "Historical Romance",
    "Historical",
    "Erotica",
    "BDSM",
    "Dark"
  ],
  "author": "Jolynn Raymond",
  "average_rating": "3.12",
  "url": "https://www.goodreads.com/book/show/16108030-lessons-of-love"
}