{
  "title": "The Blondness of Honey",
  "description": "He said that love is blind and love is merely a madness. But when Laura Hastings fell in love with Catherine Chadwick in 1893 America, she wasn’t thinking about William Shakespeare. Maybe she should have been...The Blondness of Honey is the story of two women bound by an uncommon love, of one another and life, at a time when the Victorian notions of love and women called for more disciplined and rigorous adherence to traditional relationships. At least publicly.Set mainly in the San Francisco Bay area, including the nearly inaccessible, rugged and hauntingly beautiful Pt. Reyes Peninsula, this is a story of women who came into their own sense of themselves with little historical antecedent referent on which they might pattern their love and their lives. As the dictates of society and their own misunderstandings threaten to derail their impassioned love, Laura Hastings and Catherine Chadwick’s relationship plays out against the uniquely American saga of survival, adventure and accomplishment that reached an apex of frenzy in 1893. Two historical events in America informed the narrative of everyday lives during this time: the impending financial crash of 1893 that followed on the heels of the most extraordinary world’s fair, The Columbian Exposition, which opened in Chicago in May of that year. Follow Laura, Catherine and a colorful and memorable cast of friends, lovers, families and enemies as they try to make sense of a world where women were both adored and restricted. Follow them into a world where extravagant displays of wealth and acquisition settled in gorgeous mansions on tree-lined streets adjacent to the most poverty-stricken neighborhoods of tenements and hovels. And watch as these American born women discover something the throngs of proud immigrants already knew—that the lingua franca of freedom is that most elusive, non-denominational, non-ethnic value of all human endeavors: tolerance.",
  "genres": [
    "Romance",
    "Historical Romance",
    "LGBT",
    "Historical Fiction"
  ],
  "author": "T.T. Thomas",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/16108167-the-blondness-of-honey"
}