{
  "title": "The Spiral Library",
  "description": "An ancient, mysterious library, housing books with a secret mission, overlooks and defends the surrounding city. The Chief Librarian, a wise master, protects the Spiral Library from attacks by Kal, a treacherous and eternal enemy determined to conquer it. One morning the library’s long-silent “Golden Gong” sounds. It is announced that the last two Chief Librarian successors have disappeared without a trace and a new candidate must be selected. Without a new Chief Librarian, the line of librarians will be broken and all will be defenseless. No one explains or questions this crisis except one girl, Soe. Unexpectedly she is chosen as a last-chance successor candidate. Under the shadow of anger and mistrust she is forcibly taken to the library. To be purified and prepared to serve, Soe must undergo 12 nights of trial that test her core values and strengths, while under constant attack by Kal acting in partnership with her greatest enemy. This intense training is overshadowed by her clandestine attempts to find the lost successors – her boyfriend and her twin brother. Soe has plans but life has other plans. Soe’s adventuresome spirit takes her on a wild ride, magnetizing her curiosity, dare-devil spontaneity, keen reasoning skills, and pulling her into scenes that bring out the best and worst in her. Accompany Soe as she drives a chariot pulled by “fire horses,” shifts her shape while escaping an enchanted forest, drinks potions supplied by a 200-year-old young man, and discovers a great truth through love and sacrifice. The Spiral Library is a page-turning thriller full of non-stop action. Within the story’s plot is a natural wisdom that mirrors questions such as, “Are we living in an illusion?” and “Just who is the enemy?” All of this lies hidden in the most unusual library one could ever imagine. Note: This book is written neither in novel nor in play format but something in between named as play-novel.",
  "genres": [
    "Fiction",
    "Fantasy"
  ],
  "author": "Evren Sener",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/16110065-the-spiral-library"
}