{
  "title": "Dreams of the Queen",
  "description": "Aliens, zombies, romance and a wormhole all wrapped up in a mystery! *Rated Mature 17+ for possibly objectable scenes, violence, language, sexual scenes & gore*Haunted by dreams of an alien world and obsessed with unlocking the mystery, Dr. Cass Baros does the improbable. She creates a wormhole. While her team preps to traverse it, she becomes more suspicious of her fiancé and co-project leader, Dr. Julian Saunders. Is he really so jealous and secretive? Her boss, Dr. Janson, also has an agenda, which includes adding an U.S. Army contingent to her scientific team. Captain Lewis seems intelligent, but an army grunt is still a grunt, right? As if this isn’t enough to make a normal woman paranoid—and Cass is anything but normal—her dreams have altered to include an alien man who thinks she’s their predestined queen and savior. Once through the wormhole, they make first contact with the brajj, and Cass meets Jeamon, the man from her dreams. According to him, she must be taken to the brajj’s leader, Master. Cass is conflicted. She is drawn to Jeamon, but still engaged to Julian and rightfully uncertain, though she feels changes occurring within her. Unable to return home and facing numerous dangers—external and internal—the team deals with this fascinating new world, including an altering Cass. How far is the team willing to go to discover answers? What is Cass willing to do if she is to be a savior? What will Jeamon choose when faced with split loyalties?Forced to choose between their old lives and their new ones, Cass and Jeamon are plunged into an adventure beyond their control. One in which the rest of the team must struggle to survive along with them as they unravel the millennia old secrets of the brajj’s world.Passion and love, genius and madness, jealousy and danger enough to cause the death of worlds await them through the wormhole...",
  "genres": [
    "Science Fiction",
    "Romance",
    "Fantasy",
    "Aliens",
    "Adult Fiction",
    "Horror"
  ],
  "author": "Jacqueline Patricks",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/16110810-dreams-of-the-queen"
}