{
  "title": "The First Time I Heard Kate Bush",
  "description": "THE FIRST TIME I HEARD KATE BUSH is Part V in an ongoing series where musicians and writers tell their stories of first hearing the music of an iconic artist or band. In this fifth volume (following the first four installments, which covered Joy Division/New Order, Cocteau Twins, David Bowie, and The Smiths), thirty-nine different musicians and writers remember their initial experiences with hearing Kate Bush, the brilliant, eccentric, influential, and immensely talented British singer/songwriter whose albums include her debut \"The Kick Inside,\" the classic \"The Dreaming\" and \"Hounds of Love,\" and the recent \"50 Words For Snow.\"Contributors to the Kate Bush edition include musicians such as John Grant, Daren Taylor (The Airborne Toxic Event), Kaia Wilson (Team Dresch, The Butchies), Simon Phipps (Engineers), Matt Keppel (Microfilm), Paul Livingston (The Trashcan Sinatras), Dominic Appleton (Breathless, This Mortal Coil), Anka Wolbert (Clan of Xymox), Dan Hougland (Excepter), Thomas Meluch (Benoit Pioulard), Jem Tayle (Shelleyan Orphan), Ryan Newmyer (A Sunny Day In Glasgow), Ben Eshbach (The Sugarplastic), Louise Rutkowski (This Mortal Coil, The Hope Blister), Christoph Hochheim (The Pains of Being Pure at Heart, The Depreciation Guild), Ryan King (My Latest Novel), Anji Bee (Lovespirals), Aaron Snow (Landing), John Mark Lapham (The Earlies, The Revival Hour), Andrew P. Crane, Mark Rimbach (The Milling Gowns), and Tiffany Anders; musical theater directors Martin Lowe and John Tiffany; and writers Chris Roberts, Kellie Wells, Michelle Hoover, Kevin Killian, Matthew Rettenmund, Tara Ison, Lisa Borders, Rakesh Satyal, Alden Jones, Alexander Laurence, Joseph O. Legaspi, Douglas Ferguson, Elizabeth Searle, Thomas Negovan, and Sylvia Sellers-Garcia.The \"First Time I Heard\" book series is edited by Scott Heim, a novelist (Mysterious Skin, We Disappear) who is also a longtime music fan. Other installments in the series (or those forthcoming soon) include books on Joy Division / New Order, David Bowie, Cocteau Twins, The Smiths, R.E.M., Kraftwerk, My Bloody Valentine, Abba, Roxy Music, The Pixies, and others.",
  "genres": [
    "Music"
  ],
  "author": "Scott Heim",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/16111007-the-first-time-i-heard-kate-bush"
}