{
  "title": "While Angels Slept",
  "description": "1139 A.D. – When her husband perishes in a skirmish, the Lady Cantia du Bexley Penden is distraught. Her husband was assisting the mighty Viscount Winterton in the battle for the throne between Empress Matilda and Stephen of Blois, caught, like most men, in a vicious struggle for the rightful ruler of England. Tevin du Reims is Viscount Winterton, a man with a heavy burden to bear and a dreadful secret. A lonely man whose wife left him years ago with a sickly child to raise, he is drawn to the sorrowful Lady Penden and in comforting her, falls in love with her. With her husband so recently killed, Cantia cannot resist the solace offered by the handsome viscount.A fiery passion is borne from grief and loneliness, and soon Tevin and Cantia find themselves in the grip of a powerful romance. But forces are at work against them; Cantia’s father-in –law, driven to madness by the death of his son, plots Cantia’s demise, blaming her for his son’s death. Complicating the issue is Tevin’s cousin, the lecherous Earl of East Anglia, who sets his sights on Cantia as a conquest. In order to protect Cantia, Tevin secretly whisks her from Rochester Castle with the intention of sending her someplace safe. But his altruistic plans come to ruin when Cantia is abducted by outlaws.And so begins the journey. Come along on the adventure of Tevin and Cantia, following them through death and life, through sorrow and hope. It is a tale of a lifetime involving two people with utterly shattered lives who must save each other and restore hope during the dark times of early Medieval England, during a turbulent time when men openly said Christ and his angels slept….",
  "genres": [
    "Historical Romance",
    "Medieval",
    "Historical",
    "Romance",
    "Medieval Romance",
    "British Literature",
    "Audiobook"
  ],
  "author": "Kathryn Le Veque",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/16110989-while-angels-slept"
}