{
  "title": "Daughter Moon",
  "description": "Kali, a skilled computer hacker on Daughter Moon, is womaneuveredinto taking charge of the suicide mission to rescue the time travelerin trouble down upon Mother Earth. Lunar’s resources are no match for Earth’s lifeless eNet computercomplex which has evicted huwomanity from Mother Earth. But the timetraveler who makes periodic unstable appearances (Goddess Kronos, thefocus of the Moonie Religion) has a defensive 5K Field stronger thananything Lunar or Earth have. If the time traveler can be rescuedand her 5K Field duplicated, huwomankind will be able to defeat eNetand reclaim Mother Earth. Brought into the top secret meeting as a technical advisor, Kali makesthe mistake of speaking up and giving her honest opinion of herleaders’ hopelessly incompetent plan. She is goaded into offering upan alternate plan of her own which she thinks just might be possible.Instead of getting demoted and kicked out, Kali is chilled to findherself in absolute command of the rescue, where she will go down toMother Earth herself with her own picked team. Kali’s team succeeds in rescuing the time traveler. UnfortunatelyGoddess Kronos is a boy. The only male in the solar system. “Wecan’t bring that testosterone infected creature back to DaughterMoon!” More difficult than rescuing the boy from eNet may be keepinghim alive on Daughter Moon, which Kali must do, since his technologyresists analysis. Another problem: one of the astronauts has already fallen in love with the boy.DAUGHTER MOON is Old School hard Science Fiction at 122,840 words,with Matriarchy as the twist. All the Usual Suspects: Alien Invasion,teleportation, space battles, nanotechnology, virtual reality; anobody suddenly given incredible powers; a struggle for the survivalof our race and the future of the Universe; a Love more powerful anddecisive than any technology.[How did the future space-based civilization become dominated bywomen? Terrorism + Insurance Rates + Advances in Cloning. Oneterrorist can kill everyone in a 30,000 population space station.The male/female ratio of terrorists is 50 to 1. Sexual-profiling.Space habitats where males had no access to high security areas wereempirically safer, with drastically reduced insurance rates, whichmade them economically more viable. Within a thousand years theverdict was clear: boys were just too dangerous to allow to be born.(Anyway, who needs ’em? We have TomBoys!)]",
  "genres": [
    "Time Travel"
  ],
  "author": "@hg47",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/16111094-daughter-moon"
}