{
  "title": "Changeling",
  "description": "ChangelingA young woman vanished from the streets, a life destroyed, her humanity a battle ground.London, April 1987. Joanne is out for a night on the town and her plans go awry. She slips into a pub for a quick drink before going to see a film. Jonathon Dreyfuss is on the prowl, looking for something tasty to devour. He spots Joanne through the window. Joanne vanishes from sight.She wakes in a room with no windows, trapped in a nightmare of pain and terror. Dreyfuss finds her boring and tedious... yet he can’t quite kill her. Something about her, some aspect of her, is pleasing to him. He keeps her for a little while, house training her as he’s attempted to train others in the past. She resists, as they all did, and he takes up the challenge, to prove once again he is master of all. Joanne fights back as best she can, terrified and confused, beaten, starved and lost in a madman’s fantasy. He spends months schooling her to obey, tearing her down. When she begins to break, as hope of escape fades... he reveals his final he is Vampire. She too, will be his Changeling.He wishes her to be his immortal companion, his eternal mate. What Dreyfuss wishes, Dreyfuss gets.The battle for her soul begins. All she has is her will and the need to be free. Dreyfuss holds all the money, power and no conscience. Can she keep fighting, or will he win? How long can Joanne stay human? What price would you pay for your freedom?Changeling is the first novel in the Dreyfuss a compelling and unique vampire mythology for adults. 152 000 words. Ebook and PaperbackReviews for Changeling“It took me two sittings to read it. Why two, because I started reading in at 8pm. If I had started earlier, this would have been one of those books you don't put down until the last page and you read that twice not wanting the adventure to be over. Morgan has mastered the emotional ride... a new talent to be discovered.”Betty Carlton“It was impossible to put down, disturbing and intriguing at the same time.”Alison Sauer“...brutal and visceral -- so well written that it was almost physically painful to read. [it does]... a very good job of depicting physical and psychological torture – people either crack into catatonia or fight with every scrap of their being. Even when fighting means taking it passively.”Christine Whitley“This is a very smart, well-written novel. It delves deep into the psychology of both the abuser and the abused. It contains graphic scenes of physical, psychological and sexual abuse that will upset those made queasy by portrayals of torture. But... this isn't splatterpunk. It's purposeful. So if you can handle that, you won't find a much better vampire tale than Changeling. ... I think that fiction should both entertain and make you think. It's surprisingly difficult to find novels that do both. Changeling does.”Alan Ryker",
  "genres": [
    "Vampires",
    "Fiction",
    "Paranormal"
  ],
  "author": "Morgan Gallagher",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/10648723-changeling"
}