{
  "title": "Why Women Are Their Own Worst Enemies!",
  "description": "Why Women Are Their Own Worst Enemies!TM is the book your cooler older sister would have given you if she actually liked you. The author and feminist, Brandon Kelly, examines why women are still not rulers of the free world or at the very: least why they are still not earning as much as their colleagues of the male persuasion. The author outlines \"areas of opportunity\" a term used often in corporate America, a world which Brandon occupied for 13 years, which women must revisit in order to assume their rightful place as rulers of the known universe.In an observation on the slang terms used to define women she concludes the following:\"What's humorous to me about using \"bitch\" as an insult is that it clearly illustrates just how marginalized women really are; for this singular insult stands to throw us out of the human species altogether, and quite literally, to the dogs.\"Traversing such topics as intra-female competition, to the overemphasis on the opposite sex, and not standing up for yourself at work, this book examines the gambit of potential pitfalls facing womankind which singe-handedly stand to hold her back from her true potential.In Brandon's analysis of what it's like to work for a woman, she asserts:\"If you've never worked for an angry or a jealous woman then you have never truly experienced the full plethora and bouquet of the working experience.\"In a humorous yet biting tone, Brandon engages the reader in a dialogue which highlights just how preposterous many of the scenarios women either create for themselves, or find themselves in and how most can be surmounted. These trends are outlined in an essay format and ask the reader to explore these concepts and determine whether or not they themselves need to improve upon them or risk forever remaining the \"weaker sex\".",
  "genres": [
    "Nonfiction"
  ],
  "author": "Brandon Kelly",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/16112313-why-women-are-their-own-worst-enemies"
}