{
  "title": "Searching for Calamity: The Life and Times of Calamity Jane",
  "description": "“Who in the world would think that Calamity Jane would get to be such a famous person?” one of the pallbearers at her funeral asked an interviewer many years later. It seemed like a reasonable question. Who else has accomplished so little by conventional standards and yet achieved such enduring fame?\tBut conventional standards do not apply. Calamity was poor, uneducated, and an alcoholic. For decades, she wandered through the small towns and empty spaces of the Dakotas, Wyoming, and Montana. But she also had a natural talent for self-invention. She created a story about herself and promoted it tirelessly for much of her life. The story emphasized her love of adventure and the heroic role she played in key events in the early history of the American west. She became that story to people around the country who read about her. And she became that story to herself. The details about her exploits were rarely accurate, but a larger truth lay beneath them. In an era when there were few options for women, Calamity had the audacity to be herself. She lived as she pleased, which is to say that she allowed herself the same freedoms her male contemporaries assumed as their birthright. She spoke her mind. She flouted the rules. She dressed as a man when it was illegal for women to wear pants; hung out in saloons although that was unheard of for any woman who was not a prostitute; did men’s work; cursed, hollered, and smoked cigars. \tAlthough Calamity’s name is imprinted in history, most people know little about her. This highly readable biography brings Calamity to life against the backdrop of the American west and of women’s determination to break free from their historical constraints.17 photographs of Calamity Jane and 6 maps, including 5 maps that show her travels",
  "genres": [
    "Biography",
    "History",
    "Nonfiction",
    "American History",
    "Westerns",
    "True Crime",
    "19th Century"
  ],
  "author": "Linda Jucovy",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/16112503-searching-for-calamity"
}