{
  "title": "Guardian of the Earth House",
  "description": "Elementals: Water, Earth, Fire and Air are only the beginning. Elementals support everything from Darkness to Time, secretly maintaining the processes of nature. Only now the Elementals are nearly extinct. Two years ago, the Air House released a plague that killed ninety percent of them. With their society in chaos and so many of their kind dead, they can’t find their Phase-Matches; the other halves of themselves. Without Matches they can’t have any more children and, without the Elementals, the world will end. Again.Tessie: The Quintessence isn’t technically an Element and its Keeper isn’t quite the Divine creature of legend. Mainly, she’s just a half human bartender in Mayport Beach, Florida. Tessie has spent millennia trying to stay hidden from Elementals and other supernatural beings, but her enemies are closing in. Now, she has no choice but to turn to the Elementals’ leader for help. Honorable, super-powerful and way too appealing, the King of the Earth House seems annoyingly perfect. But, since the guy owns a castle, the least he can do is pony up a spare bedroom.Job: Consumed with saving his people from extinction, Job, King of the Earth House isn’t thrilled when the Quintessence shows up in his office demanding sanctuary. Tessie’s chaotic mix of human slang, tacky clothes, and feminine curves baffles him. To make matters worse, she does something with her vast powers to make it seem like she’s the Phase-Match he’s spent a thousand years waiting for. Neither of them can undo the connection and the fake Match begins to feel plenty real as Tessie fills up Job’s lonely palace with laughter and daytime TV. But, Tessie’s enemies are still after her and now they’re setting their sights on Job…Book Two of the Elemental Phases.",
  "genres": [
    "Fantasy",
    "Romance",
    "Paranormal",
    "Fantasy Romance",
    "Magic",
    "Paranormal Romance",
    "Contemporary"
  ],
  "author": "Cassandra Gannon",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/16113032-guardian-of-the-earth-house"
}