{
  "title": "Warrior from the Shadowland",
  "description": "Elementals: Water, Earth, Fire and Air are only the beginning. Elementals support everything from Darkness to Time, secretly maintaining the processes of nature. Only now the Elementals are nearly extinct. Two years ago, the Air House released a plague that killed ninety percent of them. With their society in chaos and so many of their kind dead, they can’t find their Phase-Matches; the other halves of themselves. Without Matches they can’t have any more children and without the Elementals, the world will end. Again.Cross: Cross, of the Shadow House nearly triggered an apocalypse once before. The last of the Shadow Elementals, the weight of all the Darkness in the universe has fallen on his shoulders. The crushing power of it should have killed him long ago and he would have welcomed an end to the pain. Except, Cross knows his Match is out there. The woman he’s dreamed of forever. He’ll do whatever it takes to find her…even go to the human realm.Nia: Elemental laws forbid mixing with the humans, but Nia, of the Water House isn’t a woman who gives up easily. Nia and her ragtag group of “rebels” believe a small town in Florida holds the secrets to their survival. They head there looking for answers, but everything’s going wrong. Other Elementals are out for their blood, human technology is sort of baffling, and now the cops are closing in. When Cross arrives, Nia knows he’s her Match. Unfortunately, he’s teetering on the edge of crazy and refusing to touch her, because he thinks his powers are dangerous. It’s up to Nia to convince him they’re meant to be, stage a jailbreak, and evade the bad guys.Oh, and save the universe.Book One of the Elemental Phases.",
  "genres": [
    "Fantasy",
    "Romance",
    "Paranormal",
    "Fantasy Romance",
    "Magic",
    "Paranormal Romance",
    "Contemporary"
  ],
  "author": "Cassandra Gannon",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/16113029-warrior-from-the-shadowland"
}