{
  "title": "Two Fronts",
  "description": "In 1942, two nations switch sides—and World War II takes a horrifying new course.\n In the real world, England and France allowed Adolf Hitler to gobble up the Sudetenland in 1938. Once Hitler finished dismembering Czechoslovakia, he was ready to go to war over Poland a year later. But Hitler had always been eager to seize Czechoslovakia, no matter the consequences. So what if England and France had stood up to the Nazis from the start, and not eleven months later? That is the question behind the War That Came Early series.Four years later, the civil war in Spain drags on, even after General Franco’s death. The United States, still neutral in Europe, fights the Japanese in the Pacific. Russia and Germany go toe-to-toe in Eastern Europe—yet while Hitler stares east, not everything behind him is going as well as he would like. But nothing feeds ingenuity like the fear of losing. The Germans wheel out new tanks and planes, Japan deploys weapons of a very different sort against China, and the United States, England, and France do what they can to strengthen themselves against imminent danger.Seen through the eyes of ordinary citizens caught in the maelstrom, this is a you-are-there chronicle of battle on land and sea and in the air. Here are terrifying bombing raids that shatter homes, businesses, and the rule of law. Here are commanders issuing orders that, once given, cannot be taken back. And here are the seeds of rebellion sown in blood-soaked soil.In a war in which sides are switched and allies trust one another only slightly more than they trust their mortal enemies, Nazi Germany has yet to send its Jews to death camps, and dangerous new nationalist powers arise in Eastern Europe. From thrilling submarine battles to the horror of men fighting men and machines all through Europe, Two Fronts captures every aspect of a brilliantly reimagined conflict: the strategic, the political, and the personal force of leaders bending nations to their wills.",
  "genres": [
    "Alternate History",
    "Fiction",
    "Historical Fiction",
    "Science Fiction",
    "World War II",
    "Military Fiction",
    "Science Fiction Fantasy"
  ],
  "author": "Harry Turtledove",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/16113596-two-fronts"
}