{
  "title": "Exile in the Water Kingdom",
  "description": "Elementals: Water, Earth, Fire and Air are only the beginning. Elementals support everything from Darkness to Time, secretly maintaining the processes of nature. Only now the Elementals are nearly extinct. Two years ago, the Air House released a plague that killed ninety percent of them. With their society in chaos and so many of their kind dead, they can’t find their Phase-Matches; the other halves of themselves. Without Matches they can’t have any more children and, without the Elementals, the world will end. Again.Ty: Ty, Queen of the Water House is having a bad couple of years. Her lunatic ex-Match keeps trying to kidnap her, most of the Elementals still blame her for the Fall, she has crippling panic attacks, and she’s being forced to attend group counseling in the human realm. When Gion, of the Air House shows up and demands sanctuary in the Water Kingdom, Ty doesn’t know what to think. Gion makes her nervous. He’s too cold, too powerful, and too intense. His only hobbies seem to be scowling and killing people. Except, when Ty looks into his eyes, she feels a… connection.Gion: The most feared assassin in the Elemental realm, Gion, of the Air House has spent his entire life being ostracized and feared. There’s a price on his head, everyone in the universe hates him, and he’s been exiled from his homeland. Gion’s tired and all he wants is Ty. For eleven years, he’s secretly been in love with the Water Queen and he’s done with hiding his feelings. His goal now is to somehow make a place for himself in the exasperatingly pastel Water Palace and to claim Ty for himself. Unfortunately, there are a few problems with his plan including the fact that Ty is terrified of him, the eccentric Water Phases keep trying to make him watch reality shows, and there are still many, many people who want Ty and Gion dead.Book three of The Elemental Phases.",
  "genres": [
    "Fantasy",
    "Romance",
    "Paranormal",
    "Fantasy Romance",
    "Paranormal Romance",
    "Magic",
    "Contemporary"
  ],
  "author": "Cassandra Gannon",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/16114212-exile-in-the-water-kingdom"
}