{
  "title": "Treasure of the Fire Kingdom",
  "description": "Elementals: Water, Earth, Fire and Air are only the beginning. Elementals support everything from Darkness to Time, secretly maintaining the processes of nature. Only now the Elementals are nearly extinct. Two years ago, the Air House released a plague that killed ninety percent of them. With their society in chaos and so many of their kind dead, they can’t find their Phase-Matches; the other halves of themselves. Without Matches they can’t have any more children and without the Elementals, the world will end. Again.Kingu: The son of the primordial Khaos, Kingu knows that he’s a soulless monster. He’s spent his entire existence enslaved and hated. Now that he’s finally free, though, the only thing he wants is to somehow find a woman of his own. Against his better judgment, Kingu enlists the help of the Elementals, the universe’s most annoying species, to track down his mate. All he wants is one quiet, uncomplicated woman, who won’t run when she sees his monstrous face. Instead, he gets a chatty little blonde lunatic who thinks she’s a warrior.Hope: Adopted by the Fire House as a child, Hope’s spent her entire life idolizing her bombastic family and learning their unconventional views on romance. Fire Phases see kidnapping as foreplay, gladiator fights as a great opportunity to impress your Match, and monsters as the pinnacle of masculine hotness. When Hope winds up as a prisoner in Kingu’s invitingly morbid fortress, she can’t believe her luck. She’s always believed she was jinxed, because so many weird things happen around her, but now she knows she’s found her soul mate. All she has to do is defeat a few enemies, keep up with all the lies she’s telling to hide her identity, and somehow convince a gigantic monster that he actually has a soul.Book Four of the Elemental Phases.",
  "genres": [
    "Fantasy",
    "Romance",
    "Paranormal",
    "Fantasy Romance",
    "Paranormal Romance",
    "Magic",
    "Humor"
  ],
  "author": "Cassandra Gannon",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/16114236-treasure-of-the-fire-kingdom"
}