{
  "title": "The Marechal Chronicles: Volumes I, II, and III",
  "description": "An erotic, fantasy adventure, this is a romantic tale of magic, emotion, and human motivation that does not turn a blind eye to the frank sexuality of its characters. Within these pages live witches, shapechangers, demons, and immortal beings. Turn the page and let them unveil their dark story in the ambiance of medieval France.An ongoing series, this is a collection of the first three volumes--Volume 1, The PathMelisse dreams of another life, one in which she is no longer the servant to a noble family, one where she can find her own destiny and make her life her own.On the eve of the arrival of the Marechal de Barristide, an eldritch light in the forest calls out to her, giving her the hope of change to come.The Marechal, a man marked with a vicious scar, is a man of the law of the realm, charged with investigating a series of horrible crimes to the south. However, he has his own reasons for visiting House Perene. Reasons that drive him to search mercilessly for the truth, no matter the cost.His search and the fate of Melisse intertwine to form a tapestry of lust, violence, and supernatural implications. All of which resound within a potent and robust story that draws the reader in and does not let go.Volume 2, The HunterThe sun rises upon the blood soaked House Perene.Evil has struck within and without and only the Marechal de Barristide can untangle the threads of fate that wind about him in a web of intrigue and passion.His way is branded into the very ground before him, but the Marechal must turn his course in order to seek aid from a dreaded soul. Beings from a realm other than earth shall seek his alliance while his quarry, the servant woman, Melisse, has disappeared, leaving only ash and dust behind her. But before taking up her trail once more, the Marechal must submit to another's infernal desires and pay far more than he bargained for.Here continues The Marechal Chronicles, an erotic tale of desire and merciless destruction as the players assemble themselves to pirouette in an intricate clockwork of unflinching sexuality and supernatural forces.Volume 3, The PreyThe paths of the Marechal de Barristide and Melisse, runaway servant accused of a grisly murder, narrow to convergence in a seamy quarter of Licharre, a city bordering the Ardoise mountains to the south.Lust and desire burn all that lies between them as demons rear their ugly heads, twisting their destinies together while powers beyond those of mankind exact their vile desires.Blood will run before it is over and doom shall fall where it will in this continuing story of supernatural passion and erotic romance.Approximately 45,000 words",
  "genres": [
    "Fantasy",
    "Erotica",
    "Paranormal Romance"
  ],
  "author": "Aimélie Aames",
  "average_rating": "2.90",
  "url": "https://www.goodreads.com/book/show/16117784-the-marechal-chronicles"
}