{
  "title": "Between the Realms",
  "description": "This is an alternate Cover Edition for ASIN: B009ZMXVA0.NEW YORK TIMES and USA TODAY BESTSELLING AUTHOR, ELLE CASEY, brings readers Book 6 in the YA Urban Fantasy WAR OF THE FAE Series. [Formerly titled Clash of the Otherworlds, Book 2] Jayne Sparks Blackthorn continues her journey as a changeling member of the Fae living in the Green Forest. Decisions have been made and the Fae Council has spoken. The chosen few must leave the Here and Now to undo the damage begun over a thousand years ago. Loyalties are questioned. Intentions are suspect. Angels and demons, witches and werewolves, pixies and elves. Everyone has a secret it seems, and the bridge between the Light and Dark lies squarely in the Gray. Content Warning: Mild violence and significant foul language within. Meant for older Young Adult readers (age 15+).\nWAR OF THE FAE SERIES READING ORDER\nThe Changelings (War of the Fae Book 1) **Free ebook at most retailers** Call to Arms (War of the Fae Book 2)Darkness and Light (War of the Fae Book 3)New World Order (War of the Fae Book 4)After the Fall (War of the Fae Book 5 - Formerly titled Clash of the Otherworlds, Book 1) Between the Realms (War of the Fae Book 6 - Formerly titled Clash of the Otherworlds, Book 2)Portal Guardians (War of the Fae Book 7 - Formerly titled Clash of the Otherworlds, Book 3)Time Slipping (War of the Fae Book 8)Dragon Riders (War of the Fae Book 9) **Coming soon**Winged Warriors (War of the Fae Book 10) **Coming soon**About this series: A reader fan recently set up a blog dedicated to casting the actors for the War of the Fae movie. No, it is not in production to be made into a movie, nor have I sold the rights to anyone for the movie. But just in case I ever do, my fans will be sure the casting director has a complete line-up ready! Check it out: ellecasey.com/WOTF_Movie",
  "genres": [
    "Fantasy",
    "Fae",
    "Young Adult",
    "Angels",
    "Demons",
    "Paranormal",
    "Fairies"
  ],
  "author": "Elle Casey",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/16119518-between-the-realms"
}