{
  "title": "Star's Storm",
  "description": "Star Strauss has always been a fighter. From the time she was born prematurely to her life on the road as a circus performer. She has never let her small stature keep her from achieving her dreams. She is one of the best aerial performers in the world. Her love of being up high and flying free has helped her overcome the challenges she faces when she is on the ground. Only her circus family, her sister, and her best friend have ever really understood her need for freedom. Her life changes when she finds herself on a distant world where every creature seems to tower over her.Jazin Ja Kel Coradon is the third son of the ruling House of Kassis. He is known not only for his skills as a fierce warrior but for his knowledge of communication, security, and weapons systems. This knowledge has increased the effectiveness of the Kassis defenses protecting their world from attack from a new group of rebels who threaten their very existence. He will fight until his last breath to protect his people.His life changes when he meets a tiny creature who is unlike anything he has ever seen. She is tiny, delicate, and beautiful. The problem is she is also the strongest, most stubborn female he has ever met. She refuses to do what he tells her, she defies him at every turn, and doesn’t seem to understand that all he wants to do is protect her. If he could just get her to stay in the nice safe bubble he has created for her, his life would be so much simpler!Star had enough of people back home trying to put her in a glass box, she wasn’t about to let anyone on an alien world try to put her in one! When the man she loves is kidnapped, she will do what she does best. She will use her skills as a performer to rescue him from the men determined to extract the information they need to bring down the Kassis defense system before they kill him.Sometimes being small has its advantages. The enemy never expects a pint-size female to have the strength of a warrior and a stubborn warrior is about to find out he has a partner who can stand tall with him in the face of danger.",
  "genres": [
    "Aliens",
    "Science Fiction",
    "Romance",
    "Science Fiction Romance",
    "Paranormal",
    "Fantasy",
    "Paranormal Romance"
  ],
  "author": "S.E. Smith",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/16119733-star-s-storm"
}