{
  "title": "Cornering Carmen",
  "description": "Sexy hot, full of action and adventure, three dimensional worlds filled with characters you fall in love with--what more can a reader ask for?! These Science Fiction Romance stories bring to life heroines who are strong, smart, and innovative and heroes who are pure alpha with a vulnerability that will melt your heart. Fast-paced, the stories always contain twists and turns when you least expect them and will keep you turning the page to find out what happens next. Join New York Times and USA TODAY Bestselling author S.E. Smith as she brings you another emotionally charged story in the Dragon Lords of Valdier series!Carmen Walker has spent the last three years of her life focusing on avenging the murder of her husband. Following leads to the man responsible, she finally has a chance to bring closure to the overwhelming pain and grief that is slowly eating away at her. Catching a ride on the business jet her sister is co-piloting, she heads to California to meet with her informant. Plans change when one of the women on board is kidnapped when they land and Carmen is mortally wounded. She wakes to find herself on board an alien warship heading to a distant world. Creon Reykill's skills as a warrior are legendary among the Valdier. He is credited with ending the wars between the Valdier and the Cruizan and Sarafin worlds and building a strong alliance with their former enemies. But, that victory came at a cost. Creon has given up hope of ever finding his true mate, believing his soul is too dark to ever be gifted with one. That all changes when a small, delicate female unlike anything he has ever seen before is brought to his world. The moment he sees her, he knows she belongs to him. His dragon will do anything to claim her, his symbiot will do anything to protect her, and he would do anything to chase the shadows from her eyes. For he knows he has found the light to his darkness. Now, the challenge will be to corner her long enough for her to realize he is the only one in the universe who can heal her shattered heart. She will fight him at every turn to return home to finish what she has started. He will do everything in his power to keep her by his side. It will take every skill he possesses to stay one step ahead of her.",
  "genres": [
    "Aliens",
    "Dragons",
    "Romance",
    "Science Fiction",
    "Paranormal",
    "Fantasy",
    "Science Fiction Romance"
  ],
  "author": "S.E. Smith",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/16119720-cornering-carmen"
}