{
  "title": "The Webs of Varok",
  "description": "Silver medalist, YA fiction — Nautilus Book Awards\n\nFinalist, science fiction— ForeWord’s Book of the Year Awards\nIn an alternate 21st century Solar System: Tandra Grey has left Earth for the ancient sustainable culture of Varok, with its promise of stability for her young daughter. But a genius with a hidden talent sets her eye on Varok's wealth—and Tandra's soul mates. Tandra, the elll Conn, and the varok Orram must untangle a web of deceit to restore balance for Varok and their fragile new family.“. . . engaging, multi-layered, provocative, and above all relevant to the times. . .” —Frank Kaminski, book reviewer for Energy Bulletin and Resilience.org“. . . a page-turning struggle between the eternal themes of personal accumulation vs. the common good.” —Kathy Campbell, past president, League of Women Voters New Mexico“. . . so many alien-imaginative twists, intrigues, and betrayals that the spellbound reader won't even realize s/he's being educated!” —Professor William Rees, originator of the Ecological Footprint conceptThe second novel in Cary Neeper's Archives of Varok series, The Webs of Varok follows the new, offworld adventures of the characters from Neeper's 1975 novel A Place Beyond Man, re-released in 2011. With three more titles coming in 2013-14, the five-volume Archives of Varok travels with Tandra's family on quests from Earth to the Oort Cloud with several stops in-between.Cary Neeper lives in the US Southwest with her husband and a friendly menagerie of dogs, fish and fowl. An avid proponent of sustainability and steady-state economics since the 1970s, she studied zoology, chemistry and religion at Pomona College and medical microbiology at the University of Wisconsin–Madison. Cary paints landscapes in acrylics, including the cover art for The Webs of Varok.",
  "genres": [
    "Science Fiction",
    "Young Adult"
  ],
  "author": "Cary Neeper",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/16119850-the-webs-of-varok"
}