{
  "title": "Once Upon A Twisted Time",
  "description": "Think you know your fairytales? Think again. These aren’t your normal happily-ever-after. Within these pages, a murderous Little Mermaid gets her revenge, the Cinderella doesn’t really want to wear the slipper, Snow White is up to her eyes in industrial experiments, and the Beauty is in fact the Beast. This collection of four novellas will surprise you, make you gasp in horror, sigh with relief, and sit on the edge of your seat. And most of all…they will make you rethink everything you think you know about dark fairytales…Song of the Abyss-Lindsay AvalonPrincess Nerissa had envisioned a perfect wedding to a handsome prince. Instead, she fell into a nightmare. When her new husband tries to murder her just hours after pledging his life to her, she must flee towards the sea. Caught in transition from woman to selkie, she is trapped by the dark waters she hoped would be her salvation. Now her destiny becomes that of luring young men to their death…until one comes along that reignites the spark of love inside her. However to ensure her future, she must first face her past. Revenge must be taken…for both her life, and the life of the young man she now loves.Miss Cavendish and the Spark of Salvation-Tara Stogner WoodIn a city toiling under the iron fist of the Spiegel Syndicate and its monopoly on coal, Miss Georgina \"George\" Cavendish is on the brink of a breakthrough that could change the world forever. There's just one thing standing in her way, her aunt - Xenobia Cavendish. Threatened by her efforts, the Syndicate procures the services of a notorious assassin with a past tied to her own, known as The Huntsman, to dispatch the brilliant scientist. But once he gets a glimpse of the headstrong beauty, will he be able to do the job, or will Georgina sway him to The Cause? And will George find the breakthrough she needs in time, or is New London Town doomed to forever lie under the dark shadow of her aunt's factories?Hawke and the Beast-Trish Marie DawsonSome curses last forever, and some can be broken with the whisper of three little words. Isabella Rose Woodward fell in love with a witch's son over a century ago. Her punishment for breaking the young man's heart was a beastly one. Every month she turns into a different creature, aging on the full moon when her curse allows for a brief return to her human form. Her only salvation is to find a man that will love her as she is…be it adorned in feathers, fur or scales. Has she found this love with the handsome Jasper Hawke? Or will a mysteriously determined Hunter find her first, and snuff out the life she so desperately seeks? A life of normalcy, where she loves and is loved in return… just as she is.Reborn City-Miranda StorkNyx has one mission in life; bring down the brainwashing of New Omsk’s citizens, and release them from their mundane lives of toil. The year is 2355, and the world is a new place. A Governor is in charge of every city in the world, and humanity is attempting to rebuild itself after recovering from a war that nearly killed it. But this Governor has set his eyes on the intrepid little hacker, Nyx, and he will stop at nothing to get her. But perhaps he needs her more than he ever dreamed he would…as do his citizens.",
  "genres": [
    "Fantasy",
    "Fairy Tales",
    "Anthologies",
    "Short Stories",
    "Fiction",
    "Retellings"
  ],
  "author": "Miranda Stork",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/16120278-once-upon-a-twisted-time"
}