{
  "title": "Strange Tales From The Scriptorian Vaults",
  "description": "Here at Kristell Ink we are pleased to announce our first publication: Strange Tales From The Scriptorian Vaults, an anthology of carefully chosen Steampunk inspired stories.All profits from this book will be given to the charity First Story (www.firststory.org.uk) – a small UK based charity that promotes literacy and creativity in schools situated in deprived areas.Here's what they had to say about the book:\"First Story is passionate about celebrating the art of storytelling. We are delighted to be associated with the nine talented writers who have shared their stories in the first publication from Kristell Ink, Strange Tales from the Scriptorian Vaults. We would like to thank them for their generosity in selecting us as their charity, which will enable a new generation of young writers to tell their stories. We wish them every success on the publication of their book.About the collection:When the newly-promoted Sergeant Crystal Lewis and her military team loops to a parallel world, they discover a London very different to those their agency have investigated elsewhere. Steam powered ships fill the sky, metal creatures scurry through the streets, and the Great Library is now nothing more than a burnt out shell; the history, knowledge and literature of the world has been destroyed. Crystal's investigations discover the records of the Scriptorians: elite explorers, scientists and chroniclers, chosen for their wordsmith abilities, their tenacious belief in uncovering the truth, their passion for the bizarre and baffling. There is some evidence that these mysterious adventurers, fighters and writers also discovered the technology to loop and visit other parallel worlds. Here are some of their tales...Zoe Harris offers us a vision of feminism taken to extremes, while Ken Dawson has the epitome of the pushy parent at the heart of his story; Jake Finlay’s and Ross Kitson’s stories are concerned with moral dilemmas in research and medicine and both consider the nature of immortality; Steven J. Guscott gives a novel twist to the Frankenstein story; David Muir’s central character is an apparently immortal warrior; on lighter note, Paul Freeman gives us a hero easily swayed by a pretty face and adventure, and Robert Peett shows a world of strange invasions, infections and mutations, and at the end, Sammy H.K Smith shows how it all began with the daring Lady Pippa Raven - the first true Scriptorian.",
  "genres": [
    "Steampunk",
    "Anthologies"
  ],
  "author": "Sammy H.K. Smith",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/16120220-strange-tales-from-the-scriptorian-vaults"
}