{
  "title": "Cobalt City Rookies",
  "description": "Cobalt City, Jewel of New England, has been the home of superheroes since the first people settled on the rocky shore. But as the old heroes move away, die, or retire, it falls to a new generation to step up and bear the burden—protecting Cobalt, and the world, from the nefarious plans of madmen and malicious Gods. Join a diverse band of new teen heroes as they pick up the mask, challenge destiny, and dare to become legends.Wrecker of Engines by Rosemary Jones features Morgan Lee, a young immigrant from Hong Kong who has come to Cobalt City to escape enemies he has made among the crime syndicates back home, and to research the history of a family he has only heard whispers about. Discovering the truth of his past will require him to create a new family of allies, especially when the secrets he seeks are in danger of being swept away by a steampunk villain seeking vengeance denied for over a century.Tatterdemalion by Nikki Burns features Miranda, a girl who survived a plane crash in the Alaska wilderness and a month alone waiting for rescue only to discover the strength, and costume, she found there has its own agenda. Upon her return to Cobalt City, she discovers that mysterious blackouts and teen gangs have turned the city into chaos. And the Alaskan tundra is not nearly as unforgiving as the social circles at her new school. It will take the collective wisdom of the Parliament of Rags that inhabit her costume and the resolve Miranda earned in the wilds to bring the fight to her faceless enemy.Kensei by Jeremy Zimmerman features Jamie Hattori, a headstrong young woman caught between worlds on a journey of self-discovery. With a stolen sword and a gift for speaking to spirits, she is wearing herself out balancing school, roller derby, a budding teen romance, and protecting the Karlsburg neighborhood of Cobalt City. The spirits have a warning—evil is coming, heralded by mysterious golden apples, a vicious gossip blog, and bloodsucking owls. How can one girl expect to challenge the will of ancient gods—especially when there’s a Chemistry test on Friday?",
  "genres": [],
  "author": "Rosemary Jones",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/16120647-cobalt-city-rookies"
}