{
  "title": "Heavenly Eternity",
  "description": "Contains Risking Eternity and Forsaking EternityRisking EternityBook one in the Heavenly Lovers series.For two hundred years, Dominicus has lived in isolation, sentenced to take human souls to hell. But this night’s victim is unlike all the others. She tempts him. One kiss and she comes apart in his arms. One taste, and he can’t walk away.But Maggie isn’t the only temptation he faces. Dominicus fights an attraction to Renatus, his best friend through the eons and a male with whom sex is forbidden. With her, he risks Hell, with him, losing the only piece of Heaven he has left.Maggie cannot begin to understand what Dominicus has done. Demons covet her soul and Lucifer won’t give up his prize. In claiming her, he’s not only compounded his sin, he’s sparked a war between Heaven and Hell. Angels battle demons, and Dominicus must make a choice. Does he deliver to Lucifer the human whose soul calls to him and ensure his salvation, or save her and risk eternal damnation?Reader Advisory: Contains passionate lip-locks between two male angels, hot enough to singe your feathers off.  Forsaking EternityBook two in the Heavenly Lovers series. There are some things an angel shouldn’t do… Renatus is a legalist and knows the rules better than most. But knowing the Law doesn’t stop him from imagining the press of a hard male body against his, or remembering one forbidden kiss that left him hungry for more. He leaves Heaven to mingle with mankind, hoping that satisfying curiosity will quell desire. He finds Adam, a college professor who has given up on love.Adam once dreamed of finding the perfect man and settling down. His dreams and trust were shattered when he found out the truth about his ex. Meeting Renatus seduces Adam into taking another chance on love. But Ren is keeping secrets, and the only promise he will make is that he will leave.Now the Most High has commanded Renatus to retrieve the Law of Men and Angels, and a vengeful demon is circling, waiting for her opportunity to strike. Staying is impossible, leaving unbearable, and Ren wants to succumb to temptation, forsaking eternity for a life on Earth with Adam.",
  "genres": [],
  "author": "Voirey Linger",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/16120806-heavenly-eternity"
}