{
  "title": "Dearest Hugh: The Courtship Letters of Gabrielle Drake and Hugh Mccoll, 1900 1901",
  "description": "Dearest Hugh offers a window into courtship during the early twentieth century through a collection of some three hundred love letters exchanged between Gabrielle Drake and Hugh McColl from 1900 to 1901. Edited by Suzanne Cameron Linder Hurley, this correspondence illustrates the hopes and sacrifices of an upper-class couple forging a marriage in a small southern town. A resident of Bennettsville, South Carolina, Hugh McColl enjoyed the social status that came with being the son of the president of the Bank of Marlboro. Hugh was twenty-seven and worked as a bank cashier at the time he began courting Gabrielle Drake in 1900. She was the daughter of James A. Drake, the clerk of court for Marlboro County, and was also a new graduate of Converse College, teaching at Bennettsville Graded School. The couple became engaged in May of 1901 and wed that November. Although most of their courting visits were chaperoned, Hugh and Gabrielle could speak more freely in their correspondence and exchanged notes--often two or three a day--detailing their private emotions, desires, and anxieties. The letters address equality within the relationship, Gabrielle's career, choosing and furnishing a home, and allocation of household chores. Hugh's letters are earnest, sincere, affectionate, and sometimes suggestive. His devotion to business and community is clear, as is his concern over being able to provide for a family. Gabrielle's writings are coquettish and playful, but she also anguishes over choosing between a career and a spouse. The attitudes expressed by both Hugh and Gabrielle also speak to the ambitious drive and community-minded dedication the McColls would later instill in their family, including grandson Hugh McColl, the former president and CEO of Bank of America. Hurley's insightful introduction places the correspondence into the broader context of recent scholarship on courtship rituals and the changing educational and social status for women during this time in American life.",
  "genres": [],
  "author": "Suzanne Cameron Linder Hurley",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/1612088.Dearest_Hugh"
}