{
  "title": "The Trouble with Scarlett",
  "description": "Summer, 1936: \"Gone with the Wind,\" Margaret Mitchell’s first novel, takes the world by storm. Everyone in Hollywood knows Civil War pictures don’t make a dime, but renegade producer David O. Selznick snaps up the movie rights and suddenly America has just one question: Who will play Scarlett O’Hara?When Gwendolyn Brick gets her hands on the book, the clouds part and the angels sing the Hallelujah Chorus. Only a real Southern belle can play Scarlett—and didn’t her mama raise her on stories of Sherman’s march and those damned Yankees? After years of slinging cigarettes at the Cocoanut Grove, Gwendolyn finds a new calling: to play Scarlett. But she’s not the only gal in town with a deep-fried accent. She’s going to have to stand out bigger than a hoop skirt at a Twelve Oaks barbeque to win that role.Marcus Adler is the golden boy of Cosmopolitan Pictures, the studio William Randolph Hearst started for his mistress, Marion Davies. When Marcus’ screenplay becomes Davies’ first hit, he’s invited to Hearst Castle for the weekend. The kid who was kicked out of Pennsylvania gets to rub shoulders with Myrna Loy, Winston Churchill, and Katharine Hepburn—but when the trip turns fiasco, he starts sinking fast. He needs a new story, real big and real soon. So when F. Scott Fitzgerald moves into the Garden of Allah with a $1000-a-week MGM contract but no idea how to write a screenplay, Marcus says, “Pleased to meetcha. We need to talk.”When Selznick asks George Cukor to direct \"Gone with the Wind,\" it’s the scoop of the year for Kathryn Massey, the Hollywood Reporter’s newest columnist. But dare she publish it? Scoops are the exclusive domain of the Hearst papers’ all-powerful, all-knowing, all-bitchy Louella Parsons. Nobody in Hollywood has ever dared to outscoop Louella—until now. When Louella comes back low and dirty, Kathryn’s boss lets her dangle like a scarecrow in a summer storm. Then the telephone rings. It’s Ida Koverman, Louis B. Mayer’s personal secretary, and she has a proposition she’d like to make.\"The Trouble with Scarlett\" is the second in Martin Turnbull’s series of historical novels set during Hollywood’s golden age.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical"
  ],
  "author": "Martin Turnbull",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/16121244-the-trouble-with-scarlett"
}