{
  "title": "Angels Go to War",
  "description": "Then from the lower part of the lowest earth and sea rose a blinding smoke of demonic aura. The confrontation was set. Wondering what will happen as I seem to be caught in the crossfire. My thought was broken by the screeching of a mammoth crowd, of shouting, piercing cries coming from the village center. Oh am I dreaming? A blurry nightmare or reverie! Sweat poured down my face like rain and soaked by beddings as if I was dunk into an urn. The hauling, screaming, cries were growing stronger. I must find out.  So Ikem rushed out almost half naked carrying the dread of his trance or dream to the real world. Oh my mother land, small but united. What a puzzle. This myth must be resolvedAngels go to War and the battle to deliver Ehie Dacunga is the story of a demonic siege upon this city of great potentials but it took Ikem, the chosen one and other warriors and supernatural occurrences and interventions to deliver them from the evil siege of the dark kingdom and the debilitating ruins of the past that had followed and affected their generations and even waiting for the yet unborn generationsThen the real spiritual and physical battles to liberate Ehie Dacunga! Going to the mountain! When they discovered the truth of available information, oral tradition and acted rightly, it brought change, reformation in their psyche and way of doing things which later graduated into transformation, progress in the whole community. God intervened and sent an invading army of Angels on assignment that enforced a just cause, delivered and healed their Land. Ehie village paid an enormous price in the face of great opposition that brought peace, deliverance, prosperity to the bigger community of talents, brains, potentials that had suffered under evil siege for a long time. Angels still come to the earth today on assignment",
  "genres": [],
  "author": "Ikechukwu Joseph",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/16121982-angels-go-to-war"
}