{
  "title": "Evolution: the future",
  "description": "Download for free from: https://www.smashwords.com/books/view...Author's site: http://www.smashwords.com/profile/vie...\"Evolution: the future\" is a transhumanist novel about emerging technologies and space, set in a near future populated by humans and digital beings. Suspense and action, but also a fascinating travel into the impacts of Artificial Intelligence on our civilization.According to future studies, the world will be dominated soon by disruptive technologies, able to plunge Mankind into an era of accelerated progress. Main outcomes will be the achievement of immortality, the creation of smarter than human Artificial Intelligence and the spread of the new species through the universe.“Evolution: the future” is a breathtaking story set in a near future altered almost beyond recognition by disruptive technologies.24th century. Humans live on Earth and the Moon, last strongholds of their past power. Mars and the Net are inhabited by artificial intelligences and souls, these last obtained by digitizing the brain after death. The virtual reality allows the two races to communicate. Their differences are deep, their interests incompatible.With digitization, humans have postponed real death to an indeterminate future, but they are not happy. Towards the virtual beings they feel admiration but also envy and inferiority. The digital creatures instead cannot bear being relegated in worlds too small for their unbounded ambitions. Their Martian experience has allowed them to develop the competence necessary in extra-terrestrial environments, most of all to acquire the self-confidence indispensable for the colonization of other star systems. The Alpha Centauri project obtains the humans’ support, in exchange for the waiver of any expansion on the Earth. Just before departure, Earth Security intercepts a suspect message from the Space Agency. Terrorism? The evidence leads to the Elects, a sect that entered Net fifty years before through a collective suicide...Eve and Victoria, the main characters, are “souls”, digital beings whose brain was digitized after death. They move in a context of epoch making events, becoming more and more involved and finally merging their destiny with that of the digital people.A script is also available. The last edition of the ebook can be downloaded from the Author's website. A vast bibliography as well as links to videos by main exponents of advanced think tanks, plunge the reader into an enchanting, boundless voyage.",
  "genres": [],
  "author": "Marco Santini",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/16122537-evolution"
}