{
  "title": "The Exploit: A Theory of Networks (Volume 21)",
  "description": "\" The Exploit is that rare a book with a clear grasp of how networks operate that also understands the political implications of this emerging form of power. It cuts through the nonsense about how 'free' and 'democratic' networks supposedly are, and it offers a rich analysis of how network protocols create a new kind of control. Essential reading for all theorists, artists, activists, techheads, and hackers of the Net.\" --McKenzie Wark, author of A Hacker ManifestoThe network has become the core organizational structure for postmodern politics, culture, and life, replacing the modern era's hierarchical systems. From peer-to-peer file sharing and massive multiplayer online games to contagion vectors of digital or biological viruses and global affiliations of terrorist organizations, the network form has become so invasive that nearly every aspect of contemporary society can be located within it.Borrowing their title from the hacker term for a program that takes advantage of a flaw in a network system, Alexander R. Galloway and Eugene Thacker challenge the widespread assumption that networks are inherently egalitarian. Instead, they contend that there exist new modes of control entirely native to networks, modes that are at once highly centralized and dispersed, corporate and subversive. In this provocative book-length essay, Galloway and Thacker argue that a whole new topology must be invented to resist and reshape the network form, one that is as asymmetrical in relationship to networks as the network is in relation to hierarchy. Alexander R. Galloway is professor of culture and communications at New York University and the author of Essays on Algorithmic Culture (Minnesota, 2006) and How Control Exists after Decentralization . Eugene Thacker is professor at The New School and the author of Biomedia (Minnesota, 2004) and In the Dust of This Planet .",
  "genres": [
    "Philosophy",
    "Theory",
    "Technology",
    "Nonfiction",
    "Sociology",
    "21st Century",
    "Internet"
  ],
  "author": "Alexander R. Galloway",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/1065453.The_Exploit"
}