{
  "title": "My Pet Serial Killer",
  "description": "“Be mine. “Be mine, she said. “I didn’t know anything until she came along.“She told me I had ‘full of fight’ tattooed on my insides and then she made me believe it. The first time I took someone for her I knew it was true. I was a taker. She told me she only loved the takers of this world. Of course, we all eventually get taken in the end. You know what I remember from that first time though? The sounds. It almost like the sound a baby makes when it’s sighing. That’s how quiet it is. I just kept needing that sound over and over again. So I took and I took and I took and I took and I took some more. “Of course, I couldn’t go deep enough for her in the end. She poured salt on me and I melted into nothing.“You know that old saying? She was the type of person who tells you that dragons don’t exist, and then she leads you to their caves. I never even really called her by her name even. I never really called her Claire. I just thought of her as god. I asked her what it was like studying forensics and she told me that once you know about the invisible world then the visible world didn’t matter anymore.“She told me the visible world is what we’re all trying to get away from. I just wanted to become invisible with her.”- Scott M., aka “Scott the Slaughter,” serving back-to-back life sentences at Montgomery State Prison.“This book defies categorization: A new kind of serial killer story that pushes and prods in all the unexpected directions. You’ve never read anything quite like this.”–Carlton Mellick III, author of Kill Ball“Michael Seidlinger’s swift-moving novel is an interesting addition to the genre, with all kinds of offbeat touches there for the connoisseur. He reminds me, in style, of some of the Swedish crime-writers we’ve seen. The narrative moves quickly towards a satisfying payoff.”–Todd Grimson, author of Stainless“‘And now they’re talking about media icons and murder’: Michael J. Seidlinger’s strange tale of Claire Wilkinson, forensics major, and her ‘Gentleman Killer’ is a wonderful romp through American wound culture, exploring the connection between art, media, serial killing, romance and anonymity. It reshapes the college romance plot as a wing of JG Ballard’s The Atrocity Exhibition.”–Johannes Göransson, author of Entrance to a colonial pageant in which we all begin to intricate“A rowdy menagerie of the unexpected, this book will delight and disturb even the bravest of readers; all preconceptions of what to trust and what to fear are masterfully upended within these pages.”–Alissa Nutting, author of Unclean Jobs for Women and Girls",
  "genres": [
    "Horror",
    "Fiction",
    "Thriller",
    "Adult"
  ],
  "author": "Michael J. Seidlinger",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/16123327-my-pet-serial-killer"
}