{
  "title": "Sokola Rimba: Pengalaman Belajar Bersama Orang Rimba",
  "description": "“Membaca tulisan Butet saya merasa menjadi Orang Rimba. Sungguh, saya merasa tercerahkan. Selamat atas tulisan ini. Semoga Orang Rimba dan lingkungannya menjadi lebih baik lagi. Amin” (Iwan Fals, musisi)“Saya jadi ingat orang Baduy, Banten Selatan, yang tidak butuh sekolah. Kata mereka, mendingan bodoh daripada pintar buat minterin orang lain. Bagi saya, buku ini merupakan gambaran anak muda Indonesia, yang mau hidup berbagi dengan orang yang terpinggirkan dari arus modernisasi. Butet memberi contoh lewat buku ini, bahwa ilmu yang kita miliki harus dibagikan kepada orang lain yang kesulitan menjangkaunya. Butet ternyata sudah melampaui generasinya, yang umumnya menyukai cara ‘seduh langsung dimakan’. Semoga muncul generasi pionir seperti Butet di negeri ini. Berbagi itu indah!” (Gola Gong, pengelola Rumah Dunia)“Siapa yang berhak membuat definisi dan mengklaim diri sebagai yang paling ’beradab’? Catatan Butet memperlihatkan kelumpuhan teori di hadapan pengalaman manusia dan fakta-fakta tentang keseharian mereka. Sebaliknya, si pemilik pengalaman itulah yang paling berhak atas definisi dan teori tentang diri dan kehidupannya.Buku ini mengoreksi banyak hal yang secara umum diasumsikan, diyakini, dan disebarkan oleh kaum cerdik pandai, politisi, pengusaha, pemimpin agama, dan siapa pun pemegang kekuasaan dominan. Seluruh isinya membawa saya pada perenungan panjang tentang makna peradaban, dan tentang ’keindonesiaan’. Kerja masih jauh dari selesai…. Terima kasih, Butet!” (Maria Hartiningsih, jurnalis senior Harian KOMPAS, memfokuskan diri pada isu-isu HAM )“Buku ini merupakan catatan dari seorang petualang dan pengabdi lingkungan yang disajikan secara ’apa adanya’, nyata, hidup, penuh dengan pengalaman langsung tangan pertama. Lewat proses pengalaman langsung ini, Butet tidak saja berhasil mendidik Orang Rimba, tapi juga belajar dari dan diajari oleh Orang Rimba tentang cara pandang, budaya, perilaku dan kehidupan Orang Rimba dengan segala kekayaannya. Sungguh merupakan pengalaman luar biasa, yang tidak akan didapat kalau Butet tetap berada di luar komunitas Orang Rimba.Sesungguhnya pendidikan harus dilakukan melalui dan berdasarkan budaya mereka agar mereka tidak tercabut dari alam dan budayanya. Pendidikan bukanlah proses alienasi seseorang dari lingkungannya, atau dari potensi alamiah dan bakat bawaannya, melainkan proses pemberdayaan potensi dasar yang alamiah bawaan untuk menjadi benar-benar aktual secara positif bagi dirinya dan sesamanya.Saya sangat menghargai dengan tulus kegigihan dan kerja ’gila’ si Butet yang telah menjadi ’Orang Rimba’ tanpa harus kehilangan identitasnya sebagai orang Batak, yang melalui itu berhasil mendampingi Orang Rimba menjadi terdidik tanpa kehilangan identitasnya sebagai Orang Rimba.” (Sony Keraf, anggota DPR-RI dan pemerhati lingkungan)***Judul: \nSokola Rimba: Pengalaman Belajar Bersama Orang Rimba\n •Penulis: Butet Manurung •Penyunting: Dodi Yuniar •Penerbit: INSISTPress  •Edisi: I, Juni 2007  •Tebal: 15x21cm, xvi+250hlm.",
  "genres": [
    "Nonfiction",
    "Indonesian Literature",
    "Education",
    "Memoir",
    "Biography",
    "True Story",
    "Anthropology"
  ],
  "author": "Butet Manurung",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/1612385.Sokola_Rimba"
}