{
  "title": "Gods of Men #1",
  "description": "\"Pignataro and Smith have made a fan out of me. I've never been much of a comic, or graphic novel enthusiast, but I am now. I highly recommend Gods of Men to those who want to add graphic novels to their Kindle library.\" ~ The Kindle Book Review\"Great addition to my Walking Dead addiction.\" ~ Zombielover29ABOUT GODS OF #1 Amazon Best Selling Graphic Novel in Horror and Science Fiction.GODS OF MEN ISSUE #2, #3 and #4 OR PICK UP A COPY OF GODS OF MEN VOL 1 (collects issues 1-5) ON SALE NOW!All the prophecies were right - the world as we know it comes to an end in 2012 with the arrival of the prophesized Wormwood comet that explodes in the atmosphere. The entire adult population of the planet quickly transforms into Wraiths, grotesque former humans out to devour uninfected humans. Follow young Jack Foster, his trauma induced psychotic ten-year old brother Mason, and baby Lucy as they struggle to survive in a world of Gods and men. These dead do more than just \"walk.\"                                                        ****************** LIMITED TIME ONLY********************Write a glowing review after your purchase, press the \"like\" button, and enter \"I wanna be a part of the book!\"in the review.  My team will make a character with your name and likeness if you want to be in a graphic novel with thousands of fans and growing!!Email pignataroj@yahoo.com  your first name and pic, or on our FACEBOOK pagefacebook.com/pages/GODS-of-MEN/196720...******************************************************ADDITIONAL \" What a delight to find a graphic novel with not only a great story but outstanding art work to accompany it .\" ~ Whiskybusiness\" It was the best of times it was the worst of times...who am I kidding it was the worst of times for these kids...GREAT book !\" ~ MichaelIf you'd like to add a true to genre graphic Novel to your Kindle Fire, start here. Download Gods of Men BOOK 1 of 5 right now.",
  "genres": [
    "Zombies",
    "Graphic Novels",
    "Apocalyptic",
    "Horror"
  ],
  "author": "Joseph Pignataro",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/16123825-gods-of-men-1"
}