{
  "title": "The Flamboya Tree : Memories of a Family's War-Time Courage",
  "description": "“The Flamboya Tree is a fascinating story that will leave the reader informed about a missing piece of the World War II experience, and in awe of one family’s survival.”—It is a well-known fact that war, any war, is senseless and degrading. When innocent people are brought into that war because they happen to be in the wrong place at the wrong time, it becomes incomprehensible. Java, 1942, was such a place and time, and we were those innocent people.”Fifty years after the end of World War II, Clara Olink Kelly sat down to write a memoir that is both a fierce and enduring testament to a mother’s courage and a poignant record of an often overlooked chapter of the war.As the fighting in the Pacific spread, four-year-old Clara Olink and her family found their tranquil, pampered lives on the beautiful island of Java torn apart by the invasion of Japanese troops. Clara’s father was taken away, forced to work on the Burma railroad. For Clara, her mother, and her two brothers, the younger one only six weeks old, an insistent knock on the door ended all hope of escaping internment in a concentration camp. For nearly four years, they endured starvation, filth-ridden living conditions, sickness, and the danger of violence from their prison guards. Clara credits her mother with their survival: Even in the most perilous of situations, Clara’s mother never compromised her beliefs, never admitted defeat, and never lost her courage. Her resilience sustained her three children through their frightening years in the camp.Told through the eyes of a young Clara, who was eight at the end of her family’s ordeal, The Flamboya Tree portrays her mother’s tenacity, the power of hope and humor, and the buoyancy of a child’s spirit. A painting of a flamboya tree—a treasured possession of the family’s former life—miraculously survived the surprise searches by the often brutal Japanese soldiers and every last-minute flight. Just as her mother carried this painting through the years of imprisonment and the life that followed, so Clara carries her mother’s unvanquished spirit through all of her experiences and into the reader’s heart.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "History",
    "World War II",
    "Autobiography",
    "War",
    "Biography Memoir"
  ],
  "author": "Clara Olink Kelly",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/1065498.The_Flamboya_Tree_"
}