{
  "title": "Maahilund",
  "description": "In the first book, Sashegh was a young girl just coming of age and experiencing for the first time extreme dangers, passionate love, and loyal friendships. Her adventures seemed to happen around her, affecting her without directly involving her. In Maahilund, she is the central protagonist, having matured into a wise and brave woman who takes charge of her life and demonstrates great leadership abilities.Her mother finds a small uninhabited island off the southern coast of a far northern country which might be in the area called Finland today. They settle there and build a castle to live in. The mainland is not uninhabited however. On Maginaugh they had to deal with natives of primitive cultures, some friendly, and some hostile. In the area around and inside Maahilund they will discover there are Gnomes, Elves, and Demons.Sashegh meets a wizard who has the ability to turn her and all her people into Elves. He teaches them how to cast magical spells. Sashegh reminds him of his mother and so he favors her, making her most powerful of all the Elves.Another group of Elves live on the mainland in an underground city named Maahilund. Sashegh meets one of them in the forest one night and they become best friends. Sashegh feels drawn to her, thinking the girl might be her lover from Maginaugh, Nammi reincarnated, seeing many physical similarities. She wishes they could be more than friends.Sashegh learns of her destiny from the wizard. She must lead the Elves in epic battles with the Demons and other evil beings. She must face the Devil himself in an ultimate struggle between good and evil. By reading the Fair and Fey series you will learn the origins of the Elves and hear of their destiny. Where do they fit in the evolutionary chain of sentient beings? Why are they so seldom seen today?Elves are sometimes referred to in literature as the Fair Folk. Other times they are called the Fey. From these terms the word Fairy evolved. Hence the title for the The Fair and Fey. In fact, the Elves of Maahilund are both Fair (beautiful) and Fey (having a grim destiny).Laced throughout these adventures are lovely, happy, and romantic moments when your favorite characters are enjoying life to the fullest. Maahilund will inspire you to do the same and fight for that which is good in your life.",
  "genres": [],
  "author": "J. Ellyne",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/16125384-maahilund"
}