{
  "title": "The Witchlets of Witches Brew ~ A Collection of Tales",
  "description": "The Witchlets of Witches Brew ~ A Collection of Tales.By Edain Duguay*This is a 'Green Leaves' eBook and a tree will be planted, in a deforested area of the world, for EVERY copy sold!*The Witchlets of Witches Brew is a collection of nine tales set throughout a seasonal year in the modern day village of Brew, commonly known by the name of ‘Witches Brew’.The villagers of Brew worship the land and the seasons, they celebrate the wonders of life and nature during their eight yearly festivals and a Blue Moon celebration. Each tale sees deep changes in the main character’s life relevant to the celebration around which it is set. Many of the characters you’ll meet in the series are in more than one of these tales and each child shows the attributes and personalities of the plants or trees they are named after.The Witchlets of Witches Brew collection centres on real life problems and provides children with fictional, Pagan related stories to help work through their own feelings. Throughout these stories of change, the children learn to appreciate life, family and nature more.Tales included:* Holly the Hasty Witch ~ Holly is always in a rush, never stopping to complete a task and often forgetting to fulfil her promises. This tale is about the virtue of Integrity, keeping ones word and is set at Yule.* Birch the Selfish Witch ~ Birch dislikes having a new step-dad and a new brother or sister on the way. This tale is about the virtue of Fidelity, the birth of a child and is set at Imbolc.* Ash the Solitary Witch ~ Ash is a single child of a family who moves to Brew. This tale is about the virtue of Perseverance, being brave enough to make friends and is set at the Spring Equinox.* Willow the Lonely Witch ~ Willow feels very alone when she hears life changing news about her mum’s relationship with her girlfriend. This tale is about the virtue of Courage, same sex parents and is set at Beltane.* Ivy the Stubborn Witch ~ Ivy hates summer for many reasons but most of all because her cousin, Honey, comes to stay with her family for a month. This tale is about the virtue of Hospitality, sharing and is set at the Summer Solstice.* Rowan the Hungry Witch ~ Rowan is always hungry, no matter what or how much she eats. This tale is about the virtue of Industriousness, helping someone less fortunate and is set at Lughnasadh.* Hazel the Unwise Witch ~ Hazel is a fun loving girl who doesn’t understand the consequences of rash decisions. This tale is about the virtue of Discipline, personal responsibility and is set during the Autumn Equinox.* Yew the Bored Witch ~ Yew has been brought up by her loving, and somewhat over protective, Grandma. This tale is about the virtue of Self-reliance, helping around the home and is set at Samhain.Also includes a never-before-published tale:* Plum the Cautious Witch ~ Plum has been bullied for an entire year but has kept it a secret. After she moves to Brew, she becomes overly cautious with others. This tale is about the virtue of Honour, standing up for oneself and is set at a Blue Moon.All The Witchlets of Witches Brew tales are suitable for young and old alike.",
  "genres": [
    "Witches"
  ],
  "author": "Edain Duguay",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/16125561-the-witchlets-of-witches-brew-a-collection-of-tales"
}