{
  "title": "Caitlin's Hero",
  "description": "Book one in the League of Love SeriesFalling for him is easy. Dealing with his high-profile life—a life deemed public property by his fans and the press, plus an ex-wife out for blood—now, that’s the hard part.Twenty-year-old Caitlin Walters was living a normal life. She attended university, socialised a little and had a good relationship with her mother and stepfather. But when her parents are tragically killed in a car accident, Caitlin’s life is forced to change. The once carefree girl becomes sole guardian of her stepbrother. Giving up her university course to support and raise eleven-year-old Riley, Caitlin struggles to deal with her new responsibilities.Her job, singing at a local Italian restaurant, brings Caitlin some peace. On stage, she leaves her life and its troubles behind. Feeling comfortable and sensuous, she is like a siren calling out to lost souls. It’s on one of these nights that Caitlin begins a romance with Australian Rugby League captain, Brodie James. Brodie, not content with his so-called perfect life and struggling with commitment issues following a disastrous marriage, falls hard for Caitlin.The relationship does not run smoothly for the self-sacrificing Caitlin, as she learns how to deal with Brodie’s nasty, jealous ex-wife, a muck-raking reporter and intrusive but well-meaning rugby fans. Along the way she makes new friends, and awakens the untapped sensual desires of the woman inside.Reader Advisory: Warning! This book contains steamy, erotic seduction by a hot Aussie rugby league player. Also contains plenty of Aussie slang — please note, 'footy' in Australia refers to rugby league, not soccer!— and a heroine who’s trying to juggle her exciting new relationship with caring for her eleven-year-old brother.Publisher's Note: This book was previously released at another publisher. It has been revised and re-edited for release with Total-E-Bound.",
  "genres": [
    "Romance",
    "Sports",
    "Contemporary Romance",
    "Australia",
    "Erotica"
  ],
  "author": "Donna  Gallagher",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/16126431-caitlin-s-hero"
}