{
  "title": "Knot Tonight",
  "description": "Ghost Unit - Full Ride By Gail Faulkner Prin nervously crossed her legs and signed the contract. Was she crazy? Yes! Crazy, desperate, and all things people are when they agree to do something insane. She held a contract outlining one night of submission to a stranger! Submission so complete, his requirements for preparation before presentation of herself to him made her blush while her womb tightened in anticipation. She would do anything to escape the dreams. Would this work? God, she hoped so. Wrenching dreams that came almost every night. The man in them never varied, his control of her body and its responses drove her to the edge of sanity. She'd wake up screaming for release, finding nothing but wet sheets and an empty house. Tall, dark and dominate, he'd long since accepted being alone for this lifetime. He'd met his lady, lover and submissive, but only in the dreams. Dream Walking is a door to the past or future, but never the present. She entered the suite and the unimaginable reality of his woman alive in this time exploded across his brain. She assumed the required stance. Now, spread naked before him stood everything he'd never dared hope for. Ghost Unit - Slip Knot By Gail Faulkner Book two in the Ghost Unit series. Rem has found the woman he needs. Recently retired from Special Forces, he's seen the worst the world has to offer. Like a caged beast gazing at freedom, he's hungered for Kathryn from their first encounter. Accidentally discovering her dark, sexual side only fuels his obsession with the elusive, delectable body she inhabits. Rem is determined to become her lover. If he can capture her sexually, he'll find a way to hold onto her. Kathryn is intent on shedding her bleak past. But the past has a way of biting a person on the butt. Sinister and deadly, it follows her into her new life. Rem's protection is heavenly, if only she can remember he's doing it because his sister is in danger as well. The danger stalking them catches Kathryn in its deadly grip. Nothing in his life has prepared Rem to watch his love suffer its rage. The beast leashed within his soul for so long knows what to do. Loving her with everything he is, or ever was, is the price he will pay for redemption.",
  "genres": [
    "Erotica",
    "Contemporary",
    "Erotic Romance",
    "BDSM",
    "Romantic Suspense"
  ],
  "author": "Gail Faulkner",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/106558.Knot_Tonight"
}