{
  "title": "Dead Reckoning",
  "description": "Dead Reckoning is an historical adventure of piracy, love and revenge in the Caribbean in the Seventeenth Century.#1 Bestseller for Kindle, Sea Adventures - UKLeo is born in Spanish Panama in 1659. When he is twelve years old he witnesses the violent rape and murder of his mother by three of the Caribbean’s most feared pirates: Tarr, Blake and Hornigold, and swears revenge at all costs. Gabriella is trapped in an abusive marriage to a ruthless Dutch slave trader, who is in business with the same English cut-throats. She risks all to escape with her life. Leo and Gabriella meet aboard one of the most horrific ships in the Caribbean – a slaver – and join forces against their common enemy. They face a number of challenges as they battle not only the risks of a life at sea – storms, drowning, and being adrift in a crippled ship, but also repeated attacks by Blake and Hornigold. But their biggest threat proves to be each other. Can they reconcile their hearts in time for the fiercest battle in their quest of revenge, and who will survive the gallows?Dead Reckoning was long-listed in the 2011 Mslexia Novel Competition.\"Wow, what a fantastic story. It's a swashbuckler with a sweeping narrative, full of sea battles, drama, revenge, and love\"\"Ms. Perkins is a sensational storyteller, knowing how to grab your attention, and hold onto you throughout\"\"This is an epic pirate adventure, that is wrought with romance, anguish, fighting and revenge.I was immediately drawn into the story of both Leo and Gabrielle, and fell in-love with both their horrific stories. Their lives eventually collide together and so begins a romance like no other.\"\"So enraptured with this story and its characters that I be became a little lost within it's pages\".\"K. A. Perkins takes romance, adventure and historical fractions to create a splendid tale.\"\"Some might say that it's a Bernard Cornwell type tale of adventure on the high seas, but it is much more than that. Rather than painting pirates as the swashbuckling adventurers that some authors do, Perkins portrays them as they truly were - violent, bloodthirsty, predators. That credibility is a large part of Dead Reckonings charm\"\"Dead Reckoning is an excellent read and I look forward to reading the other books in Ms. Perkins’ series\"\"Dead Reckoning is not a fast read. It is a deeply involving kind of story. One must give it full attention to get the span of the plot and appreciate the different characters. There are different plot lines that blend into the story, each one driving the story forward toward a satisfying finish.\"A free sample is available - just click 'read excerpt''Dead Reckoning' is available from Amazon in paperback (priced or for Kindle:http://www.amazon.co.uk/s/ref=nb_sb_n...orhttp://www.amazon.com/K-A-Perkins/e/B...Also for most other ereaders (Kobo, Nook, Sony etc) individual links from this page or from:https://www.smashwords.com/profile/vi...Thank you for looking.",
  "genres": [
    "Pirates",
    "Historical Fiction",
    "Romance"
  ],
  "author": "K.A. Perkins",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/16127136-dead-reckoning"
}