{
  "title": "Christmas Brides",
  "description": "Three Regency Romance Novellas:\"THE CHRISTMAS WISH\"21,500 words (about 100 pages)Heat index: SweetTo grant her dying father his last Christmas wish, Miss Annabelle Pemberton proposes marriage to her father's former ward, the rakish viscount Lord William de Vere. How painful it will be, though, to be trapped in a marriage of convenience with the only man she has ever loved.Marriage to the wealthy heiress will help restore de Vere's decaying estates, but that is not why he accepts her bizarre proposal. He has grown to love her father as if he were his own, and if Mr. Pemberton selected him for his only child's husband, then Lord de Vere must honor the man's final wishes. Little does he suspect his father-in-law knows him better than he knows himself.\"HOME FOR CHRISTMAS\"20,000 words (about 85 pages)Heat index: Sweet For six long years, Captain David St. Vincent has dreamed of returning home to Ramseyfield—and to its prettiest resident, Elizabeth Balfour. To his astonishment, though, it is not Elizabeth, but her plain younger sister, Catherine, whose company he seeks. Cathy Balfour has worshiped David for as long as she can remember. It was she who wept when he left, she who presented him with a cross to keep him safe while in service to the crown, and she who read and carefully collected the newspaper accounts of his sea battles. But how can one as plain as she ever hope to win his heart?\"CHRISTMAS AT FARLEY MANOR\"Best Historical Novella of 2011* (This novella was first published as an eBook in 2011.)Approximate length: 21,000 words (about 100 pages)Heat index: SweetIt wasn't to be a real marriage. . .Harry Tate is an army captain of some means who is almost certain to die when he returns to Spain on the morrow. Elizabeth Hensley is a destitute beauty he's only too happy to help.Two years later. . .When they meet again at his ancestral home, Harry is now Viscount Broxbourne, bent on showing his wife how much he wants her to be his real viscountess by Christmas.",
  "genres": [
    "Christmas",
    "Romance",
    "Regency",
    "Historical Romance",
    "Holiday",
    "Anthologies",
    "Historical Fiction"
  ],
  "author": "Cheryl Bolen",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/16128396-christmas-brides"
}