{
  "title": "The Book of Barely Imagined Beings: A 21st Century Bestiary",
  "description": "From medieval bestiaries to Borges’s Book of Imaginary Beings, we’ve long been enchanted by extraordinary animals, be they terrifying three-headed dogs or asps impervious to a snake charmer’s song. But bestiaries are more than just zany zoology—they are artful attempts to convey broader beliefs about human beings and the natural order. Today, we no longer fear sea monsters or banshees. But from the infamous honey badger to the giant squid, animals continue to captivate us with the things they can do and the things they cannot, what we know about them and what we don’t. With The Book of Barely Imagined Beings, Caspar Henderson offers readers a fascinating, beautifully produced modern-day menagerie. But whereas medieval bestiaries were often based on folklore and myth, the creatures that abound in Henderson’s book—from the axolotl to the zebrafish—are, with one exception, very much with us, albeit sometimes in depleted numbers. The Book of Barely Imagined Beings transports readers to a world of real creatures that seem as if they should be made up—that are somehow more astonishing than anything we might have imagined. The yeti crab, for example, uses its furry claws to farm the bacteria on which it feeds. The waterbear, meanwhile, is among nature’s “extreme survivors,” able to withstand a week unprotected in outer space. These and other strange and surprising species invite readers to reflect on what we value—or fail to value—and what we might change. A powerful combination of wit, cutting-edge natural history, and philosophical meditation, The Book of Barely Imagined Beings is an infectious and inspiring celebration of the sheer ingenuity and variety of life in a time of crisis and change.",
  "genres": [
    "Nonfiction",
    "Science",
    "Nature",
    "Animals",
    "Natural History",
    "Biology",
    "History"
  ],
  "author": "Caspar Henderson",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/16128760-the-book-of-barely-imagined-beings"
}