{
  "title": "Vivid and Continuous: Essays and Exercises for Writing Fiction",
  "description": "Taking off from The Creative Writer’s Survival Guide , John McNally’srelentlessly blunt, bracingly cheerful, and immensely helpful map to being a writer, Vivid and Continuous is an equally blunt, cheerful, and helpful map to learning to be a writer. While acknowledging that many fine books cover such essentials of fiction writing as point of view, characterization, and setting, McNally sets out in this new book—intended as a supplement to beginning fiction-writing classes or as the sole text for upper-level or graduate courses—to solve the tricky second-tier problems that those books cover only in footnotes. Vivid and Continuous takes its inspiration from John Gardner, whose essential truths in On Becoming a Novelist clarified McNally’s goal of communicating a “vivid and continuous dream” with his own writing. In fifteen concise, energizing chapters, he dispenses advice gained from almost thirty years of studying, writing, and teaching. How do you avoid the pitfalls inherent in the most common subjects for stories? How do you create memorable minor characters? What about managing references to pop culture without distracting your readers, revising a story to bring its subtext into focus, or exploring the twenty most common craft-related quirks that lessen immediacy for your readers? How do you keep from overdosing on similes and metaphors or relying on too many flashbacks to provide necessary backstory? How do you learn to listen when your story tries to talk to you? Finally, how can you resist “John McNally’s Sure-Fire Formula for Becoming Funnier in 30 Days”? McNally cites many novels and short stories as examples that best illustrate the lessons he wants to impart, the writer’s life, or the writer’s craft, as well as his own favorite authors’ novels and short story collections. Exercises at the end of each chapter reinforce its point and serve as practical catalysts for new writings and directions. Just blunt enough to get your attention but not blunt enough to crush you, challenging but not discouraging, personal but not ego-ridden, snarky but not mean, John McNally will prompt you to think more deeply about a variety of issues that will push you toward writing more meaningful, more accomplished work.",
  "genres": [
    "Writing",
    "Nonfiction"
  ],
  "author": "John McNally",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/16128791-vivid-and-continuous"
}