{
  "title": "The Best Women's Travel Writing, Volume 9: True Stories from Around the World",
  "description": "Anyone whose passport has been stamped a few times knows the surest method of keeping the travel fire alive: by reading and telling stories from the road, passing them along like a torch in a relay race.From Travelers’ Tales comes The Best Women’s Travel Writing, Volume 9: True Stories from Around the World—the ninth collection in the annual best-selling, award-winning series that invites readers to ride shotgun alongside intrepid female nomads as they travel the globe to discover new places, people, and facets of themselves. The stories in this edition are as diverse as the destinations, the common thread being fresh, compelling storytelling that will make you laugh, weep, wish you were there, or be glad you weren’t.In The Best Women's Travel Writing, Volume 9, readers will:Tangle with snakes and alligators in BangladeshChase tornadoes with Chinese celebrities Dodge fireballs while half-naked in EcuadorGet stuck in the mud by the Ganges in IndiaHunt frogs in a Louisiana bayouGet cheerfully deported from South AfricaBe transformed by a Mexican revolutionSurvive close encounters with rhinos in NamibiaExperience life under niqab in Egypt Climb a volcano during a hailstorm in Rwanda Find love in a tree house in Laos ... and much, much more.Featuring stories by Holly Morris, Marcia DeSanctis, Apricot Irving Anderson, Laura Fraser, Amanda Jones, and Laura Resau. About the author: Lavinia Spalding is the author of Writing Away: A Creative Guide to Awakening the Journal-Writing Traveler (named one of the best travel books of 2009 by the Los Angeles Times), co-author of With a Measure of Grace, the Story and Recipes of a Small Town Restaurant, and editor of the 2011, 2012 and 2013 editions of The Best Women's Travel Writing. She’s a regular contributor to Yoga Journal, and her work has appeared in many print and online publications, including Sunset, San Francisco magazine, The San Francisco Chronicle, Gadling, Post Road, Tin House, Inkwell, and The Best Travel Writing, Volume 9. She lives in San Francisco, where she’s a member of the Writers' Grotto and co-founder of Weekday Wanderlust, a monthly travel reading series.",
  "genres": [
    "Travel",
    "Nonfiction"
  ],
  "author": "Lavinia Spalding",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/16129292-the-best-women-s-travel-writing-volume-9"
}