{
  "title": "Hothouse: The Art of Survival and the Survival of Art at America's Most Celebrated Publishing House, Farrar, Straus, & Giroux",
  "description": "Farrar, Straus and Giroux is arguably the most influential publishing house of the modern era. Home to an unrivaled twenty-five Nobel Prize winners and generation-defining authors like T. S. Eliot, Flannery O’Connor, Susan Sontag, Tom Wolfe, Joan Didion, Philip Roth, and Jonathan Franzen, it’s a cultural institution whose importance approaches that of The New Yorker or The New York Times. But FSG is no ivory tower—the owner's wife called the office a “sexual sewer”—and its untold story is as tumultuous and engrossing as many of the great novels it has published.Boris Kachka deftly reveals the era and the city that built FSG through the stories of two men: founder-owner Roger Straus, the pugnacious black sheep of his powerful German-Jewish family—with his bottomless supply of ascots, charm, and vulgarity of every stripe—and his utter opposite, the reticent, closeted editor Robert Giroux, who rose from working-class New Jersey to discover the novelists and poets who helped define American culture. Giroux became one of T. S. Eliot’s best friends, just missed out on The Catcher in the Rye, and played the placid caretaker to manic-depressive geniuses like Robert Lowell, John Berryman, Jean Stafford, and Jack Kerouac. Straus, the brilliant showman, made Susan Sontag a star, kept Edmund Wilson out of prison, and turned Isaac Bashevis Singer from a Yiddish scribbler into a Nobelist—even as he spread the gossip on which literary New York thrived.A prolific lover and an epic fighter, Straus ventured fearlessly, and sometimes recklessly, into battle for his books, his authors, and his often-struggling company. When a talented editor left for more money and threatened to take all his writers, Roger roared, “Over my dead body”—and meant it. He turned a philosophical disagreement with Simon & Schuster head Dick Snyder into a mano a mano media war that caught writers such as Philip Roth and Joan Didion in the crossfire. He fought off would-be buyers like S. I. Newhouse (“that dwarf”) with one hand and rapacious literary agents like Andrew Wylie (“that shit”) with the other. Even his own son and presumed successor was no match for a man who had to win at any cost—and who was proven right at almost every turn.At the center of the story, always, are the writers themselves. After giving us a fresh perspective on the postwar authors we thought we knew, Kachka pulls back the curtain to expose how elite publishing works today. He gets inside the editorial meetings where writers’ fates are decided; he captures the adrenaline rush of bidding wars for top talent; and he lifts the lid on the high-stakes pursuit of that rarest commodity, public attention—including a fly-on-the-wall account of the explosive confrontation between Oprah Winfrey and Jonathan Franzen, whose relationship, Franzen tells us, “was bogus from the start.”Vast but detailed, full of both fresh gossip and keen insight into how the literary world works, Hothouse is the product of five years of research and nearly two hundred interviews by a veteran New York magazine writer. It tells an essential story for the first time, providing a delicious inside perspective on the rich pageant of postwar cultural life and illuminating the vital intellectual center of the American Century.",
  "genres": [
    "Nonfiction",
    "Books About Books",
    "History",
    "Biography",
    "Writing",
    "Memoir",
    "New York"
  ],
  "author": "Boris Kachka",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/16130059-hothouse"
}