{
  "title": "Game",
  "description": "From a former police officer, the first novel in a groundbreaking Scandinavian trilogy about a deadly game that blurs the line between reality and fiction in a world obsessed with social media.After a long night of partying, Henrik “HP” Pettersson, a slacker with a big ego and no impulse control, heads home on the train. Finding a mobile phone from an unknown company, HP begins receiving messages—addressed to him—inviting him to play a game by a secret and insistent master. HP doesn’t hesitate before agreeing to play.HP is the perfect contender: he is alienated from society, devoid of morals, and wants to be a star. The assignments, ranging from childish pranks to criminal acts, are all filmed and uploaded onto a protected server where viewers rate the players’ performances. Everything is coordinated by a mysterious Game Master, unknown to the players or the viewers. But before long, the game spills out into the real world and threatens innocent people.HP’s sister, Rebecca, is a bodyguard with the Swedish Security Police. The opposite of her brother, she is haunted by traumatic memories and dark secrets from her past. As the game continues, Rebecca begins to realize that her past may not be so secret after all. HP’s assignments become increasingly risky, and he pushes beyond acceptable limits, determined to become a superstar. In the hunt for bigger risks, HP loses touch with reality and puts his own sister in danger. Will HP’s loyalty to the game win out over his love for his family? Or will he come back to reality and save his sister?With an intriguing blend of break-neck suspense, humor, and informed commentary on social media, Game takes Scandinavian crime fiction to the next level.",
  "genres": [
    "Thriller",
    "Fiction",
    "Crime",
    "Mystery",
    "Audiobook",
    "Swedish Literature",
    "Mystery Thriller"
  ],
  "author": "Anders de la Motte",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/16130125-game"
}