{
  "title": "The Last Word",
  "description": "\"The Last Word is Raymond Chandler meets Arrested Development. Zany, witty, and full of dark surprises, Lisa Lutz's novel is pure fun—and Izzy Spellman, PI, tops the list of 'Fictional Characters I'd Like to Meet for a Bourbon.'\"—Gillian Flynn, New York Times bestselling author of Gone GirlThe sixth installment of the critically acclaimed, New York Times bestselling, Edgar- and Macavity-nominated and Alex Award-winning series by Lisa Lutz, finds our intrepid heroine of the series, Isabel Spellman, PI, at a crossroads. Izzy is used to being followed, extorted, and questioned—all occupational hazards of working at her family’s firm, Spellman Investigations. Her little sister, Rae, once tailed Izzy for weeks on end to discover the identity of Izzy’s boyfriend. Her mother, Olivia, once blackmailed Izzy with photo­graphic evidence of Prom Night 1994. It seemed that Spellman vigilance would dis­sipate after Izzy was fired for breaching client confidentiality, but then Izzy avenged her dismissal by staging a hostile takeover of the company. She should have known better than to think she could put such she­nanigans behind her. In The Last Word, Izzy’s troubles are just beginning. After her takeover of Spellman Investigations, her employees are the fur­thest thing from collegial...and Izzy finds herself struggling to pay the bills. But when she is accused of embezzling from a former client, the ridiculously wealthy Mr. Slayter, the stakes become immense. If Izzy gets indicted, she could lose her PI license and the Spellman family’s livelihood, not to mention her own freedom. Is this the end of Izzy Spellman, PI? The Last Word is, hands down, the most powerful book in the bestselling, award-nominated Spellman series.",
  "genres": [
    "Mystery",
    "Humor",
    "Fiction",
    "Adult",
    "Mystery Thriller",
    "Audiobook",
    "Contemporary"
  ],
  "author": "Lisa Lutz",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/16130105-the-last-word"
}