{
  "title": "The Big Fat Surprise: Why Butter, Meat and Cheese Belong in a Healthy Diet",
  "description": "In The Big Fat Surprise, investigative journalist Nina Teicholz reveals the unthinkable: that everything we thought we knew about dietary fat is wrong. She documents how the low-fat nutrition advice of the past sixty years has amounted to a vast uncontrolled experiment on the entire population, with disastrous consequences for our health.For decades, we have been told that the best possible diet involves cutting back on fat, especially saturated fat, and that if we are not getting healthier or thinner it must be because we are not trying hard enough. But what if the low-fat diet is itself the problem? What if the very foods we’ve been denying ourselves—the creamy cheeses, the sizzling steaks—are themselves the key to reversing the epidemics of obesity, diabetes, and heart disease?In this captivating, vibrant, and convincing narrative, based on a nine-year-long investigation, Teicholz shows how the misinformation about saturated fats took hold in the scientific community and the public imagination, and how recent findings have overturned these beliefs. She explains why the Mediterranean Diet is not the healthiest, and how we might be replacing trans fats with something even worse. This startling history demonstrates how nutrition science has gotten it so wrong: how overzealous researchers, through a combination of ego, bias, and premature institutional consensus, have allowed dangerous misrepresentations to become dietary dogma.With eye-opening scientific rigor, The Big Fat Surprise upends the conventional wisdom about all fats with the groundbreaking claim that more, not less, dietary fat—including saturated fat—is what leads to better health and wellness. Science shows that we have been needlessly avoiding meat, cheese, whole milk, and eggs for decades and that we can now, guilt-free, welcome these delicious foods back into our lives.",
  "genres": [
    "Health",
    "Nonfiction",
    "Nutrition",
    "Food",
    "Science",
    "Audiobook",
    "History"
  ],
  "author": "Nina Teicholz",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/16130316-the-big-fat-surprise"
}