{
  "title": "Children of the Jacaranda Tree",
  "description": "A stunning debut novel set in post-Revolutionary Iran that gives voice to the men, women, and children who won a war only to find their lives–and those of their descendants - imperiled by its aftermath. We all have a tree inside us. Finding it is just a matter of time. Neda is born in Evin Prison, where her mother is allowed to nurse her for a few months before the arms of a guard appear at the cell door one day and, simply, take her away. Omid, at age three, witnesses the arrests of his political activist parents from his perch at their kitchen table, yogurt dripping from his fingertips. More than twenty years after the violent, bloody purge that took place inside Tehran's prisons, Sheida learns that her father was one of those executed, that the silent void firmly planted between her and her mother all these years was not just the sad loss that comes with death, but the anguish and the horror of murder. Neda, Omid, and Sheida are just three of the many unforgettable characters in Sahar Delijani's startling debut novel, Children of the Jacaranda Tree. Set in post-revolutionary Iran, from 1983 to 2011, it follows a group of mothers, fathers, children, and lovers, some connected by family, others brought together by the tide of history that forces its way into their lives. Finally, years later, it is the next generation that is left with the burden of the past and their country's tenuous future as a new wave of protest and political strife begins. Based on the harrowing experiences of Delijani, her family, and friends, Children of the Jacaranda Tree is a moving, timely drama about three generations of men and women moved by love, inspired by poetry, and motivated by dreams of justice and freedom. For fans of The Kite Runner and In the Shadow of the Banyan, it is a stunningly evocative look at the intimate side of revolution and a brilliant tribute to anyone who has answered the call of history.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Iran",
    "Book Club",
    "Contemporary",
    "Literary Fiction",
    "Novels"
  ],
  "author": "Sahar Delijani",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/16130324-children-of-the-jacaranda-tree"
}