{
  "title": "Rivers",
  "description": "For fans of Cormac McCarthy and Annie Proulx, “a wonderfully cinematic story” (The Washington Post) set in the post-Katrina South after violent storms have decimated the region.It had been raining for weeks. Maybe months. He had forgotten the last day that it hadn’t rained, when the storms gave way to the pale blue of the Gulf sky, when the birds flew and the clouds were white and sunshine glistened across the drenched land.The Gulf Coast has been brought to its knees. Years of catastrophic hurricanes have so punished and depleted the region that the government has drawn a new boundary ninety miles north of the coastline. Life below the Line offers no services, no electricity, and no resources, and those who stay behind live by their own rules—including Cohen, whose wife and unborn child were killed during an evacuation attempt. He buried them on family land and never left.But after he is ambushed and his home is ransacked, Cohen is forced to flee. On the road north, he is captured by Aggie, a fanatical, snake-handling preacher who has a colony of captives and dangerous visions of repopulating the barren region. Now Cohen is faced with a decision: continue to the Line alone, or try to shepherd the madman’s prisoners across the unforgiving land with the biggest hurricane yet bearing down—and Cohen harboring a secret that poses the greatest threat of all.Eerily prophetic in its depiction of a Southern landscape ravaged by extreme weather, Rivers is a masterful tale of survival and redemption in a world where the next devastating storm is never far behind.“This is the kind of book that lifts you up with its mesmerizing language then pulls you under like a riptide” (The Atlanta Journal-Constitution).",
  "genres": [
    "Fiction",
    "Dystopia",
    "Science Fiction",
    "Post Apocalyptic",
    "Survival",
    "Southern",
    "Apocalyptic"
  ],
  "author": "Michael Farris Smith",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/16130400-rivers"
}