{
  "title": "One Doctor: Close Calls, Cold Cases and the Mystery of Medicine",
  "description": "An epic story told by a unique voice in American medicine, One Doctor describes life-changing experiences in the career of a distinguished physician. In riveting first-person prose, Dr. Brendan Reilly takes us to the front lines of medicine today. Whipsawed by daily crises and frustrations, Reilly must deal with several daunting challenges simultaneously: the extraordinary patients under his care on the teeming wards of a renowned teaching hospital; the life-threatening illnesses of both of his ninety-year-old parents; and the tragic memory of a cold case from long ago that haunts him still. As Reilly’s patients and their families survive close calls, struggle with heartrending decisions, and confront the limits of medicine’s power to cure, One Doctor lays bare a fragmented, depersonalized, business-driven health-care system where real caring is hard to find. Every day, Reilly sees patients who fall through the cracks and suffer harm because they lack one doctor who knows them well and relentlessly advocates for their best interests.Filled with fascinating characters in New York City and rural New England — people with dark secrets, mysterious illnesses, impossible dreams, and many kinds of courage — One Doctor tells their stories with sensitivity and empathy, reminding us of professional values once held dear by all physicians. But medicine has changed enormously during Reilly’s career, for both better and worse, and One Doctor is a cautionary tale about those changes. It is also a hopeful, inspiring account of medicine’s potential to improve people’s lives, Reilly’s quest to understand the \"truth\" about doctoring, and a moving testament to the difference one doctor can make.",
  "genres": [
    "Medical",
    "Medicine",
    "Nonfiction",
    "Memoir",
    "Science",
    "Audiobook",
    "Health"
  ],
  "author": "Brendan Reilly",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/16130672-one-doctor"
}