{
  "title": "Weekends with Daisy",
  "description": "“A heartwarming and utterly charming story about empathy, hope, and letting go. Weekends with Daisy shows us how loving a dog can make us all a little more human.” —Lisa Genova, NYT bestselling author of Still Alice and Love, Anthony“Moving… with candor that will win over readers.” — Publishers Weekly“A deceptively simple but powerful account of family bonds, friendship, and the special relationship we have with dogs.” — Kirkus ReviewsWhen Sharron Luttrell, a journalist still deeply mourning the loss of her family dog, discovers a weekend puppy raiser program for a service dog organization, she knew it was just what she needed to help her move on. It seemed ideal; pick up a puppy on Friday, return it on Sunday night, get a new puppy each year. No strings attached. Well, it turns out there were strings – and they tugged at her every time she had to return “her dog” to its weekday caregiver.This memoir chronicles Sharron’s year co-parenting Daisy, a sweet Lab puppy, with Keith, Daisy’s other trainer. As Sharron and Keith develop a relationship she likens to “divorced parents handing over the kids,” she becomes curious about Keith’s life story. When Sharron uncovers a tragic event from Keith’s past, she realizes she must take a lesson from Daisy and “think like a dog”— react to circumstances in the present, not the past.Sharron applies this way of thinking at home too, using the lessons she learned from Daisy to mend her rocky relationship with her teenage daughter. Where once a dramatic eye roll from her daughter would have sparked a battle, Sharron has learned to employ the patience and understanding she practices with Daisy to become a better mom. As Sharron and Keith work tirelessly to ensure Daisy passes her service dog test, she is taught priceless lessons in empathy, compassion and affection. In the end, Sharron’s weekends with Daisy have taught her more than she could ever have imagined.",
  "genres": [
    "Nonfiction",
    "Animals",
    "Dogs",
    "Memoir",
    "Biography Memoir",
    "Own",
    "Biography"
  ],
  "author": "Sharron Kahn Luttrell",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/16130707-weekends-with-daisy"
}