{
  "title": "Rising Tide: Bear Bryant, Joe Namath, and Dixie's Last Quarter",
  "description": "The extraordinary story of how Coach Paul \"Bear\" Bryant and Joe Namath, his star quarterback at the University of Alabama, led the Crimson Tide to victory and transformed football into a truly national pastime.During the bloodiest years of the civil rights movement, Bear Bryant and Joe Namath-two of the most iconic and controversial figures in American sports-changed the game of college football forever. Brilliantly and urgently drawn, this is the gripping account of how these two very different men-Bryant a legendary coach in the South who was facing a pair of ethics scandals that threatened his career, and Namath a cocky Northerner from a steel mill town in Pennsylvania-led the Crimson Tide to a national championship.To Bryant and Namath, the game was everything. But no one could ignore the changes sweeping the nation between 1961 and 1965-from the Freedom Rides to the integration of colleges across the South and the assassination of President Kennedy. Against this explosive backdrop, Bryant and Namath changed the meaning of football. Their final contest together, the 1965 Orange Bowl, was the first football game broadcast nationally, in color, during prime time, signaling a new era for the sport and the nation.Award-winning biographer Randy Roberts and sports historian Ed Krzemienski showcase the moment when two thoroughly American traditions-football and Dixie-collided. A compelling story of race and politics, honor and the will to win, Rising Tide captures a singular time in America. More than a history of college football, this is the story of the struggle and triumph of a nation in transition and the legacy of two of the greatest heroes the sport has ever seen.",
  "genres": [
    "Sports",
    "Football",
    "History",
    "Nonfiction",
    "Biography"
  ],
  "author": "Randy W. Roberts",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/16131220-rising-tide"
}