{
  "title": "Remember Ben Clayton",
  "description": "From the author of the acclaimed best seller The Gates of the Alamo, a new novel that confirms and enlarges Stephen Harrigan’s reputation as a major voice in American fiction.Francis “Gil” Gilheaney is a sculptor of boundless ambition. But bad fortune and his own prideful spirit have driven him from New York into artistic exile in Texas just after World War I. His adult daughter, Maureen, serves as his assistant, although she has artistic ambitions of her own and is beginning to understand how her own career—perhaps even her life—has become hostage to her driven father’s “wild pursuit of glory.” When Lamar Clayton, an aging, heartbroken rancher, offers Gil a commission to create a memorial statue of his son Ben, who was killed in the war, Gil seizes the opportunity to create what he believes will be his greatest achievement.As work proceeds on the statue, Gil and Maureen come to realize that their new client is a far more complicated man than he appeared to be on first acquaintance, and that Lamar is guarding a secret that haunts his relationship with his son even in death. But Gil is haunted as by the fear that his work will be forgotten and by an unconscionable lie whose discovery could cost him his daughter’s love. The creation of the statue leads to a chain of dramatic encounters, through which Maureen will test the boundaries of her independence and Gil and Lamar, each in his own painful way, will confront their worth as fathers.Remember Ben Clayton vividly depicts a rich swath of American history, from the days when the Comanches ruled the Southern plains to the final brutal months of World War I. It ranges from outlaw settlements on the Texas frontier to the cafés of Paris, from Indian encampments to artists’ ateliers to the forgotten battlefield in France where Ben Clayton died. It shows us the all-consuming labor that a monumental work of sculpture demands and the price it exacts from both artist and patron. And with unforgettable power and compassion it presents a deeply moving story about the bonds between fathers and children, and about the power and purpose of art.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Book Club",
    "Historical",
    "Westerns",
    "Family",
    "War"
  ],
  "author": "Stephen Harrigan",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/10659750-remember-ben-clayton"
}