{
  "title": "The Missing Chapters",
  "description": "An emotional journy of learning to love again. Will a dark past be the ruin of their happily ever after?Jessica has issues. Not regular every day issues, but issues like her ex-fiancé lost his mind and tried to kill her - type issues. She survived her nightmare and moved to England to start fresh. Easier said than done. After living through her nightmare, she finds it difficult to trust anyone and she spends most of her time alone, writing stories about people who were happy, had normal lives and were always in love. One might call it ironic, however, Jessica saw it as more of a vision of what her life could have been like if she had never met Chris.One day while looking for inspiration for her book, Jessica runs into a young actor who had fallen from grace when he was involved in a near-fatal car accident that left him severely scarred and extremely bitter. Kellan wanted nothing to do with Jessica when she spoke to him. He was rude and distant, thinking she was simply another person who wanted to stare at his disfigurement. In spite of himself, he couldn't resist her clumsy charm, like the way she choked on her own saliva at the shock of seeing him, to her horrible jokes and her incredibly loud stomach growl. Within a week of knowing her, he was in love. Love doesn't mean easy, however, and while both of them found themselves engulfed in feelings they never imagined or hoped to ever feel again, it was like being on the Gemini of emotional rollercoasters. As emotions spiraled out of control and countless tears had been shed, Jessica and Kellan learned to finally believe in trust, love and each other and life was finally wonderful for Jessica and Kellan. They made an enviable life together, they were deeply in love, their careers were flourishing, and they started a family. How could they know that the nightmare that had nearly killed Jessica was about to reoccur? No one knew that Chris was free, no one that would warn them that is. Seeking revenge for abandoning him, Chris comes for Jessica. He wants to make her pay for leaving him. But most of all, he wants her back because she is his. No one can keep them apart and they will be together forever - one way or the other.With barely any leads and no knowledge of Chris' freedom, Kellan begins a tireless search for his missing wife. With the help of Jessica's best friend, Alicia, they begin to find clues as to what happened and who had taken her. Reluctantly, Alicia fills Kellan in to all of the tortures that Chris had put Jessica through. Unimaginable tortures that she had tried so hard to forget. As Kellan cried, all he could think was, \"Oh God please! Help me find her in time!\"- but time was running out…",
  "genres": [
    "Thriller"
  ],
  "author": "Off the Market578",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/16132185-the-missing-chapters"
}