{
  "title": "The Journey to Whitestone",
  "description": "Another romantic thriller from one of Amazon’s bestselling thriller authors, but this time with a paranormal theme.  If dreams present a way to live a fairytale life eternally, why wouldn’t you want to live in one forever?   WORDS OF PRAISE FORJOHNNY RAY'S NOVELSJohnny Ray, a master of romantic suspense, never disappoints his readers. His books are guaranteed to grab you and not let go. If you like a little suspense with your romance, try Johnny Ray. Single Titles Book Reviews  Johnny Ray has the unique ability to blend intense thrillers with hot romances, making him one writer you definitely want to follow ---- KINDLE BOOK PROMOS Johnny Ray is able to really bring out just what we need in a good romantic thriller. There was a lots of mystery.....who was doing what?.... who done it?....you will be kept wondering up until the very end of this read---- Arlena Dean, book reviewer Johnny Ray is a great writer and an even nicer person. His willingness to help other writers out in their pursuits is a pleasure for everyone involved ---- Author Brian Brown Johnny Ray is quickly making a name for himself as the master of the romantic thriller---- JT Kalnay is a writer and a patent attorney Johnny Ray is one author you won't want to miss. He writes suspense and adds a touch of romance. And....who doesn't like a little romance? Add Johnny Ray to your list of \"must\" check out for the new year.----SILVER'S REVIEWSJohnny Ray offers interesting stories, likeable characters, well developed plots, and satisfying endings in his fun-to-read, fast-paced novels. My favorite is Journey to Whitestone with a metaphysical conspiracy storyline---HOT CHOCOLATE, IT'S A MYSTERY BLOG   THE JOURNEY TO WHITESTONEA PARANORMAL ROMANCE&BOOK ONEINTHE DREAM MASTER SERIESBYJohnny Ray  THE JOURNEY TO WHITESTONE, an 82,000-word paranormal romance, and the first in this Dream Master series, is set in Atlanta, Georgia and the Great Smokey Mountains of Tennessee.As Jacquelyn Parker struggles with her life spinning out of control, resulting in a bitter divorce, and her career ruined, she is sucked into a sinister world of late-night sleazy bars. It is her last minute prayer that fortunately finds its way to the Dream Master who controls the gates to Whitestone, a side door to heaven, and the next step in enlightenment. From her dreams she learns that she only has one chance to reunite with her one true love and advance to the next level of enlightenment.In order for Jacquelyn to master the four steps of enlightenment and find her true love, the Dream Master summons the assistance of other enlightened ones who teach Jacquelyn various philosophies from the Tai chi to the Karma Sutra to guide her path.After centuries of missing her true love in time and space, Jacquelyn has only one last chance to get it right, and live the ultimate happy ever after life. If she is unsuccessful, however, she will have to live with the tragic failure forever.  Return to the upper right corner to purchase your copy now!",
  "genres": [],
  "author": "Johnny Ray",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/16132600-the-journey-to-whitestone"
}