{
  "title": "Amontillado",
  "description": "\"Call me Fortunato. You won't be the first.\"So begins Amontillado, a unique tale of lust, infidelity, and murder. From rainy street corners to candlelit bookstores to hidden tunnels deep below a nameless city, you'll be transported to a surreal world in which motives are mysterious, intentions are unclear, emotions wreak havoc, and one person's desire for adventure will lead everyone down a dangerous path.Jacob Lyons is a writer, a drunk, and a bad husband, but he is no murderer. After an unfortunate encounter on a thunderous street corner, he finds himself surrounded by hostile detectives accusing him of being exactly that.Daniel Jefferson is Jacob's only friend. Despite problems of his own, he is determined to help Jacob overcome the downward spiral of a crumbling life, but he can't foresee the trouble that awaits.Breeana is a book lover who escapes her tired marriage by attending literary discussions and book club gatherings. One stormy night, when the electricity fails and her group discusses The Cask of Amontillado by Edgar Allan Poe, she meets an intriguing newcomer who ignites her passions and offers the adventure she desires.That intriguing newcomer is the witty and mysterious Marcus McComber, a man with a dark past and darker intentions. He will tell the tale of his romantic conquests to the fellow who sits beside him every night at the local tavern: the writer, the drunk, the accused murderer named Jacob Lyons.Amontillado is a circular experiment in repressed desire, unrequited love, uncontrollable passion, and the need for control, all mixed with the inexplicable evils of human nature that each can inspire. In the macabre tradition of Edgar Allan Poe himself, the story propels itself to a stunning conclusion, begging you to answer one simple question:Who kills who?",
  "genres": [
    "Mystery",
    "Fiction"
  ],
  "author": "Kevin Koperski",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/16132315-amontillado"
}