{
  "title": "Safe Harbour",
  "description": "In her fifty-ninth bestselling novel, Danielle Steel tells an unforgettable story of survival...of how two people who lost everything find hope...and of the extraordinary acts of faith and courage that bring —and keep— families together...On a windswept summer day, as the fog rolls across the San Francisco coastline, a solitary figure walks down the beach, a dog at her side. At eleven, Pip Mackenzie's young life has already been touched by tragedy; nine months before, a terrible accident plunged her mother into inconsolable grief. But on this chilly July afternoon, Pip meets someone who fills her sad gray world with color and light. And in her innocence and in his kindness, a spark will be kindled, lives will be changed, and a journey of hope will begin.From the moment the curly-haired girl walks up to his easel on the sand, Matt Bowles senses something magical about her. Pip reminds him of his own daughter at that age, before a bitter divorce tore his family apart and swept his children halfway across the world. With her own mother, Ophélie, retreating deeper into her grief, Pip spends her summer at the shore the way lonely children watching the glittering waters and rushing clouds, daydreaming and remembering how things used to be. That is, until she meets artist Matt Bowles, who offers to teach the girl to draw—and can't help but notice her beautiful, lonely mother. At first, Ophélie is thrown off balance by her daughter's new companion—until she realizes how much joy he is bringing into their lives, despite the sadness she sees in his eyes. As their newfound friend works his subtle magic, mother and daughter slowly begin to heal, to laugh again, to rediscover what they have lost.When summer ends, and Ophélie and Pip must leave the beach for the city, the season of healing continues. Gathering her newfound strength, Ophélie begins a volunteer job at a city outreach program, where she works with the homeless, and can no longer ignore the blessings in her own life. But as soul-sharing phone calls and autumn beach getaways deepen Ophélie and Matt's friendship, fate strikes another blow. Out of the blue, Matt must confront unfinished business from his past. Days later, Ophélie is struck by a stunning betrayal by someone she trusts. And as these events reverberate in two already wounded hearts, something extraordinary happens. Out of the darkness that has shadowed them both comes an unexpected gift of hope.With grace and compassion, Danielle Steel explores the fragile bonds between mothers and daughters, husbands and wives, family members and lifelong friends. Her haunting, impassioned novel takes us across the complex landscape of loss—to the blessings that arise from even the darkest tragedies. At once a story of triumph and a moving elegy to those who suffer and survive, Safe Harbour is perhaps her most powerful and life-affirming novel to date.",
  "genres": [
    "Romance",
    "Fiction",
    "Chick Lit",
    "Contemporary Romance",
    "Contemporary",
    "Drama",
    "Novels"
  ],
  "author": "Danielle Steel",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/1613427.Safe_Harbour"
}