{
  "title": "Jaded",
  "description": "Rags to Riches… The queen is not born– she is forged through survival. You've read the Mistress and Master of Restraint series in present day. Join Regina Regal nineteen years in the past to where it all began with Jaded. Even as a scholarship student, Regina Regal is the brightest at Hillbrook Prep, causing her to straddle two extremes between the destitute class she dwells in and the affluent she visits daily. Neither of which welcomes her with open arms, forcing her to choose between her people and her friends. While dealing with insurmountable loss, Regina has more burdens placed upon her shoulders than the average adult could carry. With her mother dying, Regina has a difficult time crossing the line from caregiver to daughter in order to have both her mother’s and her own emotional needs met. Regina is struggling to keep her head above water as she takes on more debt from her mother’s mounting medical bills and living expenses, only to realize she is drowning. At eighteen, with a college scholarship guaranteeing she will join the ranks of her one-percenter classmates, Regina should have the world at her fingertips. Since she was young, Regina has been the provider, creating a young woman who has the need to survive and a hunger to be in control. But she finds herself falling apart, making horrible decisions that have lifelong consequences. Regina Regal’s life changes irrevocably when her best friend, Adelaide, invites her to study at the imposing Whittenhower Estates. Going against her instincts, Regina is compelled to visit Misery Castle. The girl who entered Misery Castle’s iron gate will not be the jaded woman who flees it almost five years later… Publishers NoticeThe author did an extensive rewrite on this title, and the entire Mistress & Master of Restraint series. Not just editing and formatting, but a rewrite to where it's #NotTheSameBook #NotTheSameSeries The final republished editions began in early 2015 with Restraint, and mid-2017 with Checkmate so far. Reviews written before those dates may include elements that are no longer contained within the book, or the series as a whole. The author apologizes for any confusion this may cause. To avoid any reader having to repurchase the titles (via Amazon), no matter the significant changes in the contents, they are listed as the same book. Readers who are in possession of the old edition only need to update their copies via Amazon.Ms. Chilson also requests for those who reread the series to update their reviews and ratings accordingly, either for the positive or the critical, to help readers make informed decisions on whether or not to read based on what is currently in the final editions of the series. Thank you",
  "genres": [
    "BDSM",
    "Erotica",
    "Menage",
    "Romance"
  ],
  "author": "Erica Chilson",
  "average_rating": "4.66",
  "url": "https://www.goodreads.com/book/show/16134544-jaded"
}