{
  "title": "The Gearing Incident",
  "description": "OCTOBER, 1962: The discovery of soviet missiles in Cuba has sparked a confrontation with global implications. Soviet Union Premier Nikita Khruschev and United States President John F. Kennedy face off in a perilous chess game of heightened military readiness, hard-line policy, and round-the-clock negotiation. When the USS Gearing is suddenly lost at sea and believed to be destroyed by a soviet submarine attack, diplomacy becomes abruptly and absolutely irrelevant. Around the world, bombs fall, and the stage is set for what will become the darkest and most desperate expanse of human conflict. Unknown to anyone else, the USS Gearing encountered a strange storm in 1962 which sent it twenty years into the future.OCTOBER, 1982: The USS Gearing reappears in the Atlantic, and its proximity to Cuba violates the terms of the Soviet-American Armistice of 1977. President Ronald Reagan leads Free America as fighting is renewed between mighty navies on the high seas, and between soviet occupation forces and homeland defenders in California, Florida, and the Carolinas. A weakened United States on the brink of soviet domination, with NATO and allied governments in exile, prepare for the final battle to decide the fate of the free world and prevent the extinction of freedom and democracy.Professor Edwin Theodore Burnside and three of his students, due to being in the presence of a mysterious artifact, are alone in their awareness that something is wrong with this alternate reality in 1982. Once investigation yields a plausible theory on how to repair the timeline, Professor Burnside embarks on a mission to save the world from an apocalyptic war. The alteration in reality caused by the USS Gearing travelling through time affords Professor Burnside a second chance to keep his childhood friend from once again becoming the one that got away. Eventually, he will be forced to decide if he should go ahead with his mission even if it means erasing from history the woman he loves.",
  "genres": [],
  "author": "W.D. Laremore",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/16135258-the-gearing-incident"
}