{
  "title": "Miss Marple: The Complete Short Stories",
  "description": "At last - all 20 Miss Marple short stories in a single volume!Jane Marple is from the village of St Mary Mead and applies her skills of observation and deduction to a wide variety of mysteries. Several of the supporting characters appear in many of these stories, including her nephew Raymond West, Dolly and Arthur Bantry of Gossington Hall, and Sir Henry Clithering formerly of Scotland Yard. Miss Marple made her first appearance in a book in 1930, and her twelfth and final novel was published shortly after Agatha Christie's death almost 50 years later. In the intervening years Miss Marple also featured in 20 short stories, published in a number of different collections. But never before have they been available together.In this complete volume, Miss Marple uses her unique insight to deduce the truth about a series of unsolved crimes - cases of a girl framed for theft, some disappearing bloodstains, the cryptic last message of a poisoned man, a woman killed within days of writing her will, a spiritualist who predicts death, a mortally wounded stranger in a church, a Christmas tragedy...In all 20 ingenious crimes, every one guaranteed to keep you guessing until the turn of the final page.\n'The plots are so good that one marvels... most of them would have made a full length thriller'\n - Daily MirrorThe twenty stories are: 1. The Tuesday Night Club (1927) 2. The Idol House of Astarte (1928)3. Ingots of Gold (1928) 4. The Bloodstained Pavement (1928)5. Motive v. Opportunity (1928)6. The Thumb Mark of St Peter (1928)7. The Blue Geranium (1929)8. The Companion (1930)9. The Four Suspects (1930)10. A Christmas Tragedy (1930)11. The Herb of Death (1930)12. The Affair at the Bungalow (1930)13. Death by Drowning (1931)14. Miss Marple Tells a Story (1935)15. Strange Jest (1941)16. Tape-Measure Murder (1941)17. The Case of the Caretaker (1942) 18. The Case of the Perfect Maid (1942) 19. Sanctuary (1954)20. Greenshaw's Folly (1956)",
  "genres": [
    "Mystery",
    "Agatha Christie",
    "Short Stories",
    "Fiction",
    "Classics",
    "Crime",
    "Mystery Thriller"
  ],
  "author": "Agatha Christie",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/16135457-miss-marple"
}