{
  "title": "Bedbugs: Can you see them?",
  "description": "SYNOPSIS OF ‘BEDBUGS – CAN YOU SEE THEM?’‘NIGHT, NIGHT, SLEEP TIGHT AND DON’T LET THE BEDBUGS BITE’In 1977, an alien spaceship crashed down to earth, landing deep within the soil in a small County called ‘Lemonsville’. During the night people were slaughtered, but the next day the killers disappeared.In 2020, the area where the spaceship landed was levelled off and new houses were built over it. Many foreigners were now living in the UK, and so more houses needed building.A small earthquake shook Lemonsville in the year 2050. This was the opening needed for the new creatures of the night to attack the living. Deep, deep down beneath the ground, the alien queen had given birth to a new killer. The earth tremor had produced an escape route for her new babies to hunt for food. Human food...Now, a young boy has been brutally slaughtered by someone or something? His parents are accused of his murder. There are no clues to convince the police otherwise, and the parents aren’t talking. They are too shocked to say anything.The murders are all being committed by a black mass, a mass that consists of many small insects, just like the household bedbug, but these bugs are not like the usual bloodsuckers we get on earth, these deadly creatures from another world are soldiers, like ants, and they have been ordered to find food by their queen who lies in wait inside the spaceship. She’s no strength to escape and after being stuck underground for 73 years is finding it hard to move around. Her original babies died hours after landing on earth in 1977, so the new breed of bugs have had to wait for an earth tremor to make a path for them to teleport out of the spaceship and up to the surface. She needs food and needs it quickly so she can be strong enough to transform back into her original body, the body of a warrior back on her planet.Daniel Boone, the local police chief, must find a way to solve the mystery of why the poor boy was torn apart in his bed, and why people have gone missing from their homes. As the days unfold and the nightmare continues, it takes Daniel back in time to what happened in 1977. He remembers a conversation he had with his Grandfather of a murdering spree that happened in Lemonsville for one night in the summer of 1977. His Grandfather was eight years old back then. Now Daniel is fighting against time to work out the link between the murders back then to the murders of now. The police officers have to work overtime to crack down on what’s happening, and any clues are investigated, but all think that the murders are being done by a human and they have a target in mind, but when they go to arrest him, they hear him being slaughtered as they try to break down his front door. The next day begins and one of the officers finds bugs stuck to the bottom of his work boot, but when he turns on the light they ignite and burn to a crisp. He thinks nothing of it, but eventually other stories of bug’s surface, and they all sound like the same kind of bug.A rush is on to locate the bugs and to find out the story as to why they are here, so the chief visits his grandfather to listen to what he saw back in 1977. No one saw the bugs back then, but the murders were all done in the same way. This could well help the chief, but the queen is now strong enough to surface and she’s even hungrier than before. Her hunter instincts take over and she attacks human prey.The police force need to eliminate the queen and then find out how to eliminate the bedbugs, the bugs that only appear at night.Will Lemonsville suffer more heartache or will Dan and his officers succeed in their attempts at putting a stop to the misery of this town??As each hour ticks by more victims are falling prey to the alien creatures, so will Dan work out the link and save the people of Lemonsville, or will he too fall down and be destroyed by the things that want to take over the WORLD...",
  "genres": [
    "Horror"
  ],
  "author": "L.A.  Taylor",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/16135906-bedbugs"
}