{
  "title": "Chase: Complete Series",
  "description": "Follow presidential candidate Chase Underwood and former escort Larissa Jacobs' sensual and tumultuous journey from beginning to end.PART I: ChaseLarissa Jacobs' financial debt is climbing after a failed attempt at becoming the next big thing in Hollywood. After losing her job as a party clown, Larissa's roommate gets her a gig working for an escort service. Her first client is Senator Chase Underwood: hot, married, and the current presidential candidate. Will his penchant for sexual domination destroy his prospects of world domination?PART II: DisclosureLarissa Jacobs' financial debt may be a thing of the past, now that Senator--and the all-but-certain future president--Chase Underwood has offered her a lucrative position in his campaign. But, like the rest of Chase's staffers, Larissa is asked to sign a nondisclosure agreement; only Larissa's NDA comes with some interesting stipulations that may make or break their arrangement.PART III: ExposureLarissa Jacobs has finally found the man of her dreams in presidential candidate Chase Underwood, but her dreams of happily ever after have been put on hold indefinitely. When a feature in the L.A Times exposes their affair, Chase and Larissa are thrust into the center of a scandal that will rock the nation and the very foundation of their love.PART IV: ClosureAfter the scandal caused by her affair with presidential candidate Chase Underwood, Larissa Jacobs is flown to his lavish villa in Tuscany. Larissa watches the news coverage of Chase's victory and fantasizes about him storming into the villa and making good on his promise to marry her. But her fantasies are becoming less and less appealing with every day they spend apart. It doesn't help that the hot Secret Service agent assigned to guard her has become the only person she can speak to.Will Larissa remain true to her promise to wait for Chase? Will Chase finally put his love for Larissa before his career?",
  "genres": [
    "Romance",
    "Erotica",
    "Contemporary",
    "Erotic Romance",
    "BDSM",
    "Adult",
    "Contemporary Romance"
  ],
  "author": "Cassia Leo",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/16135652-chase"
}