{
  "title": "The Ghost Chasers Daughter",
  "description": "WAR! WITCHES! SORCERERS! SPIES! In this collection of short stories, Emily Hill introduces us to the most despicable characters whose greed, avarice, and opportunism tangles them in such a way as to make the outcomes of their situations... downright delightful! In Paperback for Halloween 2012: A Full Anthology! 24-short story collection In eBook format for Halloween: The newest from The Ghost Chaser's Daughter, Emily Hill, including: Checkmate! How feverishly brutal can one marriage become? Charles and Clare, an elderly Seattle couple, provide us with the answer to this riddle in Checkmate! Charles, with his failing eyesight and frustrating deafness parses with Clare, his beauty-queen wife of past, as she plots her escape from the richly appointed manor which has become her prison. Checkmate! When is a marriage worth more than a thirty-six dollar check, but less than a successful chess move?Lightning Strikes: Poor Dennis Sheridan, Florida-native. Considering what he has been through he does not need a suspicious officer of the law on his doorstep asking about his wife of twenty-four years; particularly as he brushes the dirt from her grave off of his hands. Grove of Terror: Civil War Union Officer Speck is on a mission to save the slaves along the Carolina Ghost Coast - an admirable mission. That is, he's on an admirable mission until he learns that buried treasure lies within yards of where a battle is to take place the next morning between the Confederate line and General Gilmore's 62nd Ohio regiment. The favorite of author Emily Hill, she shares Grove of Terror with her readers once again in case they haven't had the pleasure of Officer Speck's company. To Kill Ivan Gorsky: Written as a salute to the Hungarian revolution attempt of October 1956. Who is Ivan Gorsky and why would even angels want him dead? Tour the Budapest Opera House and spend the night in the company of this Russian intelligence agent as he faces performance hall angels, and his own devils. You'll soon see why the mission was always, \"To Kill Ivan Gorsky\".Chunya, And The Hungarian Witch: \"Oh! She's so ugly!\" And, at this exclamation from neighbors, the new mother beamed at her newborn daughter. Learn why - from the beginning of all folklore and legends - little girls from the village of ́Opusztaszer are so. . . \"Chunya!\" This folklore tale, delivered straight from Transylvania, features the vanity of a forest witch and the revenge of a Hungarian sorcerer. This five-story eBook collection IS INCLUDED in the PAPERBACK Edition of The Ghost Chaser's Daughter - a full anthology of Ms. Hill's legends and folklore collection.",
  "genres": [],
  "author": "Emily Hill",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/16141411-the-ghost-chasers-daughter"
}