{
  "title": "When Someone you Care For is Sick: Emotional, Psychological and Spiritual Guidance",
  "description": "Illness may rarely be easy; but it can become a time of growth. Friends, family and professionals no longer have to feel helpless at the bedside of a patient. When all understand the psychological, emotional and spiritual needs that arise at this time of life, they can assist effectively, with wisdom and care. The patient, too, benefits from learning new ways of approaching illness. This book opens new vistas, and shows one how to remain positive, mobilize inner resources and use this time of life to develop a deeper connection to others and to oneself.During years of working as a psychologist, therapist and workshop leader with the seriously ill, their families and professional staff, Dr. Shoshanna realized that so little was known about how to handle the emotional and spiritual aspects of illness, change and loss. She saw what a huge difference it made when emotional, psychological, social and spiritual questions were handled sensitively, with wisdom and knowledge. She developed a unique program, the outcome of over 500 workshops she ran for patients, family, healthcare professionals, clergy and others, workshops given at hospitals, universities, guidance centers and in the community. Some of the places these workshops have been presented include Marymount College, Adelphi University, JFK Hospital, Columbia Presbyterian Hospital, North Shore Child Guidance, Attitudinal Healing Center, Interfaith Seminary, and New York Zen Studies Society. The specially designed exercises in this book provide an integration of psychological, spiritual and practical principles. When these principles are applied, this time of life can become one of meaning, healing, and communication, rather than one of difficulty and despair.Above all, this is practical work. During the course of this program family members and caregivers also learn about themselves. They discover the full spectrum of their own feelings, needs and responses. When we understand the dynamics of illness, loss and change and what it requires of us, we can then become truly available to others. In order to provide ongoing care and prevent burn out, everyone's situation must be addressed and balance attained for all.Praise for Dr. Shoshanna’s other “Dr. Shoshanna’s words are wonderful!”--Marianne Williamson“A powerful, potentially life-changing book.”–Body & Soul\"Shoshanna has some insightful things to say about anger in the family, in the workplace, at God and at destiny. This book can change the way you view yourself and others. It will help you give up grudges, stop blaming others and playing the victim.\"--Spirituality & Health“Dr. Shoshanna challenges us to let go of fantasies, expectations, fears and anticipation so we can be fully present to life. Her wisdom is genuine and deeply considered. Her book is well worth reading.”--Spiritual Parenting",
  "genres": [],
  "author": "Brenda Shoshanna",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/10663469-when-someone-you-care-for-is-sick"
}