{
  "title": "Awake in the Dream World: The Art of Audrey Niffenegger",
  "description": "Otherworldly, provocative, and strange, Awake in the Dream World channels the looming, historical grimness of the classic fairy tale, illuminating the dichotomy between the real and imagined through the context of fantasy, and bringing to life a macabre ensemble of folkloric characters. Awake in the Dream World is a mid-career retrospective of artist and author Audrey Niffenegger (The Time Traveler's Wife, bestselling novel turned feature film), reflecting her talent for cultivating a captivating narrative exclusively through pictures and her own confrontations with life, mortality, and magic.Niffenegger's fantastical body of work is reminiscent of renowned pen and ink predecessors such as Edward Gorey, Aubrey Beardsley, Egon Schiele, Edward Dulac, and Horst Janssen, but with a brutally honest and unapologetically strange female perspective that touches upon the universal trials of life-death and decay, love, jealousy, redemption, and the inevitability of change. Her works on paper, lithographs, and aquatints reflect the often surreal narratives of her artist's books. Through self-portraiture, Niffenegger reveals her own self-assurance and whimsy alongside anxiety and loneliness, probing darker corners of the human heart and mind, often exploring the hopeless struggle with what Shakespeare called \"this bloody tyrant, Time.\"Essays by Audrey Niffenegger, National Museum of Women in the Arts Curator of Book Arts Krystyna Wasserman, and Art Institute of Chicago Curator and School of the Art Institute Professor Mark Pascale explore the artist's influences and work.Published in conjunction with the June 21-November 10, 2013 exhibition at the National Museum of Women in the Arts.",
  "genres": [
    "Art",
    "Nonfiction",
    "Art and Photography"
  ],
  "author": "Audrey Niffenegger",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/16142170-awake-in-the-dream-world"
}