{
  "title": "Jumalan vihan ruoska: suuri nälänhätä Suomessa 1695–1697",
  "description": "\"Suuret kuolonvuodet\" veivät 1690-luvulla hautaan lähes kolmanneksen suomalaisista. Halla ja loppumaton sade tuhosivat sadon kahtena vuonna peräkkäin, ja seurauksena oli paha pula ruuasta ja siemenviljasta. Kriisi ulottui myös Liivinmaalle ja Ruotsin valtakunnan sydänosiin. Syötävää etsivät kerjäläislaumat levittivät tappavia tauteja, ja keväällä ja kesällä 1697 kuolleisuus saavutti Suomessa kauhistuttavat mittasuhteet.Suomen 1690-luvun nälänhätä on Euroopan mittakaavassa ainutlaatuinen. Esimerkiksi Irlannin kuuluisa nälänhätä 1800-luvulla surmasi \"vain\" alle 12 prosenttia väestöstä.Kirjassaan Mirkka Lappalainen etsii vastausta kysymykseen siitä, miksi kuolema korjasi Suomessa niin runsaan sadon.Suurten kuolonvuosien aikaan elettiin pieneksi jääkaudeksi kutsuttua kylmää ilmastovaihetta. Alkeellinen maatalous ja siihen nojaavat valtiot olivat suurissa vaikeuksissa. Ilmaston lisäksi kirjassa pohditaan sitä, mikä rooli itsevaltiaan kuninkaan Kaarle XI:n valtiokoneistolla, aikakauden taloudellisilla ihanteilla, maantieteellisillä oloilla ja tiedonkulun vaikeuksilla oli kriisin pahentumisessa.Jumalan vihan ruoska on myös kuvaus nälänhädän arjesta, tavallisten ihmisten selviytymiskeinoista sekä rikoksista ja kauhuista, joihin nälkä lopulta johti. Tärkeä rooli on lisäksi itsevaltiaalla kuninkaalla, joka kansan kärsiessä teki itse kuolemaa. Lähteinä Mirkka Lappalainen on käyttänyt esimerkiksi oikeudenkäyntipöytäkirjoja sekä aikakauden virkamiesten ja diplomaattien kirjeitä.Jumalan vihan ruoska on kuvaus Suomen historian synkimmästä hetkestä, maailmasta, jossa ihmiset elivät luonnon ja säiden armoilla ja jossa elokuun halla toi kuoleman.",
  "genres": [
    "History",
    "Nonfiction",
    "Finnish Literature",
    "Audiobook",
    "Historical"
  ],
  "author": "Mirkka Lappalainen",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/16142488-jumalan-vihan-ruoska"
}