{
  "title": "Getting Down To Brass Tacks: My Adventures In The World Of Jazz, Rio, And Beyond",
  "description": "In the 1950's a young teenage piano student is given an LP of a blind jazz pianist named Alex Kallao. She had never heard of him before, but she was struck with a major epiphany while listening to his music: this was what she wanted to do with her life! No one taught jazz in the bucolic Newtown, Connecticut of that time, so Amy Duncan decided to teach herself. By the time she was fifteen, she had joined the local musicians union and formed her own group, the Amy Dee Trio. This riveting autobiography takes us through Amy's childhood—a nostalgic odyssey which paints a vivid portrait of life in Connecticut, including a UFO sighting and a surprise meeting (as she was on her knees, mopping up spilled coffee) with Marilyn Monroe. Then we move on to her college and young adult years in Boston, and finally her time in New York, trying to make it in music. But her efforts to become a working jazz pianist were at odds with a longing for love and a family life, and her choices led her into unexpected paths. Added to these opposing forces was a dream to visit Brazil, thanks to the impact of the movie \"Black Orpheus,\" which she had seen when she was in college. Amy's adventures later on of getting to Brazil for the first time on little money with a five-year old in tow, are both exciting and inspiring, as she is helped by many kind strangers to reach her goal. Years later, she returns to Brazil, this time to Rio de Janeiro, where she gets deeply involved in Rio’s famous Carnival and the samba scene, and reforms the band she had started in New York—Brass Tacks—with Brazilian musicians. They record a CD, “My Joy,” in 2002, and play in various venues in Rio and São Paulo.During her earlier years as a music journalist in Boston and New York, Amy met and interviewed many luminaries, including James Taylor, Dizzy Gillespie, and Paul Simon. The book opens with an unusual, humorous encounter with Miles Davis in his apartment in New York in the 1980s. A spiritual seeker from an early age, Amy spent years investigating various religions and philosophies. But when she finally discovered the answers she was looking for, she found herself struggling to live up to the demands of following a spiritual path in the midst of many activities and distractions, and nearly lost her way. Eventually, though, she was able to overcome those obstacles, and concludes her story on a note of hope and renewal.",
  "genres": [],
  "author": "Amy H. Duncan",
  "average_rating": "4.86",
  "url": "https://www.goodreads.com/book/show/16142519-getting-down-to-brass-tacks"
}