{
  "title": "Get a Shot of Rhythm and Blues: The Arthur Alexander Story",
  "description": "The first book-length biography of an influential country/soul legend whose songs have been recorded by the Beatles, the Rolling Stones, and Bob Dylan. Get a Shot of Rhythm and Blues chronicles the rise, fall, and rebirth of Arthur Alexander, an African American singer-songwriter whose music influenced many of the rock and soul musicians of the 1960s. Although his name is not well known today, Alexander's musical legacy is vast. His 1962 song \"You Better Move On\" was the first hit to emerge from the fledgling Muscle Shoals FAME studio in Alabama, and his fusion of country and soul and his heartfelt vocals on such songs as \"Anna (Go to Him)\" and \"Every Day I Have to Cry\" were revered by musicians including the Beatles, the Rolling Stones, and Bob Dylan, all of whom recorded his songs. Alexander's story is a tragic one, with a brief, redemptive finale. His meteoric rise after the release of \"You Better Move On\" gave way to lean years caused both by his drug and alcohol abuse and by the mishandling of his career by producers and managers. In 1977, he quit the music business, but his music lived on. In 1992, Alexander returned tothe studio and recorded the critically praised album Lonely Just Like Me. Just three months after the album's release in March 1993, he suffered a heart attack in the offices of his music publisher in Nashville and died three days later. In telling Alexander's story, Richard Younger captures the burgeoning music scenes in Muscle Shoals and Nashville during the 1960s and 1970s and recovers the life of a fascinating musician whose influence was international. Younger's account is enriched by his interviews with more than 200 artists, family members, and friends--such as Rick Hall, Billy Sherrill, Charlie McCoy, Chuck Jackson, Gerry Marsden, and Kris Kristofferson--and includes an abundance of never-before-seen photographs.",
  "genres": [
    "Music",
    "Biography"
  ],
  "author": "Richard Younger",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/1614486.Get_a_Shot_of_Rhythm_and_Blues"
}