{
  "title": "Uncertainty: Einstein, Heisenberg, Bohr, and the Struggle for the Soul of Science",
  "description": "The more precisely the position is determined, the less precisely the momentum is known in this instant, and vice versa.—Werner HeisenbergThat God would choose to play dice with the world is something I cannot believe.—Albert EinsteinNothing exists until it is measured.—Neils BohrThe remarkable story of a startling scientific idea that ignited a battle among the greatest minds of the twentieth century and profoundly influenced intellectual inquiry in fields ranging from physics to literary criticism, anthropology and journalismIn 1927, the young German physicist Werner Heisenberg challenged centuries of scientific understanding when he introduced what came to be known as “the uncertainty principle.” Building on his own radical innovations in quantum theory, Heisenberg proved that in many physical measurements, you can obtain one bit of information only at the price of losing another. Heisenberg’s principle implied that scientific quantities/concepts do not have absolute, independent meaning, but acquire meaning only in terms of the experiments used to measure them. This proposition, undermining the cherished belief that science could reveal the physical world with limitless detail and precision, placed Heisenberg in direct opposition to the revered Albert Einstein. The eminent scientist Niels Bohr, Heisenberg’s mentor and Einstein’s long-time friend, found himself caught between the two.Uncertainty chronicles the birth and evolution of one of the most significant findings in the history of science, and portrays the clash of ideas and personalities it provoked. Einstein was emotionally as well as intellectually determined to prove the uncertainty principle false. Heisenberg represented a new generation of physicists who believed that quantum theory overthrew the old certainties; confident of his reasoning, Heisenberg dismissed Einstein’s objections. Bohr understood that Heisenberg was correct, but he also recognized the vital necessity of gaining Einstein’s support as the world faced the shocking implications of Heisenberg’s principle.",
  "genres": [
    "Science",
    "Physics",
    "Nonfiction",
    "History",
    "Philosophy",
    "Biography",
    "History Of Science"
  ],
  "author": "David Lindley",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/161452.Uncertainty"
}