{
  "title": "Queened",
  "description": "Jaded, thy name is Regina Regal. Enduring a trial by fire, she will be Queened. Regina Regal wavers between apathetic and destructive because she's numb inside and out. Lost in a sea of ennui, she goes through the motions of everyday life but never truly lives. Happiness is a foreign concept. In the absence of numbness is pain- a pain so agonizing she would rather stick her head in the sand than feel the devastating loss of the father of her children. Thrust from Misery Castle, not only losing Grant, she leaves her first born behind. In the ashes of her despair, Regina creates a family for her daughter. But as her eyes open wide, she realizes everything is built on an illusion. Betrayed. Abandoned. Grieving yet filled with guilt, Regina finally comes to the realization that she has been toyed with as a pawn in a sadistic game Dominion's founders have played since before she ever set foot into Hillbrook. Every move she has made has been orchestrated by the very people she has grown to love and trust. Restraint draws Regina into a whole new world- one that has been at her fingertips but she was too blind to see. Forced with the task to choose between love and self-respect, Regina learns how if you feel empowered while you're on your knees, no one can tear you down when you're standing firmly on your own two feet.Publishers NoticeThe author did an extensive rewrite on this title, and the entire Mistress & Master of Restraint series. Not just editing and formatting, but a rewrite to where it's #NotTheSameBook #NotTheSameSeries The final republished editions began in early 2015 with Restraint, and mid-2017 with Checkmate so far. Reviews written before those dates may include elements that are no longer contained within the book, or the series as a whole. The author apologizes for any confusion this may cause. To avoid any reader having to repurchase the titles (via Amazon), no matter the significant changes in the contents, they are listed as the same book. Readers who are in possession of the old edition only need to update their copies via Amazon.Ms. Chilson also requests for those who reread the series to update their reviews and ratings accordingly, either for the positive or the critical, to help readers make informed decisions on whether or not to read based on what is currently in the final editions of the series. Thank you",
  "genres": [
    "BDSM",
    "Erotica",
    "Romance"
  ],
  "author": "Erica Chilson",
  "average_rating": "4.72",
  "url": "https://www.goodreads.com/book/show/16146235-queened"
}