{
  "title": "Messages From The Ancient Ones: Year One",
  "description": "This inspirational volume is a collection of the first 40 public messages, channeled by Stacey Stephens, from the beings who call themselves The Ancient Ones.Introducing, The Ancient Ones:“We are eternal beings of non-physical form. We make up a group of three, forming a council, for the guidance of Mankind, back to their original design as men and women. Our purpose is to assist everyone who is interested to develop their divine inner guidance, to direct themselves toward a humanity that is once again sacred and connected as One, in true camaraderie.”These masters share transformative truths about:- Self Mastery; - Prosperity; - Health and Energy;- Creativity;- Life Purpose“Wake up from the slumber that this ego-dominated world has put you in. Take charge of your life, and participate with humanity to overthrow the prison of your mind. Become an activist for a future where life is celebrated, real love is shared, and individuality is encouraged within the entirety of the whole. True expression is found within your heart. Open wide.” – The Ancient OnesSimilar to the works of Esther Hicks and Eckhart Tolle, each message has a theme, and the author has chosen a photograph to accompany each one. Book Sections:PrefaceIntroduction: The Ancient OnesThe Messages:1 - Humanity2 - Creativity3 - Interconnectedness4 - Consciousness5 - A Life Well Lived6 - God7 - Decide Your Life8 - Healing9 - Compassion10 - Dignity11 - Uncover Yourself12 - Integrity13 - Interdependence14 - Relationships15 - Soul Connection16 - Perception17 - Empowerment18 - Children19 - Youth20 - Soulmates21 - Family22 - Village23 - Global Society24 - Earth Ecology25 - Human Nature26 - Inner Calling27 - Purpose28 - Soul Authority29 - Oneness30 - Love31 - Being32 - Innocence33 - Reality34 - Passion35 - Attitude36 - Joy37 - Fulfillment38 - Belief39 - Wisdom40 - One Year Anniversary MessageAfterword by The Ancient OnesFrom the author:This book contains the foundational wisdom to create a life of direction, purpose and meaning. It is my honor to share these messages with you.",
  "genres": [],
  "author": "Stacey Stephens",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/16146892-messages-from-the-ancient-ones"
}