{
  "title": "Orion",
  "description": "Anastacia, or Stace, was marked from birth belonging to the Goddess Anat. Her mother launched a balanced plan to create five who would change the tides of the ongoing disputes among the supernatural factions trying to survive in a human world. A prophecy was created to unite them into peace and Stace has to believe she is the one to do that. And what happens when you’re the last to know?Stace has spent her entire life as the Valkyrie faction court princess. Now sent into a den of Hunter lions by her own father, her goal is find the one who took her twin brother, the heir to her own court. Her obstacles seem few, but there are other cloak-and-dagger factors at work.Motherless since birth, no one to turn to, resolved to have answers, Stace accepts a Hunter’s aid. Stace’s brother is kept in what they thought was an abandoned warehouse, but soon finds out that the greater the plot thickens, there are more secrets around every corner. It’s guarded by the very Hunters she is now putting her trust in, her own father’s court, and the rumored heartless, evil plotted Vampire faction. Once she has the information she needs, she planned to leave the Hunters and begin a rescue mission, but that doesn’t even come close to the bigger plan she knows nothing about. She didn’t count on Calum Green getting in the way, nor making friends for the first time in her life with supposed enemy strangers who never hesitate to help her in her darkest moments. And…others are marked like her. A prophecy that holds answers but no advice. What does it all mean? Weres? Vampires? She’s heard of their retributions if crossed the wrong way. Can she conquer this mission or just end up just playing out the fantasy prophecy she doesn’t understand anyway? Or will she uncover the greatest conspiracy the factions have ever held? And no human chose.",
  "genres": [],
  "author": "Cyndi Goodgame",
  "average_rating": "4.76",
  "url": "https://www.goodreads.com/book/show/16148341-orion"
}