{
  "title": "Aprendendo a Ser Top Model",
  "description": "It’s the late 1980s—hair is big, Lycra is rampant, and supermodels rule the earth. Every girl in America dreams of becoming the next Cindy, Claudia, or Naomi, and seventeen-year-old Emily Woods is no different. She looks different, though—striking enough to start a career. Despite the protestations of her hippie parents, she plunges into the glamorous but grueling world of professional modeling. But Emily is more than just a small-town beauty with stars in her eyes: She’s been accepted to Columbia University, and she’s not about to let couture and klieg lights get in the way of an Ivy League education.Thus begins Emily’s double life: cramming for a final at an exotic swimsuit shoot in the Caribbean; fighting the freshman fifteen to avoid the wrath of her agent; owning a closet full of Versace but nothing to wear to a frat party; sitting in a women’s studies class while ads featuring girls she knows are picked apart; juggling the attention of both college guys and the sought-after fashion photographer of the moment. But as Emily pursues her chic fantasy of Vogue covers and prestigious cosmetic campaigns, her priorities start to shift. In the ultra-competitive quest for supermodel fame and fortune, strutting off the runway to study Shakespeare might mean letting another pretty face snag her stilettos, and Emily’s thisclose to getting a leg up on her dreams.Before long, the seamier side of the fashion industry—cocaine and cads, collagen and implants, fad diets and eating disorders—becomes close up and personal. All of a sudden, Emily realizes how far she’s strayed from her dream of having it all. With sliding grades that threaten her future at Columbia and spotty bookings that put her career as a model in question, Emily is finally forced to make a choice between style and substance. Dazzling, dramatic, and as real as it gets, Model Student shines a spotlight behind the scenes and reminds us why you can’t judge a book by its cover girl.From the Hardcover edition.",
  "genres": [
    "Chick Lit",
    "Fiction",
    "New York",
    "Fashion",
    "Contemporary",
    "Teen",
    "New Adult"
  ],
  "author": "Robin Hazelwood",
  "average_rating": "3.12",
  "url": "https://www.goodreads.com/book/show/16149425-aprendendo-a-ser-top-model"
}