{
  "title": "Queen",
  "description": "Queen: OmnibusMistress & Master of Restraint #5-7 Jaded Rags to Riches… The queen is not born– she is forged through survival. You've read the Mistress and Master of Restraint series in present day. Join Regina Regal nineteen years in the past to where it all began with Jaded. Even as a scholarship student, Regina Regal is the brightest at Hillbrook Prep, causing her to straddle two extremes between the destitute class she dwells in and the affluent she visits daily. Neither of which welcomes her with open arms, forcing her to choose between her people and her friends. While dealing with insurmountable loss, Regina has more burdens placed upon her shoulders than the average adult could carry. With her mother dying, Regina has a difficult time crossing the line from caregiver to daughter in order to have both her mother’s and her own emotional needs met. Regina is struggling to keep her head above water as she takes on more debt from her mother’s mounting medical bills and living expenses, only to realize she is drowning. At eighteen, with a college scholarship guaranteeing she will join the ranks of her one-percenter classmates, Regina should have the world at her fingertips.Since she was young, Regina has been the provider, creating a young woman who has the need to survive and a hunger to be in control. But she finds herself falling apart, making horrible decisions that have lifelong consequences. Regina Regal’s life changes irrevocably when her best friend, Adelaide, invites her to study at the imposing Whittenhower Estates. Going against her instincts, Regina is compelled to visit Misery Castle. The girl who entered Misery Castle’s iron gate will not be the jaded woman who flees it almost five years later…  QueenedJaded, thy name is Regina Regal. Enduring a trial by fire, she will be Queened.Regina Regal wavers between apathetic and destructive because she’s numb inside and out. Lost in a sea of ennui, she goes through the motions of everyday life but never truly lives. Happiness is a foreign concept. In the absence of numbness is pain– a pain so agonizing she would rather stick her head in the sand than feel the devastating loss of the father of her children. Thrust from Misery Castle, not only losing Grant, she leaves her first born behind. In the ashes of her despair, Regina creates a family for her daughter. But as her eyes open wide, she realizes everything is built on an illusion. Betrayed. Abandoned. Grieving yet filled with guilt, Regina finally comes to the realization that she has been toyed with as a pawn in a sadistic game Dominion’s founders have played since before she ever set foot into Hillbrook. Every move she has made has been orchestrated by the very people she has grown to love and trust.Restraint draws Regina into a whole new world– one that has been at her fingertips but she was too blind to see. Forced with the task to choose between love and self-respect, Regina learns how if you feel empowered while you’re on your knees, no one can tear you down when you’re standing firmly on your own two feet. Checkmate They call me Mrs. Whittenhower…Readers have experienced the present through the points-of-view of Katya Waters, Dexter Hayes, and Dalton Fontaine. Now it’s time to experience the events that took place during those installments through a different pair of eyes– Queen’s. Checkmate parallels Restraint, Unleashed, Dexter, and Dalton. Questions will be answered through Regina Regal’s perspective, and motives will sharpen into clarity. Events aren’t always as they may seem.Regina uses self-restraint, when she’d rather go on an enraged rampage across Dominion, New York. She must choose self-preservation, where she surrenders to Maître du Jeu’s extortion, rather than get even. Learning her enemy, while doing as they bid, Regina protects all she calls hers, at the cost of her pride and self-respect.",
  "genres": [
    "BDSM",
    "Menage",
    "Adult",
    "Romance",
    "Erotica"
  ],
  "author": "Erica Chilson",
  "average_rating": "4.70",
  "url": "https://www.goodreads.com/book/show/16149809-queen"
}