{
  "title": "Checkmate",
  "description": "They call me Mrs. Whittenhower…Readers have experienced the present through the points-of-view of Katya Waters, Dexter Hayes, and Dalton Fontaine. Now it’s time to experience the events that took place during those installments through a different pair of eyes– Queen’s. Checkmate parallels Restraint, Unleashed, Dexter, and Dalton. Questions will be answered through Regina Regal’s perspective, and motives will sharpen into clarity. Events aren’t always as they may seem.Regina uses self-restraint, when she’d rather go on an enraged rampage across Dominion, New York. She must choose self-preservation, where she surrenders to Maître du Jeu’s extortion, rather than get even. Learning her enemy, while doing as they bid, Regina protects all she calls hers, at the cost of her pride and self-respect.Publishers NoticeThe author did an extensive rewrite on this title, and the entire Mistress & Master of Restraint series. Not just editing and formatting, but a rewrite to where it's #NotTheSameBook #NotTheSameSeries The final republished editions began in early 2015 with Restraint, and mid-2017 with Checkmate so far. Reviews written before those dates may include elements that are no longer contained within the book, or the series as a whole. The author apologizes for any confusion this may cause. To avoid any reader having to repurchase the titles (via Amazon), no matter the significant changes in the contents, they are listed as the same book. Readers who are in possession of the old edition only need to update their copies via Amazon.Ms. Chilson also requests for those who reread the series to update their reviews and ratings accordingly, either for the positive or the critical, to help readers make informed decisions on whether or not to read based on what is currently in the final editions of the series. Thank you Author's NotePlease read the  author’s review  for important information regarding this book & the series as a whole.",
  "genres": [
    "BDSM",
    "Romance",
    "Erotica"
  ],
  "author": "Erica Chilson",
  "average_rating": "4.72",
  "url": "https://www.goodreads.com/book/show/16149930-checkmate"
}