{
  "title": "Military Misdemeanours: Corruption, Incompetence, Lust and Downright Stupidity",
  "description": "Bungled cover-ups, acts of blinding incompetence, miscarriages of justice, sexual escapades and downright stupidity - the scandals which have helped to make the world's armed forces the much loved (and sometimes ridiculed) institutions they are today. Take an irreverent look at the public outcries that both governments and soldiers would rather we forget, from Julius Caesar's sex life and the frolics of Charles d'Eon, the fearless dragoon and noted transvestite to the sinking of the Kursk as Terry Crowdy delves into the darkest reaches of military sin and slip-up.Packed with more than 60 military mishaps from ancient times to the present day, Military Misdemeanors shows that no military organization is safe from exposure. Learn the truth about Nelson and Lady Hamilton, the drafting of Heavyweight Champ Muhammad Ali, the sinking of Rainbow Warrior and satanism in the Royal Navy as we step back through the pages of history and see how corruption, bigotry, lust, vanity, incompetence and the occasional bout of insanity have colored conduct throughout time.Contents THE PROLOGUE \"INIQUITY IN ANTIQUITY\"He came. He saw. He was conquered! The sexual escapades of Julius CaesarACT I \"OUR INGLORIOUS PAST\"The Infamous Lieutenant Bird A murderer in King George army - The Transvestite Knight The dragoon war hero, who preferred ladies' clothes to his uniform - The One about the Cat The man who ate a live cat to get out of the armyACT II \"MANIFEST INFAMY\"The Fairfax Raid The abduction of a drunk general by Mosby and his Rangers - The New York Draft Riots Caused by an unfair Civil War draft law - Surviving Custer The scandalous behaviour of Major RenoACT III ''NOT SUCH A GREAT WAR\"The Mexican Connection Germany's attempt to keep the US out of WWI by getting Mexico to invade - With 'Snow' on their Boots Cocaine abuse introduced to Britain by Canadian soldiers during WWI - The Midway Leak The US newspaper's revelation that the US Navy was intercepting Japanese signalsACT IV ''COLD WAR FALLOUT\"Un-American Activities McCarthyism in the US Air Force - The U2 Scandal Gary Powers shot down by the Soviets -Drafting Ali Muhammad Ali and the Vietnam draftACT V \"EVEN IN OUR ENLIGHTENED TIMES?\"Iran Air Flight 655 The passenger jet shot down by US missile during the Iran-Iraq War - The Flying Cow The untrue story of the cow that sank a Japanese boat - The Sultan of Spin The infamous Iraqi (mis)Information Minister",
  "genres": [
    "History",
    "Nonfiction",
    "War",
    "Military History",
    "Military Fiction"
  ],
  "author": "Terry Crowdy",
  "average_rating": "3.39",
  "url": "https://www.goodreads.com/book/show/1614994.Military_Misdemeanours"
}