{
  "title": "Voice of Reason",
  "description": "Critically acclaimed by some of the world’s top humanitarian, academic, and counter-culture icons, McGill’s Voice of Reason is an illuminating, yet distressing plea for safety and freedom in a world of uncertainty, violence, and liberty lost. Sometimes eloquently poetic, other times harshly incriminating and shocking, McGill delivers a lovely and inspirational, yet thought-provoking book about the balance of mind and heart.Voice of Reason is a wake-up call for a world in deep crisis, a world which is becoming a global battlefield, and where our poor relationships are increasingly based on self-interest. Exploring the true nature of violence, the destruction of diversity by monocultures, and the cancerous growth of unchecked, predatory corporate capitalism, McGill paints a grim picture of today’s materialistic consumer life. Speaking directly to the heart of revolution, from Zuccotti Park to Tehran, McGill believes we must revolt against the endless manipulation and oppression of modern life, and reject the traditions of violence, which have made each of us agents of violence ourselves.McGill explores many solutions to our cultural, political, economic, and environmental miseries, such as achieving greater individual consciousness and compassion, empowering youth, and restoring the woman to her rightful place, as the strong, loving maternal leader of peace and reason. As McGill writes, “The battlefields of life were first meadows and gardens. We made them into battlefields, and by the same power, we must release the dark spell, so they are meadows and gardens once again.” (bryantmcgill.com/vor)\"A peaceful voice for change in a corrupt world.\"~ Larry Flynt / Hustler Magazine\"...an iconoclastic tome of contempt for unjust authoritarianism, with an inspirational silver-lining that gives it all wings.\"~ Philip G. Zimbardo, Ph.D. / Stanford University / NYT Bestselling Author and Former President, American Psychological Association\"For a world consumed by a Culture of Violence, a Voice of Reason comes as a breath of fresh, positive air. The only hope of transforming the world from the tsunami of violence is for each of us to Become the Change We Wish To See in the World. Bryant McGill shows us the way.\"~ Dr. Arun M. Gandhi, Grandson of Mahatma Gandhi\"McGill has written a humanist manifesto through the roseate glasses of agape Christianity, Vishnu Sahasranama and Theravada Buddhism. Critical theorists will be challenged by the proposed consonance between Plato, poststructuralism and Lao-Tsu. Purists be damned!\"~ Constance Stadler, Ph.D., Assoc Prof., Political Science, NYU“…conscious guidance to a positive way out of our global crisis ...beyond nationalism, beyond warmongering ...real power that comes from truth, awareness, love and compassion.”~ John Breeding, Ph.D. / Best-Selling Author",
  "genres": [
    "Sociology",
    "Philosophy",
    "Nonfiction",
    "Society",
    "Self Help"
  ],
  "author": "Bryant McGill",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/16150281-voice-of-reason"
}