{
  "title": "A Presence in Russell County",
  "description": "Dirty cops ... a strangled community ... a secret justice system. Welcome to RUSSELL COUNTY.When Samantha Biggers is continually harassed by a police officer in rural Russell County, Georgia, she turns to a man she's known only online. John Hollingsworth, a retired Army officer, and his former sergeant, Stuart Crogan, uncover more than just police harassment of the locals. There's drug running, loan sharking, robbery--and murder. When it's learned that the cop who's been bothering Sam was also responsible for her husband's death, Hollingsworth and Crogan seek justice via a secret group of private citizens - The Organization. When average citizens are at the mercy of corrupt law enforcement, they often suffer in silence, having no one to turn to, no one left to trust. With its exacting standards for judicial conduct and procedure, and its vast network of resources, The Organization offers a level playing field that allows true justice to emerge.The Organization was created in 1972 by a group of American citizens who lost faith in the justice system, who no longer trusted their local police - and with good reason. At present, the membership in The Organization is approaching one million.Coming Soon:MULBERRYThe Organization Book 2A mute little boy is the only witness to a savage beating that's left his father in a coma. His only attempt at communication is a series of purple drawings ... always the same, the same shape over and over.Sterling Greaves, a former police informant, has been scared out of his right mind by harassment at the hands of the local police when he tried to report their activities. He surfaces long enough to make contact with a member of the Organization, the one he calls \"an angel.\"JESSE BUTTERFLYThe Organization Book 3When the first prisoner is released from an Organization prison, he seems an unlikely candidate for the spate of murders that occurs. After all, he's tethered to an oxygen tank, an elderly man now. The only clues are long strings of nonsense he repeatedly wrote and recited during the 25 years he was incarcerated. Members of the Organization race to make sense of the patterns before more people are killed.",
  "genres": [
    "Thriller"
  ],
  "author": "S.J. Sprague",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/16150880-a-presence-in-russell-county"
}