{
  "title": "Birthing a Slave: Motherhood and Medicine in the Antebellum South",
  "description": "The deprivations and cruelty of slavery have overshadowed our understanding of the institution's most human birth. We often don't realize that after the United States stopped importing slaves in 1808, births were more important than ever; slavery and the southern way of life could continue only through babies born in bondage. In the antebellum South, slaveholders' interest in slave women was matched by physicians struggling to assert their own professional authority over childbirth, and the two began to work together to increase the number of infants born in the slave quarter. In unprecedented ways, doctors tried to manage the health of enslaved women from puberty through the reproductive years, attempting to foster pregnancy, cure infertility, and resolve gynecological problems, including cancer. Black women, however, proved an unruly force, distrustful of both the slaveholders and their doctors. With their own healing traditions, emphasizing the power of roots and herbs and the critical roles of family and community, enslaved women struggled to take charge of their own health in a system that did not respect their social circumstances, customs, or values. Birthing a Slave depicts the competing approaches to reproductive health that evolved on plantations, as both black women and white men sought to enhance the health of enslaved mothers--in very different ways and for entirely different reasons. Birthing a Slave is the first book to focus exclusively on the health care of enslaved women, and it argues convincingly for the critical role of reproductive medicine in the slave system of antebellum America.",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "African American",
    "Medicine",
    "Read For School",
    "Civil War History"
  ],
  "author": "Marie Jenkins Schwartz",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/1615117.Birthing_a_Slave"
}