{
  "title": "Dracula Rekindled: Part 1 of 2",
  "description": "The Original Vampire is rekindled for the 21st Century...\"Some stories should never end. Good stories leave the reader thirsty for more. The best stories can give us legends that leave a permanent imprint on the literary world. Count Dracula is just such a legend; spawned countless film adaptations, inspired the 20th century horror genre and, ultimately, planted the vampire firmly in popular culture. Yet in a world of civilized, sparkling vampires, Stoker's story begs to be continued.With Dracula Rekindled, Xander Buchan takes the reigns from Bram Stoker with a fresh sequel that remains faithful to the Gothic horror classic, Dracula. Crafted in an epistolary style, and sharing the same DNA as Dracula, Xander also succeeds in making the read distinctly contemporary. This clever, suspenseful story builds steadily to draw the reader into a place of much mystery, intrigue, and horror. The ORIGINAL VAMPIRE has been rekindled and Buchan has created a believable Dracula for the 21st century.SYNOPSIS:'Not until he cannot lose will he make his move! His preparation will be slow and thorough. Never again will he meet defeat by the same ends...'A young couple find their plans delayed by unforeseen events. A student's PhD research digs up more than she bargained for, and a renowned Haematologist discovers his ancestor, Van Helsing, was master of more than just medicine.Amidst a series of strange events and horrific discoveries, lands are being bought up in Scotland; renovation work begins in a quaint coastal village to restore a medieval castle ruin. Does the prestigious restoration, and its new owner, hold any connection to the dark events unfolding?As a dark force rises, a secret history is uncovered - but could it even be believed? A desperate hunt for answers leads to the farthest reaches of darkest Europe; has an ancient foe returned to threaten mankind once more?\"",
  "genres": [
    "Horror",
    "Vampires",
    "Fiction",
    "Paranormal"
  ],
  "author": "Xander Buchan",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/16151793-dracula-rekindled"
}