{
  "title": "Primae Noctis",
  "description": "It was the first night of humanity, now known as the Calamity: a time of global crisis that led to the deaths of more than 99% of the world's 13.6 billion inhabitants.Sixty years later, and with the guidance of the Archonae, the survivors live in an idyllic society of secure and protected cities designed to elevate humanity to its full potential and prevent the problems of the past from recurring.However, not everyone is content with life in the new utopia.Primae Noctis follows a diverse cast of characters through an expansive, future world:• Nan Allegra is a political historian with outspoken views. She is in pursuit of a mystery that no one else seems to care about, but could be of critical importance to the future.• Archon Devlin is responsible for the Recovery, a global programme to recycle the remains of the former cities of Earth into useful, raw materials. He is deeply concerned with the future direction of humanity.• Jones is a man who doesn’t remember his first name or his past, but hopes to change the future. His mission is to assemble a group of citizens in the world’s second-largest city to aid him on his quest.• Reginald Mullen is a Knight charged with protecting the citizens from the dangers of the Wilderness. He finds strength in ensuring a secure future for the citizens of his city.• Franklin Murakami is an administrator and designer at the largest nanotech production facility in the world. His designs help to shape the future.• Sylvie Mathieu is an AIC administrator in Republica. She has never engaged in an intimate relationship with anyone, and only cares about the future of her daughter, Leila.• Henry Roston is an engineer who lives a carefree existence and spends his leisure time in the Entertainment District of the city. For him, the future is the present.Primae Noctis is the first in a trilogy of high-concept, science fiction novels filled with action, intrigue, and suspense. With a tasteful modicum of violence, sexuality, history, and philosophy, Primae Noctis was written for the adult, hard science fiction audience.",
  "genres": [
    "Science Fiction"
  ],
  "author": "Aimery Thomas",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/16152194-primae-noctis"
}