{
  "title": "The Traitor's Tale",
  "description": "A REBELLIOUS WAR, A TRAIL OF DEAD TRAITORS, A CONSPIRACY AGAINST THE CROWN...Rebellious factions, determined to unseat King Henry VI from the throne, have been staging uprisings throughout England. London has been under siege for three days and the populace is ready to repel the invading rebels and reclaim the city.In the midst of this unrest, Dame Frevisse of St. Frideswide's nunnery has come to her cousin's side. Lady Alice, widowed duchess of Suffolk, needs Frevisse's support in burying her husband, as the late but not lamented duke was so hated that even being in the presence of his corpse is unsafe. And when men in Suffolk's employ start disappearing, Frevisse fears for her cousin's safety.Wandering player Simon Joliffe has also come to London, filling the role of courier for the exiled duke of York and bringing vital information - a list bearing the names of the English noblemen who purportedly betrayed their King by conspiring with the French. Included on this list are several of Suffolk's men, whom Joliffe has been seeking and finding dead at every turn...If charges of treason are brought against Suffolk, Lady Alice fears her son will be disinherited. Joining Joliffe on his search for men on the list, Frevisse starts to wonder whether or not the list is real or part of an even greater conspiracy against the crown...\"Painted on a much broader canvas... Ms. Frazer portrays the curse of 'living in interesting times', making it all seem fresh and vibrant as a news bulletin. Possibly the best in the series to date, and that is saying a lot. Miss it at your peril.\" - MyShelf.com\"When you pick up a Margaret Frazer novel, you know you're in for a treat. She has a marvelous way of weaving historical details, facts, politics, and the ins and outs of everyday medieval life into the fabric of her novels. If history texts were written in such a fascinating way, I'm convinced that every schoolchild would become a scholar.\" - CA Reviews",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Historical Mystery",
    "Medieval",
    "Fiction",
    "Historical",
    "British Literature"
  ],
  "author": "Margaret Frazer",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/106687.The_Traitor_s_Tale"
}