{
  "title": "Sugarplum Dreams",
  "description": "A late night reunion on the beach, warm cookies fresh from the oven, the overwhelming world of online dating, and a one-night stand that changes of the lives of three people — Sugarplum Dreams, Book Four of the Candy Collection, wields a voyage of self-discovery, new beginnings, new loves, and admirable courage. Broken Roads & Dusty DreamsRiley Farris and Natalie Sloane were the best of friends who spent every summer together on the sandy beach of Mustang Island. Then, just when Riley is getting set to spend another summer with Natalie, she disappears. As the years pass, he struggles to understand what happened to the girl he knew. Until, one night while walking on the beach, he stumbles upon a woman who is broken and lost. Right Click, LoveDisheartened about not being able to find “Mr. Right” on the London dating scene, best friends Jodie Lynch and Louise Hewson create a blog to not only document their disastrous dates with the numerous “Mr. Wrongs” and “Mr. Okay-for-nows” but also to help those going through the same experiences and to see where they’re going wrong. How will they deal with everything the dating scene has to throw at them — planned or otherwise?Sugar & SpiceLacey Harrison has been dealt an unexpected hand in life: being a single mom. With her father's help and that of the residents at Royal Hills Nursing Home, she thrives and goes on to become a successful baker. She is content with her life but knows that she and her daughter Candy are missing something. Will things change for the better when Trent Childress moves into town and adds some spice to her sugar?The RoommatesSpring break changes everything for Daphne Hobbs. A one-night stand leaves her pregnant and alone. She soon discovers that the father is an identical twin, and she's unsure of which one turned her world upside down. She’ll be forced to share her apartment with them until she can discover the truth. Julius and Jordan Sweet share everything in their lives — almost to the point of living one life. Will Daphne uncover who’s the daddy?",
  "genres": [],
  "author": "Lisa Bilbrey",
  "average_rating": "4.54",
  "url": "https://www.goodreads.com/book/show/16152811-sugarplum-dreams"
}