{
  "title": "Cypherpunks: Freedom and the Future of the Internet",
  "description": "Cypherpunks are activists who advocate the widespread use of strong cryptography (writing in code) as a route to progressive change. Julian Assange, the editor-in-chief of and visionary behind WikiLeaks, has been a leading voice in the cypherpunk movement since its inception in the 1980s.Now, in what is sure to be a wave-making new book, Assange brings together a small group of cutting-edge thinkers and activists from the front line of the battle for cyber-space to discuss whether electronic communications will emancipate or enslave us. Among the topics addressed are: Do Facebook and Google constitute \"the greatest surveillance machine that ever existed,\" perpetually tracking our location, our contacts and our lives? Far from being victims of that surveillance, are most of us willing collaborators? Are there legitimate forms of surveillance, for instance in relation to the \"Four Horsemen of the Infopocalypse\" (money laundering, drugs, terrorism and pornography)? And do we have the ability, through conscious action and technological savvy, to resist this tide and secure a world where freedom is something which the Internet helps bring about?The harassment of WikiLeaks and other Internet activists, together with attempts to introduce anti-file sharing legislation such as SOPA and ACTA, indicate that the politics of the Internet have reached a crossroads. In one direction lies a future that guarantees, in the watchwords of the cypherpunks, \"privacy for the weak and transparency for the powerful\"; in the other lies an Internet that allows government and large corporations to discover ever more about internet users while hiding their own activities. Assange and his co-discussants unpick the complex issues surrounding this crucial choice with clarity and engaging enthusiasm.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Technology",
    "Internet",
    "Science",
    "History",
    "Audiobook"
  ],
  "author": "Julian Assange",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/16153182-cypherpunks"
}