{
  "title": "Amos y mazmorras: Primera parte",
  "description": "Cleo Connelly siempre quiso ser como su hermana Leslie. Por eso, cuando decidió trabajar para la Ley, Cleo la siguió y se esforzó siempre por llegar a su nivel. Pero solo Leslie fue aceptada en el FBI, mientras que Cleo tuvo que conformarse con patrullar su ciudad natal: Nueva Orleans.Ahora, Leslie ha desaparecido. El subdirector del departamento del FBI ha visitado a Cleo para pedirle que les ayude y colabore en su misión rescate, puesto que necesitan un perfil parecido al de su hermana. La joven policía, llevada por el miedo y la desesperación, accederá a hacerlo antes de entender en qué tipo de misión estaba Leslie metida: ¿Un Rol llamado Dragones y mazmorras DS? ¿Diseño de drogas afordisíacas? ¿BDSM? ¿Red de trata de personas? ¡¡¿¿BDSM?!! Si antes le hubieran explicado que tendrían que instruírla para hacerla pasar por sumisa, puede que la respuesta fuera otra… ¿Sumisa? ¡¿Ella?! ¡Pero si su resistencia al dolor era nula y pegaba a la que le hacía las manicuras! ¿Cómo iba a hacerse pasar por…? Maldita sea. Por supuesto que sí. Por su hermana haría cualquier cosa. Un momento… ¿Había dicho el inspector que su “master” iba a ser Lion? ¡¡¿¿Lion Romano??!! ¡Lo retiraba! El atractivo y arisco Lion Romano está devastado por la muerte de su mejor amigo Clint, encontrado muerto mientras trabajaba de encubierto en la misión de la trata de blancas en la que se hallaba inmerso junto con Leslie Connelly, una de las mejores agentes del FBI, cuyo paradero se hallaba desconocido. Lion hará lo posible por recuperar a Leslie, y si para ello debe infiltrarse en el rol de BDSM con la sexy, inconsciente y descarada de su hermana Cleo, el sacrificio merecería la pena. Lo que nadie sabía era que someter e instruir a Cleo en el arte de la dominación y la sumisión, era algo que deseaba hacer desde que la joven cumplió su mayoría de edad. Ambos se enrolarán en una aventura llena de peligro y sensualidad, crudeza y crueldad, en la que las fustas y los látigos marcan la realidad y el día a día. Una poli con vocación de agente especial que no se cree sumisa está a punto de conocer al AMO que está destinado a someterla.¿Lograrán salvar a Leslie antes de que se maten entre ellos? ¿El trabajo se puede mezclar con el placer? Los juegos están servidos: los dragones salen de sus mazmorras.Esta historia se divide en dos partes. La Doma de Cleo a manos de Lion, que se localiza en la gran y oscura Nueva Orleans y en la que se descubren el uno al otro en sus roles, y después, el intenso y apasionante torneo de dominación y sumisión de Dragones y Mazmorras DS.No hay margen para el aburrimiento. Nunca habéis leído nada igual.¿Preparados? ¿Listos? ¡YA!",
  "genres": [
    "Romance",
    "BDSM",
    "Erotica",
    "Adult",
    "Dark Romance",
    "Thriller",
    "New Adult"
  ],
  "author": "Lena Valenti",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/16154069-amos-y-mazmorras"
}