{
  "title": "The Israeli Solution: A One-State Plan for Peace in the Middle East",
  "description": "A landmark manifesto issuing a bold call for a one-state solution to the Israeli-Palestine conflict. The reigning consensus in elite and academic circles is that the United States must seek to resolve the Palestinians' conflict with Israel by implementing the so-called two-state solution. Establishing a Palestinian state, so the thinking goes, would be a panacea for all the region’s ills. In a time of partisan gridlock, the two-state solution stands out for its ability to attract supporters from both sides of America's ideological divide. But the great irony is that it is one of the most irrational and failed policies the United States has ever adopted.Between 1970 and 2013, the United States presented nine different peace plans for Israel and the Palestinians, and for the past twenty years, the two state solution has been the centerpiece of U.S. Middle East policy. But despite this laser focus, American efforts to implement a two-state peace deal have failed—and with each new attempt, the Middle East has become less stable, more violent, more radicalized, and more inimical to democratic values and interests.      In The Israeli Solution , Caroline Glick, senior contributing editor to the Jerusalem Post , examines the history and misconceptions behind the two-state policy, most - The huge errors made in counting the actual numbers of Jews and Arabs in the region. The 1997 Palestinian Census, upon which most two-state policy is based, wildly exaggerated the numbers of Palestinians living in the West Bank and Gaza.- Neglect of the long history of Palestinian anti-Semitism, refusal to negotiate in good faith, terrorism, and denial of Israel’s right to exist.- Disregard for Israel’s stronger claims to territorial sovereignty under international law, as well as the long history of Jewish presence in the region.- Indifference to polling data that shows the Palestinian people admire Israeli society and governance. Despite a half-century of domestic and international terrorism, anti-semitism, and military attacks from regional neighbors who reject its right to exist, Israel has thrived as the Middle East’s lone democracy. After a century spent chasing a two-state policy that hasn’t brought the Israelis and Palestinians any closer to peace, The Israeli Solution offers an alternative path to stability in the Middle East based on Israeli sovereignty over Judea and Samaria.",
  "genres": [
    "Israel",
    "Politics",
    "History",
    "Nonfiction",
    "Jewish",
    "Science",
    "Military Fiction"
  ],
  "author": "Caroline B. Glick",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/16156306-the-israeli-solution"
}