{
  "title": "The Dust in Sunlight",
  "description": "The Dust in Sunlight is a hybrid compilation - part memoir, part fiction - of travelers' tales by new writer Christopher Rees that run the gamut from contemporary social realism and globalism to mystical realism. These deeply reflective stories - mainly told through the eyes of the peripatetic Daniel Lookfar - span several countries and continents; Afghanistan, France, Guatemala, Mexico, the Dominican Republic and the United States. In this intriguing collection, Rees illuminates how politics, wealth, history, migration, and culture influence human interactions to create fate. From the leafy heart of a forest in the south of France, to cornfields in the Dominican Republic, to the dusty expanse of Afghanistan, The Dust in Sunlight reveals worlds at once foreign and familiar, with unforgettable characterizations and frank observations of human behavior.The stories:In 'Shoes,' Rees explores the symbiotic relationship between visitors to the small community of Olancho and its inhabitants. Along with the traveler's sense of dislocation, language, wealth, and the status of the outsider all play a part in what arises when the first world meets the developing world - each hoping the grass is greener on the other side.In 'The Peanut Man' we find a gentle force of nature, a curious emanation of uncomplicated beauty and tranquility originating in the figure of a humble Guatemalan peanut seller, spending his days under the harsh Central American sun. 'Rock Steady' is a singular story, an enigmatic tale set in France that conveys an undercurrent of mysticism and a shamanic fascination with sacred spaces and mysterious forces. 'The Caseta Pepsi' tells of 'dreams come true' against the backdrop of a small snack bar at the foot of the Rio Dulce bridge. The naïve hopes of its owners and the ironies of their experience are seen through a convergence of viewpoints, as the spiraling narrative leads the reader on a journey to the heart of paradise in a Mayan village. 'Thank God It's Raining' tells the story of an archetypally good, simple, subsistence farmer and his warm, companionable, hardworking wife; their love for the land and their faith persist in the face of adversity. 'The Rinse Bowl at the Mexican Dentista' recounts an experience, at once painful and funny, that takes place at a dentist's office in a dreamlike, late-20C, vaguely mythic Mexico.These and other stories form the fascinating composite of travelers' tales that make up The Dust in Sunlight.",
  "genres": [
    "Fiction",
    "Short Stories",
    "Travel",
    "Fantasy",
    "Historical Fiction",
    "Contemporary"
  ],
  "author": "Christopher  Rees",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/16156392-the-dust-in-sunlight"
}