{
  "title": "Where Darkness Dwells",
  "description": "During a hot summer night in 1934, tragedy strikes when two local boys search for the truth behind a local legend. They stumble upon the Underground, a network of uncharted caverns just below the surface of Coal Hollow. Time holds no sway in the Underground. People no longer age and their wounds heal as if by magic. By morning, one boy is murdered, while the other never returns home.The Underground is hidden for a reason. Certain locals want to keep their lair secret, no matter the cost.After learning a long-held family secret, Theodore Cooper is set adrift. Once well off and set in his ways, he is no longer sure of his role in society. He leaves his comfortable life in Chicago to tramp the countryside, searching for meaning in this new context. During his travels, he’s drawn to an abandoned house in Coal Hollow and impulsively buys it.Cooper doesn’t know that a massacre had taken place in his new house. In 1851, a group of bounty hunters tracked a family of runaway slaves to the home. They wound up killing the homeowners as conspirators, then chased the runaways into a cellar tunnel leading to the Underground. The bounty hunters cornered the slaves and killed them. To everyone’s astonishment, the slaves then rose from the dead. Over time, the bounty hunters chose to stay below ground, taking advantage of their new slave labor to build what they term “Paradise.”Their numbers are augmented by deathbed miners who are offered immorality in exchange for their subservience and labor.Below a town struggling to survive both the Great Depression and the closing of the local coal mine, there lives an immortal society built on the backs of slavery and pervasive immorality.",
  "genres": [
    "Horror",
    "Fiction",
    "Historical Fiction",
    "Paranormal",
    "Fantasy",
    "Thriller",
    "Mystery"
  ],
  "author": "Glen R. Krisch",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/10671932-where-darkness-dwells"
}