{
  "title": "Mind over Medicine: Scientific Proof That You Can Heal Yourself",
  "description": "We’ve been led to believe that when we get sick, it’s our genetics. Or it’s just bad luck—and doctors alone hold the keys to optimal health. For years, Lissa Rankin, M.D., believed the same. But when her own health started to suffer, and she turned to Western medical treatments, she found that they not only failed to help; they made her worse. So she decided to take matters into her own hands.     Through her research, Dr. Rankin discovered that the health care she had been taught to practice was missing something crucial: a recognition of the body’s innate ability to self-repair and an appreciation for how we can control these self-healing mechanisms with the power of the mind. In an attempt to better understand this phenomenon, she explored peer-reviewed medical literature and found evidence that the medical establishment had been proving that the body can heal itself for over 50 years.     Using extraordinary cases of spontaneous healing, Dr. Rankin shows how thoughts, feelings, and beliefs can alter the body’s physiology. She lays out the scientific data proving that loneliness, pessimism, depression, fear, and anxiety damage the body, while intimate relationships, gratitude, meditation, sex, and authentic self-expression flip on the body’s self-healing processes.     In the final section of the book, you’ll be introduced to a radical new wellness model based on Dr. Rankin’s scientific findings. Her unique six-step program will help you uncover where things might be out of whack in your life—spiritually, creatively, environmentally, nutritionally, and in your professional and personal relationships—so that you can create a customized treatment plan aimed at bolstering these health-promoting pieces of your life. You’ll learn how to listen to your body’s “whispers” before they turn to life-threatening “screams” that can be prevented with proper self-care, and you’ll learn how to trust your inner guidance when making decisions about your health and your life.",
  "genres": [
    "Health",
    "Nonfiction",
    "Psychology",
    "Self Help",
    "Science",
    "Spirituality",
    "Medicine"
  ],
  "author": "Lissa Rankin",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/16158168-mind-over-medicine"
}