{
  "title": "The Deserters: A Hidden History of World War II",
  "description": "“Powerful and often startling…The Deserters offers a provokingly fresh angle on this most studied of conflicts.” --\nThe Boston Globe\n A groundbreaking history of ordinary soldiers struggling on the front lines, The Deserters offers a completely new perspective on the Second World War. Charles Glass—renowned journalist and author of the critically acclaimed Americans in Paris: Life and Death Under Nazi Occupation—delves deep into army archives, personal diaries, court-martial records, and self-published memoirs to produce this dramatic and heartbreaking portrait of men overlooked by their commanders and ignored by history. Surveying the 150,000 American and British soldiers known to have deserted in the European Theater, The Deserters: A Hidden History of World War II tells the life stories of three soldiers who abandoned their posts in France, Italy, and Africa. Their deeds form the backbone of Glass’s arresting portrait of soldiers pushed to the breaking point, a sweeping reexamination of the conditions for ordinary soldiers. With the grace and pace of a novel, The Deserters moves beyond the false extremes of courage and cowardice to reveal the true experience of the frontline soldier. Glass shares the story of men like Private Alfred Whitehead, a Tennessee farm boy who earned Silver and Bronze Stars for bravery in Normandy—yet became a gangster in liberated Paris, robbing Allied supply depots along with ordinary citizens. Here also is the story of British men like Private John Bain, who deserted three times but never fled from combat—and who endured battles in North Africa and northern France before German machine guns cut his legs from under him. The heart of The Deserters resides with men like Private Steve Weiss, an idealistic teenage volunteer from Brooklyn who forced his father—a disillusioned First World War veteran—to sign his enlistment papers because he was not yet eighteen. On the Anzio beachhead and in the Ardennes forest, as an infantryman with the 36th Division and as an accidental partisan in the French Resistance, Weiss lost his illusions about the nobility of conflict and the infallibility of American commanders. Far from the bright picture found in propaganda and nostalgia, the Second World War was a grim and brutal affair, a long and lonely effort that has never been fully reported—to the detriment of those who served and the danger of those nurtured on false tales today. Revealing the true costs of conflict on those forced to fight, The Deserters is an elegant and unforgettable story of ordinary men desperately struggling in extraordinary times.",
  "genres": [
    "History",
    "Nonfiction",
    "World War II",
    "War",
    "Military Fiction",
    "Military History",
    "Biography"
  ],
  "author": "Charles Glass",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/16158490-the-deserters"
}