{
  "title": "East of the Sun: The Epic Conquest and Tragic History of Siberia",
  "description": "In sweep, color & grandeur, the conquest & settlement of Siberia compares with the winning of the American West. It's the greatest pioneering story in history, uniquely combining the heroic colonization of an intractable virgin land, the ghastly dangers & high adventure of Arctic exploration, & the grimmest saga of penal servitude. 400 years of continual human striving chart its course, a drama of unremitting extremes & elemental confrontations, pitting man against nature, & man against man. East of the Sun, a work of panoramic scope, is the 1st complete account of this strange & terrible story. To most Westerners, Siberia is a vast & mysterious place. The richest resource area on the face of the earth, its land mass covers 5 million square miles-7.5% of the total land surface of the globe. From the 1st foray in 1581 across the Ural Mountains by a band of Cossack outlaws to the fall of Gorbachev, East of the Sun is history on a grand scale. With vivid immediacy, Bobrick describes the often brutal subjugation of Siberia's aboriginal tribes & the cultures that were destroyed; the great 18th-century explorations that defined Siberia's borders & Russia's attempt to \"extend\" Siberia further with settlements in Alaska, California & Hawaii; & the transformation of Siberia into a penal colony for criminal & political exiles, an experiment more terrible than Australia's Botany Bay. There's the building of the stupendous Trans-Siberian Railway across 7 time zones; Siberia's key role in the bloody aftermath of the October Revolution in 1917; & Stalin's dreaded Gulag, which corrupted its very soil. Today, Siberia is the hope of Russia's future, now that all her appended republic have broken away. Its story has never been more timely.",
  "genres": [
    "History",
    "Russia",
    "Nonfiction",
    "Russian History",
    "European History",
    "Travel",
    "World History"
  ],
  "author": "Benson Bobrick",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/1067212.East_of_the_Sun"
}