{
  "title": "The Illusion of Life: Disney Animation",
  "description": "The most complete book on the subject ever written, this is the fascinating inside story by two long-term Disney animators of the gradual perfecting of a relatively young and particularly American art from, which no other move studio has ever been able to equal .The authors, Frank Thomas and Ollie Johnston , worked with Walt Disney himself as well as other leading figures in a half-century of Disney films. They personally animated leading characters in most of the famous films and have decades of close association with the others who helped perfect this extremely difficult and time-consuming art form. Not to be mistaken for just a \"how-to-do-it,\" this voluminously illustrated volume (like the classic Disney films themselves) is intended for everyone to enjoy.Besides relating the painstaking trial-and-error development of Disney's character animation technology, this book irresistibly charms us with almost an overabundance of the original historic drawings used in creating some of the best-loved characters in American culture: Mickey Mouse and Donald Duck, Snow White and Bambi (among many, many others) as well as early sketches used in developing memorable sequences from classic features such as Fantasia and Pinocchio .With the full cooperation of Walt Disney Productions and free access to the studio's priceless archives, the authors took unparalleled advantage of their intimate long-term experience with animated films to choose the precise drawings to illustrate their points from among hundreds of thousands of pieces of artwork carefully stored away.The book answers everybody's question about how the amazingly lifelike effects of Disney character animation were achieved, including charming stories of the ways that many favorite animated figures got their unique personalities. From the perspective of two men who had an important role in shaping the art of animation, and within the context of the history of animation and the growth of the Disney studio, this is the definitive volume on the work and achievement of one of America's best-known and most widely loved cultural institutions. Nostalgia and film buffs, students of popular culture, and that very broad audience who warmly responds to the Disney \"illusion of life\" will find this book compelling reading (and looking!).Searching for that perfect gift for the animation fan in your life? Explore more behind-the-scenes stories from Disney Editions:",
  "genres": [
    "Art",
    "Nonfiction",
    "Design",
    "Film",
    "Reference",
    "Drawing",
    "History"
  ],
  "author": "Ollie Johnston",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/106731.The_Illusion_of_Life"
}