{
  "title": "Jesse",
  "description": "J. M. Hunter had signed the order for Joey’s apartment building to be torn down. Every time Joey tried to get into the Hunter building to see the lawyer to plead their case she could never get past the guard. Now, almost a year later, she was still homeless and working at a dead in job trying to save up enough money to get an apartment, one with heat, as well as electricity. Instead, she had to save Jesse’s mom from dying in a fire and have the shit beat out of her by someone while doing it.Jesse couldn’t understand why the woman wouldn’t just shut up and do what he told her to do. It wasn’t as if he was trying to hurt her, but she had saved his mom, and it was the least he could to do make sure she had a job and a place to live. Of course, it had been pointed out to him several times already that he could have asked, but his way was much quicker.Joey wanted to knock the man on his ass every time he opened his mouth. She had hit him a couple of times, once to shove his nuts up around his ears, and the second time to break his nose. But the man just didn’t seem to understand the word no.But when someone shot at her and killed her friend she had no choice but to let the powerful Hunters help her. It was that, or she’d be dead the next time the loony woman at the fire came gunning for her.Then her grandmother came around welding her cane like it was an extension of her arm and accusing her of beating her. Joey had had just about enough of her when Jesse told her he was marrying her. Things should have been wonderfully tied up, but they seemed to be getting worse until she figured out she loved him. And she did.Jesse Hunter is a good man but he is a little stubborn. Joey Foster is a lovely wonderful woman who is a great deal stubborn. Together they could be amazing…but would they ever get that far?Jesse, the third book in the Hunter Series and a love story for all time.",
  "genres": [
    "Romance",
    "Erotica",
    "Contemporary Romance"
  ],
  "author": "Kathi S. Barton",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/16159651-jesse"
}