{
  "title": "Daniel",
  "description": "The waiter came over and sat their drinks in front of them. Reilly waited until he was gone before she looked at Rachel to ask her about the celebrating. She had a strange look on her face.“What?” Reilly turned around and saw Mr. Hunter coming toward her. “Fuck. He just doesn’t give up, does he?”“You know him? Well, that makes this easier.” Reilly had a strange feeling she wasn’t going to be celebrating like her agent thought she might.“Reilly Harlequin, I’d like you to meet the man who’s just commissioned you to make a premier piece for his new lobby, Daniel Hunter.”Daniel, the last single Hunter, is annoyed with his family for forcing women on him. He is a confirmed bachelor and likes it that way. He doesn’t want to be tied down to a woman, especially one with a kid.O’Reilly Harlequin knows her days are numbered. Her sister, Meagen Harper, was involved with an evil man that no one crosses if they want to remain healthy. Meagen, on her deathbed, drags Reilly right in the middle of her chaos. Now Reilly finds herself the mother of a nephew she knew nothing about, and the two of them are on the run for their lives.Daniel is intrigued with the famous, elusive potter. He wants what he wants, and he wants Reilly. But Reilly wants to stay as far away from the sexy lawyer as she can get. Daniel is a distraction that can get them all killed, but the danged man won’t leave her alone.Passions, however, can’t be denied, and love creeps in at the most inopportune moments. A confession of love in the heat of passion has Daniel backing up. He loves her, too, but a commitment and a kid? He’s not so sure.The past has caught up with Reilly and her nephew Benny. A fated moment she and the kid have been preparing for since they met―a moment Reilly doesn’t expect to live through.Hot passion and danger await in the final installment of The Hunter Series, Daniel.",
  "genres": [
    "Romance",
    "Erotica",
    "Contemporary Romance",
    "Family"
  ],
  "author": "Kathi S. Barton",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/16159653-daniel"
}