{
  "title": "Blood & Sawdust",
  "description": "--Tough and smart at thirteen-years-old, Malcolm knew the illegal fight game like a pro, making bets and staying alive one day at a time. But nothing prepared him for Milkwood: a fat, ugly bastard who could take a beating like a government mule, but never, ever won. So when Malcolm risks his life to discover Milkwood's secret, he convinces the fighter to stop being a punching bag and to go for broke in the local tournament. Only problem? A beautiful woman called Lash who needs Milkwood for her own purposes, and a fouler creature on her heels known only as Dizzy Colt. But for Malcolm and Milkwood? Hell, it’s just another day of Blood and SawdustPRAISE FOR BLOOD AND SAWDUST!\"With wicked, playful prose that blends the best of pulp with the supernatural, Jason Ridler’s Blood and Sawdust creates an unholy, hell-raising hybrid, the kind of tale Christopher Moore and Jim Thompson might swap after a long night of drinking, trying to one-up one another with acerbic absurdity.\" Joe Clifford, Author of CHOICE CUTS and JUNKIE LOVEPRAISE FOR THE WORK OF JASON RIDLER!\"An exciting new writer.\" Lucius Shepard, multiple-award-winning author of HANDBOOK OF AMERICAN PRAYER. “Jason Ridler is kind of like a bull rider who’s tossed a saddle on a Tiger tank, and he’s riding that bucking sucker for all he’s worth, because, hey, no one told him that he couldn’t do it, did they? So here he is, the Man in the Barbed-Wire Straitjacket.\" Norman Partridge, Award Winning Author of DARK HARVEST. \"Jason Ridler’s work is intense and taut, with incredible characters and plots that keep your mind buzzing long after you’ve reached the final page.\" Trent Zelazny, author of TOO LATE TO CALL TEXAS, and FRACTAL DESPONDENCY. ABOUT THE AUTHORJason S. Ridler is the author of BLOOD AND SAWDUST, the Spar Battersea thrillers (DEATH MATCH, CON JOB and DICE ROLL), the short story collection KNOCKOUTS, and has published over fifty stories in such magazines and anthologies as Beneath Ceaseless Skies, Brain Harvest, Chilling Tales, and more. His popular non-fiction has appeared in Clarkesworld, Dark Scribe, and the Internet Review of Science Fiction. A former punk rock musician and cemetery groundskeeper, Mr. Ridler holds a Ph.D. in War Studies from the Royal Military College of Canada. Visit him at twitter at http://twitter.com/JayRidler, Facebook ,http://www.facebook.com/Ridlerville, or his writing blog, Ridlerville, atwww.jsridler.com",
  "genres": [
    "Horror",
    "Paranormal",
    "Vampires"
  ],
  "author": "Jason S. Ridler",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/16159703-blood-sawdust"
}