{
  "title": "Memories of Evil",
  "description": "My book is subtitled, \"Recalling a World War II Childhood,\" and is a memoir of my peaceful childhood in Czechoslovakia; of how my life was radically changed by the Holocaust; and of my experiences of surviving two concentration camps in Slovakia; as well as six camps in Germany, from the age of 14 -15. I was born in 1930 in a town called Trencin, in what was then Czechoslovakia -- a country that no longer exists; it is now called Slovakia. I was the only child of a well-to-do Jewish couple. My father was the owner of a store, a kind of department store, in a prime location on the town's principal square. We lived in a large comfortable apartment above the store. My mother loved working in the store, while the family's needs were attended to by a maid, a cook, and a governess for me. I grew up bi-lingual -- fluent in Slovak and in German. I soon added Czech as an additional language and started studying English from the age of eight.This idyllic existence was shattered in 1939 when Hitler's Germany annexed the Czech part of the country, with Slovakia becoming a quasi-independent country governed by an indigenous fascist party, firmly allied to Nazi Germany. A resolute feature of this Slovak government was its anti-Semitism. A series of anti-Jewish laws was promulgated, stripping us ultimately of our property and of all civil rights.In 1942 the government started deporting its population to German concentration camps vaguely identified as \"in the East.\" Between March and November of that year, of a Jewish population of close to 90,000 people, some 60,000 were deported -- the vast majority to their annihilation in camps such as Auschwitz. You can read in my book how my family escaped deportation in 1942; and how we were finally caught in the next and deported in October, 1944. I describe this desperate period in my book: how I was separated from my family; how I survived a succession of concentration camps, culminating in a 12-day Hunger March before my final liberation.I immigrated to this country in November, 1946. I mark this event in my life as my rebirth and my new life. After a fruitful and satisfying 68 years in the U.S., the travail of my childhood years -- of what I call my previous life -- ought to be long forgotten. And yet, survivors of the Holocaust cannot forget, cannot forgive. Vestiges of our trauma will remain with us to our last breath. If you want to come a little closer to understanding the Holocaust, read my modest book. It is far from the whole truth which is beyond human understanding. But is is nothing but the truth, based on fragments indelibly etched in my memory, supplemented by historical research.",
  "genres": [
    "Nonfiction",
    "History",
    "Holocaust",
    "Memoir",
    "Biography",
    "War",
    "World War II"
  ],
  "author": "Peter Kubicek",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/16159746-memories-of-evil"
}