{
  "title": "7 Sanctuaries",
  "description": "It was a radical time, filled with promise, hope, and exciting new opportunities. It was a time when people made sure their voices were heard; they changed our world forever. It was thrilling and frightening and challenging. That time was the 1960s. When facing times of tumultuous transformation, people often seek solace and comfort in safe havens—sanctuaries, if you will—to protect themselves and their loved ones from the stormy world around them.Katie Franklin grew up during the Great Depression and saw the worst of poverty and destitution. As a young girl, she vowed to help “the least of these,” and that vow would ultimately lead her to confront the legal authorities and side with the Freedom Riders. George Roberts put every dime he’d saved from his military service into Springlake Hardware, and he was determined to keep it safe from the hippies and the coloreds and anyone else who would try to take advantage of him. Following seminary, Reverend Stephen Phillips came to Springlake as the “Radical Preach,” committed to saving kids from decadence, drugs, and discrimination. These and other characters each present their stories of small-town living in the ‘60s within the context of the sanctuary they have selected for safety. Along the way, they meet a cast of interesting characters: unusual people: Dave, the gentle giant stoner, and his flowerchild girlfriend, Missy; “Crew Cut” Cale Kinney; Mayor El Rawlings; Coach Bridges; Sunni; and Larry Watson, the boy who sported the first Afro in Springlake, Florida. Their lives intertwine throughout the decade and come together in one night of fear, tragedy and hope.Through it all - the turmoil, the rock music, the assassination of powerful leaders, the tent revivals, KKK rallies, space walks and the war, the little community of Spring Lake grows and flourishes and changes, as does our nation and as does our world.",
  "genres": [],
  "author": "Ben A. Sharpton",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/16159930-7-sanctuaries"
}