{
  "title": "Waiting for Love",
  "description": "Sometimes the best offense is a good rebound...Adam McCarthy has had a really bad week. In addition to nearly losing his three brothers in a tragic boating accident, his now ex-girlfriend has double-crossed him right out of the successful computer company he founded in New York City. What he needs is a few days at home on Gansett Island to make sure his beloved brothers are safe and to get back in touch with what really matters—his family, his friends and the tiny island that soothes his battered soul. On the ferry ride home, he runs into an old family friend who's had her own share of heartache, and Adam helps her through some rough moments, sparking an unlikely alliance.Abby Callahan has come home to Gansett, single once again after her relationship with Dr. Cal Maitland blows up in her face. After two epic failures in the game of love, she's decided this is going to be the summer she busts loose and finally has some fun—and she's shaking things up in a big way! The new Abby swears, drinks, gets a tattoo, sleeps around and generally does anything her kinder, gentler alter ego wouldn't have dreamed of doing.Before too long, Adam has appointed himself her guardian and is determined that the only sleeping around she's doing is with him. That is… unless his brother Grant is willing to risk his newfound happiness with Stephanie to keep Adam from rebounding with his ex. And what happens when Adam and Abby realize their summer fling has taken a serious turn, especially when he gets the chance to return to New York and fight for the company that's rightfully his? Abby has already followed two men off the island. Does she have it in her to find out if the third time really is the charm?Another wild summer on Gansett Island is under way, complete with new stories for many of your favorite couples from past books! You'll also see more of Dan and Kara, David and Daisy, and find out whether Carolina has made peace with her relationship with the much younger and very sexy Irishman, Seamus O'Grady. Ready? Set? Let's go back to Gansett Island!Gansett Island Reading OrderMaid for Love (Mac & Maddie)Fool for Love (Joe & Janey)Ready for Love (Luke & Sydney)Falling for Love (Grant & Stephanie)Hoping for Love (Evan & Grace)Season for Love (Owen & Laura)Longing for Love (Blaine & Tiffany)Waiting for Love (Adam & Abby)Time for Love (Daisy & David)Meant for Love (Jenny & Alex)Chance for Love, A Gansett Island Novella (Jared & Lizzie)Gansett After Dark (Owen & Laura)Kisses After Dark (Shane & Katie)Love After Dark (Paul & Hope)Celebration After Dark (Big Mac & Linda)Desire After Dark (Slim & Erin)Light After Dark (Mallory & Quinn)Victoria & Shannon (Episode 1)Kevin & Chelsea (Episode 2)A Gansett Island Christmas NovellaMine After Dark (Riley & Nikki)Yours After Dark (Finn & Chloe)Trouble After Dark (Deacon & Julia)Rescue After Dark (Mason & Jordan)",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Fiction",
    "Chick Lit",
    "Family",
    "Adult"
  ],
  "author": "Marie Force",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/16159901-waiting-for-love"
}