{
  "title": "Thinking Anew: Harnessing the Power of Belief",
  "description": "Thinking Anew is the perfect gift for someone going through hard times. You can give this gift to yourself or empower someone else who’s struggling to get what they want. You don’t get the chance to begin life anew very often. Using the power of writing to become what you are meant to be is not about grammar, spelling or polished writing. This is a gripping, private, non-judgmental approach to personal transformation.  You will learn how to clarify what you don’t want so you will know what you do want. You will learn to unwind, untangle and challenge the beliefs that are holding you back. You will learn to create doable aspirations and capture the creative thoughts that bubble up within you during this process. New beginnings, like all start-ups, are ugly . . . even when the power of writing as a change agent has been known for thousands of years. Being creative is always a challenge. While book stores debate about slotting Thinking Anew in their inspirational or spirituality or self-help or creative writing or journaling or addiction & recovery sections, mental health professionals would categorized it as written goal focused therapy . . . how to know what you want and how to get it.  Thinking Anew is a book within a composition book that helps people in crisis find the passion to make change stick. If you have ever gotten enthusiastic about a self help approach but became disappointed as your enthusiasm waned, then this book is for you. Writing is a powerful change agent when combined with an evidence based self-improvement methodology. If done daily, this approach will allow you to stay connected with your aspirations in a most profound way. It will even turbo-charge other self help programs and therapies as it is the perfect place to keep notes and capture your creative thoughts. Writing can be an antibiotic for distorted thinking. It clears the mind, provides access to your subconscious and soothes the soul. So purchase your Thinking Anew composition book, find a fast lead pencil or pen and start putting your black marks above a blue line on white paper and be wide open to learning new ways of doings things. You can create a masterpiece about yourself, one page at a time. Make this a real page turner . . . Pulitzer Prize potential . . . about your success going forward.  Caution, some assembly required. You will discover your results are directly in line with your commitment to the process. The author, Gene Moynihan, is a psychotherapist. He had a contract with the New York City Police Department for ten years helping cops deal with the dark side of their profession: suicidal thoughts, substance abuse, post-traumatic stress, depression and marital discord. He has helped many first responders . . . firefighters, police officers, military, nurses, doctors . . . become what they are meant to be.",
  "genres": [
    "Self Help",
    "Nonfiction"
  ],
  "author": "Eugene F. Moynihan Jr.",
  "average_rating": "4.69",
  "url": "https://www.goodreads.com/book/show/16160149-thinking-anew"
}