{
  "title": "The Dark Woods: A Lesbian YA Short Story Collection",
  "description": "THE DARK WOODS is a bewitching collection of young adult short stories, ranging from science fiction and fantasy to paranormal, all featuring a lesbian heroine. This collection is part of Project Unicorn, a fiction project that seeks to address the near nonexistence of lesbian main characters in young adult fiction by giving them their own stories.This collection contains:- Witch Girls (Dark Fantasy)The wild witch girls lurk at the edge of the woods, waiting to snatch away any girl who’s less than good. Gran’s warnings are the same every day: be good, or the witch girls will take you. But what if you want to be taken?- Surfacing (Fantasy)When Alice’s brother John takes a mermaid out of the sea and drags her into the woods to die, Alice must find the courage to stand up to the worst bully she’s ever known in order to save a life.- Curse Cabin Confession (Paranormal)When Robin invites her girlfriend, Malinda, up to her family cabin for the weekend, it’s not just for a romantic time. Robin has a confession to make: she’s not exactly human.- Wolves of Leaving (Paranormal)After challenging the Alpha–and losing–Cadie begs the girl she loves to forsake all they’ve ever known and escape the tyranny of the pack.- Devil May Care (Paranormal)When Corrine is forced to summon a demon to find a missing loved one, the afternoon turns stranger than expected.- A Craving (Fantasy)Snow knows little of the world, having spent most of her life within the safe confines of the cottage she shares with seven little men, her protectors. But every day, a young girl comes to the door, offering her an apple, and every day brings Snow one step closer to taking a bite.- Natural (Paranormal)Terra feels confused and alone–until she meets a mysterious girl in the forest, standing next to her favorite tree…- Haunt (Paranormal)Every moonrise, Tam and Ailsa defy the laws of time and space to meet in the forest and kiss beneath the stars.- Dreaming Green (Science Fiction)Mirelle catches a mysterious seed during a spacewalk, and, though it is forbidden, she dares to plant it, nurture it, and let it grow.- Mirrors (Fantasy)Bewitched by an old compact in an antique store window, Maisy is startled to realize that the reflection in the mirror is not her own.",
  "genres": [
    "LGBT",
    "Short Stories",
    "Anthologies",
    "Young Adult",
    "Science Fiction Fantasy",
    "Lesbian",
    "Queer"
  ],
  "author": "Jennifer Diemer",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/16160386-the-dark-woods"
}