{
  "title": "Lust",
  "description": "Evangeline Chase is standing at the edge of a crossroad. After choosing to be blissfully ignorant for far too long and willfully ignoring what her life has been lacking, fate is about to intervene. When Alexander Mason, a striking and powerful venture capitalist, is introduced as her new boss, Eva is overwhelmed by an intoxicating cocktail of hormones and lust that leaves her struggling to maintain her composure and more importantly, control of her life.With an undeniable urge to dominate her new boss, her own lust-filled fantasies lead to a transformation that shakes her to her core. But when Alexander challenges Eva to satisfy her carnal urges, she is forced to choose between her career, her desires, and an unconventional and lustful relationship. Consumed by fear and forced to maintain control at all costs, Eva must decide if having it all is worth risking her career, her world, and possibly, love.Three Stages of Love: Lust is the first book in a suspenseful new erotic romance series that explores the questions that young women have while embarking on their journey through life and love. Eva’s transformation from prim and proper to fun and dominating proves to be one of the most erotically intriguing personal makeovers around. Her passion for her career and life goals ultimately gives way to uninhibited encounters that leave her intoxicated and yearning for more. Eva’s emotional battle between her heart and mind leave her juggling with a desire to have it all and a profound fear of losing everything.Written to illustrate the average, driven woman’s point of view, Three Stages of Love: Lust tackles the everyday fears and desires that young women have in an intoxicatingly erotic way. A gripping, palpitation-inducing romance full of underlying themes that are extraordinarily relevant to modern women, this enthralling erotic novel by T. C. Anthony is a must-read for women of all backgrounds.",
  "genres": [
    "Romance",
    "Erotica",
    "Fiction",
    "Contemporary",
    "Chick Lit",
    "Adult",
    "Erotic Romance"
  ],
  "author": "T.C. Anthony",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/16163294-lust"
}