{
  "title": "Corcitura",
  "description": "Corcitura. Some call it hybrid, others half-blood, mongrel, beast. They are all names for the same thing: vampire—the created progeny of the half-wolf, half-vampire, barb-tongued Grecian Vrykolakas, and the suave but equally vicious Russian Upyr. Corcitura: this is what happens when a man is attacked by two vampires of differing species. He becomes an entirely new breed—ruthless, deadly, unstoppable…almost.London, 1888: Eric Bradburry and Stefan Ratliff, best friends since childhood, have finally succeeded in convincing their parents to send them on a Grand Tour of the Continent. It will be the adventure of a lifetime for the two eighteen-year-old Englishmen, but almost from the moment they set foot on French soil, Eric senses a change in Stefan, a change that is intensified when they cross paths with the enigmatic Vladec Salei and his traveling companions: Leonora Bianchetti, a woman who fascinates Eric for reasons he does not understand, and the bewitching Augustin and Sorina Boroi—siblings, opera impresarios, and wielders of an alarming power that nearly drives Eric mad.Unable to resist the pull of their new friends, Eric and Stefan walk into a trap that has been waiting to be sprung for more than five hundred years—and Stefan is the catalyst. Terrified by the transformation his friend is undergoing, Eric knows he must get Stefan away from Vladec Salei and Constantinos, the rabid, blood-crazed Vrykolakas, before Stefan is changed beyond recognition. But after witnessing a horrific scene in a shadowed courtyard in Eastern Europe, Eric’s worst fears are confirmed.Six years removed from the terror he experienced at the hands of Salei and Constantinos, Eric finally believes he has escaped his past. But once marked, forever marked, as he painfully begins to understand. He has kept company with vampires, and now they have returned to claim him for their own.",
  "genres": [
    "Fantasy",
    "Horror",
    "Historical Fiction",
    "Vampires",
    "Thriller"
  ],
  "author": "Melika Dannese Hick",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/16163796-corcitura"
}