{
  "title": "Made in Acapulco",
  "description": "MADE IN ACAPULCO is a collection of short stories featuring Emilia Cruz, the first and only female detective on the Acapulco police force. With hot nights on the beach and suspense straight out of the news, the series goes inside Mexico's drug war with a fearless style and a woman who will be hard to forget. The stories in MADE IN ACAPULCO take place before the action in the full-length Emilia Cruz mystery novels, including CLIFF DIVER and HAT DANCE. They have the same fast and dangerous vibe that caused Kirkus Reviews to say this about CLIFF DIVER: \"Consistently exciting . . . A clever Mexican detective tale that will leave readers eager for the series' next installment.\" MADE IN ACAPULCO contains five stories: The Beast captures Emilia's struggle to become the first female police detective in Acapulco. It previously appeared in The Huffington Post's Huff/Post 50 Featured Fiction showcase. The Disappeared sees Emilia search for a friend who goes missing. Those who have gone missing amid Mexico's drug war violence is a continuing theme throughout the mystery series. The Artist was inspired by Mexican poet Javier Sicilia's efforts to bring awareness to the plight of families impacted by the drug war violence and references photos of some of the rallies held in Mexico in recent years. The Date explores the downside of a job that pits Emilia against Mexico's enduring culture of machismo, while also drawing on real events that occurred in a nightclub in Mexico in 2006. The Cliff is the original Emilia Cruz story. Written for a literary critique group, the story was initially entitled So Far From God and introduces hotel manager Kurt Rucker. The story became the basis for CLIFF DIVER, the first Emilia Cruz novel. MEET EMILIA CRUZ Detective Emilia Cruz is a good liar, a fast thinker, a determined investigator and a mean kickboxer. An Acapulco native forced to grow up too fast, she's been a cop for nearly 12 years and a detective for two; a strong woman in a squadroom that didn't want her and is still trying to break her. But Emilia isn't afraid to defend herself and get what she's rightfully earned. But she doesn't know how to handle gringo Kurt Rucker, the manager of a luxury hotel in Acapulco. A former U.S. Marine, he has the confidence and leadership qualities she admires. A triathlete, he's calm under pressure and knows what he wants. But does Emilia? THE TWO FACES OF ACAPULCO There's the Acapulco that tourists know; luxury hi-rises, candlelit nights on the beach, the sweep of the most beautiful bay in the world, the majesty of the clear blue Pacific. There's also the Acapulco that is a prize to be fought over by drug cartels--the city that is home to hookers and thieves, the streets where life is cheap and poverty is as pervasive as the wind off the ocean. Both of these versions of Acapulco claw at each other and force Emilia to survive between them. No investigation will be easy, no crime will be simple. Grab a margarita and come on down to Acapulco . . . If you can take the heat. MADE IN ACAPULCO also contains the first two chapters of Carmen Amato's political thriller THE HIDDEN LIGHT OF MEXICO CITY. Attorney Eddo Cortez Castillo's unexpected relationship with housemaid Luz de Maria Alba Mora becomes a dangerous vulnerability when he investigates links between Mexico's Minister for Public Security and the country's most elusive drug cartel leader. As presidential elections near, Eddo's investigation will uncover a political double-cross fueled by drug money. He'll follow the money trail deep into the underbelly of Mexico's drug culture, where violence buys loyalty, votes are for sale, the odds are against survival, and only a woman whose name means Light of Mary can guide him out. \"Note: This is the second edition of MADE IN ACAPULCO and contains additional original content. The 2012 edition is no longer in print.\"",
  "genres": [
    "Mystery",
    "Fiction",
    "Short Stories",
    "Thriller",
    "Suspense",
    "Crime"
  ],
  "author": "Carmen Amato",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/16164097-made-in-acapulco"
}