{
  "title": "Patriot's Daughter: The Story of Anastasia Lafayette for teen-age girls",
  "description": "Shy at having to go to school alone the first day, because father has work for Jeff, Serilda does not seem a girl who will boldly exchange her precious gold locket for a dying horse. The family is concerned for her and indignant at the camper responsible for the transaction.And yet, they are often to be grateful they have Star. Once the pretty sorrel mare made up her mind to live, she is playmate and helper in everything. Loyal and gentle, she holds the rope on the wayward, half-loosened ferry until they can secure it, thereby saving the threatened bridge. When Jeff cuts himself severely, it is Star who makes the long miles to town and doctor in time to save him. Because of their courageous help, Serilda and her mare are to be first over the bridge when it opens officially. But she makes sure Katie, the camper’s girl, and Jeff are beside her.Here is a warm, deeply felt sense of family living. The parents’ praise, when won, is full. What the book gives best is the simple acceptance of togetherness. They will raise Katie as their own. Serilda’s prize money buys Katie’s books. Joy for one makes joy for all. It is no wonder then that when the long-awaited letter comes from Katie’s mother, everyone’s feelings are shared by the reader.“Eleven-year-old Serilda Shaw is a true child of Northern Missouri. Her life in 1866 is bound by an intense love of the frontier country and a great affection for animals. When she intervenes in the shooting of a mare, she is determined to nurse her and prove that she is a fine thoroughbred. Sherilda's resolve, strengthened by diligence and courage, is rewarded when the pedigree is finally established. A counter theme of friendship between Sherilda and a waif-like child round off this story which abounds in attractive contemporary detail and historical color.” KIRKUS REVIEWAnd yet, they are often to be grateful they have Star. Once the pretty sorrel mare made up her mind to live, she is playmate and helper in everything. Loyal and gentle, she holds the rope on the wayward, half-loosened ferry until they can secure it, thereby saving the threatened bridge. When Jeff cuts himself severely, it is Star who makes the long miles to town and doctor in time to save him. Because of their courageous help, Serilda and her mare are to be first over the bridge when it opens officially. But she makes sure Katie, the camper’s girl, and Jeff are beside her.Here is a warm, deeply felt sense of family living. The parents’ praise, when won, is full. What the book gives best is the simple acceptance of togetherness. They will raise Katie as their own. Serilda’s prize money buys Katie’s books. Joy for one makes joy for all. It is no wonder then that when the long-awaited letter comes from Katie’s mother, everyone’s feelings are shared by the reader.",
  "genres": [
    "Historical Fiction"
  ],
  "author": "Gladys Malvern",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/16164642-patriot-s-daughter"
}