{
  "title": "Scapemaker",
  "description": "Matthew is the son of Mr. Nicholas Namely, a local high school teacher. But unbeknownst to Matthew, his father is a dreamscaper whose classroom is connected to the dream-world. From his classroom, his students enter the halls of Scapemaker, a dream-world high school for young dreamscapers. Following a couple of heartfelt tragic events, Matthew is compelled to investigate the unbelievable mysteries surrounding those events and is propelled into a whole new world. Matthew and his mother, Mae, are soon coerced into moving across the country for his father's strange medical needs. While attending his new school, Matthew comes to know the secrets that Daedree, an annoying girl from his former high school, has locked away. Matthew also meets Amber, a beautiful enigmatic girl who leads him to Mr. Xoner's classroom. While there, he learns the art of dreamscaping (which has been in the Namely bloodline for thousands of years). Matthew will come to know of Nox Celare, otherwise known as The Sandman, who is after a special element called Magineum. Neck deep in skinwalkers, sandsleepers, zombies, soul feeders, ghosts, dream-world criminals known as “night terrors” and more, Matthew learns he is in over his head. Matthew must not only solve the mysteries surrounding those tragic events, but he will also have to protect the Magineum with his life and find a way to be with the one girl of his dreams. Filled with secrecy, mystery and a forbidden tangle of young love, this new life will lead Matthew to unbelievable characters with the most extraordinary abilities he could never have imagined.Scapemaker will keep you grounded in the real world while at the same time make the fantastical world around it that much more possible and enduring. This tale of young adult paranormal fantasy will keep you guessing and wanting more.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Science Fiction",
    "Fiction",
    "Paranormal"
  ],
  "author": "Steve V. Cypert",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/16164484-scapemaker"
}