{
  "title": "Emily Post's Etiquette",
  "description": "For the first time in its history, this American classic has been completely rewritten. Peggy Post gives us etiquette for today's times. Read by millions since the first edition was published in 1922, Emily Post—the most trusted name in etiquette—has always been there to help people navigate every conceivable social situation. The tradition continues with this 100 percent revised and updated edition, which covers the formal, the traditional, the contemporary, and the casual. Based on thousands of reader questions, surveys conducted on the Emily Post Institute and Good Housekeeping Web sites, and Peggy's travels across the country, the book shows how to handle the new, difficult, unusual, and everyday situations we all encounter. The definition of etiquette—a code of behavior based on thoughtfulness—has not changed since Emily's day. The etiquette guidelines we use to smooth the way change all the time. This new edition resolves hundreds of our key etiquette concerns: dealing with rudeness, netiquette, noxious neighbors, road rage, family harmony, on-line dating, cell phone courtesy, raising respectful children and teens, and travel etiquette in the post-9/11 world...to name just a few. Emily Post's Etiquette, 17th Edition also remains the definitive source for timeless advice on entertaining, social protocol, table manners, guidelines for religious ceremonies, expressing condolences, introductions, how to be a good houseguest and host, invitations, correspondence, planning a wedding, giving a toast, and sportsmanship. Peggy Post's advice gives us the confidence of knowing we're doing the right thing so we can relax and enjoy the moment and move more easily through our world. Emily Post's Etiquette, 17th Edition will be the resource of choice for years to come.",
  "genres": [
    "Nonfiction",
    "Reference",
    "Self Help",
    "Classics",
    "Education",
    "Business",
    "Psychology"
  ],
  "author": "Peggy Post",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/161651.Emily_Post_s_Etiquette"
}