{
  "title": "Koban",
  "description": "Quantum gravity theory revealed hidden dimensions that concealed gravity’s strong link to Tachyon Space. Nearly unlimited cheap energy from tachyons led to the creation of Jump Hole technology and faster than light travel to the stars. In two hundred years, humanity had colonized over seven hundred planets in a volume five hundred light years in radius. Humankind enjoyed the benefits of the end of wars and disbanded its standing armies.Then the Krall came.The Krall, a warrior race with lightning-fast reflexes has used combat for 25,000 years to select the genes of the strongest and fastest warriors. This breeding program created a species fit to dominate the galaxy. Dominate everywhere but on Koban, an uninhabited planet with high gravity, teal colored flora and impossibly fast and savage animals that employ organic superconducting nerves.The Krall captured humans at the fringes of their expansion for testing on Koban. Humanity was useful only if they were adequate fighters. If not, the Krall intended to destroy the species because they already had slave races, and humans were poor tasting meat animals. If humans proved worthy opponents, the Krall would fight with the same weapons humans used, in order to continue their quest for physical perfection.Growing weary of the humans’ incapacity to fight well so far, the Krall were close to a decision to eliminate the race when they captured a large ship full of humans for testing – a charter ship containing bio-scientists. The choice for the scientists was Put up a good fight or condemn humanity to extinction. However, if facing the Krall wasn't problem enough, they had to survive Koban and its superfast animals. Intelligent predators, Rippers, were too fast even for the Krall to face. Human If you can't beat them, become them.The Krall will discover more than one species knows how to bypass natural genetic selection.",
  "genres": [
    "Science Fiction",
    "Space Opera",
    "Military Fiction",
    "Military Science Fiction",
    "Space",
    "Fiction",
    "Aliens"
  ],
  "author": "Stephen W. Bennett",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/16165838-koban"
}