{
  "title": "Heart's Conquest",
  "description": "Now in the iTunes Bookstore! http://bit.ly/QX1LIg“He has no right to do this!” Alicia cannot believe it. The land has been in her family’s possession for more than two hundred years. So the three-tailed comet that alarmed the people of Britain when good King Edward the Confessor lay dying, only seven months ago, was really an omen of disaster! Can it be that the old king’s visions of widespread carnage and death will come true too? William of Normandy has already seized the kingdom of Britain and the Saxons’ newly chosen King Harold lies dead on Senlac height. Now, even though her home has been confiscated because of her defiance, lovely Alicia of Hastings vows that at least one woman in Britain will not yield to the Conqueror. Hating all Normans, Alicia scorns her persistent suitor Richard de Langalais and seeks refuge with Gytha, King Harold’s mother. She is accompanied in exile by faithful Friar Peck and dear, dull Cousin Henry of Gloucester to whom, for the dark future she anticipates, she has listlessly promised marriage. Vengeance is first in her mind. “I can do all things through Him who strengtheneth me,” she tells herself, appropriating for a strange use the Biblical words that a young Norman duke, Gilbert de Gant, quoted for her comfort when she left home. And yet, in spite of her bitterness, she has a reluctant desire to meet again that kind, dark-eyed knight who seemed so different from the ruthless king he serves.While the Conqueror is building his forts and towers and consolidating his kingdom, Alicia sings her way across Britain with her companions, as a minstrel. With Glytha’s help she is weaving a fierce, secret plot of revolt. She little knows that it is she who will make all the Confessor’s bloody dreams come true – or that she herself must bow at last to one conqueror that her heart cannot resist. Miss Malvern captures all the high-hearted pride and pageantry of early Britain against a background of real historical events.For readers age 12 and above.",
  "genres": [
    "Historical Fiction"
  ],
  "author": "Gladys Malvern",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/16166412-heart-s-conquest"
}