{
  "title": "Siren Song",
  "description": "How can a pint-sized,self-avowed word nerd master otherworldly forces when she hardly has thewherewithal to master calculus? That's exactly the conundrum for ArielRobinson, who arrives at Montana State University and quickly encounters farmore than the normal share of freshman woes. Siren Song: Book 1 of the Siren Song Trilogy is author B.A.Blackwood's first of three wildly inventive, humor-inflected young adultfantasy novels starring fallen angels who roam the earth, and the unsuspectingwho happen across their high-flying paths.With wit, suspense, and a romance that transcends the human plane, it'sa smart, fantastical foray certain to absorb readers who relish a read that'sequal parts fantastical and downright funny. When Ariel receives the glossy brochure from MontanaState University, the outdoorsy tomboy feels like a lifer who's been shown thesecret escape passage from her parents' Dallas socialite scene. But when shearrives in Bozeman with her trunk load of books and headful of ten-dollarwords, the welcoming committee is far from what she had hoped for. Ariel'sactually been lured into the training grounds of two battling factions of theFallen Angels, who are convinced that she can lead them to the Piece of Home, amysterious, coveted object that will determine who wins their war. All is notlost, however. A ridiculously good-looking senior named Michael seems intent onpopping up everywhere to chaperone her home. While her blonde bombshell roommate Kristin and geekyclassmate Todd insert themselves into their relationship in various vexingways, Ariel is soon initiated into a world of Fallen Angels, including thekindly, patriarchal Achimalech, snooty Daniel, robotic Cyrus, and superstarlawyer Lucian. Can Ariel find the Piece of Home and settle the age-oldscore--and snag a super hot boyfriend in the process?",
  "genres": [
    "Fantasy",
    "Paranormal Romance"
  ],
  "author": "B.A. Blackwood",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/16166543-siren-song"
}