{
  "title": "Prophets of the Ghost Ants",
  "description": "Prophets of the Ghost Ants is a four part science-fantasy novel, currently available as a paperback. The Illustrated Prophets of the Ghost Ants, Part One, The Roach Boy is available as a Kindle ebook. https://www.goodreads.com/book/show/2...The setting is Earth of the far-flung future, when all traces of our civilization have long vanished. The catastrophes of distant ages -- natural and man-made -- have passed into legend and mysticism. And yet ... the world is no utopia. Technology is unknown. The animal kingdom as we know it is extinct. Birds, reptiles, mammals -- all lost to endless, unforgiving cycles of planetary death and rebirth. Humankind has clung stubbornly to existence -- thanks to a perverse turn of Evolution. For as the weary planet became inexorably depleted, our species adapted by growing smaller with every passing eon, until at last we stood in parity with the only other “higher” species to survive -- insects. And just as our current society has domesticated animals to sustain ourselves, the human societies of this future have yoked insects to their service. Food, weapons, clothing, art -- even the most sacred religious beliefs -- are derived from Humankind’s profound intertwining with the once-lowly insect world.In this savage landscape, men cannot hope to dominate. Ceaselessly and viciously, humans are stalked by Night Wasps, Lair Spiders, and Grass Roaches. And men are still men. Corrupt elites ruthlessly enforce a rigid caste system over a debased and ignorant populace. Duplicitous clergymen and power-mongering Royalty wage pointless wars for their own glory. Fantasies of a better life, a better world, serve only to torment those who dare to dream. One so cursed is a half-breed slave named Anand, a dung-collector of the midden caste who, against all possibility, rises above hopelessness to lead his people against a genocidal army of men who fight atop fearsome, translucent Ghost Ants. And to his horror, Anand finds that this merciless enemy is led by someone from his own family ... a religious zealot bent on the conversion of all non-believers ... or their extermination.",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Adventure",
    "Fiction",
    "Dystopia",
    "Post Apocalyptic",
    "Horror"
  ],
  "author": "Clark Thomas Carlton",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/16167009-prophets-of-the-ghost-ants"
}