{
  "title": "Wet or Dry, Chapter 1: The Listening Room",
  "description": "NOTE FOR READERS: 1. WET OR DRY, \"The Listening Room,\" is a story of 5800 words, or 20 pages, with an added sample of \"Injured Reserves.\" BONUS: All \"WET OR DRY\" stories now included with the DCBourone novella \"Injured Reserves.\"\"THE LISTENING ROOM\":A kind of psychological profiling so exquisite it could duplicate minds.Some aspect of particle physics.Entanglement. “Entanglement is a quantum phenomenon, certainly. We’ll know the specifics in time,” Klaus Meyer had said. “After all the Cube’s function is an aspect of the quantum realm. I’m intrigued, obviously. We’re all intrigued.”As a previous and likely future CEO of the BioMet and PrimeLogic consortium, Klaus Meyer was more than intrigued: he kept his key in a Moehler safe at the Bureau of Weights and Standards in nearby Gaithersburg, Maryland, and in the incestuous manner with which the leading software companies policed themselves it was Klaus, escorted by enforcers recently seconded en mass from the F.B.I. and temporarily badged with the Information Technology Division, who had insisted the Cube must be shut down.“A kind of goodwill gesture, Sterling,” he had said. “What might be suspected should never be known. A non-subscribed and unsupervised Artificial Intelligence. Absent further advances I'm not really sure we have the technology to adequately supervise The Cube. A 'wild' AI, Sterling. Contained. But wild. And it happens to be our own. Shutting it down would be the elegant solution.” Klaus, whose pale eyes had always glazed at the very idea of “elegant” anything including elegant code; Klaus, who, like a raptor in a perfect thermal, had risen effortlessly in the hierarchy of the world’s premiere policing institution.The Bureau of Weights and Standards Information Technology Division, or ITD, now a dark hydra with global reach, Klaus its leader and most sincere and ruthless advocate. The artists of prediction had been extensively studied for decades, H.G. Wells to Bester, Asimov to Herbert, Arthur C. Clarke through Bruce Sterling, William Gibson and Charles Stross; Iain Banks and his epic Culture to Louis Karpov and his Tides of the Mind, Tilde Demimonde and her Is This the Sound of Breaking Glass, Reuben Constantine and his Thinking Angels, Walking Softly. It had been the natural conclusion in this age of continuously evolving artificial intelligence, more than halfway through a new century, that William Gibson all the way back in 1983 had most accurately modeled the need for an all powerful enforcement mechanism in his staggering accomplishment of predestination, Neuromancer. Gibson's Turing Police now wore the badge of the United States ITD, could melt the moon with a stare, had infinite discretion and an infinite budget. And as far as Sterling could tell had no oversight whatsoever, other than the sociopath presently seated before him.A ghost lingered, so far unnamed. Toshi Sanjiro, college roommate, colleague, apostate. Toshi, who apparently had his own version of the Cube, and as head of Sony Robotics had given his version a kind of life.“Let the common behave like animals and fools, Sterling,” Klaus said. “Men have been screwing their digital servants for forty years. But we must maintain a higher standard. ITD has no choice in this instance: Toshi is breaking the law. A multitude of laws. Our laws. He has created and embodied an unsupervised AI. He has animated a super intelligence. He has created a consort of unknown powers and abilities, for his own carnal needs, his own amusement. We should consider his betrayal obscene.”“I'm not sure that's what he had in mind,” Sterling had replied.Sterling had met Toshi’s “servant.” And had known, instantly, that she was another order of magnitude entirely...",
  "genres": [
    "Short Stories"
  ],
  "author": "D.C. Bourone",
  "average_rating": "4.82",
  "url": "https://www.goodreads.com/book/show/16167235-wet-or-dry-chapter-1"
}