{
  "title": "Blood and Steam",
  "description": "Five Stars: \"Cannot say enough about how much I enjoyed this book. Author knows how to write an interesting story.\"-Goodreads ReviewFive Stars: \"Sedgwick's imagination soars for this tale...\"-Amazon ReviewFive Stars: \"... the best series I've read in a long while... This series gets top marks from me... No steam collection is complete until you own these three books\"-Amazon ReviewDESCRIPTION:At last, all will be known...Many years have passed since Breeze Tinkerman vanished in her spring-powered plane over the northern Wastes while searching for the fabled lost city in the ice, but her daughter River is more than happy to carry on her legacy. The Vangar overlords have turned Astatia into a slave state, forcing citizens to work in their mines and factories, stealing Astatia's resources for their own greedy ends while living safely high above in the sky-city known as Juntavar.  River has never known any life other than the mean streets of Dockside, but street life has made her strong and resourceful. She's the perfect leader, and that's what her ragtag group of rebels needs most. The rebels meet to conspire against their overlords but their meeting is interrupted by three sentinels - Vangar warriors whose bodies have been melded with nine-foot-tall suits of armor powered by steam - and River has no choice but to lead the Vangars away from the others, exposing her and forcing her to go on the run.  Along the way, River runs into some of the last people she'd ever expected to meet. She learns that there still might be a way to defeat the Vangars. She also learns that her mother's fate may have been decidedly different than what she was led to believe. Now, River will do anything to learn the truth about her blood-kin. And one way or another, she's determined to destroy the Vangars once and for all.  Also contains the short story \"The City in the Wastes.\"",
  "genres": [
    "Steampunk",
    "Fantasy",
    "Science Fiction",
    "Fiction",
    "Young Adult",
    "Romance"
  ],
  "author": "Jamie Sedgwick",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/16167286-blood-and-steam"
}