{
  "title": "Heartshot",
  "description": "Posadas County, New Mexico, hugging the San Cristobal mountains separating it from Mexico, has very few mean streets. No city-slick cop shop either, but an earnest, elected Sheriff and his aging Undersheriff, William C. Gastner. Pushing sixty, and the girth of his Sam Browne uniform belt, widower Bill has no other life than in law enforcement and doesn't want one, even if he's being nudged gently towards retirement. Then big time trouble strikes. A car full of teens out by the lake, running from a stop by Deputy Torrez, goesairborne into a rocky outcrop, killing all five kids and revealing a package under the seat. A stash of cocaine this size argues someone or ones has brought big time crime to the county. Were the dead kids merely innocent dupes? Partying that July Fourth night? Dealing? Searching for answers, Bill deploys his department while dealing with grieving parents, one of whom starts packing a gun. Then a second explosion of violencefells an undercover cop whose fate is decided in a tension-filled, brilliantly described, air ambulance flight.Under pressure, the sheriff's department shows its mettle and pulls together to make a formidable team. Its weak spot may be Bill, whose mind is too tough tocrumble but whose body, long mistreated, gradually succumbs to stress. Ignoringall advice and sense he pilots the case to a final dramatic, midair confrontation where the fate of the killer and the cop will be decided.... The author's deep affection for southern New Mexico and his gift for vividlyetching ordinary people make this well-plotted first novel a standout. About the Author: Steven F. Havill lives near Albuquerque, New Mexico,with his wife Kathleen, a writer and artist. A dedicated high school teacherof high school biology and English by day Havill earned both his B.A. and M.A.from the University of New Mexico. Besides writing the seven UndersheriffBill Gastner mysteries, of which Heartshot is the first, Havill has alsowritten three Western novels.",
  "genres": [
    "Mystery",
    "Westerns",
    "Fiction",
    "Crime",
    "Mystery Thriller",
    "Audiobook",
    "Detective"
  ],
  "author": "Steven F. Havill",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/1616870.Heartshot"
}