{
  "title": "السجين 32: أحلام محمد سعيد طيب وهزائمه",
  "description": "يحضر الناشط السعودي محمد سعيد طيب عبر محطات حياته الصاخبة في معرض الرياض الدولي للكتاب هذا العام، من خلال كتاب «السجين 32» لأحمد عدنان، الذي هو عبارة عن جلسات حوار مستفيضة جرت بين المؤلف وطيب خلال عام ونصف العام في مقاهي بيروت ويصف عدنان، في حديث لـ«الحياة» الكتاب بأنه «مسيرة 50 عاماً لمحمد سعيد طيب»، لافتاً إلى أن «الكتاب لا يتحدث عن تاريخ شخص بقدر ما يتحدث عن تاريخ المملكة، من خلال هذا الشخص»، مشيراً إلى أن «الكتاب يتضمن شهادات عدة حول مراحل معينة في تاريخ البلد لشخصيات مواكبة لتلك الفترة مثل الشاعر محمد العلي، تركي الحمد، باقر الشماسي، عبدالله أبو السمح، رضا لاري»وتابع بأن «الكتاب أفرد مساحة جيدة لتجربة طيب في شركة تهامة ودورها الثقافي»، معبراً عن أسفه لأن «جيل اليوم نسيها كثيراً، كما نسي دور شركة تهامة الرائد في عالم المكتبات وعالم القراءة والكتب، ونحن نحاول أن نذكر فيها»، وقال بأن «هذه صفحة مهمة من تاريخنا»، إضافة إلى أن «الكتابة السياسية في السعودية ليست حاضرة والتاريخ السياسي مبتور». والكتاب يحاول أن يقدم صورة جديدة وموضوعية عن مراحل معينة من تاريخ البلد والتي من أبرزها «كيفية التعاطي السياسي، مع الشأن الثقافي»، و«كيفية التعاطي السياسي مع الشأن الصحافي»، إضافة إلى «محاولة اكتشاف الحراك السياسي قبل 11 أيلول (سبتمبر)، والذي ليس معروفاً بشكل كبير في فترات مثل الستينات الميلادية على وجه الخصوص».وأرجع تسمية الكتاب بـ«السجين 32» إلى أن «طيب تعرض لدخول السجن مرات كثيرة، كان في إحداها يحمل هذا الرقم»، معبراً عن اعتقاده بأن «الكتاب جديد، ولا يمكن اعتباره بدقة سيرة ذاتية أو مذكرات»، لافتاً إلى أن العمل على الكتاب استغرق نحو عام ونصف العام من تموز (يوليو) 2009 إلى تشرين الثاني (نوفمبر) 2010».وأشار إلى أن «علاقة طيب توثقت بصحيفة «الحياة» خلال عامي 93 أو 94 حين كان في السجن الحائر»، وعزا ذلك إلى أن «طيب استشف من خلال تجربته تلك أن الصحيفة دسمة وثرية، وتستغرق وقتاً طويلاً لقراءتها كما يجب»، منوهاً إلى أن «هذا ما جاء على لسان طيب».وقال عدنان إن الكتاب «ليس كتاب إثارة، وإنما حاولت قدر الإمكان أن يخرج بصيغة موضوعية، وأن يحرص على تقديم المعلومة والشهادة التاريخية، قبل أي إثارة من أي نوع»، وتمنى أن يكون «النقاش حوله يلامس منهج الكتاب والمعلومات التي قدمها قبل أن يكون مزايدة».",
  "genres": [
    "Politics",
    "History",
    "Biography"
  ],
  "author": "أحمد عدنان",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/10678127-32"
}