{
  "title": "Legacy of the Moon: The Story of Cleopatra Selene",
  "description": "Cleopatra Selene was born to a world of plenty, where all of her wishes were granted. She was a princess of an ancient and powerful family of Egypt. Her own mother was a pharaoh, what else could a girl want more than that. Her whole life was planned out and sung to her by her own mother who cherished her in her loving embrace. Suddenly it was all ripped away, leaving Cleopatra Selene and her siblings stunned and frightened. Their mother was killed by the venomous Octavian; their father had fallen in honor on his own sword in battle, their older brothers rumored to have been killed as well. In shackles they were thrown aboard a ship headed straight to Rome into the house of their own father's other wife....His lesser, Roman wife named Octavia, who happened to also be the sister of their mother's killer! Their lives once happy and predetermined were now one huge nightmare and they were all helpless and now the property of Rome...Cleopatra Selene became one of Rome's valuable pawns in a marriage arranged by Octavian. She vowed that she was never be helpless again and fought her whole life to make sure she had some control in a world that listened only to Rome. She would learn how to be strong and how creatively to protect herself and her own children. Cleopatra Selene was only one of several children of the legendary Cleopatra VII and Mark Antonius of Rome. There was her twin brother, Alexander Helios-the sun and her younger siblings Arsinoe and Ptolemy. Ripped from each other and forced to make their own way in a land conquered by their enemy Octavian. The very same Octavian, who later became the first emperor of Rome later called Augustus, yet he was just a man and he had dreams. He had visions of Rome in stone and of a land of plenty stretching to the four corners of the known world. His sister, Octavia, he honored to care for the children of his now conquered enemy Cleopatra VII. Her duty was to prepare the conquered and terrified children and to make them a part of his Roman family to realize further his plans. Octavia’s daughters Antonia Minor and Major were not only hers but those of her marriage with her adulterous husband Marcus Antonius. Of them, Antonia Minor befriends Cleopatra Selene and together they form a bond that surpasses all of the boundaries of Rome. Then there is Juba II, a son of a conquered King of Numidia who was captured and raised in Rome since the age of three. In Rome, Juba II found a home and it suited him well. He fast became a scholar and clung to making discoveries and in chronicling it for the world to see of all he found in his journeys. He married Cleopatra Selene and together they brought Numidia to its former glory, until it was ripped away by rebels. Then, they pick up the pieces and move to Mauretania where they build again. For their children they would travel and endure anything and though they grew to love Rome, they were cautious and thus, they looked far away to the land of Gaul and the Keltoi to find a future and peace from the ever-grasping clutches of Rome that sought to swallow them whole. In this novel, the author cleverly blends the cultures of Egypt, Rome, Numidia, Mauretania, and the lands of the Celts to the north in incredible fact and fable. Incredibly well researched the author values the sources in which her history was found. She weighed it all and gleaned from it a fair and honorable depiction of Cleopatra VII and all she had done and accomplished, despite the garnishments of the men of Rome who only sought to dethrone any woman in power.",
  "genres": [
    "Historical Fiction"
  ],
  "author": "Sharon Desruisseaux",
  "average_rating": "3.47",
  "url": "https://www.goodreads.com/book/show/16170177-legacy-of-the-moon"
}