{
  "title": "Queen of Fashion: What Marie Antoinette Wore to the Revolution",
  "description": "In this dazzling new vision of the ever-fascinating queen, a dynamic young historian reveals how Marie Antoinette's bold attempts to reshape royal fashion changed the future of FranceMarie Antoinette has always stood as an icon of supreme style, but surprisingly none of her biographers have paid sustained attention to her clothes. In Queen of Fashion, Caroline Weber shows how Marie Antoinette developed her reputation for fashionable excess, and explains through lively, illuminating new research the political controversies that her clothing provoked. Weber surveys Marie Antoinette's \"Revolution in Dress,\" covering each phase of the queen's tumultuous life, beginning with the young girl, struggling to survive Versailles's rigid traditions of royal glamour (twelve-foot-wide hoopskirts, whalebone corsets that crushed her organs). As queen, Marie Antoinette used stunning, often extreme costumes to project an image of power and wage war against her enemies. Gradually, however, she began to lose her hold on the French when she started to adopt \"unqueenly\" outfits (the provocative chemise) that, surprisingly, would be adopted by the revolutionaries who executed her. Weber's queen is sublime, human, and surprising: a sometimes courageous monarch unwilling to allow others to determine her destiny. The paradox of her tragic story, according to Weber, is that fashion--the vehicle she used to secure her triumphs--was also the means of her undoing. Weber's book is not only a stylish and original addition to Marie Antoinette scholarship, but also a moving, revelatory reinterpretation of one of history's most controversial figures.",
  "genres": [
    "History",
    "Fashion",
    "Nonfiction",
    "Biography",
    "France",
    "French Revolution",
    "18th Century"
  ],
  "author": "Caroline Weber",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/16171.Queen_of_Fashion"
}