{
  "title": "Mall Witch",
  "description": "Poetry. \"Maybe Dennis Cooper and Jeff Clark and Eileen Myles and a few other divinities paved the way for some of Ben Fama's smartly contemporary tone, but the result is all his funny, horny, blas‚,insouciant, complicated, allusive, and bristling with mixed messages—like a Baudelairean Dionysusincarnated as a reticent anesthesiologist under house arrest for unspeakable, thrilling crimes.\"—Wayne Koestenbaum\"A text whose origins are mysterious as a mood ring, MALL WITCH's strange teenage magic is as much Facebook and tumblr as it is Brooklyn's makeshift clubs and pop-up art galleries. Fama's lyric-meme love poems evoke a present already passing, casting their spell with a winky smiley and 'pearlson a thin wrist. That's as far as [they'll] go.'\"—Kate Durbin\"The last day anybody had a right to be bored in the 21st century was the day before Beyonce made a Tumblr. Taking a paratactic plunge off of that Niagara Falls of past smiling yachts, royal photos of a bread called 'Hovis,' fleeting grasses, one feels profoundly that heaven has become aplace on earth. Even if it is, finally, Beyonce's world and we just happen to live in it, MALL WITCH makes a claim for our own magnificent productions of glorious ephemera. Perhaps they are only glorious as a crystalline booger that uncannily resembles Obama or, like, being in love. But MALL WITCH understands profoundly that glamour means enchantment, and enchantment is a virus. As we learn what consequences our technologies have on our mobile, booger-holding, bodies IRL, we're going to need works like MALL WITCH to be our mirror.\"—Brandon Brown\"Which witch bewitches us in Ben Fama's MALL WITCH? Which twitchy young thing, which moll, might troll this mall? Fama's work suggests a flaneur of the twenty-first century, equally disposed to wander the virtual landscape of hyper-smooth curves that backdrops these pages (designed by Paul Legault and Joseph Kaplan) as the hallways and food court of Westfield Shoppingtown. The book's design and text are inseparable, making a catty chatterbox that wears its influences on its Ariana Reines and Kate Durbin become brands alongside Four Loko, IKEA, and Blackberry. Part homage, part inside joke, these poems poke a manicured fingernail in this moment of self-presentation, self-consciouslydating themselves because, in true Narcissistic fashion, they would like to date themselves.\"—Amaranth Borsuk\"The immediacy of a tender escapade as it arrows into your ardent third eye, it's here within the MALL WITCH, a window into the soul you thought you had ahold of. Ah, there's a poet behind this mirror big enough for two. Before I die / I want you to be new. It wasn't just a nice plan, it was a fucking miracle, so eat now and drink!! Don't be stupid by your jaw, come to know this as another real poetry!! Don't even run, just let the MALL WITCH nail you!!\"—CAConrad",
  "genres": [],
  "author": "Ben Fama",
  "average_rating": "4.90",
  "url": "https://www.goodreads.com/book/show/16170979-mall-witch"
}