{
  "title": "Sensation & Magic 2 - the apprentice",
  "description": "This is intended for the mature female reader. It is the story of an erotic adventure, the language is direct, sexual, and the descriptions quite vivid. It is completely a work of fantasy (and eroticism)---------------There are a lot of apprenticeship and intern programs out there – but not many like this one.So I thought, as I went through the ‘training’, I would journal the process. For me, for fun, and for perhaps sometime in the distant future, when I may begin to doubt my history.So here it is – the, if you will virgin perspective on the an internship in what Cindy delicately described to me as ‘a form of sex theatre’------------I swayed over to him. Stood over his face, my legs apart, and let him gorge himself on me. Even without touching me I could feel, his desire, his sex, try to reach up and touch, caress me, every part of me, that stood open over him. I bent at the waist so my breasts hung down out of the coat – now he could see, but not touch, all of it. All of the sex, showing but not touching. He was moaning , now he was stroking himself, he couldn’t help it.-----------As I was allowed more involvement, participation, stepped more and more into the world of this theatre make believe – I felt the growing surge of the power I could have. Just for moments, just for a few minutes sometimes, inside these safe studio walls.I could hear the intake of the breath as I would move a silk stocking leg or flutter a mini skirt a little up my thigh. I could see the greedy eyes watch me as I moved a hand to my bra or slid my fingers down over my stomach – threatening the reveal, offering the nakedness, building the energy of their anticipation.There was a definite sense of power, for me, controlling their desires or exploding their desires. As I progressed I would control the whip, the dildo, the burning wax candle, the clips and the ice - and with a move and certain acquired touch and they would vibrate. For me. They would come- for me.The certain thrill of power in letting them kneel naked , exposed. Asking them to expose themselves , hold their balls, their cock, their breasts, their pussy and then allowing them, making them- come without even touching them. It wasn’t sex, it was – I don’t know. I don’t know. But it thrilled me.Of course, sometimes , it was just another thing, like a lot things it was too much it was too much sweat, too much flesh, too much odor, and you were tired and just wanted to have a coffee or a cheeseburger or something normal fully clothed, away from the bullshit.But other times it was – a surge of pure energy and sexual power.",
  "genres": [],
  "author": "Germaine Gibson",
  "average_rating": "4.69",
  "url": "https://www.goodreads.com/book/show/16171558-sensation-magic-2---the-apprentice"
}