{
  "title": "Island Time: An Illustrated History of St. Simons Island, Georgia",
  "description": "Eighty miles south of Savannah lies St. Simons Island, one of the most beloved seaside destinations in Georgia and home to some twenty thousand year-round residents. In Island Time , Jingle Davis and Benjamin Galland offer a fascinating history and stunning visual celebration of this coastal community.Prehistoric people established some of North America's first permanent settlements on St. Simons, leaving three giant shell rings as evidence of their occupation. People from other diverse cultures also left their Mocama and Guale Indians, Spanish friars, pirates and privateers, British soldiers and settlers, German religious refugees, and aristocratic antebellum planters. Enslaved Africans and their descendants forged the unique Gullah Geechee culture that survives today. Davis provides a comprehensive history of St. Simons, connecting its stories to broader historical moments. Timbers for Old Ironsides were hewn from St. Simons's live oaks during the Revolutionary War. Aaron Burr fled to St. Simons after killing Alexander Hamilton. Susie Baker King Taylor became the first black person to teach openly in a freedmen's school during her stay on the island. Rachel Carson spent time on St. Simons, which she wrote about in The Edge of the Sea .The island became a popular tourist destination in the 1800s, with visitors arriving on ferries until a causeway opened in 1924. Davis describes the challenges faced by the community with modern growth and explains how St. Simons has retained the unique charm and strong sense of community that it is known for today. Featuring more than two hundred contemporary photographs, historical images, and maps, Island Time is an essential book for people interested in the Georgia coast.A Friends Fund Publication.",
  "genres": [],
  "author": "Jingle Davis",
  "average_rating": "4.68",
  "url": "https://www.goodreads.com/book/show/16171390-island-time"
}