{
  "title": "Spitfire Pilots WWII-Extraordinary Women",
  "description": "Spitfire Pilots WWIIExtraordinary WomenThe horrific bombing of Britain began, when Hitler, the Nazi leader of Germany, ordered the massive aerial offensive against Britain on July 16, 1940. Sarah Randal and her family as well as those close to her knew that they would do their part for the war effort to achieve victory against Germany. Some of them would live, too many would die, and everyone would suffer. The city of London where Sarah lives is one of Hitler’s prime targets. His plan is to break the spirit of the British people into surrendering to Nazi Germany. That was not an option for the British. They vowed never to surrender. The RAF must drive the Luftwaffe out of the skies over England or all would be lost! Stop the Nazi war machine at all costs was the cry of every Briton! The British Spitfire fighter plane was a nimble flying machine. Fearless women pilots of the ATA delivered these Spitfires and other operational aircraft to the RAF squadrons, so the courageous fighter pilots of the RAF could halt the German Luftwaffe from pulverizing Britain with their deadly bombs. Sarah’s older brother, Edward is one these gutsy RAF Spitfire pilots. The ‘Spit’ as the pilots call it is the symbol of British determination. Sarah dreams of flying Spitfires for the ATA. Sarah’s fiancé, Frank Peterson makes the ultimate sacrifice, as he operates an Anti-Aircraft gun in his defensive station near London. Sarah is losing everyone near to her as the Nazis continue their relentless attacks. Sarah is devastated; she takes matters into her own hands and joins the ATA to deliver operational aircraft to the RAF Squadrons. As she flies Spitfires as well as other military aircraft throughout the hazardous skies of Britain, she finds herself in dangerous situations.Robert Duncan, a handsome RCAF Spitfire fighter pilot saves her life. Can he unlock her broken heart to try to love again? When they meet on the ground, is it love at first sight? Is there room in her life for two loves, flying Spitfires and pilot Robert Duncan? Can she have both or does she have to choose between the two?The plucky women pilots of the ATA proved their mettle during WWII’s darkest days. These were terrifying times, which called for desperate measures from extraordinary women!This is a story of love, heroism, and war, portraying the bravery of young women and men during WWII. The novel “Spitfire Pilots WWII-Extraordinary Women” takes you into the depths of devastated London during WWII, where ordinary citizens take refuge in underground train stations from deadly falling bombs. Young men and women sacrifice their lives in the dangerous skies above, to attain ultimate victory over the Nazi Luftwaffe.",
  "genres": [],
  "author": "Emma Gee",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/16173437-spitfire-pilots-wwii-extraordinary-women"
}