{
  "title": "Mary Magdalene Beckons: Join The River of Love",
  "description": "This award-winning book was birthed over a one-month period, when Mary Magdalene came daily to Mercedes Kirkel, each day bringing a profound spiritual message. Kirkel soon realized that Mary was downloading a book, chapter by chapter. Mary’s focus was on uniting the Feminine and Masculine as the key to humanity’s spiritual growth. Her messages gave far-reaching instruction for living in our heart, through transforming our relationship to our body, sexuality, and emotions. This, she affirmed, would allow us to unite the Feminine and Masculine (within and without) and enter the higher planes of reality.MARY MAGDALENE BECKONS: Join the River of Love contains the full series of Mary’s universal messages, along with Kirkel’s illuminating commentary. Mary and Yeshua (Jesus) are the inspiring models for Mary’s instruction on healing body shame, relating to sexuality as sacred, becoming an emotional master, and opening the heart. The book gives us a map, along with essential tools, for ascending into higher dimensions. And we get to experience Mary as a brilliant wellspring of wisdom and a powerful demonstration of the sacred Feminine. Whether you’re new to Mary Magdalene’s path or a longtime admirer of hers, MARY MAGDALENE BECKONS is a gift to your soul.WINNER: Spirituality Book of the Year, Books and Authors Award for Literary ExcellenceWINNER: New Age Book, New Mexico-Arizona Book AwardsWINNER: Body Mind Spirit Book, Southwest Book Design AwardHONORABLE MENTION, Religion/Philosophy Book, Readers Favorite Award ContestFINALIST, Spirituality Book, National Indie Excellence Awards\"MARY MAGDALENE BECKONS offers helpful insights for creating balance and harmony between the Masculine and Feminine within all of us.\" --John Gray, author of \"Men Are from Mars, Women Are from Venus\"\"One of the most profound books of our day.\" --Flo Aeveia Magdalena, author of \"I Remember Union\"\"If you want to hear the real voice of Mary Magdalene, buy this book.\" --Stuart Wilson and Joanna Prentis, authors of \"Power of the Magdalene\" and \"The Magdalene Version\"\"An uplifting guide to finding our hope and redemption throughout our lives, MARY MAGDALENE BECKONS has a strong and positive message, highly recommended.\" --Midwest Book Review\"An incredible gift to help those who are going through difficult times. . . . A great deal of insight into spiritual beliefs.\" --Seattle Post-Intelligencer Book Review\"An outstanding spiritual, self-help book. . . . [Reading the book,] I felt love and surrender, forgiveness, and an acceptance of myself such as I have never experienced. A must-read for everybody.\" --Readers’ Favorite Book ReviewLearn more about Mercedes at www.mercedeskirkel.com and www.marymagdalenebeckons.com, including BOOK TRAILER AND REVIEWS, and AUTHOR Q & A. You can also \"look inside\" the book and read customer reviews at Amazon: http://www.amazon.com/Mary-Magdalene-...",
  "genres": [],
  "author": "Mercedes Kirkel",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/16173508-mary-magdalene-beckons"
}