{
  "title": "Full Upright and Locked Position: The Insider's Guide to Air Travel",
  "description": "\"Sit back, relax, and enjoy the flight,\" our pilots still intone. But who are they kidding?Former FAA chief counsel and senior aviation policy official Mark Gerchick unravels the unseen forces and little-known facts that have reshaped our air travel experience since September 11, 2001.With wry humor and unique insight, Gerchick takes us past the jargon, technicalities, and all-is-well platitudes to expose the new normal of air from the packed planes and myriad hassles of everyday flying to the alchemy of air fares, the airlines’ endless nickel-and-diming, and the elusive hope of escape from steerage. We find out what pilots do in the cockpit, what’s really worth worrying about when it comes to airline safety, and why we get sick on planes. Meanwhile, Gerchick ponders the jarring disconnect between our quaint expectations of \"service with a smile\" and the grim reality of cramped seats, no-free-lunch, and \"watch-yer-knees.\"With sympathy for both fliers and airlines, Gerchick shows how the new \"business-all-business\" airline industry has finally learned to make money, even in the face of crushing fuel costs, and get millions of travelers where they’re going every day safely and quickly.From his singular vantage point as former aviation regulator and policymaker, Gerchick gives us a straightforward insider’s view of how hard it is for government to improve the traveler’s lot by explaining the vagaries of consumer protection rules as well as the political realities and the economic forces at work. While Gerchick offers reasons to hope for a better future in air travel, he presents an unvarnished look at what we can expect—good and bad—when we take to the skies. Some of it will reassure you, some will make you cringe, but all will open your eyes to what it means to fly today.",
  "genres": [
    "Nonfiction",
    "Travel",
    "Aviation",
    "Business",
    "Transport",
    "Economics"
  ],
  "author": "Mark Gerchick",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/16175912-full-upright-and-locked-position"
}