{
  "title": "Kingdom Series Collection #1-3",
  "description": "THE FIRST THREE KINGDOM BOOKS, ALL TOGETHER IN ONE COLLECTION. INCLUDED DELETED BONUS SCENES AND ALICE HU'S RED QUEEN'S REVENGE CUPCAKE RECIPE!Her Mad Hatter: Alice is all grown up. Running the Mad Hatter's Cupcakery and Tea Shoppe is a delicious job, until fate--and a fairy godmother with a weakness for bad boys--throws her a curveball. Now, Alice is the newest resident of Wonderland, where the Mad Hatter fuels her fantasies and thrills her body with his dark touch. The Mad Hatter may have a voice and a body made for sex, but he takes no lovers. Ever. But a determined fairy godmother has forced Alice into Wonderland--and his arms. Now, as desire and madness converge, the Hatter must decide if he will fight the fairy godmother's mating--or fight for Alice. Gerard's Beauty: A not so classic retelling of Beauty and the Beast, as seen through the eyes of the villain... Betty Hart has had it with men. Jilted in love, her life now consists of shelving books by day, watching too much Anime by night, and occasionally dressing up like a superhero on the weekends with her fellow ?Bleeding Heart? nerds. Men are not welcome and very much unwanted. Especially the sexy Frenchman who saunters into her library reeking of alcohol and looking like he went one too many rounds in the ring. Gerard Caron is in trouble. Again. Caught with his pants down (literally) he?s forced to seek asylum on Earth while his fairy godmother tries to keep Prince Charming from going all ?Off with his head?. Maybe, messing around with the King?s daughter hadn?t been such a great idea after all, not that Gerard knew the silly redhead was a princess. But his fairy godmother knows the only way to save his life is to finally pair Gerard with his perfect mate, whether he?s willing or not. From the moment Gerard lays eyes on the nerdy librarian he knows he must have her, but Betty is unlike any woman he?s ever known. He thought Betty would come as willingly to his bed as every other woman before her, but she is a woman who demands respect and even? horror of all horrors? love. Is it possible for a self-proclaimed Casanova to change his ways? Red and Her Wolf: Long ago there lived a beautiful child. Her name was Violet. Fair of skin, with blonde hair and large blue eyes. Born of wild magic, she was a woman with a child?s heart. Innocent and lovely, but not at all what she seemed--you see Violet went by another name: The Heartsong. She was the child of fairy magic, the physical manifestation of all fae kinds unbridled power. Cosseted and pampered, she grew up in isolation, never knowing who she really was, or why there were those who?d seek to harm her. Ewan of the Blackfoot Clan is a wolf with a problem. He?s been sent to kill the Heartsong, but the moment he lays eyes on the blonde beauty he knows he?ll defy the evil fae he works for to claim Violet as his own. This is the tale of Little Red Riding Hood and the Big Bad Wolf, as it really happened...",
  "genres": [
    "Fantasy",
    "Romance",
    "Paranormal",
    "Paranormal Romance",
    "Fairy Tales",
    "Retellings",
    "Anthologies"
  ],
  "author": "Marie Hall",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/16176388-kingdom-series-collection-1-3"
}