{
  "title": "A Fox in Paris",
  "description": "On a sultry August day in the summer of 1836, a young boy from the countryside of Bordeaux is abandoned to his fate on the streets of Paris.  Far from being the “City of Light,” for the poor and the homeless the streets of Paris are a dangerous and unforgiving place.  For 11-year old Lucien Lehun they are now home.Up to the moment he is abandoned by his jealous older cousin, Lucien enjoyed a life of privilege in the home of his adoring uncle, who took the boy in after he is orphaned.  Raised and educated as a young gentleman by his wealthy uncle, it is the old man who instills in the young boy the values that will ultimately be his salvation.Upon his uncle’s death, Lucien’s cousin Gustave takes control of his father’s estate and decides to rid himself of his new ward, rather than share any of his newly inherited wealth.  It is this selfish ambition that lands Lucien – frightened, penniless, and alone – in the Tuileries Palace gardens in Paris, with only his treasured copy of “Robinson Crusoe” to call his own.  It is here that the desperate boy rescues a stray dog that is about to be killed by the palace guards.  Doing his best to care for the badly injured animal, Lucien carries him along as he wanders the streets of the city in search of help.Over time, the little dog regains his strength, and the two become an inseparable team, caring for each other through good times and bad, like Crusoe and Man-Friday, in Lucien’s favorite book.  By remembering the values of generosity, charity and optimism, instilled in him by his beloved uncle, and with  the help of his clever dog, the two manage to thrive on the streets of the city.  In the end, by staying true to himself and the timeless lessons of his uncle,  Lucien succeeds not only in saving himself, and the dog, but also in resurrecting his shattered family in ways he could never have imagined.Based on an unfinished work by Mary Nelson Carter, and adapted and expanded by Perry Vayo, the timeless lessons of A Fox in Paris, are as meaningful for young readers (of any age) now, as they were more than a century ago.  Generosity, selflessness, and personal honor are in short supply these days, and this story is a warm-hearted, captivating, and elegantly written reminder of their eternal value.   It’s a story we can all take to heart.",
  "genres": [],
  "author": "Mary Nelson Carter",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/16176491-a-fox-in-paris"
}