{
  "title": "في حضرة العنقاء والخل الوفي",
  "description": "مجتزأ من الرواية:يا زينب، منذ عام 1996م، كنتِ وقتها في خامستكِ، وأنا أجاهدني بالكتابة إليكِ، اشرعُ أسوّدُ عشرات الصفحات ثمّ انقلبُ عليّ جرّاء يقيني إنّي في غفلة منّي أكتب بانفعال غير مبرر، أصرفني عن الكتابة سنة أو أكثر، ريثما يعود توقي للتواصل بكِ، أُقبل على الكتابة، لأنصرف عنها بعد قليل للسبب إيّاه، كل بداياتي تلك حفظتها داخل ملفات تحمل تأريخها آملاً أعودُ إليها أوظّفها ضمن مشروع واحد أتمنّى وصوله إليكِ كاملاً، الليلة اتخذتُ قرار البدء من جديد دون العودة لما راكمته في مرات سابقة، كذلك آليتُ على نفسي أكتبها خبط عشواء، غير ملزم بتسلسل الأحداث حسب المنطق المعتاد لتواليها، منساقاً لتداعي لحظتها الآنيّة حتّى لا أتذرّعُ بصعوبة التنسيق فانصرف عن المتابعة.مجتزأ من مقدمة الشاعرة سعدية مفرّح:في حضرة العنقاء والخل الوفي، ينطلق اسماعيل فهد اسماعيل مستعيداً ذاته الكامنة في ما وراء الكلمات والشخصيات والمواقف، ليصنع روايته الجديدة وكأنه يصنع روايته الأولى، بعد تجريب كتابي طال وتمدد بين سنوات العمر وتضاعيف الموهبة وتداعيات الحياة بكل معطياتها.في هذه الرواية يبدو هذا الروائي المخضرم شاباً موهوباً، للتو غادر السبعين من عمره كي يبدأ الكتابة في خضم الدهشة واسترسال الاكتشاف وزهو الموهبة الفريدة.ولعلي لا أبالغ إذا قلت أنني شعرت وأنا أقرأ هذه الرواية وكأنني أقرأ لاسماعيل فهد اسماعيل للمرة الأولى في حياتي، أنا التي اطلعت على معظم رواياته الخمس والعشرين السابقة والتي أصدرها على مدى أربعة عقود كاملة، ربما لأنه يحاول من خلالها أن يقدم نمطا كتابيا جديدا يخلط فيه وفقا لمقادير محسوبة، من دون أن تخل بعفوية الفن الروائي في ذلك الشق، بين الحياة كما عاش بعض مواقفها فعلا، وبينها كما يريد أن يعيش بعض مواقفها، وبين ما يتوقع ان تكون، وبين الحلم. وأيضا لأنه في هذه الحياة التي كتبها بين ثنايا رواية اختزل الكثير مما يقال في سبيل التطلع الى قارئ نوعي ومتلق جاد وذكي..والأهم عاشق للرواية.«في حضرة العنقاء والخل الوفي» إذاً رواية «صعبة» ليس على صعيد الكتابة وحسب، بل أولا على صعيد القراءة، وأتوقع أن المتلقي لا بد وأن يجتهد كثيرا في سبيل استخلاص المتع الراسبة بين نهايات الفصول حتماً.",
  "genres": [
    "Novels",
    "Fiction",
    "Audiobook",
    "Unfinished",
    "Literature"
  ],
  "author": "إسماعيل فهد إسماعيل",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/16177668"
}