{
  "title": "WIPEOUT   Wall$treet Meets Back$treet",
  "description": "Attention fellow readers! This book has been rewritten as STAND YOUR GROUND, Trouble in Paradise. (Wipeout is no longer for sale).KIRKUS Review: Kirkus is one of the oldest and most prestigious reviewing houses in the country. It leads and drives opinion in the publishing business.KIRKUS Review: WIPEOUT \"This invitingly gritty noir lines up the elements o﻿f a dark thrill ride: drug dealing, prison releases, infidelities, burglaries,​ double crosses and cool women selling hot sex...Burglaries are planned and executed, but with the shifting ​alliances and lack of honor among thieves, the criminals find it hard to hold on to their ill-gotten gains. The plot rockets​ through twists and turns at a thrilling pace, with a dizzying number of subplots...Lomax juggles these storylines with admirable skill.\"Lawton Gibbs, a once successful cat burglar, has just been released from Florida’s Union Correctional Facility at Starke. All he has on him is an ex-offender ID and the clothes he is wearing. His is an a-typical ‘now what’ scenario as he begins what is seemingly a long walk down the road leading away from Starke. Until a pickup truck pulls up beside him and a woman from his past orders him to get in. It isn’t long before his ‘now what’ scenario becomes one hell of a fast ride back into his old neighborhood, where he reunites with a group of shady characters and the very woman who got him thrown into prison. Roberta is a scheming, conniving woman who is about to turn his life upside down…again. I won’t dare spoil the plotline, as this is definitely worth a read.The JELLY BOMB REVIEW.COM -- Serious Book Reviews May 2013\"Lawton Gibbs, a once successful cat burglar, has just been released from Florida’s Union Correctional Facility at Starke. All he has on him is an ex-offender ID and the clothes he is wearing. His is an a-typical ‘now what’ scenario as he begins what is seemingly a long walk down the road leading away from Starke. Until a pickup truck pulls up beside him and a woman from his past orders him to get in. It isn’t long before his ‘now what’ scenario becomes one hell of a fast ride back into his old neighborhood, where he reunites with a group of shady characters and the very woman who got him thrown into prison. Roberta is a scheming, conniving woman who is about to turn his life upside down…again. I won’t dare spoil the plotline, as this is definitely worth a read.This book has plenty of good twists and turns. I was guessing all the way through to the end. Lomax does a good job of keeping the reader engaged, and the characters felt real to me. This gritty, fast-paced novel offers just about everything to the action fan, from cunning thieves, to double-crossing associates, and dirty-dealing women who can’t be women who can’t be trusted....Overall a good, solid read. Fun, fun, fun. (sk)\"",
  "genres": [],
  "author": "Raeder Lomax",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/16178272-wipeout-wall-treet-meets-back-treet"
}