{
  "title": "Mogul",
  "description": "In the final book of Ginger Voight's Groupie Trilogy, Andy and Vanni have returned to Los Angeles to prepare for the birth of their child. A reformed Ladies' Man, Giovanni Carnevale now embarks on a life of monogamy with the woman he loves, but the ghosts of his past still continue to haunt their newfound happiness. The Wilke family wants to see him pay for the damage he has done to their precious Baylee, who still lies in a vegetative state. For her brother, Donny, money will never be enough to make up for what Vanni has done, but that is where the Wilke family first seeks their revenge, demanding millions of dollars in restitution. To ensure he has enough money to make up for his mistakes as well as provide for his baby, Vanni takes on the job as judge for a new reality talent show called \"Fierce,\" where he champions an unlikely contestant, proving him to be a man of substance more than anyone could have imagined. Graham tries to move on, but when he discovers that Andy is pregnant he cannot stop dreaming of what might have been. Maggie watches on helplessly, as hopelessly in love with him as he is with someone else. She considers moving on before he shatters what is left of her heart. The biggest threat to Vanni and Andy's Happily Ever After is Holly Neal, who returns to Los Angeles claiming to carry Vanni's baby. Graham and Andy suspect she is up to her old tricks, but Vanni knows truly turning over a new leaf means he has to do right by all the people he has wronged - including a child he may have conceived with another woman. In the end, it is Andy and their baby who may pay the biggest price of all for his sins, when Baylee's death sends her psychotic brother over the edge. Everything blows literally to pieces, forcing Vanni - and Graham - to give it all for the sake of love. Adult material intended for audiences 18+.",
  "genres": [
    "Contemporary Romance",
    "Music",
    "New Adult",
    "Adult",
    "Musicians",
    "Contemporary",
    "Second Chance"
  ],
  "author": "Ginger Voight",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/16178680-mogul"
}