{
  "title": "Drawn Blood: Collected Works from D.B.P.Ltd., 1985-1995",
  "description": "This book is a collected works of poetry and prose that appeared on the now defunct Drew Blood Press, Ltd. imprint in 11 different chapbook titles from 1985 until 1995. It is representative of the diversity in voice A. Razor developed early on as a poet and prose writer. The meticulous work to use form and create new styles within those forms in order to better describe the environment that the writer was immersed in. A. Razor was out on the streets of Southern California at a pivotal time in the development of underground music, art and philosophy that was not attached to the academic experience for support. As the writer traveled out into the world more extensively, making alliances with other people that had a similar experience, he learned to share his viewpoints in various forms, here the example being the poetic. A. Razor was supported in his efforts by many in the marginal, anarchistic community that he was close to, as well as those that stumbled upon his work through the zine culture that thrived in the 80's. The most significant form of support came from Drew Blood and his press, run out of Drew's apartment in Riverside, CA until his death in the late 90's. This book is a collection of many of the pieces and a chronology of how they appeared, along with the titles of the chapbooks they appeared in, up to the year 1995. The author did not publish any writing again, outside of a few small lit zines and some on the internet, until 2012, when A. Razor became committed with Iris Berry to form Punk Hostage Press. A. Razor is now writing and publishing again, but this collection is a look at where he came from, where the work first bore it's meaning, where he first found community and fellowship among other writers, as marginal as they might have been. It is also a slight window on a time before the internet, when there were still writers that wrote letters to each other and traveled around the world seeking out the word in person, as if their lives depended on it, risking death, imprisonment and the maltreatment of a status quo that did not seem to have a need for them. These words have survived, but many of the people and places that inspired them have not. After some time in and out of prison, A. Razor just barely survived to bring these words back into the light. So, if this is anything at all in these pages, it is a humble testament to that survival and to those that didn't make it, but are still remembered in these words forever.",
  "genres": [],
  "author": "A. Razor",
  "average_rating": "4.84",
  "url": "https://www.goodreads.com/book/show/16179487-drawn-blood"
}