{
  "title": "The Davina Code",
  "description": "Disgraced cop Jack Miller inherits a house. He also inherits a tenant. She's sexy, mysterious and obviously up to no good. His cop instincts are in overdrive. He's trying to get his job back and no police force will employ him if there's illegal activity in his house. His only option is to solve the mystery of his crazy tenant's behaviour and kick her out - if he can keep his hands off her long enough to do it! Davina Davenport is trying to make a movie with 'borrowed' equipment, in a house without permission and on a deadline. It's her last stab at an acting career and even she knows the plan is slightly insane. Her boss at the TV station is asking about the missing equipment. Jack Miller is nosing around her house - and her. And the creepy cameraman from work wants to blackmail her into trading sex for his filming skills. It will be a miracle if the movie gets made before Davina ends up fired, in jail or in Jack's bed! **********************************Here's what happens when Jack meets Davina for the first time: “I don’t usually do this sort of thing,” she told him. For a brief minute she wasn’t sure what she was explaining exactly - the fact she’d knocked him out and tied him up, or the fact she was rooting around in his trousers. \"I mean, I don’t usually hit people. Hardly ever. And not without provocation.” Her fingers touched leather. She angled herself further over the gorilla’s body to get a grip on the wallet. Seriously. Who wore their jeans this tight? “I hope I didn’t do any permanent damage. I just wanted you to stop breaking into my house.” She looked down at him. “You understand, right?” His dark eyes stared up at her. “Sweetheart, you have your cleavage in my face and your hand down my trousers. There is nothing about this I understand.”",
  "genres": [
    "Romance",
    "Chick Lit",
    "Humor",
    "Contemporary Romance",
    "Contemporary",
    "Romantic Comedy"
  ],
  "author": "Janet Elizabeth Henderson",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/16179759-the-davina-code"
}