{
  "title": "The Locket",
  "description": "As a young girl, Sarah Batsheva was infatuated with the handsome teenage boy who lived down the street. That teenage boy was Adolf Eichmann. It all seemed innocent and nice until Sarah’s grandmother died, and then nothing was ever the same again.Set in Europe during World War II, The Locket follows Sarah’s journey from adolescence to adulthood, as she and her family endure the horrors of the Final Solution. Forced from their home into a Vienna ghetto, and later to the Nazi death camps, Sarah watches helplessly as her family and friends are murdered. She is marked for death, too, until Eichmann intervenes. When Sarah rebuffs Eich- mann’s romantic advances, she is arrested and sent to the camps. Can Sarah escape and survive long enough to find justice for the atrocities she was forced to endure? Will evil prevail and consign her to a life of fear and terror? Observe Sarah on her journey from the darkest days of the Holocaust to the day she enters a Jerusalem courtroom to face Adolf Eichmann.The Locket by Mike Evans is a suspense-filled and captivating novel. It will keep you on the edge of your seat. It is a book you will not be able to put down. Dr. Evans’ great-grandfather, a rabbi, perished in Minsk, Russia, during the pogroms. He and his congregation were boarded up in their synagogue and burned to death by Orthodox Christians who cried, “Christ killers” as the fire consumed the building. Others of his family perished at Auschwitz. More than twenty-five million copies of Dr. Evans’ books are in print, and he is the award-winning producer of nine documentaries based on his books. Dr. Evans is considered one of the world’s leading experts on Israel and the Middle East, and is one of the most sought-after speakers on that",
  "genres": [
    "Historical Fiction",
    "Holocaust",
    "Fiction",
    "World War II"
  ],
  "author": "Mike    Evans",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/16180307-the-locket"
}