{
  "title": "Coming Unglued: A Mother's Journey into Hell",
  "description": "Coming Unglued is a story of hope and courage even in the face of adversity. It reveals the good, the bad and the ugly parts of marriage and/or relationships yet is balanced so as not to drag the reader down. The characters are strong and, in some cases, you may see them in your mirror.Kelly had everything a young woman could hope for: an admirable boyfriend, a strong family unit and the determination to succeed. A few moments shattered everything. En route to a friend's house, Kelly was raped and, weeks later, learned she was pregnant. Debating the best course of action, Kelly found herself facing her greatest fears as she explored long held desires of her heart and soul. When life seemed to have settled into a normal routine, a surprise encounter with her rapist changed Kelly's life forever. After apologizing and confessing his undying love, he set about winning Kelly's heart. Tragedy strikes. Hearts are broken; lives are shattered. In trying to move forward, Kelly makes a decision which will affect everyone who loves her - a decision which brings her to the lowest depths of hell within a marriage.Note: editorial reviews below.\"The author does a wonderfully convincing job of creating a believable background, in terms of Kelly's tragic, challenging circumstances - which enables the rest of the plot to unfold in an organic, yet powerful manner.\" ~ Steph Coleman--Goodreads; Barnes & Noble; Indie Book Reviewers (5 stars)\"I darn near gobbled the whole book down in just a few evenings and was totally hooked ... after the dark tunnel there is a light at the end and, while this book will haunt me for a long time, it'll be in a good way. ~ Darlene Cupp--Indie Book Reviewers; Goodreads; Barnes & Noble (5 stars)\"This was one powerful tale that I couldn't put down. Norma Budden writes from the heart and it is impossible to read this and remain unaffected.\" ~ Jhonnie Parker--Goodreads; Barnes & Noble; Indie Book Reviewers (4 stars)\"I was impressed with Norma Budden's passionate and emotional writing style and her attention to character detail. I really felt transported to Kelly's life, head and heart, for better or worse.\" ~ Gillian Hancock-- Goodreads; Barnes & Noble; Indie Book Reviewers (4 stars)\"I liked Norma Budden's literary style, and you can tell the subject matter is close to her heart. She writes with dignity and compassion, yet it is gritty and raw and real. A book that will take you though 'hell,' but there is hope on the other side.\" ~ Layla Messing - Goodreads; Barnes & Noble; Indie Book Reviewers (4.5 stars)\"It is such a wonderfully addictive novel, and I love how Norma Budden writes... it all felt so believable and authentic; intimate, like a close friend was telling me this really amazing, beautiful, horrible, emotional, tragic story that I didn't want to stop listening to.\" ~ Marcella Gonzales-- Goodreads; Barnes & Noble; Indie Book Reviewers (5 stars)",
  "genres": [],
  "author": "Norma Budden",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/16180871-coming-unglued"
}