{
  "title": "The Rogue: Searching for the Real Sarah Palin",
  "description": "rogue (r¯og), An elephant that has separated from a herd and roams about alone,in which state it is very savage.— Webster’s Revised Unabridged Dictionary After three years of research, bestselling journalist Joe McGinniss presents his already controversial and much anticipated investigative chronicle of Sarah Palin as an individual, politician, and cultural phenomenon. In his critically acclaimed book about Alaska, Going to Extremes , the fledgling state itself was Joe McGinniss’s subject. Although he didn’t hesitate to reveal the many flaws and contradictions behind its “last frontier” image, McGinniss fell in love with the land and its people. More than three decades later, he returned to Alaska in search of its most famous resident, Sarah Palin.On Election Day 2008, McGinniss began his on-the-ground reporting that culminated, famously, in his moving next door to Sarah Palin in spring 2010. THE ROGUE is the eagerly awaited result of his research and a startling study of the illusion and reality of Sarah Palin—and a probing look at the Alaska and the America that produced her. Sometimes funny, sometimes frightening, always provocative and illuminating, THE ROGUE answers the questions “Who is she, really?,” “How did she happen?,” and “Will she ever go away?”In all of his books, McGinniss has scrutinized the mysterious space between image and reality—how that space is created, negotiated, and/or manipulated. Now, with The Rogue, McGinniss combines his deep appreciation of the place Sarah Palin comes from with his uncanny ability to penetrate the façades of people in public life. The result is an extraordinary double narrative that alternately traces Palin’s curious rise to political prominence and worldwide celebrity status and recounts the author’s day-to-day experiences as he uncovers the messy reality beneath the glossy Palin myth.Readers will find THE ROGUE at once bitingly insightful, hilarious, and profoundly ominous in what it reveals—not just about the dark underpinnings of a potential presidential nominee but also in regard to the huge numbers of Americans who passionately support her.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Biography",
    "History",
    "Audiobook",
    "Memoir",
    "21st Century"
  ],
  "author": "Joe McGinniss",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/10684227-the-rogue"
}