{
  "title": "The Romance Collection, Christmas 2012 Special 3 in 1 Romance Edition",
  "description": "\"I can't wait to read more by this author.\" (Tattle Tale)This is a special romance collection that includes sizzling tales that have each received excellent reviews. Catering for the lover of adult romance, it includes a paranormal tale of love and deception, a sweet contemporary romance about a woman who needs to find her independence and a scorching paranormal erotic novella. This is a must read for 2012! Coffin Girls, Elegantly UndeadBook 1 of the Coffin Girls Series, An Adult Paranormal RomanceA vampire descendent from the original Coffin Girls, Anais runs a successful event and wedding planning business from her majestic New Orleans plantation house. When Yves, her maker and head of the Vampire Council requests her assistance in hosting the mysterious, yet dashing Prince of Witches, Conall, she has no option but to accept. But Anais is the keeper of secrets; secrets that can kill. Conall and Anais are drawn together when confronted with fatal encounters and an unimaginable destiny… if she’s willing to accept it and fight. Finding PromiseBook 1 of the Promise Series, A Small Town RomanceCaroline had led the life of a high society daughter and wife, one that was filled with soul-destroying emotional abuse. Upon the death of her husband, she finds that she is financially incapable of supporting herself and flees New York without a plan or destination in mind. Her travels lead her to the quirky town of Promise. Here she begins to explore her new found independence and the pleasurable side of love with ruggedly handsome local, Luke Edwards. Her contentment is shattered as her past resurrects itself and she needs to find the courage to face it before she can truly re-build her life.Ghosts & Lovers: First ConfessionAn Erotic NovellaSimone, the quintessential desperate housewife, is primarily absorbed on settling her family into their new home in the vibrant, metropolitan city of Johannesburg, South Africa. Unbeknownst to her, the greatest threat lurked not outside of the eight-foot walls and electric fencing but within the walls she seeks sanctuary. But the threat comes disguised as tantalizing pleasures of the most carnal nature that challenges her views of love, marriage and sex. Can Simone resist and rescue her family from the evil she’s let into their lives? This is her first confession. Love Romance, Love FoodBonus Material - Holiday recipes from the author",
  "genres": [],
  "author": "Aneesa Price",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/16181331-the-romance-collection-christmas-2012-special-3-in-1-romance-edition"
}