{
  "title": "Behind the Old Face",
  "description": "After the highly respected author discovered a resident's box of old love letters as teenage nursing-home aide in 1977, her view of elderly patients was altered and inspired her lifelong career of geriatric care and advocating for quality elder care. She provides us an overview of aging and elder care in the U.S in this best-selling and award winning book. Drawing upon over 3 decades of experience and her interviews with seniors, Angil Tarach-Ritchey RN, GCM reveals the rich inner worlds of the elderly, conveys their advice and describes her vision of a community-based, intergenerational, and sustainable approach to senior living and care for our aging future as we face the Elder Boom crisis. Who Will Benefit From Reading Behind the Old Face? 1. Seniors now and into the future. If the treatment and care of older adults didn't need improving, this book would have not been written. This is the overall intention and motivation of the author. 2. Baby Boomers that either won't be able to, or do not want to pay between $100,000.00 and over $210,000.00 for care in 20 years or so. Statistically 70% of those over 65 years of age will need some amount of care for an average of 3 years. If you want a positive and uplifting aging future in your own home that you can look forward to rather than dread, and won't send you to the poorhouse this book is for you! 3. Caregivers, both family caregivers and professionals in healthcare, since the vast majority will care for seniors in one capacity or another and are all of us are aging too. Whether you are a nurse's aide in a skilled nursing home, a physician in ER, a volunteer directing patients, a social worker, nurse, therapist, or are in insurance sales or financial planning, we all come in contact with seniors and need to better understand aging in those we care and interact with, and ourselves. 4. Business Owners are losing 34 billion dollars annually in lost productivity related to employed family caregivers and this problem is going to get much deeper and far reaching than most realize as care costs become unaffordable for the vast majority, and government programs that are currently helping those under the poverty line will not be able to meet future costs. Find out how you can become part of the solution! 5. Government Officials in aging, housing, Medicare, Medicaid, Social Security and Veterans Administration who have a vested interest in how our nation will handle 78 million aging boomers. 6. Philanthropists, Foundations, Major Corporations, Patient Advocates, Hospitals, and other nonprofits interested in aging, senior health, the changing population, social change, and being a part of a great aging future. 7. Our country as a whole because the one thing we have in common from the day we were born is we are all aging. Find out how to reduce healthcare and custodial care costs all without taxing family members and US businesses.",
  "genres": [],
  "author": "Angil Tarach-Ritchey",
  "average_rating": "4.69",
  "url": "https://www.goodreads.com/book/show/16181886-behind-the-old-face"
}