{
  "title": "The Mirror and the Maelstrom",
  "description": "SPOILER ALERT: BOOKS I, II & III OF THE SERAPHINIUM; THE MERCHANT AND THE MENACE, THE POOL AND THE PEDESTAL & THE TREES AND THE NIGHT are available on Amazon. The following description contains elements of those works. The Nearing World staggers on the brink of utter Chaos. Izgra the Half-Dead and his Malveel hunters begin their bloody push into the heart of the human world. Keltar has already fallen in the West. Her people rush to escape the Ulrog stone men. In the East, Malveel lead their armies over the Mirozert Mountains and scour the Derol Forest. The human forces struggle to decide where and when to make their last stand against the might of Amird the Deceiver. Should they flee to the safety of the Zodrian capital, or will its walls entomb them and hasten their destruction? Will they receive assistance from the Greys or have they been abandoned through the deceit of the Counselor? Will the new Seraph return in time to play a role in the final conflict?Kael's role remains clouded in mystery. Astel draws him closer like a moth to a flame. What questions will finally be answered there? More importantly, who or what will he encounter on his road to those answers?\"The Mirror and the Maelstrom\" is the fourth and final installment in The Seraphinium Series. The series follows Kael as he ventures from his small town into the wider world in hopes of a bit of adventure. This seemingly inconsequential act by a nondescript lad sets in motion a chain of events that pushes the forces of good and evil toward a cataclysmic confrontation. Kael's life has been a carefully orchestrated play intended to portray the boy and his town as nothing, with significance to no one. Ranchers and farmers are soldiers, commissioned to play their parts in the fiction of Kael's life. Even the boy's own parents are actors assigned to guide and watch over the new Seraph. However, the boy senses something. He dallies with a force that plays on the edge of his consciousness. This force allows him to control things others cannot. His senses gain extraordinary perception when he feels the \"touch.\"His power grows to such an extent that during the first journey from his hometown, he shines like a beacon to those always on the prowl for the new Seraph. However, his powers also remain untried and untested. The Seraphinium follows Kael's journey as he discovers not only how to use those powers, but also what part they must play in the salvation of the Nearing World.Review for Book I: The Merchant and the Menace:5.0 out of 5 stars The Old and the New in the Next Great Fantasy SeriesIf you like David Eddings and Terry Brooks, then this is the book for you. Like Eddings, McHugh loves to play around with old philosophical and religious ideas, dressing them up in new clothes for a night on the town in the 21st century. Like Brooks, McHugh is enchanted by the same tropes all fantasy lovers are enchanted by: elves, a young hero shepherded by a mysterious but wizard-like guide, and big battles with swords and magic. But McHugh is no Tolkien-lite. He has provided his readers with some fresh creations that fill the imagination with vivid pictures and scenes, reminding the reader why fantasy is such a beloved genre. Well worth the $3.Review for Book II; The Pool and the Pedestal5.0 out of 5 stars I'm now a confirmed fanBooks 1 through 3 of the Seraphinium series ended much too soon. The characters are interesting and consistent. The plot twists are legion. A writing style reminiscent of Chronicles of Narnia or Lord of the Rings.Review for Book III: The Trees and the Night5.0 out of 5 stars Exciting.The action is well orchestrated and the plot engaging. This is old style epic fantasy with a twist. The best parts are the interactions between the characters and the struggle for power amongst the evil Malveel.",
  "genres": [
    "Fantasy"
  ],
  "author": "Daniel McHugh",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/16182998-the-mirror-and-the-maelstrom"
}