{
  "title": "نهج البلاغه",
  "description": "شک نیست که ترجمه فنی است ظریف و دقیق و دشوار، و این معنی در مورد کتابی که آن را «فروتر از کلام خدا و فراتر از سخن بشر» گفته‌اند به‌مراتب صدق بیشتری دارد، کتابی که گردآورندۀ خبیر و بصیر آن، سید شریف ابو الحسن محمد رضی، در بارۀ آن گوید: «سخنان برگزیدۀ سرور ما، امیر مؤمنان، سر چشمه و آبشخور فصاحت و منشأ و خاستگاه بلاغت است و اصول و قوانین سخن و سخنوری از آن اقتباس شده و روش آن سرمشق هر خطیب ادیب و سخنور اریبى گشته و با این همه کس در فراخناى بلاغت و پهنۀ رسایى به گرد آن نرسیده است، زیرا این کلام نمونه‌اى از علم الهى است و بوى سخن پیامبر گرامى صلى اللّه علیه و آله از آن به مشام جان مى‌رسد»، یا به تعبیر پیراسته و مسجع مترجم فاضل، استاد دکتر سید جعفر شهیدى، «کتابى که طراز فصاحت است و پیرایه بلاغت، عربیت را بها فزاید و دین و دنیا را به کار آید، که بلاغتى چنان نه در گفتارى فراهم آمده است، و نه یکجا در کتابى هم… فصاحت خود را به کلام حضرتش آراید تا به جمال رسد و بلاغت در کنار او زاید و به کمال رسد.» نهج البلاغه چندین بار به فارسى ترجمه شده و فاضلان روزگار شرح‌هایى بر آن نوشته‌اند و بارها به چاپ رسیده است. تفاوت یا مزیت ترجمه‌اى که اکنون در دست خوانندۀ گرامى قرار دارد، علاوه بر صحت و امانت و اتقان و تطبیق یکایک واژگان عربى با فارسى، در مراعات ویژگى ادبى این اثر جاودانى، یعنى به کار بردن صنایع لفظى و آرایش‌هاى ادبى از استعاره و تشبیه و جناس و موازنه و مراعات نظیر و به‌ویژه سجع است که در برگردان فارسی تا آنجا که ممکن بوده مورد توجه قرار گرفته اما با این همه معنى فداى آرایش لفظ نشده است. علاوه بر این، استاد شهیدى تعلیقه‌هایى مناسب و بایسته بر خطبه‌ها و کلمات قصار نوشته‌اند که در پایان کتاب آمده و در روشن ساختن وضع اشخاص و اجتماع، معنى واژه‌ها و کاربرد آنها، و تأثیر گفتار امام همام علیه السلام در سرایندگان و نویسندگان متضمن فایدۀ بسیار است.امید است این خدمت فرهنگى به عالم معارف عظیم و قویم اسلامی در پیشگاه صاحب شریعت علیه آلاف التحیة و السّلام و محضر حضرت مولاى متقیان و امیر مؤمنان علیه السلام مقبول و مأجور و در دیدگاه اصحاب دانش و بینش منظور افتد. و من اللّه التوفیق.",
  "genres": [
    "Religion",
    "Islam",
    "Nonfiction",
    "Philosophy",
    "Spirituality",
    "History",
    "Poetry"
  ],
  "author": "علي بن أبي طالب",
  "average_rating": "4.56",
  "url": "https://www.goodreads.com/book/show/1618417._"
}