{
  "title": "Food-Free at Last: How I Learned to Eat Air",
  "description": "Get the Monkey Off Your BackFood is a drug. Break the shackles of addiction and learn to eat air! In this detailed guide, Dr. Robert Jones, MD, PhD, DDS, ODD gives you the practical, step-by-step advice you need to transition to the air-only diet.Common Questions About the Air-Only Diet:Q: Eating air? Are you crazy?A: I am a medical doctor with more than forty years of clinical experience. An Obesity Epidemic is sweeping across our great nation. Eating air is the answer.Q: Isn't there a risk of malnutrition?A: Not at all! Air contains all the vitamins, minerals, electrolytes and essential amino acids your body needs.Q: A friend of mine went on the air-only diet and starved to death. Will I die too?A: Lies, lies and more lies! Propaganda spread by the agro-business special interests that run Washington. They will do anything to keep you down, in ignorance of the truth!A Million Dieters Can't be Wrong!Every day the emails pour in:\"Thank you, Dr. Robert Jones, MD, PhD, DDS, ODD! Oh, thank you! I've eaten nothing but air for the last two months and I've lost eight hundred pounds! My husband says I'll make a fine skeleton! I can't wait!!!\"\"Damn this air is tasty.\"\"Dear Dr. Jones, What a discovery! You make Einstein look like an ignoramus. We hereby award you the Prizes for Medicine, Chemistry and Peace.\" -- the Nobel CommitteeAlso in This Groundbreaking Diet Book: * Lunge and Chomp -- Learn the Secrets of Air-Eating Technique! * The Twelve Steps to Food Freedom -- Anyone Can Do It! * The Hidden Menace in Our Society That Can Prevent You From Eating Air -- and How We as a Nation Can Overcome It!About the AuthorAn acclaimed pioneer in the field of Airitarianism, Dr. Robert Jones, MD, PhD, DDS, ODD has dedicated his life to freeing food-eaters from slavery to addictive caloric substances. That's why he wrote Food-Free at Last--to expose the truth the agro-business special interests don't want you to know. And that's why he's running for President in 2013. It's time to put this country on a diet--the air-only diet, the only diet proven to work. It's time to cure our great nation of the Obesity Epidemic sweeping from coast to coast. It's time to end the oligarchy's influence on our political process and bring true freedom back to America. Go the Power of Air!",
  "genres": [
    "Short Stories"
  ],
  "author": "Robert           Jones",
  "average_rating": "2.94",
  "url": "https://www.goodreads.com/book/show/16184098-food-free-at-last"
}