{
  "title": "A Question of Proof",
  "description": "Praised as \"a masterpiece of suspense\", this spell-binding legal thriller from Joseph Amiel, best-selling author of Birthright, Deeds, and Star Time. A Question of Proof is a profoundly moving courtroom drama in which a lawyer struggles to defend the woman he loves against the accusation that she murdered her husband. Tough and street-smart, a principled rebel against an establishment he has always scorned, Dan Lazar has risen from the working class to become one of Philadelphia's top criminal defenders. But now divorced and badly missing his young son, disillusioned by years of representing vicious criminals, humiliated by the politically ambitious DA's charge that he bribed a witness in a brutal rape-homicide case, Dan is burned out, depressed, and ready to call it quits. On the surface he would seem to have nothing in common with Susan Boelter, the beautiful and patrician wife of Peter Boelter, who runs the city's dominant newspaper and heads one of its most powerful families. But when Peter deserts her and files for divorce, moving to seize everything that is precious to her, including custody of their thirteen-year-old daughter, Susan turns to a reluctant Dan for help. Suddenly, Peter is found dead. Susan becomes the prime suspect in his murder. Driven by his love for her and by an inner need to defend someone in whose innocence he can truly believe, Dan starts to investigate. He soon discovers a maze of conflicting evidence and of growing doubts and mystery about the woman he thought he knew and loved. And he realizes that the truth he desperately seeks - especially about Peter Boelter's death - depends on finding the answer to a question of proof. From Philadelphia's courtrooms in City Center to the mansions in its moneyed suburbs, A Question of Proof is the gripping story of one man's internal battle between love and justice and the lengths to which a wealthy family will go to hide its secrets.",
  "genres": [
    "Fiction"
  ],
  "author": "Joseph Amiel",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/16183808-a-question-of-proof"
}