{
  "title": "Journey of Hope",
  "description": "Three young women leave Independence, Missouri in the spring of 1852 on a wagon train bound for Oregon. Brenna is with her Irish immigrant family, Rebecca travels with her large family from Iowa, and Emily is a young new bride. Six months and 2000 miles later they reach their destination much changed from who they were when they started. Daily life on the wagon train is challenging. Cholera is rampant, crime not unheard of, and death is an ever-present visitor. Their hopes and fears are realized in unforgettable experiences of love and loss. Through it all they form a bond with each other that will last a lifetime.From an Amazon review: 5.0 out of 5 stars Journey of Hope - a Triumph!, January 16, 2014By Helena Kirkwood - See all my reviewsThis review is from: Journey of Hope: A Novel of Triumph and Heartbreak on the Oregon Trail in 1852 (Paperback)I recommend this book, yes, and for young people especially too. Easy read, couldn't put it down, lots of interactions between the characters/families. It is heartwarming and pleasant and I too love stories about wagon trains and the journeys across the continent. Perhaps the most striking for me is the expression of love and warmth and tenderness in the families and how they resolved issues of grief and loss and supported each other along the way. There's a delightful innocence which is charming and refreshing. I have also listened to the book at audible.com - narrated by Valerie Gilbert. Ms. Gilbert performs all of the characters very well. As a native of Dublin, Ireland and because I lived in Munich for many years, I particularly enjoyed the authenticity of her Irish and German accents. Great listen for a long drive. Well Done Murata!",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Westerns",
    "Amazon",
    "Friendship",
    "Christian Fiction"
  ],
  "author": "Victoria Murata",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/16186127-journey-of-hope"
}