{
  "title": "Lucifer",
  "description": "Have you ever wondered what could be hiding in the shadows?Well, for eighteen-year-old Zahara Faraday, she doesn’t have to wonder. You see she comes from a lineage of Light Witches, those who have chosen to help protect and serve between the supernatural world and the human world. The only problem is Zahara, like her father Solomon, is as human as a human being can be whereas her mother, Mia, and her Aunt Catalina, were born as Light Witches. As a family they hunt down rogue supernaturals—creatures who harm humans or who have committed an act against their kingdom. Zahara’s hunting skills are usually kept dormant since her parents would prefer she live life as a normal human girl without knowledge of the supernatural world. She plans on doing just that—except when she finds a couple being attacked by fairies, she has no choice but to step in. Before she can return to pretending to be blissfully ignorant, Zahara encounters a problem she isn’t the least equip to handle: Bryan Hamilton, the good looking new co-worker she has to help train. In a heartbeat, her best friend, Becca King, has set her up on a double date with herself and her new crush, Rekesh Saint-Louis, who happens to be the most powerful leader of the biggest Imago Coven in South Florida –supernatural creatures with the ability to control water . . . and suck out human souls. Zahara has no time to focus on how she’s going to explain her double date with her best friend and the enemy they have a tentative truce with to her parents because soon one of the members of Mia and Catalina’s coven is found murdered with a strange tattoo of a snake with wings carved into his arm.Zahara is then thrown into a whirlwind battle with an angel determined to have revenge against God, an Imago coven she doesn’t think they should trust, and slew of dream-eating fairies and powerful Nephilims, hybrid children of angels and humans, more than happy to rip her to shreds.Normal just got a deadlier definition.",
  "genres": [
    "Paranormal",
    "Angels",
    "Witches",
    "Fantasy",
    "Mythology",
    "Young Adult",
    "Romance"
  ],
  "author": "Annabell Cadiz",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/16189163-lucifer"
}