{
  "title": "Taking Charge with Value Investing: How to Choose the Best Investments According to Price, Performance, & Valuation to Build a Winning Portfolio",
  "description": "When to buy them. How long to hold them. When to sell them. “This book will be welcomed by anyone looking to break free from their financial advisor and manage their own savings.”―DAVID JACKSON, founder and CEO, Seeking Alpha® “The world is an uncertain place. This uncertainty impacts the financial markets as much, if not more, than any other space. But don’t be afraid! Brian Nichols provides a personal, experience-based, and highly accessible framework for taking your investment portfolio into your own hands. There’s nothing pretentious or complicated about Brian’s approach. It’s straightforward common sense on how to invest in the stock market.”―ROCCO PENDOLA, Director of Social Media at TheStreet.com and cofounder of the Options Investing Newsletter “For investors who want discipline, or who want to escape the addiction of day trading, this book is for you.”―GARY ANDERSON, author of Will Rogers and “Business Insider” Contributor “I am pleased and honored to publish Brian Nichols’ articles on Market Playground and interview him on my radio program. With his new book, Brian brings his vast array of investing knowledge to the masses!”―DEMIAN RUSSIAN, Editor-in-Chief, Market Playground There’s more to investing than “Buy low, sell high.” Every financial quarter, more than 1.5 mil¬lion investors turn to Brian Nichols’ acclaimed “Seeking Alpha” columns for his insider tips on value investing. No matter what’s going on in the market, he’s got an uncanny knack for spotting the hottest stocks, the latest trends, and the greatest opportunities. Now―due to popular demand―he’s distilled his best-kept secrets into one comprehensive, easy-to-use guide for “seeking alpha” and maximizing profits in any market. You’ll learn how",
  "genres": [
    "Finance",
    "Money",
    "Business"
  ],
  "author": "Brian Nichols",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/16189512-taking-charge-with-value-investing"
}