{
  "title": "Individually Wrapped",
  "description": "Here's a little about it from my Amazon author page:\"Following in the speculative tradition of Huxley’s Brave New World, the [novel] portends what our present society may come to be given its current consumer culture and fascination with new technologies. What are the sociological implications of living in such a society? We are already seeing the next generation grow up having never known anything other than the digital age and constant consumer scrutiny. How will mankind adapt to the incredible technologies being created at an ever increasing pace? Perhaps more importantly, how will mankind be changed by them? Here the novel owes a debt also to Kafka’s, The Metamorphosis while in tone it story recalls the early work of Kurt Vonnegut.Admittedly, these are heavy-weight literary touchstones. I don’t profess to equate my writing with these authors' classics. I cite them merely as inspirations and also to provide a familiar context to view the story. References aside, Individually Wrapped has touches of mystery, suspense, and, of course, speculative science-fiction, but ultimately it is a literary work at its core with much to say on our contemporary society and where it may be leading us.\" From the dust jacket: \"Once a rising star at MWyly Advertising Agency, Sam Gregory, has lost the confidence of his boss, the respect of his peers, and most importantly the creative drive needed to excel in the cutthroat business. Faced with creating the advertising campaign for what could secure the agency its largest client, Sam’s growing suspicions over the client’s product and ethical misgivings about his profession combine to threaten his job security and worse, his mental stability. Has he stumbled on a sinister conspiracy? A mysterious stranger fans the flames but Sam isn’t sure who he can trust anymore. If only he could retreat into his favorite diversion, the fictional world of super spy, Victor Nil. But unfortunately for Sam, the life lessons of his fictional hero won’t help him face the indifferent forces that shape the real world.\"",
  "genres": [
    "Science Fiction"
  ],
  "author": "Jeremy Bullian",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/16195851-individually-wrapped"
}