{
  "title": "America, 1908: The Dawn of Flight, the Race to the Pole, the Invention of the Model T and the Making of a Modern Nation",
  "description": "A breathtaking ride through the highs and lows of one spectacular, pivotal year in American history.As the earth turned toward the sun on the first morning of 1908, human flight remained, for most Americans, in the realm of myth and dream. But before the darkness fell on New Year's Eve at the end of the year, the Wright brothers would be worldwide celebrities, heralded as the first people in all of human history to conquer the sky.It was the year Teddy Roosevelt sent the Great White Fleet on a voyage around the globe, Robert Peary began his courageous dash to the North Pole, six automobiles left Times Square on an epic twenty-thousand-mile race to Paris, and Henry Ford introduced an oddly shaped new automobile called the Model T.It was a time of seemingly boundless innovation - everything was bigger, better, fast, and greater than ever before. In New York and Chicago, banks of high-speed elevators zipped through vertical shafts in the tallest buildings on earth. Pneumatic tubes whisked mail between far-flung post offices in minutes. Women cleaned their homes with amazing new devices called vacuums. And as American engineers cut a fifty-mile canal through the Isthmus of Panama, the very air buzzed with the imagined potential of new technology, including a \"portable wireless telephone\" that would someday allow people to talk while they walked.Meanwhile, the New York Giants battled the Chicago Cubs in one of the most thrilling seasons in baseball history, and a reluctant William Howard Taft was elected twenty-seventh president of the United States.By turns gripping and humorous, shocking and delightful, Jim Rasenberger's America, 1908 brings to life our nation as it was one hundred years ago, at a moment of delirious optimism and pride, a time when Americans believed that even the most intractable problems would soon be solved and that the future was bound to be better than the past.\"What will the year 2008 bring us?\" pondered the New York World on New Year's Day of 1908. \"What marvels of development await the youth of tomorrow?\" As Thomas Edison said later that year, \"Anything, everything, is possible.\"Shedding new light on stories we thought we knew and telling fresh stories we can't believe we've never heard, American, 1908 is a rousing chronicle of a country on the brink of greatness - and a timely, thought-provoking glimpse at a younger America, even as we wonder what awaits us in the century ahead.",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Audiobook",
    "Science",
    "20th Century"
  ],
  "author": "Jim Rasenberger",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/1619803.America_1908"
}