{
  "title": "The Modern Scholar: Winston Churchill: Man of the Century",
  "description": "Original and revelatory portrait of Churchill post Second World War which examines the development of his fame and his posthumous reputation from one of Britain’s leading political writersJohn Ramsden is head of the history department at Queen Mary and Westfield College and a first-rate professional historian. He is a brilliant lecturer with an enviable reputation and is widely admired by the likes of Ben Pimlott and Peter Hennessy, who describes him as ‘much better than me’. His first trade book, AN APPETITE FOR A NEW HISTORY OF THE CONSERVATIVE PARTY is the book to replace Lord Blake’s history – an authoritative, readable, classic history book.Ramsden’s second trade book is one on Churchill post-Second World War. This will not be ‘yet another book’ on Churchill, but a fresh, original biographical study of Churchill’s post-war fame and reputation, what he was thought to stand for and how that reputation was constructed. It will contain a lot of new and revelatory material on how his personality, attitudes, and vision of himself have affected our own political perception of ourselves as a nation, and will argue that Churchill’s romantic, imperial notion of Britain has contributed directly to many of the political debates of recent years – particularly our attitudes in Europe. This will not be a dry political analysis but an important biographical study of the man who found himself described as the prized possession of the whole world, and of the whole Churchill phenomenon from one of our most interesting and readable historians.This is Ramsden’s turf. This aspect of Churchill has never been dealt with in any depth and he will undertake extensive new research amongst archives in Britain and the USA – much of which have either not been drawn on before or have only just been released.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "Audiobook"
  ],
  "author": "John Ramsden",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/1620054.The_Modern_Scholar"
}