{
  "title": "The Horse and His Girl: A Short Story of Loyalty and Love",
  "description": "A GOLD Mom's Choice Awards® Winner and a Five Stars Readers' Favorite®!! This emotional story is about relying on each other to survive human cruelty, wild animals, and uncaring nature. \"This gripping tale will appeal to a wide array of young readers, including horse the strong friendship the book portrays and the memorable adventures it details invite any reader to identify with the hero horse and his heroine girl.\" --CS Editor \"Their adventures and their strong sense of responsibility for the other make them a powerful team, one that can survive the odds of thirst and starvation and wild predators. With charming pencil drawings to help carry the story along, this is a great story for young readers, especially those with a passion for horses. Wonderful descriptive passages pull the reader right into the story.\" *****Five Stars Readers' Favorite® In a time of economic turmoil, a young girl fights for her stallion's freedom from his new cruel owner. In her desperate attempt to save her horse, they suddenly find themselves lost in the silent and undisturbed Sonoran Desert of Arizona that is merely a home for its creatures, both dead and alive. The girl and her beloved dark bay stallion, faced with horrific challenges as they try to find their way home, must fend for themselves in this merciless desert. With death waiting to capture them in its clutches, the girl and her horse wander aimlessly through this uncaring land with only love and undeniable loyalty to each other keeping them alive. \"A book for everyone. Had me hooked from the beginning to the end. Definitely had my emotions going throughout the entire story. I think it's something that everyone can relate to as it touches on parts of all of us. It's also a story about not giving up when you love someone (horses not excluded).\" --R A Wylie, Verified Amazon Customer",
  "genres": [],
  "author": "Liana-Melissa Allen",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/16201641-the-horse-and-his-girl"
}