{
  "title": "The Last Hunter: Onslaught",
  "description": "The past few years have been a mixture of torture, painful growth and sometimes, pushing its way through all the darkness—joy. I have made friends and allies, brothers and sisters, mentors and...Kainda, who is something else entirely. But someone is missing, someone whose memory saved me from despair—Mirabelle Whitney, my hope. So while the human race prepares to defend itself, I ride toward the encroaching Nephilim army intending to save Mira, return to our feeble base and lead the charge against those who plan to wipe the human race from the face of the Earth.It sounds like an impossible plan, and maybe it is, but if we’re going to die, we’re going to die like hunters—boldly and bravely. More than that, we’re going to die together, as a united race facing a common enemy. Nationality no longer matters. Ancient grudges are forgotten. The human race must resist as one, or face extinction. And now it falls to me, along with Kainda, Em, Mira, Kat, Merrill, Aimee and Luca, to light the path for humanity in our darkest hour. Harnessing the power of the ancient Jericho shofar, we must prevent Nephil, the most ancient and evil of the Nephilim from possessing my body and using its supernatural abilities against mankind.The odds are stacked against victory. The Nephilim out-size, out-power and outnumber us ten to one, but we will fight to the last, the very last, so help me God.I am Solomon Ull Vincent—the Last Hunter and King of Antarktos—and I am prepared to face my fate.The Antarktos Saga is now complete! Pick up all 5 books together and enjoy this epic series front to back without pause. The books, in order, are:The Last Hunter - DescentThe Last Hunter - PursuitThe Last Hunter - AscentThe Last Hunter - LamentThe Last Hunter - Onslaught",
  "genres": [
    "Fantasy",
    "Fiction",
    "Science Fiction",
    "Action",
    "Adventure",
    "Mythology",
    "Urban Fantasy"
  ],
  "author": "Jeremy Robinson",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/16207501-the-last-hunter"
}