{
  "title": "Losing Mom: a family's journey of transition, hope & perseverance",
  "description": "Sometimes it takes a child to guide a family through the crisis of losing a parent. Stella is a charming, witty, insightful, articulate youngster who has an uncanny way of describing the dynamics of her family. From ages eight through twenty-one , Stella shares her most private thoughts, emotions, and struggles, allowing us an intimate look into the developmental challenges of growing up following the death of a parent. Through a series of interviews , which Stella conducts with her four older siblings, the family learns to deal with their mother’s illness and death from cancer. However, as the years go on , these interviews take this amazing family of five siblings by surprise. They offer the opportunity for them to learn how to talk to one another about their grief, develop insights into how their mother’s death affected their life choices and decisions, and share the importance, strength, and comfort found in the letters that Momma left for each them. Losing Mom is an excellent resource for relatives and friends who want to be of help but are unsure of what actually is helpful. Losing Mom is the perfect resource for teenagers and young adults who are looking to find some sense of normalcy after a devastating loss. Losing Mom provides physicians, mental health professionals, and educators an opportunity to enhance their appreciation of the journey these children are on. As painful as this journey is, Losing Mom is filled with hope, helpful hints, suggestions for coping, and the deep insight into children growing up under extraordinary life circumstances. Dr. Frances Wollman Baumgarten is a clinical psychologist and cancer survivor. She maintains a private practice and is the co-founder of Center for Cancer Counseling, a nonprofit cancer counseling program in Newport Beach, California.",
  "genres": [],
  "author": "Frances Wollman Baumgarten",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/16208408-losing-mom"
}