{
  "title": "Pretty Birds",
  "description": "The universally respected NPR journalist and bestselling memoirist Scott Simon makes a dazzling fiction debut. In Pretty Birds , Simon creates an intense, startling, and tragicomic portrait of a classic character–a young woman in the besieged city of Sarajevo in the early 1990s.In the spring of 1992, Irena Zaric is a star on her Sarajevo high school basketball team, a tough, funny teenager who has taught her parrot, Pretty Bird, to do a decent imitation of a ball hitting a hoop. Irena wears her hair short like k. d. lang’s, and she loves Madonna, Michael Jordan, and Johnny Depp. But while Irena rocks out and shoots baskets with her friends, her beloved city has become a battleground. When the violence and terror of “ethnic cleansing” against Muslims begins, Irena and her family, brutalized by Serb soldiers, flee for safety across the river that divides the city.If once Irena knew of war only from movies and history books, now she knows its reality. She steals from the dead to buy food. She scuttles under windows in her own home to dodge bullets. She risks her life to communicate with an old Serb school friend and teammate. Even Pretty Bird has started to mimic the sizzle of mortar fire.In a city starved for work, a former assistant principal offers Irena a vague job, “duties as assigned,” which she accepts. She begins by sweeping floors, but soon, under the tutelage of a cast of rogues and heroes, she learns to be a sniper, biding her time, never returning to the same perch, and searching her targets for the “mist” that marks a successful shot. Ultimately, Irena’s new vocation will lead to complex and cataclysmic consequences for herself and those she loves.As a journalist, Scott Simon covered the siege of Sarajevo. Here, in a novel as suspenseful as a John le Carré thriller, he re-creates the atmosphere of that place and time and the pain and dark humor of its people. Pretty Birds is a bold departure, and the auspicious beginning of yet another brilliant career for its author.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "War",
    "Book Club",
    "Contemporary",
    "Literary Fiction",
    "Novels"
  ],
  "author": "Scott Simon",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/162087.Pretty_Birds"
}