{
  "title": "Julieta",
  "description": "Duas Famílias, Uma Antiga Maldição, Um Amor Quase Impossível...Julie Jacobs e sua irmã gêmea, Janice, nasceram em Siena, na Itália, mas desde os 3 anos foram criadas nos Estados Unidos por sua tia-avó Rose, que as adotou depois de seus pais morrerem num acidente de carro.Passados mais de 20 anos, a morte de Rose transforma completamente a vida de Julie. Enquanto sua irmã herda a casa da tia, para ela restam apenas uma carta e uma revelação surpreendente: seu verdadeiro nome é Giulietta Tolomei.A carta diz que sua mãe havia descoberto um tesouro familiar, muito antigo e misterioso. Mesmo acreditando que sua busca será infrutífera, Julie parte para Siena.Seus temores se confirmam ao ver que tudo o que sua mãe deixou foram papéis velhos - um caderno com diversos esboços de uma única escultura, uma antiga edição de Romeu e Julieta e o velho diário de um famoso pintor italiano, Maestro Ambrogio. Mas logo ela descobre que a caça ao tesouro está apenas começando.O diário conta uma história trágica: há mais de 600 anos, dois jovens amantes, Giulietta Tolomei e Romeo Marescotti, morreram vítimas do ódio irreconciliável entre os Tolomei e os Salimbeni. Desde então, uma terrível maldição persegue essas duas famílias.E, levando-se em conta a linhagem e o nome de batismo de Julie, ela provavelmente é a próxima vítima. Tentando quebrar a maldição, ela começa a explorar a cidade e a se relacionar com os sienenses. À medida que se aproxima da verdade, sua vida corre cada vez mais perigo.Instigante, repleto de romance, suspense e reviravoltas, Julieta Anne Fortier nos leva a uma deliciosa viagem a duas Sienas: a de 1340 e a de hoje. É a história de uma lenda de mais de 600 anos que atravessou os séculos e foi imortalizada por Shakespeare. Mas é também a história de uma mulher moderna, que descobre suas origens, sua identidade e um sentimento devastador e completamente novo para ela: o amor.",
  "genres": [
    "Historical Fiction",
    "Romance",
    "Fiction",
    "Mystery",
    "Historical",
    "Italy",
    "Book Club"
  ],
  "author": "Anne Fortier",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/16208962-julieta"
}