{
  "title": "Invisible Warrior - A Memoir",
  "description": "Invisible Warrior is a memoir of my account of growing up in the experimental Bronx River Housing Project in New York in the 1960's where expectations for success never rose up to the ideals created by project urbanist Charles Abrams. Built in 1951, the Bronx River Housing Project is located on nearly fourteen acres consisting of nine fourteen-story buildings. Intended as a place to raise a family, The Projects instead became a place of hopelessness, drug addiction, poverty, and other social ills. I was one of the fortunate ones. Much like Sonia Sotomayor also raised in The Projects, I overcame numerous challenges and carved a successful life for myself. My book is a valuable historical account of growing up as an African American in New York, an insider's look into a housing experiment, which yielded mostly failure. It is also an inspiring narrative that demonstrates that success is possible even under harsh conditions. Each chapter in Invisible Warrior looks at trials from my youth, overcoming domestic violence, childhood bullies, and sudden deaths as well as similar hardships endured by my neighbors. For instance, \"The Bronx River Project\" bares the cold reality of a mother discovering that her preteen daughter is pregnant. \"Blood on the Walls\" captures the reality of my stolen childhood innocence after witnessing my neighbor's domestic violence. \"Mule\" decries the devastation of my housing project through drug addiction and the consequence of the Vietnam era. I witnessed the lifeless bodies of heroin addicts frantically being coaxed back to life, and the mangled limbs of the young men who returned from the war. \"Out of the Barrel\" maps our escape from the bindings of poverty. Escaping with two small children, an early pregnancy and thirty-five cents. We proved life's possibilities and its glimmer of an indistinguishable light at the end of a dark tunnel. About the author: Michele J. Rolle is a Mammography healthcare specialist in Richmond, Virginia, and has been compassionately committed for more than 25 years to educating and mentoring women in the value of breast health. Michele works for a prominent Obstetrics and Gynecology practice and has represented them as a Chief Mammography Technologist in her appearances on television, radio, and newspaper, and has been quoted in many publications. Her article The Power of Caring for others on domestic violence was recently published in the Richmond Times Dispatch weekly feature In her Shoes . Michele is a member of The James River Writers who selected her work to be read at several recent conferences.",
  "genres": [],
  "author": "Michele J.  Rolle",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/16209561-invisible-warrior---a-memoir"
}