{
  "title": "Cinderella Chronicles Box Set",
  "description": "80,000 wordsSexy on the sweeter side -- more my Blaze level heat -- but there will be some sizzling sex for sure!*******NOTE BE WARNED ************These are stories Lisa wrote many years ago for Ellora's Cave. They are much lighter than her INSIDE OUT TRILOGY and her Tall, Dark, and Deadly series. They are more like her Blaze stories that are light contemporary reads. So please don't look for that dark gritty read you get with the other two series. Light and fun and a much different author voice. Story 1: \nOne Night Forever\nA Modern Day Fairy Tale! Who doesn't want their own Prince Charming? She's a struggling good girl taking care of a sick mother. He's the hot one night stand that she dared indulge in a year before...and now he's her sexy, rich new boss. Lauren Reynolds' obsession with the sexy, cutting edge soap opera \"Red Hot Secrets\" used to be her hottest secret. But now she has a bigger one. More daring. More dangerous. One year ago, on a sultry summer night, she slept with a stranger. But not just any man, one who later turned out to be her boss.Fate has thrown Lauren into the arms of a man who takes her to the absolute edge of passion, but will he destroy her career in the process? She knows she should turn away from temptation, but she convinces herself she deserves just one more night...over and over again.And now, her red hot secret might steal her heart.THE HOTLY EVER AFTER STORIES 1 and 2:\nPleasure with Purpose\n Heather and Brad have been close family friends for ten years but both have secretly pined for each other, secretly fantasized about one sultry hot night together. So when fate delivers them a chance at that night -- will they take it -- and risk a lifetime of friendship being destroyed? Or will they convince themselves they can really wake up tomorrow and pretend it never happened? \nTwice the Pleasure\nSamantha's fiancé is rich and handsome, and as an added plus he moves in her father's business circle. But Samantha feels uncertain. Logic says love and passion are about youth and fairy tales. Still...deep in her heart there was one man who still calls to her. The one who left her and never looked back. Eric.Young and foolish, Eric walked away from the woman he loved, tired of her father's snobbery. When Eric learns Samantha is getting married, he knows he has to act. Eric plans to conquer Samantha's heart no matter how down and dirty he has to get.When Eric shows up at Samantha's bachlorette party, she figures one last romp between the sheets with him might prove Eric isn't the hot lover or \"love\" her mind and heart have conjured up all these years. But soon passion burns like never before, and Samantha might just have an addiction she can never beat...Eric.",
  "genres": [],
  "author": "Lisa Renee Jones",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/16209896-cinderella-chronicles-box-set"
}