{
  "title": "The Lost Life of Eva Braun",
  "description": "Eva Braun is one of history’s most famous nonentities. She has been dismissed as a racist, feathered-headed shop girl, yet sixty-two years after her death her name is still instantly recognizable. She left her convent school at the age of seventeen and met Hitler a few months later. She became his mistress before she was twenty. How did unsophisticated little Fraulein Braun, twenty-three years his junior, hold the most powerful man in Europe in an exclusive sexual relationship that lasted from 1932 until their joint suicide? Were they really lovers, and what were the background influences and psychological tensions of the middle-class Catholic girl from Munich who shared his intimate life? How can her ordinariness and apparent decency be reconciled with an unshakeable loyalty to the monster she loved? She left almost no personal material or documents but her private diary and photograph albums show that her life with Hitler, far from being a luxurious sinecure, caused her emotional torture. His chauffeur called her “the unhappiest woman in Germany.” The Führer humiliated her in public while the top Nazis’ wives, living in his privileged enclave on a Bavarian mountainside, despised her. Yet Albert Speer “She has been much maligned. She was very shy, modest. A man’s gay, gentle, and kind; incredibly undemanding . . . a restful sort of girl. And her love for Hitler---as she proved in the end---was beyond question.” Eva loved the Führer, not for his power, nor because, thanks to him, she lived in luxury. His material gifts were nothing compared with the one thing she really his child. She remained invisible and unknown, a nonperson. They were never seen in public together and she never saw him alone except in the bedroom, yet their long relationship was a sort of marriage. Angela Lambert reveals a woman the world never knew until the last twenty-four hours of her life. In the small hours of April 29, 1945, as Allied troops raced to capture Berlin and the bunker below the Reichskanzlei where the defeated Nazi leaders were hiding, Eva Braun finally achieved her life’s ambition by becoming Hitler’s wife. Next day they both swallowed cyanide and died instantly. She was young, healthy, and thirty-three years old. Based on detailed new research, this is an authoritative biography, only the second life of Eva written in English.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "World War II",
    "War",
    "Germany",
    "20th Century"
  ],
  "author": "Angela Lambert",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/162113.The_Lost_Life_of_Eva_Braun"
}