{
  "title": "The Talpiot Find",
  "description": "Prepare to think.The Talpiot Find challenges and entertains the reader with its offbeat approach to the familiar archaeological-find-rewrites-history theme. Readers will confront the Big Questions in a no-big-deal atmosphere and will find themselves musing more than once \"I never thought of it that way before.\" While following the thought-journey of a very likable protagonist with a bias for humor and irony, readers will explore whether their own world-view is based on a need for comfort and feeling useful, or on a desire for everything to make sense.Grad-student Marc isn't hoping for a spectacular archaeological discovery to catapult his career right from the start. He just wants to graduate. His assignment on this dig site in the Talpiot district of Jerusalem, near the alleged Jesus ossuary tomb, hardly seems likely to produce anything of note, much less spectacular. An ancient garbage pit had been discovered the previous summer while the dig team excavated a twelfth-century well. Marc is now down in the well methodically uncovering unexceptional pottery sherds and animal bones left over from meals consumed twenty-six centuries ago. But then he finds a human skeleton. When the human bones turn out to be as old as the rubbish around them, the archaeologists wonder if the person, apparently dumped into the pit, was a murder victim. And then Marc finds clay tablets, right next to the skeleton, carbon-dated to the same time frame as the skeleton and the surrounding trash. The tablets turn out to be sort of a spectacular find, a portion of Torah written in ancient Hebrew Canaanite, seventh century BCE. Are they related at all to the skeleton, and the murder? Or is their location just coincidental? What are the tablets doing in a garbage pit? Bearing the tetragrammaton, they should have been placed in a genizah. Why were they discarded? In a garbage pit? Near a corpse? Of a murder victim?A subplot set in ancient Jerusalem during the reign of King Josiah follows a slave manager as he completes tasks given him by Shaphan, the head scribe of the Temple, concerning a mysterious scroll that he must bury and an odd set of clay tablets that he, inexplicably, must discard in a garbage pit.",
  "genres": [],
  "author": "John Evan Garvey",
  "average_rating": "2.50",
  "url": "https://www.goodreads.com/book/show/16212629-the-talpiot-find"
}