{
  "title": "Baby, Species Intervention #6609",
  "description": "Have you ever wondered why God does not punish the evil and depraved of our planet? Why does He tolerate the destructive bloodthirsty nature of Homo sapiens allowing them to rule over all creatures, abusing and exploiting according to their whims? Why has science been unable to solve the vexing mystery of our ancestor, the Missing Link? How could one planet evolve such complex and divergent examples of biodiversity? Can you imagine God ever saying, \"To Hell with this mess that is Earth?\" The series \"Species Intervention #6609\" spans two hundred years, encompassing tender love between divergent species, political downfalls and violence of unspeakable order. It is an unfortunate tale of Armageddon and the remote possibility of redemption. In Baby, Netty is a naive teenage farm girl given in marriage to an older brutal opportunist disguised as a successful citizen during the years of Prohibition in Sussex County, New Jersey. After years of enslavement, Netty flees into the night from her rapist husband, traveling back to the farm worked by her parents, where she rescues an unfamiliar damaged creature she finds in a cave in the woods of her childhood, falling in love with the enigmatic creature she names Baby. Together they find happiness and fulfillment despite the changes to Netty's body wrought by the proximity of the unusual creature. When a handsome Italian stranger comes into Netty's life, complications ensue as she falls in love while trying to hide the bizarre and wondrous changes to her farm and her body. Netty, Baby and Wil strive to conquer obstacles thrown in their path by life, succeeding wildly until the heart-rending and astonishingly brutal climax to their story.",
  "genres": [
    "Science Fiction",
    "Horror",
    "Aliens",
    "Fantasy",
    "Thriller",
    "Dystopia",
    "Paranormal"
  ],
  "author": "J.K. Accinni",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/16219571-baby-species-intervention-6609"
}