{
  "title": "The Separation",
  "description": "Christopher Priest excels at rethinking SF themes, lifting them above genre expectations into his own tricky, chilling, metaphysically dangerous territory. The Separation suggests an alternate history lying along a road not taken in World War II. But there are complications. In 1999, history author Stuart Gratton is intrigued by a minor mystery of the European war which ended on 10 May 1941. The British-German armistice signed that month has had far-reaching consequences, including a resettlement of European Jews in Madagascar.  In 1936, the identical twin brothers Joe and Jack Sawyer win a rowing medal for Britain in the Berlin Olympics: it's presented to them by Rudolf Hess. The brothers are separated not only by a twin's fierce need \"to be treated as a separate human being\", but by sexual rivalry and even ideology. When war breaks out Jack becomes a gung-ho bomber pilot, Joe a conscientious objector. Still they're inescapably linked, and sometimes confused. Both suffer injuries and hauntingly similar ambulance journeys. Churchill writes a puzzled memo (later unearthed by Gratton) about the anomaly of a registered-pacifist Red Cross worker flying planes for Bomber Command. Hess has significant, eventually incompatible meetings with both men. Contradictions are everywhere.  As in his magical 1995 novel The Prestige Priest is fruitfully fascinated by the legerdemain of twins, doubles, impostors, symmetrical roles. Churchill's double briefly appears. So does the famous conspiracy theory that the Hess who flew to Britain with his quixotic peace deal wasn't the real Hess ring true? Clearly The Separation was impressively, extensively researched. Its evocations of bombing raids--from either side of the bomb sites--are memorable.  The unfolding story strands become increasingly disorienting and hallucinatory; the easy escape route of dismissing one strand as delusion is itself subtly undermined. The Separation is filled with a sense of the precariousness of history; of small events and choices with extraordinary consequences. --David Langford",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Alternate History",
    "Historical Fiction",
    "Fantasy",
    "War",
    "World War II"
  ],
  "author": "Christopher Priest",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/106921.The_Separation"
}