{
  "title": "In the Shadows: Finding God on Our Darkest Days",
  "description": "Have you ever experienced a life storm? A period of time in which you are the recipient of a downpour so merciless that it threatens your very belief in the importance of your own life? Perhaps it is one life storm, one event that literally brings you to your knees and has you praying for relief. Perhaps it is a series of storms, one upon the next, a string of challenges so profound that you lose faith that the storm will ever end. The affirmations in this book are for such periods in life. They do not promise a parting of the clouds and the relief from the storm. They promise only that although you may experience the illusion of aloneness during the storm, the truth is quite the opposite. We know all too well that to remember God, to feel His presence and to gush words of praise upon Him comes easily when the sun is shining and life is good. But it is when you find yourself in the midst of a life storm that the true test of your devotion is exercised. It is during these times that the affirmations contained in this book might serve as a tool, especially when it seems the storm will never end.If you can acknowledge the breaking of your own heart while also understanding that God is with you, that the jagged path set out before you is not meant to punish, you will have a received a gift that is greater than a sunny day. There are no promises here that your problems will vanish, but only that you might take comfort in knowing that it is within the storm most assuredly above all other times, that you are not alone. And nothing shapes a soul into the truest, strongest form of itself than a life storm.The StormIf I am to weather this stormLet it shape meTo a better form of myselfLet the tossing waves set me rightAnd the salt of the scourging sea Chisel away the shell Holding hostage my dormant soulThat it might learn to breathe againThen let the stormy sea be calmedThat I might float upon itAnd remember who I am",
  "genres": [],
  "author": "Elizabeth D. Gray",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/16225913-in-the-shadows"
}