{
  "title": "Women's Bodies, Women's Wisdom: Creating Physical and Emotional Health and Healing",
  "description": "A groundbreaking book on women's physical and emotional well-being, Women's Bodies, Women's Wisdom has become a classic, with more than 270,000 copies in print in the four years since its initial publication. Now it has been completely revised, offering the most up-to-date information available on women's health issues.Christiane Northrup's vision of mind-body wellness has received an extraordinary response from women all over the world. Women's Bodies, Women's Wisdom powerfully demonstrates that when women change the basic conditions of their lives that lead to health problems, they heal faster, more completely, and with far fewer medical interventions.Now Dr. Northrup brings us vital new information about the best techniques of Western medicine and the best alternative therapies, showing how to incorporate both into a complementary whole. She guides readers through the entire range of women's health problems, and offers strikingly new, positive perspectives on normal processes, such as menstruation, pregnancy, and menopause. This edition includes:• An all-new nutrition chapter emphasizing individual dietary needs and body chemistry• New information on improving fertility after age 35—and how to cut the risk of C-section by 50 percent• A completely updated program for menopause, including how to decide whether natural hormone replacement is right for you• Holistic ways to prepare and heal faster if surgery is necessary• Plus dozens of new natural treatments and a wealth of hard-to-find health care resourcesFilled with dramatic case histories from the famed Women to Women health care center, Women's Bodies, Women's Wisdom is contemporary medicine at its best, combining new technologies with natural remedies and the miraculous healing powers within the body itself.",
  "genres": [
    "Health",
    "Nonfiction",
    "Self Help",
    "Womens",
    "Reference",
    "Feminism",
    "Psychology"
  ],
  "author": "Christiane Northrup",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/1069219.Women_s_Bodies_Women_s_Wisdom"
}