{
  "title": "The Black Knight Chronicles: Omnibus Edition, Books 1-3",
  "description": "The Black Knight Chronicles: Lots of Vampires. No Sparkles. Serious Snark.Contains the first three books of the series:Hard Day's KnightChildren are missing.The police are stumped.Halloween is coming, and an ancient evil is on the horizon.The vampires are the good guys.This is not your ordinary fall weekend in Charlotte, North Carolina. Vampire private detectives Jimmy Black and Greg Knightwood have been hired to save a client from being cursed for all eternity, but end up in a bigger mess than they ever imagined.Suddenly trapped in the middle of a serial kidnapping case, Jimmy and Greg uncover a plot to bring forth an ancient evil. Soon, they've enlisted the help of a police detective, a priest, a witch, a fallen angel and a strip club proprietor to save the world. This unlikely band of heroes battles zombies, witches, neuroses and sunburn while cracking jokes and looking for the perfect bag of O-negative.Back in BlackVampire detectives Jimmy Black and Greg Knightwood investigate a series of assaults plaguing the alleys of Charlotte, North Carolina. The string of hate crimes becomes personal when Jimmy's just-maybe-main-squeeze Detective Sabrina Law's cousin is attacked. Helping a lady out could get the boys killed when they end up in Faerie. Before long, they're up to their butts in trolls, dark fae and a grand battle royale. The odds are against them, but to the boys, this is just another day on the night shift--if the night shift included a steel cage match of supernaturals.Knight MovesEt tu, Vampire? The boys discover they may be tied to a string of serial killings at the college and that they suddenly aren't the only vampire game in town.The vampire count in Charlotte is at least three. Or more. As far as the unhappy boys are concerned, anything more than two is a crowd not to be tolerated.While tracking down the killer and the competition, they encounter coeds, booby traps (not related to the coeds) and a hirsute bounty hunter with a moon fetish and a bad attitude. To catch the killer, Jimmy will have to survive a dive headfirst into the great unwashed horde of Dorkdom (game night at the local comic shop).What's a red-blood-drinking vampire to do? His job. Again.",
  "genres": [
    "Urban Fantasy",
    "Vampires",
    "Fantasy",
    "Fiction",
    "Mystery",
    "Humor",
    "Amazon"
  ],
  "author": "John G. Hartness",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/16231229-the-black-knight-chronicles"
}