{
  "title": "Key West Revenge",
  "description": "Set amidst the decadent heat of Key West and the torrid swamps of the Everglades, Key West Revenge follows a band of intelligence officiers as they fight off drug cartels and a corrupt military officers to rescue their old colleague.The action thriller begins in Key West, where retired intelligence officer LP Thomas is kidnapped while on a routine business trip. His captors want far more than ransom; they want his good name. During his abduction, LP is framed for the bombing of a prominent military headquarters in South Florida.His ties with his friends in the intelligence community run deep, and they realize the con being played on them. They set out to rescue LP and clear his reputation from involvement in the terrorist bombing. Led by the stalwart Jim Stillwater, this eclectic band of former and present intelligence officers includes two bombshell gorgeous female operators, Tanya and Morgan, and the wise Colonel Steve Yamoto. As the band of colleagues moves to track down LP and convince the FBI that their friend is innocent, they will be stabbed in the back and betrayed by the corrupt Naval Officer Commander Failstaff. This circle of friends becomes falsely implicated in the military bombing and finds their own lives under threat. To save themselves and their friend, they will have to go incognito and wade into the murky wilderness of the Florida Everglades where LP is being held and used as a pawn between two rival drug cartels. In a rip-roaring, action-filled climax, the book’s heroes will engage in an extended battle in the Florida Everglades with drug kingpin El Diablo. Just as the sequence of events in the cypress swamps seems most dire, the FBI has a change of heart and swoops in to aid these intelligence officers in their dogged pursuit of LP. A white-knuckle thriller, Lee A. Sweetapple’s Key West Revenge draws on his decades of experience as an intelligence officer combating terrorism and drug trafficking.",
  "genres": [],
  "author": "Lee A. Sweetapple",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/16237115-key-west-revenge"
}