{
  "title": "The Broken Road: From the Iron Gates to Mount Athos",
  "description": "In the winter of 1933 eighteen-year-old Patrick (“Paddy”) Leigh Fermor set out to walk across Europe, starting in Holland and ending in Constantinople, a trip that took him the better part of a year. Decades later, when he was well over fifty, Leigh Fermor told the story of that life-changing journey in A Time of Gifts and Between the Woods and the Water, two books now celebrated as among the most vivid, absorbing, delightful, and beautifully-written travel books of all time.The Broken Road is the long and avidly awaited account of the final leg of his youthful adventure that Leigh Fermor promised but was unable to finish before his death in 2011. Assembled from Leigh Fermor’s manuscripts by his prize-winning biographer Artemis Cooper and the travel writer Colin Thubron, this is perhaps the most personal of all Leigh Fermor’s books, catching up with young Paddy in the fall of 1934 and following him through Bulgaria and Rumania to the coast of the Black Sea. Days and nights on the road, spectacular landscapes and uncanny cities, friendships lost and found, leading the high life in Bucharest or camping out with fishermen and shepherds: in the The Broken Road such incidents and escapades are described with all the linguistic bravura, odd and astonishing learning, and overflowing exuberance that Leigh Fermor is famous for, but also with a melancholy awareness of the passage of time, especially when he meditates on the  scarred history of the Balkans or on his troubled relations with his father. The book ends, perfectly, with Paddy’s diary from the winter of 1934, when he had reached Greece, the country he would fall in love with and fight for: across the space of three quarters of century we can still hear the ringing voice of an irrepressible young man embarking on a life of adventure.",
  "genres": [
    "Travel",
    "Nonfiction",
    "History",
    "Memoir",
    "Biography",
    "Greece",
    "Walking"
  ],
  "author": "Patrick Leigh Fermor",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/16240481-the-broken-road"
}