{
  "title": "Improbable Scholars: The Rebirth of a Great American School System and a Strategy for America's Schools",
  "description": "No school district can be all charismatic leaders and super-teachers. It can't start from scratch, and it can't fire all its teachers and principals when students do poorly. Great charter schools can only serve a tiny minority of students. Whether we like it or not, most of our youngsters will continue to be educated in mainstream public schools.The good news, as David L. Kirp reveals in Improbable Scholars, is that there's a sensible way to rebuild public education and close the achievement gap for all students. Indeed, this is precisely what's happening in a most unlikely Union City, New Jersey, a poor, crowded Latino community just across the Hudson from Manhattan. The school district--once one of the worst in the state--has ignored trendy reforms in favor of proven game-changers like quality early education, a word-soaked curriculum, and hands-on help for teachers. When beneficial new strategies have emerged, like using sophisticated data-crunching to generate pinpoint assessments to help individual students, they have been folded into the mix.The results demand that we take notice--from third grade through high school, Union City scores on the high-stakes state tests approximate the statewide average. In other words, these inner-city kids are achieving just as much as their suburban cousins in reading, writing, and math. What's even more impressive, nearly ninety percent of high school students are earning their diplomas and sixty percent of them are going to college. Top students are winning national science awards and full rides at Ivy League universities. These schools are not just good places for poor kids. They are good places for kids, period.Improbable Scholars offers a playbook--not a prayer book--for reform that will dramatically change our approach to reviving public education.",
  "genres": [
    "Education",
    "Nonfiction",
    "Teaching",
    "Adult"
  ],
  "author": "David L. Kirp",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/16240913-improbable-scholars"
}