{
  "title": "The Flower of Empire: An Amazonian Water Lily, The Quest to Make it Bloom, and the World it Created",
  "description": "In 1837, while charting the Amazonian country of Guiana for Great Britain, German naturalist Robert Schomburgk discovered an astounding \"vegetable wonder\"--a huge water lily whose leaves were five or six feet across and whose flowers were dazzlingly white. In England, a horticultural nation with a mania for gardens and flowers, news of the discovery sparked a race to bring a live specimen back, and to bring it to bloom. In this extraordinary plant, named Victoria regia for the newly crowned queen, the flower-obsessed British had found their beau ideal. In The Flower of Empire, Tatiana Holway tells the story of this magnificent lily, revealing how it touched nearly every aspect of Victorian life, art, and culture. Holway's colorful narrative captures the sensation stirred by Victoria regia in England, particularly the intense race among prominent Britons to be the first to coax the flower to bloom. We meet the great botanists of the age, from the legendary Sir Joseph Banks, to Sir William Jackson Hooker, director of the Royal Botanic Gardens at Kew, to the extravagant flower collector the Duke of Devonshire. Perhaps most important was the Duke's remarkable gardener, Joseph Paxton, who rose from garden boy to knight, and whose design of a series of ever-more astonishing glass-houses--one, the Big Stove, had a footprint the size of Grand Central Station--culminated in his design of the architectural wonder of the age, the Crystal Palace. Fittingly, Paxton based his design on a glass-house he had recently built to house Victoria regia. Indeed, the natural ribbing of the lily's leaf inspired the pattern of girders supporting the massive iron-and-glass building. From alligator-laden jungle ponds to the heights of Victorian society, The Flower of Empire unfolds the marvelous odyssey of this wonder of nature in a revealing work of cultural history.",
  "genres": [
    "History",
    "Nonfiction",
    "Science",
    "Gardening",
    "Nature",
    "Victorian"
  ],
  "author": "Tatiana  Holway",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/16240865-the-flower-of-empire"
}