{
  "title": "Touching a Nerve: The Self as Brain",
  "description": "A trailblazing philosopher’s exploration of the latest brain science—and its ethical and practical implications.What happens when we accept that everything we feel and think stems not from an immaterial spirit but from electrical and chemical activity in our brains? In this thought-provoking narrative—drawn from professional expertise as well as personal life experiences—trailblazing neurophilosopher Patricia S. Churchland grounds the philosophy of mind in the essential ingredients of biology. She reflects with humor on how she came to harmonize science and philosophy, the mind and the brain, abstract ideals and daily life.Offering lucid explanations of the neural workings that underlie identity, she reveals how the latest research into consciousness, memory, and free will can help us reexamine enduring philosophical, ethical, and spiritual questions: What shapes our personalities? How do we account for near-death experiences? How do we make decisions? And why do we feel empathy for others? Recent scientific discoveries also provide insights into a fascinating range of real-world dilemmas—for example, whether an adolescent can be held responsible for his actions and whether a patient in a coma can be considered a self.Churchland appreciates that the brain-based understanding of the mind can unnerve even our greatest thinkers. At a conference she attended, a prominent philosopher cried out, “I hate the brain; I hate the brain!” But as Churchland shows, he need not feel this way. Accepting that our brains are the basis of who we are liberates us from the shackles of superstition. It allows us to take ourselves seriously as a product of evolved mechanisms, past experiences, and social influences. And it gives us hope that we can fix some grievous conditions, and when we cannot, we can at least understand them with compassion.",
  "genres": [
    "Philosophy",
    "Science",
    "Psychology",
    "Nonfiction",
    "Neuroscience",
    "Medicine",
    "Brain"
  ],
  "author": "Patricia S. Churchland",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/16241132-touching-a-nerve"
}