{
  "title": "Fatal Rivalry: Flodden, 1513: Henry VIII and James IV and the Decisive Battle for Renaissance Britain",
  "description": "Flodden 1513: the biggest and bloodiest Anglo-Scottish battle. Its causes spanned many centuries; its consequences were as extraordinary as the battle itself.On September 9, 1513, the vicious rivalry between the young Henry VIII of England and his charismatic brother-in-law, James IV of Scotland, ended in violence at Flodden Field in the north of England. It was the inevitable climax to years of mounting personal and political tension through which James bravely asserted Scotland's independence and Henry demanded its obedience.In Fatal Rivalry, George Goodwin, the best-selling author of Fatal Colours, captures the vibrant Renaissance splendor of the royal courts of England and Scotland, with their unprecedented wealth, innovation, and artistic expression. He shows how the wily Henry VII, far from the miser king of tradition, spent vast sums to secure his throne and elevate the monarchy to a new standard of magnificence among the courts of Europe. He demonstrates how James IV competed with the elder Henry, even claiming that Arthurian legend supported a separate Scottish identity. Such rivalry served as a substitute for war--until Henry VIII's belligerence forced the real thing.As England and Scotland scheme toward their biggest-ever battle, Goodwin deploys a fascinating and treacherous cast of characters: maneuvering ministers, cynical foreign allies, conspiring cardinals, and contrasting queens in Katherine of Aragon and Margaret Tudor.Finally, at Flodden on September 9, 1513, King James seems poised for the crushing victory that will confirm him as Scotland's greatest king and--if an old military foe proves unable to stop him--put all of Britain in his grasp.Five hundred years after this decisive battle, Fatal Rivalry combines original sources and modern scholarship to re-create the royal drama, the military might, and the world in transition that created this bitter conflict.",
  "genres": [
    "History",
    "Nonfiction",
    "Tudor Period",
    "Scotland",
    "War",
    "Historical",
    "Medieval"
  ],
  "author": "George  Goodwin",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/16241135-fatal-rivalry"
}