{
  "title": "The Family Guide to Mental Health Care",
  "description": "Advice on Helping Your Loved Ones, from the medical director of the country's largest state mental health system and the mental health editor of The Huffington Post More than fifty million people a year are diagnosed with some form of mental illness. It spares no sex, race, age, ethnicity, or income level. And left untreated, mental disorders can devastate our families and communities. Family members and friends are often the first to realize when someone has a problem, but it is hard to know how to help or where to turn. Our mental health “system” can feel like a bewildering and frustrating maze. How can you tell that someone has a mental illness? What are the first and best steps for you to take? Where do you go to find the right care? The Family Guide to Mental Health Care is the first comprehensive print resource for the millions of people who have loved ones suffering from some kind of mental illness. In this book, families can find the answers to their most urgent questions. What medications are helpful and are some as dangerous as I think? Is there a way to navigate privacy laws so I can discuss my adult daughter’s treatment with her doctor? Is my teenager experiencing typical adolescent distress or an illness? From understanding depression, bipolar illness and anxiety to eating and traumatic disorders, schizophrenia, and much more, readers will learn what to do and how to help. Real-life scenarios and authoritative information are written in a compassionate, reader-friendly way, including checklists to bring to a doctor’s appointment so you can ask the right questions. For readers who fear they will never see the light at the end of the tunnel, this book gives hope and a path forward. As one of the nation’s leading voices on quality care in mental health, Dr. Lloyd Sederer has played a singular role in advancing services for those with mental illness. Now, the wealth of his expertise and clear guidance is at your disposal. From the first signs of a problem to sorting through the variety of treatment options, you and your family will be able to walk into a doctor’s office know what to do and what to ask.",
  "genres": [
    "Mental Health",
    "Self Help",
    "Health",
    "Nonfiction",
    "Psychology",
    "Parenting"
  ],
  "author": "Lloyd I. Sederer",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/16241211-the-family-guide-to-mental-health-care"
}