{
  "title": "On Call: A Doctor's Days and Nights in Residency",
  "description": "On Call begins with a newly-minted doctor checking in for her first day of residency--wearing the long white coat of an MD and being called \"Doctor\" for the first time. Having studied at Yale and Dartmouth, Dr. Emily Transue arrives in Seattle to start her internship in Internal Medicine just after graduating from medical school. This series of loosely interconnected scenes from the author's medical training concludes her residency three years later.During her first week as a student on the medical wards, Dr. Transue watched someone come into the emergency room in cardiac arrest and die. Nothing like this had ever happened to her before-it was a long way from books and labs. So she began to record her experiences as she gained confidence putting her book knowledge to work.The stories focus on the patients Dr. Transue encountered in the hospital, ER and clinic; some are funny and others tragic. They range in scope from brief interactions in the clinic to prolonged relationships during hospitalization. There is a man newly diagnosed with lung cancer who is lyrical about his life on a sunny island far away, and a woman, just released from a breathing machine after nearly dying, who sits up and demands a cup of coffee.Though the book has a great deal of medical content, the focus is more on the stories of the patients' lives and illnesses and the relationships that developed between the patients and the author, and the way both parties grew in the course of these experiences.Along the way, the book describes the life of a resident physician and reflects on the way the medical system treats both its patients and doctors. On Call provides a window into the experience of patients at critical junctures in life and into the author's own experience as a new member of the medical profession.",
  "genres": [
    "Medical",
    "Medicine",
    "Nonfiction",
    "Memoir",
    "Science",
    "Biography",
    "Biography Memoir"
  ],
  "author": "Emily R. Transue",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/106932.On_Call"
}