{
  "title": "River of Dark Dreams: Slavery and Empire in the Cotton Kingdom",
  "description": "When Jefferson acquired the Louisiana Territory, he envisioned an empire for liberty populated by self-sufficient white farmers. Cleared of Native Americans and the remnants of European empires by Andrew Jackson, the Mississippi Valley was transformed instead into a booming capitalist economy commanded by wealthy planters, powered by steam engines, and dependent on the coerced labor of slaves. \"River of Dark Dreams\" places the Cotton Kingdom at the center of worldwide webs of exchange and exploitation that extended across oceans and drove an insatiable hunger for new lands. This bold reaccounting dramatically alters our understanding of American slavery and its role in U.S. expansionism, global capitalism, and the upcoming Civil War.Walter Johnson deftly traces the connections between the planters pro-slavery ideology, Atlantic commodity markets, and Southern schemes for global ascendency. Using slave narratives, popular literature, legal records, and personal correspondence, he recreates the harrowing details of daily life under cotton s dark dominion. We meet the confidence men and gamblers who made the Valley shimmer with promise, the slave dealers, steamboat captains, and merchants who supplied the markets, the planters who wrung their civilization out of the minds and bodies of their human property, and the true believers who threatened the Union by trying to expand the Cotton Kingdom on a global scale.But at the center of the story Johnson tells are the enslaved people who pulled down the forests, planted the fields, picked the cotton who labored, suffered, and resisted on the dark underside of the American dream.\"",
  "genres": [
    "History",
    "American History",
    "Nonfiction",
    "Race",
    "Economics",
    "African American",
    "American"
  ],
  "author": "Walter Johnson",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/16241458-river-of-dark-dreams"
}