{
  "title": "The Heart of the Lion",
  "description": "A twisted tale of lies, deception, conspiracy, abduction, and murder fueled by greed, avarice, envy, and the desire for power during the reign of King Richard I.\nGoodreads readers offered these rave reviews:\"There are hero knights, sword fights, chases, and escapes before all is concluded in this tale loosely based on British history. This is an enjoyable read and one which you read quickly simply because you won't want to put it down.\" -- Karen, Goodreads\"Excellent book. This one delivered more than I expected. Love that there's a sequel I can read next. If you like medieval action and adventure you should read this one.\" -- Barb, Goodreads \"J. M. Barlog's Heart of the Lion was a good read. The characters and story line seemed the flow with a pace of their own.\" -- Toni, Goodreads\"The author, J.M Barlog, wrote this engaging and adventurous book containing complex characters with a plot that moves back and forth between England and Germany/Austria. Once I got started, I had a hard time putting the book down.\" --Scott, Goodreads\"There is political intrigue, conspiracies and mysteries in this book. This is well written, believable and exciting. The author does a great job of finding a balance between having a clever plot that keeps you guessing and keeping the plot easy to follow.\" -- Richard, Goodreads\"The beauty of this book, though is the way Mr. Barlog weaves truth and fiction to create a book that was very hard to put down. \" -- Patty, Goodreads\"Well written with plenty of intrigue, mystery, politics, courage, loyalty and heartbreak; this book is a must read and led to far many nights reading until 2 am.\" -- Michelle, Goodreads\"The book was hard to put down. You want to find out what happens next with each turn of the page. I highly recommend this book.\" --Glen, Goodreads\"I didn't think I would like this one then I couldn't put it down! This was way more than I expected. The pace was fast and furious and the characters were richly drawn on the page. The author did an excellent job writing this with action, adventure and romance. The plot twists and turns felt real right up to the climax.\" --Sherry, Goodreads\nOne woman's courage must decide the fate of the English crown.\n The Heart of the Lion is King Richard the Lionheart's England at its most tumultuous. His kingdom teeters on the verge of a bloody war, with the victor taking the crown and death the punishment to the vanquished.The English countryside roils in the throes of political upheaval as King Richard sails from defeat in the Holy Lands to fight another war at home. A war against his own blood. The irascible and treacherous Prince John seeks to usurp the throne behind his brother's back.But waylaid on his return voyage, Richard must fight to remain alive and free deep within his enemies' lands, while Princess Joanna and Queen Eleanor struggle to uncover John's growing cabal. Now only Joanna stands brave enough between her brothers. She must risk her life to save her mother and her king. For the prince vows to destroy any who dare step between him and the crown. The Heart of the Lion vividly portrays a woman whose courage is paramount to saving an entire kingdom. Non-stop action and intrigue unfold on both English soil and on the continent as a brother and sister fight to remain free and alive against their enemies.This engrossing story is a must read for all medieval enthusiasts.",
  "genres": [
    "Historical Fiction",
    "Medieval"
  ],
  "author": "J.M. Barlog",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/16242050-the-heart-of-the-lion"
}