{
  "title": "A Weak American in Russia & Ukraine: Adventures and Misadventures Living among the Natives",
  "description": "“Seinfeldian humor set in Russia & Ukraine”\nA Weak American in Russia & Ukraine is a painfully funny collection of travel nightmares; country and culture shocks experienced by an American living and working among the natives over the past 20 years. It offers practical tips on how to cope with: Sexy young women who view foreign men as potential ATM machines and transportation out of their closed countries; herds of stampeding Slavs on city streets, in metro areas and supermarkets; angry motorists who stop for pedestrians at crosswalks only because they are bumpier than potholes; packs of howling stray dogs who don’t understand English and Slavic attack pigeons.A Weak American in Russia & Ukraine also takes readers by the hand and allows them to experience the agony of entering a collapsing post-Soviet medical system and interacting with Kafkaesque bureaucracies. And it provides foreign men, who seek Slavic brides, priceless advice that can save them from bankruptcy, jail and even confinement in a psychiatric hospital.The result is a book that weaves comic misadventures without trivializing serious issues, including AIDS, rampant corruption and ecocide; shatters many prevailing stereotypes about Slavic men and women; and clears up numerous culturally based misunderstandings Americans typically have of Russians and Ukrainians.Seinfeldian humor. Like the very popular TV series Seinfeld, this is fundamentally a book “about nothing”: the banal but often fascinating events that make up our human existence. Chapters titled Slavic Attack Pigeons, Fornicating Flies, Howling Stray Dogs and Mayo Heaven are just a few illustrations. A Weak American in Russia & Ukraine fully agrees with H.L. Mencken who aptly observed: “The basic fact about human existence is not that it is a tragedy, but that it is a bore. It is not so much a war as an endless standing in line.”A Weak American in Russia & Ukraine is bound to be a source of hearty laughter for aching souls and an essential guide to help Americans and other foreigners cope with, and even enjoy, the challenges of daily life in Russia and Ukraine; and understand the many harsh post-Soviet political, economic, social and environmental realities in these countries. In all, 283 pages with 60 original illustrations and 59 short chapters.",
  "genres": [
    "Travel",
    "Russia",
    "Memoir",
    "Ukraine",
    "Humor",
    "Nonfiction"
  ],
  "author": "Walter Parchomenko",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/16243903-a-weak-american-in-russia-ukraine"
}