{
  "title": "Rhapsody in Black: The Life and Music of Roy Orbison",
  "description": "Roy Orbison emerged as an artist alongside his Sun Records contemporaries in the early days of rock 'n' roll. He did not possess the good looks of Elvis Presley or the Everyman toughness of Johnny Cash, nor did he conduct wild-child stage antics like Jerry Lee Lewis. But he did possess a magnetic mystique that would captivate fans around the world and inspire countless musicians.A quiet man, who k,d. Lang would refer to as \"Buddha \" Orbison was more interested in building model airplanes, watching films, and reading books in his den than talking about himself or partying hard. Yet he was nothing shy of a superstar – determined to succeed, driven by a relentless love for music that started in childhood, and blessed with some of the best pipes in the business. Standing still on stage, hidden behind his perpetual Ray-Bans, Orbison delivered his melodious songs with haunting emotional depth. His artful recordings, mysterious image, and angelic voice have left an indelible mark on popular music.In Rhapsody in Black, John Kruth tells the story of Roy Orbison in prose as musical as the artist's melodies and does not shy away from or trivialize the personal pain, alienation, and tragic events that shaped Orbison's singular personality and music. Featuring interviews with people who worked closely with Orbison, career-spanning photos, a select discography, and a new afterward for the paperback edition, Rhapsody in Black is both celebratory and touching. It delves into the behind-the-music details of Orbison's collaborations, recording sessions, tours, and business affairs, as well as his personal life – his roots, his marriages and his children – to present a telescopic view of his legacy. Includes two eight-page B&W and color photo inserts",
  "genres": [
    "Music",
    "Nonfiction",
    "Biography"
  ],
  "author": "John Kruth",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/16243594-rhapsody-in-black"
}