{
  "title": "Dark Creations: The Hunted",
  "description": "Gabriel and Melissa were enjoying their time together in Harbingers Falls. Months had gone by with no sign of activity from Dr. Franklin Terzini. Their lives had returned to normal, or as normal as could be expected. They knew that as long as Terzini lived, however, they would never be truly safe. Yet they tried to enjoy each day of safety that passed. Working and planning for college distracted them from the never-ending threat that loomed on their horizon. But jobs and future plans are jeopardized when they discover pregnant women have been disappearing across the country. Their discovery means their days of peace have ended. Gabriel suspects the disappearances are related to Terzini. To be sure, he and Melissa, along with Yoshi and Alexandra, travel to California to see for themselves. While there, they discover that the geneticist has, in fact, been busy in his absence, and that the missing women are just the beginning of an elaborate plot to eradicate humankind. Gabriel’s journey leads him to the the small town of Santa Ynez, California. There, he learns that the community has been compromised, infiltrated by a legion of Terzini’s creations. Members of the new race walk among the general population, work, even hold positions of power. All the while, its citizens remain unaware. Except one. Army Staff Sergeant Jack Downing has returned to Santa Ynez after completing his final tour of active duty in the Middle East. The impending birth of his first child and adjusting to civilian lifestyle had him feeling nervous and excited; until he saw his wife, Dawn. Dawn melted his every worry. Wrapped in her loving arms he knew their future would be bright. But his warm homecoming is cut short when two police officers arrive at his home and abduct his pregnant wife. Worlds collide in this heart-pounding continuation of the Dark Creations series. Pregnant women are being targeted, a geneticist is being tracked, and abductors will be hunted. Will Gabriel stop Dr. Terzini before he overtakes humanity? Will Jack rescue his wife and unborn child, or have their fates already been sealed?",
  "genres": [
    "Paranormal"
  ],
  "author": "Jennifer Martucci",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/16244409-dark-creations"
}