{
  "title": "Tomcats [Lyon's Theorem of Seduction: Captain Jack's Wet Dream]",
  "description": "Lyon's Theorem of Seduction [Siren Classic ManLove: Erotic Alternative Paranormal Romance, M/M, shape-shifters, HEA] TomCats is the hottest gay resort in Key West and the perfect place for Andrew Long to forget his cheating ex-boyfriend. Sexy tomcat Lyon Nash enjoys his life running the resort he owns with a group of cat-shifters. He's not looking for a mate, but the shy, uptight Andrew ignites a spark that his cat can't ignore. Captain Jack, the cruise director, is also attracted to Andrew, and he bets Lyon that he can seduce the new guest first. Lyon puts his Theorem of Seduction to the test and wins the bet. Things heat up between him and Andrew. They have a magical, mutual connection, but their relationship goes south when Andrew finds out about the bet. Once again he's been humiliated and he flies back to New York. At least he's bringing back the stray cat he adopted, but can the feline help him forget the charming cad he left behind? ** Captain Jack's Wet Dream [Siren Classic ManLove: Erotic Alternative Paranormal Romance, M/M, older hero, shape-shifters, HEA] Captain Jack Saylor is about to turn forty-five and he's uber-sensitive about his age. When his buddies at TomCats Resort in Key West throw a birthday party to cheer him up, Jack never expects a beautiful Asian man to jump out of the cake. Aran Suttirat, the twenty-one-year-old that arrived from Bangkok, is not Jack's usual type, but Jack's pheromones go into overdrive when the boy lands on his lap. Aran is the new masseur, and he gives Jack a birthday massage with a happy ending the Captain can't forget. Jack is smitten, but the boy is too young for him, and besides, Jack's been commitment-phobic since losing his mate years ago. Aran doesn't agree, and he'll do anything to change Jack's mind, including playing dirty. But can Aran bring Jack to his senses and convince him they can have it all? ** A Siren Erotic Romance",
  "genres": [],
  "author": "Gale Stanley",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/16245117-tomcats-lyon-s-theorem-of-seduction"
}