{
  "title": "The Afterlife Series Box Set",
  "description": "The first three books in the Afterlife series by international Best-Selling Author Willow Rose.Book 1 - BEYONDMeghan is 16 when she dies. She wakes up on a flying steamboat on her way to a school run by Angels in a white marble castle. On the boat she meets Mick who has been dead for more than a hundred years but still looks like a teenager. He helps her past the difficult beginning at the new school in a new world filled with magic.One day some of Meghan's roommates find a mirror in the cellar of the school and they persuade her to go through it with them - well knowing it is strictly against the rules of the school. Meghan ends up back on earth where she meets Jason. But Jason is in danger and Meghan knows something important. Something that is a matter of life and death. Soon she is forced to choose between the two worlds. The one she belongs to now and the one she left.Praise: - Willow Rose definitely keeps you on the edge of your seat. She balanced fantasy and intense emotion brilliantly. I highly recommend it to anyone that enjoys the paranormal. - Fictitious Musings- I loved this book! It was really good and just warm with a touch of darkness to it (...) It's good stuff! - That Chick That Reads- Death & Life meet with a twist. Definitely worth a read - Becky's Barmy Book BlogBook 2 - SERENITYIt is Meghan's second year at The Academy. While trying to help and care for Jason on earth she is struggling to keep up in school, where they this year will learn both to ride Pegasus' and fly through severe storms. Meanwhile Mick is becoming more than a friend to her and soon she finds herself facing the unavoidable choice. But something evil is threatening the students at the Academy and Meghan is no longer safe within the walls of the castle. Something causes several of the students to be caught in the middle of a nightmare, that they can't wake up from. Soon they realize that they might have a traitor in their midst. Praise:This was a wonderful sequel. Every bit as good as the first book in the series. Now on to the third one - I am really excited to see what happens next. I can recommend this to anyone who enjoys a good paranormal romance. /GoodreadsBook 3 - ENDURANCEMeghan's training at the Academy is coming to an end. Everything is going great as she comes closer to graduation. She is engaged to be married and the wedding is near when she hears some disturbing news that makes her rethink her future.In class the students are learning to catch dreams and fly with the speed of light. Meghan soon discovers her special talents and that she is much stronger than she thought. But unfortunately that doesn't help her as she faces the truth about her own death, which will be revealed to her at the end of the year.Endurance is the third book in Willow Rose's Afterlife series about a young girl's life after death.Praise:I hope there will be more in this series because I have enjoyed getting to know Meghan and her friends, Mick, Jason, and the teachers at the Academy. by Once Upon a Twilight",
  "genres": [
    "Fantasy",
    "Paranormal",
    "Young Adult",
    "Fiction",
    "Romance",
    "Paranormal Romance",
    "Angels"
  ],
  "author": "Willow Rose",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/16247835-the-afterlife-series-box-set"
}