{
  "title": "Why God Became a Buddha",
  "description": "For many of us who grew up in a theistic world of 'God', the idea of God becoming a Buddha may seem confusing and disorienting, as we tend to think of God as the creator of the physical universe and \"the Buddha\" as just a human being within this creation. And while it is certainly true that the historical Buddha (Siddhattha Gotama) was a human being just like us, this book examines his past lives as a God, his discourses to the Gods, and central teachings from the Dhamma he taught to shed light on the logic and nature of Buddhist Cosmology and its relationship to the path of spiritual liberation from the things that make us suffer.  One may ask, how could a God who ruled the universe not be fully liberated spiritually, as the awe, overwhelming power, and genius of the physical universe appears beyond human comprehension, and therefore its ruler must have achieved the highest state of being. Complete mastery of the physical laws of the universe - the elusive goal of science - is widely considered the ultimate in human development. But through examining Buddhist Cosmology and the numerous discourses the historical Buddha gave on the nature of the God(s), we learn that the Gods were/are imperfect and addicted to form and/or sense gratification, and had many spiritual fetters that kept them bound to the gross and finer material realms of existence despite significant spiritual advancement.   This 'imperfect God' concept is thoroughly explored through the historical Buddha’s own past lives as a 'God' in heavenly realms of existence, and the sense-realm clinging that led to his last rebirth as a human. By examining the remaining spiritual fetters of the Buddha when he was a 'God' using 10 fetter analysis, even the Gods typically associated with the Abrahamic faiths of Judaism, Christianity, and Islam, and the Hindu Maha Brahma God are put in a new light, and we are able to discern more clearly how Gods fall and how precious human birth is in removing these fetters from our own lives in our effort to attain spiritual liberation. Most academic treatment of Buddhist Cosmology fails to adequately appreciate the relationship between the cosmology described by the Buddha and the spiritual progress of beings. And when not completely dismissed as myth, satire, or humor, Buddhist Cosmology is treated as just one of many cosmologies by Buddhist scholars and writers, and therefore the connection between Buddhism and other spiritual traditions seems lost or artificially distant. This book attempts to provide the missing links to the cosmology of other spiritual traditions so that it is beyond doubt that these various cosmologies are an integral part of the Buddhist Cosmology taught by the Buddha. In fact, the 'Creator God' referred to in Judiasm, Christianity, Islam, and Hinduism, for example, may well have been the Buddha in one of his past lives. This begs the question, “Why Did God Become a Buddha?”",
  "genres": [
    "Buddhism"
  ],
  "author": "Metteyya Brahmana",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/16247847-why-god-became-a-buddha"
}