{
  "title": "So You've Got A Cataract?",
  "description": "What You Need to Know About Cataract Surgery: A Patient's Guide to Modern Eye Surgery, Advanced Intraocular Lenses & Choosing Your SurgeonA BOOK ABOUT CATARACTS FOR PEOPLE WITH CATARACTS. NO MEDICAL JARGON! NO PROCEDURAL TERMINOLOGY! - from one of America's Most Compassionate Doctors, Dr. David Richardson Why YOU NEED This Cataract Surgery BookIt's a curious thing. People with cataracts often have very poor vision, making it difficult for them to read. And yet, their physicians typically ask them to sift through stacks of educational pamphlets and paperwork on cataracts. The documents are often single-spaced with small print and thin margins - in short, a nightmare for someone with cataracts. What's more, the information is oozing with hard-to-understand medical jargon and procedural terminology.I really want my cataract patients to have an entirely different experience. That's why I went to work on \"So, You've Got a Cataract?\" This is a book about cataracts for people with cataracts. My goal is to provide the information you need to learn about your eye's condition and to make good, safe decisions about treatment.The book covers, in a language that anyone can understand, basic information about how the eye works and what is useful to know about a cataract. If you are considering modern cataract surgery, you'll find most of what you need to know within the pages of this book. You'll learn what happens during the actual procedure and what to expect afterwards.The larger page size and Kindle eBook format were specifically chosen for this project as they allow for enlarging the text size making it easier for those with poor vision to read.Buy a Book. CHANGE A LIFE!Proceeds from the sale of this book will be donated to a non-profit organization devoted to preventing blindness. When you buy the book, you are not only educating yourself, but helping change lives as well..What You Will Learn...About CataractsHow the Eye WorksWhat Is a Cataract?Cataract SymptomsWhen to Consider TreatmentMyths about Cataract TreatmentWhat You Need To Know About Cataract SurgeryModern Cataract SurgeryA word about no-stitch surgeryPreparing For Cataract SurgeryThe Weeks Before SurgeryThe Night Before SurgeryWhat To Expect The Day of SurgeryAt the Surgery CenterAfter the ProcedureThe Days After SurgeryActivitiesWhy You Might Still Need GlassesIntraocular LensesWhy You Need An ImplantYour OptionsThe Decision PointsRisks of Cataract SurgeryPossible ComplicationsCataract Surgery and GlaucomaIf You Have Early or Well-Controlled GlaucomaIf Your Glaucoma is Moderate or Requires the use of DropsIf You Have Advanced or Poorly-Controlled GlaucomaCataract Surgery with Other DiseasesDiabetic RetinopathyMacular DegenerationProstate MedicationsA Word About Laser Cataract SurgeryEnter the Femto LaserAppendicesHow To Choose A Cataract SurgeonSample Document \"INFORMED CONSENT\"",
  "genres": [],
  "author": "David D. Richardson",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/16247962-so-you-ve-got-a-cataract"
}