{
  "title": "Outlaw: Waylon Jennings, Willie Nelson, Kris Kristofferson and the Renegades of Nashville",
  "description": "Waylon Jennings. Willie Nelson. Kris Kristofferson. Three renegade musicians. Three unexpected stars. Three men who changed Nashville and country music forever.By the late 1960s, Nashville, Tennessee, was firmly established as the center of the booming country music industry and home to what was known as the Nashville Sound, characterized by slick production and adherence to an increasingly overused formula. But the city was changing. Young people from all over the country were streaming into the bohemian West End and colliding with three trailblazing artists who would soon rock the foundations of Nashville's music business.Surrounded by the street vibes of the West End's burgeoning underground scene and the outlaw protest tradition of Nashville's unlikely civil rights leaders and antiwar protestors, Waylon, Willie, and Kris began resisting the unspoken rules of Nashville's music-making machine and instead forged their own creative paths. Their music, personal and not easily categorized, was more in the vein of rock acts like the Allman Brothers and Bob Dylan, and it communicated a stark rawness and honesty that would influence artists of all genres for decades to come.Studded with a diverse secondary cast including Johnny Cash, Rodney Crowell, Kinky Friedman, Billy Joe Shaver, and others, Streissguth's new book brings to life an incredible chapter in musical history and reveals for the first time a surprising outlaw zeitgeist in Nashville. Based on extensive research and probing interviews with key players, what emerges is a fascinating glimpse into three of the most legendary artists of our times and the definitive story of how they changed music in Nashville and everywhere.",
  "genres": [
    "Music",
    "Biography",
    "Nonfiction",
    "History",
    "Pop Culture",
    "American History",
    "Audiobook"
  ],
  "author": "Michael Streissguth",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/16248062-outlaw"
}