{
  "title": "The History of Underclothes",
  "description": "\". . . thoroughness and most impressive scholarship . . . much entertaining detail and . . . pleasant humour.\" — The Times Literary Supplement (London)Underwear — practical garments with a utilitarian function or body coverings that serve an erotic purpose? As this fascinating and intelligently written study shows, the role played by underclothing over the last several centuries has been a varied one.In a well-documented, profusely illustrated volume combining impressive scholarship with an entertaining, often humorous style, two distinguished clothing historians consider undergarments worn by the English over the past 600 years. Beginning with the Middle Ages, the authors cover centuries of clothing history, including the Tudor period, the Restoration, the Victorian and Edwardian eras, and the twentieth century up to the eve of World War II. Drawing on extensive, research, the Cunningtons illuminate the role and function of it protected the wearer against the elements, supported costume shapes, served as an erotic stimulus, symbolized class distinctions, and fulfilled other social, sanitary, and economic functions.Enhancing the detailed, comprehensive text are more than 100 period illustrations and photographs depicting a laced-up bodice of the twelfth century, embroidered linen drawers of the sixteenth century, a hooped petticoat support in bentwood (c. 1750), footed long drawers (1795), nineteenth-century bustles, early nineteenth-century corsets for men, \"Frillies for the Tiny Lady\" (1939), and much more. A bibliography, appendix, and index complete a valuable reference work that will appeal to costume historians, sociologists, and other readers.",
  "genres": [
    "History",
    "Fashion",
    "Nonfiction",
    "Fashion History",
    "Reference",
    "Costume History",
    "Microhistory"
  ],
  "author": "C. Willett Cunnington",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/1069450.The_History_of_Underclothes"
}