{
  "title": "Lee Kuan Yew: The Grand Master's Insights on China, the United States, and the World",
  "description": "Grand strategist and founder of modern Singapore offers key insights and controversial opinions on globalization, geopolitics, economic growth, and democracy.When Lee Kuan Yew speaks, presidents, prime ministers, diplomats, and CEOs listen. Lee, the founding father of modern Singapore and its prime minister from 1959 to 1990, has honed his wisdom during more than fifty years on the world stage. Almost single-handedly responsible for transforming Singapore into a Western-style economic success, he offers a unique perspective on the geopolitics of East and West. American presidents from Richard Nixon to Barack Obama have welcomed him to the White House; British prime ministers from Margaret Thatcher to Tony Blair have recognized his wisdom; and business leaders from Rupert Murdoch to Rex Tillerson, CEO of Exxon Mobil, have praised his accomplishments. This book gathers key insights from interviews, speeches, and Lee's voluminous published writings and presents them in an engaging question and answer format.Lee offers his assessment of China's future, asserting, among other things, that \"China will want to share this century as co-equals with the U.S.\" He affirms the United States' position as the world's sole superpower but expresses dismay at the vagaries of its political system. He offers strategic advice for dealing with China and goes on to discuss India's future, Islamic terrorism, economic growth, geopolitics and globalization, and democracy. Lee does not pull his punches, offering his unvarnished opinions on multiculturalism, the welfare state, education, and the free market. This little book belongs on the reading list of every world leader--including the one who takes the oath of office on January 20, 2013.",
  "genres": [
    "Politics",
    "History",
    "Nonfiction",
    "China",
    "Biography",
    "Asia",
    "Business"
  ],
  "author": "Graham Allison",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/16248652-lee-kuan-yew"
}