{
  "title": "The Neural Basis of Free Will: Criterial Causation",
  "description": "The issues of mental causation, consciousness, and free will have vexed philosophers since Plato. In this book, Peter Tse examines these unresolved issues from a neuroscientific perspective. In contrast with philosophers who use logic rather than data to argue whether mental causation or consciousness can exist given unproven first assumptions, Tse proposes that we instead listen to what neurons have to say. Because the brain must already embody a solution to the mind--body problem, why not focus on how the brain actually realizes mental causation?Tse draws on exciting recent neuroscientific data concerning how informational causation is realized in physical causation at the level of NMDA receptors, synapses, dendrites, neurons, and neuronal circuits. He argues that a particular kind of strong free will and \"downward\" mental causation are realized in rapid synaptic plasticity. Recent neurophysiological breakthroughs reveal that neurons function as criterial assessors of their inputs, which then change the criteria that will make other neurons fire in the future. Such informational causation cannot change the physical basis of information realized in the present, but it can change the physical basis of information that may be realized in the immediate future. This gets around the standard argument against free will centered on the impossibility of self-causation. Tse explores the ways that mental causation and qualia might be realized in this kind of neuronal and associated information-processing architecture, and considers the psychological and philosophical implications of having such an architecture realized in our brains.",
  "genres": [
    "Philosophy",
    "Neuroscience",
    "Science",
    "Psychology",
    "Nonfiction",
    "Artificial Intelligence"
  ],
  "author": "Peter Tse",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/16248650-the-neural-basis-of-free-will"
}