{
  "title": "The Prince of Medicine: Galen in the Roman Empire",
  "description": "Galen of Pergamum (A.D. 129 - ca. 216) began his remarkable career tending to wounded gladiators in provincial Asia Minor. Later in life he achieved great distinction as one of a small circle of court physicians to the family of Emperor Marcus Aurelius, at the very heart of Roman society. Susan Mattern's The Prince of Medicine offers the first authoritative biography in English of this brilliant, audacious, and profoundly influential figure. Like many Greek intellectuals living in the high Roman Empire, Galen was a prodigious polymath, writing on subjects as varied as ethics and eczema, grammar and gout. Indeed, he was (as he claimed) as highly regarded in his lifetime for his philosophical works as for his medical treatises. However, it is for medicine that he is most remembered today, and from the later Roman Empire through the Renaissance, medical education was based largely on his works. Even up to the twentieth century, he remained the single most influential figure in Western medicine. Yet he was a complicated individual, full of breathtaking arrogance, shameless self- promotion, and lacerating wit. He was fiercely competitive, once disemboweling a live monkey and challenging the physicians in attendance to correctly replace its organs. Relentless in his pursuit of anything that would cure the patient, he insisted on rigorous observation and, sometimes, daring experimentation. Even confronting one of history's most horrific events- a devastating outbreak of smallpox-he persevered, bearing patient witness to its predations, year after year. The Prince of Medicine gives us Galen as he lived his life, in the city of Rome at its apex of power and decadence, among his friends, his rivals, and his patients. It offers a deeply human and long- overdue portrait of one of ancient history's most significant and engaging figures.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Medicine",
    "Science",
    "History Of Medicine",
    "Health"
  ],
  "author": "Susan P. Mattern",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/16248492-the-prince-of-medicine"
}