{
  "title": "Beta: Project Avatar",
  "description": "Hays's thought-provoking and relentless cyberthriller merges lucid prose and cutting social commentary on the technology people both covet and fear. Dee is the heart that pumps blood through this narrative. She is infused with realistic emotion... A welcome and timely addition to the genre, this stunning debut makes a statement about technology without sacrificing story. –Publishers Weekly starred reviewReaders [are] in for a good time…car chases, burglaries and gutsy escapes… glamorous settings and…a female character not often seen in the cyberthriller genre: an independent, sassy protagonist unafraid of striking out on her own. Readers may never look at their iPhones the same way again! –Kirkus ReviewsRiveting reading that will prove very hard to put down. An excellent and much recommended addition to thriller collections! –Midwest Book ReviewWhen a powerful virtual agent makes its way out of the lab, the military will stop at nothing to get it back.Hays hacks into our greatest fears of technology while simultaneously tempting us with the phenomenal capabilities of twenty-first-century electronics. This smart, topical, furious-paced thriller thrusts world-class cryptographer Dee Lockwood against an array of rogue, sociopathic assassins intent on stealing a defunded military software application and igniting a Third Gulf War.Lockwood is on her way to a secret NSA conference when a vicious hijacking leaves her friend in a coma—but not before he has installed the last copy of BETA on her laptop and smartphone. When Lockwood overcomes her fear and provides the impetus for her fellow passengers to regain control of the aircraft, she imagines the terrifying ordeal is over. But it’s only the beginning. BETA is actually “Project Avatar,” a secret military software project. After losing its congressional funding, BETA was smuggled out of the Pentagon, hidden inside a consumer-grade software application, only to wind up on Dee’s laptop and smartphone. Lockwood finds herself the target of rogue UMBRA Special Forces commandos, ruthlessly hunting her down to retrieve the precious code. With the help of John, a handsome and mysterious former MI-6 agent, Lockwood’s investigations lead her on a breathless flight from the Arizona desert to the historic streets of Geneva, the ancient royal palaces and gardens of Bangalore, and the jungle trails above Rio. This action-filled, intelligent and thought-provoking novel is a thrill-a-minute adventure from its opening pages to the stunning conclusion.",
  "genres": [
    "Fiction",
    "Science Fiction",
    "Action"
  ],
  "author": "A.M.D. Hays",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/16249965-beta"
}