{
  "title": "News of a Kidnapping",
  "description": "THIS ASTONISHING BOOK by the Nobel laureate Gabriel Garcí­a Márquez chronicles the 1990 kidnappings of ten Colombian man and women--all journalists but one--by the Medellín drug boss Pablo Escobar. The carefully orchestrated abductions were Escobar's attempt to extort from the government its assurance that he, and other narcotics traffickers, would not be extradited to the United States if they were to surrender.From the highest corridors of government to the domain of the ruthless drug cartels, we watch the unfolding of a bizarre drama replete with fascinating characters Cesar Gaviria, the nation's cool and secretive president; Diana Turbay, a famous television journalist and magazine editor; three indomitable women who are imprisoned for miserable months in a small room with a light perpetually on; an eighty-two-year-old priest with a mission to bring the regime and the cartel to the negotiating table; and Escobar himself, the legendary drug baron who changes his bodyguards daily and maintains a private zoo with giraffes and hippos from Africa.All of this takes place in a country where presidential candidates and cabinet officers are routinely assassinated; where police go into the Medellín slums to murder boys they think may be working for Escobar; but where brave and honest citizens are trying desperately to make democracy survive.An international best-seller, News of a Kidnapping combines journalistic tenacity with the breathtaking language and perception that distinguish the writings of Gabriel Garcí­a Márquez. It draws us unto into a world that, like some phantasmagorical setting in a great Garcí­a Márquez novel, we can scarcely believe exists--but that continually shocks us with its cold, hard reality.",
  "genres": [
    "Nonfiction",
    "History",
    "Spanish Literature",
    "True Crime",
    "Crime",
    "Journalism",
    "Latin American"
  ],
  "author": "Gabriel García Márquez",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/16251.News_of_a_Kidnapping"
}