{
  "title": "Just a Little Series: Parts 1-4",
  "description": "A complete compilation of the Just a Little Series novelettes: Just a Little Crush, Just a Little Embrace, Just a Little Sincerity, and Just a Little Promise.JUST A LITTLE CRUSHWhen a class assignment requires seventeen-year-old Julie to shadow someone on the job, she's overwhelmed by the decisions she'll have to make. After all, she has no clue what she wants from life post-graduation. So when her Uncle Charlie, Oakland's Chief of Police, suggests Julie fulfill her twenty hours of required job shadowing at the local police department, she's thrilled at his solution. Thinking she'll spend her days filing paperwork behind a desk, she finds herself quickly agreeing to his proposition. But Julie's expectations are quickly turned upside down when she meets Luke, the young and handsome (albeit somewhat stubborn) officer she's assigned to shadow on patrol.With every hour she logs with Luke at the wheel, her feelings stir deeper, and Julie can't help but wonder if what she's feeling has developed into more than just a little crush.JUST A LITTLE EMBRACEGone are the days of police patrol. With ten hours to go before completing her job shadowing project, seventeen-year-old Julie Little's assignment has switched gears, and now she's required to start living the lifestyle of every man (and woman) in uniform. Under Luke's command, Julie is obligated to complete her remaining hours through early morning exercise training. And despite her distaste for physical exertion, Julie's crush on her mentor continues to grow by leaps and bounds with each passing day. And just when she's certain that she's making progress in her relationship with Luke, Julie learns that the new guy in town has taken an interest in winning her heart... and as far as she's concerned, there's only room in her heart for one man... even if he still hasn't figured out that they're meant to be.JUST A LITTLE SINCERITYPlans for the Oakland Fall Ball are officially underway, and it's up to seventeen-year-old Julie Little to pull off a night her classmates will never forget. But with the recent tragedies that have torn through her life, Julie can't stay focused on the task at hand. With the added stress of the dance, family, and fragile friendships, she continues to struggle with the pain that comes with love and loss. And with the fate of her love life hanging in the balance, a close friend finally lays it all on the line; Julie will never be happy... until she finally lets Luke go....JUST A LITTLE PROMISEIn the beginning, all she wanted was a sense of direction. Now, she's fighting in the name of love.Seventeen-year-old Julie Little is under constant scrutiny. Try as she might, she can't make a single move without her uncle's permission--and Charlie will stop at nothing to keep her from Luke (even if that means putting her behind bars for an hour or two). But Charlie's overbearing behavior is the least of her worries. Derek is consumed with guilt. Luke is struggling to overcome his past. And Julie is on a diehard mission to change things that are completely out of her control... even if that means betraying the man she loves.",
  "genres": [
    "Young Adult",
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Collections",
    "Chick Lit"
  ],
  "author": "Tracie Puckett",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/16251490-just-a-little-series"
}