{
  "title": "Love and Truth",
  "description": "Eighteen-year-old Nicole Harrison has spent her high school years devoted to academics and dance, leaving no time for a boyfriend and a life. Her parents’ shocking divorce causes Nicole to believe that true love is impossible to find. After spending her life in a small Texas town, Nicole joins a foreign exchange student dance program in the country where she was born. After years dreaming about her birthplace, she boldly leaves her world behind and moves in with a host family on the island of Okinawa in Japan. She anxiously awaits a year of improving her dance technique while enjoying a world of new experiences  Jonathan Hayes was born to a Japanese mother and American Marine father via a surrogate in the States. After his father’s tragic death in Iraq when Jonathan was only a baby, his mother moved them back to her home in Okinawa. As a child, Jonathan's mother immersed him in American culture to honor his father. His good looks and immense musical talent have left him with no shortage of female admirers. But after a bad break-up from his girlfriend of two years, Jonathan plunges into a playboy lifestyle that leads him along a destructive path. As his wounds begin to slowly heal, he tries regaining his self-respect by living on the straight and narrow. But his heart remains closed to the idea of love; that is, until the night he sees the beautiful and innocent Nicole Harrison, upon the balcony of his neighbor’s home.  While Nicole tries to navigate an unfamiliar country, she also has to learn how to navigate the unfamiliar and unwanted feelings she's developing for Jonathan through some very heart-wrenching and trying times.  Will her fears push him away, or will Jonathan show her the truth of loyal love…",
  "genres": [
    "New Adult",
    "Romance",
    "Young Adult",
    "Contemporary",
    "College",
    "Drama",
    "Contemporary Romance"
  ],
  "author": "Kathryn Perez",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/16253406-love-and-truth"
}