{
  "title": "Horando - Going Home",
  "description": "It is written in the stars. . . Four young children will help a herd of special horses to return from our world to Horando, their land of magic and peace. Banished, are a man called 'Carter' and his allies who want to rule Horando. Carter kidnaps the horses from their homeland and escapes to our world through a cave that opens every eight years. He imprisons the horses in a paddock with just enough food and water to keep them alive. The children live in the foothills of a mountain range with their parents and baby sister. Saffron, the eldest of the children has a passion for horses and yearns to care for them. Standing on the paddock fence watching them, she is sure that she hears the stallion speak first to one of the mares and then to her. Speaking directly to her mind, he tells her that she and her siblings are to help them get back to Horando where he and his herd are a crucial part of the Horando community. Saffron's two younger brothers and sister discover that they too have a role to play and soon find themselves working toward the goal of reaching Horando. They have two weeks to learn all they need to know. If they are not successful, peace will not return, good magic will fail and Carter and his evil allies will rule. There are three worlds in this story. The earth as we know it today, a world between earth and Horando where fairies live and of course Horando, where if the balance is correct a beautiful utopia exists. Well-known fairy tale characters such as, a Tooth Fairy, a Christmas Tree Fairy and a leprechaun, complete with a pot of gold with unicorns, dragons, and some characters perhaps never met before join the quest for peace. A challenging journey where the children must learn how to use the magic that they didn't know they had against the terrible magic that their enemies unleash. Through action-packed, humorous and sometimes emotional scenes, golden friendships are forged and surprises pop-up like daisies.",
  "genres": [],
  "author": "Steve Costello",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/16254528-horando---going-home"
}