{
  "title": "Pretty In Ink: Women Cartoonists 1896-2013",
  "description": "With the 1896 publication of Rose O'Neill's comic strip The Old Subscriber Calls, in Truth Magazine, American women entered the field of comics, and they never left it. But, you might not know that reading most of the comics histories out there. Trina Robbins has spent the last thirty years recording the accomplishments of a century of women cartoonists, and Pretty in Ink is her ultimate book, a revised, updated and rewritten history of women cartoonists, with more color illustrations than ever before, and with some startling new discoveries (such as a Native American woman cartoonist from the 1940s who was also a Corporal in the women's army, and the revelation that a cartoonist included in all of Robbins's previous histories was a man!) In the pages of Pretty in Ink you'll find new photos and correspondence from cartoonists Ethel Hays and Edwina Dumm, and the true story of Golden Age comic book star Lily Renee, as intriguing as the comics she drew. Although the comics profession was dominated by men, there were far more women working in the profession throughout the 20th century than other histories indicate, and they have flourished in the 21st. Robbins not only documents the increasing relevance of women throughout the 20th century, with mainstream creators such as Ramona Fradon and Dale Messick and alternative cartoonists such as Lynda Barry, Carol Tyler, and Phoebe Gloeckner, but the latest generation of women cartoonists--Megan Kelso, Cathy Malkasian, Linda Medley, and Lilli Carre, among many others. Robbins is the preeminent historian of women comic artists; forget her previous histories: Pretty in Ink is her most comprehensive volume to date.",
  "genres": [
    "Nonfiction",
    "History",
    "Comics",
    "Art",
    "Graphic Novels",
    "Feminism",
    "Biography"
  ],
  "author": "Trina Robbins",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/16255274-pretty-in-ink"
}