{
  "title": "Gabriel's Redemption",
  "description": "GABRIEL'S REDEMPTIONBook 1 of the Evan Gabriel TrilogyCan a disgraced Special Forces soldier find redemption, and will redemption cost him more than just his own life?North American Federation Navy Commander Evan Gabriel was dishonorably discharged after losing his covert team on a far off world called Eden. Now, he’s being offered an opportunity to command a new team, on a new world, with a new mission, but the true motives behind the mission are unclear.From the decaying Caribbean to politically-charged South America, from the slums of Mars to a tiny colony on a planet six hundred light years from Earth, Gabriel's Redemption follows the disgraced Commander Gabriel as he leads a Special Forces team to an ice-bound world. Their given to eradicate a drug cartel that is producing a highly-addictive stimulant brutally extracted from the bodies of the native inhabitants. Upon arriving, Gabriel and his team find the mission isn't exactly what it appeared to be, and that they weren't the only force dispatched to the planet.Gabriel’s Redemption is a near-future military science fiction story of a personal journey seen from the perspective of a soldier who has lost everything; one who desperately needs to redeem himself not only in his government’s eyes, but also his own. Interstellar action and political intrigue mix with one-on-one battles on the surface of a frozen planet in this exciting tale of salvation.Approximately 66,000 words.Also Gabriel's Return (Book 2), Gabriel's Revenge (Book 3), Gabriel's Journey (complete collection)REVIEWS OF GABRIEL'S REDEMPTION\"The author weaves a futuristic action-adventure story full of twists and turns. The world he creates is rich in detail and full of advanced technology.\" - D. Martin\"The detail of the world-building pulled me in and made everything utterly believable.\" - A.M. Simpson\"Well-thought-out universe with a tightly woven history, timeline, and culture.\" - G. Bonnet\"The author's imagination is amazing…he has knowledge of combat tactics, both with squads and hand-to-hand.\" - D. Hill\"Umstead has a way of putting you right into the scene, whether it be on a Jamaican beach, a rundown apartment or the icy surface of a distant planet.\" - C. Abel\"Umstead's writing is solid, as good as it gets, not only in the genre, but in general.\" - J. Levine\"Think Snake Pliskin. On Mars. With way cooler weapons. Umstead handles a complex plot and futuristic setting with flawless prose.\" - M. Pallante\"The character-rich story is non-stop adventure (think Jason Bourne travels the stars) and a completely immersive read.\" - R.B. Wood\"The editing is clean and doesn't have any glaring errors, or holes in the plot or dialogue that you often see in poorly done self-published work.\" - T. Moody\"Umstead deals with issues like honor, responsibility and human nature. While deep in thematic content the forward thrust of the story never stops. \" - P. TylerRECOGNITIONSSecond Round Qualifier in the Amazon Breakthrough Novel Contest!",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Military Fiction",
    "Space Opera",
    "Audiobook",
    "Military Science Fiction",
    "Science Fiction Fantasy"
  ],
  "author": "Steve Umstead",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/10697301-gabriel-s-redemption"
}