{
  "title": "Blind But Now I See: The Biography of Music Legend Doc Watson",
  "description": "\"If you're a dedicated Doc Watson fan, I think you would find this book an interesting read. It does get into some darker areas of Doc's life, such as Merle's death, but it also is a celebration of the man through the eyes and ears of those who know him.\" - Steve Carr, docsguitar.com\"Hard to believe it's been 50 years since Ralph Rinzler first introduced guitarist Doc Watson to the larger world. It's a fitting anniversary for the first book-length biography on Doc to appear. It was long overdue. This is a valuable, anecdotal work anyone interested in Doc's music and life will enjoy reading.\" - Bluegrass Unlimited\"This is a highly informative, fascinating biography of the great Doc Watson. What a life. It's a page-turner that will keep you up past your bedtime. Don't miss it.\" - The Inland Northwest Bluegrass Association\"A very well researched biography... The story of Doc Watson's life is one of tragedy and success. The author provides a vivid image of Doc's early childhood [and his] years with Merle, and gravely describes the impact of Merle's untimely death. The book is hard to put down...\" - Tom Duplissey, Bay Area Bluegrass Association\"Musicologists will appreciate the chapters on Doc's singing style and guitar work... Music fans will delight in the book as a whole, a splendid recounting of Doc Watson as man whose '...approach to folk music on a guitar was like Horowitz's approach to the piano...'\" - Gary Presley, The Internet Review of BooksAbout the AuthorKent Gustavson, PhD is a professor of writing, language and leadership at Stony Brook University, where he is currently the faculty director of the undergraduate Leadership & Development and Community Service Living Learning Centers. As the host of Sound Authors, he has interviewed hundreds of award-winning musicians and authors, and his music has been featured on National Public Radios All Songs Considered. He lives and works in Sound Beach, New York.",
  "genres": [
    "Music",
    "Biography",
    "Nonfiction"
  ],
  "author": "Kent Gustavson",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/16269522-blind-but-now-i-see"
}