{
  "title": "Kim",
  "description": "Kim by Rudyard Kipling is part of the Barnes & Noble Classics series, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of Barnes & Noble Classics:New introductions commissioned from today's top writers and scholarsBiographies of the authorsChronologies of contemporary historical, biographical, and cultural eventsFootnotes and endnotesSelective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the workComments by other famous authorsStudy questions to challenge the reader's viewpoints and expectationsBibliographies for further readingIndices & Glossaries, when appropriateAll editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. Barnes & Noble Classics pulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works. Rudyard Kipling has been attacked for championing British imperialism and celebrated for satirizing it. In fact, he did both. Nowhere does he express his own ambivalence more strongly than in Kim, his rousing adventure novel of a young man of many allegiances. Kimball O’Hara grows up an orphan in the walled city of Lahore, India. Deeply devoted to an old Tibetan lama but involved in a secret mission for the British, Kim struggles to weave the strands of his life into a single pattern. Charged with action and suspense, yet profoundly spiritual, Kim vividly expresses the sounds and smells, colors and characters, opulence and squalor of complex, contradictory India under British rule. Jeffrey Meyers, a Fellow of the Royal Society of Literature, has published forty-three books, including biographies of Ernest Hemingway, Robert Frost, D. H. Lawrence, Joseph Conrad, and George Orwell. He also wrote the introduction and notes to the Barnes & Noble Classics edition of Edith Wharton’s The House of Mirth.",
  "genres": [
    "Classics",
    "Fiction",
    "India",
    "Historical Fiction",
    "Adventure",
    "Literature",
    "Novels"
  ],
  "author": "Rudyard Kipling",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/10698.Kim"
}