{
  "title": "Ella: Princess, Saint And Martyr",
  "description": "Considered to have been the most beautiful princess in Europe, capable of arousing ‘profane passions’, Elisabeth of Hesse and by Rhine, or ‘Ella’ as she was known, was a  granddaughter of Queen Victoria and the daughter of Princess Alice of Great Britain and Grand Duke Louis of Hesse. A privileged, happy Victorian childhood was touched by tragedy not only with the early deaths of her youngest brother and sister but also that of her young mother. Close to Queen Victoria, Ella spent some of her happiest times in Britain. At 20, however, much against the wishes of her  grandmother, who despised everything Russian, Ella became engaged to Grand Duke Serge Alexandrovich, the authoritarian younger brother of Tsar Alexander III. It was at their wedding that her younger sister, Alix, formed a love match with the future Tsar Nicholas II; an event which not only  sealed the fate of both sisters, but that of the Imperial House of Romanov. But for these two marriages, the history of Russia might have been very different. With the assassination of her husband, Ella renounced society and, against considerable opposition, founded the first religious Order of its kind in Russia, working for the poor and destitute of Moscow. Though loved for her charitable works and pionerering achievements, Ella, like Nicholas, Alexandra, and fourteen members of their family, met a brutal death at the hands of the Bolsheviks. At the height of the Russian Revolution, she was taken captive to Siberia where, having been clubbed with rifle butts, she was hurled alive into a disused mineshaft and left to die  of her injuries. Later retrieved, her incorrupt body was eventually laid to rest on the Mount of Olives. She was subsequently canonized by the Russian Orthodox Church as the Holy Imperial Martyr Saint Elisabeth Romanova.",
  "genres": [
    "History",
    "Biography",
    "Russia",
    "Nonfiction",
    "Russian History",
    "Romanovs",
    "Historical"
  ],
  "author": "Christopher Warwick",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/162715.Ella"
}