{
  "title": "The Colossus of New York",
  "description": "In a dazzlingly original work of nonfiction, the award-winning novelist Colson Whitehead re-creates the exuberance, the chaos, the promise, and the heartbreak of New York. Here is a literary love song that will entrance anyone who has lived in—or spent time—in the greatest of American cities.\n\nA masterful evocation of the city that never sleeps, The Colossus of New York captures the city’s inner and outer landscapes in a series of vignettes, meditations, and personal memories. Colson Whitehead conveys with almost uncanny immediacy the feelings and thoughts of longtime residents and of newcomers who dream of making it their home; of those who have conquered its challenges; and of those who struggle against its cruelties. Whitehead’s style is as multilayered and multifarious as New York itself: Switching from third person, to first person, to second person, he weaves individual voices into a jazzy musical composition that perfectly reflects the way we experience the city. There is a funny, knowing riff on what it feels like to arrive in New York for the first time; a lyrical meditation on how the city is transformed by an unexpected rain shower; and a wry look at the ferocious battle that is commuting. The plaintive notes of the lonely and dispossessed resound in one passage, while another captures those magical moments when the city seems to be talking directly to you, inviting you to become one with its rhythms. The Colossus of New York is a remarkable portrait of life in the big city. Ambitious in scope, gemlike in its details, it is at once an unparalleled tribute to New York and the ideal introduction to one of the most exciting writers working today.From the Hardcover edition.",
  "genres": [
    "Nonfiction",
    "New York",
    "Essays",
    "Travel",
    "History",
    "Short Stories",
    "Audiobook"
  ],
  "author": "Colson Whitehead",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/16275.The_Colossus_of_New_York"
}