{
  "title": "A Coward in Modern China",
  "description": "A Coward in Modern China is a travel comedy, crime caper and romping adventure - based on the escapades of a willful rascal: bogus professor Robert Runworth. Its first line is:\"This is the story of a knowing scoundrel, and of what became of him.\"Set largely in contemporary Beijing, and partly in California, it is raunchy and mischievous in its plot and action. Yet the pages are also classically stylish; and historically detailed in their account of life in China today. The book is always entertaining, by its exotic setting and fascinating insights as much as its farcical humor.Here is a good old-fashioned yarn in the tradition of the Flashman series. Indeed, Runworth is of mixed American and British ancestry. The narrator's voice has both an up-to-date quality and the timeless feel of more classical literature. Its main character is a thoughtful villain, rather like Dexter.Therefore, like all truly entertaining literature and laugh-out-loud comedies, the 'A Coward in. . .' series is not for the politically correct. Written by British author, Jon Lee Junior, who has lived and taught in Asia for 12 years. Plot SummaryMain Plot : Professor Runworth was originally a trainee police officer with LAPD. However, he was fired and had to turn to teaching English abroad because he was an \"accidental and peripheral\" figure in the Rodney King incident. This book sees him twenty years on, and in need of settling down and getting married. As an ex-pat in China, the laughable scoundrel hopes for a few more un-threatening years of 'living like a lord' amongst the local poor. Professor Runworth has two more secrets. One is that he continues to (fraudulently) claim a disability benefit from the State of California, for an alleged back injury. The second is that although Robert Runworth is a big man physically - he is also a born coward. His bad luck, then, is that he always seems to find himself in confrontations which he'd rather avoid. At one point, the hefty and rotund westerner is faced down by a Chinese peasant with restricted growth syndrome.Sub-plot. As it happens, the college in which Runworth is teaching is involved in an illegal immigration scam for Chinese students entering the US. Of course, the rascally Professor Runworth would not hold any ethical issues with this. However, the campus mailman accidentally confuses some letters containing Runworth's disability checks from California with a package of forged US passports.Also, the Beijing Police and immigration authorities are suspicious that something is afoot in the college. When they look into Runworth's background, they realize that they can blackmail him with the threat of disclosing his past in America. Runworth has no choice but to help them, as a stoolie.The Plots Intertwine. The criminal gang which operate the illegal visa scheme decide to ice the bungling professor who has accidentally intercepted their mail.Runworth is caught three times by the gang of conmen. However, they underestimate his cowardliness and ability to run fast. The first time, he flees from an intended trap of a bar brawl. The second time, the gang capture Runworth and decide to feed him to a herd of racing pigs. But, to the shock of the slender Chinese, the overweight Westerner outruns both the pigs and his human pursuers. Indeed, one of the humorous themes of the book is how the (usually slim) Chinese see us (often overweight) westerners. The bogus Professor of English is an old-fashioned \"licentious rake\", and proud of the fact.",
  "genres": [],
  "author": "Jon Lee Junior",
  "average_rating": "3.24",
  "url": "https://www.goodreads.com/book/show/16276826-a-coward-in-modern-china"
}