{
  "title": "Fire Monks: Zen Mind Meets Wildfire at the Gates of Tassajara",
  "description": "The \"vivid\" and \"electrifying\" true story of how five monks saved the oldest Zen Buddhist monastery in the United States from wildfire ( San Francisco Chronicle ).When a massive wildfire surrounded Tassajara Zen Mountain Center, five monks risked their lives to save it. A gripping narrative as well as a portrait of the Zen path and the ways of wildfire, Fire Monks reveals what it means to meet a crisis with full presence of mind.Zen master and author of the classic Zen Mind, Beginner's Mind , Shunryu Suzuki Roshi established a monastery at Tassajara Hot Springs in 1967, drawn to the location's beauty, peace, and seclusion. Deep in the wilderness east of Big Sur, the center is connected to the outside world by a single unpaved road. The remoteness that makes it an oasis also makes it particularly vulnerable when disaster strikes. If fire entered the canyon, there would be no escape.More than two thousand wildfires, all started by a single lightning storm, blazed across the state of California in June 2008. With resources stretched thin, firefighters advised residents at Tassajara to evacuate early. Most did. A small crew stayed behind, preparing to protect the monastery when the fire arrived.But nothing could have prepared them for what came next. A treacherous shift in weather conditions prompted a final order to evacuate everyone, including all firefighters. As they caravanned up the road, five senior monks made the risky decision to turn back. Relying on their Zen training, they were able to remain in the moment and do the seemingly impossible-to greet the fire not as an enemy to defeat, but as a friend to guide.Fire Monks pivots on the kind of moment some seek and some run from, when life and death hang in simultaneous view. Novices in fire but experts in readiness, the Tassajara monks summoned both intuition and wisdom to face crisis with startling clarity. The result is a profound lesson in the art of living.",
  "genres": [
    "Nonfiction",
    "History",
    "Spirituality",
    "Buddhism",
    "Religion",
    "Philosophy",
    "Biography"
  ],
  "author": "Colleen Morton Busch",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/10699029-fire-monks"
}