{
  "title": "If the King Only Knew: Seditious Speech in the Reign of Louis XV",
  "description": "In May 1758, a bailiff named Jean Moriceau de La Motte was arrested for carrying seditious flyers and uttering mauvais discours against Louis XV. When he was questioned at the Bastille over the next several months, La Motte was unequivocal in his loyalty to the king, but his insistence failed to convince the police and probably hurt his case more than would have a simple admission of guilt. He was sentenced to be hanged on the Place de Grève after making his amends on the steps of Nôtre Dame. His punishment seemed severe, if not unwarranted, to an increasingly literate and informed Parisian populace that found censorship hard to support, either theoretically or practically, in the face of intellectual and cultural changes wrought by the Enlightenment. By looking at the police files for cases such as La Motte's, Lisa Jane Graham uncovers fascinating clues to the conflicting attitudes of eighteenth-century French subjects toward royal authority. Individuals like La Motte often failed to see the subversive implications of their words and protested their fidelity to the king in impassioned language. The crown's inability or refusal to accommodate a wider range of political speech turned the opinions of these indivduals into bitter grievances and sometimes crimes. Ironically, the decision to repress seditious speech not only alienated essentially loyal French men and women; by marking them as opponents of monarchical authority, it strengthened their sense of their own autonomy and legitimacy as social actors. The complex and surprising web of motivations lying at the heart of such loyalty, as revealed in the police files Graham examines, undermines some deeply rooted assumptions about the Enlightenment and its links to modernity. Graham's book presents the eighteenth century as the critical historical moment for studying how the premodern virtue of loyalty gave way to new ideas and vocabularies about the relationship between individuals and government. If the King Only Knew attests to the powerful emotional and ideological conflicts this difficult transition unleashed.",
  "genres": [
    "Nonfiction",
    "History"
  ],
  "author": "Lisa Jane Graham",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/1627832.If_the_King_Only_Knew"
}