{
  "title": "Be There Now: Travel Stories from Around the World",
  "description": "Be There Now is a collection of true travel stories featuring twenty-two contributors who share adventures and escapades from around the world. The stories include the tale of an amateurish kidnapping in Nicaragua in a story that could have been told by Woody Allen, and a David Sedaris-esque story of two ships passing in a Paris art supply store. Existential stories from a man lost on the flooded Amazon River at night, and from a woman who encounters a grizzly—in the same area where her father and stepmother were killed by a bear. Insightful stories about a woman’s spiritual journey in Peru (complete with hallucinogens!), and about a female journalist’s friendship with an Iraqi translator in Syria. And stories about endangered species in exotic locales, including helping a sea turtle lay its eggs on a Costa Rican beach, and taking a blind man to visit the mountain gorillas in Rwanda.Be There Now is travel writing at its most authentic—real people sharing real stories of awe and insight, fear and laughter, humility and humanity as they explore the world around us and seek footholds on their own inner journeys. In a world that often demands that we “be here now,” it is nice to take a break, daydream, and “be there now” with thoughtful people who take us with them on journeys that lead to inspiration, insight, humor, and deeper meaning. Be There Now is part of a series of anthologies of creative nonfiction on various topics from Dream of Things, which strives to publish anthologies that fill the gap between popular collections that can be regarded as \"short and sweet,\" and the Best American Essays series, which tend to be longer-form. The goal for Dream of Things anthologies is to be not short and sweet, but short and deep.",
  "genres": [
    "Travel",
    "Essays",
    "Nonfiction",
    "Adventure",
    "Anthologies"
  ],
  "author": "Mike O'Mary",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/16278402-be-there-now"
}