{
  "title": "I Kiss Your Hands Many Times: Hearts, Souls, and Wars in Hungary",
  "description": "A magnificent wartime love story about the forces that brought the author’s parents together and those that nearly drove them apart Marianne Szegedy-Maszák’s parents, Hanna and Aladár, met and fell in love in Budapest in 1940. He was a rising star in the foreign ministry—a vocal anti-Fascist who was in talks with the Allies when he was arrested and sent to Dachau. She was the granddaughter of Manfred Weiss, the industrialist patriarch of an aristocratic Jewish family that owned factories, were patrons of intellectuals and artists, and entertained dignitaries at their baronial estates. Though many in the family had converted to Catholicism decades earlier, when the Germans invaded Hungary in March 1944, they were forced into hiding. In a secret and controversial deal brokered with Heinrich Himmler, the family turned over their vast holdings in exchange for their safe passage to Portugal. Aladár survived Dachau, a fragile and anxious version of himself. After nearly two years without contact, he located Hanna and wrote her a letter that warned that he was not the man she’d last seen, but he was still in love with her. After months of waiting for visas and transit, she finally arrived in a devastated Budapest in December 1945, where at last they were wed. Framed by a cache of letters written between 1940 and 1947, Szegedy-Maszák’s family memoir tells the story, at once intimate and epic, of the complicated relationship Hungary had with its Jewish population—the moments of glorious humanism that stood apart from its history of anti-Semitism—and with the rest of the world. She resurrects in riveting detail a lost world of splendor and carefully limns the moral struggles that history exacted—from a country and its individuals. Praise for I Kiss Your Hands Many Times “ I Kiss Your Hand Many Times is the sweeping story of Marianne Szegedy-Maszák’s family in pre– and post–World War II Europe, capturing the many ways the struggles of that period shaped her family for years to come. But most of all it is a beautiful love story, charting her parents’ devotion in one of history’s darkest hours.” —Arianna Huffington, president and editor-in-chief, the Huffington Post Media Group “In this panoramic and gripping narrative of a vanished world of great wealth and power, Marianne Szegedy-Maszák restores an important missing chapter of European, Hungarian, and Holocaust history.” —Kati Marton, author of A Love Story and Enemies of the My Family’s Journey to America“How many times can a heart be broken? Hungarians know, Marianne Szegedy-Maszák’s family more than most. History has broken theirs again and again. This is the story of that violence, told by the daughter of an extraordinary man and extraordinary woman who refused to surrender to it. Every perfectly chosen word is as it happened. So brace yourself. Truth can break hearts, too.” —Robert Sam Anson, author of War A Young Reporter in Indochina“This family memoir is everything you could wish for in the the story of a fascinating family that illuminates the historical time it lived through. . . . Informative and fascinating in every way, [ I Kiss Your Hands Many Times ] is a great introduction to World War II Hungary and a moving tale of personal relationships in a time of great duress.” — Booklist (starred review)",
  "genres": [
    "Nonfiction",
    "History",
    "Memoir",
    "Hungary",
    "Biography",
    "Holocaust",
    "World War II"
  ],
  "author": "Marianne Szegedy-Maszak",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/16280080-i-kiss-your-hands-many-times"
}