{
  "title": "New Halem Tales Secrets",
  "description": "Nestled around a bay at the base of a mountain on the Oregon Coast, New Halem is a strangely exciting place created by a group of writers who live in the Pacific Northwest. Each tale, set in this quirky community, gives a peek into the lives and secrets of its townspeople.William Cooke, new publisher of the FishWrap Bugle, moved to town to escape the attention that comes with winning a mega lottery. A new romantic relationship is complicated by his secret financing of a controversial development. Don't Let Them Know by Charles ThompsonThe Parking Lot Prophet, a mystic, lives in his truck and camper in a park by the sea. He is pulled into the mystery of Miss Linny Jones and a pair of blue jeans that fell out of the sky into her dahlia field. They appear to have a life of their own. Those Demon Denims! by Catherine KigerlAdele Delacruz, a young widow with a daughter, moves to New Halem to start over. She buys a bookstore and convinces her brother-in-law, Drew, and his partner, Daniel, to open a restaurant. They struggle to fit into small town life that wants to keep their family relationships a secret.In Which Relationships Are Key by Gwen Van Hout KnechtelKevin McLeod, more ham than actor, detours on his way to a new gig in New Halem. He stops at the old town of Hemlock where years ago an erotic liaison took him back in time to a strange cave. After leaving Hemlock, he is pulled into a violent past with a hostile shaman, pirates and treasure. The Cave by L. C. McgeeSheriff Astra Billings wants to know who she is. Her mother claims she was fathered by an asteroid that crashed through the bedroom roof. Astra's budding romance with a handsome newcomer, Matthew, is threatened by deadly secrets that follow him from his Kentucky past.The Asteroid's Daughter and the Serpent Handler's Son- a novella by Kate E ThompsonThere are eight other stories about New Halem folks. You'll let to know Glenda Gadabout, the society editor at the FishWrap Bugle. There's a fortune teller in town, a panty bandit, an alien watcher and more. Everyone in New Halem is looking for friendship, solace, a fresh start, truth, forgiveness and true love.A whimsical look at love and friendship, truth and forgiveness.",
  "genres": [],
  "author": "Kate E. Thompson",
  "average_rating": "4.75",
  "url": "https://www.goodreads.com/book/show/16280421-new-halem-tales-secrets"
}