{
  "title": "State of the World 2013: Is Sustainability Still Possible?",
  "description": "Every day, we are presented with a range of “sustainable” products and activities—from “green” cleaning supplies to carbon offsets—but with so much labeled as “sustainable,” the term has become essentially sustainababble, at best indicating a practice or product slightly less damaging than the conventional alternative. Is it time to abandon the concept altogether, or can we find an accurate way to measure sustainability? If so, how can we achieve it? And if not, how can we best prepare for the coming ecological decline? In the latest edition of Worldwatch Institute’s State of the World series, scientists, policy experts, and thought leaders tackle these questions, attempting to restore meaning to sustainability as more than just a marketing tool. In State of the World 2013: Is Sustainability Still Possible?, experts define clear sustainability metrics and examine various policies and perspectives, including geoengineering, corporate transformation, and changes in agricultural policy, that could put us on the path to prosperity without diminishing the well-being of future generations. If these approaches fall short, the final chapters explore ways to prepare for drastic environmental change and resource depletion, such as strengthening democracy and societal resilience, protecting cultural heritage, and dealing with increased conflict and migration flows.State of the World 2013 cuts through the rhetoric surrounding sustainability, offering a broad and realistic look at how close we are to fulfilling it today and which practices and policies will steer us in the right direction. This book will be especially useful for policymakers, environmental nonprofits, and students of environmental studies, sustainability, or economics.",
  "genres": [
    "Environment",
    "Climate Change",
    "Economics",
    "Nonfiction",
    "Ecology",
    "Sustainability",
    "Political Science"
  ],
  "author": "The Worldwatch Institute",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/16280721-state-of-the-world-2013"
}