{
  "title": "Twenty Trillion Leagues Under The Sea",
  "description": "It is 1955. Funded, in part, by a reclusive Swiss millionaire and working -- it is claimed -- from Nemo's actual blueprints discovered in India, the French Navy build a replica Nautilus. Crewed with sailors and scientists, and commanded by the short-tempered Captain Mason, it is launched in great secrecy from Bayonne. Almost as soon as it is underwater, however, and having passed beyond the Continental Shelf, an accident (or sabotage!) sends it plummeting towards the ocean floor. The crew desperately attempt repairs as the pressure builds, threatening to crush the entire craft. But then something very strange happens: despite the fact that they are still descending, the pressure equalises. The descent continues for days; soon passing the 5000m depth that ought to mark the bottom of the ocean. As days turn to weeks, the mystery of their plight only grows deeper: for they pass hundreds and soon thousands kilometres of 'depth' with no ill effects. Other constraints press upon them: particularly the need to find food, and conserve fuel. Pressures amongst the all-male crew intensify as well, approaching breaking point as weeks pass, and the depth becomes measurable in millions of kilometres. Are they dead, trapped in an eternal descent to Hell? Have they passed through some portal into a realm of infinite water? Or have they somehow stumbled upon -- or been deliberately lead to, via the mysterious Indian blueprint -- some truth about the world too profound even to be measured in trillions?Then, when they think all hope is lost, and as they approach the trillionth kilometre of depth, they see light below them ...",
  "genres": [
    "Science Fiction",
    "Fantasy",
    "Fiction",
    "Horror",
    "Adventure",
    "Steampunk",
    "Historical Fiction"
  ],
  "author": "Adam Roberts",
  "average_rating": "3.13",
  "url": "https://www.goodreads.com/book/show/16281371-twenty-trillion-leagues-under-the-sea"
}