{
  "title": "العالم الإسلامي و الإستعمار",
  "description": "نبذة النيل والفرات:كان العالم الإسلامي وحدة لا تتجزأ قبل الغزو الاستعماري الغربي، قلما تنوعت حكوماته ودوله، فقد كانت تجمعه وحدة فكر، ووحدة شعور. ولقد مرّ العالم الإسلامي بمرحلة ضعف، وتخلف؛ شأنه في ذلك شأن كل أمة، وكل حضارة حين تمر بمرحلة بعد مرحلة، قوة بعض ضعف، وضعف بعد قوة؛ سنة الوجود وناموس الحياة، ولكن العالم الإسلامي لم يلبث أن استيقظ بقوته الذ1اتية، استيقظ من داخل أعماقه، وبعامل أساسي قائم في كيانه، قادر على إعطائه عامل القوة بعد الضعف مستمداً إياه من مقومات فكره الأساسية، ولو كانت تلك اليقظة سابقة لما حاول الغربيون أن يدعوا أنهم مصدر لذلك، سابقاً الثورة الفرنسية بسنوات طويلة، ومتقدماً على الحملة الفرنسية أيضاً، فقد انبثق من قلب الجزيرة العربية منذ منتصف القرن الثامن عشر تقريباً، ثم عمّ الآفاق إلى غير ما حد، مضت هذه اليقظة إليه، وإلى كل طريق مضى فيه الاستعمار إلى غايته في السيطرة على العالم الإسلامي، وتمزيق وحدة هذه الكتلة الجامعة، التي يربطها فكر عميق المدى، وشعور دقيق الأثر، وكلاهما عميق الجذور، يمتد إلى يوم بزوغ ضوء الإسلام في القرن السابع الميلادي، ومنذ ذلك الوقت، وإلى اليوم، لم يقع أمر في تاريخ العالم أو يحدث في حركة الإنسانية؛ إلا وكان وثيق الاتصال بالإسلام، والعالم الإسلامي، مؤثر فيه أو متأثر به، فقد فرض الإسلام كقوة عقائدية وسياسية واجتماعية مكانه على هذا الكوكب، ولذلك فقد كان ذلك الصدام بين العالم الإسلامي، والاستعمار أمراً خطيراً بعيد المدى في تاريخ الإنسانية، وتاريخ الإسلام نفسه.وقد واجه العرب المسلمون ذلك ببسالة وصمود، وتعلموا من دروس التاريخ كيف كان النزاع والخلاف الداخلي مصدراً لماذ أصابهم من كوراث، وعرفوا أن أزمة العالم الإسلامي المعاصر إنما تصدر من حيث هو واقع تحت النفوذ الاستعماري، وما يزال العالم الإسلامي يتمخض عن أوضاع جديدة تقدمية في الاقتصاد والسياسة والاجتماع، وقوامها الوحدة والتحرر والقوة والعدل الاجتماعي وما تزال عوامل الوحدة والأخوة تعمق وتتسع حتى يعود العالم الإسلامي مرة أخرى إلى أصالته فكراً ومجتمعاً؛ وحدة لا تتجزأ، هي وحدة فكر، ووحدة شعور.وبعد فإن هذا الكتاب إنما يمثل محاولة التي يجري القلم تصويرها في تلك الصفحات، في دراسة للعالم الإسلامي والاستعمار السياسي والاجتماعي والثقافي؛ منذ أوائل اليقظة حتى أواخر الحرب العالمية الثانية.",
  "genres": [],
  "author": "أنور الجندي",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/16281471"
}