{
  "title": "Assimilate",
  "description": "I've come to like people, the ones I've gotten to know so far at Buena Vista High School. I even love some of them. This is probably what made the killing possible for me.What I feel bad about now is not the killing I did, so much as the killing I didn't do. My family and friends and everyone in our society considers us heroes- me, Nick and Andy. And I would wholeheartedly agree with the Nick and Andy part. But not me. I have failed miserably, and only I know it.This weighs on me, of course, and I think it's only a matter of time before I'll have to come clean- expose myself for the coward I really am, and for the danger I've placed us all in. Because choosing not to act is a choice all its own, and it's the one I made at the time. I accept that- I do. I own it. So now if the world ends for humankind, any or all, it will be me who is to blame. -Excerpt from ASSIMILATE, by Emily Jack Hayden ©2012***Sixteen-year-old Tan Michaels is pumped to have been chosen for his new assignment: to assimilate with students at the local high school. Tan's assignment is the first major step in his secluded society's overall plan to integrate with their local California community. His genetically enhanced mind and body make the transition easy at first- Tan breezes through his homework and stuns the judges and onlookers at his first gymnastics meet. He's also managed to capture the attention of Paisley, an artsy barista he discovered in history class. He feels less fortunate to have also captured the attention of Whitney, the girl his new friends say he should want. When Tan's twin sister goes missing, he's ordered to put his assignment on hold along with his still-new relationship with Paisley. In the search for his sister, Tan secretly discovers some mind blowing information. Has the society's long-established goal of complete assimilation morphed into something much more sinister? When his new high school friend, Cole is found dead, Tan must face the possibility that the high commanders in his own beloved society may have had something to do with it. With forty-eight hours to figure it all out, Tan and his posse find themselves faced with choices not merely of life and death, but of who lives and who dies. And the rot at the top may be closer than Tan would ever have imagined.ASSIMILATE is available now in Kindle version on Amazon, and will be released in paperback December 24th 2012.For more info and sneak peeks from the book, go to www.emilyjackhayden.com",
  "genres": [
    "Dystopia",
    "Young Adult",
    "Science Fiction",
    "Fantasy",
    "Fiction"
  ],
  "author": "Emily Jack Hayden",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/16281696-assimilate"
}