{
  "title": "Who Has the Heart?",
  "description": "**This Novel is a Clean, New Adult Contemporary Romance. Due to some mature content and adult situations, I would recommend this book to ages 16 and up.**Who Has the Heart? features three separate but intertwined romantic tales. Rob Walker, a college athlete, Bridgett LeMond, a reclusive author, and Duncan Adams, a British actor, share in their own words their personal stories of romance.Rob Walker - My plan was to avoid women and lay low my senior year. I just wanted to focus on winning a basketball tournament, graduating, and getting drafted into the NBA. But as the saying goes, as soon as you stop trying to meet someone, you’ll meet someone, because out of the blue I met Beth LeMond. It’s weird, but ever since, my life is looking like the complex story-line in The Tale Trilogy novels and it’s killing me! All I need now is patience, as I wait to see how my ‘Tale of Romance’ will end.Bridgett LeMond - I secretly made a fortune writing The Tale Trilogy under a pen name. But even with all my success, I find myself struggling with insecurities. I finally managed to leave my old boyfriend and get a place of my own, because I don’t mind living alone. However, now it seems my new good-looking neighbor has taken an interest in me. Yeah right! I don’t believe it for a second! Why would a hot professional quarterback be interested in me? I know for a fact relationships in real life can never live up to the romantic story found in my novel.Duncan Adams - I was a completely unknown actor when I was discovered in a tiny theatre in London and offered the lead role in the Hollywood blockbuster series entitled, The Tale Trilogy. Once I moved to Los Angeles and filming began, I've become a huge star, and now my life is absolute madness! For instance, after the break-up with my beautiful co-star, my Director had the gall to arrange these ghastly public appearances for me. Why isn't it obvious to the Tale fans that this is all a publicity stunt? What a load of rubbish! Thank goodness my new personal assistant isn't a complete nutter. She has introduced me to a talented musical composer and as a result I have found my true passion in life. Now I have to find the faith to follow my heart.When the three come together on the live television morning program, The Lucinda Michaels Show, secrets are revealed and second chances are offered in the surprising conclusion that will leave readers wondering: Who Has the Heart?",
  "genres": [
    "Romance",
    "New Adult"
  ],
  "author": "Tania Eddingsaas",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/16282077-who-has-the-heart"
}