{
  "title": "Coyote Tales: Stories of Horror",
  "description": "Coyote - the trickster, thief, warrior, wizard, coward, clown, and savior - has come to call in these 10 stories set in the modern Navajo Nation.\"Reservation Monsters\": Coyote teaches a young boy with a monster under his bed that most monsters are far worse than the ones that go bump in the night.\"The Dreaming Way\": After Coyote reveals her hidden powers, a teenager must decide whether she will use them for good or evil.\"Love Like Thunder\": After a school shooting, a strange creature sets up camp by the local cemetery, where he visits the dead so that he may live a few days longer.\"The Speed of Lightning\": Shaun Sallabye, a famous high school runner, gets a talent boost from Coyote that will push him to his limits - if it doesn't break him first.\"The Shooting Way\": Jesse Benally doesn't believe in witchcraft. When his aunt contracts a strange sickness, he meets with a medicine man who teaches him that native witches don't care what he believes.\"Black Body\": Fernando Gishi waits for his father to get out of prison, but when he finds the body of a dead girl in the desert, he must rely on his friends as a dark force reaches out to make a deal he can't refuse.\"Changing Woman\": Nellie Begay, a former combat nurse, is missing her daughter. When a supernatural force might know where she is, Nellie must find the strength to heal herself and talk to Changing Woman.\"The Darkest Roots Run Deep\": Ronnie Long, a struggling maintenance worker, must look to his girlfriend and their unborn child in order to forgive the biggest mistake of his life - before it kills him.\"Remember by Your Scars\": Jane Lewis is a white nurse who fled the East coast and abusive relationships. When her latest ends, a new man walks into her life and reopens all the scars she's tried to hide.\"The Bathroom People\": LeCaine Keeyahani hates working fast food but he hates the idea of leaving the Reservation even more. When his dying grandfather asks for help ending his life with dignity, only the Bathroom People hold the answer to LeCaine's future.",
  "genres": [
    "Horror",
    "Short Stories",
    "Audiobook",
    "Fiction"
  ],
  "author": "Jim Bihyeh",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/16282072-coyote-tales"
}