{
  "title": "Sloughing Off the Rot",
  "description": "John the Revelator awakens in a cave with no memory of his prior life. Guided along El Camino de la Muerte by a demented madman and a philosophical giant, John sets out on a quest to fill in his blank slate and slough off the rot of his soul. Part dark comedy road trip, part spiritual quest, and part horror story, Sloughing Off the Rot is literary alchemy about John’s transformation from repugnant wretch to reluctant hero.PRAISE FOR SLOUGHING OFF THE ROT“Once again, Uncle Lance has asked us to pull his finger. But this time it doesn’t go the way we think. Carbuncle is still the cunning linguist we love and loathe, using blood and body fluid with a painter’s precision. This time around, however, his canvas is rich with biblical allusions, dark satire and one unreal road trip. To read Sloughing Off the Rot is to watch of one of America’s most original humorists growing up, kicking and armpit-farting the whole way.”-Patrick Wensink, author of BROKEN PIANO FOR PRESIDENT“Woof.”-Idjit Galoot, fictional basset hound “Carbuncle is a writer who gets you in the gut. He writes with a raw energy that tells it like it is, warts and all. In Sloughing Off the Rot, Carbuncle has conjured a fascinating vision, an epic, Biblical quest for identity and meaning. His books are obsessed with our physical, bodily nature, but here he’s managed to fuse the physical with the spiritual, seeking out answers to the big questions. His journey is worth taking.”-David David Katzman, author of DEATH BY ZAMBONI and A GREATER MONSTER“Carbuncle's writing has always infused the grotesque underbelly of our world with an inherent beauty only a careful eye can perceive, and while Sloughing Off the Rot continues this trend, giving us more of what we've come to know and love in his previous works, Carbuncle turns over a new leaf in his latest, a tale of self-discovery rich with metaphor in the vein of Frank L. Baum & Lewis Carroll . . . then he bursts that vein, infecting the reader with his own unique brand of fantasy. This is not to be missed!”-Kirk Jones, author of UNCLE SAM’S CARNIVAL OF COPULATING INANIMALS “Another masterful and shocking story. Lance Carbuncle is a genius. Lance Carbuncle could write about rubber band ligation of hemorrhoids and it would put all other written works to shame. Lance Carbuncle could train monkeys in the deadly art of Krav Maga. Lance Carbuncle is the King of All Authors. I want to ride him, rim him, and give him a reach around with both hands, all at the same time. I love this brilliant man.”-Lance Carbuncle, author of SLOUGHING OFF THE ROT“Lance Carbuncle channels the Book of Revelation, Carlos Castaneda, Cormac McCarthy and Fat Elvis in his rudest, weirdest, richest book yet.”Mykle Hansen, author of HELP! A BEAR IS EATING ME!",
  "genres": [
    "Bizarro Fiction",
    "Horror",
    "Fantasy",
    "Adult",
    "Fiction",
    "Humor"
  ],
  "author": "Lance Carbuncle",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/16282752-sloughing-off-the-rot"
}