{
  "title": "Living Like a Runaway",
  "description": "“Heavy metal’s leading female rocker (Rolling Stone) bares all, opening up about the Runaways, the glory days of the punk and hard-rock scenes, and the highs and lows of her trailblazing careerWielding her signature black guitar, Lita Ford shredded stereotypes of female musicians throughout the 1970s and ‘80s. Then followed more than a decade of silence and darkness—until rock and roll repaid the debt it owed this pioneer, helped Lita reclaim her soul, and restored the Queen of Metal to her throne.In 1975, Lita Ford left home at age sixteen to join the world’s first major all-female rock group, the Runaways—a “pioneering band” (New York Times) that became the subject of a Hollywood movie starring Kristen Stewart ad Dakota Fanning. Lita went on to become “heavy rock’s first female guitar hero” (Washington Post), a platinum-selling solo star who shared the bill with the Ramones, Van Halen, Motley Crue, Bon Jovi, Def Leppard, Poison, and others and who gave Ozzy Osbourne his first Top 10 hit. She was a bare-ass, leather-clad babe whose hair was bigger and whose guitar licks were hotter than any of the guys’.Hailed by Elle as “one of the greatest female electric guitar players to ever pick up the instrument,” Lita spurred the meteoric rise of Joan Jett, Cherie Currie, and the rest of the Runaways. Her phenomenal talent on the fret board also carried her to tremendous individual success after the group’s 1979 disbandment, when she established herself as a “legendary metal icon” (Guitar World) and a fixture of the 1980s music scene who held her own after hours with Nikki Sixx, Jon Bon Jovi, Eddie Van Halen, Tommy Lee, Motorhead’s Lemmy, Black Sabbath’s Tony Iommi (to whom she was engaged), and others.Featuring a foreword by Dee Snider, Living Like a Runaway also provides never-before-told details of Lita’s dramatic personal story. For Lita, life as a woman in the male-dominated rock scene was never easy, a constant battle with the music establishment. But then, at a low point in her career, came a tumultuous marriage that left her feeling trapped, isolated from the rock-and-roll scene for more than a decade, and—most tragically—alienated from her two sons. And yet, after a dramatic and emotional personal odyssey, Lita picked up her guitar and stormed back to the stage. As Guitar Player hailed in 2014 when they inducted her into their hall of fame of guitar greats: “She is as badass as ever.”Fearless, revealing, and compulsively readable, Lita Ford’s Living Like a Runaway is the long-awaited memoir from one of rock’s greatest pioneers—and fiercest survivors.",
  "genres": [
    "Music",
    "Nonfiction",
    "Memoir",
    "Biography",
    "Autobiography",
    "Rock N Roll",
    "Biography Memoir"
  ],
  "author": "Lita Ford",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/16283552-living-like-a-runaway"
}