{
  "title": "Fifty Shades of Jungle Fever",
  "description": "FIFTY SHADES OF GREY to the second power meets Keisha and Jada from the Block.If you've wondered how an ethnic girl from the hood might've handled an arrangement with an experienced white Dominant, this is your book. If you'd like to see the sexiest TWIN DOMS in a contemporary romance series in interracial relationships, this is most definitely your book.Aspiring recording studio owners, Keisha Beale and Jada Jameson, score a rare meeting with venture capitalist Tristan White, and are thrust into a world beyond their wildest imaginations.Street-wise Keisha is startled to realize she wants this rich white man, despite the certainty that he is out of her league. Unable to resist Keisha's sassy, irreverent, and fiercely independent spirit, Tristan knew from day one he wanted her, too--as his first African American submissive.Upper Class Jada of the Springfield Jamesons has traveled in almost the same circles as the White brothers, and has had a secret crush on Nathan White, the point guard for the Chicago Bulls, for quite some time.Both brothers have succumbed to jungle fever, and want a little coffee in their cream.Lured by Tristan White and his offer of fronting the capital for her business in exchange for kinky sex, Keisha finds herself with no other option. Keisha is also tortured by a demons from her past, and her inability to come to terms with them threatens to undermine the future of her business and her tumultuous, unconventional relationship with Tristan White.Erotic, amusing, and in places hilarious, the Ghetto Girl Erotica Trilogy is a parody with a unique take on a Fifty Shades-type story that will take you even further into the BDSM world, and promises to make the vanilla original Fifty Shades Blacker.",
  "genres": [
    "BDSM",
    "Romance",
    "Interracial Romance",
    "Erotica",
    "Contemporary Romance",
    "Adult",
    "Contemporary"
  ],
  "author": "L.V. Lewis",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/16284988-fifty-shades-of-jungle-fever"
}