{
  "title": "The Good Life: Truths That Last in Times of Need",
  "description": "What do I need to be good?How can I truly be happy?To whom or to what dare I give myultimate loyalty, my deepest love,my full and total service? Out of allthis moral discourse and analysis,what can I find and use to make a life,and not just a living?-from the Introduction After more than thirty years as minister at Harvard University, Peter J. Gomes has given his share of advice to the best and the brightest as they set sail into the world. Yet he has found that even these highly privileged students often run aground on the harsh realities of a life based in values that lead to ruin. The Good Life is his distillation of years of observation and insight into what is wrong and how we can all set our minds and hearts on higher things. Gomes begins with the contemporary crisis of moral education in higher learning and subverts the prevalent assertion that the youth of today's colleges and universities are spoiled and lacking in the capacity and desire to become good people and good citizens. Impressed by the sharp moral curiosity of young people today, as well as their strong desire to know, to be, and to do good, Gomes sets out to reclaim the tradition of virtue he believes can make this the greatest generation . In this search for a new nobility, he distinguishes between the plausible lies that our culture tells us about the good life and the fantastic truths that alone can bring true and abiding happiness, working through each of the unquestioned values of modern life. Along the way he redefines the central elements of the pursuit of the good life (failure, success, discipline, and freedom), then offers a new presentation of the four cardinal virtues (prudence, justice, temperance, and fortitude), and finally concludes with a passionate argument for the three theological virtues of faith, hope, and love. A challenge to educators, civic leaders, parents, and the youth who hold our collective future, The Good Life is a timely and important book about the recovery of moral knowledge and the choices we must make in order to live truly well.",
  "genres": [
    "Religion",
    "Nonfiction",
    "Theology",
    "Faith",
    "Spirituality",
    "Christian"
  ],
  "author": "Peter J. Gomes",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/1628801.The_Good_Life"
}