{
  "title": "Shadows in the Twilight: Conversations with a Shaman",
  "description": "When W. L. Ham approaches the Nagual Lujan Matus for insight into enigmatic events that have marked his awareness, what he learns revolutionizes everything he thought he knew. Realizing he has found an authentic guide, Bill enters into an intensive apprenticeship and directly begins to experience our living matrix as the multiplex of lucid interactivity that it truly is.Like countless others, Bill had been galvanized when concepts like the energy double, dreaming awareness and first and second attention were introduced in the 1960s by Carlos Castaneda. Exploring these fascinating propositions in his own waking and dreaming life, he found himself faced with discoveries and challenges utterly unaccounted for by conventional definitions of reality.What began as a faithful documenting of question and answer sessions has resulted in a most extraordinary manual on the crucial yet little understood subject of reclaiming our transdimensional sovereignty. A friendly flow of dialogue belies the gravity of this material, as Lujan deftly elucidates the very fabric of existence with humble yet compelling authority.These are no second-hand sorcery tales but genuine revelations from a seer bound by his inevitability to communicate what he knows. Describing the innermost workings of the holographic universe with a rare precision, these teachings decode riddles of perception that have long been surrounded with confusion, providing a luminous bridge to our true potential as human beings. Although what Lujan reveals is sometimes alarming, this is tempered by his multifaceted affirmation that the key to freedom lies in sincerely applying ourselves to the moment that continually escapes us; guided only by that most precious instrument of divination, our heart.",
  "genres": [
    "Audiobook"
  ],
  "author": "Lujan Matus",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/16289222-shadows-in-the-twilight"
}