{
  "title": "Nothing is Right",
  "description": "Other people terrify Clay Dillon. He's never had a friend before, even though his mother runs a daycare out of their house. Now, it's time for him to face the first grade. Will he finally figure out what it is about other people that he does not understand, or will he hide himself in is schoolwork? Will he stand out as one of the few first graders that can already read adult novels, or will he camouflage his abilities so that he can avoid the extra attention? Clay wants desperately for other people to realize that he is valuable, but every time they talk to him, it hurts.\"Nothing is Right\" is a novel about not being able to be called autistic. Set in 1988, five years before Aspergers Syndrome was formally recognized, it follows Clay through his first year at school. Through his eyes, we can navigate a special education screening system that knows he is an anomaly but that lacks language to describe him. We can also follow his attempts to find a space for himself, and we share his frustration when he fails to find ways to communicate. Most importantly, though, we can see the world through his eyes. This book does not shy away from blow-by-blow descriptions of sensory overload, self-injury (and the shame of hiding it), and the sheer panic of finding yourself suddenly and completely incapable of speaking.From the author's afterword:\"It's not easy, learning that you had a major developmental disorder that somehow slipped under the radar for years and years. The fact is, though, that they did not have the vocabulary or the support resources that are available today. When I was growing up, it was still assumed that autism was partially defined by cognitive deficits......it impossible for Clay to understand the differences between himself and others. Despite his high IQ and scholastic performance, and despite the fact that he knows something is different, he will always need someone else to explain to him what is different......It [the story] is the intersection of a family history of disorder, a socioeconomic niche that is always plagued by problems accessing support programs, and a moment in time when science and technology were almost, but not quite, capable of rising to the challenge of kids like Clay.\"Approximate Length: 65,000 words",
  "genres": [
    "Autistic Spectrum Disorder",
    "Fiction",
    "Disability"
  ],
  "author": "Michael Scott Monje Jr.",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/16291089-nothing-is-right"
}