{
  "title": "Excessive Entanglement",
  "description": "Praise for Excessive Entanglement:\"d’Arbeloff’s Excessive Entanglement is a prophetic political thriller. The book reads fast and furious; I’d suggest not picking it up unless you have an open evening.\" - Joe Mack, The Current “Excessive Entanglement is a riveting and brilliant political thriller. As a politician—one, in fact, who does not always share the lead character’s viewpoint—I was fascinated by the story’s juxtaposition of politics, space, religion and nature. While we expect a thriller to keep us engaged, Entanglement goes further, forcing the reader to give thought to the technical and spiritual issues mankind would encounter if given the opportunity to perpetuate itself onto another planet.” - Lamar Smith, US House of Representatives, Texas, 21st District \"Excessive Entanglement is a political thriller, a near-future science fiction story, a to-the-point look at religion in politics, and a mystery. How in the world does a first time author accomplish all four? Beautifully, that's how.\" - Jennifer Turley, Mean Old Library Teacher“Excessive Entanglement is a real old-fashioned page-turner with a very modern twist. The succinct chapters, relentless forward motion, intriguing characters, and explosive, believable plot add up to a book that's nearly impossible to put down.” - Christina Baker-Kline, Author of Bird in Hand and The Way Life Should BeBook Summary:President Virginia Belknap is one year into her second term when a NASA scientist discovers a new planet with an atmosphere similar to Earth. Embracing the event, Belknap turns a one-way mission to colonize this new world into her grand calling. It is the early 2030s, and the mission seizes the worlds imagination. But as Belknap starts to assemble international experts to plan the enterprise, religious conservativesled by Randall Reeserise up in indignation. They see Belknaps plan as a blueprint for the Godless perpetuation of the human species. As politics put the launch at risk, a darker conspiracy takes shape that threatens to obliterate the mission, and even the new planet itself. Belknap, her own life in danger, is forced to battle Reese and expose the conspiracy before the launch window closes. Excessive Entanglement creatively explores the political and constitutional issues presented by mankinds first opportunity to create a more perfect planet from the ground up.",
  "genres": [
    "Thriller"
  ],
  "author": "Nick d'Arbeloff",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/16290356-excessive-entanglement"
}