{
  "title": "To Have a Friend",
  "description": "In Chicago a high level group of organized crime figures are in a heated discussion with one of its young elite. The topic of discussion is the importing of illegal diamonds and drugs into the United States. The group has found what seems to be an ironclad method of bringing the items they want from several European countries and as far away as Africa if they can convince Joey who isthe youngest crime leader in America, at this moment, to make an offer to his best friend into becoming involved and use the successful business his wife and he have built as the vehicle for their plan. This explosive issue concerns Joey's best friend the man he went to school with the same man who he was best man at his wedding and now serves as godfather to his best friend’s only daughter. But first they must get Joey to agree he will present the offer to his friend and get the friend and his family involved.Joey is the brilliant and fascinating underworld figure every prosecutor, law official, politician and other rising crime figures love to hate. It is up to him to keep his friend and his friend’s family safe and uninvolved in this plan that he knows will destroy everything the loving couple have worked so hard to build. In this thriller McClure focuses on the maneuvers of international crime boss Joey Fanez.Joey has vexed the oldest members of various crime families who are close to him by not agreeing to this multimillion dollar import deal to involve his friend. But one of the members who wish to replace Joey thinks he sees a way to pay him back. After discovering and continual surveillance of the international art gallery of the wife of David Stuart, Joey's best friend, the group feels Joey must make this deal with David and Tiaunna.McClure builds spellbinding tension, throughout this crime thriller, keeping the reader off balance right up to the end where Joey settles the matter in a way that shares the very title of the book itself. To Have A Friend.",
  "genres": [],
  "author": "Don S. McClure",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/16291150-to-have-a-friend"
}