{
  "title": "Just Blow It Up: Firepower for Living An Unlimited Life",
  "description": "\"Who knew tearing something down could be so elegant -  Just Blow It Up ! is a blast!\"- John Jantsch, Author of  Duct Tape Marketing  and  The Commitment Engine\"Dixie communicates clearly and powerfully the wisdom we all need to succeed.\"- Mark Sanborn -- best-selling author of  The Fred Factor  and  You Don't Need a Title to be a Leader\" Just Blow It Up! Firepower for Living an Unlimited Life  will leave you aspiring to be Dixie's brand of super hero!\"- Frank McKinney 5x bestselling author, including  The Tap\" Just Blow It Up  could be the catalyst you need to make your big goals a reality!\"-Mitch Matthews, BIG Dream Gathering co-founder and Author of  IGNITE - A little book to spark your big dreams .\"Get ready to explode whatever's in your way; the result being a richer, happier and more fulfilling life! In this book - you have an amazing teacher who will take you by the hand and help you to do it, step-by-step.\"-Bob Burg, coauthor of  The Go-Giver  and author of  Endless ReferralsJust Blow it Up; Firepower for Living an Unlimited Life  will provide the reader A dependable, repeatable process for eliminating barriersAuthentic life-expanding tools while demolishing clichesHow to recognize the symptoms, causes, and types of brick wallsHow to pursue a life where \"nothing is impossible\"Ways to refuse the bricks life offers and reclaim their powerPulling together her experiences from years of coaching entrepreneurs and consulting in hundreds of small businesses across America, along with stories shared with her by mentors and teachers such as Richard Bach, Bob Burg, Mitch Matthews and John David Mann, Dixie builds a credible case for taking on the \"impossible\" dream and blowing up any barrier that stands in the way.Just Blow It Up  gives a step-by-step process for challenging those barriers, weakening those walls, and finally applying the \"real dynamite\" and powering right on through.",
  "genres": [
    "Business",
    "Nonfiction",
    "Self Help"
  ],
  "author": "Dixie Gillaspie",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/16293303-just-blow-it-up"
}