{
  "title": "Die Hüter der Rose",
  "description": "Mancher Leser wird sich jetzt fragen: \"Was habe ich eigentlich die letzten zwei Jahre gemacht, nachdem ich mit Die Siedler von Catan durch war?\" Seitdem ist tatsächlich kein neues Buch mehr von Rebecca Gablé erschienen. Das Warten hat ein Ende: Die Hüter der Rose ist erschienen -- lesen Sie einen Textauszug!Das Buch ist ein eigenständiger Roman, gleichzeitig aber auch die Fortsetzung von Das Lächeln der Fortuna und somit der zweite Teil einer großen Trilogie. Zwei Familien, die Waringham und die Lancaster, spielen auch in Die Hüter der Rose eine zentrale Rolle. Der Plot ist in der ersten Hälfte des 15. Jahrhunderts angesiedelt und erstreckt sich über einen Zeitraum von 30 Jahren. So erzählt Rebecca Gablé ihre Geschichte vor dem Hintergrund der letzten Phase des \"Hundertjährigen Krieges\" zwischen England und Frankreich. John of Waringham ist gerade einmal dreizehn Jahre alt, als er beschließt, von zu Hause Reißaus zu nehmen. Er hat Angst, von seinem Vater in eine klerikale \"Karriere\" gedrängt zu werden. Am Hof von Henry V., genannt Harry, gelingt ihm ein atemberaubender Aufstieg, John wird schnell zum Ritter und zum Helden. Der plötzliche Tod des Königs trifft nicht nur John hart, ganz England gerät in eine prekäre Situation: Der legitime Thronfolger ist acht Monate alt -- ein Baby! Es entsteht ein Machtvakuum, das wie durch einen unheilvollen Sog Tod und Verderben bringt. Auch Johns Leben ist bedroht ...Worin liegt das Besondere der historischen Romane von Rebecca Gablé? Was macht sie so erfolgreich? In Kürze lautet die Antwort: die gelungene Balance zwischen Fiktion und Wahrheit. Einerseits wird die Geschichte auch dieses Mal wieder so elegant und spannend erzählt, dass man irgendwann gar nicht mehr wissen möchte, welcher Charakter denn nun \"in Wahrheit\" fiktiv und welcher real ist. Andererseits wird die Atmosphäre der Zeit in Die Hüter der Rose so lebendig, wird das England des 15. Jahrhunderts so gegenwärtig, dass man der Autorin abnimmt, dass das Leben der Menschen an diesem Ort und zu dieser Zeit sich genau so \"angefühlt\" haben muss. Auf diese indirekte Weise erfährt man dann auch, wie viel Recherche und fundiertes Wissen den Gablé-Romanen zugrunde liegen. Und warum es eben dann doch manchmal zwei Jahre dauert, bis ein neues Buch der Autorin erscheint. --Carsten Hansen, LiteraturtestRebecca Gablé im Interview\"Das Leben ist zu kurz für alle Romane, die in einem schlummern.\"In ihrem neuesten Werk Die Hüter der Rose entführt Rebecca Gablé ihre Leser ins England des 15. Jahrhunderts. Im Interview beschreibt die Bestsellerautorin ihren Helden John of Waringham, erzählt von ihrem Besuch in Coventry und gibt Einblick in ihre Zukunftspläne.Historische Romane von Rebecca Gablé auf einen BlickDas Lächeln der FortunaDas zweite KönigreichDer König der purpurnen StadtDie Siedler von CatanDie Hüter der Rose",
  "genres": [
    "Historical Fiction",
    "Historical",
    "German Literature",
    "Audiobook",
    "Fiction",
    "British Literature",
    "Medieval"
  ],
  "author": "Rebecca Gablé",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/1629544.Die_H_ter_der_Rose"
}