{
  "title": "Heir To The Glimmering World",
  "description": "Cynthia Ozick is an American master at the height of her powers in Heir to the Glimmering World, a grand romantic novel of desire, fame, fanaticism, and unimaginable reversals of fortune. Ozick takes us to the outskirts of the Bronx in the 1930s, as New York fills with Europe’s ousted dreamers, turned overnight into refugees.Rose Meadows unknowingly enters this world when she answers an ambiguous want ad for an \"assistant\" to a Herr Mitwisser, the patriarch of a large, chaotic household. Rosie, orphaned at eighteen, has been living with her distant relative Bertram, who sparks her first erotic desires. But just as he begins to return her affection, his lover, a radical socialist named Ninel (Lenin spelled backward), turns her out.And so Rosie takes refuge from love among refugees of world upheaval. Cast out from Berlin’s elite, the Mitwissers live at the whim of a mysterious benefactor, James A'Bair. Professor Mitwisser is a terrifying figure, obsessed with his arcane research. His distraught wife, Elsa, once a prominent physicist, is becoming unhinged. Their willful sixteen-year-old daughter runs the household: the exquisite, enigmatic Anneliese. Rosie's place here is uncertain, and she finds her fate hanging on the arrival of James. Inspired by the real Christopher Robin, James is the Bear Boy, the son of a famous children's author who recreated James as the fanciful subject of his books. Also a kind of refugee, James runs from his own fame, a boy adored by the world but grown into a bitter man. It is Anneliese’s fierce longing that draws James back to this troubled house, and it is Rosie who must help them all resist James’s reckless orbit.Ozick lovingly evokes these perpetual outsiders thrown together by surprising chance. The hard times they inherit still hold glimmers of past hopes and future dreams. Heir to the Glimmering World is a generous delight.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Jewish",
    "Novels",
    "New York",
    "Historical",
    "Literature"
  ],
  "author": "Cynthia Ozick",
  "average_rating": "3.17",
  "url": "https://www.goodreads.com/book/show/162941.Heir_To_The_Glimmering_World"
}