{
  "title": "Fully Booked - Ink on Paper: Design and Concepts for New Publications",
  "description": "Young designers and publishers are ringing in a new era for printed books--one that is likely to be the most exciting in their entire history. Digital media are disappointing for books. All books look the same on an iPad, for example. On a monitor, a book isn't thick or thin, big or small. Features such as a Japanese binding, embossing, letterpress printing, or gilt edging are only possible in print. Consequently, it isn't surprising that young, contemporary designers, publishers, typographers, illustrators, and editors are enthusiastically ringing in a new era for printed books. Fully Booked: Ink on Paper is a collection of books, magazines, and other printed products that celebrate the distinctiveness of design, materials, techniques, workmanship, and production methods--and push their limits. It showcases publications whose innovative printing and binding befit their unconventional subject matter or radical editorial and design concepts. The tactile experience is as indispensable for the included editors, authors, and designers as it is for their readers. Examples range from personal projects with the smallest print runs to premium artist books or brand publications. Featuring work by groundbreaking design studios, such as A Practice for Everyday Life, Akatre, Joost Grootens, Julia Hasting, Konst & Teknik, Niessen & de Vries, Raffinerie AG, Studio Laucke Siebein, and Two Points.Net, this book documents current experiments and future possibilities for printed publications. Its stunning range of visual examples are put into context by texts from print expert Andrew Losowsky, who is also co-editor. Fully Booked: Ink on Paper makes clear that the most exciting phase in the history of printed matter has just begun.",
  "genres": [
    "Design",
    "Nonfiction"
  ],
  "author": "Andrew Losowsky",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/16297973-fully-booked---ink-on-paper"
}