{
  "title": "To Honor You Call Us",
  "description": "The Terran Union has spent the last thirty years fighting a vast interstellar war spanning a thousand light years and encompassing hundreds of worlds. The Union’s enemies in this war are the Krag, implacable aliens whose goal is to exterminate the human race. Now, in the year 2315, with the future of mankind hanging in the balance, wily 28 year old Cajun Max Robichaux is promoted to command of the U.S.S. Cumberland, a Destroyer with state of the art capabilities but a combat record so bad that she is known throughout the fleet as the “Cumberland Gap.” Captain Robichaux’s first mission: take his compact warship among the independent systems of the Free Corridor where the Krag have been secretly purchasing strategic materials, and seize or destroy any ships carrying cargo for the enemy. Max must shoot it out with the Krag convoys or, if he is outgunned, win the day by liberal use of guile, ruse, and military deception. Far from the fleet and under enforced radio silence, the young skipper can rely only on his determination, his wits and, to his surprise, the support, advice, and, increasingly, the friendship, of his Chief Medical Officer, the brilliant and mysterious Doctor Ibrahim Sahin, surgeon, trader, scientist, swordsman, and diplomat. But, while facing the Cumberland’s shipboard problems and carrying out her dangerous assignment, Max and Doctor Sahin suddenly discover that the Cumberland and her misfit crew are all that stands in the way of a deadly all-out Krag attack that exploits a hidden flaw in the Union’s defenses to strike deep into the heart of the Human Space, threatening to end the war and spell the extinction of humanity. To Honor You Call Us combines the gritty slice of life naval realism found in the classic “Ships of Wood and Men of Iron” novels with the razzle-dazzle of a Cold War Techno-Thriller, all placed in a believable galactic military setting 300 years in the future. Authors H. Paul Honsinger and Harvey G. Phillips immerse the reader in a richly-imagined universe, bringing to vivid life the officers, men, ships, weapons, tactics, and strategy of space combat in the year 2315, giving the reader a healthy dose of exciting battle action as well as opening a window into the conflict, camaraderie, and customs of the wardroom and the lower decks. But, beyond the hardware and the clash of arms, To Honor You Call Us is a sweeping tale in the classic mold, of honor and courage, friendship and loyalty, daring and sacrifice, and of the unconquerable human spirit.",
  "genres": [
    "Science Fiction",
    "Space Opera",
    "Military Fiction",
    "Fiction",
    "Military Science Fiction",
    "Audiobook",
    "Space"
  ],
  "author": "H. Paul Honsinger",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/16299848-to-honor-you-call-us"
}