{
  "title": "THE NEW PSYCHOLOGY: A UNIFIED FIELD OF BRAIN, BEHAVIOR, MIND, PERCEPTION, CULTURE AND LIFE...",
  "description": "480 Pages, 8.5X11” Color, Fully Illustrated These are the bits and pieces that make up a deep understanding of how our mind works. Welcome to the deep woods.Psychology controls the biology of our brain. At the witch trials in Salem, when the girls began to shriek “Witch, Witch!” adrenaline and cortisol would have shot into the bloodstream of the spectators. Neurotransmitters would have surged through their brain. Their very brain waves would have shot up from 12 to 40 cycles per second. A P300 brain wave would have screamed “ALERT”. Their heart jumped. A chill went up their spine.We know this because the same thing happens in America today among those watching a Hollywood horror movie about witches, zombies, demons, murder and more. In varying degrees this is basic to understanding how our brain works in dealing with anxiety, depression, politics, love, sex, interpersonal relations, and life.PSYCHOLOGY CONTROLS THE BIOLOGY OF OUR BRAIN. Knowing how this works is essential to understanding how our mind works. The failure to understand that has led to the media's preoccupation with claiming it is all in your DNA or biochemistry; a media preoccupied with the magic words of DNA and biochemicals in the brain cannot grasp a deeper level of underestanding.All teachers are inspired by the idea, however hopeful, that we are getting something across that someday, someway, will benefit our students, make their life better, and give them the tools that they need to understand a very difficult world.In psychology, students flock to our courses, eager to learn the lessons of life, how their mind works, and how to understand others. They want to understand what the world is all about. Yet what they learn is often that they must memorize vast amounts of data and studies that make little sense in how to apply what they learn to the real world. They memorize what they need to know to pass a test, not what they need to know to understand life.Welcome to the deep woods...All teachers are inspired by the idea, however hopeful, that we are getting something across that someday, someway will benefit our students, make their life better, and give them the tools that they need to understand a very difficult world.In psychology, students flock to our courses, eager to learn the lessons of life, of how their mind works, and how to understand others. They want to understand what the world is really all about. Yet what they learn is often that they must memorize vast amounts of data and studies that make little sense in how to apply what they learn to the real world. They memorize what they need to know to pass a test, not what they need to know to understand their mind.We begin with Important recent studies at MIT, Harvard, and the National Science Foundation that found that we are failing to get across the most important issues of any science. As Prof. Sadler put it, \"we try to teach maybe ten times more than what kids can actually learn in our science classes.\" The prestigious PEW Research found that America is 24th in the world in science. Why?\"Examples are not another way to teach, they are the only way to teach.\" EinsteinSometimes psychologists have made a name for themselves by criticizing another point of view and establishing their own as superior (behavioral, developmental, cognitive, perceptual, neuropsychology, etc. etc.). No other science does this. Yet all have found some important pieces. What we need is to put the known pieces together.Psychology cannot be a science if we are just a gaggle of conflicting ideas. We are something more; a Unified Field where each, contributes to understanding the next.",
  "genres": [],
  "author": "David Lloyd Shepard",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/107031545-the-new-psychology"
}