{
  "title": "Rock Stars Do It Harder",
  "description": "***Rock Stars Do It Harder is the pilot story for a Big Girls spinoff-sequel series. It is best to read this after the Big Girls Do It books 1-5 to avoid major spoilers.***Chase Delany is a rock star. Rock stars are expected to rock hard onstage and party even harder offstage. Chase is living up to those expectations, and then some. He leaves everything he's got onstage, and drowns the ache in his soul at the bottom of a tequila bottle. And then there are the girls. They throw themselves at him nonstop, a never-ending train of hot girls who want in his signature tight leather pants. The problem? Nothing, no amount of booze and no amount of backstage sex can heal the cracks in his heart left by Anna's rejection. And then he runs into Jamie. Anna's best friend. The one girl in the whole world who is off limits to him. The one girl who happens to be the one thing that seems to soothe the hurt inside him. Forgetting her proves to be impossible.Jamie Dunleavy has always been an enthusiastic practitioner of the sexual arts. She's never apologized for it, and she owns it. She's been known to admit--to her best friend Anna Devine, at least--that she's a bit of a slut. Her deep, dark secret? She's tired of it. She doesn't want to be that girl anymore. She wants love, now more than ever, having watching Anna find her own happily-ever-after. So who does she find herself falling for? Chase Delany. Anna's very recent ex. A rockstar, and the one guy she knows she can't ever, ever be with. You don't bang your best friend's ex. You just don't. It's the one hard and fast rule of best friendship. Except, no matter how hard she tries to forget him, she can't seem to shake the image of his dark eyes and sexy tattoos and those lips she wants so badly to kiss and kiss until neither of them can breathe. She can't forget him, and she can't ever have him. ** This 22,000 word erotic romance novella is for adults only! **",
  "genres": [
    "Romance",
    "Erotica",
    "Adult",
    "Contemporary",
    "Short Stories",
    "Contemporary Romance",
    "Music"
  ],
  "author": "Jasinda Wilder",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/16300386-rock-stars-do-it-harder"
}