{
  "title": "More Dangerous Ground",
  "description": "Roger Cook was the first and remains the best-known investigative journalist on UK radio and television, justly famous for his ground-breaking and hugely popular series The Cook Report. Roger Cook moved from the Australian Broadcasting Commission in the late sixties to a career in England with the BBC, where he prospered on Radio 4's The World At One. Then, in 1971, he suggested carrying out an in-depth investigation into a suspect mortgage company. The company proprietor was a violent former heavyweight wrestler, and Cook was armed only with a microphone. The public response to the memorable broadcast that followed led to the creation of Checkpoint, his iconic radio programme, and then to The Cook Report when he transferred to ITV a decade later. The Cook Report ran for twelve years, achieving near-legendary status and attracting huge audiences excited by Cook s unique and ground-breaking brand of investigative journalism. He has been much imitated, but never equalled. For more than twenty five years, Cook exposed a breadth of institutional incompetence, bad law, injustices and naked criminality. During this time he was knocked unconscious a dozen times, required hospital treatment on almost thirty occasions and had a score of bones broken by those who have resented his ruthless persistence - or just objected to the fact that he existed at all. Cook made physical and journalistic fearlessness his trademark. Organised crime, drug-smuggling, child pornography, the exploitation of endangered animals, people trafficking, the Russian Mafia and the IRA - in search of justice, Cook has targeted them all, and many like them, and won. Some of his investigations have been extraordinarily prescient, foretelling 9/11 by more than five years and the imminent threat of a 'dirty bomb' by ten. Many have been followed by major convictions or changes in the law. Full of hair-raising anecdotes and flavoured by Cook's inimitable style and humour,",
  "genres": [],
  "author": "Roger Cook",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/16303315-more-dangerous-ground"
}