{
  "title": "Mist Warrior",
  "description": "An alternative cover edition of ASIN B00ALD1DIE.When he was twelve, his name was Branan Strickland. He was the heir to the Wardenship of Inglewood, a title to govern a Royal Forest and the land around it. But Branan's father was an abusive sod, beating Branan and his mother for sheer sport.Until the night when his father's fist landed on the side of his mother's head - a wound that would kill her in a few short hours. Devastated, Branan spent those last hours with her. Just when he thought his world couldn't shatter any more, his mother told him the truth of his heritage.Branan was not Strickland's son, he was the son of a Scottish Larid, Raulf MacTavish. Strickland had murdered Branan's true sire and forced his mother into marriage. Raina MacTavish had just learned she was breeding when Strickland killed the man she loved more than life. Had she not carried Branan, she would have willingly died. Raina had told no one but Raulf of her breeding. After Strickland bedded her, a couple of months later, Raina announced her pregnancy. She did so only because she feared if Strickland knew Branan's true sire, the blackguard would slay her babe - the last link to her beloved husband.But now she is dying. Raina knows she must tell Branan the truth. Her heart grieves, she can no longer protect him, but there is a family nearby who once called Raulf and Raina friend. Raina also knows Branan is growing into the spitting image of his true sire. Soon, Strickland will see his old enemy staring back at him.Branan has one chance to reclaim what was stolen from him, his title and his father's stolen sword, a huge Scottish claymore with an emerald set in the pommel and a thistle engraved on its hilt. He knows he must learn the ways of a knight and grow stronger. But Strickland discovers the boy's heritage and tries to kill him.Now on the run and wounded, Branan fears Strickland will catch him. He seeks cover in a forest when an intriguing lass with bright blue eyes finds him. To his shock, the girl knows the forest better than anyone. Her name is Catriona and she is part of the family his mother told him about. The girl leads him to safety.Branan's trials are only beginning, while he finds a brief respite with Catriona's family, Strickland does not give up his quest. Branan is forced to flee to his father's lands in Scotland. He abandons Catriona in the dead of night and leaves his beloved foster family behind.10 years later, Branan's foster-brother, Gavin, searches for Branan in Scotland. Gavin finds him and tells Branan, if he wishes to reclaim his legacy, the time to act is now. But Gavin has more news and Branan is devastated again when he learns Catriona has been betrothed to another man. But Branan's his heart is not prepared for what greets him when he returns to England. The home of Branan's foster family and Gavin's parents, has been burned to the ground. In the ashes, Gavin finds his father's signet ring. Catriona...what has happened to her? Many of the local villagers believe her dead as well, but rumors abound, one woman may have escaped fire to flee to the forest....",
  "genres": [
    "Historical Romance",
    "Historical",
    "Romance",
    "Medieval",
    "Historical Fiction",
    "Scotland",
    "Amazon"
  ],
  "author": "Kathryn Loch",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/16302175-mist-warrior"
}