{
  "title": "Love Me When I'm Gone: The true story of life, love and loss for a Green Beret in post-9/11 war",
  "description": "Love Me When I’m Gone is a tale for the ages, the perfect blend of action, romance, heroes, villains, patriotism and valor. What holds this story above all others is the fact that this one is true.Rob had a pretty rough childhood: given up for adoption as an infant, brought into a family of highly decorated military men, suffering the loss of his mother to cancer, and his rebellion which landed him in military school. When he finally returns home he meets Cindy, who quickly becomes his best friend. After graduation the two go off to college at opposite ends of Texas, and their paths separate. Eight years later, when Rob returns home from SERE school and being a POW in the cold North Carolina woods, he wakes up one morning to discover that Cindy has contacted him on Myspace; he is very surprised, as he has been searching for Cindy for the past few years to no avail. The two reunite to spend his month of leave together, both knowing at the end he will be leaving for the illustrious 1st Battalion, 10th Special Forces Group (Airborne), the elite Battalion of Green Berets stationed in Germany for quick-reaction missions around the globe. The two share a heart-felt goodbye at the airport, each hoping that somehow they can find a way to keep their love alive throughout whatever the future has in store for this newly crowned Green Beret.Rob’s time in Germany is a whirlwind; his first trip to Iraq, in which he encounters three distinct situations which will haunt him for the rest of his life, HAVE-ACE, the Special Operations school which he attends with his team and finally becomes one of them, Africa, where Rob learns many valuable lessons about life, and Afghanistan, where he and his team are tested in many life-or-death situations, including Operation Payback, where he and The Captain are wounded in a sustained firefight in the middle of a village.The culmination of the story is the quintessential fairy-tale ending; Rob moves back to California to spend the rest of his days, and the final chapter is the full military wedding, complete with his teammates as groomsman and sword bearers.",
  "genres": [
    "Military Fiction",
    "Love"
  ],
  "author": "Robert Patrick Lewis",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/16304292-love-me-when-i-m-gone"
}