{
  "title": "Original Tao",
  "description": "Revolutionizing received opinion of Taoism's origins in light of historic new discoveries, Harold D. Roth has uncovered China's oldest mystical text―the original expression of Taoist philosophy―and presents it here with a complete translation and commentary.Over the past twenty-five years, documents recovered from the tombs of China's ancient elite have sparked a revolution in scholarship about early Chinese thought, in particular the origins of Taoist philosophy and religion. In Original Tao, Harold D. Roth exhumes the seminal text of Taoism― Inward Training (Nei-yeh) ―not from a tomb but from the pages of the Kuan Tzu, a voluminous text on politics and economics in which this mystical tract had been \"buried\" for centuries.Inward Training is composed of short poetic verses devoted to the practice of breath meditation, and to the insights about the nature of human beings and the form of the cosmos derived from this practice. In its poetic form and tone, the work closely resembles the Tao-te Ching ; moreover, it clearly evokes Taoism's affinities to other mystical traditions, notably aspects of Hinduism and Buddhism.Roth argues that Inward Training is the foundational text of early Taoism and traces the book to the mid-fourth century B.C. (the late Warring States period in China). These verses contain the oldest surviving expressions of a method for mystical \"inner cultivation,\" which Roth identifies as the basis for all early Taoist texts, including the Chuang Tzu and the world-renowned Tao-te Ching. With these historic discoveries, he reveals the possibility of a much deeper continuity between early \"philosophical\" Taoism and the later Taoist religion than scholars had previously suspected.Original Tao contains an elegant and luminous complete translation of the original text. Roth's comprehensive analysis explains what Inward Training meant to the people who wrote it, how this work came to be \"entombed\" within the Kuan Tzu, and why the text was largely overlooked after the early Han period.",
  "genres": [
    "Taoism",
    "Religion",
    "Philosophy",
    "Spirituality",
    "Mysticism",
    "China",
    "History"
  ],
  "author": "Harold D. Roth",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/1630616.Original_Tao"
}