{
  "title": "Chemistry",
  "description": "How much does biology have to do with who a person is? Chemistry is the emotionally charged story of Neal and Zach, passionate gay lovers torn apart by mental illness. At first meeting they discover a sexual and emotional chemistry that cannot be denied. Then, as illness consumes one, each must grow, repair himself, and work to become stronger and more independent to ultimately conquer the life-crushing consequences wrought by mental illness and emotional dependency. This touching, introspective story will move you—and have you thinking about the motivations and events in your own life. Neal Bauer is an intellectual and rather controlled gay man, in love with the idea of being in love. His past holds an unhealthy relationship which he struggles to come to grips with. Now he is faced with another relationship with a man in which he can lose himself, a descent of self into the inevitable trap of codependence. Zach Reddison is a free spirit, highly sexual, the product of an unhappy and abusive childhood. Zach has spent much of his life wandering in an attempt to escape his painful past. His swirling descent into clinical depression and serious mental illness is the stuff of nightmares for both him and for his lover. I’d grown used to Zach, to the weight his body lent the other side of the bed. After all this time (back then, three months seemed like a very long time), I began to take for granted his inevitable place in my life. It never occurred to me that he could be temporary, like the others. I didn’t think in terms of temporary or permanent; Zach was simply there, that was all there was to it. He was real to me in a way that no other man had ever been—in a physical sense, as inexorable and undeniable as a mountain range or a sea. Before, I had made fantasies of my lovers, loved them for the most abstract of reasons—the creamy notes of longing that wept from Adam’s cello; the swirl of ideas that excited me whenever Brian opened his mouth—but Zach was different. Unique among them, Zach struck me primarily as a physical, tangible presence—flesh, bone, blood. He was tousled head of chestnut hair, unkempt on the pillow beside me in the morning when I woke early and waited for his eyes to! open. Chemistry is the story of the chemical attraction between lovers, the brain chemistry that determines personality and mood, the medications needed for regaining mental health, and the relationships between people who care for one another. It is an enthralling novel of courage, liberation, and self-realization.",
  "genres": [
    "M M Romance",
    "LGBT",
    "Fiction",
    "Gay Fiction"
  ],
  "author": "Lewis DeSimone",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/1630598.Chemistry"
}