{
  "title": "Laura Ingalls Wilder, Farm Journalist: Writings from the Ozarks",
  "description": "Before Laura Ingalls Wilder found fame with her Little House books, she made a name for herself with short nonfiction pieces in magazines and newspapers. Read today, these pieces offer insight into her development as a writer and depict farm life in the Ozarks—and also show us a different Laura Ingalls Wilder from the woman we have come to know.            This volume collects essays by Wilder that originally appeared in the Missouri Ruralist between 1911 and 1924. Building on the initial compilation of these articles under the title Little House in the Ozarks, this revised edition marks a more comprehensive collection by adding forty-two additional Ruralist articles and restoring passages previously omitted from other articles.            Writing as “Mrs. A. J. Wilder” about modern life in the early twentieth-century Ozarks, Laura lends her advice to women of her generation on such timeless issues as how to be an equal partner with their husbands, how to support the new freedoms they’d won with the right to vote, and how to maintain important family values in their changing world. Yet she also discusses such practical matters as how to raise chickens, save time on household tasks, and set aside time to relax now and then.            New articles in this edition include “Making the Best of Things,” “Economy in Egg Production,” and “Spic, Span, and Beauty.” “Magic in Plain Foods” reflects her cosmopolitanism and willingness to take advantage of new technologies, while “San Marino Is Small but Mighty” reveals her social-political philosophy and her interest in cooperation and community as well as in individualism and freedom. Mrs. Wilder was firmly committed to living in the present while finding much strength in the values of her past.            A substantial introduction by Stephen W. Hines places the essays in their biographical and historical context, showing how these pieces present Wilder’s unique perspective on life and politics during the World War I era while commenting on the challenges of surviving and thriving in the rustic Ozark hill country. The former little girl from the little house was entering a new world and wrestling with such issues as motor cars and new “labor-saving” devices, but she still knew how to build a model small farm and how to get the most out of a dollar.            Together, these essays lend more insight into Wilder than do even her novels and show that, while technology may have improved since she wrote them, the key to the good life hasn’t changed much in almost a century. Laura Ingalls Wilder, Farm Journalist distills the essence of her pioneer heritage and will delight fans of her later work as it sheds new light on a vanished era.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Autobiography",
    "Memoir",
    "American History",
    "Essays"
  ],
  "author": "Laura Ingalls Wilder",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/1630744.Laura_Ingalls_Wilder_Farm_Journalist"
}