{
  "title": "Dublin Made Me",
  "description": "Dublin Made Me, the first of C.S. ('Todd') Andrews' two celebrated volumes of autobiography, describes in loving detail the pre-independence Dublin in which the author grew up and provides a vivid participant's account of the War of Independence and the Civil War. Born in 1901, Andrews lived with his family in Summerhill until 1910, when they moved to the distant suburb of Terenure. Andrews' account of the two Dublins of his youth - the bustle, intimacy and poverty of the north side, and the bucolic pleasures of Terenure- is an unsentimental urban pastoral, sensuous and immediate. He describes his schooling with the nuns in Dominick Street, with Patrick Pearse for an unhappy year in St Enda's, and then with the Christian Brothers in Synge Street. And he gives a rich, detailed account of his apprenticeship in Irish republicanism, from his pre-1916 experiences as a youthful 'camp-follower of the Volunteers' to his active service in Dublin in the War of Independence and his dangerous days as adjutant to Liam Lynch, chief of the anti-Treaty forces during the Civil War. Andrews writes dispassionately of internment and hunger-strikes, and of the bitter divide between the pro-and anti-Treaty sides, once comrades-in-arms. Dublin Made Me is a unique account of an ordinary childhood transformed by war and revolution. Together with its sequel, Man of No Property, it provides an unmatched first-person chronicle of the making of twentieth-century Ireland. 'The total autobiography adds up to a sharp and penetrating study of the nature of our society. Reading it forces one to stand up and look around.'- The Irish Times. 'One of the most riveting books I've read for years.'- Sunday Independent 'Andrews has become an important historical figure, firstly because of his public life ... A second reason for his historical importance is his two memoirs, Dublin Made Me and Man of No Property. They are easily the most complete and truthful accounts of what it was like to have experienced that extraordinary epoch in Irish history; nothing else quite like them has survived elsewhere.'- Tom Garvin, Magill",
  "genres": [
    "Ireland",
    "History",
    "Memoir"
  ],
  "author": "C.S. Andrews",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/16307958-dublin-made-me"
}