{
  "title": "Theurgy and the Soul: The Neoplatonism of Iamblichus",
  "description": "Theurgy and the Soul is a study of Iamblichus of Syria (ca. 240 325), whose teachings set the final form of pagan spirituality prior to the Christianization of the Roman Empire. Gregory Shaw focuses on the theory and practice of theurgy, the most controversial and significant aspect of Iamblichus's Platonism. Theurgy literally means \"divine action.\"Unlike previous Platonists who stressed the elevated status of the human soul, Iamblichus taught that the soul descended completely into the body and thereby required the performance of theurgic rites revealed by the gods to unite the soul with the One. Iamblichus was once considered one of the great philosophers whose views on the soul and the importance of ritual profoundly influenced subsequent Platonists such as Proclus and Damascius. The Emperor Julian followed Iamblichus's teachings to guide the restoration of traditional pagan cults in his campaign against Christianity. Although Julian was unsuccessful, Iamblichus's ideas persisted well into the Middle Ages and beyond.His vision of a hierarchical cosmos united by divine ritual became the dominant world view for the entire medieval world and played an important role in the Renaissance Platonism of Marsilio Ficino. Even Ralph Waldo Emerson wrote that he expected a reading of Iamblichus to cause a \"revival in the churches.\" But modern scholars have dismissed him, seeing theurgy as ritual magic or \"manipulation of the gods.\" Shaw, however, shows that theurgy was a subtle and intellectually sophisticated attempt to apply Platonic and Pythagorean teachings to the full expression of human existence in the material world.\"",
  "genres": [
    "Philosophy",
    "Religion",
    "Occult",
    "History",
    "Esoterica",
    "Spirituality",
    "Mysticism"
  ],
  "author": "Gregory Shaw",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/1633901.Theurgy_and_the_Soul"
}