{
  "title": "Learning from the Future: Competitive Foresight Scenarios",
  "description": "\"Scenarios are now a part of every successful manager's toolkit. This book is the first comprehensive guide to the latest developments in scenario thinking written by today's leading practitioners in the field.\" -Napier Collyns, a pioneer of scenario planning at Dutch/Shell now Managing Director, Gloal Business Network (GBN) \"In twenty years of helping companies create and plan for their futures, I have never come across a book that dealt with the use of scenario-based planning as comprehensively as this one.\" -David Kelley CEO, IDEO Product Development the creators of the Apple Mouse \"This book is the greatest reference today on scenario planning-the preeminent tool for those who believe that the future belongs to those with the imagination to create it. The combination of scenario planning and strategy formulation can be a wondrous right brain process that galvanizes teams with a compelling vision and common purpose.\" -David E. Schnedler Director, Corporate Planning Sun Microsystems, Inc. \"Organizations must create intellectual and organizational tension around distinctly different views of the future. Learning from the Future demonstrates why scenarios are ideally suited to generate such tension and how to use scenario learning as a steppingstone to superior strategies.\" -Richard Pascale, Associate Fellow of Oxford University and author of Managing on the How the Smartest Companies Use Conflict to Stay Ahead \"An invaluable guide to the mind-stretching benefits of scenarios that are fully embedded in the strategic thinking process. It should be required reading for any management team embarking on scenario development so they can realize the benefits and evade the pitfalls.\" -George Day, Geoffrey T. Boisi Professor and Director of the Huntsman Center for Global Competition and Innovation Wharton School, University of Pennsylvania",
  "genres": [
    "Business",
    "Nonfiction",
    "Buisness",
    "Philosophy"
  ],
  "author": "Liam Fahey",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/163382.Learning_from_the_Future"
}