{
  "title": "My Life with the Saints",
  "description": "My Life with the Saints 10th Anniversary Edition is available now?!James Martin has led an entirely modern from a lukewarm Catholic childhood, to an  education at the Wharton School of Business, to the executive fast track at General Electric, to ministry as a Jesuit priest, to a busy media career in Manhattan. But at every step he has been accompanied by some surprising friends—the saints of the Catholic Church. For many, these holy men and women remain just historical figures. For Martin, they are intimate companions. “They pray for me, offer me comfort, give me examples of discipleship, and help me along the way,” he writes.The author is both engaging and specific about the help and companionship he has received. When his pride proves trouble­some, he seeks help from Thomas Merton, the monk and writer who struggled with egotism. In sickness he turns to Thérèse of Lisieux, who knew about the boredom and self-pity that come with illness. Joan of Arc shores up his flagging courage. Aloysius Gonzaga deepens his compassion. Pope John XXIII helps him to laugh and not take life too seriously.Martin’s inspiring, witty, and always fascinating memoir encompasses saints from the whole of Christian history— from St. Peter to Dorothy Day. His saintly friends include Francis of Assisi, Ignatius of Loyola, Mother Teresa, and other beloved figures. They accompany the author on a lifelong pilgrimage that includes stops in a sunlit square of a French town, a quiet retreat house on a New England beach, the gritty housing projects of inner-city Chicago, the sprawling slums of Nairobi, and a gorgeous Baroque church in Rome. This rich, vibrant, stirring narrative shows how the saints can help all of us find our way in the world.“In a cross between Holden Caulfield and Thomas Merton, James Martin has written one of the best spiritual memoirs in years.”—Robert Ellsberg, author of All Saints“It isn’t often that a new and noteworthy book comes along in this genre, but we have reason to celebrate My Life with the Saints. It is earmarked for longevity. It will endure as an important and uncommon contribution to religious writing.”—Doris Donnelly, America“An account . . . that is as delightful as it is instructive.”— First Things“In delightful prose Martin recounts incidents, both perilous and funny, that have prompted him to turn to the saints, and in doing so shows us a new way of living out a devotion that is as old and universal as the Church.”—Avery Cardinal Dulles, SJ, Fordham University“An outstanding and often hilarious memoir.”— Publishers Weekly“Martin’s final word for us is as Jungian as it is God does not want us to be like Mother Teresa or Dorothy Day. God wants us to be most fully ourselves.”— The Washington Post Book World",
  "genres": [
    "Religion",
    "Nonfiction",
    "Spirituality",
    "Catholic",
    "Memoir",
    "Theology",
    "Faith"
  ],
  "author": "James     Martin",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/163362.My_Life_with_the_Saints"
}