{
  "title": "Getting Scrooged",
  "description": "Blinded to the Present...Avoiding the Future...Running from the PastThe Smutketeers Present: A Kinky Christmas Carol! The Knight Family is a wealthy, powerful Chicago clan that knows everything there is to know about making money—but they have plenty to learn about love. In this three series novella—Eden Bradley's Getting Scrooged, Robin L Rotham's Not So Tiny Tim and R.G. Alexander's Marley in Chains—you’ll meet Holly Knight, her nephew Tim, and her cousin Marley Knight-Williams as they face their ghosts, fulfill their fantasies and finally discover the magic of Christmas.Blinded to the present…Holly Knight doesn’t have time for Christmas. As the head of Knight Enterprises in Chicago, she doesn’t have time for anything, not even a personal life—other than her brief, secret liaisons with men who remain strangers. Until a new stranger comes to town…Ebenezer Hall is a ‘closer’. His job: negotiate a merger with a woman who is as notorious for being a hard-ass as he is for being a charmer no one can resist—and he’s not above mixing business with pleasure as long as it’ll get him what he wants. The chemistry is sizzling hot, and things get even hotter when Ben’s friends and long-time lovers Justin and Kit arrive in Chicago. Three gorgeous men are even more exciting than one, and Holly’s body is sated in ways she’s never even dreamed of. But she can’t allow herself to be distracted for long—her priority is always business…and protecting her heart.Can an infamous playboy and a hard-hearted corporate mogul ever admit to their heart’s desires? Or will it take a little holiday magic for them to realize that all they want for Christmas is each other?Warning: Contains all ingredients for the perfect kinky holiday: Three men demonstrating blow-job techniques—on each other—because the author couldn’t resist. Neither can Holly. Neither will you. A little sensual domination, because Ben can’t resist. Neither can Holly. Or Justin. Or Kit. Put it all together with some Christmas magic and mix—vigorously. Served hot. Best enjoyed with a side of sex toys.",
  "genres": [
    "Menage",
    "Erotica",
    "Christmas",
    "Contemporary",
    "Romance",
    "Erotic Romance",
    "M M Romance"
  ],
  "author": "Eden Bradley",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/16340283-getting-scrooged"
}