{
  "title": "Reiki: The Healing Touch: Japanese Reiki Techniques and Hayashi Healing Guide",
  "description": "The knowledge that an unseen energy flows through all living things and directly affects the quality of health has been part of the wisdom of many cultures since ancient times. The existence of this \"life energy\" has been verified by recent scientific experiments, and medical doctors are considering the role it plays in the functioning of the immune system and the healing process. Reiki, a technique for stress reduction that also promotes healing, allows everyone to tap into an unlimited supply of \"life energy.\" Reiki was discovered by Dr. Mikao Usui, a Japanese Buddhist, early in the 20th Century. Reiki is easy to learn. It has been successfully taught to thousands of people of all ages and backgrounds. A treatment feels like a wonderful glowing radience that flows through you and surrounds you. It creates many beneficial effects including relaxation and feelings of peace, security and well being. Many have reported miraculous results. Hospitals and doctors' offices are beginning to include it as part of their therapy, and this new edition describes several successful approaches now being used across the US to integrate Reiki into patient care. This revised and expanded edition includes important new information on the theory and practice of Reiki, including the Japanese Reiki Techniques taught by Dr. Usui as well as the Hayashi healing guide. Also included are pictures of the Usui Memorial in Tokyo, and of Mt. Kurama where Reiki was rediscovered. This book is a must for anyone wanting the latest information on Reiki. Its referenced history of Reiki contains the most detailed and verfiable information currently available. Written with inspiration, clarity and vitality, it captures the essence of Reiki and is an excellent introduction to the subject as well as a user-friendly manual for the experienced practitioner.",
  "genres": [
    "Spirituality",
    "Health",
    "Nonfiction",
    "Reference",
    "New Age",
    "Metaphysics",
    "Self Help"
  ],
  "author": "William Lee Rand",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/163437.Reiki"
}