{
  "title": "How To Be A Party Girl",
  "description": "In this delicious, practical and efficient guidebook Pat Montandon - queen of California's jet set - tells every party giver how to become a great hostess and give unforgettable parties. ESQUIRE magazine chose Pat as one of the nineteen best hostesses in the United States. It is Pat Montandon's conviction that... \"...Anyone, regardless of circumstances (i.e. income), can be an outstanding hostess and party giver. Self-confidence gained by being a good hostess can create a completely new world, especially for the unmarried girl who may want to enlarge her circle of friends and therefore her opportunities to meet the right man - also important for the married woman who wants to be something other than just a housewife.\" No kidding. This book is not a good-grief-let-someone-else-try-it come-on that no lady would follow. It is an immensely useful book that explains the makings of a party people remember, even if you start out not knowing anyone and your bank account registers almost taste, imagination (Pat has plenty of both and is willing to share), hard work, plus a genuine love of people. According to Pat (who arrived in San Francisco a few years ago, a shy little girl from the Southwest), liking people and being considerate of their feelings is the cornerstone of social success. People enjoy good company. They like to have fun. So you don't have to break the bank to entertain well. From your office buddies (the first people you'll meet in a new town) to Social Bigwigs, to very special men - the people you know will be flattered by your attention. To make sure you shine in your hostess role there are chapters on grooming and wardrobe. Pat suggests imaginative themes for all different kinds of parties, and lays down rules for guest as well as hostess. Step number one is to invite them. They'll come..... The next steps are just as simple. Pat discusses food, clothing, decor, whom to ask and whom to avoid. In friendly, big-sister tones she tells you how to cope with the crises that occasionally come up in event the best-organized gal's life - and if you follow Pat's advice being a party girl is a lot simpler, and a lot more fun, than you think! Although Pat keeps in mind that most girls entertain to meet and keep men, she also makes it crisply clear that men don't trust the girl whose only social aim is sex. They prefer the girl who entertains because she loves to, who can say no and stay friends. And in her last, wonderful chapter, Pat discusses how to be a great hostess to one grand guy every evening (and morning and afternoon) of your life.",
  "genres": [],
  "author": "Pat Montandon",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/1638162.How_To_Be_A_Party_Girl"
}