{
  "title": "Rise of the Vulcans: The History of Bush's War Cabinet",
  "description": "When George W. Bush campaigned for the White House, he was such a novice in foreign policy that he couldn't name the president of Pakistan and momentarily suggested he thought the Taliban was a rock-and-roll band. But he relied upon a group called the Vulcans—an inner circle of advisers with a long, shared experience in government, dating back to the Nixon, Ford, Reagan and first Bush administrations. After returning to power in 2001, the Vulcans were widely expected to restore U.S. foreign policy to what it had been under George H. W. Bush and previous Republican administrations. Instead, the Vulcans put America on an entirely new and different course, adopting a far-reaching set of ideas that changed the world and America's role in it. Rise of the Vulcans is nothing less than a detailed, incisive thirty-five-year history of the top six members of the Vulcans—Dick Cheney, Donald Rumsfeld, Colin Powell, Paul Wolfowitz, Richard Armitage, and Condoleezza Rice—and the era of American dominance they represent. It is the story of the lives, ideas and careers of Bush's war cabinet—the group of Washington insiders who took charge of America's response to September 11 and led the nation into its wars in Afghanistan and Iraq. Separately, each of these stories sheds astonishing light not only on the formative influences that brought these nascent leaders from obscurity to the pinnacle of power, but also on the experiences, conflicts and competitions that prefigured their actions on the present world stage. Taken together, the individuals in this book represent a unique generation in American history—a generation that might be compared to the \"wise men\" who shaped American policy after World War II or the \"best and brightest\" who prosecuted the war in Vietnam. Over the past three decades, since the time of Vietnam, these individuals have gradually led the way in shaping a new vision of an unchallengeable America seeking to dominate the globe through its military power.",
  "genres": [
    "Politics",
    "History",
    "Nonfiction",
    "War",
    "Biography",
    "American History",
    "The United States Of America"
  ],
  "author": "James  Mann",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/163879.Rise_of_the_Vulcans"
}