{
  "title": "Life Along the Silk Road",
  "description": "In the first 1,000 years after Christ, merchants, missionaries, monks, mendicants, and military men traveled on the vast network of Central Asian tracks that became known as the Silk Road. Linking Europe, India, and the Far East, the route passed through many countries and many settlements, from the splendid city of Samarkand to tiny desert hamlets. Susan Whitfield creates a rich and varied portrait of life along the greatest trade route in history in a vivid, lively, and learned account that spans the eighth through the tenth centuries. Recounting the lives of ten individuals who lived at different times during this period, Whitfield draws on contemporary sources and uses firsthand accounts whenever possible to reconstruct the history of the route through the personal experiences of these characters.Life along the Silk Road brings alive the now ruined and sand-covered desert towns and their inhabitants. Readers encounter an Ulghur nomad from the Gobi Desert accompanying a herd of steppe ponies for sale to the Chinese state; Ah-long, widow of a prosperous merchant, now reduced to poverty and forced to resort to law and charity to survive; and the Chinese princess sent as part of a diplomatic deal to marry a Turkish kaghan. In the process we learn about women's lives, modes of communication, weapons, types of cosmetics, methods of treating altitude sickness in the Tibetan army, and ways that merchants cheated their customers. Throughout the narrative, Whitfield conveys a strong sense of what life was like for ordinary men and women on the Silk Road--everyone from itinerant Buddhist monks, to Zoroastrians and Nestorian Christians seeking converts among the desert settlers, to storytellers, musicians, courtesans, diviners, peddlers, and miracle-workers who offered their wares in the marketplaces and at temple fairs. A work of great scholarship, Life along the Silk Road is at the same time extremely accessible and entertaining.",
  "genres": [
    "History",
    "Nonfiction",
    "China",
    "Asia",
    "Travel",
    "Historical",
    "Asian Literature"
  ],
  "author": "Susan Whitfield",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/164257.Life_Along_the_Silk_Road"
}