{
  "title": "Embrace the Lace",
  "description": "In the rugged highlands of 17th-century Scotland, Andrew MacIver has to deal with a crumbling castle, a comically inept cook, and a dangerous power-hungry uncle. At twenty five, Andrew is already a widower and the chieftain of his large clan. Amidst all this, the clan's expectations loom large — he must find a noble wife, befitting his status, to secure his lineage. With the clan gathering on the horizon, Andrew prepares to fulfill his duty, but fate has some other plans.Enter Paisley Evangeline Darling, known as Van, a modern-day maverick with dreams as big as her spirit. An avid fan of Tony Stark and on the brink of a major academic milestone in mechanical engineering, Van craves one last hurrah at a renaissance festival before her life is set on a too predictable path. But her thirst for adventure catapults her into an unexpected journey — a tumultuous splash into 17th-century Scotland.Rescued by Andrew, the handsome yet overburdened laird, Van finds herself in a world where dragons aren't just in storybooks and faeries meddle in mortal affairs. While Andrew is determined to send her back to her time, Van's vivacity and innovative thinking breathe new life into his monotonous existence. She challenges conventions and brings a whirlwind of change to the highland clan, all while igniting a spark in Andrew's guarded heart.As they navigate this uncharted territory together, they must contend with those meddlesome faeries, Van's anachronistic inventions, and a truly formidable dragon. In a world where everything is possible yet nothing is as it seems, will the laird find love and laughter with a woman who defies all norms? Or will their differences and the challenges of time tear them apart? This tale is a blend of historical intrigue and futuristic flair, featuring a heroine who shatters stereotypes and a hero learning to embrace the unexpected.",
  "genres": [
    "Romance",
    "Time Travel",
    "Fantasy",
    "Historical Romance",
    "Romantasy",
    "Fiction"
  ],
  "author": "Shannon MacLeod",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/164253512-embrace-the-lace"
}