{
  "title": "Vienna 1814: How the Conquerors of Napoleon Made War, Peace, and Love at the Congress of Vienna",
  "description": "Vienna, 1814 is an evocative and brilliantly researched account of the most audacious and extravagant peace conference in modern European history. With the feared Napoleon Bonaparte presumably defeated and exiled to the small island of Elba, heads of some 216 states gathered in Vienna to begin piecing together the ruins of his toppled empire. Major questions loomed: What would be done with France? How were the newly liberated territories to be divided? What type of restitution would be offered to families of the deceased? But this unprecedented gathering of kings, dignitaries, and diplomatic leaders unfurled a seemingly endless stream of personal vendettas, long-simmering feuds, and romantic entanglements that threatened to undermine the crucial work at hand, even as their hard-fought policy decisions shaped the destiny of Europe and led to the longest sustained peace the continent would ever see.Beyond the diplomatic wrangling, however, the Congress of Vienna served as a backdrop for the most spectacular Vanity Fair of its time. Highlighted by such celebrated figures as the elegant but incredibly vain Prince Metternich of Austria, the unflappable and devious Prince Talleyrand of France, and the volatile Tsar Alexander of Russia, as well as appearances by Ludwig van Beethoven and Emilia Bigottini, the sheer star power of the Vienna congress outshone nearly everything else in the public eye.An early incarnation of the cult of celebrity, the congress devolved into a series of debauched parties that continually delayed the progress of peace, until word arrived that Napoleon had escaped, abruptly halting the revelry and shrouding the continent in panic once again.Vienna, 1814 beautifully illuminates the intricate social and political intrigue of this history-defining congress–a glorified party that seemingly valued frivolity over substance but nonetheless managed to drastically reconfigure Europe’s balance of power and usher in the modern age.",
  "genres": [
    "History",
    "Nonfiction",
    "European History",
    "Politics",
    "World History",
    "19th Century",
    "France"
  ],
  "author": "David King",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/1643820.Vienna_1814"
}