{
  "title": "The Pope's Bookbinder: A Memoir",
  "description": "Entertaining, moving, informative, intelligently I know of few other books like this one to warm the cockles of a booklover's heart.\" Alberto Manguel\"For anyone who loves books too wellwho lusts after them, lives in them, mainlines themDavid Mason s memoir will be a fix from heaven. Heartful, cantankerous, droll, his tales of honour and obsession in the trade gratify the very book-love they portray. An irresistible read.\" Dennis Lee\"An atmospheric, informative memoir by a Canadian seller of used and rare books ... Gossipy, rambling and enchanting, alive with Mason s love for books of every variety.\"Kirkus ReviewsFrom his drug-hazy, book-happy years near the Beat Hotel in Paris and throughout his career as antiquarian book dealer, David Mason brings us a storied life. He discovers his love of literature in a bathtub at age eleven, thumbing through stacks of lurid Signet paperbacks. At fifteen he s expelled from school. For the next decade and a half, he will work odd jobs, buck all authority, buy books more often than food, and float around Europe. He ll help gild a volume in white morocco for Pope John XXIII. And then, at the age of 30, after returning home to Canada and apprenticing with Joseph Patrick Books, David Mason will find his calling.Over the course of what is now a legendary international career, Mason shows unerring instincts for the logic of the trade. He makes good money from Canadian editions, both legitimate and pirated (turns out Canadian piracies so incensed Mark Twain that he moved to Montreal for six months to gain copyright protection). He outfoxes the cousins of L.M. Montgomery at auction and blackmails the head of the Royal Ontario Museum. He excoriates the bureaucratic pettiness that obstructs public acquisitions, he trumpets the ingenuity of collectors and scouts, and in archives around the world he appraises history in its unsifted and most moving forms. Above all, however, David Mason boldly campaigns for what he feels is the moral duty of the antiquarian to preserve the history and traditions of all nations, and to assert without compromise that such histories have value.Sly, sparkling, and endearingly gruff, \"The Pope's Bookbinder\" is an engrossing memoir by a giant in the book tradewhose infectious enthusiasm, human insight, commercial shrewdness, and deadpan humour will delight bibliophiles for decades to come.",
  "genres": [
    "Books About Books",
    "Biography",
    "Nonfiction",
    "Memoir"
  ],
  "author": "David Mason",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/16448966-the-pope-s-bookbinder"
}