{
  "title": "The Devil's Delusion: Atheism and Its Scientific Pretensions",
  "description": "Militant atheism is on the rise. Richard Dawkins, Sam Harris, Daniel Dennett, and Christopher Hitchens have dominated bestseller lists with books denigrating religious belief as dangerous foolishness. And these authors are merely the leading edge of a far larger movement–one that now includes much of the scientific community.“The attack on traditional religious thought,” writes David Berlinski in The Devil’s Delusion , “marks the consolidation in our time of science as the single system of belief in which rational men and women might place their faith, and if not their faith, then certainly their devotion.”A secular Jew, Berlinski nonetheless delivers a biting defense of religious thought. An acclaimed author who has spent his career writing about mathematics and the sciences, he turns the scientific community’s cherished skepticism back on itself, daring to ask and answer some rather embarrassing Has anyone provided a proof of God’s inexistence?Not even close.Has quantum cosmology explained the emergence of the universe or why it is here?Not even close.Have the sciences explained why our universe seems to be fine-tuned to allow for the existence of life?Not even close.Are physicists and biologists willing to believe in anything so long as it is not religious thought?Close enough.Has rationalism in moral thought provided us with an understanding of what is good, what is right, and what is moral?Not close enough.Has secularism in the terrible twentieth century been a force for good?Not even close to being close.Is there a narrow and oppressive orthodoxy of thought and opinion within the sciences?Close enough.Does anything in the sciences or in their philosophy justify the claim that religious belief is irrational?Not even ballpark.Is scientific atheism a frivolous exercise in intellectual contempt?Dead on.Berlinski does not dismiss the achievements of western science. The great physical theories, he observes, are among the treasures of the human race. But they do nothing to answer the questions that religion asks, and they fail to offer a coherent description of the cosmos or the methods by which it might be investigated.This brilliant, incisive, and funny book explores the limits of science and the pretensions of those who insist it can be–indeed must be–the ultimate touchstone for understanding our world and ourselves.",
  "genres": [
    "Science",
    "Religion",
    "Philosophy",
    "Nonfiction",
    "Atheism",
    "Christian",
    "Christianity"
  ],
  "author": "David Berlinski",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/1645044.The_Devil_s_Delusion"
}