{
  "title": "Silent Fall",
  "description": "The woman lay on her back, her large, intelligent eyes fixed on the ceiling above, her pale hair fanned out beneath her like a halo. Around her, the room was peaceful and clean, with morning light dappling the cream carpet. She might have been merely resting… but Ana Marlova’s heart would never beat again.When the body of a beautiful and wealthy doctor is discovered in her high-rise apartment – all alone with the doors locked from the inside – nobody can understand how or why her life has been so brutally cut short. Detective Jacqueline “Jack” Kent may have never worked a murder case before, but that’s not going to stop her trying. It seems Ana’s murderer may have scaled the ten-story building to get in – and Jack should know. As an elite climber herself, it’s a set of skills that only a handful of people have. This can’t be the killer’s first innocent victim, and if Jack doesn’t act fast, it won’t be their last. Jack throws herself into the investigation, determined to beat the twisted climber at their own game. But the crime scene prompts harrowing memories for Jack, who’s still haunted by the death of her best friend Hannah, killed on a mountain only months before. Jack lived that day while Hannah died beside her. Night after night, she relives her friend’s final moments in her dreams. When the body of another victim is found, it’s clear that someone evil is trying to get Jack’s attention. Could the killer be one of her own close circle of friends from childhood? As the lines between her personal and professional life blur, Jack must confront the demons of her own past to stop a cold-blooded killer from striking again. Detective Jack Kent is a heroine who grabs you and doesn’t let go. The first in an unputdownable new crime thriller series, perfect for readers who adore Angela Marsons, Rachel McLean and Sally Rigby.",
  "genres": [
    "Crime",
    "British Literature",
    "Thriller",
    "Audiobook",
    "Suspense",
    "LGBT",
    "Mystery"
  ],
  "author": "Nicky Downes",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/164608974-silent-fall"
}