{
  "title": "Errand Into the Wilderness",
  "description": "The title of this book by Perry Miller, who is world-famous as an interpreter of the American past, comes close to posing the question it has been Mr. Miller's lifelong purpose to What was the underlying aim of the first colonists in coming to America? In what light did they see themselves? As men and women undertaking a mission that was its own cause and justification? Or did they consider themselves errand boys for a higher power which might, as is frequently the habit of authority, change its mind about the importance of their job before they had completed it?These questions are by no means frivolous. They go to the roots of seventeenth-century thought and of the ever-widening and quickening flow of events since then. Disguised from twentieth-century readers first by the New Testament language and thought of the Puritans and later by the complacent transcendentalist belief in the oversoul, the related problems of purpose and reason-for-being have been central to the American experience from the very beginning. Mr. Miller makes this abundantly clear and real, and in doing so allows the reader to conclude that, whatever else America might have become, it could never have developed into a society that took itself for granted.The title, \"Errand into the Wilderness,\" is taken from the title of a Massachusetts election sermon of 1670. Like so many jeremiads of its time, this sermon appeared to be addressed to the sinful and unregenerate whom God was about to destroy. But the original speaker's underlying concern was with the fateful ambiguity in the word errand. \"Whose\" errand?This crucial uncertainty of the age is the starting point of Mr. Miller's engrossing account of what happened to the European mind when, in spite of itself, it began to become something other than European. For the second generation in America discovered that their heroic parents had, in fact, been sent on a fool's errand, the bitterest kind of all; that the dream of a model society to be built in purity by the elect in the new continent was now a dream that meant nothing more to Europe. The emigrants were on their own. Thus left alone with America, who were they? And what were they to do?In this book, as in all his work, the author of \"The New England The Seventeenth Century\"; \"The New England From Colony to Province,\" and \"The Transcendentalists,\" emphasizes the need for understanding the human sources from which the American mainstream has risen. In this integrated series of brilliant and witty essays which he describes as \"pieces,\" Perry Miller invites and stimulates in the reader a new conception of his own inheritance.",
  "genres": [
    "History",
    "American History",
    "Religion",
    "Nonfiction",
    "American",
    "Essays",
    "Read For School"
  ],
  "author": "Perry Miller",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/16467811-errand-into-the-wilderness"
}