{
  "title": "The Journal of John Winthrop, 1630-1649",
  "description": "For 350 years Governor John Winthrop's journal has been recognized as the central source for the history of Massachusetts in the 1630s and 1640s. Winthrop reported events--especially religious and political events--more fully and more candidly than any other contemporary observer. The governor's journal has been edited and published three times since 1790, but these editions are long outmoded. Richard Dunn and Laetitia Yeandle have now prepared a long-awaited scholarly edition, complete with introduction, notes, and appendices. This full-scale, unabridged edition uses the manuscript volumes of the first and third notebooks (both carefully preserved at the Massachusetts Historical Society), retaining their spelling and punctuation, and James Savage's transcription of the middle notebook (accidentally destroyed in 1825). Winthrop's narrative began as a journal and evolved into a history. As a dedicated Puritan convert, Winthrop decided to emigrate to America in 1630 with members of the Massachusetts Bay Company, who had chosen him as their governor. Just before sailing, he began a day-to-day account of his voyage. He continued his journal when he reached Massachusetts, at first making brief and irregular entries, followed by more frequent writing sessions and contemporaneous reporting, and finally, from 1643 onward, engaging in only irregular writing sessions and retrospective reporting. Naturally he found little good to say about such outright adversaries as Thomas Morton, Roger Williams, and Anne Hutchinson. Yet he was also adept at thrusting barbs at most of the other prominent players: John Endecott, Henry Vane, and Richard Saltonstall, among others. Winthrop built lasting significance into the seemingly small-scale actions of a few thousand colonists in early New England, which is why his journal will remain an important historical source.",
  "genres": [
    "Nonfiction",
    "Classics"
  ],
  "author": "John Winthrop",
  "average_rating": "2.84",
  "url": "https://www.goodreads.com/book/show/16467660-the-journal-of-john-winthrop-1630-1649"
}