{
  "title": "Blues for New Orleans: Mardi Gras and America's Creole Soul",
  "description": "In the aftermath of Hurricane Katrina, as the citizens of New Orleans regroup and put down roots elsewhere, many wonder what will become of one of the nation's most complex creole cultures. New Orleans emerged like Atlantis from under the sea, as the city in which some of the most important American vernacular arts took shape. Creativity fostered jazz music, made of old parts and put together in utterly new ways; architecture that commingled Norman rooflines, West African floor plans, and native materials of mud and moss; food that simmered African ingredients in French sauces with Native American delicacies. There is no more powerful celebration of this happy gumbo of life in New Orleans than Mardi Gras. In Carnival, music is celebrated along the city's spiderweb grid of streets, as all classes and cultures gather for a festival that is organized and chaotic, individual and collective, accepted and licentious, sacred and profane.The authors, distinguished writers who have long engaged with pluralized forms of American culture, begin and end in New Orleans--the city that was, the city that is, and the city that will be--but traverse geographically to Mardi Gras in the Louisiana Parishes, the Carnival in the West Indies and beyond, to Rio, Buenos Aires, even Philadelphia and Albany. Mardi Gras, they argue, must be understood in terms of the Black Atlantic complex, demonstrating how the music, dance, and festive displays of Carnival in the Greater Caribbean follow the same patterns of performance through conflict, resistance, as well as open celebration. After the deluge and the finger pointing, how will Carnival be changed? Will the groups decamp to other Gulf Coast or Deep South locations? Or will they use the occasion to return to and express a revival of community life in New Orleans? Two things are certain: Katrina is sure to be satirized as villainess, bimbo, or symbol of mythological flood, and political leaders at all levels will undoubtedly be taken to task. The authors argue that the return of Mardi Gras will be a powerful symbol of the region's return to vitality and its ability to express and celebrate itself.",
  "genres": [
    "Music",
    "Nonfiction"
  ],
  "author": "Roger D. Abrahams",
  "average_rating": "2.60",
  "url": "https://www.goodreads.com/book/show/16468726-blues-for-new-orleans"
}