{
  "title": "The Jewish State",
  "description": "\"It depends on the Jews themselves whether this political pamphlet remains for the present a political romance. If the present generation is too dull to understand it rightly, a future, finer and better generation will arise to understand it. The Jews who wish for a State shall have it, and they will deserve to have it.\" —PrefaceTheodor Herzl's passionate advocacy of the founding of a Jewish state grew out of his conviction that Jews would never be assimilated into the populations in which they lived. Born in Budapest, Hungary in 1860, Herzl encountered anti-Semitism when he attended a scientific secondary school. Later, as a newspaper correspondent in Paris, he was shocked and dismayed by the anti-Semitic prejudice surrounding the notorious Dreyfus affair (Herzl said in later years that it was the Dreyfus affair that had made a Zionist out of him). Herzl concluded that the only solution for the majority of Jews would be organized emigration to a state of their own.He discussed the political and historic rationale for such a homeland in this extraordinary and influential book, first published as a pamphlet, Der Judenstaat , in Vienna in 1896. The Jewish question, he wrote, was not a social or religious question but a national question that could be solved only by making it \"a political world question to be discussed and settled by the civilized nations of the world in council.\" In 1897, at a world congress of Zionism, he declared, \"We want to lay the foundation stone for the house which will become the refuge of the Jewish nation. Zionism is the return to Judaism even before the return to the land of Israel.\"The present volume is a complete and unabridged republication of The Jewish State, reproduced from the edition published by the American Zionist Emergency Council, New York, 1946. Translated by Sylvie D'Avigdor, it includes an introduction by Louis Lipsky, and a biography of Herzl based on the work of Alex Bein. For Jews, scholars, historians, anyone seeking to understand the history of the 20th century, The Jewish State is indispensable reading. This edition makes it widely available in an inexpensive high-quality format.",
  "genres": [
    "History",
    "Politics",
    "Nonfiction",
    "Israel",
    "Jewish",
    "Philosophy",
    "Judaism"
  ],
  "author": "Theodor Herzl",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/164780.The_Jewish_State"
}