{
  "title": "Dead Clown Barbecue",
  "description": "Dark Regions Press is excited to be launching a new collection from author Jeff Strand, read more about the book here: http://www.darkregions.com/books/dead-clown-barbecue-by-jeff-strandFrom the author of Pressure, Dweller and A Bad Day for Voodoo comes a new short story collection featuring seven never-before-printed tales and original cover artwork by Alex McVey. The stories within this collection range from hilarious to downright disturbing, proving that Jeff Strand is still a master at what he's known for: a delicious blend of the humorous and the horrific. Strand fans will take delight in the seven new stories first printed in Dead Clown Barbecue, including \"Pett Semmuteary\" \"Dummy\" \"True Hero\" \"Fangboy and the Troll\" \"Stop Stabbing Me\" \"Pregnancy Test\" and \"Push the Button.\"DescriptionA man who finds a severed nose on a plate on his dining room table. A bell that can summon Satan (maybe). Casual Fridays at work that get out of control. A cheery outlook on the post-apocalyptic landscape. The final thoughts of a doomed skydiver. A girl punished by having to share a bed with her grandmother’s corpse. Revenge via baking a tarantula into a cake. A shocking look at where those awful computer-generated book covers come from. And the lost tale of Fangboy.These are only a few of the demented stories in DEAD CLOWN BARBECUE, a collection of thirty gleefully macabre tales, seven of which were written just for this collection. There’s even a brand new one about a ventriloquist dummy. Those things creep you out, right? You’ll laugh. You’ll scream. Okay...you probably won’t actually scream, unless you already had issues before you started reading, but you might cringe and get a little spooked.“No author working today comes close to Jeff Strand’s perfect mixture of comedy and terror.” - Cemetery Dance",
  "genres": [
    "Horror",
    "Short Stories",
    "Humor",
    "Fiction",
    "Bizarro Fiction",
    "Fantasy",
    "Audiobook"
  ],
  "author": "Jeff Strand",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/16482018-dead-clown-barbecue"
}