{
  "title": "The Wages of Destruction: The Making and Breaking of the Nazi Economy",
  "description": "The idea that Nazi Germany was an unstoppable juggernaut, backed by an efficient, highly industrialized economy, has been central to all accounts of World War II. But what if this was not the case? What if the war had its roots in Germany's weakness, not its strength? This is the radical argument in this pathbreaking book, the first account of the Nazi era for the twenty-first century and our globalized world.There was no aspect of Nazi power untouched by economics, yet Adam Tooze is the first to place economics alongside race and politics at the heart of the story of the Third Reich. And America, in Tooze's view, is the true pivot for Hitler's epic challenge to a shift in the world order. Hitler intuitively understood how Germany's relative poverty in the 1930s was the result not just of global depression, but also of Germany's limited resources. He predicted the dawning of a globalized world in which Europe would be crushed by America's overwhelming power, against which he saw only one last chance: a German super-state dominating Europe. Doing what Europeans had done for three centuries, he sought to carve out an imperial hinterland through one last land grab to the east, to give him the self-sufficiency to prevail in the coming superpower competition. With the odds stacked against him, he launched his underresourced armies on their unprecedented and ultimately futile rampage across Europe.Hitler knew by the summer of 1939 that his efforts to prepare for a long war with the West were doomed to failure. Ideology drove him forward. Hitler became convinced that Jewish elements in Washington, London, and Paris were circling round him, and from 1938, the international \"Jewish question: was synonymous with America in his mind. Even in the summer of 1940, at the moment of Germany's greatest triumphs, Hitler was still haunted by the looming threat of Anglo-American air and sea power, orchestrated by, he believed, the world Jewish conspiracy.Tooze also casts a stark new light on Albert Speer's role in sustaining the Third Reich to its bloody end, after the catastrophe of the Soviet invasion. Speer, Tooze proposes, was no apolitical agent of technocratic efficiency but a Hitler loyalist who would stop at nothing to continue a hopeless battle of attrition, at the cost of tens of millions of lives.The Wages of Destruction is a chilling work of originality and tremendous scholarship that will fundamentally change the way in which we view Nazi Germany and the Second World War.",
  "genres": [
    "History",
    "Economics",
    "Nonfiction",
    "World War II",
    "Politics",
    "Germany",
    "War"
  ],
  "author": "Adam Tooze",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/1648434.The_Wages_of_Destruction"
}