{
  "title": "Vineland",
  "description": "It has been seventeen years since Thomas Pynchon shocked and dazzled readers with his novel Gravity's Rainbow. Here, with Vineland, Pynchon is back, introducing a cast of individuals so quirky, so vulnerable, and so terribly ill equipped to deal with each other that they could only hail from this world.It is 1984 in Northern California, where a group of Americans are struggling with the consequences of their lives in the sixties, still run by the passions of those times, sexual and political, which have refused to die. Zoyd Wheeler is preparing for his annual act of televised insanity (for which he receives a government stipend as an official mental degenerate) when an unwelcome face appears from out of his past with news that an old nemesis, Federal Prosecutor Brock Vond, has come storming into Vineland at the head of a heavily armed strike force. Zoyd immediately goes into hiding and sends his daughter, Prairie, off with her violence-loving drummer boyfriend on a Mob wedding gig out of town. And there's cause for worry — Brock Vond has a pathological interest in Zoyd's ex-wife, Frenesi Gates, and intends to use Prairie as a pawn against the mother she can't even remember. Frenesi is now an easy target because her job as an FBI sting specialist has just been cut from the Reagan budget, and she's out in the cold. Meanwhile, at the wedding festivities, Prairie will meet someone in a position to help uncover her mother's dark history as the object of Brock's malevolence and desire.Combining elements of daytime drama and the political thriller, Vineland becomes ﻿a strange evocation of twentieth-century America — of the times we live in and the forces we live by and with — as it follows the orbits of old acquaintances headed for a less than harmonic convergence.",
  "genres": [
    "Fiction",
    "Literature",
    "Novels",
    "American",
    "Literary Fiction",
    "20th Century",
    "Classics"
  ],
  "author": "Thomas Pynchon",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/1649432.Vineland"
}