{
  "title": "Yul: The Man Who Would Be King : A Memoir of Father and Son",
  "description": "Here is a dazzling biographical memoir of one of the most charismatic figures of stage and screen--Yul Brynner--by Yul's only son.    Yul Brynner was Hollywood's ultimate enigma, easily the entertainment industry's most exotic male star. He built a career on the lie that he was born of a gypsy woman and cut his teeth in the wilds of the Siberian taiga. The truth was even more remarkable than that.    Here at last, is the man behind the legend--the half-Swiss, half-Tatar boy who grew up in China and Paris, smoked opium with Jean Cocteau, caroused with gypsies, worked as a trapeze artist, emigrated to America, married a starlet, and embarked on one of the most dynamic double careers Broadway and Hollywood would ever know.    Yul Brynner electrified audiences with his portrayal of the tragic and despotic King ofSiam, a role he performed more than 4,000 times over a period of thirty years.It was a role that eventually became indistinguishable from the man, for YulBrynner was as much in love with power--and as much a victim of its illusions--as the king he played so brilliantly on stage. He was also every bit as mesmerizing and just as flawed.    Yul's fame and riches transformed him. The year 1957 marked his Academy Award triumph as best actor in The King and I . It also marked the start of a torrential megalomania. Yul began to go through friends, wives, lovers, deals and associates with the rapacity of a Mongol chieftain.    Yul is the moving tale of a man who became king, and a king who became slave to his own extravagance. But it is also a spellbinding book about a star-studded era. The cast includes such greats as Cecil B. DeMille, Frank Sinatra, Muhammad Ali, Marlon Brando, RichardBurton, and Elizabeth Taylor. And then there are Yul's Virginia Gilmore, Marilyn Monroe, Judy Garland, Ingrid Bergman, Marlene Dietrich, and JoanCrawford, among many others.    Rock Brynner was the most attentive witness to Yul's astonishing life. In this deeply personal and loving memoir of a man who could be anything but loveable, Rock finally comes to terms with the tyrannical star, Rabelaisian womanizer, extravagant egoist, and self-inventor that was his father.    A powerful and haunting book, Yul sets straight the record in Yul Brynner, and pays a tribute of truth to a magical actor, a difficult father, and an extraordinary man.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Memoir",
    "Biography Memoir"
  ],
  "author": "Rock Brynner",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/1649629.Yul"
}