{
  "title": "Diversity: Leaders Not Labels: A New Plan for a the 21st Century",
  "description": "Stedman Graham, bestselling author of You Can Make It Happen , teaches that in the 21st century your talent and skills above all else will define your value. In Leaders Not Labels , Graham shows you how to break out of the box that keeps you from growing to your full potential, and reveals that success is truly based on results, performance, and excellence. Diversity is literally changing the face of our nations. Workers of all backgrounds are merging into a global marketplace, while businesses are challenged by a shortage of talent and the need to integrate a wide range of cultures. In this global environment, diversity has become a permanent business characteristic; opportunities will be plentiful for both people and businesses. Graham indicates that we do not have to become a member of anyone else's culture to play a key role, but must maintain and assert our own identities while respecting others' uniqueness in our workforces and communities. He helps us to understand that developing leaders rather than accepting labels is ultimately the best way to preserve culture and create a legacy. Leaders Not Labels studies diversity as no one has before, exploring different cultures and their histories to help you understand that everyone has had challenges and that the transformation process is the same for each of us. Hard work, sacrifice, talent, and self-motivation are the tools you need for the future. By showcasing individuals who have successfully transcended labels to become leaders, Graham helps readers begin to move from their history to carving their own individual pathways to success, based on authenticity as well as the talents and skill they bring to the workforce. \"What is most important is breaking through labels and understanding who you are,\" says Graham. \"Realize that everyone brings uniqueness, talents, and skills that add value to our experiences, work environments, businesses, and communities. When you operate from this perspective, you will emerge in the 21st century as a true leader to yourself, to others, and to society.\"",
  "genres": [],
  "author": "Stedman Graham",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/1650484.Diversity"
}