{
  "title": "Outfoxed",
  "description": "From the bestselling author of the landmark work Rubyfruit Jungle comes an engaging, original new novel that only Rita Mae Brown could have written. In the pristine world of Virginia foxhunting, hunters, horses, hounds, and foxes form a lively community of conflicting loyalties, where the thrill of the chase and the intricacies of human-animal relationships are experienced firsthand--and murder exposes a proud Southern community's unsavory secrets. . . .As Master of the prestigious Jefferson Hunt Club, Jane Arnold, known as Sister, is the most revered citizen in the Virginia Blue Ridge Mountain town where a rigid code of social conduct and deep-seated tradition carry more weight than money. Nearing seventy, Sister now must select a joint master to ensure a smooth transition of leadership after her death. It is an honor of the highest order--and one that any serious social climber would covet like the Holy Grail.Virginian to the bone with a solid foxhunting history, Fontaine Buruss is an obvious candidate, but his penchant for philandering and squandering money has earned him a less than sparkling reputation. And not even Sister knows about his latest tawdry scandal. Then there is Crawford Howard, a Yankee in a small town where Rebel bloodlines are sacred. Still, Crawford has money--lots of it--and as Sister is well aware, maintaining a first-class hunt club is far from cheap.With the competition flaring up, Southern gentility flies out the window. Fontaine and Crawford will stop at nothing to discredit each other. Soon the entire town is pulled into a rivalry that is spiraling dangerously out of control. Even the animals have strong opinions, and only Sister is able to maintain objectivity. But when opening hunt day ends in murder, she, too, is stunned.Who was bold and skilled enough to commit murder on the field? It could only be someone who knew both the territory and the complex nature of the hunt inside out. Sister knows of three people who qualify--and only she, with the help of a few clever foxes and hounds, can lay the trap to catch the killer.A colorful foray into an intriguing world, Outfoxed features a captivating cast of Southerners and their unforgettable animal counterparts. Rita Mae Brown has written a masterful novel that surprises, delights, and enchants.",
  "genres": [
    "Mystery",
    "Fiction",
    "Cozy Mystery",
    "Animals",
    "Horses",
    "Mystery Thriller",
    "Cozy"
  ],
  "author": "Rita Mae Brown",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/165333.Outfoxed"
}