{
  "title": "Loose Lips",
  "description": "If you crossed Mitford, North Carolina, with Peyton Place, you might come up with Runnymede, Maryland, the most beguiling of Southern towns. In Loose Lips , Rita Mae Brown revisits Runnymede and the beloved characters introduced in Six of One and Bingo , serving up an exuberant portrayal of small-town sins and Southern mores, set against a backdrop of homefront life during World War II.\"I'm afraid life is passing me by,\" Louise told her sister.\"No, it's not,\" Juts said. \"Life can't pass us by. We are life.\"In the picturesque town of Runnymede, everyone knows everyone else's business, and the madcap antics of the battling Hunsenmeir sisters, Julia (Juts) and Louise, have kept the whole town agog ever since they were children. Now, in the fateful year of 1941, with America headed for war, the sisters are inching toward forty...and Juts is unwise enough to mention that unspeakable reality to her sister.The result is a huge brawl that litters Cadwalder's soda fountain with four hundred dollars' worth of broken glass. To pay the debt, the sisters choose a surprisingly new direction. Suddenly they are joint owners of The Curl 'n' Twirl beauty salon, where discriminating ladies meet to be primped, permed, and pampered while dishing the town's latest dirt.As Juts and Louise become Runnymede's most unlikely new career women, each faces her share of obstacles. Restless Juts can't shake her longing for a baby, while holier-than-thou Louise is fit to be tied over her teenage daughter's headlong rush toward scandal. As usual, the sisters rarely see eye to eye, and there are plenty of opinions to go around. Even the common bond of patriotic duty brings wildly unexpected results when the twosome joins the Civil Air Patrol, watching the night sky for German Stukas. But loose lips can sink even the closest relationships, and Juts and Louise are about to discover that some things are best left unsaid.Spanning a decade in the lives of Louise, Juts, and their nearest and dearest, including the incomparable Celeste Chalfonte, Loose Lips is an unforgettable tale of love and loss and the way life can always throw you a curveball. By turns poignant and hilarious, it is deepened by Rita Mae Brown's unerring insight into the human heart.",
  "genres": [
    "Fiction",
    "Mystery",
    "Chick Lit",
    "LGBT",
    "Lesbian Fiction",
    "Novels",
    "Historical Fiction"
  ],
  "author": "Rita Mae Brown",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/165319.Loose_Lips"
}