{
  "title": "Death by Drama and Other Medieval Urban Legends",
  "description": "Part of every legend is true. Or so argues Jody Enders in this fascinating look at early French drama and the way it compels us to consider where the stage ends and where real life begins. This ambitious and bracing study explores fourteen tales of the theater that are at turns dark and dangerous, sexy and scandalous, humorous and frightening—stories that are nurtured by the confusion between truth and fiction, and imitation and enactment, until it becomes impossible to tell whether life is imitating art, or art is imitating life.Was a convicted criminal executed on stage during a beheading scene? Was an unfortunate actor driven insane while playing a madman? Did a theatrical enactment of a crucifixion result in a real one? Did an androgynous young man seduce a priest when portraying a female saint? Enders answers these and other questions while presenting a treasure trove of tales that have long seemed true but are actually medieval urban legends. On topics ranging through politics, religion, marriage, class, and law, these tales, Enders argues, do the cultural work of all urban they disclose the hopes, fears, and anxieties of their tellers. Each one represents a medieval meditation created or dramatized by the theater with its power to blur the line between fiction and reality, engaging anyone who watches, performs, or is represented by it. Each one also raises pressing questions about the medieval and modern world on the eve of the Reformation, when Europe had never engaged more anxiously and fervently in the great debate about what was real, what was pretend, and what was pretense.Written with elegance and flair, and meticulously researched, Death by Drama and Other Medieval Urban Legends will interest scholars of medieval and Renaissance literature, history, theater, performance studies, and anyone curious about urban legends.",
  "genres": [
    "France"
  ],
  "author": "Jody Enders",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/1653741.Death_by_Drama_and_Other_Medieval_Urban_Legends"
}