{
  "title": "The Red Sea Sharks",
  "description": "One of the most iconic characters in children’s books \t\t\t\tHergé’s classic comic book creation Tintin is one of the most iconic characters in children’s books. These highly collectible editions of the original 24 adventures will delight Tintin fans old and new. Perfect for lovers of graphic novels, mysteries and historical adventures.\t\t\t\tThe world’s most famous travelling reporter flies out to Khemed to investigate a case of arms smuggling and the involvement of an old friend. There’s a rebellion in Khemed and the Emir’s life is in danger!\t\t\t\tHe has entrusted his mischievous son to Captain Haddock’s care, but when an old friend of Tintin’s is caught smuggling arms to the Khemed rebels, they must jump straight on a plane to find out what on earth is going on …\t\t\t\tJoin the most iconic character in comics as he embarks on an extraordinary adventure spanning historical and political events, and thrilling mysteries. Still selling over 100,000 copies every year in the UK and having been adapted for the silver screen by Steven Spielberg and Peter Jackson in 2011.\t\t\t\tThe Adventures of Tintin continue to charm more than 80 years after they first found their way into publication. Since then an estimated 230 million copies have been sold, proving that comic books have the same power to entertain children and adults in the 21st century as they did in the early 20th.\t\t\t\tHergé (Georges Remi) was born in Brussels in 1907. Over the course of 54 years he completed over 20 titles in The Adventures of Tintin series, which is now considered to be one of the greatest, if not the greatest, comics series of all time. \t\t\t\tHave you collected all the graphic novel adventures?\t\t\t\tTintin in the Land of the SovietsTintin in AmericaTintin: Cigars of the PharaohTintin: The Blue LotusTintin: The Broken EarTintin: The Black IslandTintin: King Ottakar’s SceptreTintin: The Crab with the Golden ClawsTintin: The Shooting StarTintin: The Secret of the UnicornTintin: Red Rackham’s TreasureTintin: The Seven Crystal BallsTintin: Prisoners of the SunTintin: Land of Black GoldTintin: Destination MoonTintin: Explorers of the MoonTintin: The Calculus AffairTintin: The Red Sea SharksTintin in TibetTintin: The Castafiore EmeraldTintin: Flight 714 to SydneyThe Adventures of Tintin and the PicarosTintin and Alph-Art",
  "genres": [
    "Comics",
    "Graphic Novels",
    "Bande Dessinée",
    "Adventure",
    "Fiction",
    "Childrens",
    "Comic Book"
  ],
  "author": "Hergé",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/165526.The_Red_Sea_Sharks"
}