{
  "title": "One World: A Global Anthology of Short Stories",
  "description": "This book is made up of twenty-three stories, each from a different author from across the globe. All belong to one world, united in their diversity and ethnicity. And together they have one aim: to involve and move the reader.The range of authors takes in such literary greats as Chimamanda Ngozi Adichie and Jhumpa Lahiri, and emerging authors such as Elaine Chiew, Petina Gappah, and Henrietta Rose-Innes.The members of the collective are:Elaine Chiew (Malaysia)Molara Wood (Nigeria)Jhumpa Lahiri (United States)Martin A Ramos (Puerto Rico)Lauri Kubutsile (Botswana)Chika Unigwe (Nigeria)Ravi Mangla (United States)Chimamanda Ngozi Adichie (Nigeria)Skye Brannon (United States)Jude Dibia (Nigeria)Shabnam Nadiya (Bangladesh)Petina Gappah (Zimbabwe)Ivan Gabirel Reborek (Australia)Vanessa Gebbie (Britain)Emmanual Dipita Kwa (Cameroon)Henrietta Rose-Innes (South Africa)Lucinda Nelson Dhavan (India)Adetokunbo Abiola (Nigeria)Wadzanai Mhute (Zimbabwe)Konstantinos Tzikas (Greece)Ken Kamoche (Kenya)Sequoia Nagamatsu (United States)Ovo Adagha (Nigeria)From the Introduction:The concept of One World is often a multi-colored tapestry into whichsundry, if not contending patterns can be woven. for those of us who workedon this project, 'One World' goes beyond the everyday notion of the globeas a physical geographic entity. Rather, we understand it as a universal idea, one that transcends national boundaries to comment on the most prevailingaspects of the human condition.This attempt to redefine the borders of the world we live in through theshort story recognizes the many conflicting issues of race, language, economy, gender and ethnicity, which separate and limit us. We readily acknowledge, however, that regardless of our differences or the disparities in our stories, weare united by our humanity.We invite the reader on a personal journey across continents, countries, cultures and landscapes, to reflect on these beautiful, at times chaotic, renditionson the human experience. We hope the reach of this path will transcend theborders of each story, and perhaps function as an agent of change.Welcome to our world.",
  "genres": [
    "Short Stories",
    "Fiction",
    "Anthologies",
    "Africa",
    "International",
    "Realistic Fiction",
    "Asia"
  ],
  "author": "Chris Brazier",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/16566190-one-world"
}