{
  "title": "This Craft of Verse",
  "description": "The Marvelous Borges Has another writer written to greater effect with fewer words? Whether in the form of the short story, essay, or poem, Jorge Luis Borges routinely performed astonishing turns of imagination in the length of a spare handful of pages. Borges's writings are models of succinct power; by temperament and by artistic ambition, he was a minimalist, given to working his wonders on the smallest scale possible. A master of fiction, Borges never published a novel -- or even, it seems, felt the lure of attempting one. He professed a heartfelt conservative piety for the older literary forms, for the saga and epic, the lyric and tale, but he made radically inventive uses of the traditional forms in his own literary labors.Borges possessed an uncommon complement of gifts. He was capable of launching startling, even unnerving flights of cerebral fantasy or metaphor but owned a first-rate mind and a critical intelligence entirely at ease with the metaphysical abstractions of the philosophers and theologians. All the same, in his intellectual bearing Borges was a skeptic, critical of but not disparaging or cynical toward the truth claims of systematic philosophical or religious thought. He was at once a genuine artist and a judicious, sympathetic critic.The posthumous publication of This Craft of Verse, Borges's 1967 Norton Lectures, reacquaints us with his splendid critical faculties. The volume is a welcome gift, too, reminding us of Borges's generous insistence on identifying with his fellow readers, who are ever ready to be transported by their love for literature. (Harvard University Press scheduled release of the remastered recordings for the fall of 2000.) Enough cause, then, to celebrate the recent discovery of these long-stored and forgotten tape recordings of lectures delivered at Cambridge more than three decades ago. By the late 1960s, Borges was quite blind and incapable of consulting notes when delivering an address. The lectures transcribed and collected here -- with their frequent quotations from the European languages, both ancient and modern -- were delivered extemporaneously, performances made possible by Borges's own powers of recollection (which were, it need hardly be said, formidable).In life and in literary manner Borges was a cosmopolitan, his range of reference almost inexhaustibly wide. His reading embraced Homer and Virgil, the Icelandic sagas and Beowulf, Chaucer and Milton, Rabelais and Cervantes, Kafka and Joyce. This Craft of Verse addresses issues central to the art of poetry: essential metaphors, epic poetry, the origins of verse, and poetic meaning. The lectures conclude with a statement of Borges's own \"poetic creed.\" This slim but profound volume, however, ranges much farther afield. Borges serves up intriguing asides on the novel, on literary criticism and history, and on theories of translation. Ultimately, his comments touch on the largest questions raised by literature and language and the thornier puzzles of human communication.The lectures convey Borges's evident delight in English and his eloquence and ease in the language, even when facing a distinguished audience of native English speakers. But perhaps that is not so surprising, after all, for Borges carried on a lifelong love affair with the English language and the literatures of the British Isles and North America. His parents, who were fluent in English, introduced Borges to the language when he was a young boy, and Borges was allowed the run of his father's extensive library of English classics. Among the bookshelves of his father's study he first encountered authors he would admiringly cite over a long literary life: Wells and Kipling and Chesterton and Shaw, to name only a few. And the study of Old English became a hobby to which Borges remained passionately devoted until his death. The English language he counted as his second (and perhaps even preferred) home.Since the 1960s, when the then relatively obscure Buenos Aires writer was first introduced to English-speaking readers in translations of the classic Ficciones and the anthology Labyrinths, it has been apparent that Borges survives the ordeal of translation without obvious loss. His power remains intact on the page. This he owes to the virtues of his prose style, to the elegant simplicity and naturalness that, as the transcribed Norton Lectures demonstrate, were indistinguishable from the man. Borges's style is classical: concise, understated, cleanly cadenced, strict in its devotion to the old-fashioned values of clarity and logical order. Whether in his native Spanish or in his adopted English, Borges is a writer and lecturer who impresses us with his singular intellectual wit, charm, and refinement.This Craft of Verse makes an exquisite addition to a distinguished series and offers, moreover, invaluable insights into the mind and work of a true modern master. Between its covers, this small book holds the pleasures of the modest, warm voice of a writer who stands unquestionably with the strongest literary talents of the 20th century.--Gregory Tietjen, Academic & Scholarly Editor",
  "genres": [
    "Poetry",
    "Nonfiction",
    "Essays",
    "Writing",
    "Literature",
    "Literary Criticism",
    "Philosophy"
  ],
  "author": "Jorge Luis Borges",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/16570.This_Craft_of_Verse"
}