{
  "title": "Becoming Marie Antoinette",
  "description": "This enthralling confection of a novel, the first in a new trilogy, follows the transformation of a coddled Austrian archduchess into the reckless, powerful, beautiful queen Marie Antoinette. Why must it be me? I wondered. When I am so clearly inadequate to my destiny?Raised alongside her numerous brothers and sisters by the formidable empress of Austria, ten-year-old Maria Antonia knew that her idyllic existence would one day be sacrificed to her mother’s political ambitions. What she never anticipated was that the day in question would come so soon.Before she can journey from sunlit picnics with her sisters in Vienna to the glitter, glamour, and gossip of Versailles, Antonia must change everything about herself in order to be accepted as dauphine of France and the wife of the awkward teenage boy who will one day be Louis XVI. Yet nothing can prepare her for the ingenuity and influence it will take to become queen.Filled with smart history, treacherous rivalries, lavish clothes, and sparkling jewels, Becoming Marie Antoinette will utterly captivate fiction and history lovers alike.Praise for Becoming Marie Antoinette“A thoroughly enjoyable novel, brimming with delightful details. Grey writes eloquently and with charming humor, bringing ‘Toinette’ vividly to life as she is schooled and groomed—molded, quite literally—for a future as Queen of France, an innocent pawn in a deadly political game.”—Sandra Gulland, bestselling author of Mistress of the Sun and the Josephine Bonaparte trilogy“In her richly imagined novel, Juliet Grey meticulously recreates the sumptuous court of France's most tragic queen. Beautifully written, with attention paid to even the smallest detail, Becoming Marie Antoinette will leave readers wanting more!\"—Michelle Moran, bestselling author of Madame Tussaud“A lively and sensitive portrait of a young princess in a hostile court, and one of the most sympathetic portrayals of the doomed queen.”—Lauren Willig, bestselling author of the Pink Carnation series “Wonderfully delectable and lusciously rich, an elegant novel to truly savor. Juliet Grey’s Marie Antoinette is completely absorbing.”—Diane Haeger, author of The Queen’s Rival“[A] sympathetic take on the fascinating and doomed Marie Antoinette.”—Publishers Weekly",
  "genres": [
    "Historical Fiction",
    "Historical",
    "France",
    "Fiction",
    "18th Century",
    "Romance",
    "French Revolution"
  ],
  "author": "Juliet Grey",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/10713759-becoming-marie-antoinette"
}