{
  "title": "Becoming a Therapist",
  "description": "Praise for \"Becoming a Therapist\"\"This resource is filled with practical and personal advice, relevant stories, and examples, and reads more like help from a friend than a typical textbook.\"-Roberta L. Nutt, PhD, ABPP, Visiting Professor and Training Director, Counseling Psychology Program, University of Houston\"Ah, now this is the book I wish had been available when I entered the field. Tom Skovholt has defined the initial experiences and followed the process through to the culmination of the therapeutic experience in a truly great book. \"Becoming a Therapist\" is a major contribution to our field.\"-Arthur (Andy) M. Horne, Dean and Distinguished Research Professor, College of Education, The University of Georgia; President-Elect, Society of Counseling Psychology\"\"Becoming a Therapist\"'s informal style is accessible and engaging and yet soundly grounded in evidence and in the wisdom Skovholt has developed through his career-long research on psychotherapists and their development.\"-Rodney K. Goodyear, PhD, Professor, School of Education, University of Redlands; Emeritus Professor of Education (Counseling Psychology), University of Southern CaliforniaEssential guidance for mental health professionals navigating the start of their helping careersWritten for those entering a career in the helping professions, \"Becoming a On the Path to Mastery\" explores the therapeutic career path for new practitioners, painting a vivid portrait of the novice therapist's journey.This practical book guides you in using the helping relationship to improve the lives of others, whether your chosen profession is in counseling, clinical psychology, social work, school counseling, addictions counseling, family therapy, medicine, community counseling, pastoral counseling, or academic advising.Destined to become the resource every new practitioner turns to again and again, \"Becoming a Therapist\" prepares you for the reality of what it means to be a beginning therapist, with relevant discussion The fifteen indispensable qualities of every mental health professionalThe unfolding practitioner selfSelf-care for burnout prevention and resiliency developmentThe importance of culturally competent practice to practitioner expertisePractice, research/theory, and personal the practitioner's learning triangleThe significance of peer relationships in the novice experienceSteeped in author Thomas Skovholt's years of experience, \"Becoming a Therapist\" thoroughly and clearly illustrates the excitement, intensity, anxiety-and, ultimately, the satisfaction-you can expect as a helping professional.",
  "genres": [
    "Psychology"
  ],
  "author": "Thomas M. Skovholt",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/16578302-becoming-a-therapist"
}