{
  "title": "Wolves Among Sheep: The True Story of Murder in a Jehovah's Witness Community",
  "description": "There are tragedies in life. The young child killed by a drunk driver. The family devastated by an early morning house fire. These events sadden us and make us reflect. \"There but for the grace of God...\" But if tragedy has a degree, there is surely none more unspeakable that the cold-blooded, brutal, shotgun murder of two beautiful children. Such was the case when Kim Anderson's estranged husband, Jeff Anderson, killed her and her two children-Juri, aged 10, and Lindsay, aged 8. Juri died with his arms wrapped around his sister, in a futile effort to protect her. Wolves Among Sheep is unlike any book you have read-or are likely to read again. It is written by the person most affected by the deaths of these two innocent children and their mother-their father and Kim's first husband, James Kostelniuk. Compelled to write the book as an expression of sorrow and love for the family so cruelly taken from him, Kostelniuk also had a deep need to arrive at some understanding of why these senseless murders took place. This question led him to expose the influence of the Jehovah's Witness organization that wielded total control over Kim's life, as it had over himself until he found the resolve to break with the organization. In making that break, Kostelniuk knew he would be forever shunned by the Witness community and, according to its laws, forbidden contact with his own wife and children. The convicted killer, Jeff Anderson, was also a member of the Jehovah's Witnesses. In a bizarre turn of events, Anderson began to correspond with Kostelniuk from prison, and his correspondence provides a chilling look into the mind of a murderer who held back a terrible secret from the world. After serving fifteen years, the Canadian criminal justice system offered Jeff Anderson the opportunity of a faint-hope hearing for early parole from his 25-year sentence. In February 2009, Anderson's file was opened up for public scrutiny at his first National Parole Board hearing at William Head Institution near Victoria, British Columbia. That parole hearing confirmed Kostelniuk's suspicions and revealed even more about this offender than anyone outside the system had known up until that time. Wolves Among Sheep is a riveting read that explores the darkest parts of the human heart and mind, and surprises us with the depth of its love and compassion.",
  "genres": [
    "Nonfiction",
    "True Crime"
  ],
  "author": "James Kostelniuk",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/1658394.Wolves_Among_Sheep"
}