{
  "title": "Crimes in Southern Indiana: Stories",
  "description": "A ferocious debut that puts Frank Bill's southern Indiana on the literary map next to Cormac McCarthy's eastern Tennessee and Daniel Woodrell's Missouri OzarksCrimes in Southern Indiana is the most blistering, vivid, flat-out fearless debut to plow into American literature in recent years. Frank Bill delivers what is both a wake-up call and a gut punch. Welcome to heartland America circa right about now, when the union jobs and family farms that kept the white on the picket fences have given way to meth labs, backwoods gunrunners, and bare-knuckle brawling.Bill's people are pressed to the brink--and beyond. There is Scoot McCutchen, whose beloved wife falls terminally ill, leaving him with nothing to live for--which doesn't quite explain why he brutally murders her and her doctor and flees, or why, after years of running, he decides to turn himself in. In the title story, a man who has devolved from breeding hounds for hunting to training them for dog-fighting crosses paths with a Salvadoran gangbanger tasked with taking over the rural drug trade, but who mostly wants to grow old in peace. As Crimes in Sourthern Indiana unfolds, we witness the unspeakable, yet are compelled to find sympathy for the depraved.Bill's southern Indiana is haunted with the deep, authentic sense of place that recalls the best of Southern fiction, but the interconnected stories bristle with the urban energy of a Chuck Palahniuk or a latter-day Nelson Algren and rush with the slam-bang plotting of pulp-noir crime writing a la Jim Thompson. Bill's prose is gritty yet literary, shocking, and impossible to put down. A dark evocation of the survivalist spirit of the working class, this is a brilliant debut by an important new voice.",
  "genres": [
    "Short Stories",
    "Fiction",
    "Crime",
    "Southern Gothic",
    "Noir",
    "Southern",
    "Thriller"
  ],
  "author": "Frank Bill",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/10713935-crimes-in-southern-indiana"
}