{
  "title": "Not So Tiny Tim",
  "description": "Blinded to the Present...Avoiding the Future...Running from the PastThe Smutketeers Present: A Kinky Christmas Carol! The Knight Family is a wealthy, powerful Chicago clan that knows everything there is to know about making money—but they have plenty to learn about love. In this three series novella—Eden Bradley's Getting Scrooged, Robin L Rotham's Not So Tiny Tim and R.G. Alexander's Marley in Chains—you’ll meet Holly Knight, her nephew Tim, and her cousin Marley Knight-Williams as they face their ghosts, fulfill their fantasies and finally discover the magic of Christmas.Avoiding the future…Video game mogul, philanthropist and heir to the Knight empire, Tim Crichton has three F-zones—the friend zone, the family zone, and the, er… fun-buddy zone. No crossover is allowed because it might create a fourth—the forever zone—and Tim knows forever just isn’t in the cards for him.Miranda Girard has always known she and Tim were meant to be together, but when she got tired of waiting and made a move, he rejected her. Now it’s time for their Christmas reunion dinner and she’s damn well going to put on a happy face and attend—after she stops at the bar for a little liquid courage.Peter Vaughn can’t wait for his new house to be finished so he can move out of Tim’s apartment—living with a man he wants and can’t have gets old quick. But work on the house has ground to a halt and he’s stuck there until after the new year.It all seems hopeless until a jolly old doorman nudges Peter and Miranda together, and a little Christmas magic quickly escalates to a scorching holiday encounter that will either rescue Tim from a lonely future…or cost him the two most important people in his life.",
  "genres": [
    "Menage",
    "Erotica",
    "Christmas",
    "BDSM",
    "Romance",
    "M M Romance",
    "Contemporary"
  ],
  "author": "Robin L. Rotham",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/16588969-not-so-tiny-tim"
}