{
  "title": "Christmas Stories",
  "description": "Now joining Everyman’s Library—the most extensive and distinguished collectible library of the world’s greatest works—is an appealing new collection in a small Pocket Classics format, perfect for gift giving and reading pleasure.Christmas Stories is a treasury of short fiction by great writers of the past two centuries—from Dickens and Tolstoy to John Updike and Alice Munro. As a literary subject, Christmas has inspired everything from intimate domestic dramas to fanciful flights of the imagination, and the full range of its expression is represented in this wonderfully engaging anthology. Goblins frolic in the graveyard of an early Dickens tale and a love-struck ghost disrupts a country estate in Elizabeth Bowen’s “Green Holly.” The plight of the less fortunate haunts Chekhov’s “Vanka” and Willa Cather’s “The Burglar’s Christmas” but takes a boisterously comic turn in Damon Runyon’s “Dancing Dan’s Christmas” and in John Cheever’s “Christmas Is a Sad Season for the Poor.” From Vladimir Nabokov’s intensely moving story of a father’s grief in “Christmas” to Truman Capote’s hilarious yet heartbreaking “A Christmas Memory,” from Grace Paley’s Jewish girl starring in the Christmas pageant in “The Loudest Voice” to the dysfunctional family ski holiday in Richard Ford’s “Crèche”—each of the stories gathered here is imbued with Christmas spirit (of one kind or another), and all are richly and indelibly entertaining.TABLE OF CONTENTSCharles DickensThe Story of the Goblins Who Stole a Sexton(from The Pickwick Papers)Nikolai GogolThe Night Before ChristmasArthur Conan DoyleThe Blue CarbuncleAnthony TrollopeChristmas at Thompson HallLeo TolstoyWhere Love is, God isAnton CheckhovVankaWilla CatherThe Burglar's ChristmasO. HenryA Chapparal Christmas GiftSaki (H.H. Munro)Reginald's Christmas RevelVladimir NabokovChristmasDamon RunyonDancing Dan's ChristmasEvelyn WaughBella Fleace Gave a PartyElizabeth BowenGreen HollyJohn CheeverChristmas is a Sad Season for the PoorTruman CapoteA Christmas MemoryJohn UpdikeThe Carol SingMuriel SparkChristmas FugueGrace PaleyThe Loudest VoiceAlice MunroThe Turkey SeasonRichard FordCreche",
  "genres": [
    "Christmas",
    "Short Stories",
    "Fiction",
    "Classics",
    "Anthologies",
    "Holiday",
    "Literary Fiction"
  ],
  "author": "Diana Secker Tesdell",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/1658933.Christmas_Stories"
}