{
  "title": "The DAO of Capital: Austrian Investing in a Distorted World",
  "description": "As today's preeminent doomsday investor Mark Spitznagel describes his Daoist and roundabout investment approach, \"one gains by losing and loses by gaining.\" This is Austrian Investing, an archetypal, counterintuitive, and proven approach, gleaned from the 150-year-old Austrian School of economics, that is both timeless and exceedingly timely.In The Dao of Capital, hedge fund manager and tail-hedging pioneer Mark Spitznagel--with one of the top returns on capital of the financial crisis, as well as over a career--takes us on a gripping, circuitous journey from the Chicago trading pits, over the coniferous boreal forests and canonical strategists from Warring States China to Napoleonic Europe to burgeoning industrial America, to the great economic thinkers of late 19th century Austria. We arrive at his central investment methodology of Austrian Investing, where victory comes not from waging the immediate decisive battle, but rather from the roundabout approach of seeking the intermediate positional advantage (what he calls shi), of aiming at the indirect means rather than directly at the ends. The monumental challenge is in seeing time differently, in a whole new intertemporal dimension, one that is so contrary to our wiring.Spitznagel is the first to condense the theories of Ludwig von Mises and his Austrian School of economics into a cohesive and--as Spitznagel has shown--highly effective investment methodology. From identifying the monetary distortions and non-randomness of stock market routs (Spitznagel's bread and butter) to scorned highly-productive assets, in Ron Paul's words from the foreword, Spitznagel \"brings Austrian economics from the ivory tower to the investment portfolio.\"The Dao of Capital provides a rare and accessible look through the lens of one of today's great investors to discover a profound harmony with the market process--a harmony that is so essential today.",
  "genres": [
    "Economics",
    "Finance",
    "Business",
    "Nonfiction",
    "Money",
    "Philosophy",
    "History"
  ],
  "author": "Mark Spitznagel",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/16599562-the-dao-of-capital"
}