{
  "title": "J.R. Rain 6-copy Boxed Set",
  "description": "Six bestselling novels by J.R. Rain, MOON DANCEMother, wife, private investigator...vampire. Six years ago federal agent Samantha Moon was the perfect wife and mother, your typical soccer mom with the minivan and suburban home. Then the unthinkable happens, an attack that changes her life forever. And forever is a very long time for a vampire.Now the world at large thinks Samantha has developed a rare skin disease, a disease which forces her to quit her day job and stay out of the light of the sun. Now working the night shift as a private investigator, Samantha is hired by Kingsley Fulcrum to investigate the murder attempt on his life, a horrific scene captured on TV and seen around the country. But as the case unfolds, Samantha discovers Kingsley isn't exactly what he appears to be; after all, there is a reason why he survived five shots to the head.VAMPIRE MOONNow in VAMPIRE MOON, sequel to MOON DANCE, private investigator Samantha Moon finds herself hunting down a powerful crime lord and protecting an innocent woman from her ruthless ex-husband — all while two very different men vie for her heart. And as the stakes grow higher and her cases turn personal, Samantha Moon will do whatever it takes to protect the innocent and bring two cold-blooded killers to justice — her own brand of justice.DARK HORSEWhen high school student Derrick Booker, the only black student at a posh Orange County high school, is accused of killing his white girlfriend, ex-college football hero and detective Jim Knighthorse is hired to dig a little deeper into the murder. It doesn't take long for Knighthorse to realize that not all is as it seems at tranquil Huntington High, from a band director who preys on the innocent to a vice-principal with a secret agenda of her own. Not to mention someone's hired a professional killer to keep Knighthorse permanently off the case.THE MUMMY CASEPrivate investigator Jim Knighthorse takes on a very, very cold case. When historian Willie Clarke dies of mysteriously of dehydration in the California deserts, ex-football hero Jim Knighthorse is hired to dig a little deeper--and discovers a shocking connection to one of the West's oldest mysteries.ELVIS HAS NOT LEFT THE BUILDINGIt's tough being the King. Which is why in 1977 Elvis faked his own death and endured massive facial reconstruction surgery, and disappeared from the limelight to live a normal life as the unassuming Aaron King. Unfortunately, leaving fame behind also meant leaving his fortune behind, too, and now Elvis finds himself broke and living in near poverty in a small apartment in Los Angeles. Luckily for him, it turns out he's a pretty good private investigator.Now in his seventies and contemplating a return to music (discreetly, of course), Elvis is hired to solve a baffling missing person case. A young starlet, at the beginning of a promising movie career, has seemingly disappeared off the face of the earth. As Elvis digs deeper, he finds himself surrounded by the seedier elements of Los Angeles, from nefarious Hollywood producers who prey upon the young, to twin brothers with a very dark secret.THE BODY DEPARTEDTwo years ago, a man broke into James Blakely's apartment and shot him in his sleep. Twelve times, killing him instantly. Dead and confused, James discovers he has a he can move on into the afterlife, or he can stay behind. Unfortunately, since James has done some very bad things, moving on into the afterlife can only mean one the fires of Hell. Or so he thinks. Forgoing eternal damnation, James instead chooses to haunt his old apartment building.Faced with the prospect that he is rapidly deteriorating into a state of nothingness, James sets out to save his eternal soul.",
  "genres": [
    "Vampires",
    "Supernatural"
  ],
  "author": "J.R. Rain",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/10714716-j-r-rain-6-copy-boxed-set"
}