{
  "title": "Control And Freedom: Power And Paranoia In The Age Of Fiber Optics",
  "description": "A work that bridges media archaeology and visual culture studies argues that the Internet has emerged as a mass medium by linking control with freedom and democracy. How has the Internet, a medium that thrives on control, been accepted as a medium of freedom? Why is freedom increasingly indistinguishable from paranoid control? In Control and Freedom , Wendy Hui Kyong Chun explores the current political and technological coupling of freedom with control by tracing the emergence of the Internet as a mass medium. The parallel (and paranoid) myths of the Internet as total freedom/total control, she says, stem from our reduction of political problems into technological ones. Drawing on the theories of Gilles Deleuze and Michel Foucault and analyzing such phenomena as Webcams and face-recognition technology, Chun argues that the relationship between control and freedom in networked contact is experienced and negotiated through sexuality and race. She traces the desire for cyberspace to cyberpunk fiction and maps the transformation of public/private into open/closed. Analyzing \"pornocracy,\" she contends that it was through cyberporn and the government's attempts to regulate it that the Internet became a marketplace of ideas and commodities. Chun describes the way Internet promoters conflated technological empowerment with racial empowerment and, through close examinations of William Gibson's Neuromancer and Mamoru Oshii's Ghost in the Shell , she analyzes the management of interactivity in narratives of cyberspace. The Internet's potential for democracy stems not from illusory promises of individual empowerment, Chun argues, but rather from the ways in which it exposes us to others (and to other machines) in ways we cannot control. Using fiber optic networks -- light coursing through glass tubes -- as metaphor and reality, Control and Freedom engages the rich philosophical tradition of light as a figure for knowledge, clarification, surveillance, and discipline, in order to argue that fiber-optic networks physically instantiate, and thus shatter, enlightenment.",
  "genres": [
    "Technology",
    "Nonfiction",
    "Philosophy",
    "Research",
    "Cultural Studies",
    "Academic",
    "Politics"
  ],
  "author": "Wendy Hui Kyong Chun",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/1660572.Control_And_Freedom"
}