{
  "title": "Groupie/Rock Star Bundle",
  "description": "The first two books of the Groupie Rubenesque romance series by author Ginger Voight, is now offered in one economical bundle! Join Andy Foster as she navigates the tumultuous relationship with Giovanni Carnevale, the charismatic lead singer of \"Dreaming in Blue.\" This bad boy rocker keeps Andy under his seductive control for more than three years as their relationship faces off stalkers, groupies, opportunists and all the other trappings of fame. This sizzling contemporary romance series stars a full-figured beauty and the man that wants her, but may never commit. It's a rock and roll fantasy come true for any fan who has ever contemplated the possibilities of nabbing the guy you must share with the world.Book One, Groupie:Andy Foster never expected lightning to strike when she met the enigmatic frontman of an up-and-coming rock band, but Giovanni Carnevale left her thunderstruck. At first it is easy to use her freelance writing career as an excuse to indulge the steamy flirtation from city to city. As she gets ever closer to making her lascivious fantasies a reality, however, she finds herself entangled in the fake and sometimes dangerous world of celebrity where nothing is as it seems, including the celebrities themselves.She hangs on to find something real amidst the illusion, while Giovanni balances what he wants against what he fears most. Over three years they come together and blow apart with the same kind of combustible passion. This keeps them orbiting in the others' stratosphere despite new relationships and bitter betrayals. They are bound together by something they can't fight, something that draws the ire of another fan determined to claim Vanni all to herself.Unknowingly they all race toward a dramatic moment of truth that will leave two people injured, and one dead, with a twist of an ending you may never see coming.Book Two, Rock Star:In the second book in the series, readers get insight into the mind of the romantic hero, Giovanni Carnevale, as he reaches the pinnacle of success as a world wide rock star. Everyone wants a piece of him, but all he wants is the one thing he can't have. He's angry and he's entitled, with ample opportunity to make really bad decisions. The combination proves explosive.Andy must watch from the sidelines as her beloved Vanni falls victim to grifters, scandals and alcoholism thanks to this self-destructive behavior. Things come to an emotional head when his estranged father comes on the scene just when Vanni thinks things can't get any worse.Darkness shadows Graham Baxter as he begins his journey as a paraplegic. The powerful mogul bitterly handles this new vulnerability by lashing out at the people who could help him the most. He needs Andy more than ever, pulling her in yet another hopeless direction. Andy is put in the impossible situation of keeping the most important promise she has ever made, or saving the man that she can't help but love.Author Ginger Voight turns up the scandals, secrets, passion and heartbreak to 11. Flawed characters face excess and all the pitfalls that entails. Disclaimer: This series features a hero you might find you love to hate, a heroine you may want to slap, and frustrating triangles with dubious fidelity. Those who cannot abide \"cheaters,\" who need their bad boys to be mostly good, or who must have a HEA at the end of each book, may be advised to look elsewhere.For everyone else, book 3 (Mogul) releases in February 2013, to bring this roller coaster back into the station.",
  "genres": [
    "Erotica"
  ],
  "author": "Ginger Voight",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/16615732-groupie-rock-star-bundle"
}