{
  "title": "Democracy in America",
  "description": "Democracy in America (1835–1840) is arguably the most perceptive and influential book ever written about American politics and society. This Library of America volume presents Alexis de Tocqueville's masterpiece in an entirely new translation, the first to capture fully the precision and grace of his style while providing a rigorous and faithful rendering of his profound ideas and observations.A young aristocratic lawyer, Tocqueville came to the United States in 1831 with his friend and fellow magistrate Gustave de Beaumont to study American penitentiary systems. During their nine-month visit they conducted interviews with more than 200 people on American politics, law, and social practices. After returning to France, Tocqueville read hundreds of books and documents while reflecting on what his trip had revealed about the \"great democratic revolution\" that was transforming the Western world.In Democracy in America he vividly describes the unprecedented \"equality of conditions\" found in the United States and explores its implications for European society in the emerging modern era. His book provides enduring insight into the political consequences of widespread property ownership, the potential dangers to liberty inherent in majority rule, the importance of civil institutions in an individualistic culture dominated by the pursuit of material self-interest, the influence of the press and the judiciary in American politics, and the vital role of religion in American life, while prophetically examining the widening differences between the northern and southern states.In \"the ideal toward which democratic peoples tend,\" Tocqueville writes, men \"will be perfectly free, because they will all be entirely equal, and they will all be perfectly equal because they will be entirely free.\" But, he warns, their passion for liberty and their passion for equality are unequal: \"They want equality in liberty, and if they cannot have it, they want it still in slavery.\"Arthur Goldhammer has translated from the French more than 80 works in history, literature, art history, classical studies, philosophy, psychology, and social science.Olivier Zunz, volume editor, is Commonwealth Professor of History at the University of Virginia. He is the author of Why the American Century?, Making America Corporate, 1870–1920, and The Changing Face of Inequality, and co-editor of The Tocqueville Reader: A Life in Letters and Politics.",
  "genres": [
    "History",
    "Politics",
    "Nonfiction",
    "Philosophy",
    "Classics",
    "American History",
    "Political Science"
  ],
  "author": "Alexis de Tocqueville",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/16618.Democracy_in_America"
}