{
  "title": "The Nameless Dwarf",
  "description": "The original omnibus of five novellas, now revised in a brand new edition called REVENGE OF THE LICH, book 3 of the epic LEGENDS OF THE NAMELESS 1. CARNIFEX2. GEAS OF THE BLACK AXE 3. REVENGE OF THE LICH 4. RETURN OF THE DWARF LORDSRed to the elbows with the blood of his people, now he's their only hope.The entire 5-book series in one volume!\"Fantasy Adventure Book of the Year for 2012. It is THAT good!\" - R. Nicholson (Amazon top 1000 reviewer)The dwarves have gone!Thousands have been slaughtered in the blood-drenched streets of their ravine city by one of their own wielding a demonic axe.The survivors have fled beyond the mountains, heading into a realm haunted by the nightmares of a twisted god.When Nils Fargin, son of an underworld boss, is hired to find them, he travels with his client to seek the advice of a lowlife mage. With what he learns, he should have asked for more money.The trail leads them to the domain of the terrifying Ant-Man, who is rumored to eat the flesh of anyone refusing to pay his toll. And as if that wasn't enough, it turns out Nils's client is none other than the Nameless Dwarf, better known to his kind as the Ravine Butcher.The Nameless Dwarf is an epic tale of remorse and redemption that pits a whiskerless thief, a guilt-driven assassin, a consumptive wizard, and an amnesiac dwarf against the worst imaginings of a craven mind.But the companions bring troubles of their own, not least of which is an ancient grimoire that leads them inexorably towards a forest of tar and an evil that threatens the existence of an entire race.The last hope of the dwarves comes from the unlikeliest of a mythical city beneath the waves, an axe from the age of heroes, and the Nameless Dwarf, in whose veins flows the blood of legends.The Nameless The Complete Chronicles contains all five books of the Chronicles of the Nameless Dwarf, fully revised and including all the original covers and a stunning map of Aethir.",
  "genres": [
    "Fantasy",
    "Fiction"
  ],
  "author": "Derek Prior",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/16617979-the-nameless-dwarf"
}