{
  "title": "Unfit For Command: Swift Boat Veterans Speak Out Against John Kerry",
  "description": "\"What sort of combination of hypocrite and paradox is John Kerry?\" ask the authors in this heated critique of the Democratic presidential candidate’s Vietnam–era military service and antiwar activism. O’Neill, a lawyer and swift boat veteran, and Corsi, an expert on Vietnam antiwar movements, argue that Kerry misrepresented his wartime exploits and is therefore incompetent to serve as commander in chief. Buttressed by interviews with Navy veterans who patrolled Vietnam’s waters, some along with Kerry, the book claims he exaggerated minor injuries, self-inflicted others, wrote fictitious diary entries and filed \"phony\" reports of his heroism under fire—all in a calculated quest to secure career-enhancing combat medals. They also maintain that Kerry, whom they call a \"moral coward,\" committed atrocities that alarmed his peers and superior officers during his four-month tour of duty. Yet his activities on behalf of the Vietnam Veterans Against the War clearly raises the authors’ hackles the most, and they present Kerry’s post-war actions as additional, damning evidence of his \"total unfitness,\" claiming that his testimony against the war \"caused more deaths and prolonged the war in Vietnam by undermining support at home and contributing directly to a Vietnamese Communist victory.\" The battle that lies at the heart of this book is the decades-old feud between antiwar veterans and their my-country-right-or-wrong counterparts. The authors’ conservative take on the war is palpable: the U.S. military failed to unleash \"massive, indiscriminate bombing\" to force North Vietnam’s capitulation; the conflict was a struggle against communism, not a civil war; and the dissenting soldiers undermined homefront morale. Consequently, this overwrought and repetitive polemic seethes with a resentment that compromises the otherwise eyebrow-raising testimonies. Further, without access to Kerry’s full military and medical records, the authors rely heavily on 35-year-old recollections and recent Kerry biographies by Douglas Brinkley and a Boston Globe reporting team. Those looking for a thorough, unbiased investigation into Kerry’s wartime record would do best to wait for more objective, methodical chroniclers who have access to the relevant documents.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Biography",
    "Military Fiction",
    "History",
    "Political Science",
    "American History"
  ],
  "author": "John E. O'Neill",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/166186.Unfit_For_Command"
}