{
  "title": "No Laughing Matter",
  "description": "An uproarious and frank memoir of illness and recovery, No Laughing Matter is a story of friendship and recuperation from the author of the classic Catch-22 .It all began one typical day in the life of Joe Heller. He was jogging four miles at a clip these days, working on his novel God Knows , coping with the complications of an unpleasant divorce, and pigging out once or twice a week on Chinese food with cronies like Mel Brooks, Mario Puzo, and his buddy of more than twenty years, Speed Vogel. He was feeling perfectly fine that day—but within twenty-four hours he would be in intensive care at Manhattan's Mount Sinai Hospital. He would remain hospitalized for nearly six months and leave in a wheelchair.Joseph Heller had Guillain-Barré syndrome, a debilitating, sometimes fatal condition that can leave its victims paralyzed from head to toe. The clan gathered immediately. Speed—sometime artist, sometime businessman, sometime herring taster, and now a coauthor—moved into Joe's apartment as messenger, servant, and shaman. Mel Brooks, arch-hypochondriac of the Western world, knew as much about Heller's condition as the doctors. Mario Puzo, author of the preeminent gangster novel of our time, proved to be the most reluctant man ever to be dragged along on a hospital visit. These and lots of others rallied around the sickbed in a show of loyalty and friendship that not only built a wild and spirited camaraderie but helped bring Joe Heller, writer and buddy extraordinaire, through his greatest crisis.This book is an inspiring, hilarious memoir of a calamitous illness and the rocky road to recuperation—as only the author of Catch-22 and the friend who helped him back to health could tell it. No Laughing Matter is as wacky, terrifying, and greathearted as any fiction Joseph Heller ever wrote.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "Classics",
    "Biography Memoir",
    "Humor",
    "Literature"
  ],
  "author": "Joseph Heller",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/10716.No_Laughing_Matter"
}