{
  "title": "A Woman of Passion",
  "description": "I have a great passion for London and its magnificent noble houses, where I have met many gentlemen from Court circles. My ambition is set on making a good marriage, and I intend to have a great household of my own, where you can come to stay. I wish with all my heart that you could visit these grand places with me, to see the Tudor courtiers bedecked in velvets and jewels, to listen to the music as it floats down from the minstrels' galleries and be waited upon by the liveried footmen. For me, it is like a dream come true. I long to share with you all the wonders of this glorious city, and vow that someday I shall!Yours alone,Mistress Elizabeth Hardwick (Bess)From New York Times bestselling author Virginia Henley, whose novels have enchanted readers worldwide, comes a stunningly romantic new novel brimming with the sensual tension, humor, and narrative verve that have become her trademarks.Set amid the glittering, bawdy, and intrigue-riddled society of Elizabethan England and based on the real-life heroine Elizabeth Hardwick, A Woman of Passion tells the story of a beautiful, ambitious commoner who rises to the position of lady-in-waiting to Queen Elizabeth I and loves four very different husbands along the way.Vowing to put poverty and powerlessness behind her, fifteen-year-old Bess Hardwick takes a suitable position at the London home of a wealthy noblewoman. There she is plunged into an exciting new world of riches and privilege, and makes the acquaintance of friends, potential enemies, and powerful men who will change the course of her life. Among them are Elizabeth, an uncommonly shrewd yet lonely princess who would become an indomitable queen; charming and dangerously seductive William Cavendish, the king's ambitious financial adviser, who is determined to have Bess at any cost save marriage; the adoring, tenderhearted Robert Barlow; the proper and dutiful aristocrat Sir William St. Loe; and George Talbot, the devilishly handsome heir to the earldom of Shrewsbury, whose wicked daring ignites in Bess the passion of a lifetime.With the fast-paced storytelling style, historical sweep, and insight into a woman's heart that have made her one of the most popular writers of historical romance, Virginia Henley takes readers on a breathless journey through the adventure-filled prime of life of A Woman of Passion .",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Historical Fiction",
    "Fiction",
    "Adult Fiction",
    "Tudor Period"
  ],
  "author": "Virginia Henley",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/1664618.A_Woman_of_Passion"
}