{
  "title": "Heresy",
  "description": "A Catherine LeVendeur mystery Catherine LeVendeur is a creature of twelfth-century France. Her life is a mirror of that time but she is a unique spirit, determined to make her way in the world and armed with a keen mind and a curiosity that often puts her in peril. Her life is both a reflection of the bonds placed upon a woman in her society and the ways in which a strong personality can triumph and succeed in spite of those strictures. Catherine is fiercely loyal to both her faith and her family . . . and this loyalty is sometimes sorely tested because of a dreaded family secret. Raised a devout Catholic, she knows that if her family's Jewish roots are exposed, all she loves will be destroyed. But how far will she go to protect that secret? When her dearest friend in the world, Astrolabe, the son of the fabled theologian Peter Abelard and Heloise, flees wrongful prosecution for the vicious murder of a young woman, Catherine's family takes him in to hide. But there are darker forces than murder at work here. Someone wishes to use Astrolabe to complete the destruction of his father's fame in the name of faith . . . and there are those who would see the destruction of the very order of Christian life. And Catherine's family is caught right in the middle of the conflict. While she has experienced love and loss, her life is committed to preserving what peace she can for those she loves. How far will Catherine go to save her friend, and what will this sacrifice do to her family's future? Heresy is the eighth title in Sharan Newman's critically acclaimed Catherine LeVendeur medieval mystery series. Sharan Newman has used extensive research to give us a fascinating panorama of twelfth-century France that is rich in historical detail, and she puts flesh to bone by creating portraits of people who are not so different from ourselves. Filled with fascinating details of medieval life and the intricate interplay between the Christian and Jewish cultures of the time, Heresy is a compelling mystery and a riveting historical rolled into one.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Historical",
    "Fiction",
    "Medieval",
    "Historical Mystery",
    "France"
  ],
  "author": "Sharan Newman",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/166669.Heresy"
}