{
  "title": "The Outcast Dove",
  "description": "\"The Outcast Dove\" is the ninth title in Sharan Newman's Catherine LeVendeur mystery series. In these well-researched novels filled with fascinating details of medieval life, Newman conveys the sounds, smells, and human concerns of twelfth-century France and creates characters who seem to have just stepped off the streets of medieval Paris.The threat to peace and safety this time is not focused on Catherine LeVendeur, the heroine whose curiosity and passion for justice have sometimes led her to solve some grisly murders and brave horrors...but on those she loves. Her family's fortune is in commerce, and while her husband, Edgar, is a capable trader, they must rely on her dearest cousin, Solomon, to negotiate the treacherous path to riches. And therein lies the danger, for the fact that Solomon is her cousin is secret. Catherine's father was abducted as a child and raised as a devout Catholic---but most of his family escaped and remained Jews. If their family connections are discovered, it could mean ruin to Catherine's family. Or death. As Edgar and Solomon travel to Spain to make their fortunes, Solomon is drawn into a scheme to try to rescue a Jewish girl take by Christians during the conquest of the Spanish city of Almeira. To complicate matters, and sorely vex his heart, Solomon encounters his long-lost father Jacob, a man who rejected his Jewish faith and is now Brother James, preparing his own trip to Spain to ransom Crusader knights taken by the Moslems. When a fellow monk is killed by an attacker in the street late at night, it's put down to a random mugging. But James, who is carrying the ransom money, believes that he will be the next target. Circumstances force him to turn for help to the son he abandoned. Solomon wants nothing to do with his father. But he's confronted by his past, his ancestry, the need for secrecy, and his love for those of his family who have chosen a different path.In confronting all these things, Solomon will come to a decision about who he is...and where he really belongs.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Historical",
    "Fiction",
    "Medieval",
    "Historical Mystery"
  ],
  "author": "Sharan Newman",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/166673.The_Outcast_Dove"
}