{
  "title": "Wicked: The Complete Series",
  "description": "Get four stories in one boxed set from Bestselling Author Lily Graison (Includes 4 Novellas) Wicked: Tempt Me Not - Book 1 in the Wicked SeriesDevin Shaw, front man for the band, Wicked, is forced into seclusion by his manager after his destructive behavior almost destroys the band. Sent to a remote cabin alone isn't Devin’s idea of fun, but to save his career, he’ll do what it takes.Holly Baker, escaping the hassles of her big city life, arrives in the mountains of Tennessee and awaits the arrival of her friend, Roxy, to start their two-week vacation. Their plans change drastically when Roxy is called away at the last minute, leaving Holly to fend for herself.Devin and Holly’s worlds collide when a mix up strands them in the same cabin. Alone with nothing but each other for companionship, how will Holly react when she realizes she’s trapped with none other than the hottest lead singer the country has seen in years? Will Devin be able to work with a constant distraction the pretty brunette offers? Or will the two discover that sometimes temptation is a wicked dessert best served hot.Wicked: Leather and Lace - Book 2 in the Wicked Series Roxy Carlisle is on a mission. She’s been in lust with Luke Harris, lead guitarist for the band Wicked, for two years. When her best friend, Holly, hooks up with the bands lead singer, and asks her to tag along to New York with her to meet the band, Roxy couldn't pack her bags fast enough. The chance to meet Luke in person was a dream come true. Even better if her ultimate fantasy of finding herself in his bed were to happen. One way or another, she was determined to have him. That is, if Holly’s hair-brained idea of playing hard to get doesn't backfire in her face.Luke Harris loves women and they love him. All he ever has to do is speak to them and they fall all over themselves to be the lucky lady of the night. That all changes though when a feisty brunette comes barreling into his life and changes all the rules. She’s immune to his usual charm, or so it seems, but something in her eyes tells him otherwise.Has Luke finally met a woman he can’t seduce? Can Roxy follow her plan and not give in when Luke sets his sights on her? When sex is all you’re after, can you walk away when your heart demands more?Wicked: Jade Butterfly - Book 3 in the Wicked Series Christian Palmer, bass player for the band Wicked, isn't your typical rocker. Much to his band mate’s amusement, he’s quiet, shy and looks like your average boy next door–but that’s all about to change. An encounter with a girl he can’t seem to forget calls for drastic measures and with the help of his friends, Christian goes from dud to stud in hopes to wow the girl of his dreams.Jessi McClure has led a fairy tale life. She has a job she loves, friends she can count on and couldn't want for anything else. Until she meets, and photographs, an unlikely rock star. Running into him again was just dumb luck, but when their paths keep crossing, she can’t help but notice the change this shy, gorgeous guy has taken on and is drawn to him even more.When fate keeps stepping in and hands you something you didn't realize you wanted, do you throw the chance away or hold on with both hands? Will Jessi get more than she bargained for when the man she thought she knew turns out to be so much more? And can Christian hold on to the girl of his dreams when a misunderstanding threatens to tear them apart? Wicked: Sweet Temptation - Book 4 in the Wicked Series Mick Sheppard, drummer for the band Wicked, has sworn off women after his whirlwind romance with a fan cost him thousands in legal fees and a years worth of gossip in every trash magazine known to man. So, imagine his surprise when he wakes from an alcohol induced haze in Vegas, hung over, and married to a woman he knows next to nothing about.Faith Weston is your typical good girl. Or so her father thinks. The daughter of a minister, she’s lived her life on the straight and narrow. A trip to Sin City brings reality to a screeching halt when she discovers her week of reckless abandon has left her married to a rock star. One of the bad boys her father warned her about.Will Mick and Faith find a way out of their drunk-induced marriage or will they both discover some things were just meant to be? When love is the last thing you’re looking for, how do you turn your back on it when it finally finds you?These four stories are also available as individual eBooks and have been published for more than a year. No new material has been written for this edition.",
  "genres": [
    "Anthologies",
    "Romance",
    "Music"
  ],
  "author": "Lily Graison",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/16668679-wicked"
}