{
  "title": "The DISARM Series Boxed Set",
  "description": "Books 1 to 6 of the DISARM series. 1. DISARMEven the deepest secrets always find a way to surface...26-year-old Elsie Sherman has had a crush on her brother's best friend, Henry Logan, since she was twelve years old. Unfortunately, Henry has only ever treated her like a younger sister, stepping into her brother's shoes after he was killed in action.That is, until one night, when one dance ignites a sensual fire between the two, leaving Elsie aroused and confused. Is she allowed to lust after her surrogate big brother who also happens to be her roommate?But Henry, an Air Force officer, has been harboring two secrets--one will bring them together and the other will tear them apart--and it is up to Elsie to decide if their relationship is worth fighting for.2. BESIEGEThe continuing story of Elsie and Henry...Elsie has waited six long months for Henry to return from his deployment in Afghanistan. But she learns that, sometimes, the person who leaves for war is rarely the same one who comes home...3. RETREATReturn to the place where it all began...Elsie surprises Henry in California in the sexiest way possible and inadvertently reveals the secret about their relationship to their families. But just when she thinks everything is finally falling back into place, a revelation changes everything...4. The Henry SessionsIn eighteen days, a life can change...Henry talks about the past during his therapy sessions but one night puts everything into question, including his relationship with the woman he's loved all his life. 5. ENGAGEThe past has a way of catching up...A long time has passed since Elsie's heart was broken, since the person who always shielded her from pain broke her heart. Just when she begins to rebuild, Henry returns and upends everything all over again.6. CAPTURE (Extended Edition)The future beckons...Elsie has given Henry three chances to win back her trust, but before he is able to complete the challenge, she finds herself faced with a life-changing decision. Elsie must ask herself an important question: is Henry just a thing of the past or does he have a place in her future?The conclusion to the story of Henry and Elsie.~FOR MATURE AUDIENCES ONLY PLEASE.",
  "genres": [
    "Romance",
    "Military Fiction",
    "Contemporary Romance",
    "Erotica",
    "Contemporary",
    "New Adult",
    "Friends To Lovers"
  ],
  "author": "June Gray",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/16668602-the-disarm-series-boxed-set"
}