{
  "title": "Egyperces novellák",
  "description": "\"Az Egyperces Novellák - írójuknak merész és nem egészen komolyan veendő kijelentése szerint - egész regények, sőt regényciklusokkal fölérő alkotások, annak ellenére, hogy szembetűnően rövidek. Őszerinte nem azért rövidek, mert kevés a mondanivalójuk, hanem azért mert kevés szóval szeretnének sokat mondani. Adná az Úr. E rövidségen túl mit illik róluk még eszünkbe tartanunk? Azt hogy nincs műfajuk. A népmesétől a városi folklórig (egész a pesti viccekig), az elbeszélő epikától a kurtára fogott tragédiáig mindent el lehet mondani \"egypercesen\" is. Csak az a kérdés, hogy így megrövidítve, a közlést jelzéssé sűrítve valóban többet s megrázóbbat árulnak el a világról, mint amennyit több szóval lehetne mondani. Írójuk erre törekedett. Máskülönben az Egyperces Novella erősen emlékeztet több perces társaira, hiszen neki is van címe, van eleje, közepe, befejezése, és még sok egyebe, ami egy írásműnek kell. Abban viszont erősen eltér tőle, hogy a legtöbbször nincs cselekménye, vagy a cselekménynek, ha van, nincs színlelve, szereplőinek sokszor se arcuk, se nevük, s csak eltéve van jellemük, egyéniségük. E hiányok pótlását az író rábízza olvasóira, ami ugyan a szokásosnál jobban igénybe veszi képzelőerejüket, cserébe azonban a passzív olvasás kényelmes öröme helyett a művészi alkotás izgalmát kínálja fel. Az író véleménye szerint ezek az írásművek voltaképpen matematikai egyenletek. Az egyik oldalon a közlés minimuma áll, az író részéről, a másikon a képzelet maximuma, az olvasó részéről. Más szóval: e novellák egypercesek ugyan, de kétszemélyesek. Létezésük - mint mindannyiunké - csak lehetőség: várva várják az olvasót, hogy e könyv lapjairól föltámasztva, tevékeny és hasznos életet élhessenek.\" (Örkény István)",
  "genres": [
    "Short Stories",
    "Hungarian Literature",
    "Fiction",
    "Classics",
    "Hungary",
    "Literature",
    "Humor"
  ],
  "author": "István Örkény",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/166724.Egyperces_novell_k"
}