{
  "title": "Tarian Bumi",
  "description": "Di tengah-tengah megahnya Bali, terselip berbagai bentuk ketidakadilan yang dialami perempuan Bali seperti masalah kasta. Perem-puan berkasta Brahmana (seperti tokoh Telaga di novel ini) tidak boleh bersuami dari kasta lebih rendah, harus berbicara dengan bahasa berbeda dan memandang semua segi kehidupan dari perspektif lebih tinggi. Konflik dimulai ketika Telaga jatuh cinta pada pria sudra. Telaga terjepit di antara cinta dan adat yang mesti dijunjung tinggi. Memilih salah satunya sama saja dengan mengorbankan separuh hidupnya. Dengan setting budaya Bali yang kental, novel ini menunjukkan posisi sebenarnya perempuan Bali di dalam masyarakatnya.Rather than contesting established stereotypes, another recent text creates its own mythic quality through evocation of the on going, timeless quality of female experience. Tarian Bumi (Dance of the Earth) by Oka Rusmini focusses intensely on the interwoven stories of four generation of women living within the thight spatial and phsycological boundaries of the walled family compound of village Bali.Barbara Hatley, Literature,\"Mythology and Regime Change\"Tarian Bumi menjadi fenomena sekaligus kontroversi. Novel ini dengan sangat terbuka menghantam keadaan yang melingkupi kehidupan perempuan di kalangan bangsawan Bali yang masih sangat feodal. Dalam konteks adat istiadat Bali, Tarian Bumi dipandang sebagai sebuah pemberontakan kepada adat.Tempo, 9 Mei 2004Jika novelis Inggris, Graham Greene, merasa telah menemukan India yang sebenarnya justru dalam novel-novel dan cerita-cerita pendek yang ditulis R.K. Narayan, maka tak berlebihan jika kita pun merasa telah menemukan Bali yang sebenarnya melalui novel ini.Horison, Juli 2001Bagi pembaca luar Bali, novel Oka Rusmini bukan saja indah dinikmati sebagai sastra melainkan pula mencerahkan banyak segi pemahaman lebih esensial dan kesalehan spiritual manusia budaya Bali. Kehadiran Oka Rusmini benar-benar fenomenal bagi karakter local genius Sastra Modern Indonesia mutakhir.Dami N Toda, Matabaca, vol. 2/No. 1/ September 2003",
  "genres": [
    "Indonesian Literature",
    "Fiction",
    "Novels",
    "Feminism",
    "Historical Fiction",
    "Cultural",
    "Literature"
  ],
  "author": "Oka Rusmini",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/1667447.Tarian_Bumi"
}