{
  "title": "CONSPIRACY",
  "description": "In the fiftieth year of the twenty second century humanity is successfully spread and flourishing across the weather conditioned worlds, planetary-moons and some asteroids of the solar system. From Mars to some of Jupiter’s satellites to remote dwarf planet Pluto human civilizations have proliferated rapidly since the first spaceships appeared in the skies of earth in the first quarter of the twenty first century that took humanity’s ancestors from earth to the other planets of the solar system. The Federal Government was the dominant power in the solar system with a governing body comprising a senator each from all the nations of the system. That being the case the Government was powerful enough to carry out just about anything it wanted; in this instance the highly enigmatic development of cosmic starships. The seat of the Federation – as the Federal Government was officially labeled – was located on a five acre complex in the city of Prague. It comprised the President’s office building, the state building where the President received and entertained dignitaries, delegations and the like, and where among other things, press conferences were held, the administrative building, the President’s official residence and some other structures for specific purposes and functions. Mark Rhodes was the youngest person ever to be elected President of the Federation for the customary five year term of office. A grand departure from the norm where individuals elected to be leaders of something as extensive and as complex as the Federation were almost always over sixty years of age. Furthermore, none of them had sought a second term. The President’s term was nearing the second year mark. Mark had been involved with the development of inter-galactic vessels before he was elected to power but he had become instrumental afterwards as the head of the Federation. Though he was neither a scientist nor an engineer the success of Project Cosmos would not have been possible were it not for his vision, deep domain knowledge and experience in organizational matters, management skills and a single-minded quest to see humanity safely into deep outer space. He was a man with a dream who wittingly became the catalyst that saw Project Cosmos yield the first of their kind cosmos-class starships nearly two decades into its progression. President Mark Rhodes had created history! The President of the Federal Government of the Solar System had barely slept in the last seventy two hours since the formal announcement of cosmos-class starships engineered on Saturn Station, a space-ship-building-yard in a restricted area in Saturn orbit. The last seventy two hours had been fleeting harbingers of change. The hours, though relatively brief in the virtually endless cosmic scheme of things, had successfully altered perceptions and mindsets. The human populations’ entire outlook on the universe was rapidly changing. And as such things go it was changing forever. From this point onward there was no turning back. The ultimate frontier was finally beckoning. And it took no great imagination to visualize mighty civilizations rising and falling among the stars. The fact of the matter however was that deep down inside human beings were finally beginning to face the fact that they may not be alone in the universe or even perhaps in their own galaxy of the milky way. It was an undercurrent as much also of ambiguity revolving around the feasibility of humankind’s survival in the bleakness of endless space and the face of alien civilizations. Perhaps only time would tell whether inter-galactic vessels would bring human-kind the collective boon that they so richly deserved after centuries of confinement to Planet Earth and then to the solar system or would it spell disaster; would it bring on the end of the human species?",
  "genres": [],
  "author": "Faruk Nadkar",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/16682192-conspiracy"
}