{
  "title": "The Memoir Club",
  "description": "\"In a memoir, the author and the narrator have an uneasy relationship. What does the reader know of the author? That the author lived to tell the tale. What does the reader know of the narrator? That the tale needed to be told.\"Six women, each with her own misgivings, take a university extension night class in Writing Your Memoir, looking only for a little bibliotherapy. The following semester, they meet privately at the gracious home of one of the participants. The memoir class becomes the memoir club.In coming to terms with their losses, with their own guilt-in writing to break through that stubborn, opaque barrier to the past-they forge a new present. And a new future. The teacher, the enigmatic Penny Taylor, steps in at the right moment and steps out before her students can thank her.In the beginning, grief-stricken Dr. Caryn Henley only goes to the class at the insistence of her longtime friend and colleague, Nell, a woman so loyal that behind her back people call her the St. Bernard. Rusty Meadows wants to write a memoir for her daughter she gave up at birth. Mrs. Francine Hellman wants her memoir to laud her late husband, the scientist Dr. Marcus Hellman, only to find he had a past unknown to her. The elderly, unconventional Sarah Jane Perkins writes to come to terms with the cruelties her rigid mother inflicted on her artistic, bootlegging father. And Korean born Jill McDougall comes to the memoir class to find out who she is, and why she's living in a warehouse with a man who loves ice cream. These students of the memoir achieve what they set out to do, but discover what they never expected.Along the way, the disparate women come together, reveal themselves to each other and support each other. As they render their pasts in memoirs, they forge a new present and a new future.",
  "genres": [
    "Fiction",
    "Chick Lit",
    "Writing",
    "Womens"
  ],
  "author": "Laura Kalpakian",
  "average_rating": "3.38",
  "url": "https://www.goodreads.com/book/show/166823.The_Memoir_Club"
}