{
  "title": "The Taste of Conquest: The Rise and Fall of the Three Great Cities of Spice",
  "description": "The smell of sweet cinnamon on your morning oatmeal, the gentle heat of gingerbread, the sharp piquant bite from your everyday peppermill. The tales these spices could tell: of lavish Renaissance banquets perfumed with cloves, and flimsy sailing ships sent around the world to secure a scented prize; of cinnamon-dusted custard tarts and nutmeg-induced genocide; of pungent elixirs and the quest for the pepper groves of paradise. The Taste of Conquest offers up a riveting, globe-trotting tale of unquenchable desire, fanatical religion, raw greed, fickle fashion, and mouthwatering cuisine–in short, the very stuff of which our world is made. In this engaging, enlightening, and anecdote-filled history, Michael Krondl, a noted chef turned writer and food historian, tells the story of three legendary cities–Venice, Lisbon, and Amsterdam–and how their single-minded pursuit of spice helped to make (and remake) the Western diet and set in motion the first great wave of globalization.In the sixteenth and seventeenth centuries, the world’s peoples were irrevocably brought together as a result of the spice trade. Before the great voyages of discovery, Venice controlled the business in Eastern seasonings and thereby became medieval Europe’s most cosmopolitan urban center. Driven to dominate this trade, Portugal’s mariners pioneered sea routes to the New World and around the Cape of Good Hope to India to unseat Venice as Europe’s chief pepper dealer. Then, in the 1600s, the savvy businessmen of Amsterdam “invented” the modern corporation–the Dutch East India Company–and took over as spice merchants to the world.Sharing meals and stories with Indian pepper planters, Portuguese sailors, and Venetian foodies, Krondl takes every opportunity to explore the world of long ago and sample its many flavors. The spice trade and its cultural exchanges didn’t merely lend kick to the traditional Venetian cookies called peverini, or add flavor to Portuguese sausages of every description, or even make the Indonesian rice table more popular than Chinese takeout in trendy Amsterdam. No, the taste for spice of a few wealthy Europeans led to great crusades, astonishing feats of bravery, and even wholesale slaughter.As stimulating as it is pleasurable, and filled with surprising insights, The Taste of Conquest offers a fascinating perspective on how, in search of a tastier dish, the world has been transformed.",
  "genres": [
    "History",
    "Food",
    "Nonfiction",
    "Food History",
    "Italy",
    "Travel",
    "Portugal"
  ],
  "author": "Michael Krondl",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/1668443.The_Taste_of_Conquest"
}