{
  "title": "The Many Worlds of Hugh Everett III: Multiple Universes, Mutual Assured Destruction, and the Meltdown of a Nuclear Family",
  "description": "Peter Byrne tells the story of Hugh Everett III (1930-1982), whose \"many worlds\" theory of multiple universes has had a profound impact on physics and philosophy. Using Everett's unpublished papers (recently discovered in his son's basement) and dozens of interviews with his friends, colleagues, and surviving family members, Byrne paints, for the general reader, a detailed portrait of the genius who invented an astonishing way of describing our complex universe from the inside. Everett's mathematical model (called the \"universal wave function\") treats all possible events as \"equally real,\" and concludes that countless copies of every person and thing exist in all possible configurations spread over an infinity of universes: many worlds. Afflicted by depression and addictions, Everett strove to bring rational order to the professional realms in which he played historically significant roles. In addition to his famous interpretation of quantum mechanics, Everett wrote a classic paper in game theory; created computer algorithms that revolutionized military operations research; and performed pioneering work in artificial intelligence for top secret government projects. He wrote the original software for targeting cities in a nuclear hot war; and he was one of the first scientists to recognize the danger of nuclear winter. As a Cold Warrior, he designed logical systems that modeled \"rational\" human and machine behaviors, and yet he was largely oblivious to the emotional damage his irrational personal behavior inflicted upon his family, lovers, and business partners. He died young, but left behind a fascinating record of his life, including correspondence with such philosophically inclined physicists as Niels Bohr, Norbert Wiener, and John Wheeler. These remarkable letters illuminate the long and often bitter struggle to explain the paradox of measurement at the heart of quantum physics. In recent years, Everett's solution to this mysterious problem - the existence of a universe of universes - has gained considerable traction in scientific circles, not as science fiction, but as an explanation of physical reality.",
  "genres": [
    "Science",
    "Physics",
    "Biography",
    "Philosophy",
    "History",
    "Nonfiction",
    "Quantum Mechanics"
  ],
  "author": "Peter  Byrne",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/16691297-the-many-worlds-of-hugh-everett-iii"
}