{
  "title": "Crime Novels: American Noir of the 1930s and 40s",
  "description": "Evolving out of the terse and violent style of the pulp magazines, noir fiction expanded over the decades into a varied, innovative and profoundly influential body of writing. The eleven novels in The Library of America’s adventurous two-volume collection taps deep roots in the American literary imagination, exploring themes of crime, guilt, deception, obsessive passion, murder, and the disintegrating psyche. With visionary and often subversive force they create a dark and violent mythology out of the most commonplace elements of modern life.James M. Cain’s pioneering novel of murder and adultery along the California highway, The Postman Always Rings Twice (1934), shocked contemporaries with its laconic toughness and fierce sexuality.Horace McCoy’s They Shoot Horses, Don’t They? (1935) uses truncated rhythms and a unique narrative structure to turn its account of a Hollywood dance marathon into an unforgettable evocation of social chaos and personal desperation.In Thieves Like Us (1937), Edward Anderson vividly brings to life the dusty roads and back-country hideouts where a fugitive band of Oklahoma outlaws plays out its destiny.The Big Clock (1946), an ingenious novel of pursuit and evasion by the poet Kenneth Fearing, is set by contrast in the dense and neurotic inner world of a giant publishing corporation under the thumb of a warped and ultimately murderous chief executive.William Lindsay Gresham’s controversial Nightmare Alley (1946), a ferocious psychological portrait of a charismatic carnival hustler, creates an unforgettable atmosphere of duplicity, corruption, and self-destruction.I Married a Dead Man (1948), a tale of switched identity set in the anxious suburbs, is perhaps the most striking novel of Cornell Woolrich, who found in the techniques of the gothic thriller the means to express an overpowering sense of personal doom.Disturbing, poetic, anarchic, punctuated by terrifying bursts of rage and paranoia and powerfully evocative of the lost and desperate sidestreets of American life, these are underground classics now made widely and permanently available.",
  "genres": [
    "Noir",
    "Crime",
    "Mystery",
    "Fiction",
    "Anthologies",
    "Classics",
    "Literature"
  ],
  "author": "Robert Polito",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/166915.Crime_Novels"
}