{
  "title": "Bride Quartet Collection: Savour The Moment, A Bed Of Roses, Vision In White",
  "description": "Four childhood friends have teamed up to form Vows, one of Connecticut's premier wedding planning companies. Parker, Emma, Laurel, and Mac have become experts at making every bride's dreams come true. But when they're faced with the whims of their own hearts, things never go as planned….Vision in WhiteWith bridal magazine covers to her credit, Mackensie “Mac” Elliot is ready to capture the happy moments she never experienced while growing up. Her father replaced his first family with a second, and now her mother, moving on to yet another man, begs Mac for attention and money. Mac’s foundation is jostled again when she bumps into the bride-to-be’s brother…an encounter that has them both seeing stars.Bed of RosesSince she was a little girl, Emma Grant has always loved romance. So it’s really no surprise that she has found her calling as a wedding florist. And on the surface, Emma’s love life seems to be thriving. Though men swarm around her, she still hasn’t found Mr. Right. Jack Cooke’s been best friends with Parker’s brother for years, which makes him practically family. But the architect has begun to admit to himself that his feelings for Emma have developed into much more than friendship.Savor the MomentLaurel McBane believes in romance—in theory. But she’s too low-key to appreciate all the luxuries that other women seem to long for. What she does appreciate is a strong, intelligent man, a man just like Parker’s older brother, Delaney Brown, on whom Laurel has had a mega crush since childhood. When Laurel’s quick-silver moods get the better of her—leading to a mind-blowing kiss with Del—she’ll have to quiet the doubts in her mind to turn a moment of passion into forever….Happy Ever AfterNo man has rattled Parker Brown in a long time, but the motorcycle-riding, raven-haired mechanic Malcolm Kavanaugh seems to have a knack for it. His passionate kisses always catch her off guard, much like her growing feelings for him. Parker’s business risks have always paid off, but now she’ll have to take the chance of a lifetime with her heart….",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Chick Lit",
    "Fiction",
    "Contemporary",
    "Friends To Lovers",
    "Audiobook"
  ],
  "author": "Nora Roberts",
  "average_rating": "4.58",
  "url": "https://www.goodreads.com/book/show/10718734-bride-quartet-collection"
}