{
  "title": "Life's Ratchet: How Molecular Machines Extract Order from Chaos",
  "description": "The cells in our bodies consist of molecules, made up of the same carbon, oxygen, and hydrogen atoms found in air and rocks. But molecules, such as water and sugar, are not alive. So how do our cells--assemblies of otherwise \"dead\" molecules--come to life, and together constitute a living being?  In \"Life's Ratchet,\" physicist Peter M. Hoffmann locates the answer to this age-old question at the nanoscale. The complex molecules of our cells can rightfully be called \"molecular machines,\" or \"nanobots\"; these machines, unlike any other, work autonomously to create order out of chaos. Tiny electrical motors turn electrical voltage into motion, tiny factories custom-build other molecular machines, and mechanical machines twist, untwist, separate and package strands of DNA. The cell is like a city--an unfathomable, complex collection of molecular worker bees working together to create something greater than themselves.  Life, Hoffman argues, emerges from the random motions of atoms filtered through the sophisticated structures of our evolved machinery. We are essentially giant assemblies of interacting nanoscale machines; machines more amazing than can be found in any science fiction novel. Incredibly, the molecular machines in our cells function without a mysterious \"life force,\" nor do they violate any natural laws. Scientists can now prove that life is not supernatural, and that it can be fully understood in the context of science.  Part history, part cutting-edge science, part philosophy, \"Life's Ratchet\" takes us from ancient Greece to the laboratories of modern nanotechnology to tell the story of our quest for the machinery of life.",
  "genres": [
    "Science",
    "Biology",
    "Nonfiction",
    "Physics",
    "Chemistry",
    "Audiobook",
    "Evolution"
  ],
  "author": "Peter M. Hoffmann",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/16691583-life-s-ratchet"
}