{
  "title": "In the Land of Second Chances",
  "description": "A mysterious visitor changes the fortunes of a struggling Nebraska town in this “novel full of hope, humor and singular characters” ( Parade ). Wilma Porter runs the only bed and breakfast in Ebb, Nebraska, and knows everyone in the small town. She also knows their troubles. Calvin Millet, for example, has an ailing daughter at home and a wife who just up and left him—and on top of that, his department store is close to bankruptcy as a new Wal-Mart looms, and his house has been destroyed by a tornado. When a handsome stranger named Vernon L. Moore comes to town selling games of chance, more than a few eyebrows are raised. A consummate salesman, he befriends the troubled townspeople one by one. He listens to their stories and asks them intriguing questions that make them see their situations differently. The father of a dying child; the reclusive widow who’s taken permanent board at the B&B; the banker with ulterior motives; and the outspoken Wilma herself are all changed by their encounters with this mysterious man who seems not of this world. After all, no one has seen a traveling salesman in Ebb for more than thirty years. But wherever he’s from and whoever he is, he leaves behind a town where second chances are not only possible, they can—and do—happen. “If you’ve been charmed by Jimmy Stewart and the small-town miracles of It’s a Wonderful Life , treat yourself to this unusual little novel.” — Parade “A folksy, wise and gently amusing look at the importance of living life to the fullest and not only trusting in chance, but embracing uncertainty as the spice of life.” — Rocky Mountain News “Just what the doctor ordered.” — Detroit Free Press",
  "genres": [
    "Fiction",
    "Contemporary",
    "Religion",
    "Book Club",
    "Adult",
    "Adult Fiction",
    "Philosophy"
  ],
  "author": "George Shaffner",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/16693832-in-the-land-of-second-chances"
}