{
  "title": "Marley in Chains",
  "description": "Running from the past…Marley Knight-Williams has avoided the ghosts of her past for seventeen years. Now, after one thoughtless decision and too many margaritas, they’ve found her. Her memories, her heartache…and her men. Just in time for the holidays.Boxer and gym owner Michael O’Shea is at the end of his rope. When his best friend Carlos comes home from serving his country, he’s a changed man—broken and wounded, inside and out. Michael knows there is only one person who can bring him back, one person who can make this a Christmas they will all remember. And he’ll do whatever it takes to bring her around.Even if he has to break out the chains.Time has changed them all, but it’s only banked the embers of their passion, and when the flames flare to life, they burn hotter than ever. Will the heat be enough to sear away the obstacles that stand between them? Or will it drive them apart before they can finish what they started all those years ago?Warning: These characters shocked the author...Just sayin’…Menage and explicit sex. Schoolboy fantasies given a kinky adult twist. Voyeurism and exhibitionism. Spin the bottle, spanking, dirty sexting, and chains. Pervertable use of a poor innocent cane. Romance and magic and holiday love. With special guest appearances by Bob, Other Bob and Better Bob.SeriesBlinded to the Present...Avoiding the Future...Running from the PastThe Smutketeers Present: A Kinky Christmas Carol! The Knight Family is a wealthy, powerful Chicago clan that knows everything there is to know about making money—but they have plenty to learn about love. In this three series novella—Eden Bradley's Getting Scrooged, Robin L Rotham's Not So Tiny Tim and R.G. Alexander's Marley in Chains—you’ll meet Holly Knight, her nephew Tim, and her cousin Marley Knight-Williams as they face their ghosts, fulfill their fantasies and finally discover the magic of Christmas.",
  "genres": [
    "Menage",
    "Erotica",
    "BDSM",
    "Romance",
    "Contemporary Romance",
    "Erotic Romance",
    "M M F"
  ],
  "author": "R.G. Alexander",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/16693137-marley-in-chains"
}