{
  "title": "Ariel",
  "description": "Ariel may've gone out of print after its 1983 debut, but fans haven't let it fade away. For years, used copies have been making the rounds, commanding a premium auction price & making a profit for used book dealers. Now, you can not only get your own fresh, updated version, you can get it as an ebook. Given its theme, the metamorphosis seems particularly ironic. For two years, Pete Garey wandered through the strange new world of Earth after the Change, a moment when technology ceased to work & things like planes, trains & automobiles became junk. He was alone until the day he was found by a unicorn who'd become his familiar. Ariel is just one of the many magical creatures to appear after the Change, but the only one with the stunning ability (or, perhaps, desire) to talk. The bond between Pete & Ariel will be like no other he's experienced. If you know mythology, you know what anyone who wishes to be close to a unicorn must be. Pete's a virgin of 20. In many ways he's more unworldly than expected. Whether the loss of the technical wonders of modernity has contributed to his naivete, or if it is the result of so many years in a depopulated country, is difficult to say. Could be he would have grown up that way even in the before-Change world. Whatever the reason, it makes him perfectly suited to be Ariel’s friend & foil.  Ariel is pure--she's a unicorn, after all--but no pushover. Like Pete, she has steel to balance her softness. At times, the struggle between the good & bad inside each of them is as great a threat as the unmitigated evil they join to defeat. Isn’t that the conflict at the heart of all good literature? In Ariel, readers have many dark/light things to consider, including deciding for themselves whether the world is a better or worse place after the Change. The answer is as ambiguous as most real life decisions. Boyett isn’t going to do your thinking for you.Maybe that's the lasting appeal of Ariel. Little is clear cut in this fantasy. Not the motives of the characters. Not the true nature of the mythical beasts that emerge. Not even the why of everything that happened. Such unanswered questions are among the many reasons your thoughts will turn again & again to this book, re-examining these unknowns.--Lisa DuMond (edited)",
  "genres": [
    "Fantasy",
    "Post Apocalyptic",
    "Urban Fantasy",
    "Fiction",
    "Science Fiction",
    "Dystopia",
    "Magic"
  ],
  "author": "Steven R. Boyett",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/1669906.Ariel"
}