{
  "title": "Paul's Pursuit",
  "description": "Paul Grove loves two things in the world more than anything else: his daughter, Trisha, and roaming the mountains and forests of Wyoming. One he would kill for, the other is who he is. He has spent his life devoted to his ‘little’ girl, even though she isn’t so little anymore. When she disappears, he focuses all of his hunting and tracking skills on finding her. The tracks he has found make no sense, the clues left behind unlike any he has ever seen before, and the disappearance of Trisha and her friends a mystery he is determined to solve. When his daughter unexpectedly returns with a warrior from another world, he realizes he has no choice but to return with her to her new home or lose her forever.Morian Reykill is a High Priestess for the golden symbiots of their world known as The Gods Blood. She is their protector and a member of the Royal House of Valdier. When her first mate is killed she is devastated, for while he was not her true mate, they loved each other very much. She thought to join her mate in the next life but something told her it was not yet her time. She believes it is because of her five sons, all Princes of Valdier devoted to protecting their people and the Hive, the birthplace of the symbiots. When both her sons and her people are threatened, she will do whatever she has to in order to protect them.Paul Grove finds love in the beautiful alien woman who takes his breath away. For the first time since his wife died when Trisha was a baby, Paul wants someone of his own to hold. When a madman threatens his new family and takes the woman he is determined to claim, he will use all of his skills in hunting, tracking and guerilla warfare to get her safely back by his side.Morian discovers that the alien male who has claimed her is the true mate she has always hoped of having but thought an impossible dream. Will she be able to save him before a powerful Valdier Royal kills him as he did her first mate or will she lose not only her true mate but her entire family to a man obsessed with gaining control of the Hive and the people of Valdier?She is willing to sacrifice anything, including her life, to protect them. What she does not know is that Paul is the ultimate predator when his family is in danger. For when he is in pursuit of an enemy, his prey never gets away.",
  "genres": [
    "Aliens",
    "Romance",
    "Dragons",
    "Science Fiction",
    "Paranormal",
    "Shapeshifters",
    "Fantasy"
  ],
  "author": "S.E. Smith",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/16701069-paul-s-pursuit"
}