{
  "title": "London 1849: A Victorian Murder Story",
  "description": "A sensational story of murder, trial and public revenge influenced the great writers and commentators of the day. As much a book about London as the story of a murder books about London sell. Full of fascinating detail about mid-Victorian London in the vein of Peter Ackroyd social history at its best.Features a famous cast of characters that includes Dickens and Marx. Advertising in major review publications.It is 1849 London and the city is filthy, plagued, full of crime and filling up with refugees from the Irish Famine and the revolutionary wars on the continent. But the city is also on the brink of reform as transit stations are built, rioters pardoned and the Great Exhibition planned. The heaving city is the backdrop for the most sensational crime and trial of the decade: the Manning murder case. On August 9th Frederick and Maria Manning murder Patrick O'Connor, her lover, in the basement kitchen of their new terraced house in Bermondsey, South London. They bury the corpse under the flagstones, close up the house and flee in different directions: she to Scotland, he to the Channel Islands. Throughout the sticky summer the people of London obsess over the fate of the dominant mysterious woman and her weak husband as the full detail of their slaughter unfolded.\"London 1849\" follows the murder, the trial and the execution, interweaving all the way the scene that was London: crime, noise, cholera, overpacked slums, prostitution, law and order, prisons. Michael Alpert uses the story to reveal life on the docks where the victim worked, the neighborhood where the Mannings lived, sensational press coverage, marital and sexualbehavior, medical progress against disease, the influx of immigrants, and public obsession with the killers. It is a grisly murder story set against the Victorian London, drawn in colorful and personal detail.",
  "genres": [
    "True Crime",
    "History",
    "Nonfiction",
    "Crime",
    "Victorian",
    "Mystery",
    "Historical"
  ],
  "author": "Michael Alpert",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/1670095.London_1849"
}