{
  "title": "Mildred Keith",
  "description": "Before Martha Finley had completed the first six titles of The Elsie Books in 1876, she began a new series based upon the Dinsmore's Midwestern relatives, the Keiths. The resulting seven-book series, The Mildred Series, introduces Mildred Keith, their sixteen-year-old daughter. Her father, a lawyer by trade, had moved with his wife and eight children from Ohio to the frontier of Indiana in the 1830s (not unlike Martha Finley's identical journey as a girl with her family). At the end of the first book, Mildred becomes very ill with a fever and is slow to recover. Arthur Dinsmore Sr., Elsie's grandfather, travels from Roselands, his home in the East, to visit the Keiths. While there, he suggests that the southern climate at Roselands may be beneficial to Mildred's health. This is followed by the death of Elsie's guardian in Louisiana. Mildred travels with Arthur Dinsmore to visit Elsie at Viamede. In this way, The Mildred Books fill the reader in on some of the events of Elsie's early childhood before the Elsie series opens. Martha Finley has woven the characters of the two series in and out of her stories to fill in some of the sequential gaps in the plot lines of her early Elsie stories and to provide some further depth to her characters and their relationships with one another. In this way she enriches the Elsie stories that have thrilled girls for more than 130 years. Sixteen-year-old Mildred moves with her father, mother, and seven brothers and sisters from their home in Ohio to the frontier of Indiana, and Mildred's maiden aunt, Wealthy Stanhope, travels west with them. Horace Dinsmore, Elsie's father, pays a visit to his cousin, Marcia Keith, and her family in Indianabefore departing on a long trip to Europe, and sadly, the entire Keith family is stricken with ague.",
  "genres": [
    "Christian Fiction",
    "Fiction",
    "Classics",
    "Historical Fiction",
    "Christian",
    "Historical"
  ],
  "author": "Martha Finley",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/1673338.Mildred_Keith"
}