{
  "title": "The Soul of Kaesh",
  "description": "Akiva is the last of her kind when her village is destroyed by an army of undead. She finds herself mixed up with a ragtag group in search of a legendary soul where she herself is the key to acquiring it. Meanwhile, the lord of their province is stirring up problems of his own in his ambition to expand his lands and all the while an enemy across the sea is vying to acquire the soul for himself.This is the first book of what will be a series of books set in the enchanting world of Nuvia. The story revolves around three main story lines that intertwine as the book progresses. All things considered, it's one hell of a ride.When our story begins the Velentian Kingdom is at peace. A young lord of a remote province, Darren Graymane, has ambitions beyond his own borders. Prodded by his new young bride, his own mother, and a desire for a rare precious metal called Onix Escuro, he leads his people into war. Things are quickly turned upside down though when his bride decides she would rather be a queen than merely a lord's wife. Then there is Akiva, a Highlander who believes she is the last of her kind. Her village and her people were destroyed by an enemy across the sea known as Malvado, who's in search of the soul of Kaesh. A legend told for centuries, the soul of Kaesh is said to be entombed in a high mountain lake and posses great powers. Early on Akiva teams up with an unlikely bunch of individuals in an attempt to free the soul themselves and keep it out of the hands of their enemy. Malvado reigns with a heavy hand on a continent across the sea. Trapped in a tower because of his own magic, he seeks the soul for himself in order to free him from his self imposed prison. It's no easy task though when disgruntled members of his own council, rebel elves, and those close to him are plotting to hinder his quest for power and immortality. Along the way, as the three story lines come together, there are many adventures, mishaps, and even a hint of romance.The world of Nuvia has many of the common elements you've become accustomed to finding in other fantasy novels, but more often than not with an unexpected twist. On Nuvia the elves are not your average cliche fantasy elves. Those that still live free live as they have for millenia. Those that have been subjugated by the humans have turned to lives of begging, prostitution, and servitude. Dwarfs in the human lands are pimps more often than not, that is if they are not drunks and homeless living in the streets. There are goblins, shapeshifters, undead, and mermaids that will make you think twice before taking a dip in the water.",
  "genres": [],
  "author": "Owen Borseth",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/16742003-the-soul-of-kaesh"
}