{
  "title": "Tulia",
  "description": "A modern-day American classic, the non-fiction equivalent to TO KILL A MOCKINGBIRD. A story about how easily good people are led astray; how carelessly injustice is rationalized, but finally, of due process and justice being served. Early one morning in the summer of 1999 authorities in the tiny west Texas town of Tulia began a roundup of suspected drug dealers. By the time the sweep was done, over forty people had been arrested and one of every five black adults in town was behind bars. All were accused of dealing cocaine to the same undercover officer, Tom Coleman, the son of a well-known Texas Ranger who was named Officer of the Year in Texas. Not until after the trials-in which Coleman's uncorroborated testimony secured sentences as long as 361 years-did it become apparent that Tom Coleman was not the man he claimed to be.  TULIA is the story of this town, the bust, the trials, and the heroic legal battle to reverse the convictions that caught the attention of the nation in the spring of 2003. With a sure sense of history and of place, a great feel for the characters involved, and showdowns inside the courtroom and out. Blakeslee's TULIA is contemporary journalism at its finest, and a thrilling listen. The scandal changed the way narcotics enforcement is done in Texas, and has put the national drug war on trial at a time when incarceration rates in this country have never been higher. However, the story is much bigger than the tale of just one bust. As TULIA makes clear, these events are the latest chapter in a story with themes as old as the country itself. It is a marvelously well-told tale about injustice, race, poverty, hysteria, desperation, and doing the right thing in America.",
  "genres": [
    "Nonfiction",
    "True Crime",
    "Crime",
    "History",
    "Journalism",
    "Book Club",
    "Race"
  ],
  "author": "Nate Blakeslee",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/1675189.Tulia"
}