{
  "title": "The Female Brain",
  "description": "Since Dr. Brizendine wrote The Female Brain ten years ago, the response has been overwhelming. This New York Times bestseller has been translated into more than thirty languages, has sold nearly a million copies between editions, and has most recently inspired a romantic comedy starring Whitney Cummings and Sofia Vergara. And its profound scientific understanding of the nature and experience of the female brain continues to guide women as they pass through life stages, to help men better understand the girls and women in their lives, and to illuminate the delicate emotional machinery of a love relationship.Why are women more verbal than men? Why do women remember details of fights that men can’t remember at all? Why do women tend to form deeper bonds with their female friends than men do with their male counterparts? These and other questions have stumped both sexes throughout the ages.Now, pioneering neuropsychiatrist Louann Brizendine, M.D., brings together the latest findings to show how the unique structure of the female brain determines how women think, what they value, how they communicate, and who they love. While doing research as a medical student at Yale and then as a resident and faculty member at Harvard, Louann Brizendine discovered that almost all of the clinical data in existence on neurology, psychology, and neurobiology focused exclusively on males. In response to the overwhelming need for information on the female mind, Brizendine established the first clinic in the country to study and treat women’s brain function.In The Female Brain, Dr. Brizendine distills all her findings and the latest information from the scientific community in a highly accessible book that educates women about their unique brain/body/behavior.The result: women will come away from this book knowing that they have a lean, mean, communicating machine. Men will develop a serious case of brain envy.",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Science",
    "Neuroscience",
    "Self Help",
    "Health",
    "Womens"
  ],
  "author": "Louann Brizendine",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/1675399.The_Female_Brain"
}