{
  "title": "Wink: The Incredible Life and Epic Journey of Jimmy Winkfield",
  "description": "Long before Jackie Robinson broke the race barrier and integrated major league baseball, black jockeys had raced side-by-side with whites for nearly two hundred years. Around the turn of the twentieth century, black jockeys were among the best in the horse racing business. Indeed, they became such a threat to their white counterparts that they were banned from racing and their accomplishments, names, and stories have been lost to history. One might ask: who is the latest of the great black jockeys to ride in and win one of our nation's premiere races? What black jockey last won one of America's famous Triple Crown events? Sadly, the answer to both questions is the same: Jimmy Winkfield, in 1902. For the record, he won the Kentucky Derby in 1901 and 1902 - one of only a handful of jockeys to ever win the coveted race in consecutive years. But Jimmy Winkfield's story didn't end in 1902. A jockey without a home, Wink claimed most of the major purses in continental Europe. The All-Russian Derby boasted a purse three times that of the Kentucky Derby, and Wink won it three times in a row.; He was internationally famous and a fabulously wealthy member of the Russian aristocracy when the Bolsheviks overthrew the czar in 1917. Leaving Moscow for Odessa with his Russain wife, Winkfield and others continued to race, then, with the Bolsheviks advancing, marched 200 thoroughbreds a thousand miles to Poland, surviving on horseflesh. By the late 1930s he was training horses on the expansive grounds of his villa outside Paris when German troops occupied his house and stables. After challenging a horse-beating Nazi with a pitchfork, he was forced to flee again. After the war, Jimmy returned to the US only once, in 1961. Invited to the Kentucky Derby banquet at the legendary Brown Hotel, he arrived with his daughter, but because they were black, they were told they couldn't use the front door. Once inside, they were ignored. Wink died in Paris in 1974, still homesick at 94 for the Kentucky bluegrass of his boyhood.",
  "genres": [
    "Biography",
    "History",
    "Sports",
    "Racing",
    "Horse Racing",
    "Horses",
    "Nonfiction"
  ],
  "author": "Edward Hotaling",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/16759654-wink"
}