{
  "title": "Lola in the Mirror",
  "description": "Bighearted, gritty, magical and moving, Lola in the Mirror is the irresistible new novel from international bestselling author of Boy Swallows Universe and All Our Shimmering Skies , Trent Dalton.'Mirror, mirror, on the grass, what's my future? What's my past?' A girl and her mother are on the lam. They've been running for sixteen years, from police and the monster they left in the kitchen with the knife in his throat. They've found themselves a home inside an orange 1987 Toyota HiAce van with four flat tyres parked in a scrapyard by the edge of the Brisbane River – just two of the 100,000 Australians sleeping rough every night. The girl has no name because names are dangerous when you're on the run. But the girl has a dream. Visions in black ink and living colour. A vision of a life as a groundbreaking artist of international acclaim. A life outside the grip of the Brisbane underworld drug queen 'Lady' Flora Box. A life of love with the boy in the brown suit who's waiting for her in the middle of the bridge that stretches across a flooding and deadly river. A life far beyond the bullet that has her name on it. And now that the storm clouds are rising, there's only one person who can help make her dreams come true. That person's name is Lola and she carries all the answers. But to find Lola, the girl with no name must first do one of the hardest things we can sometimes ever do. She must look in the mirror. A big, moving, blackly funny, violent, heartbreaking and beautiful novel of love, fate, life and death and all the things we see when we look in the mirror. All of the past, all of the present, and all of our possible futures. 'Mirror, mirror, please don't lie. Tell me who you are. Tell me who am I.'",
  "genres": [
    "Fiction",
    "Book Club",
    "Contemporary",
    "Audiobook",
    "Australia",
    "Magical Realism",
    "Literary Fiction"
  ],
  "author": "Trent Dalton",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/167582092-lola-in-the-mirror"
}