{
  "title": "Casting off the Veil: The Life of Huda Shaarawi, Egypt's First Feminist",
  "description": "Born into a wealthy and powerful Egyptian family, Huda Shaarawi was destined to lead a leisurely life in luxurious settings. She decided instead to acquire an education and to participate in the liberation of Egypt from the British occupation. Huda became famous overnight when she led a peaceful walk of veiled women across Cairo in 1919 to free the leaders of the Egyptian resistance who were detained by the British forces. She was then invited by the members of the Bureau of the IAWS (International Alliance for Women's Suffrage) to participate in the international conference in Rome in 1923. Huda became the lifelong friend of Western and other feminist leaders at that conference. It was after this conference in Cairo when she and her two traveling companions removed their face veil upon leaving the train at the railway station and were spontaneously imitated by all the other women in what became a landmark gesture in Egyptian history. In 1923, Huda founded the Egyptian Feminist Union affiliated to the IAWS, and began publishing a French magazine, L'Egyptienne, to circulate information about Egypt's plight and achievements under the occupation, and to promote peace between Eastern and Western countries. She soon became - and remained for many years - one of the Vice-Presidents of the International Organization of Women. Huda Shaarawi alternated political advocacy with social and cultural projects. She spoke on behalf of the Arab and African peoples in International Fora, founding two magazines in Arabic to circulate information in her area of the world. Huda founded schools, supported artists, medical dispensaries, and cottage industries, and participated in funding the establishment of the first entirely Egyptian Bank and its many affiliated projects. A promoter of progress, Huda stubbornly and tirelessly advocated peace, justice, and equality in an increasingly violent world.",
  "genres": [
    "Feminism",
    "Nonfiction",
    "History",
    "Egypt",
    "Philosophy",
    "Gender",
    "Biography"
  ],
  "author": "Sania Sharawi Lanfranchi",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/10722557-casting-off-the-veil"
}