{
  "title": "I Dreamed I Married Perry Mason",
  "description": "The Barnes & Noble ReviewIt started with a case of writer’s block. Pretty, vivacious Cece Caruso turned to a life of crime after her divorce. But she’s neither breaking and entering nor running cons. Instead, she’s writing biographies of famous crime novelists, and now it’s Erle Stanley Gardner’s turn under Cece’s magnifying glass.While the creator of Perry Mason had an exciting life, including his own share of courtroom dramatics as a lawyer, it was his Court of Last Resort that fascinated Cece. The Court of Last Resort was a place where those wrongly convicted could petition Gardner to find enough evidence to reopen their cases. Cece was researching the Court in the hope it would give her enough material to propel her through her unfinished chapters. In a last-ditch effort to procrastinate—while pretending to work—she goes to visit an elderly prison inmate whose desperate appeal she finds misfiled and unexplored among the otherwise meticulously organized files of the Erle Stanley Gardner Archives.From there, it’s a surprisingly short step to working the long-neglected case, just to get a feel for what Gardner did so often. That’s the first step down a slippery slope that soon pulls Cece into a case closed 40 years ago, when a man was sent to jail for killing his wife. And that cold case suddenly turns hot when the murdered woman’s sister is knifed to death shortly after Cece interviews her. Inspired by the thought of Perry Mason at her side in her quest for justice, ex beauty queen Cece straightens her stocking seams (she’s a vintage clothing buff) and sets out to untangle mysteries, solve two murders, and finish her manuscript on time.——“L.A. Times art critic Susan Kandel is sure to delight readers with her innovative fictional exploration of a fascinating facet of the history of crime fiction.” Sue Stone",
  "genres": [
    "Mystery",
    "Fiction",
    "Cozy Mystery",
    "Cozy",
    "Chick Lit",
    "Mystery Thriller",
    "Humor"
  ],
  "author": "Susan Kandel",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/16776.I_Dreamed_I_Married_Perry_Mason"
}