{
  "title": "Mr. Bloomfield's Orchard: The Mysterious World of Mushrooms, Molds, and Mycologists",
  "description": "Stinkhorns, puffballs, the corpse finder, deadly galerina, Satan's bolete, birch conks, black mold, the old man of the woods-the world of fungi is infinitely varied and not a little weird. Now, in Mr. Bloomfield's Orchard, Nicholas Money introduces readers to a dazzling array of fungi, from brewer's yeast and Penicillium to the highly lethal death cap. This is an entertaining book that also provides a solid introduction to the biology of fungi as well as much insight into how scientists study fungi in the lab and in the field. Readers will be intrigued by the many exotic fungi discussed. One fungus in Oregon, for instance, covers 2,000 acres and is now considered the world's largest organism. We learn of Madurella, which can erode bones until they look moth-eaten; Cordyceps, which wracks insects with convulsions, kills them, then sends a stalk out of the insect's head to release more infectious spores; and Claviceps, the poisonous ergot fungus, which causes hallucinations (the women charged with demonic possession in Salem in 1691 may have been victims of ergot consumption).; Money also showcases the lives of famed mycologists-including Reginald Buller who wore horse blinders as he walked to work, the better to study luminescent fungi in his dark lab, and Charles Tulasne, the Audubon of fungi, whose illustrations of specimens border on art. And he recounts his own childhood introduction to fungi in Mr. Bloomfield's orchard, where trees and fruit were devoured by a rogue's gallery of bitter rot, canker, rust, powdery mildew, rubbery wood, and scab. Told with a refreshing sense of humor, Mr. Bloomfield's Orchard will fascinate anyone interested in the natural world.",
  "genres": [
    "Science",
    "Nature",
    "Nonfiction",
    "Biology"
  ],
  "author": "Nicholas P. Money",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/16782727-mr-bloomfield-s-orchard"
}