{
  "title": "When Evening Comes: The Education of a Hospice Volunteer",
  "description": "When Christine Andreae signed up for twenty-seven hours of patient-care training with the Blue Ridge Hospice in Virginia's Shenandoah Valley, her parents were still living and her grandparents' funerals hadn't involved a viewing. Her only direct experience with death had been when, at the age of six, she had gone with her father to the viewing for the family's parish priest.At a training session, the leader passed around a tray of small objects and asked participants to choose one that represented what they felt they could give to a dying person. Christine randomly took an old-fashioned key, for no reason that she knew. And when it was her turn to speak, \"feeling like a liar\" she stammered something about \"opening doors to people.\" Looking back, she says, \"Perhaps what I wanted was to open a door for myself.\" In its directness and honesty, this beautiful book about accompanying the dying is far from saddening-instead it is truly inspirational in the best sense. Starting with Bivie, her first patient, then going to the very different Amber, and to several others whose need for care was more short-term, the author began to see terminal illness not as some dreaded \"thing\" hovering in the distance, but as an \"everyday\" reality. She learned that because the dying continue to live until that final day comes, daily activities continue, tapering off gradually. The mothers among her patients wanted to care for children and households, to manage their affairs, or to pursue other interests-one, for instance, wrote (very bad) poetry. They wanted to continue doing the things they did before their lives were interrupted by illness (in most of Christine's cases, cancer).Contrary to the ideas so many of us have about our behavior in the face of terminal illness, the dying do not welcome people tiptoeing around their illness and offering solemn sympathy. They want things to be as much like they had been as possible. And they need someone to be there, to talk to, to listen to, to gossip with, and sometimes, of course, to complain to. When her first patient, Bivie, died, Andreae wrote: How presumptuous I was at the outset, thinking that I could somehow \"help\" Bivie die! Ultimately, the process of dying-like the process of living-is a unique and solitary task for each of us. No one can \"get it right\" for us. On the other hand, we can bear witness to each i0other's passages. At birth and death, we can hear each other, love each other, learn from each other. And there is the most profound help in that-for everyone present.",
  "genres": [
    "Memoir"
  ],
  "author": "Christine Andreae",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/1680255.When_Evening_Comes"
}