{
  "title": "Serial Killers and Sadistic Murderers Up Close and Personal",
  "description": "After twenty-five years of investigating, analyzing, and interviewing serial killers, their family members, neighbors, and even surviving victims, Jack Levin has become one of the world's most respected experts on the motivations and modus operandi of dangerous criminals. In this gripping book, he taps his wealth of experience with the criminal mind to offer lessons for law enforcement and the general public about how serial killers think, as well as the conditions under which hideous murders typically occur. These lessons, he hopes, will lead to more effective ways to thwart such crimes in the future. Levin's face-to-face meetings and correspondence with such notorious murderers as the Hillside strangler (Kenneth Bianchi) and Orville Lynn Majors (the male nurse who was convicted of killing numerous patients in his charge) reveal that these types of killers are not motivated by money, revenge, or rage. In fact, the only motivation seems to be a sadistic craving for power and a need to feel in control. Levin also, for the first time, lets down his guard and reveals what it feels like to be seated so close to such cold-blooded killers.Many killers, as Levin points out, are meticulous planners. Levin has found that even in situations that appear spontaneous, for instance a workplace shooting by a disgruntled employee, the deed is carefully thought out and prepared for in advance. Another factor that consistently emerges in conversations with killers who have committed the most heinous of acts is the total absence of remorse or any notion of moral responsibility. Murder appears to be easy for these criminals and they kill with a feeling of complete impunity. Levin also notes the skillfully deceptive facades that such murderers are able to affect. They are extremely adept liars (he admits to having been fooled!), who enjoy playing mind games, even though outwardly they seem above suspicion. This is one reason they are so dangerous and difficult for investigators to track down and prosecute. This chilling glimpse into the minds of some of the worst criminals makes a valuable contribution to criminology and is a must-read for both true-crime buffs and law enforcement professionals.",
  "genres": [
    "True Crime",
    "Crime",
    "Psychology",
    "Nonfiction"
  ],
  "author": "Jack Levin",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/1072374.Serial_Killers_and_Sadistic_Murderers_Up_Close_and_Personal"
}