{
  "title": "Greek Religion",
  "description": "In this book Walter Burkert, the most eminent living historian of ancient Greek religion, has produced the standard work for our time on that subject. First published in German in 1977, it has now been translated into English with the assistance of the author himself. A clearly structured and readable survey for students and scholars, it will be welcomed as the best modern account of any polytheistic religious system.Burkert draws on archaeological discoveries, insights from other disciplines, and inscriptions in Linear B to reconstruct the practices and beliefs of the Minoan–Mycenaean age. The major part of his book is devoted to the archaic and classical epochs. He describes the various rituals of sacrifice and libation and explains Greek beliefs about purification. He investigates the inspiration behind the great temples at Olympia, Delphi, Delos, and the Acropolis—discussing the priesthood, sanctuary, and oracles. Considerable attention is given to the individual gods, the position of the heroes, and beliefs about the afterlife. The different festivals are used to illuminate the place of religion in the society of the city-state. The mystery cults, at Eleusis and among the followers of Bacchus and Orpheus, are also set in that context. The book concludes with an assessment of the great classical philosophers’ attitudes to religion.Insofar as possible, Burkert lets the evidence—from literature and legend, vase paintings and archaeology—speak for itself; he elucidates the controversies surrounding its interpretation without glossing over the enigmas that remain. Throughout, the notes (updated for the English-language edition) afford a wealth of further references as the text builds up its coherent picture of what is known of the religion of ancient Greece.",
  "genres": [
    "History",
    "Nonfiction",
    "Mythology",
    "Ancient History",
    "Greece",
    "Classics",
    "Greek Mythology"
  ],
  "author": "Walter Burkert",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/168032.Greek_Religion"
}