{
  "title": "The Exploits of Engelbrecht: Abstracted from the Chronicles of the Surrealist Sportsman's Club",
  "description": "Maurice Richardson's cult classic is one of the strangest works of fiction ever written. Fifteen stories that relate the activities of the Surrealist Sportsman's Club, a society with very dubious morals that spends the time it has left between the collapse of the moon and the end of the universe taking the concept of the 'game' to its logical limit.  A club can't operate without members, and those of the SSC are as strange and astonishing as some of the events they compete in. Most formidable of all, and more than just a little sinister, is the old Id, an \"elemental force\" who thinks nothing of venturing forth from his home at Nightmare Abbey to arrange a rugby match between Mars and the entire human race, or of playing chess with boy scouts and nuclear bombs as pieces.  Centre stage, however, is given to Engelbrecht himself, the dwarf boxer. Surrealist boxers don't take on human opponents, but \"do most of their fighting with clocks.\" Engelbrecht has his fair share of those and even bests a malign Grandfather Clock in a match where years rather than money is at stake, but his talents are also called upon to help him deal with almost the whole spectrum of Gothic, electric and purely impossible threats in a style both charming and ferocious. He's an eternal optimist and it's his pluck and spirit, rather than his fists or footwork, which generally make the greatest contribution to the precarious well-being of his club.  The tone of these adventures is a curious blend of Gothic and science fiction, but an avant-garde Gothic and an absurdist SF, a voice which simultaneously lampoons much of the atmosphere found in novels of the past and future while making a genuine contribution to both kinds. Richardson has placed his tongue firmly in his cheek, true, but then he has proceeded to bite it off with molars sharpened on the grindstones of profundity...  “The Exploits of Engelbrecht is English surrealism at its greatest. Witty and fantastical, Maurice Richardson was light years ahead of his time. Unmissable.” - J.G. Ballard",
  "genres": [
    "Fantasy",
    "Short Stories",
    "Fiction",
    "Literature"
  ],
  "author": "Maurice Richardson",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/1681402.The_Exploits_of_Engelbrecht"
}