{
  "title": "Gone to an Aunt's: Remembering Canada's Homes for Unwed Mothers",
  "description": "Thirty or forty years ago, everybody knew what that phrase meant: a girl or a young, unmarried woman had gotten herself pregnant. She was “in trouble.” She had brought indescribable shame on herself and her family. In those days it was unthinkable that she would have her child and keep it. Instead she had to hide. Most likely she would be sent away to a home for unwed mothers, where she would stay in secrecy until her baby was born and given up for adoption. “Gone to an aunt’s” was the usual cover story, a fiction that everyone understood but no on talked about –until now.In Gone to an Aunt’s, journalist and long-time television host Anne Petrie takes us back into these homes for unwed mothers. Most cities in Canada had at least one home, several as many as five or six, most of them run by religious organizations. Here, in institutional settings, the girls were kept out of sight until their time was up and they could return to the world as if nothing had happened. Seven women –including the author – recount their experiences in Gone to an Aunt’s, talking openly, some for the first time, about how they got pregnant; the reaction of their parents, friends, boyfriends, and lovers; why they wound up in a home; and how they managed to cope with its rules and regulations –no last names, no talking about the past –and the promise of salvation that could come only through work and prayer.Gone to an Aunt’s is a profoundly moving and compassionate –even alarming – account. It comes as a reminder that we not get too wistful for the supposedly innocent times before the sexual revolution. That innocence, Petrie shows vividly, was a charade made believable only because the thousands of girls who had broken the rules were hidden away.",
  "genres": [
    "Nonfiction",
    "Canada",
    "Historical"
  ],
  "author": "Anne Petrie",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/1682845.Gone_to_an_Aunt_s"
}