{
  "title": "Bermuda Schwartz",
  "description": "From the Edgar-nominated, bestselling series that gets better with each book, and an author who constantly surprises, comes Bermuda Schwartz--a tale of hidden treasure, murder, romance, and rum.A young scuba guide, scouting new dive sites in the shipwreck-laden reefs that rim Bermuda, makes a fatal discovery--a treasure more valuable than gold or jewels. And some people are willing to kill for it.Enter Zack Chasteen, knockabout palm-tree farmer, and his inscrutable Taino associate, Boggy, who have been dragged to Bermuda by Zack's ladylove, Barbara Pickering. She needs their help throwing a gala 75th birthday party for her wealthy and eccentric Aunt Trula. While there, Zack drops by the bank to visit his money, a couple of million dollars earned in recent exploits that he has stashed away in one of the country's notorious tax-free offshore accounts. Big problem: Zack's money is gone and his bankers can't seem to explain where it is or who might have it.Zack is grappling with another issue as well: Where is this whole thing going with him and Barbara Pickering? She's not pressing, but it's clear she'd like to tie the knot, maybe start a family. Is Zack really ready to say, \"I do?\" As he wrestles with the dilemmas of love and money, both of which may wind up lost, Zack falls in with wise and wily Teddy Schwartz, a legendary Bermudan treasure salvager and one of Aunt Trula's longtime paramours. Schwartz is harboring a few secrets of his own, and Zack is soon crossing paths with a secret sect of religious zealots who are hoping to complete a bloody and tumultuous two-thousand-year-old quest.Suspenseful, laugh-out-loud hilarious, and startlingly original, Bermuda Schwartz is Bob Morris's best book yet, a rollicking island yarn that turns the historical puzzle thriller on its head!",
  "genres": [
    "Mystery",
    "Fiction",
    "Mystery Thriller",
    "Humor"
  ],
  "author": "Bob Morris",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/168351.Bermuda_Schwartz"
}