{
  "title": "Tarzan of the Apes",
  "description": "Tarzan of the Apes, by Edgar Rice Burroughs, is part of the Barnes & Noble Classics series, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of Barnes & Noble Classics:All editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. Barnes & Noble Classics pulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works. In 1888 Lord and Lady Clayton sail from England to fill a military post in British West Africa and perish at the edge of a primeval forest. When their infant son is adopted by fanged “great anthropoid apes,” he becomes one of the most legendary figures in all of literature—Tarzan of the Apes. Within the society of speechless primates, Tarzan wields his natural influence and becomes king. Self-educated by virtue of his parents’ library, Tarzan discovers true civilization when he rescues aristocratic Jane Porter from the perils of his jungle. Their famous romance, which pits Tarzan’s lifetime of savagery against Jane’s genteel nature, has captivated audiences for nearly a century. First published in 1914, Tarzan of the Apes is the first of several works by Edgar Rice Burroughs that delineate Tarzan’s manifold and amazing feats. Despite his reputation as a pulp writer, Burroughs spins an exhilarating yarn detailing the laws of the jungle and the intricate dilemmas of the British gentry as he examines the struggle between heredity and environment. Maura Spiegel teaches literature and film at Columbia University and Barnard College. She is the co-author of The Grim Reader and of The Breast Book: An Intimate and Curious History. She co-edits the journal Literature and Medicine.",
  "genres": [
    "Classics",
    "Fiction",
    "Adventure",
    "Fantasy",
    "Africa",
    "Pulp",
    "Audiobook"
  ],
  "author": "Edgar Rice Burroughs",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/168441.Tarzan_of_the_Apes"
}