{
  "title": "The Soul and Its Mechanism",
  "description": "- It is an established and accepted occult fact that the soul works through the mechanism of the three-fold personality in stimulating the three worlds of human evolution - the mental, the emotional and etheric/physical planes of consciousness. In this book the method by which the soul and the personality vehicles interact and function together is clearly presented. The author also reveals the relationship between what the occultist accepts in the constitution of man as the vital body, the etheric network with its energy vortices, or centres, and the physiological effects on the body through glandular secretions directly into the bloodstream. This is the endocrine system of glands, which correspond in the physical body to the energy centres in the etheric body and which, therefore, react to the type and potency of force the etheric body circulates at any one time. Human behaviour, and the disposition of the physical body, are conditioned by the extent to which the personality vehicles either receive or reject the impulses of the soul; and this is conditioned by the emphasis or focus of consciousness at any one time. The physical vehicle is not a principle; it responds to any dominant force expressing itself through the etheric system of energy centres. A highly emotional condition, for example, in which the solar plexus energy centre in the vital body is overstimulated, powerfully affecting its physical counterpart, the pancreas gland, produces an oversecretion of the gland and a consequent general imbalance within the personality. It is obvious that in a highly evolved man, the personality vehicles are aligned, the etheric body vital and balanced, and the energy centres controlling the physical body receptive to the influence of the soul through the mechanism of the integrated personality. But until this condition is created in consciousness, the mechanism of response is more or less isolated in its personality glamours. It is said that the aspirant to discipleship really needs to know only two things: the constitution of man and the next step ahead. In this book the way the human constitution actually functions in its component parts is made abundantly clear. It is an accepted goal for the aspirant that he learns to make of his personality equipment an instrument for the soul to use. Knowledge of the relation between the subtle and the dense bodies, the etheric centres and the physical glands, energy and force, the soul and its personality mechanism, can lift the process out of the vague haze which normally surrounds it, giving to it the clarity and precision of a scientific formula. Not only, however, is this a matter of form and energy, the whole man is involved in the process and in the effects - psychologically, philosophically and spiritually; for energy flows as the result of thought, and the quality, nature and potency of thought is a matter of consciousness, which includes the whole way of living. Where the normal focus of consciousness is in daily life, there will be found the energy centre controlling the mechanism of response. The books of Alice A. Bailey, written in cooperation with a Tibetan teacher between 1919-1949, constitute a continuation of the Ageless Wisdom--a body of esoteric teaching handed down from ancient times in a form which is always suitable to each period. Intended to precede and condition the coming era, the Alice A. Bailey writings offer an unparalleled spiritual approach to such subjects as the teaching on Shamballa and the Path of spiritual evolution; the spiritual Hierarchy; the new discipleship and training in meditation as a form of service; the teaching on the seven rays and the new psychology of the soul; the teaching on esoteric astrology; and the new world religion, which emphasizes the common thread of truth linking all the major world faiths.",
  "genres": [
    "Spirituality",
    "Theosophy"
  ],
  "author": "Alice A. Bailey",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/1685383.The_Soul_and_Its_Mechanism"
}