{
  "title": "Resurrecting Midnight",
  "description": "International assassin Gideon spilled blood for the first time when he was seven years old, with a single shot to the head of a man who was attempting to kill the woman Gideon had known as his mother. The victim was none other than his own father, a man of unspeakable evil. This pivotal event shaped Gideon throughout his life, made him who he is, one of the fiercest, most feared hired guns in the world.And one of the most hunted.After nearly losing his life in Antigua during a mission that went terribly wrong, Gideon trusts no one. But when a former lover and grifter, Arizona, resurfaces in need of his skills, she reminds him he was indebted to a man who had once saved his the son of the legendary con-man Scamz. Gideon is forced to take on an assignment which will lead him to Argentina in pursuit of a briefcase containing one part of a larger puzzle. The \"package\" contains material that another group of assassins ? the Four Horsemen of the Apocalypse ? will kill to obtain and protect. One of the leaders of the Four Horsemen has a connection to Gideon that neither man is aware of -- a connection that will be exposed when they meet face-to-face and gun-to-gun. Each member of The Four Horsemen is a world-class killer, each with a dark and dangerous past, and nothing will stop that team of renegades from completing their mission.As Gideon struggles to keep promises and uncover information about his past, he finds himself at the center of the ultimate double-cross and he is forced to do what he must to protect himself and those closest to him. Set amidst the exotic and vibrant streets of Miami and Buenos Aires, Resurrecting Midnight is an action-filled, pulse- pounding thriller from bestselling author Eric Jerome Dickey.",
  "genres": [
    "Fiction",
    "African American",
    "Thriller",
    "Suspense",
    "Mystery Thriller",
    "Urban",
    "Contemporary"
  ],
  "author": "Eric Jerome Dickey",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/1686165.Resurrecting_Midnight"
}