{
  "title": "King of the Badgers",
  "description": "A Washington Post Notable Fiction Book for 2011 One of The Telegraph ’s Best Fiction Books 2011 Far from London’s crime and pollution, Hanmouth’s wealthier residents live in picturesque, heavily mortgaged cottages in the center of a town packed with artisanal cheese shops and antiques stores. They’re reminded of the town’s less desirable outskirts—with their grim, flimsy housing stock and chain stores—only when their neighbors have the presumption to claim also to live in Hanmouth. When an eight-year-old girl from the outer area goes missing, England’s eyes suddenly turn toward the sleepy town with a curiosity as piercing and unblinking as the closed-circuit security cameras that line Hanmouth’s idyllic streets. But somehow these cameras have missed the abduction of the girl, whose name is China. Is her blank-eyed hairdresser mother hiding her as part of a moneymaking hoax? Has she been abducted by one of the lurking perverts the townspeople imagine the cameras are protecting them from? Perhaps more cameras are needed? As it turns out, more than one resident of Hanmouth has a secret hidden behind closed doors. There’s Sam and Harry, the cheesemonger and aristocrat who lead the county’s gay orgies. The quiet husband of postcolonial theorist Miranda (everyone agrees she’s marvelous) keeps a male lover, while their daughter disembowels dolls she’s named Child Pornography and Slightly Jewish. Moral crusader John Calvin’s Neighborhood Watch has an unusual reason for holding its meetings in secret. And, of course, somewhere out there is the house where little China is hidden. With the dark hilarity and unflinching honesty of a modern-day Middlemarch , King of the Badgers demolishes the already fragile privacy of Hanmouth’s inhabitants. These characters, exquisitely drawn and rawly human, proclaim Philip Hensher’s status as an extraordinary chronicler of the domestic, and one of the world’s most dazzling and ambitious novelists.",
  "genres": [
    "Fiction",
    "LGBT",
    "Literary Fiction",
    "Novels",
    "Book Club",
    "Contemporary",
    "British Literature"
  ],
  "author": "Philip Hensher",
  "average_rating": "3.38",
  "url": "https://www.goodreads.com/book/show/10725807-king-of-the-badgers"
}