{
  "title": "In Desert and Wilderness",
  "description": "In the tradition of Robinson Crusoe and Treasure Island comes a Sienkiewicz novel for readers of all ages! This thrilling adventure saga and coming-of-age tale sets two young children, Stas Tarkowski, fourteen, and Nelly Rawlison, eight, within the reaches of Africa's desert storms, the ravages of hunger, and threatening jungles filled with vicious animals and warring tribes. Everything for the pair seemed comfortable and safe in Egypt. But when the children are separated from their fathers during a vacation along the Nile, they become pawns in a treacherous plot and are abducted by the vengeful followers of the Mahdi. Joined in their trek by two African children, Kali and Mea, and together with the aid of a faithful dog, Saba, and a mighty elephant, King, the unlikely troop makes its way through deep Africa while facing perilous situations that would render helpless even grown men and women. Throughout this enthralling novel, author Sienkiewicz paints the vivid scenery of what was then known as \"the dark continent,\" a land filled with unknown peoples, primordial landscapes, tall and deep jungles, uncharted rivers and mountains. Political instability, then as now, could make entire regions impassable. In the 1880s one such crisis, a rebellion led by \"the Mahdi,\" threatened to turn a large part of the continent into a hell of destruction and carnage. It is in such a background that Henryk Sienkiewicz, the master storyteller and winner of the 1905 Nobel Prize for literature, placed two European children - the heroes of this engaging tale. For Henryk Sienkiewicz, In Desert and Wilderness represented a final triumph; this was the last novel he would complete. Sienkiewicz, who had visited Africa in 1891, successfully recreates in the book the beauty he encountered amid the continent's entrancing landscape. Written over eighty years ago for a younger audience, but appealing to all ages, In Desert and Wilderness remains a literary treasure in Poland. Now the fine Max",
  "genres": [
    "Classics",
    "Polish Literature",
    "School",
    "Fiction",
    "Adventure",
    "Childrens",
    "Young Adult"
  ],
  "author": "Henryk Sienkiewicz",
  "average_rating": "3.32",
  "url": "https://www.goodreads.com/book/show/168696.In_Desert_and_Wilderness"
}