{
  "title": "More Than Words: The Speeches of Mario Cuomo",
  "description": "Mario Cuomo once said of Abraham Lincoln, \"He was a man of ideas, grand and soaring ones, \" but the description could be used just as easily to describe Cuomo. Here, in More than Words, the Governor of New York is seen and heard as a man of vision, a politician of poignancy and passion, and a leader whose achievements he puts behind himself as he stays riveted on the great burden of \"unfinished work\" that still lies ahead. More than Words is an extraordinary book. Stirring, provocative, lyrical, these twenty-nine speeches - among the finest of hundreds of talks given by Cuomo in three decades of public service - not only define the meaning of leadership in late-twentieth-century America but provide an insightful and personal portrait of the man himself. It is a son's tale of an immigrant father who \"dug ditches until he could save enough to buy the small grocery store and the rooms above it\" where Cuomo was born. And a mother who arrived alone in America with \"little more than a suitcase and the address of her laborer husband who had preceded her.\" The powerful love that bound the family together, their belief in the dignity of work and their willingness to sacrifice, the respect for God's creations, for themselves and for their responsibilities, are the values they passed on to all their children, including their third son, Mario Cuomo, and they are the values that are found woven through virtually all of his speeches. More than Words reflects the ideals of a man who has made it his task to point out the massive inequities that divide our nation into two camps - one prospering, the other suffering - and how this gulf was never bridged in the time of Reagan and Bush. Set in a historical context, More than Words can easily be read as a counterpoint - not so much Democratic counterpoint but a passionately expressed human counterpoint - to a generation of limousine executives who led America from 1980 through 1992. Mario Cuomo's vision of America was nowhere more more eloquently conveyed than in his keynote address to the Democratic Convention in San Francisco on the evening of July 16, 1984. Attacking the Reagan administration for its \"New Federalism\" while describing America as \"a tale of two cities,\" Cuomo took the country by storm with his command of the language and his ability to portray what Virgil once described as \"the tears of things\" (lacrimae rerum). After this speech his role as one of the nation's leading orators was secured.\" \"Along with this memorable keynote speech from 1984 are dozens of other addresses, some quite well known, others less so, that serve as the ideological and philosophical ledger that is Mario Cuomo. Included in More than Words are the Notre Dame speech on abortion, the American Bar Association speech of 1986 outlining the proper and improper ways by which a Supreme Court justice is nominated, the Springfield, Illinois, address on the legacy of Abraham Lincoln, and the Democratic nominating speech of 1992, as well as Cuomo's views on such subjects as freedom of the press, Israel, the death penalty, and the function of labor unions.",
  "genres": [
    "Biography",
    "History",
    "Politics"
  ],
  "author": "Mario Cuomo",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/168672.More_Than_Words"
}