{
  "title": "Xannu - The Prophecy",
  "description": "For fans of Lord of the Rings, Harry Potter and The Narnia Chronicles, the first installment in a thrilling epic fantasy series…Would you wake up in a hot sweat if you lived your night’s dreams as a soldier battling un-earthly creatures, witnessing powerful magic and fighting to save your own life on a daily basis?English schoolboy Terry West does. Frequently. After digging up some rune coins near a roman road, he has been living in another world inhabited by warlocks, seductresses, priests and prophecy. There Terry is a soldier, Teern Truthbringer, who has been tasked with finding the Xannu - 'he who will lead the people into deliverance.'If only it wasn’t real; but it is. Very real. When it all began it was even enjoyable, but now Terry’s life is getting very complicated. Somehow he involved his best friend Joe and although it had seemed a good idea at the time, the consequences had been dire. Then there is Susan, the leggy sister of klutzy school-friend Brian. Why does she keep sending him messages?Terry is struggling to balance the two lives he leads and every day he is losing his grip on reality just a little bit more. He’s been forced to kill enemies; his companion, the magical woman Maria, is scaring him half to death with her abilities; and his parents are on his back about his school work.How will he balance the two lives he leads, solve two sets of problems, and understand the lessons he receives from both? Only time will tell. But time is something Terry doesn't have too much of, as everything is unfolding in ways he could never have imagined!Book 1 of 'The Southern Lands' saga“Listen to the teachings of a wise man. You may not understand all he says but you will surely have nourishment for the future. Be positive and plan for success. Failure to plan is to plan for failure. Worry not at what came before but only prepare yourselves for that which is ahead.” (Pika’Al 10:1-5, The Scriptures of Al’Zaneed)",
  "genres": [],
  "author": "Paul Dorset",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/10725982-xannu---the-prophecy"
}