{
  "title": "Aladdin Relighted",
  "description": "Return to the magical land of the Arabian Nights....The end of “Aladdin of the Lamp” finds the cunning Aladdin ruler of a great kingdom. Now, many years have passed....Aladdin is older, richer and wiser...and heart broken. After losing his beloved wife and son to foul play, he resigns from being king and sets out to do what he does best....Now working as an anonymous relic hunter using the name Niddala (Aladdin spelled backwards), he’s hired by a desperate — and beautiful — noblewoman named Jewel to rescue her kidnapped son. Prince Zeyn, a powerful wizard from the magical land of Djinnland, has designs on Aladdin’s kingdom, and Jewel’s son is to be the final piece of a bloody plot to rule two worlds.To save the boy and his kingdom, Aladdin soon realizes he must seek the aid of a once-powerful ally, the mighty Djinn of the Lamp. Unfortunately, the djinn is being held prisoner by Zeyn in Djinnland, a magical land full of dragons and ogres, magic carpets and magic castles. With time rapidly running out, Aladdin and Jewel will journey into a world far stranger than anything they had ever imagined, a world full of danger at every turn, a world in which they may never return. It will take all their cunning and wits to stay alive...but will they do so in time to save the djinn, her son, and a kingdom?From bestselling authors Piers Anthony (Xanth) and J.R. Rain (Vampire for Hire), ALADDIN RELIGHTED is the first in a magical series featuring Aladdin and his Extraordinary Lamp.Acclaim for J.R. Rain and Piers “Anthony’s most ambitious project to date. Well conceived and written from the heart.”―Library Journal on Piers Anthony’s Isle of Woman“Be prepared to lose sleep!”―James Rollins, international bestselling author of The Doomsday Key on J.R. Rain’s The Lost Ark“Piers Anthony is a writer of passion. Volk is a masterpiece.”―Brad Linaweaver, author of Moon of Ice“Dark Horse is the best book I’ve read in a long time!”―Gemma Halliday, award-winning author of Scandal Sheet“Piers Anthony is one of the more colorful personalities in the SF world.”―Science Fiction Chronicle“Moon Dance is a must read. If you like Janet Evanovich’s Stephanie Plum, bounty hunter, be prepared to love J.R. Rain’s Samantha Moon, vampire private investigator.”―Eve Paludan, author of Letters from David",
  "genres": [
    "Fantasy",
    "Fairy Tales",
    "Audiobook",
    "Science Fiction"
  ],
  "author": "J.R. Rain",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/10726012-aladdin-relighted"
}