{
  "title": "Katie: The Real Story",
  "description": "For the past twenty-five years—first as the blithe spirit of the Today show, then as the only woman ever to anchor a network news program solo—Katie Couric has been a familiar visitor in the homes of millions. Yet, despite all her public exposure, no one—until now—has been able to penetrate the secrets behind her closely guarded personal life and her struggles in the cutthroat world of television news. In this probing portrait of America’s news queen, bestselling author Edward Klein rips away the mask that has hidden the many faces of Katie Couric: the strong, independent woman and the needy wife and lover; the grieving widow famed for her kindness to others and the fiercely competitive diva; the consummate television interviewer and the stumbling network anchor.Drawing on scores of interviews with people who have never spoken openly about Couric before, Katie: The Real Story absorbingly chronicles Katie’s rise to the top—from her early days at CNN and local television stations (where she was told she’d never succeed) to her phenomenalfifteen-year run on Today. For the first time, Klein reveals the critical role Katie’s father played in her risky decision to leave Today for the hallowed anchor chair once occupied by Walter Cronkite and Dan Rather.As Klein makes clear, Katie’s road to stardom has been paved with rocky personal relationships: a turbulent marriage to Jay Monahan, who died of colon cancer; testy associations with Today cohosts Bryant Gumbel and Matt Lauer; and several star-crossed love affairs, including one with a man seventeen years her junior. Katie: The Real Story is a candid portrait of a folksy charmer, loving single mother, cunning businesswoman, feminist icon, and notorious diva. Neither a whitewash nor a hatchet job, it’s a truthful, unflinching look at a remarkable woman and the media kingdom she’s sought to rule.From the Hardcover edition.",
  "genres": [
    "Biography",
    "Tv",
    "Nonfiction"
  ],
  "author": "Edward Klein",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/1687098.Katie"
}