{
  "title": "Egalitarianism as a Revolt Against Nature and Other Essays",
  "description": "All evidence points to the superiority of the libertarian ideal—private property, capitalism, international trade, laissez-faire—but something is keeping the world from embracing it. That something is wrong-headed ideology, some philosophical error grown into a massive system of thought, an agenda that if unleashed would mutilate and crush civilization as we know it.Murray Rothbard had a nose for such error. And when he smelled it, he wrote it up, exposed its underside, refuted its logic, and obliterated its intellectual foundation. That's why he was so hated—and so loved. He is so relentless that it makes the reader squirm. But he also teaches and inspires.So it goes through this wonderful book called \"Egalitarianism as a Revolt Against Nature, and Other Essays.\" It might just be the wildest Rothbard romp ever. Fully armed, he slices and dices crazies of all sorts, from those who would level all incomes to those who would free all people's of the world through bombings and nuclear war. This is Rothbard providing the reader a strong does of sanity against the hordes of ideological fanatics who care not a knit for reality or reason.But Rothbard is not one of those thinkers who, like Russell Kirk, conclude that ideology is itself a bad thing. On the contrary, Rothbard believes that ideology is critical for the defense of we must organize our ideas to make sense of the world and to have an agenda for the future.Thus does this book also include outstanding pieces of positive theory, including \"Justice and Property Rights,\" \"War, Peace, and the State,\" and \"Left and The Prospects for Liberty.\" It concludes with his rallying \"Why Be Libertarian?\"With all the political books out there, each with a partisan spin, it's wonderful to read a thinker who doesn't fear exposing the errors of left and right, measuring anyone and everyone against the great benchmark of the idea of liberty.",
  "genres": [
    "Politics",
    "Economics",
    "Philosophy",
    "Nonfiction",
    "History",
    "Essays",
    "Cultural"
  ],
  "author": "Murray N. Rothbard",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/168946.Egalitarianism_as_a_Revolt_Against_Nature_and_Other_Essays"
}