{
  "title": "Celiac Disease: A Hidden Epidemic",
  "description": "Celiac disease is an autoimmune disorder that affects nearly one in every hundred people. Unfortunately, 97 percent remain undiagnosed and untreated. They continue to suffer from gastrointestinal complaints, fatigue, headaches, joint pain, anemia, and itchy skin conditions -- to name just a few of the symptoms. These people consult numerous doctors, who prescribe drugs and diets that may alleviate some symptoms, but rarely work for long.If you are one of these people, the real answer to your medical problems may lie in this book.Celiac disease is a hereditary condition that damages the lining of the small intestine so that it cannot properly absorb the food that you eat. Without essential vitamins, minerals, and nutrition, the entire body begins to suffer. Because of its autoimmune nature it also sets off reactions that reverberate throughout all the organs of the body. This is a disease that you do not outgrow -- it often returns years later with more significant symptoms.The true medical impact of celiac disease is just beginning to emerge. This is the first authoritative guide on how the condition is properly diagnosed, treated, and managed. It examines the latest research into its many manifestations, with chapters devoted to each complication and to related diseases. These include infertility, other autoimmune conditions (for example, type 1 diabetes and thyroid disease), peripheral neuropathy, liver disease, and even cancer. It also devotes an entire section to coping with the psychological aspects of a chronic illness and the gluten-free diet.This \"inside-out\" examination and explanation of the disease is a must-read for both patients and the medical community.",
  "genres": [
    "Nonfiction",
    "Health",
    "Science",
    "Nutrition",
    "Reference",
    "Self Help",
    "Medicine"
  ],
  "author": "Peter H.R. Green",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/169245.Celiac_Disease"
}