{
  "title": "Der Weg nach Camelot",
  "description": "Der Schweinehüter Gwyn will Ritter werden -- und das aus gutem Grund. Soeben sind die Sachsen über den Hof seines Vaters in Britannien hergefallen und haben nicht nur den gesamten Hausstand verwüstet, sondern auch noch alle Schweine mitgenommen. Und ein Schweinehüter ohne Schweine ist im Grunde nur ein weiterer (überflüssiger) Esser mehr am Tisch. Außerdem wird eh Gwyns älterer Bruder den Hof erben. Und mit dem ist nicht gut Kirschen essen. Also macht sich Gwyn auf den Weg, in der Tasche nichts als etwas Proviant und eine Silbermünze seiner Schwester Muriel. Und ein geheimnisvolles Medaillon natürlich, dass der Junge einst von seiner Mutter geschenkt bekam und das ein Einhorn zeigt: sein größter Schatz. Unterwegs trifft Gwen auf den alternden Ritter Humbert, der ihm von der sagenhaften Tafelrunde König Arturs berichtet. Er weist ihm den Weg nach Camelot -- und damit einen Weg voller Abenteuer und Gefahren. Denn Mordred, der grüne Drache und Sohn des Königs, ist zu neuem Leben erwacht und zieht mit seinen Mannen mordend und brandschatzend durch die Lande. Gwyn trifft auf Merlin, den Zauberer, und erfährt die wahre Bedeutung seines Medaillons. Nach einer Prophezeiung nämlich soll ein Mann mit dem Einhorn namens Gwyndion einst über Wohl und Wehe Britanniens entscheiden ... Gwyndion. Der Weg nach Camelot des 41-jährigen Drehbuchautors und Jugendbuch-Schriftstellers Peter Schwindt (Justin Time) ist der Anfangsroman einer Buchreihe um den Titelhelden, auf deren Fortsetzung man sich schon freuen darf. Denn Schwindt jongliert geschickt mit den bekannten Versatzstücken und weiß Leser ab elf Jahren gekonnt zu fesseln. Unterhaltungsliteratur im besten Sinn. --Stefan Kellerer",
  "genres": [
    "Fantasy",
    "Historical Fiction",
    "Historical",
    "Childrens",
    "German Literature",
    "Fiction"
  ],
  "author": "Peter Schwindt",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/1692855.Der_Weg_nach_Camelot"
}