{
  "title": "Universal Natural History and Theory of the Heavens",
  "description": "Allgemeine Naturgeschichte & Theorie des Himmels oder Versuch von der Verfassung & dem mechanischen Ursprunge des ganzen Weltgebäudes, nach Newtonischen Grundsätzen abgehandelt (Königsberg/Leipzig: Johann Friederich Petersen 1755) 200pp. [Ak.1:217-368] Published anonymously. “Universal Natural History & Theory of the Heavens or Essay on the Constitution & Mechanical Origin of the Entire Universe, treated in accordance with Newtonian Principles.” Trans. by Wm Hastie (Glasgow: J. Maclehose, 1900). Revised/edited by Willey Ley (NY: Greenwood Publ. Co, '68). Trans. by Stanley L. Jaki (Edinburgh: Scottish Academic Press, '81). Soon after printing, the publisher went bankrupt, his inventory seized. Consequently this work—dedicated to the King & carrying with it hope for some literary fame—scarcely enjoyed a public viewing in Kant’s day & was little known outside Königsberg. Goldbeck [1781, 248] notes “this work is one of his 1st writings & only lately become recognized.” Later scholars arrived at similar conclusions independently of Kant—Johann Lambert in 1761 & Pierre-Simon Laplace in 1796. This certainly would've troubled young Kant, who near the end of his 1763 Only Possible Argument tried to correct the public record with the following footnote: “The title of the book is Allgemeine Naturgeschichte...This work, which has remained little known, cannot have come to the attention of, among others, the celebrated J.H. Lambert. Six years later, in his Kosmologische Briefe 1761, he presented precisely the same theory of the systematic constitution of the cosmos in general, the Milky Way, the nebulae & so forth, which is to be found in my above-mentioned theory of the heavens, the 1st part & likewise in the preface to that book...The agreement between the thoughts of this ingenious man & those presented by myself at that time almost extends to the finer details of the theory, & it only serves to strengthen my supposition that this sketch will receive additional confirmation in the course of time” [Ak. 2:69; Walford trans.] In later years, Kant tried unsuccessfully to interest publishers in reissuing the book. Eventually his younger colleague & friend, J.F. Gensichen, published a selection alongside a translation into German of three essays by Wm Herschel: Über den Bau des Himmels (Königsberg: Nicolovius, 1791). See Vorländer ('24, i.104, ii.86). Using Newton's mathematical principles & laws of motion & taking up an idea of Emanuel Swedenborg, Kant produced a detailed account of what has come to be known as the Nebular Hypothesis, still the most plausible explanation for the formation of the solar system: the structure of the cosmos develops from widely dispersed materials scattered thru space which, influenced by forces of attraction & repulsion, rotate, flatten & over time produce stars & planets. His account also considers Saturn's rings, the formation of moons, planetary axial rotation, cometary development etc. He lets imagination run rampant speculating about what extraterrestrial creatures may be like. The extent to which he fully understood the mathematical complexities involved in his explanation is challenged, but his account is an important document in the most important trend of 18th century natural science, that is, placing scientific accounts of phenomena on a historical basis & seeing them as the result of a process of development maintained by mechanical forces. His work also defends the design argument (that harmonies in the design of the solar system are physical evidence for god's existence), a claim which his later work would undermine.",
  "genres": [
    "Philosophy",
    "Science",
    "Physics",
    "Nonfiction"
  ],
  "author": "Immanuel Kant",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/1693214.Universal_Natural_History_and_Theory_of_the_Heavens"
}