{
  "title": "Song & Dance Man: The Art of Bob Dylan - Vol. 1 Language & Tradition",
  "description": "\"SONG & DANCE The Art of Bob Dylan\" is unique in its scope, integrating biographical, literary and musical contexts into a powerful scrutiny of Dylan as songwriter and performer. This is Volume 1 of the new series celebrating 50 Years since the First Edition's release.Volume 1 - 'Language and Tradition' contains the foundational and timeless analysis that made this title a classic - looking at how Dylan's writing and performance were influenced by folk music, rock music, and literature. It deeply inspects and discusses Dylan's use of language, both his early bursts of complexity and his later move towards simplicity. Included is a special review of the song 'Lay Down Your Weary Tune' which Gray finds particularly effective and impressive, and an over 100-page chapter detailed Dylan's fascination with and use of the pre-war blues.The work in these three volumes has been called “Monumental, endlessly illuminating.” (Rolling Stone) “Probably the greatest book about the work of a single popular musician ever to have been published.” (London Review Bookshop) and \"The definitive critical work.\" (Evening Standard). The 50th Anniversary Series makes this classic book obtainable again after over a decade out-of-print. It contains no new material but rather turns the contents of the 3rd edition into three new volumes.Author Michael Gray is recognized as a world authority on the work and career of Bob Dylan; he was the first to consider Dylan’s writing as worthy of treatment as serious art. As author K G Miles “People forget that the road to the Nobel Prize was very long, took many years, and began with that book; it began with Michael Gray.”The 50th Anniversary Series also includes Volumes 1 and 3: Generations of listeners have turned to Song & Dance Man to more deeply understand and appreciate Dylan’s work and unique creativity. Now you can too.",
  "genres": [],
  "author": "Michael Gray",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/169372487-song-dance-man"
}