{
  "title": "Berta's Choice",
  "description": "A 37,000 Word Novella of the Soul-Linked Saga:When she was just twenty years old, Berta Simms had her life stolen from her. Kidnapped, stashed away in a lonely desert prison without even her reptilian captors for company, and forced because of her unique genetic heritage to bear a grotesque alien child, she is now in her eighties and bears deep and seemingly indelible scars on her body and on her heart. Then, miraculously, Berta is rescued from her desolate exile and brought to the idyllic planet of Jasan. There, she begins to find healing and a productive purpose to occupy her few remaining years, and is content, but not happy.Suddenly, Berta’s life is turned upside down once again when she discovers that, despite her advanced age, she is the Arima, destined soul mate, of the Falcoran brothers, a set of strikingly handsome and oh, so very sexy, triplets who shape-shift into enormous birds of prey. Joining with the Falcorans brings the promise of fulfilling her scarcely acknowledged dreams of love, restored youth, and incandescent passion, but also seems to embody her deepest fears of intimacy, being under the control of males, and having to face her long denied sexuality. Which will she pick? What will be Berta’s Choice?Berta’s Choice is a 37,000 word novella from Laura Jo Phillips, the Amazon best-selling author of the “Soul-Linked Saga” which now extends to five full-length novels, and the “Orbs of Rathira” Trilogy, the first volume of which is now in print. While a continuation of the “Soul-Linked” story for its many thousands of fans, Berta’s Choice is also enjoyable as a stand-alone story for those who are new to Ms. Phillips’ work. Even presented in this shorter form, Berta’s Choice fully manifests the imagination, creativity, emotional insight, and soul-fired passion that has marked her earlier works. It is a treat for established fans and a delightful entre for new readers.",
  "genres": [
    "Romance",
    "Shapeshifters",
    "Aliens",
    "Science Fiction",
    "Paranormal",
    "Reverse Harem",
    "Fantasy"
  ],
  "author": "Laura Jo Phillips",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/16945996-berta-s-choice"
}