{
  "title": "Finding Betty Crocker: The Secret Life of America's First Lady of Food",
  "description": "IN 1945, FORTUNE MAGAZINE named Betty Crocker the second most popular American woman, right behind Eleanor Roosevelt, and dubbed Betty America's First Lady of Food. Not bad for a gal who never actually existed.\"Born\" in 1921 in Minneapolis, Minnesota, to proud corporate parents, Betty Crocker has grown, over eight decades, into one of the most successful branding campaigns the world has ever known. Now, at long last, she has her own biography. Finding Betty Crocker draws on six years of research plus an unprecedented look into the General Mills archives to reveal how a fictitious spokesperson was enthusiastically welcomed into kitchens and shopping carts across the nation.The Washburn Crosby Company (one of the forerunners to General Mills) chose the cheery all-American \"Betty\" as a first name and paired it with Crocker, after William Crocker, a well-loved company director. Betty was to be the newest member of the Home Service Department, where she would be a \"friend\" to consumers in search of advice on baking -- and, in an unexpected twist, their personal lives.Soon Betty Crocker had her own national radio show, which, during the Great Depression and World War II, broadcast money-saving recipes, rationing tips, and messages of hope. Over 700,000 women joined Betty's wartime Home Legion program, while more than one million women -- and men -- registered for the Betty Crocker Cooking School of the Air during its twenty-seven-year run.At the height of Betty Crocker's popularity in the 1940s, she received as many as four to five thousand letters daily, care of General Mills. When her first full-scale cookbook, Betty Crocker's Picture Cook Book, or \"Big Red,\" as it is affectionately known, was released in 1950, first-year sales rivaled those of the Bible. Today, over two hundred products bear her name, along with thousands of recipe booklets and cookbooks, an interactive website, and a newspaper column.What is it about Betty? In answering the question of why everyone was buying what she was selling, author Susan Marks offers an entertaining, charming, and utterly unique look -- through words and images -- at an American icon situated between profound symbolism and classic kitchen kitsch.",
  "genres": [
    "Nonfiction",
    "Food",
    "History",
    "Biography",
    "Cooking",
    "Food History",
    "Microhistory"
  ],
  "author": "Susan Marks",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/1694848.Finding_Betty_Crocker"
}