{
  "title": "Victoria's Daughters",
  "description": "The story of five women who shared one of the most extraordinary and privileged sisterhoods of all time.Vicky, Alice, Helena, and Beatrice were historically unique sisters, born to a sovereign who ruled over a quarter of the earth's people and who gave her name to an Queen Victoria. Two of these princesses would themselves produce children of immense consequence. All five would curiously come to share many of the social restrictions and familial machinations borne by nineteenth-century women of less-exulted class.Victoria and Albert's precocious firstborn child, Vicky, wed a Prussian prince in a political match her high-minded father hoped would bring about a more liberal Anglo-German order. That vision met with disaster when Vicky's son Wilhelm-- to be known as Kaiser Wilhelm-- turned against both England and his mother, keeping her out of the public eye for the rest of her life. Gentle, quiet Alice had a happier marriage, one that produced Alexandra, later to become Tsarina of Russia, and yet another Victoria, whose union with a Battenberg prince was to found the present Mountbatten clan. However, she suffered from melancholia and died at age thirty-five of what appears to have been a deliberate, grief-fueled exposure to the diphtheria germs that had carried away her youngest daughter. Middle child Helena struggled against obesity and drug addition but was to have lasting effect as Albert's literary executor. By contrast, her glittering and at times scandalous sister Louise, the most beautiful of the five siblings, escaped the claustrophobic stodginess of the European royal courts by marrying a handsome Scottish commoner, who became governor general of Canada, and eventually settled into artistic salon life as a respected sculptor. And as the baby of the royal brood of nine, rebelling only briefly to forge a short-lived marriage, Beatrice lived under the thumb of her mother as a kind of personal secretary until the queen's death.Principally researched at the houses and palaces of its five subjects in London, Scotland, Berlin, Darmstadt, and Ottawa-- and entertainingly written by an experienced biographer whose last book concerned Victoria's final days-- Victoria's Daughters closely examines a generation of royal women who were dominated by their mother, married off as much for political advantage as for love, and finally passed over entirely with the accession of their n0 brother Bertie to the throne. Packard provides valuable insights into their complex, oft-tragic lives as daughters of their time.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "British Literature",
    "European History",
    "Historical",
    "Victorian"
  ],
  "author": "Jerrold M. Packard",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/1695841.Victoria_s_Daughters"
}