{
  "title": "Children at Play: An American History",
  "description": "A chronological history of children's playtime over the last 200 yearsIf you believe the experts, “child’s play”; is serious business. From sociologists to psychologists and from anthropologists to social critics, writers have produced mountains of books about the meaning and importance of play. But what do we know about how children actually play, especially American children of the last two centuries? In this fascinating and enlightening book, Howard Chudacoff presents a history of children’s play in the United States and ponders what it tells us about ourselves.Through expert investigation in primary sources-including dozens of children's diaries, hundreds of autobiographical recollections of adults, and a wealth of child―rearing manuals―along with wide―ranging reading of the work of educators, journalists, market researchers, and scholars-Chudacoff digs into the “underground” of play. He contrasts the activities that genuinely occupied children's time with what adults thought children should be doing.Filled with intriguing stories and revelatory insights, Children at Play provides a chronological history of play in the U.S. from the point of view of children themselves. Focusing on youngsters between the ages of about six and twelve, this is history “from the bottom up.” It highlights the transformations of play that have occurred over the last 200 years, paying attention not only to the activities of the cultural elite but to those of working-class men and women, to slaves, and to Native Americans. In addition, the author considers the findings, observations, and theories of numerous social scientists along with those of fellow historians.Chudacoff concludes that children's ability to play independently has attenuated over time and that in our modern era this diminution has frequently had unfortunate consequences. By examining the activities of young people whom marketers today call “tweens,” he provides fresh historical depth to current discussions about topics like childhood obesity, delinquency, learning disability, and the many ways that children spend their time when adults aren’t looking.",
  "genres": [
    "Parenting",
    "History",
    "Nonfiction",
    "Reference",
    "Education",
    "American History"
  ],
  "author": "Howard P. Chudacoff",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/1696225.Children_at_Play"
}