{
  "title": "Bill of Wrongs: The Executive Branch's Assault on America's Fundamental Rights",
  "description": "Throughout her long career of “afflicting the comfortable and comforting the afflicted,” the cause closest to Molly Ivins’s heart was working to protect the freedoms we all value. Sadly, today we’re living in a time when dissent is equated with giving aid to terrorists, when any of us can be held in prison without even knowing the charges against us, and when our constitutional rights are being interpreted by a president who calls himself “The Decider.” Ivins got the idea for Bill of Wrongs while touring America to honor her promise to speak out, gratis, at least once a month in defense of free speech. In her travels Ivins met ordinary people going to extraordinary measures to safeguard our most precious liberties, and when she first started writing this book, she intended it to be a joyous celebration of those heroes. But during the Bush years, the project’s focus changed. Ivins became concerned about threats to our cherished freedoms–among them the Patriot Act and the weakening of habeas corpus–and she observed with anger how dissent in the defense of liberties was being characterized as treason by the Bush administration and its enablers.From illegal wiretaps, the unlawful imprisonment of American citizens, and the undermining of freedom of the press to the creeping influence of religious extremism on our national agenda and the erosion of the checks and balances that prevent a president from seizing unitary powers, Ivins and her longtime collaborator, Lou Dubose, co-author of Shrub and Bushwacked, describe the attack on America’s vital constitutional guarantees. With devastating humor and keen eyes for deceit and hypocrisy, they show how severe these incursions have become, and they ask us all to take an active role in protecting the Bill of Rights.In life and on the printed page, Molly Ivins was too cool to offer a posthumous valedictory (or even to take a victory lap for her many triumphs over inane, vainglorious, and addlepated politicos). But in Bill of Wrongs, her final and perhaps greatest book, the irrepressible Molly Ivins really does have the last word.From the Hardcover edition.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Government",
    "Humor",
    "Law",
    "Essays"
  ],
  "author": "Molly Ivins",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/169715.Bill_of_Wrongs"
}