{
  "title": "Modern Classics of Fantasy",
  "description": "This is the kind of assortment that can hook a reader on short fantasy. Thirty-two good stories--some previously anthologized, some hot off the press (\"Beauty and the Opera\" by Suzy McKee Charnas appeared in July 1996), and a few once considered classic, but now nearly forgotten (Thomas Burnett Swann is rapidly falling out of sight)--offer entertainment for every taste. Many of the stories (\"The Overworld\" by Jack Vance, and \"The Changeling\" by Michael Swanwick) also offer continuation elsewhere as part of a longer work.Gardner Dozois's emphasis is on magazine fiction. As such, it's an interesting view of the evolution and increasing sophistication of the \"pulps\"--and their readers. For this reason this would be an excellent text for a course on modern fantasy writing. Stories from Asimov Science Fiction Magazine, which Dozois edits, are prominent among the recent pieces. Providing a brief history of 20th-century fantasy, the introduction seems written with the new reader in mind.ContentsWalk Like a Mountain • [John the Balladeer] • (1955) • shortstory by Manly Wade WellmanScylla's Daughter • [Fafhrd and the Gray Mouser] • (1961) • novella by Fritz LeiberPaper Dragons • (1985) • novelette by James P. BlaylockThe Golem • (1955) • shortstory by Avram DavidsonFlowers of Edo • (1987) • novelette by Bruce SterlingBears Discover Fire • (1990) • shortstory by Terry BissonThe Changeling's Tale • (1994) • shortstory by Michael SwanwickMissolonghi 1824 • (1990) • shortstory by John CrowleyBlunderbore • (1990) • shortstory by Esther M. FriesnerInto Gold • (1986) • novelette by Tanith LeeSpace-Time for Springers • [Gummitch the Cat] • (1958) • shortstory by Fritz LeiberBeauty and the Opéra or the Phantom Beast • (1996) • novelette by Suzy McKee CharnasThe Man Who Painted the Dragon Griaule • [Griaule] • (1984) • novelette by Lucius ShepardA Cabin on the Coast • (1984) • shortstory by Gene WolfeThe Sleep of Trees • (1980) • shortstory by Jane YolenTrouble with Water • (1939) • shortstory by H. L. GoldThe Gnarly Man • (1939) • novelette by L. Sprague de CampDeath and the Executioner • [Lord of Light] • (1967) • novelette by Roger ZelaznyThe Manor of Roses • [John & Stephen] • (1966) • novella by Thomas Burnett SwannThe Overworld • [Dying Earth] • (1965) • novelette by Jack VanceExtempore • (1956) • shortstory by Damon KnightGod's Hooks! • (1982) • shortstory by Howard WaldropBuffalo Gals, Won't You Come Out Tonight • (1987) • novelette by Ursula K. Le GuinThe Tale of Hauk • (1977) • novelette by Poul AndersonA Gift of the People • (1988) • shortstory by Robert SampsonConfiguration of the North Shore • (1969) • shortstory by R. A. LaffertyTwo Sadnesses • (1973) • shortstory by George Alec EffingerManatee Gal, Won't You Come Out Tonight • [Jack Limekiller] • (1977) • novelette by Avram Davidson (aka Manatee Gal Ain't You Coming Out Tonight)The Signaller • [Pavane] • (1966) • novelette by Keith RobertsThe Troll • (1935) • shortstory by T. H. WhiteDeath and the Lady • (1992) • novelette by Judith TarrProfessor Gottesman and the Indian Rhinoceros • (1995) • novelette by Peter S. BeaglePreface (Modern Classics of Fantasy) • (1997) • essay by Gardner DozoisRecommended Reading (Modern Classics of Fantasy) • essay by Gardner Dozois",
  "genres": [
    "Fantasy",
    "Short Stories",
    "Anthologies",
    "Fiction",
    "Science Fiction Fantasy",
    "Science Fiction"
  ],
  "author": "Gardner Dozois",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/1697259.Modern_Classics_of_Fantasy"
}