{
  "title": "And the Dead Shall Rise: The Murder of Mary Phagan and the Lynching of Leo Frank",
  "description": "On April 27, 1913, the bludgeoned body of thirteen-year-old Mary Phagan was discovered in the basement of Atlanta’s National Pencil Factory. The girl’s murder would be the catalyst for an epic saga that to this day holds a singular place in America’s collective imagination—a saga that would climax in 1915 with the lynching of Leo Frank, the Cornell-educated Jew who was convicted of the murder. The case has been the subject of novels, plays, movies and even musicals, but only now, with the publication of And the Dead Shall Rise, do we have an account that does full justice to the mesmerizing and previously unknown details of one of the most shameful moments in the nation’s history.In a narrative reminiscent of a nineteenth-century novel, Steve Oney recounts the emerging revelations of the initial criminal investigation, reconstructs from newspaper dispatches (the original trial transcript mysteriously disappeared long ago) the day-to-day intrigue of the courtroom and illuminates how and why an all-white jury convicted Frank largely on the testimony of a black man. Oney chronicles as well the innumerable avenues that the defense pursued in quest of an appeal, the remarkable and heretofore largely ignored campaign conducted by William Randolph Hearst and New York Times publisher Adolph Ochs to exonerate Frank, the last-minute commutation of Frank’s death sentence and, most indelibly, the flawlessly executed abduction and brutal lynching of Frank two months after his death sentence was commuted.And the Dead Shall Rise brings to life a Dickensian cast of characters caught up in the Frank case—zealous police investigators intent on protecting their department’s reputation, even more zealous private detectives, cynical yet impressionable factory girls, intrepid reporters (including a young Harold Ross), lawyers blinded by their own interests and cowed by the populace’s furor. And we meet four astonishing individuals: Jim Conley, who was Frank’s confessed “accomplice” and the state’s star witness; William Smith, a determined and idealistic lawyer who brilliantly prepared Conley for the defense’s fierce cross-examination and then, a year later, underwent an extraordinary change of heart; Lucille Frank, the martyred wife of the convicted man; and the great populist leader Tom Watson, who manipulated the volatile and lethal outrage of Georgians against the forces of Northern privilege and capital that were seeking to free Frank.And the Dead Shall Rise also casts long-awaited fresh light on Frank’s lynching. No participant was ever indicted, and many went on to prominent careers in state and national politics. Here, for the first time, is the full account of the event—including the identities of the influential Georgians who conceived, carried out and covered up the crime. And here as well is the story of the lynching’s aftermath, which saw both the revival of the Ku Klux Klan and the evolution of the Anti-Defamation League.At once a work of masterful investigative journalism and insightful social history, And the Dead Shall Rise does complete justice to one of history’s most repellent and most fascinating moments.",
  "genres": [
    "True Crime",
    "History",
    "Nonfiction",
    "Crime",
    "American History",
    "Law",
    "Biography"
  ],
  "author": "Steve Oney",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/1697440.And_the_Dead_Shall_Rise"
}