{
  "title": "The High-Conflict Couple: A Dialectical Behavior Therapy Guide to Finding Peace, Intimacy, and Validation",
  "description": "You hear and read a lot about ways to improve your relationship. But if you've tried these without much success, you're not alone. Many highly reactive couples—pairs that are quick to argue, anger, and blame—need more than just the run-of-the-mill relationship advice to solve their problems in love. When destructive emotions are at the heart of problems in your relationship, no amount of effective communication or intimacy building will fix what ails it. If you're part of a \"high-conflict\" couple, you need to get control of your emotions first, to stop making things worse, and only then work on building a better relationship. The High-Conflict Couple adapts the powerful techniques of dialectical behavior therapy (DBT) into skills you can use to tame out-of-control emotions that flare up in your relationship. Using mindfulness and distress tolerance techniques, you'll learn how to deescalate angry situations before they have a chance to explode into destructive fights. Other approaches will help you disclose your fears, longings, and other vulnerabilities to your partner and validate his or her experiences in return. You'll discover ways to manage problems with negotiation, not conflict, and to find true acceptance and closeness with the person you love the most. This book has been awarded The Association for Behavioral and Cognitive Therapies Self-Help Seal of Merit — an award bestowed on outstanding self-help books that are consistent with cognitive behavioral therapy (CBT) principles and that incorporate scientifically tested strategies for overcoming mental health difficulties. Used alone or in conjunction with therapy, our books offer powerful tools readers can use to jump-start changes in their lives.",
  "genres": [
    "Psychology",
    "Relationships",
    "Nonfiction",
    "Self Help",
    "Mental Health",
    "Marriage",
    "Counselling"
  ],
  "author": "Alan E. Fruzzetti",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/169861.The_High_Conflict_Couple"
}