{
  "title": "Marvels",
  "description": "\"Marvels is a giant leap forward in the evolution of illustrated literature.\"—Stan LeeWithin the Marvel Universe, heroes such as Spider-Man swing from rooftop to rooftop, while the Avengers soar high in the skies. These figures, blessed with fantastic superhuman abilities, stand ready to battle the villains who threaten their world. Yet living in the shadow of these extraordinary icons are ordinary men and women, who view the \"Marvels\" with a mixture of fear, disbelief, envy and admiration. Among them is Phil Sheldon, a New York City photojournalist who has dedicated his career to covering the exploits of the Marvels and their effect on humankind.A richly painted historical overview of the entire Marvel Universe, Marvels spans from the first appearance of the Human Torch in 1939 to the fearsome coming of the world-devouring Galactus, culminating in the shocking death of Gwen Stacy, Spider-Man's first love. While these stories may be familiar to Marvel fans, never before have they been told in this manner — not from the hero's perspective, but through the eyes of the ordinary man named Phil Sheldon.In 1993, Kurt Busiek and Alex Ross's realistic portrayal of the Marvel Universe in Marvels quickly became one of the biggest comic-book hits of the decade. Garnering overwhelming praise from critics, fans and fellow professionals, the series won the industry's highest honors with three Eisner Awards in 1994. In this landmark 10th Anniversary Edition, Marvels is presented in a lavish new hardcover format, collecting all four issues of the series — plus the Human Torch short story from Marvels #0, production notes, Ross's sketchbook, behind-the-scenes stories of the making of Marvels, and Ross and Busiek's original proposals, tracing the development of the series.",
  "genres": [
    "Comics",
    "Graphic Novels",
    "Marvel",
    "Fiction",
    "Superheroes",
    "Comic Book",
    "Graphic Novels Comics"
  ],
  "author": "Kurt Busiek",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/16986.Marvels"
}