{
  "title": "It Takes a Family: Conservatism and the Common Good",
  "description": "Among politicians of national stature today, there is perhaps none more respected as a principled conservative than Rick Santorum. In It Takes a Conservatism and the Common Good, Santorum articulates the humane vision that he believes must inform public policy if it is to be effective and just. An appreciation for the civic bonds that unite a community lies at the heart of genuine conservatism. Moreover, Santorum demonstrates how such an approach to political, social, and economic problems offers the most promise for those on the margin of the poor, the vulnerable, and minorities who have often been excluded from opportunity in America. Santorum argues that conservative statesmanship is animated by a sense of stewardship for an inheritance. But what do we inherit as Americans? And how can we be good stewards of that inheritance? Building on Robert PutnamÆs discussion of \\u201csocial capital,\\u201d the habits of association and trust that are the preconditions of any decent society, Santorum assesses how well, in the past generation, Americans have cared for the \\u201cfabric\\u201d of society. He explores in detail various dimensions of social and cultural connection that are the foundation of the common good. And he presents innovative policy proposals for the renewal of American society at all levels. Throughout his book, Santorum emphasizes the central role of the family—in contradistinction to the metaphorical \\u201cvillage\\u201d of the federal government, as promoted by Hillary Clinton—in achieving the common good. With a sustained argument touching on first principles throughout, this ambitious and original book is a major contribution to contemporary political debate. It Takes a Family further establishes Santorum as the leader of reform-minded civic conservatives in America.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Family"
  ],
  "author": "Rick Santorum",
  "average_rating": "3.41",
  "url": "https://www.goodreads.com/book/show/1699775.It_Takes_a_Family"
}