{
  "title": "In the Shadow of No Towers",
  "description": "Catastrophic, world-altering events like the September 11 attacks on the United States place the millions of us who experience them on the \"fault line where world history and personal history collide.\" Most of us, however, cannot document that intersection with the force, compression, and poignancy expressed in Art Spiegelman's In the Shadow of No Towers. As in his Pulitzer Prize-winning Maus, cartoonist Spiegelman presents a highly personalized, political, and confessional diary of his experience of September 11 and its aftermath. In 10 large-scale pages of original, hard-hitting material (composed from September 11, 2001 to August 31, 2003), two essays, and 10 old comic strip reproductions from the early 20th century, Spiegelman expresses his feelings of dislocation, grief, anxiety, and outrage over the horror of the attacks—and the subsequent \"hijacking\" of the event by the Bush administration to serve what he believes is a misguided and immoral political agenda. Readers who agree with Spiegelman's point of view will marvel at the brilliance of his images and the wit and accuracy of his commentary. Others, no doubt, will be jolted by his candor and, perhaps, be challenged to reexamine their position.The central image in the sequence of original broadsides, which returns as a leitmotif in each strip, is Spiegelman's Impressionistic \"vision of disintegration,\" of the North Tower, its \"glowing bones...just before it vaporized.\" (As downtown New Yorkers, Spiegelman and his family experienced the event firsthand.) But the images and styles in the book are as fragmentary and ever-shifting as Spiegelman's reflections and reactions. The author's closing comment that \"The towers have come to loom far larger than life...but they seem to get smaller every day\" reflects a larger and more chilling irony that permeates In the Shadow of No Towers. Despite the ephemeral nature of the comic strip form, the old comics at the back of the book have outlasted the seemingly indestructible towers. In the same way, Spiegelman's heartfelt impressions have immortalized the towers that, imponderably, have now vanished. —Silvana Tropea",
  "genres": [
    "Graphic Novels",
    "Comics",
    "Nonfiction",
    "History",
    "Graphic Novels Comics",
    "Memoir",
    "Politics"
  ],
  "author": "Art Spiegelman",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/17001.In_the_Shadow_of_No_Towers"
}