{
  "title": "The Diamond",
  "description": "\"The Diamond\" is a brilliant, dazzling historical novel about a famous diamond -- one of the biggest in the world -- that passed from the hands of William Pitt's grandfather to the French kings and Napoleon, linking many of the most famous personalities of the eighteenth and nineteenth centuries, and serving as the centerpiece for a novel in every way as fascinating as Susan Sontag's \"The Volcano Lover\" or Umberto Eco's \"The Name of the Rose.\"Rich with historical detail, characters, and nonstop drama, the story centers on the famous Regent diamond -- once the largest and most beautiful diamond in the world -- which was discovered in India in the late seventeenth century and bought by the governor of the East India Company, a cunning nabob, trader, and ex-pirate named Thomas Pitt. His son brought it to London, where a Jewish diamond-cutter of genius took two years to fashion it into one of the world's greatest gems.After hawking it around the courts of Europe, Pitt sold the diamond to Louis XIV's profligate and deeply amoral nephew, the Duc d'Orleans. Raised to glory by this fortune, Pitt's grandsons would rule England and devote their lives to fighting the very Bourbon kings who wore their diamond, the enduring symbol of the rivalry between France and England.The diamond was worn by Louis XIV, Louis XV, and by Louis XVI and Marie Antoinette. A beautiful blond whore placed it in her private parts to entice Czar Peter the Great on his visit to Paris. A band of thieves stole it during the bloodiest days of the Revolution. Found in an attic, it was pawned for horses for Napoleon's first campaigns. Napoleon redeemed the diamond and, though his wife Josephine craved it, set it in the hilt of his sword, where it appeared in many of his portraits. After his fall, his young second wife, Marie-Louise, grabbed it when she fled France. The Regent was hidden in innumerable secret places, used by Napoleon III and the ravishing Empress Eugenie to impress Queen Victoria, and finally ended up on display in the Louvre museum, where it remains today, then and now the first diamond of France.Julie Baumgold, herself the descendant of a family of diamond merchants, tells this extraordinary story through Count Las Cases (author of \"Le Memorial de Sainte-Helene), \" who writes it in his spare time while in exile with Napoleon I. The book is in Las Cases's words, those of a clever, sophisticated nobleman at home in the old regime as well as in Napoleon's court. As he tells his story, with Napoleon prodding, challenging, and correcting him all the while, they draw closer. The emperor has a kind of love/hate relationship with the diamond, which represents the wealth and fabulous elegance of the French courts as well as the power for good or evil that possessing it confers on its transient masters. He thinks of it as his good luck charm, but is it? For the diamond has its dark side -- murder, melancholy, and downfall ever shadow its light.A glittering cast of characters parades through \"The Diamond: \" a mesmerizing Napoleon and the devoted Las Cases, stuck on Saint Helena with their memories; Louis XIV and his brother, the dissolute Monsieur; Madame, the German princess who married Monsieur; the Scottish financier John Law and Saint-Simon, who sold Pitt's diamond to Madame's depraved son; the depressed Louis XV; and Madame de Pompadour. Here too are the families, the Pitts in England and the Bonapartes in France; the men of Saint Helena; nobles and thieves; Indian diamond merchants and financiers -- nearly everyone of interest and importance from the late seventeenth through the early nineteenth century.Written with enormous verve and ambition, \"The Diamond\" is a treat, a plum pudding of a novel filled with one delicious, funny, disgraceful episode after another. It is grand history and even grander fiction -- a towering work of imagination, research, and narrative skill.",
  "genres": [
    "Historical Fiction",
    "France",
    "Fiction",
    "French Revolution",
    "Audiobook"
  ],
  "author": "Julie Baumgold",
  "average_rating": "3.32",
  "url": "https://www.goodreads.com/book/show/1700797.The_Diamond"
}