{
  "title": "Zapped",
  "description": "It's a hot, humid July night in New York City. Where were you when the lights went out?A New York City resident for many years, Carol Higgins Clark was there during the blackout of 2003. Not surprisingly, she felt that Regan and Jack Reilly should one day share the experience!As \"Zapped\" begins, the Reillys return home from a summer weekend to the loft in Tribeca they are in the agonizing process of renovating and expanding. They are looking forward to a quiet supper on their newly acquired rooftop terrace. But it's not meant to be. While Jack goes to pick up Chinese food, Regan enters their apartment, unaware that a nervous thief, who preceded her by minutes, is hiding in the front closet. A thief who knows about a hidden safe that Regan and Jack have yet to discover. Minutes later, the blackout strikes, and both Reillys are called into action.A new gallery in SoHo, featuring treasured glass sculptures from all over the world, has been burglarized. As head of the NYPD Major Case Squad, Jack oversees several departments. Art theft is one of them.PI Regan hears from her best friend, Kit, who is in Manhattan on business. She's been abandoned at a comedy club by a colleague from an insurance convention, Georgina Mathieson, who ran out for a cigarette moments before the blackout struck and never came back. Kit gets a call that Georgina is disturbed and dangerous. Fueled by her rage at a college boyfriend who dumped her, Georgina seeks revenge on unsuspecting young blond men. She was last seen getting into a cab outside the club -- with a tall blond. Regan heads the search for Georgina and her potential victim.Meanwhile, Lorraine Lily, an almost famous actress, returns to New York City the night of the blackout, after spending three months in England doing a play, and is informed by her estranged husband, Conrad Spreckles, that he'd sold his loft to their next-door neighbors, the Reillys. Lorraine had never told him about the hidden safe she'd had installed in the closet. If she doesn't get back what's in there, she's sure her budding career will be ruined.In \"Zapped,\" Clark takes readers on a tour of the city they won't forget and introduces them to a wonderful cast of colorful, eccentric characters whose stories intersect in precarious and often humorous ways during one very dark and hot summer night.",
  "genres": [
    "Mystery",
    "Fiction",
    "Mystery Thriller",
    "Suspense",
    "Cozy Mystery",
    "Thriller",
    "New York"
  ],
  "author": "Carol Higgins Clark",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/1701177.Zapped"
}