{
  "title": "The Dwelling",
  "description": "The house had history. Perhaps \"too\" much history.362 Belisle Street is a homeowner's dream. A nice neighborhood, close to schools, new hardwood floors, unique original detail. So why then, wonders real estate agent Glenn Darnley, won't this charming property stay off the market? Perhaps the clawed feet of the antique bathtub look a little too threatening. Or maybe it's the faint hospital-like smell of the room off the top of the stairs. It's possible that the haunting music that pours out from under the steps keeps the residents awake at night.In the three parts of Susie Moloney's hair-raising novel \"The Dwelling,\" ownership of 362 Belisle changes four times -- with Glenn Darnley brokering each deal. The first occupants are a young couple, Rebecca and Daniel Mason, who have big dreams of wealth and success. It doesn't take long for them to realize that they're not welcome in their new house. After a ghostly seduction and a violent confrontation, the property is once again for sale. Next comes Barbara Parkins, a divorcee, and her unhappy young son, Petey. Lonely and looking for companionship, the two find comfort in some new, playful young friends. When the Parkins family leaves, the house is sold again. Last, ownership goes to Richie Bramley, a drunken writer and lost soul. But like the others, he can't settle down in this house -- which has a mind, and a heart, of its own.For Glenn, however, the house is a dream, always warm and welcoming. The floors gleam, and sun pours in through the windows. Owners come -- and 362 Belisle makes sure owners go. It's waiting patiently for its beloved to realize how much it loves her. It's waiting for Glenn, the very special person who can finally turn this house into a home.\"The Dwelling\" is clever, scary, and ultimately moving. It's a novel for everyone who ever spent time looking for \"just the right house.\"",
  "genres": [
    "Horror",
    "Fiction",
    "Ghosts",
    "Paranormal",
    "Supernatural",
    "Gothic",
    "Mystery"
  ],
  "author": "Susie Moloney",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/1701296.The_Dwelling"
}