{
  "title": "Courage Under Siege: Starvation, Disease, and Death in the Warsaw Ghetto",
  "description": "The story of the Warsaw ghetto is one of the most tragic episodes in the Second World War. Using a so-called \"threat of typhus\" as their \"scientific\" justification for quarantine, the Nazis crammed almost a half million Jews into a small quarter of the city, depriving them of food, clean water, adequate sanitation, and medical supplies. For three years, from 1940 to 1943, the ghetto inhabitants were packed seven or more to a room, struggling incessantly against starvation, disease, and death. Of the 400,000 Jews in Warsaw before the war, only a few thousand survived. In Courage Under Siege, Charles Roland, a physician and historian, provides the first history of the medical disaster that took place in the Warsaw ghetto, offering a compassionate account of the tragic struggle for life and, in particular, of the heroic efforts of the ghetto's doctors, nurses, and social organizations who provided relief in the face of overwhelming odds. He portrays the nightmarish conditions of the hospitals where operations continued without electricity, gas, running water or sewage systems, where corpses lined the corridors, and where beds contained as many as three patients at a time. He describes the ingenuity and humanity of doctors and hospital workers who continued to provide medical services while they themselves were starving and facing the same destiny as the rest of the ghetto inhabitants. Heart-wrenching, inspirational stories of these dedicated medical workers shine brightly in this otherwise bleak landscape. For instance, Roland describes the creation of a clandestine medical school, \"a beautiful case of passive resistance,\" which gave as many as 500 students a medical education and a semblance of normal living--though only a few survived to continue their training. And Roland also tells of a major scientific study of hunger conducted by ghetto physicians capitalizing on the one thing they had in abundance--starvation. This was research of the purest kind, intended to advance human knowledge, since these doctors had no illusions that the research would help them or their patients survive. Drawing on an impressive array of research materials as well as interviews with surviving medical workers, Roland draws a stunning portrait of how the medical community of the Warsaw ghetto resisted the ravages of disease and starvation inflicted by the Nazis. This volume is a lasting testimony to their courage and to the power of the human spirit in the face of horror and adversity.",
  "genres": [
    "Medicine",
    "Holocaust",
    "World War II"
  ],
  "author": "Charles G. Roland",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/1702231.Courage_Under_Siege"
}