{
  "title": "Brothers in Arms: The Epic Story of the 761st Tank Battalion, WWII's Forgotten Heroes",
  "description": "A powerful wartime saga recounting the extraordinary story of the 761st Tank Battalion, the first all-black armored unit to see combat in World War II. “More than a combat story . . . it’s also the story of how black soldiers had to fight (literally and figuratively) for the right to fight the Germans.”— USA Today   Kareem Abdul-Jabbar first became immersed in the history of the 761st Battalion through family friend Leonard “Smitty” Smith, a veteran of the unit. Working with acclaimed writer Anthony Walton, Abdul-Jabbar interviewed surviving members of the battalion to weave together a page-turning narrative based on their memories, stories, and historical accounts, from basic training through the horrors of the battlefield to their postwar experiences. Trained essentially as a public relations gesture to maintain the support of the black community for the war, the battalion was never intended to see battle. In fact, General Patton originally opposed their deployment, claiming African Americans couldn’t think quickly enough to operate tanks in combatconditions. But in the summer of 1944, following heavy casualties in the fields of France, the Allies—desperate for trained tank personnel—called the battalion up anyway. While most combat troops fought on the front for a week or two before being rotated back, the men of the 761st served for more than six months, fighting heroically under Patton’s Third Army at the Battle of the Bulge and in the Allies’ final drive across France and Germany. Despite a casualty rate that approached 50 percent and an extreme shortage of personnel and equipment, the 761st would ultimately help liberate some thirty towns and villages, as well as several branch concentration camps. The racism that shadowed them during the war and the prejudice they faced upon their return home are an indelible part of their story. Shining through most of all, however, are the lasting bonds that united them as soldiers and brothers, the bravery they exhibited on the battlefield, and the quiet dignity and patriotism that defined their lives.",
  "genres": [
    "History",
    "Nonfiction",
    "World War II",
    "War",
    "Military Fiction",
    "American History",
    "Military History"
  ],
  "author": "Kareem Abdul-Jabbar",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/170212.Brothers_in_Arms"
}