{
  "title": "Keeping Watch",
  "description": "Acclaimed as one of the most original talents to emerge in the last decade, award-winning author Laurie R. King returns to Folly Island to deliver her most stunning achievement yet--a breathtaking novel of suspense that explores the very essence of good and evil.Allen Carmichael came back from Vietnam a lifetime ago--but only now was he ready to return home. For years, he’s lived on the fringes of the law, using a soldier’s skills to keep watch over those too young to defend themselves. Some consider him nothing but a kidnapper for hire--the best in the business; others call him a hero. His specialty has been rescuing children from abusive parents and escorting them to loving homes. But after twenty-five years, he is ready to take on his final case--a case that could destroy him.The boy’s name is He believes his father is going to kill him. Allen is convinced that the twelve-year-old is right and devises a strategy to save him. His last job done, Allen heads back to Folly Island, where he plans to settle into a quiet life. But not long after his return, a small plane piloted by the boy’s father’s crashes, leaving behind debris--but no body. Now it is up to Allen to resolve whether Jamie’s father is dead or alive--and to make sure Jamie himself stays out of harm’s way. But a series of ominous events leads Allen to question whether Jamie’s father is really the enemy after all. Or if the real threat is far more unspeakable...and the killer unimaginable.Riveting, harrowing, and unforgettable, Keeping Watch takes psychological suspense to its most dizzying heights and proves again why Laurie R. King has been called by both readers and critics an undisputed master of suspense.",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Mystery Thriller",
    "Suspense",
    "Crime",
    "Audiobook"
  ],
  "author": "Laurie R. King",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/170238.Keeping_Watch"
}