{
  "title": "The Beekeeper's Apprentice",
  "description": "Edgar Award-winning author Laurie R. King again proves her flair fortantalizing mystery in this first novel of an acclaimed series. Long sinceretired from his observations of criminal humanity, Sherlock Holmes is engagedin a reclusive study of honeybee behavior on the Sussex Downs. Never did heexpect to meet an intellect to match his own--until he made the acquaintance ofa very modern 15-year-old girl whose mental acuity is equaled only by heraudacity, tenacity, and unconventional taste for trousers and cloth caps. Underthe master detective's sardonic instruction, Miss Mary Russell hones her talentfor deduction, disguises, and danger--in the chilling case of a landowner'smysterious fever, and in the kidnapping of an American senator's daughter inthe wilds of Wales. But her ultimate challenge is yet to come. A near-fatalbomb on her doorstep--and another on Holmes's--sends the two sleuths on thetrail of a villain whose machinations scatter meaningless clues and seemutterly without motive. The bomber's objective, however, is quite clear: to endRussell and Holmes's partnership...and their lives.Edgar Award-winning author Laurie R. KingSherlock Holmes meets his match in a formidable new enemy--and his surprising new partner\"Rousing...riveting...suspenseful.\" -- \"Chicago Sun-Times\"\" \"The Beekeeper's Apprentice\" has power to charm the most grizzled BakerStreet Irregular.\" -- \"Daily News,\" New York\"If there is a new P. D. James... I would put my money on Laurie R. King, whose \"A Grave Talent\" kept me reading deep into the night.\"-- \"The Boston Globe\"\"Amazing first novel with intelligence, intrigue, and intricacy...This workexhibits strong psychological undertones,compelling urgency, and dramaticaction. [Laurie King is] a writer to watch.\" -- \"Library Journal\"\"Wonderful: an intelligently and imaginatively crafted novel that's alsogreat fun.\" -- \"The Drood Review of Mystery\" (Editors' Choice of1994)",
  "genres": [
    "Mystery",
    "Fiction",
    "Historical Fiction",
    "Historical",
    "Book Club",
    "Audiobook",
    "Mystery Thriller"
  ],
  "author": "Laurie R. King",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/170237.The_Beekeeper_s_Apprentice"
}