{
  "title": "It Wasn't All Dancing and Other Stories",
  "description": "This eagerly anticipated second volume of short stories is offered by nationally acclaimed writer Mary Ward Brown, often referred to as the \"first lady\" of Alabama letters.With the 11 stories in this long-awaited collectiong, Mary Ward Brown once again offers her devoted fans a palette of new literary pleasures. The hallmarks of her style, so finely wrought in the award-winning Tongues of Flame (1986)--the fully realized characters, her deep sensitivity, a defining sense of place and time--are back in all their richness to involve and enchant the reader.All but one of the stories are set in Alabama. They deal with dramatic turning points in the lives of charcaters who happen to be southerners, many jaxtaposed between Old South sensibility and manners and New South modernity and expectations. Among these is a new widow who is not consoled by well-meaning, proselytizing Christians; a middle-aged waitress in love with the town \"catch\"; a bedridden belle dependent upon her black nurse; a \"special\" young man in a newspaper shop; a young faculty wife who attempts generosity with a lower-class neighbor; and a lawyer caught in the dilemma of race issues. Through their diverse voices, Brown proves herself a graceful and gifted storyteller who writes with an authoritative pen, inventing and inhabiting the worlds of her set of characters with insight, compassion, and wit.Most of the stories in It Wasn't All Dancing have appeared previously in prominent national magazines and literary journals, including the Atlantinc Monthly, Grand Street,  and Threepenny Review. This fine collection should appeal to a wide audience among writers, literature scholars, and general readers alike.Mary Ward Brown won the 1987 PEN/Hemingway Award, the 1991 Lillian Smith Award, and the 1987 Alabama Library Association Award for her first collection of short storied, Tounges of Flame. She lives in the family home in Marion, Alabama.",
  "genres": [
    "Short Stories",
    "Fiction",
    "Southern"
  ],
  "author": "Mary Ward Brown",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/170292.It_Wasn_t_All_Dancing_and_Other_Stories"
}