{
  "title": "The Commander's Palace: New Orleans Cookbook",
  "description": "There is a quiet culinary revolution going on at Commander's Palace a one-hundred-year-old restaurant in the center of New Orleans' Garden District. Here diners gather to enjoy a fabulous \"new\" New Orleans cuisine. dubbed \"Haute Creole.\" New Orleans is the birthplace of many fine classic dishes -- such as shrimp remoulade, seafood gumbo, oysters Rocketeller, trout amandine, and pompano en papillotte. At Commander's Palace this classic cuisine has been changed to fit today's more health-conscious lifestyles. Only the freshest local ingredients are used, heavy sauces have been replaced by light sauce reductions that intensify spicy Creole flavors. and nouvelle French and Chinese cooking techniques and Japanese modes of presentation have been adapted. The results have been glowingly praised. As Bon Appetit magazine said in its cover story on Commander's Palace, \"The Brennans are simply attempting to add an element of originality to a style of American cookery which has already made its mark in the annals of gastronomy but which is now ready for innovative reappraisal.\"The leaders of the Haute Creole revolution in New Orleans, and the owners of Commander's Palace, are Ella and Dick Brennan. Brother and sister, they are part of the famous Brennan elan that started Brennan's restaurant in the French Quarter of New Orleans forty years ago. The name Brennan is synonymous with the finest in New Orleans food. In 1974 Ella and Dick took over Commander's Palace, renovated it, and turned it into one of the most innovative, imaginative dining spots in New Orleans. This book brings together for the first time the fabulous recipes and secrets of this exciting restaurant.There are more than 175 recipes in all, including drinks, appetizers and soups, salads, seafood, chicken and game, beef and veal, and desserts and coffees.Regional American cuisine has never been more popular. This book should be a welcome addition to the cookbook library of anyone interested in fine Southern cuisine.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Reference",
    "Food and Drink"
  ],
  "author": "Ella Brennan",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/170347.The_Commander_s_Palace"
}