{
  "title": "A Fox In Paris",
  "description": "On a sultry August day in the summer of 1836, a young boy from the countryside of Bordeaux, France is abandoned to his fate on the streets of Paris. Far from being a \"City of Light\", for the poor and the homeless the streets of Paris are a dangerous and unforgiving place. For 11-year old Lucien they are now an amazing new home. Before being abandoned by his jealous older cousin, Lucien enjoyed a life of privilege. Raised as a young gentleman by his, wealthy, uncle, who took who took him in after he is orphaned, the old man instills in Lucien the values that will ultimately be his salvation. Upon his uncle?s death, Lucien?s cousin Gustave decides to rid himself of his new ward, rather than share any of his newly inherited wealth. It is this selfish ambition that lands Lucien - penniless, and alone - in the Tuileries Palace gardens in Paris, with only a treasured copy of ?Robinson Crusoe? to call his own. It is here that the desperate boy rescues a stray dog that is about to be killed by the palace guards. Doing his best for the badly injured animal, Lucien carries him along as he wanders the streets of the city in search of rescue. As the little dog regains his strength, the two become an inseparable team, caring for each other through good times and bad, like Crusoe and Man-Friday, in Lucien?s favorite book. By remembering the values of generosity, charity and optimism, instilled in him by his dead uncle, and with the help of his clever dog, the two manage to thrive on their own. In the end, by staying true to himself, Lucien succeeds not only in saving himself, but also in resurrecting his shattered family in ways he could never have imagined. Based on an incomplete work by Mary Nelson Carter, and adapted here, the lessons of \"A Fox in Paris\" are as meaningful to children (of any age) now as they were more than a century ago. Generosity, selflessness, and personal honor are in short supply these days, and this story is a warm-hearted, captivating, and elegantly written reminder of their eternal value. It is a story we can all take to heart.",
  "genres": [],
  "author": "Mary Nelson Carter",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/17033958-a-fox-in-paris"
}