{
  "title": "Rimrunners",
  "description": "Meet Elizabeth Yeager, \"Spacer, machinist, temp.\" A refugee waiting for a ship to call home, Bet Yeager was once a marine.Now she's on the run.In the action-packed tradition of Robert A. Heinlein's Starship Troopers, David A. Drake's Hammer's Slammers, and her own bestselling Chanur series, C.J. Cherryh returns to the Hugo Award-winning setting of Downbelow Station and Merchanter's Luck for hard-edged, tough-minded adventure beyond the lawless edge of interstellar culture. Here the line between space soldier and star pirate is as thing as a laser, and a lethal struggle for power can be as near as the officers' deck.In this world Yeager has hit bottom, she's jobless, homeless, and starving on Thule, a nearly abandoned station in the by-passed Hinder Stars. Sleeping in toilets, killing to save her body, stealing to stay alive, she feels her hopes die ... until the Loki docks. It's a spook: a mercenary warship barely legitimated by Alliance documents as a free-lance bounty hunter and spy vessel—a ship whose captain has no qualms about signing on a \"machinist\" with no papers and a shady past, not to mention murder charges hanging over her head.But escape from Thule is no refuge, for Loki is crewed by Bet Yeager's sworn enemies. The spooks are hunting the remnant of the outlawed Earth Company fleet ... fliers considered outlaws only because they lost a war ... fliers form the fleet that Bet Yeager has loyally served her whole life. Now, trapped about a tin can in deep space where a single wrong word might give her away, Yeager must seek and destroy her old comrades without arousing the suspicious of her crewmates.Her position will become even more precarious when she dares to defend the ship's pariah, NG Ramey. A victim unfairly, hellishly abused by Loki's sadistic first officer, Ramey is merely a pawn in a vicious struggle between shipboard factions and ambitious officers for control of the vessel. Suddenly Yeager is in the center of the conflict. Drawing attention from all sides, she had no allies, no way to fight, nowhere to hide, no way to get out. Only Fleet training and fighting skills can save Bet Yeager now.Because once enlisted, no one leaves a spook ship alive ...",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Space Opera",
    "Science Fiction Fantasy",
    "Fantasy",
    "Speculative Fiction",
    "Space"
  ],
  "author": "C.J. Cherryh",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/1705070.Rimrunners"
}