{
  "title": "Wastelands: Stories of the Apocalypse",
  "description": "Famine, Death, War, and Pestilence - the Four Horsemen of the Apocalypse, the harbingers of Armageddon - these are our guides through the Wastelands. From the Book of Revelation to The Road Warrior, from A Canticle for Leibowitz to The Road, storytellers have long imagined the end of the world, weaving eschatological tales of catastrophe, chaos, and calamity. In doing so, these visionary authors have addressed one of the most challenging and enduring themes of imaginative fiction: The nature of life in the aftermath of total societal collapse. Gathering together the best post-apocalyptic literature of the last two decades from many of today's most renowned authors of speculative fiction, Wastelands  explores the scientific, psychological, and philosophical questions of what it means to remain human in the wake of Armageddon. Whether the end of the world comes through nuclear war, ecological disaster, or cosmological cataclysm, these are tales of survivors, in some cases struggling to rebuild the society that was, in others, merely surviving, scrounging for food in depopulated ruins and defending themselves against monsters, mutants, and marauders. Wastelands delves into this bleak landscape, uncovering the raw human emotion and heart-pounding thrills at the genre's core. Introduction by John Joseph AdamsThe End of the Whole Mess by Stephen King read by Stefan RudnickiThe People of Sand and Slag by Paolo Bacigalupi read by Alex Hyde-WhiteBread and Bombs by M. Rickert read by Hillary HuberHow We Got In Town and Out Again by Jonathan Lethem read by Stefan RudnickiDark, Dark Were the Tunnels by George R. R. Martin read by Arthur MoreyWaiting for the Zephyr by Tobias S. Buckell read by Gabrielle de CuirSalvage by Orson Scott Card read by Stefan RudnickiNever Despair by Jack McDevitt read by Emily RankinWhen Sysadmins Ruled the Earth by Cory Doctorow read by Paul BoehmerThe Last of the O-Forms by James Van Pelt read by Stefan RudnickiStill Life with Apocalypse by Richard Kadrey read by Harlan EllisonArtie’s Angels by Catherine Wells read by Emily RankinJudgment Passed by Jerry Oltion read by Paul BoehmerMute by Gene Wolfe read by Susan HanfieldInertia by Nancy Kress read by Hillary HuberAnd the Deep Blue Sea by Elizabeth Bear read by Judy YoungSpeech Sounds by Octavia E. Butler read by Lisa Renee PittsKillers by Carol Emshwiller read by Susan HanfieldGinny Sweet-hips’ Flying Circus by Neal Barrett, Jr. read by Stefan RudnickiThe End of the World as We Know It by Dale Bailey read by Arthur MoreyA Song Before Sunset by David Grigg read by Stefan RudnickiEpisode Seven: Last Stand Against the Pack in the Kingdom of the Purple Flowers by John Langan read by Lisa Renee Pitts©2008 John Joseph Adams 🅿2014 Blackstone Audio",
  "genres": [
    "Short Stories",
    "Science Fiction",
    "Fiction",
    "Post Apocalyptic",
    "Horror",
    "Anthologies",
    "Dystopia"
  ],
  "author": "John Joseph Adams",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/1705697.Wastelands"
}