{
  "title": "Happy This Year!: The Secret to Getting Happy Once and for All",
  "description": "In your hands, you hold the secret to transforming your life. Big words? Yes, but this is a plan that has already proven itself with millions of people around the world. Pastor Will Bowen developed the life-changing A Complaint Free World plan based on the simple idea that good things will happen for you in abundance if you can just leave your grumbling behind. In a Sunday-morning sermon, Will told his congregation he wanted to make the world a complaint-free zone and, to prove he was serious, he passed out purple bracelets to each church member and offered them a challenge. \"If you catch yourself complaining, take the bracelet and move it to the other wrist.\"  Now, less than a year later, more than six million people have taken up the challenge, trying to go twenty-one consecutive days without complaining, criticizing, or gossiping, and in so doing, forming a new, positive habit. By changing your words, you can change your thoughts and then begin to create your life by design. People have shared stories with Will of chronic pain relieved, relationships healed, careers improved, and becoming an overall happier person. Less pain, improved health, satisfying relationships, a better job, being more serene and joyous—sound good? It’s not only possible, it’s probable. Consciously striving to reformat your mental hard drive is not easy, but you can start now by using the steps Bowen presents here.  In this book, you can learn what constitutes a complaint, why we complain, what benefits we think we receive from complaining, how complaining is destructive to our lives, and how we can get others around us to stop complaining. You will learn the steps to eradicating this poisonous form of expression from your life. If you stay with it, you will find that not only will you not complain, but others around you will cease to do so as well. In a short period of time, you can have the life you’ve always dreamed of having.",
  "genres": [
    "Self Help",
    "Nonfiction",
    "Personal Development",
    "Psychology",
    "Audiobook",
    "Inspirational",
    "Philosophy"
  ],
  "author": "Will Bowen",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/17058517-happy-this-year"
}