{
  "title": "The Skewed Throne",
  "description": "The first book in the gripping and gritty fantasy Throne of Amenkor trilogy, the story of an unlikely heroine in a city devastated and altered by the mysterious White FireAmenkor, city of legend―at its height, Amenkor was a center of wealth and culture. But a millennium ago, the city was caught in the White Fire, a force that swept across the land spreading madness, drought, famine, and disease in it wake.Now the Dredge―the bustling market street that snaked between the slums and the prosperous center of the city―marked the dividing line between plenty and poverty, safety and peril.Left a homeless orphan as a very young child, Varis learned to survive in the Dredge. And when the White Fire blasted through Amenkor for the second time, Varis―along with the entire city―was trapped in the overwhelming blaze of power.Though the current Mistress continued to reign from the Skewed Throne, Amenkor's decline escalated after the second Fire. For Varis, though, the chance to escape her hopeless existence unexpectedly presented itself when a guardsman of the Skewed Throne named Erick―one of the elite assassins known as Seekers―enlisted her to work for him.Because she had a gift for \"Seeing\" the true nature of people, Varis soon realized something was wrong, that some of those marked for death were not guilty. But how could the Mistress be mistaken?Trust in the all-knowing, all-seeing justice and wisdom of their ruler was the foundation of Amenkor's society. Then, one fateful day, Varis claimed a life that took her beyond the law. Suddenly, there is nowhere safe for her in the Dredge. There is only one place left to flee to―into the heart of Amenkor itself.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Epic Fantasy",
    "High Fantasy",
    "Science Fiction Fantasy",
    "Science Fiction",
    "Magic"
  ],
  "author": "Joshua Palmatier",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/1705942.The_Skewed_Throne"
}