{
  "title": "The Classic Horror Stories",
  "description": "H. P. Lovecraft (1890-1937) was a reclusive scribbler of horror stories for the American pulp magazines that specialized in Gothic and science fiction in the interwar years. He often published in Weird Tales and has since become the key figure in the slippery genre of \"weird fiction.\" Lovecraft developed an extraordinary vision of feeble men driven to the edge of sanity by glimpses of malign beings that have survived from human prehistory or by malevolent extra-terrestrial visitations. The ornate language of his stories builds towards grotesque moments of revelation, quite unlike any other writer.This new selection brings together nine of his classic tales, focusing on the \"Cthulhu Mythos,\" a cycle of stories that develops the mythology of the Old Ones, the monstrous creatures who predate human life on earth. The stories collected here include some of Lovecraft's finest, including \"The Call of Cthulhu,\" \"At the Mountains of Madness,\" \"The Dunwich Horror,\" \"The Colour Out of Space,\" \"The Shadow over Innsmouth,\" and \"The Shadow out of Time.\" The volume also includes vital extracts from Lovecraft's critical essay, \"Supernatural Horror in Literature,\" in which he gave his own important definition of \"weird fiction.\" In a fascinating introduction, Roger Luckhurst gives Lovecraft the attention he deserves as a writer who used pulp fiction to explore a remarkable philosophy that shockingly dethrones the mastery of man.Featuring a chronology, bibliography, and informative notes, this is a must-have critical edition for Lovecraft aficionados, and the best introduction to his work for first-time visitors to his strange fictional world.",
  "genres": [
    "Horror",
    "Classics",
    "Short Stories",
    "Science Fiction",
    "Fiction",
    "Fantasy",
    "Supernatural"
  ],
  "author": "H.P. Lovecraft",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/17061250-the-classic-horror-stories"
}