{
  "title": "How the Light Gets In: Writing as a Spiritual Practice",
  "description": "\"When I begin to write, I open myself and wait. And when I turn toward an inner spiritual awareness, I open myself and wait.\" With that insight, Pat Schneider invites readers to contemplate their lives and deepest questions through writing. In seventeen concise thematic chapters that include meditations on topics such as fear, freedom, tradition in writing and in religions, forgiveness, joy, social justice, and death, How the Light Gets In gracefully guides readers through the artistic and spiritual questions that life offers to everyone.Praised as a \"fuse lighter\" by author Julia Cameron and \"the wisest teacher of writing I know\" by the celebrated writing guru Peter Elbow, Pat Schneider has lived a life of writing and teaching, passion and compassion. With How the Light Gets In , she delves beyond the typical \"how-to's\" of writing to offer an extended rumination on two inner paths, and how they can run as one. Schneider's book is distinct from the many others in the popular spirituality and creative writing genre by virtue of its approach, using one's lived experience--including the experience of writing--as a springboard for expressing the often ineffable events that define everyday life. Her belief that writing about one's own life leads to greater consciousness, satisfaction, and wisdom energizes the book and carries the reader elegantly through difficult topics.As Schneider writes, \"All of us live in relation to mystery, and becoming conscious of that relationship can be a beginning point for a spiritual practice--whether we experience mystery in nature, in ecstatic love, in the eyes of our children, our friends, the animals we love, or in more strange experiences of intuition, synchronicity, or prescience.\"",
  "genres": [
    "Writing",
    "Spirituality",
    "Nonfiction",
    "Memoir",
    "Journaling",
    "Religion",
    "Self Help"
  ],
  "author": "Pat Schneider",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/17070443-how-the-light-gets-in"
}