{
  "title": "The Christian Century and the Rise of the Protestant Mainline",
  "description": "The Christian Century and the Rise of the Protestant Mainline offers the first full-length, critical study of The Christian Century, widely regarded as the most influential religious magazine in America for most of the twentieth century and hailed by Time as Protestantism's most vigorous voice.Elesha Coffman narrates the previously untold story of the magazine, exploring its chronic financial struggles, evolving editorial positions, and often fractious relations among writers, editors, and readers, as well as the central role it played in the rise of mainline Protestantism. Coffman situates this narrative within larger trends in American religion and society. Under the editorship of Charles Clayton Morrison from 1908-1947, the magazine spoke out about many of the most pressing social and political issues of the time, from child labor and women's suffrage to war, racism, and the internment of Japanese Americans during World War II. It published such luminaries as Jane Addams, Reinhold Niebuhr, and Martin Luther King Jr. and jostled with the Nation, the New Republic, and Commonweal, as it sought to enlarge its readership and solidify its position as the voice of liberal Protestantism. But by the 1950s, internal strife between liberals and neo-orthodox and the rising challenge of Billy Graham's evangelicalism would shatter the illusion of Protestant consensus. The coalition of highly educated, theologically and politically liberal Protestants associated with the magazine made a strong case for their own status as shepherds of the American soul but failed to attract a popular following that matched their intellectual and cultural clout.Elegantly written and persuasively argued, The Christian Century and the Rise of the Protestant Mainline takes readers inside one of the most important religious magazines of the modern era.",
  "genres": [
    "History",
    "Theology",
    "Christian",
    "Journalism",
    "American History"
  ],
  "author": "Elesha J. Coffman",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/17070445-the-christian-century-and-the-rise-of-the-protestant-mainline"
}