{
  "title": "Nilsson: The Life of a Singer-Songwriter",
  "description": "Paul McCartney and John Lennon described him as the Beatles' \"favorite group,\" he won Grammy awards, wrote and recorded hit songs, and yet no figure in popular music is as much of a paradox, or as underrated, as Harry Nilsson.In this first ever full-length biography, Alyn Shipton traces Nilsson's life from his Brooklyn childhood to his Los Angeles adolescence and his gradual emergence as a uniquely talented singer-songwriter. With interviews from friends, family, and associates, and material drawn from an unfinished autobiography, Shipton probes beneath the enigma to discover the real Harry Nilsson. A major celebrity at a time when huge concerts and festivals were becoming the norm, Nilsson shunned live performance. His venue was the studio, his stage the dubbing booth, his greatest triumphs masterful examples of studio craft. He was a gifted composer of songs for a wide variety of performers, including the Ronettes, the Yardbirds, and the Monkees, yet Nilsson's own biggest hits were almost all written by other songwriters. He won two Grammy awards, in 1969 for \"Everybody's Talkin'\" (the theme song for Midnight Cowboy), and in 1972 for \"Without You,\" had two top ten singles, numerous album successes, and wrote a number of songs--\"Coconut\" and \"Jump into the Fire,\" to name just two--that still sound remarkably fresh and original today. He was once described by his producer Richard Perry as \"the finest white male singer on the planet,\" but near the end of his life, Nilsson's career was marked by voice-damaging substance abuse and the infamous deaths of both Keith Moon and Mama Cass in his London flat.Drawing on exclusive access to Nilsson's papers, Alyn Shipton's biography offers readers an intimate portrait of a man who has seemed both famous and unknowable--until now.",
  "genres": [
    "Music",
    "Biography",
    "Nonfiction",
    "Rock N Roll",
    "Audiobook",
    "Memoir"
  ],
  "author": "Alyn Shipton",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/17070423-nilsson"
}