{
  "title": "Skull Creek Stakeout",
  "description": "In Transylvania, North Carolina, Nick Caden finds a murder victim with fangs, bite marks and a stake driven through its heart. There are no such things as vampires ... are there?After solving the ghost story murder at Deadwood Canyon, Nick lands a job as a roving reporter for The Cool Ghoul Gazette, a website / app that covers paranormal events and supernatural disturbances (that may or may not have actually happened). When the editor sends Nick to investigate a murder in Transylvania, North Carolina, the young super sleuth finds a corpse with fangs, bite marks and a stake driven through its heart.But once he begins to peel back the clues surrounding the murder Nick finds his new job is not only dangerous but could suck the life out of him. Awards for the Monster Mysteries series  \n   Winner of the Selah award for tween / teen mystery series \n   INSPY Award nominee \n   Moonbeam Children's Book Award nominee \n Praise for the Monster Mysteries series\"This series has the same longevity and wholesome quality as \"The Hardy Boys\" and \"Nancy Drew\" but the author writes for today's youth.\" ~ Amazon review\"I enjoyed reading this fun, suspense adventure. Great book for middle school. Teen boys and girls will enjoy it, too!\" ~ Amazon review\"I would think it would be for ages nine and up. A good Christian book for boys.\" ~ Amazon review\"I was guessing until the end of the book. I did not know who it was. Even adults will enjoy this book.\" ~ Amazon reviewWritten for the General Market (G): Contains no; sexual dialogue or situations, violence, or strong language. While this murder mystery series discusses things like ghosts, vampires, and zombies, it does so without showing blood and gore. May also contain some content of an inspirational/religious nature.Interview with the AuthorQ: Why should a boy or girl begin reading the Monster Series?Novels in the Monster Series are fast, fun, clean teen and tween books that point readers back to the Bible where much of today's modern horror themes originated. Boys and girls will fall in love with the quirky characters Nick meets, their oddball antics, and the way Nick solves murder cases by watching police and detective shows - all while Nick displays daring confidence (while also finding trouble and danger).Q: Why should parents buy the Monster Series for their boys and girls?Parents will appreciate the clean elements and moral values that avoid profanity and sexual situations. As an imperfect teen sleuth, Nick is troubled by the phoniness he sees around him and the lies of others that pass for facts. Above all, he wants to find the truth. This drives him to act in ways that lead him towards danger. Nick believes his generation, more than any other before it, needs to seek truth and that can only be found by asking hard questions. His parents may know some things and authority figures may have it all figured out, but Nick knows things are not always as they seem. Until something is examined, tested, and found true, only then can it be counted upon. Each book has some romance, but it's innocent and clean.Q: What age is appropriate for these books?The Monster Series is appropriate for mature fifth grade readers. Other parents may choose sixth or seventh grade, due to the fact that Nick \nIS\n solving a murder. There is a body in every story! It's also a great, nostalgic read for adults who enjoyed the Hardy Boys series!",
  "genres": [
    "Mystery",
    "Christian Fiction",
    "Young Adult",
    "Middle Grade"
  ],
  "author": "Eddie       Jones",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/17070768-skull-creek-stakeout"
}