{
  "title": "Spectacular Wickedness: Sex, Race, and Memory in Storyville, New Orleans",
  "description": "From 1897 to 1917 the red-light district of Storyville commercialized and even thrived on New Orleans's longstanding reputation for sin and sexual excess. This notorious neighborhood, located just outside of the French Quarter, hosted a diverse cast of characters who reflected the cultural milieu and complex social structure of turn-of-the-century New Orleans, a city infamous for both prostitution and interracial intimacy. In particular, Lulu White―a mixed-race prostitute and madam―created an image of herself and marketed it profitably to sell sex with light-skinned women to white men of means. In Spectacular Wickedness, Emily Epstein Landau examines the social history of this famed district within the cultural context of developing racial, sexual, and gender ideologies and practices.Storyville's founding was envisioned as a reform measure, an effort by the city's business elite to curb and contain prostitution―namely, to segregate it. In 1890, the Louisiana legislature passed the Separate Car Act, which, when challenged by New Orleans's Creoles of color, led to the landmark Plessy v. Ferguson decision in 1896, constitutionally sanctioning the enactment of \"separate but equal\" laws. The concurrent partitioning of both prostitutes and blacks worked only to reinforce Storyville's libidinous license and turned sex across the color line into a more lucrative commodity.By looking at prostitution through the lens of patriarchy and demonstrating how gendered racial ideologies proved crucial to the remaking of southern society in the aftermath of the Civil War, Landau reveals how Storyville's salacious and eccentric subculture played a significant role in the way New Orleans constructed itself during the New South era.",
  "genres": [
    "History",
    "Nonfiction",
    "Audiobook",
    "Race",
    "Womens",
    "Jazz",
    "Sexuality"
  ],
  "author": "Emily Epstein Landau",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/17072259-spectacular-wickedness"
}