{
  "title": "War Comes to Garmser: Thirty Years of Conflict in the Afghan Frontier",
  "description": "If you want to understand Afghanistan, writes Carter Malkasian, you need to understand what has happened on the ground, in the villages and countryside that were on the frontline. These small places are the heart of the war. Modeled on the classic Vietnam War book, War Comes to Long An, Malkasian's War Comes to Garmser promises to be a landmark account of the war in Afghanistan. The author, who spent nearly two years in Garmser, a community in war-torn Helmand province, tells the story of this one small place through the jihad, the rise and fall of Taliban regimes, and American and British surge. Based on his conversations with hundreds of Afghans, including government officials, tribal leaders, religious leaders, and over forty Taliban, and drawing on extensive primary source material, Malkasian takes readers into the world of the Afghans. Through their feuds, grievances, beliefs, and way of life, Malkasian shows how the people of Garmser have struggled for three decades through brutal wars and short-lived regimes. Beginning with the victorious but destabilizing jihad against the Soviets and the ensuing civil war, he explains how the Taliban movement formed; how, after being routed in 2001, they returned stronger than ever in 2006; and how Afghans, British, and Americans fought with them thereafter. Above all, he describes the lives of Afghans who endured and tried to build some kind of order out of war. While Americans and British came and went, Afghans carried on, year after year. Afghanistan started out as the good war, the war we fought for the right reasons. Now for many it seems a futile military endeavor, costly and unwinnable. War Comes to Garmser offers a fresh, original perspective on this war, one that will redefine how we look at Afghanistan and at modern war in general.",
  "genres": [
    "History",
    "Nonfiction",
    "War",
    "Military Fiction",
    "Asia"
  ],
  "author": "Carter Malkasian",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/17076150-war-comes-to-garmser"
}