{
  "title": "To Err Is Human: Building a Safer Health System",
  "description": "Experts estimate that as many as 98,000 people die in any given year from medical errors that occur in hospitals. That's more than die from motor vehicle accidents, breast cancer, or AIDS--three causes that receive far more public attention. Indeed, more people die annually from medication errors than from workplace injuries. Add the financial cost to the human tragedy, and medical error easily rises to the top ranks of urgent, widespread public problems.To Err Is Human breaks the silence that has surrounded medical errors and their consequence--but not by pointing fingers at caring health care professionals who make honest mistakes. After all, to err is human. Instead, this book sets forth a national agenda--with state and local implications--for reducing medical errors and improving patient safety through the design of a safer health system.This volume reveals the often startling statistics of medical error and the disparity between the incidence of error and public perception of it, given many patients' expectations that the medical profession always performs perfectly. A careful examination is made of how the surrounding forces of legislation, regulation, and market activity influence the quality of care provided by health care organizations and then looks at their handling of medical mistakes.Using a detailed case study, the book reviews the current understanding of why these mistakes happen. A key theme is that legitimate liability concerns discourage reporting of errors--which begs the question, \"How can we learn from our mistakes?\"Balancing regulatory versus market-based initiatives and public versus private efforts, the Institute of Medicine presents wide-ranging recommendations for improving patient safety, in the areas of leadership, improved data collection and analysis, and development of effective systems at the level of direct patient care.To Err Is Human asserts that the problem is not bad people in health care--it is that good people are working in bad systems that need to be made safer. Comprehensive and straightforward, this book offers a clear prescription for raising the level of patient safety in American health care. It also explains how patients themselves can influence the quality of care that they receive once they check into the hospital. This book will be vitally important to federal, state, and local health policy makers and regulators, health professional licensing officials, hospital administrators, medical educators and students, health caregivers, health journalists, patient advocates--as well as patients themselves.First in a series of publications from the Quality of Health Care in America, a project initiated by the Institute of Medicine",
  "genres": [
    "Medicine",
    "Nonfiction",
    "Health Care",
    "Medical"
  ],
  "author": "Linda T. Kohn",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/17080067-to-err-is-human"
}