{
  "title": "The Fifty List",
  "description": "Did you love Fifty Shades of Grey? Did you hate it? Either way, The Fifty List will deliver all the hot sex scenes you can handle without riding crops or implausibly convoluted descriptions of how it feels...'down there.’ The Fifty List has an abundance of intricately detailed, erotic sex scenes that will appeal to both women and men, but at its foundation is a story about real people leading real lives. Ropes and restraints are unnecessary as the characters navigate through a world of passion, happiness, sorrow, pain and pleasure. Filled with lusty romantic adventure, The Fifty List follows the lives of a wife, a husband and a man no woman could possibly resist. Pam Williams leads a satisfying life. She’s been married for 21 years to Dave, an insurance salesman. They have two teenage children Dylan, who fluctuates from being incredibly energetic and loveable to defiant, depressed and venomous; and Samantha, who is always sweet and cheerful. Pam is soon to have a ‘milestone birthday.’ She and her quirky friend Hannah come up with a list of adventures and achievements to accomplish before she turns 50. A former reporter and avid writer of fantasy-fueled X-Files fanfiction, Pam is a senior consultant at Pinches Public Relations. Pam thought her life was fulfilling enough until a new social media specialist walked into the office. Martin Campbell is not only the typical tall, dark and handsome type; he’s also brilliant, witty, sensitive and insightful. Martin is burdened with heartbreaking emotional baggage and Pam lights a spark in him that he thought was long ago extinguished. Martin ignites a need in Pam for greater sexual gratification and personal fulfillment. Together, they explore the realms of love and passion, while helping each other to heal and grow. Excerpt from The Fifty List: Pam: “When I’m with Dave, it’s like Martin is light years away and when I’m with Martin, it seems like home might as well be in a different galaxy.” Hannah: “Girl, you have the type of problem most women would kill to have two relationships that satisfy different, but fundamental yearnings in you. You have a husband who needs you and who you can nurture. You also have someone who adores you and exists purely to satisfy your every earthly desire. The question is can you keep those two relationships rolling without knocking out one of them?” Feedback from test readers: - Dripping in tension and a good balance between hot sex a very believable story. - I found myself drawn in and captivated the entire time and look forward to the sequel! - Romantic novels are not on my favourites list, even when they contain erection-producing steamy sex scenes. - Darlene Hesley’s book is better than Fifty Shades of Grey",
  "genres": [
    "Romance"
  ],
  "author": "Darlene Hesley",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/17085489-the-fifty-list"
}