{
  "title": "Inside Edge: A Revealing Journey into the Secret World of Figure Skating",
  "description": "Figure skating is the most beautiful and mysterious of all sports. When the skaters are on the ice, every twitch of a muscle and every slip of a skate blade is visible for the world to see. In Inside Edge , Christine Brennan chronicles--for the first time--a season on the skating circuit, intimately portraying the lives, on and off the ice, of the sport's current and upcoming stars. Woven into the narrative are stories of figure skating luminaries past, present, and future--including Peggy Fleming, Katarina Witt, Brian Boitano, Scott Hamilton, Kristi Yamaguchi, Nancy Kerrigan, Oksana Baiul, Michelle Kwan, Rudy Galindo, and Tara Lipinski. Revealing the backstage conflicts high-profile figure skaters face, and the ambition that drives them, Brennan also tells the stories of their families, of improbable rises to the top, and of wasted talents.If skaters are perfect, they can become international heroes. But if they fall, if they miss a three-revolution jump on a quarter-inch blade of steel, the despair is theirs alone. This is their life on the edge, where decades of training culminate in little more than four crucial minutes on the ice. There is no other sport like it. There is no other story like theirs.The figure skaters gathered slowly in the mahogany-paneled lobby of the majestic Mirror Lake Inn in Lake Placid, New York, flashing no smiles, barely saying a word. The collection of gregarious entertainers had been reduced to silent, wide-eyed stares. The crackling wood in the fireplace made the room's only noise.They had met in hotel lobbies in fancy street clothes hundreds of times in the past, but never for an event as devastating as this. On a cold night in late November 1995, they were to travel through snowswept Adirondack mountain roads to a nearby funeral home for a private wake for Sergei Grinkov, their colleague and friend who died of a massive heart attack during a skating practice the day before.",
  "genres": [
    "Sports",
    "Nonfiction",
    "Figure Skating",
    "Biography",
    "Memoir",
    "Biography Memoir",
    "Womens"
  ],
  "author": "Christine Brennan",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/171059.Inside_Edge"
}