{
  "title": "З лекцій теорії словесности. Байка, прислів'я, приповідка",
  "description": "ЗМІСТВступна стаття — О. Фіпкель 3—21Від редакторів-проф. 0. Ветухов, Ф. Зелинський 22—25Лекція перша. Тема лекції — взаємовідносини між словом та поетичним твором. Чому взято за основу байку. Науковий забобон щодо життя слова та поезії. Байка в житті, на корені і в збірнику. Байка в житті складається з двох частин: самої байки (поетичного образу) і того життьового явища, що словесно не визначається. Порівняння байки з емблемою, окремим поетичним висловом. Характерна риса байки — дія, єдність дії 26—36Лекція друга. Основні риси байки, як художнього твору : а) байка є відповідь на найскладніші явища життя, б) єдність дій, що увіходять у її склад, в) відсутність складних характеристик дієвих осіб, описів природи тощо, г) конкретність, одно-разовість, як спосіб поетичного узагальнення (однина замість множини) 37—45Лекція третя. Поезія і проза — основні форми людського мислення. Байка і вживання її в житті та байка в збірниках письменників. Три письменницьких способи пояснення байки. Подвійна байка і моральний висновок. Основна хиба Лес-сінгового визначення байки. Образ, даний у байці, — поезія, а узагальнення до неї—проза 37—56Лекція четверта. Байка не є приклад до загального висновку і не доводить його. Наукове (прозове) доведення є завжди аналіза загального твердження на складові частини, а науковий приклад є один з моментів цієї аналізи. Що таке науковий факт? Взаємини між прикладом і загальною думкою, між фактом і законом, узагальненням. Байка дає конкретний факт, І навколо нього групується декілька узагальнень. ІнакомовнІсть байки, синтетичність поезії є засіб здобувати узагальнення, а не доводити їхню правдивість 57—65Лекція п’ята. Теорія походження байки, щоб інакомовністю приховати, зробити приємнішою, правдиву думку. ІнакомовнІсть байкц є засіб краще висвітлити думку. Походження прислів’я з байки шляхом інверсії. Прислів’я, як скорочений зміст байки 66—73Лекція шоста. Художні засоби перетворення складного поетичного твору в прислів’я. Значення цього процесу для думки. Поетичний образ і взагалі процес поетичного мислення є процес згущення думки. Поезія не є якась прикраса думки, а одна з двох форм пізнання за допомогою слова. Два моменти критики в процесі користування художнім твором. Процес виникнення прислів’я, як поетичного твору, із звичайного спостереження з життя. Приповідка („поговорка44), як елемент байки, прислів’я (,пословицьіа) 74—83Лекція сьома. Елементарні форми поезії — слова образні. Поетичні назви деяких рослин. Перетворення поетичних, образних слів на прозові, безобразні і навпаки. Чергування поетичного й прозового мислення 84—90Лекція восьма. Слово не є засіб передавання думки. Процес пізнання шляхом порівняння і називання чогось словом є процес утворення нової думки в розумінні перетворення її. Значення слова для людини, як знаряддя розроблення, вдосконалення власної думки. Слово й художній твір, як засіб об’єктивації думки 91 -95Лекція дев'ята. Поетичний твір є головним чином акт пізнання, що йде попереду прозового, наукового пізнання. Процеси висловлення, поетичної творчости і сприйманЯЙ(критики) — однаково творчі процеси. Многозначність художнього твору. 96—100 Лекція десята. Загальна схема художнього твору. Поетична творча діяльність — ряд ступенів самопізнання або пізнання соціяльного оточення. Образ утворюється не заради читача, а тому що він потрібний самому авторові. Два типи образної інакомовности: 1) образ узято з іншого кола явищ, ніж значення це (метафора, алегорія); 2)образ І значення належать до одного кола явищ (це типовість, однина замість множини). Ілюстрації до цього з Лєрмонтова, Пушкіна. Творчість для себе і для інших 101 — 110",
  "genres": [
    "Language",
    "Philosophy",
    "Nonfiction"
  ],
  "author": "Oleksander Potebnja",
  "average_rating": "3.39",
  "url": "https://www.goodreads.com/book/show/17106657"
}