{
  "title": "Scusa ma ti chiamo amore",
  "description": "Niki e le sue amiche sono all'ultimo anno di scuola. Malgrado abbiano la maturità ne combinano ogni giorno di tutti i colori. Sfilate, feste, rave e tutti i possibili eventi anche fuori Roma. Alex è un \"ragazzo\" di quasi trentasette anni. Si è lasciato da poco e senza un vero perché con la sua fidanzata storica. Intorno a lui ruota un mondo complicato e divertente: i suoi genitori, le sue sorelle sposate e con figli e poi i suoi tre amici Enrico, Flavio e Pietro, anche loro tutti già sposati ma ognuno con le proprie particolarità. Enrico è geloso, Flavio metodico, Pietro invece è in fissa con tutte le donne del mondo. Alex è un pubblicitario e ha delle grandi responsabilità all'interno della sua azienda. Ma è appena arrivato un giovane rampante che mette a repentaglio il suo lavoro. E tutto questo non sarebbe niente se quella mattina Alex non incontrasse Niki. O meglio, se i due non si scontrassero. Niki è una bella ragazza, è divertente, è intelligente, è spiritosa, è allegra. C'è solo un piccolo dettaglio. Ha diciassette anni. Vent'anni meno di Alex. E dopo l'incontro di quella mattina, nulla sarà più come prima. Il mondo adulto si scontra con quello degli adolescenti. Ed ecco mamme e figlie in una discussione continua, papà che sono ancora ragazzini e ragazzi giovanissimi che sono già troppo adulti. E ancora ragazze sognatrici, ragazze deluse, ragazze romantiche e ragazze troppo folli. E adulti che invece hanno messo da parte tutti i loro sogni e vivono, o meglio sopravvivono, senza avere il coraggio di fermarsi a riflettere. Questo romanzo è la voglia di ritrovare la propria libertà, la voglia di avere sentimenti veri, di amare senza convenzioni e senza troppi perché. È la quotidianità ma è anche il sogno. È la voglia di dire basta a quel domani che ogni giorno ci raccontiamo, nel quale siamo sempre sicuri che faremo qualcosa di speciale. Ma intanto i giorni passano e quel domani non arriva. Di lui non c'è traccia. E allora ecco la nostra fuga, la più bella, la più folle, la più pazza. Una fuga d'amore. E poi quel faro. Insomma, un tuffo dove l'acqua è più blu. Niente di più.",
  "genres": [
    "Romance",
    "Young Adult",
    "Contemporary",
    "Fiction",
    "Italian Literature",
    "Chick Lit",
    "Romantic"
  ],
  "author": "Federico Moccia",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/1711303.Scusa_ma_ti_chiamo_amore"
}