{
  "title": "Pursuit The Chase and Sinking of the Bismarck",
  "description": "With a new introduction by the author. First published in 1974, this work remains in the forefront of the many books, movies, and television programs about the epic World War II drama played out in the stormy Atlantic. It is a thrilling firsthand account of the hunting down and sinking of the battleship 'Bismarck', pride of the German Fleet, told by a member of the Royal Navy's destroyer force who participated in the pursuit. The author's own experiences add fire and immediacy to the account that has come to be considered a classic by critic and general reader alike. The world's largest warship when she first sailed into the Atlantic in May 1941, the 'Bismarck' was a serious threat to Britain's survival and her sinking of the beloved battle cruiser 'HMS Hood' with nearly fifteen hundred aboard sent shock waves throughout Britain. Determined to track her down, the Royal Navy engaged in pursuit, finding the mammoth warship just hours from her safe harbor. The chess-like plotting, the horror and heroism on both sides, the final apocalyptic action have never been portrayed more vividly and objectively - and never with the benefit of such detailed documentation from both British and German sources. A measure of the book's epic qualities is that knowledge of the outcome in no way lessens the tension. When she was sunk just days after her own victorious action with the 'Hood<', the 'Bismarck' took more than two thousand German sailors to the bottom of the ocean and with them the dreams of the German naval high command. For sheer suspense, this book can hardly be equalled. For carefully researched history, it is an admirable example of fine writing. Ludovic Kennedy's introduction to this new edition places the event in perspective for today's audiences.",
  "genres": [
    "History",
    "Nonfiction",
    "Military Fiction",
    "Military History",
    "War",
    "World War II",
    "Historical"
  ],
  "author": "Ludovic Kennedy",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/1711378.Pursuit_The_Chase_and_Sinking_of_the_Bismarck"
}