{
  "title": "The Product Manager's Survival Guide: Everything You Need to Know to Succeed as a Product Manager",
  "description": "Forge a powerful strategy to become a product manager who delivers results. The world of business is moving at breakneck speed. More is being demanded of everyone--with fewer resources than ever. In no profession is this more apparent than Product Management.Written by one of today's leading Product Management thought-leaders, Steven Haines, The Product Manager's Survival Guide provides best practices, practical on-the-job advice, and a step-by-step blueprint for succeeding in Product Management. Whatever your level of experience--whether you're a novice product manager or seasoned Product Management leader--you'll find everything you need to make consistent positive impacts on your business.With this practical guide in your hands, you have the most powerful tool available for increasing your productivity quickly and dramatically--in a way that is noticeable and measurable.The Product Manager's Survival Guide is conveniently organized into four sections:I. Getting Your Bearings:  Map out your plan to begin the journey to successII. Learning the Product's Business:  Go beyond features and functions to become the product expert, customer advocate, and domain expertIII. Getting Work Done:  Synchronize and orchestrate the work of others to help everyone maintain focus on company goalsIV. Moving Forward:  Round out your experience to take the next critical steps in your Product Management careerThe only way to excel as a product manager is to develop a strategy for the long run. Start formulating one now and you will be well ahead of your competition--internally and externally. The Product Manager's Survival Guide gives you the tools and insight you need to start putting the pieces in place now--so you can succeed well into the future.",
  "genres": [
    "Business",
    "Nonfiction",
    "Management",
    "Technology"
  ],
  "author": "Steven Haines",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/17118699-the-product-manager-s-survival-guide"
}