{
  "title": "The House Of Lanyon",
  "description": "When two ambitious families occupy the same patch of English soil, rivalry is sure to take root and f lourish. A glimmer of initiative swells into blind desire, and minor hurts, nursed with jealousy, fester into a malignant hatred. When a bitter feud is born the price for this wild and beautiful piece of ground will take more than three generations to settle.Richard Lanyon answers to no one save the aristocratic Sweetwater family, owners of the land he farms. His bitter resentment is legend within the bounds of their tiny Exmoor community, but as their tenant, Richard Lanyon must do their bidding. Still, even noblemen do not have the power to contain ruthless ambition, and the Sweetwaters are no exception. Driven to succeed, Richard is prepared to take what is not his, and to forfeit the happiness of his family to claim the entitlements he lusts for.But no family can grow and succeed without the nurturing hand of a woman, and even Richard Lanyon knows this. Better still if the woman is clever and hardworking and can bear many sons, and with this in mind Richard arranges a marriage for his only son, Peter. But matches based on pragmatism often hide a multitude of sins, and so it is within the house of Lanyon. Although Peter and his bride, Liza Weaver, settle into marriage, each harbors a broken heart, lost dreams and unspoken secrets. And should their secrets ever be revealed, all that Richard has worked for will be destroyed.Surviving the betrayals of the past means keeping one foot in the present, and an eye to the future. For it is the next generation that holds the power to achieve in one moment what eluded Richard Lanyon for a lifetime.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "British Literature",
    "15th Century",
    "Tudor Period",
    "Historical Romance"
  ],
  "author": "Valerie Anand",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/1712351.The_House_Of_Lanyon"
}