{
  "title": "Stalking Love",
  "description": "Another romantic thriller from one of Amazon’s bestselling authors. This murder mystery set inside the world of real estate involves a hot romance, one that will even satisfy those who love the fifty shades of Grey, between a realtor and a mortgage broker who is fifteen years younger than she is. While they have issues to be worked through, they must first survive the serial killer who is still on the loose.  Sometimes when you think your career has provided you with everything you would ever want, life has a way of opening your eyes to what little you actually have. While finding and accepting love can be the biggest challenge of a life time, revealing secrets can be dangerous. So, can it be possible to admit what is really important and toss away a life time of work to lock in on love?  WORDS OF PRAISE FORJOHNNY RAY'S NOVELS Johnny Ray, a master of romantic suspense, never disappoints his readers. His books are guaranteed to grab you and not let go. If you like a little suspense with your romance, try Johnny Ray. Single Titles Book Reviews  Johnny Ray has the unique ability to blend intense thrillers with hot romances, making him one writer you definitely want to follow ---- KINDLE BOOK PROMOS Johnny Ray is able to really bring out just what we need in a good romantic thriller. There was a lots of mystery.....who was doing what?.... who done it?....you will be kept wondering up until the very end of this read---- Arlena Dean, book reviewer Johnny Ray is a great writer and an even nicer person. His willingness to help other writers out in their pursuits is a pleasure for everyone involved ---- Author Brian Brown Johnny Ray is quickly making a name for himself as the master of the romantic thriller---- JT Kalnay is a writer and a patent attorney Johnny Ray is one author you won't want to miss. He writes suspense and adds a touch of romance. And....who doesn't like a little romance? Add Johnny Ray to your list of \"must\" check out for the new year.----SILVER'S REVIEWSJohnny Ray offers interesting stories, likeable characters, well developed plots, and satisfying endings in his fun-to-read, fast-paced novels. My favorite is Journey to Whitestone with a metaphysical conspiracy storyline---HOT CHOCOLATE, IT'S A MYSTERY BLOG   STALKING LOVEBYJohnny Ray  STALKING LOVE is a 94,000 word romantic thriller set in St. Petersburg, Florida during the current real estate crisis. With a serial killer targeting people involved in the real estate business, and a potential love of a lifetime in the works, it takes all of the strength and courage of a woman thought to have it all, but lacking everything that really matters to grow and develop into who she is destined to become.As Rachel Contino, a proficient, thirty-eight year old realtor, attempts to avoid the real estate meltdown caused by her main client, developer Jonathan Harrell who had died in an apparent suicide, new evidence surfaces that it wasn’t a suicide but murder. This is soon followed up by the murder of Jonathan’s partner. These murders inside a condo complex hosting her largest number of listings makes her sales all but disappear, forcing her into deeper financial problems. In addition to her financial situation, she is scared that the murderer may be targeting her next.Meanwhile, Rachel, who has no time for a life outside of her profession, meets Carlos Martinis, a twenty-three year old mortgage broker, and yields to the teasing of her friends in attempting to make this stud her boy toy.",
  "genres": [
    "Romantic Suspense"
  ],
  "author": "Johnny Ray",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/17130366-stalking-love"
}