{
  "title": "Limonov",
  "description": "Limonov non è un personaggio inventato. Esiste «è stato teppista in Ucraina, idolo dell'underground sovietico, barbone e poi domestico di un miliardario a Manhattan, scrittore alla moda a Parigi, soldato sperduto nei Balcani; e adesso, nell'immenso bordello del dopo comunismo, vecchio capo carismatico di un partito di giovani desperados. Lui si vede come un eroe, ma lo si può considerare anche una io sospendo il giudizio» si legge nelle prime pagine di questo libro. E se Carrère ha deciso di scriverlo è perché ha pensato «che la sua vita romanzesca e spericolata raccontasse qualcosa, non solamente di lui, Limonov, non solamente della Russia, ma della storia di noi tutti dopo la fine della seconda guerra mondiale». La vita di Eduard Limonov, però, è innanzitutto un romanzo di al tempo stesso avvincente, nero, scandaloso, scapigliato, amaro, sorprendente, e irresistibile. Perché Carrère riesce a fare di lui un personaggio a volte commovente, a volte ripugnante – a volte perfino accattivante. Ma mai, assolutamente mai, mediocre. Che si trascini gonfio di alcol sui marciapiedi di New York dopo essere stato piantato dall'amatissima moglie o si lasci invischiare nei più grotteschi salotti parigini, che vada ad arruolarsi nelle milizie filoserbe o approfitti della reclusione in un campo di lavoro per temprare il «duro metallo di cui è fatta la sua anima», Limonov vive ciascuna di queste esperienze fino in fondo, senza mai chiudere gli occhi, con una temerarietà e una pervicacia che suscitano rispetto. Ed è senza mai chiudere gli occhi che Emmanuel Carrère attraversa questa esistenza oltraggiosa, e vi si immerge e vi si rispecchia come solo può fare chi, come lui, ha vissuto una vita che ha qualcosa di un «romanzo russo».",
  "genres": [
    "Nonfiction",
    "Biography",
    "France",
    "Russia",
    "History",
    "French Literature",
    "Literature"
  ],
  "author": "Emmanuel Carrère",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/17130345-limonov"
}