{
  "title": "The Hundred Day Winter War: Finland's Gallant Stand against the Soviet Army",
  "description": "When the Red Army invaded Finland in November 1939 most observers expected a walkover. Instead, in a gallant stand that captured the world’s imagination, the tiny Finnish army was able to hold off Stalin’s mechanized echelons for 105 days. Gordon F. Sander peels away the layers of myth surrounding this Nordic Thermopylae to reveal the conflict in its full military, political, and cultural contexts. A bestseller in Finland, the English-language version of Sander’s book draws on interviews with both Finnish and Russian veterans of the war, in addition to a bountiful archive of articles from both the Western and Finnish press, to create the most comprehensive and up-to-date single-volume history of the war.Written in “real time” to give the reader a you-are-there feeling, the book describes the Finns’ stunning defeat of the Soviets’ initial massive offensive, including the destruction of several Red divisions by Finnish ski troops; the deceptively calm January interregnum, when the two sides engaged in a complicated diplomatic minuet; and the final, titanic Red assault itself, which finally drove the Finns to the peace table—though not before they had forged one of the great legends of modern military history.Using his intimate knowledge of Finland and Finnish history, the author explains how the Finns’ winter skills, their innate sisu, or toughness, and their devotion to both their young republic and their brilliant and inspiring commander-in-chief, Gustav Mannerheim, together enabled them to make their historic stand.Sander explores such oft-ignored aspects of the conflict as Finnish press censorship; the abortive Allied “rescue mission” across Scandinavia that was a factor in Stalin’s surprising decision to bring the war to a halt; the Kremlin’s novel use of paratroopers in the war; and the pivotal role played by the Lotta Svard, the Finnish all-purpose women’s auxiliary. Illustrating Sander’s fast-paced text are nearly 50 photographs, including numerous never-seen-before images of both the battlefront and the home front.Hailed by Helsingin Sanomat, Finland’s leading daily, as “a bittersweet morality play” that “opens up this quintessentially Finnish tale to a much wider and admiring readership” and by STT, Finland’s leading news agency, as “an outstanding book that combines brilliant writing with a rock-solid factual foundation,” Sander’s compelling book fills a key gap in the record of the Second World War.",
  "genres": [
    "History",
    "Nonfiction",
    "World War II",
    "Military History",
    "War",
    "Russia"
  ],
  "author": "Gordon F. Sander",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/17130644-the-hundred-day-winter-war"
}