{
  "title": "Rock 'n' Roll Promises",
  "description": "This edition of the book is no longer available.The Beginning of a new existence and the creation of a whole new animal.Fulfilling a promise leads to searching her soul, her past, and the one night that changed her life forever...Young, vibrant and with her whole life in front of her, Anna is looking forward to ringing in the new year at her favorite bar. Dressed to the hilt, ready for a great night, she meets Sebastian-Tall, mysterious and handsome. Her one-night stand turns into a one-life exchange! The beginning of a new existence. Anna finds her new life holds more than even she knows. It promises rock n roll, sex, love,secrets and a new set of rules. She embraces her new found self and learns to adapt. Anna, and her best friend, Paige, move back home to the states and live as normally as they can. As they say, best laid plans and all...Life has a different plan and yet another set of rules. Rules that even she breaks. The creation of a whole new animal.Your invited to tag along on Anna's magic carpet ride and experience her life, as it promises plenty of rock n' roll mixed with the fear of an unnatural forever. Her Rock n' Roll fantasy may never die, but will she?Just look at her! Who does she think she is? Strutting in with her wavy shoulder length brown hair, framing a heart shaped face and Lavender eyes. Wearing a size 8 Leather outfit as she enters the paranormal arena throwing up Rock Horns, followed by her motley looking crew:Paige Hendrix- The tall, long blonde haired, blue eyed best friend.Oliver Zane \"Ozzie\"- The bad boy supernatural/paranormal hunter who is dating the best friend and perhaps the only human in the group.Jaxson- The scruffy haired man with chocolate mousse eyes whom she is in love with but cannot have. Although, he begs to differ.Sebastian-The tall, pale, and handsome dreamboat that dances his way into her arms and steals the only life she knows.I will tell you who she is, Anna Skott! The newest face on the scene and the most promised to be on everyone’s lips. She’s not your average Jane and not your stereotypical Vampire. Her persona is way cooler than humans and a totally different breed in the vampire world. Anna is truly a one of a kind.",
  "genres": [
    "Paranormal",
    "Romance",
    "Amazon",
    "New Adult",
    "Vampires"
  ],
  "author": "AmBear Shellea",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/17130831-rock-n-roll-promises"
}