{
  "title": "More than They Bargained For: Scott Walker, Unions, and the Fight for Wisconsin",
  "description": "When Wisconsin became the first state in the nation in 1959 to let public employees bargain with their employers, the legislation catalyzed changes to labor laws across the country. In March 2011, when newly elected governor Scott Walker repealed most of that labor law and subsequent ones—and then became the first governor in the nation to survive a recall election fifteen months later—it sent a different message. Both times, Wisconsin took the lead, first empowering public unions and then weakening them. This book recounts the battle between the Republican governor and the unions.            The struggle drew the attention of the country and the notice of the world, launching Walker as a national star for the Republican Party and simultaneously energizing and damaging the American labor movement. Madison was the site of one unprecedented spectacle after 1:00 a.m. parliamentary maneuvers, a camel slipping on icy Madison streets as union firefighters rushed to assist, massive nonviolent street protests, and a weeks-long occupation that blocked the marble halls of the Capitol and made its rotunda ring.            Jason Stein and Patrick Marley, award-winning journalists for the Milwaukee Journal Sentinel, covered the fight firsthand. They center their account on the frantic efforts of state officials meeting openly and in the Capitol's elegant backrooms as protesters demonstrated outside. Conducting new in-depth interviews with elected officials, labor leaders, police officers, protestors, and other key figures, and drawing on new documents and their own years of experience as statehouse reporters, Stein and Marley have written a gripping account of the wildest sixteen months in Wisconsin politics since the era of Joe McCarthy. They offer new insights on the origins of Walker's wide-ranging budget-repair bill, which included the provision to end public-sector collective bargaining; the Senate Democrats' decision to leave the state to try to block the bill; Democrats' talks with both union leaders and Republicans while in Illinois; and the reasons why compromise has become, as one Republican dissenter put it, a \"dirty word\" in politics today.“Stein and Marley, veteran reporters with enviable access, have penned the definitive journalistic account of the Wisconsin uprising, especially as it played out in the state Legislature. They make it a story about individuals, not titanic forces.”—Wisconsin Watch“Stein and Marley deliver an impressively objective account of the struggle, ably describing the objectives and tactics of each side in a confident and engaging style.”—Kirkus Reviews“Stein and Marley deliver a swashbuckling tale of Wisconsin's Republican Governor Scott Walker's election and tumultuous first year in office. . . . Instead of an expected dry read, the authors' lively, economical prose, supplemented by snippets of social media reporting in real time, place readers in the crowded Capitol building stairwells, or in the midst of Wisconsin's largest sustained demonstration since Vietnam protests rocked the University of Wisconsin campus.”—Publishers Weekly“This book is a political thriller, an activists’ handbook (for the Left on how to organize mass protests, and for the Right on how to effectively fight public employee unions), and a work of investigative journalism all rolled into one. Social scientists, political junkies, and anyone interested in public affairs will devour it.",
  "genres": [
    "Politics",
    "History",
    "Nonfiction",
    "Labor",
    "Local History",
    "Journalism"
  ],
  "author": "Jason Stein",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/17133238-more-than-they-bargained-for"
}