{
  "title": "Other People's Baggage",
  "description": "Baggage claim can be terminal when a computer glitch mislabels identical vintage suitcases. This is what happened after three women with a knack for solving mysteries each grabbed the wrong bag. MIDNIGHT ICE: When interior decorator Madison Night crosses the country to distance herself from a recent breakup, she learns it's harder to escape her past than she thought, and diamonds are rarely a girl's best friend. SWITCH BACK: Ballantyne Foundation director Elliott Lisbon travels to Texas after inheriting an entire town, but when she learns the donor was murdered, she has to unlock the small town's big secrets or she'll never get out alive. FOOL'S GOLD: When a world-famous chess set is stolen from a locked room during the Edinburgh Fringe Festival, historian Jaya Jones and her magician best friend must outwit actresses and alchemists to solve the baffling crime.Part of the Henery Press Mystery Series Collection, if you like one, you'll probably like them all! OTHER PEOPLE’S BAGGAGE is the first in the humorous mystery novella collection series. Praise for OTHER PEOPLE’S BAGGAGE:“A cozy triple-scoop that tastes divine… the pleasantly contrasting novellas make it easy to finish off a story in one sitting, plus each novella serves as a prequel to the respective author’s full-length work.” – Library Journal“Lost luggage has never been this fun! With well-drawn characters, Other People's Baggage is your first class ticket to three fast-paced adventures full of mystery, murder, and magic.” – Elizabeth Craig, Author of the Southern Quilting Series\"Kendel Lynn's Switch Back is a clever, entertaining mystery with small town flavor and Texas flair!\" – Debra Webb, USA Today bestselling author“What do you get when you mix Doris Day with a dash of Texas two-step, then stir in a smidgen of Edinburgh, secret chambers, and magic? A recipe for fun entitled, Other People's Baggage. Although mixed up luggage is the thread that connects this trio of globetrotting novellas, it's snappy dialogue, clever storytelling, and charming characters that are the real common denominators… Writing in tandem with other authors is difficult work, but Lynn, Pandian, and Vallere make the pursuit seem effortless. I'm already hooked on their three new mystery series, and I've only read the prequels!” – Maddy Hunter, bestselling author of the Passport to Peril Mystery series“Those who enjoy travel and mysteries like myself will definitely enjoy reading Other People’s Baggage, three novellas about female sleuths who solve two thefts and a murder while coping with an airport mixing up their three bags. The mix-ups are a creative theme for tying the stories together, and I loved seeing how each sleuth dealt with the problem. A very fun collection!” – Beth Groundwater, Author of the Claire Hanover Gift Basket Designer and RM Outdoor Adventures Mystery Series“I enjoyed this book immensely…They are all delightfully different protagonists and all are definitely in the Cozy Mystery genre, which I love…Most of us are always looking for a great new series or author to read. This introduces three of them. Five stars out of five.” – Lynn Farris, National Mystery Review Examiner at Examiner.com",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "Fiction",
    "Amateur Sleuth",
    "Short Stories",
    "Anthologies",
    "Chick Lit"
  ],
  "author": "Kendel Lynn",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/17133804-other-people-s-baggage"
}