{
  "title": "Vanished: The Michael Dunahee Story",
  "description": "In March 1991, Michael Wayne Dunahee was abducted from a Victoria, BC playground, virtually in front of his parents' eyes. Police were alerted within minutes of Michael's disappearance, and a full-scale search of the area was initiated immediately, but with no witnesses to the crime, law enforcement was stymied. There was no sign of Michael anywhere. The entire city of Victoria quickly mobilized to expand the search for Michael, and Child Find BC and other missing children organizations took up the cause. Very soon Michael's face and the story of his abduction were known throughout North America and eventually around the world, as missing child posters were disseminated and details of his abduction were broadcast via every available media outlet, including five appearances on America's Most Wanted. The Michael Dunahee case initiated the largest missing-child investigation in Canada at the time and raised awareness about child safety and child exploitation issues for both parents and the public at large. The Dunahee family, devastated at the loss of their son, nevertheless endured and focused their energy on helping other families undergoing similar tragedy. Working with Child Find BC and Child Find Canada, and supporting initiative such as the AMBER Alert system and the missing persons DNA database, have given them the strength to carry on and rebuild their lives. They threw their support behind annual fundraising and awareness raising events such as the annual Keep the Hope Alive fun run and the Tournament of Hope, with proceeds from both going to support the work of Child Find BC. In spite of nearly 22 years without answers as to what happened to Michael, they still maintain hope that he will one day be returned safely to them; and that steadfast belief has been an inspiration for families of missing children everywhere. Vanished includes an extensive appendices with details on technological advances in finding missing children, tips on preventing child abduction and exploitation, what to do when a child goes missing or a missing child is seen, as well as complete list of Child Find offices in Canada. Part of the proceeds from the sale of this book are being donated to Child Find BC.",
  "genres": [
    "Nonfiction",
    "True Crime"
  ],
  "author": "Valerie Green",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/17134364-vanished"
}