{
  "title": "Patrimony",
  "description": "In this new Pip & Flinx thriller, Alan Dean Foster displays the brilliance that has made him one of the brightest lights in science fiction. In Patrimony, fans will learn more about their favorite redhead–with emerald eyes, uncanny powers, and a poisonous minidrag–than they ever dreamed possible.“I know who your father is . . . Gestalt.” A shocked Flinx hears these dying words from one of the renegade eugenicists whose experiments with humans twenty-odd years ago shocked the galaxy . . . and spawned Flinx. So Flinx and his minidrag, Pip, venture to Gestalt, an out-of-the-way planet perfect for someone who never wants to be found–disregarding the advice of those who think Flinx could make better use of his time locating the ancient, sentient weapons platform that could be the galaxy’s only chance of stopping the exterminating scourge that’s fast approaching. Flinx might agree with them–but the quest for patrimony wins out. (Sorry, galaxy!)Could Gestalt supply the key to Flinx’s shadowy past and strange powers? An eccentric loner in a remote area could be the father Flinx has never stopped searching for, perhaps the only person who can unravel the mystery of his birth and his amazing, agonizing powers. An eccentric longer in a remote area of the distant planet could be he father Flinx has never stopped searching for, perhaps the only person who can unravel the mystery of Flinx’s birth and his amazing, agonizing powers.Unfortunately for Flinx, Gestalt also hosts a resident bounty hunter who’s just learned about the stupendous reward offered for a certain dead redhead. Flinx gets a chance to test his adversary’s skills when our hero’s skimmer is blasted out of the sky and into a raging river in the middle of nowhere–a nowhere of impassable terrain and ravenous, carnivorous beasts.But hey, what’s one more impossible challenge for someone who’s spent his life defying the odds and escaping the inescapable? Flinx has one thing going for him . . . plenty of experience.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Fantasy",
    "Space Opera",
    "Science Fiction Fantasy",
    "Adventure",
    "Audiobook"
  ],
  "author": "Alan Dean Foster",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/171480.Patrimony"
}