{
  "title": "The Anti-Vampire Tale",
  "description": "Simon is a vampire, prowling through the dark New Orleans streets that pulse with wild adventure and fangs gleaming in the shadows. He’s spent the last few decades as a recluse, aching over a lost love. Now, he’s put it behind him, thirsting to fulfill the raging inner need he’s deprived himself for so long.Ruby feels isolated and out of place—lonely, shy, but too strong-minded to go along with the crowd. All that changes when she is dragged out for her birthday and ends up dancing with Simon—mysterious, blue-eyed, and gorgeous. Her body tingles watching his muscled form move—so fast, so smooth, so powerful. His smile is otherworldly, and his kiss charges her with electric energy. All seems to be going well until three other vampires appear in the crowd, turning the dance floor into a horror show.The other vampires, led by the vicious Roderick, are after a new fix—the new breed. It’s a mix of blood and something secret that’s driven them to a desperate addiction, making them reckless and willing to tear anyone apart to get to it, and Ruby’s best friend, Ambrosia, has something they need to make it. When Ambrosia flees New Orleans for her life, they relentlessly hunt the one person who knows where she Ruby.Stalked by ravenous vampires at every turn, Ruby’s only hope for survival is her handsome new love. Through crowded dance floors, wild forests, high-speed car races, and even into Roderick’s horrific dwelling filled with hostile vampires, Simon risks his life trying to keep her safe while being outnumbered at every turn and mesmerized by her every second—even while facing death, danger, and darkness.PRAISE for LEWIS \"Lewis's hold-your-breath style of descriptive writing will keep you swimming in his creative vocabulary for hours...multi-layered metaphors...elaborate prose...\"--Alex Hutchinson - Blogcritics, January 22, 2008\"There is craftsmanship in Aleman's details; elaborate use of adjectival simile and metaphor ... stimulates ... memorable ...\"--Where Y'At Magazine, Dionne Charlet, February 2010\"...adventurous, fast paced...loved the twists and turns...Lewis writes beautifully, his work is filled with great detailed descriptions...a great adventure. I haven't seen anything out like it.\"--La Femme Readers, December 12, 2009\"Aleman's unique writing style captures the reader from page one...takes the reader through a dark journey...\"\"An enthralling story of vengeance, Cold Streak is deftly written and a must for thriller fans...\"-- Midwest Book Review, June 2008",
  "genres": [
    "Vampires",
    "Paranormal",
    "Young Adult",
    "Fantasy",
    "Romance",
    "Fiction",
    "Urban Fantasy"
  ],
  "author": "Lewis Aleman",
  "average_rating": "3.41",
  "url": "https://www.goodreads.com/book/show/10085435-the-anti-vampire-tale"
}