{
  "title": "The Bird Artist",
  "description": "Though judging a book by its cover is ill-advised, assessing The Bird Artist by its first paragraph is a safe bet. Howard Norman's second novel lives up to all expectations promised by the kind of beginning that makes a reader beg for more and then panic that the rest will not be as good: \"My name is Fabian Vas. I live in Witless Bay, Newfoundland. You would not have heard of me.\" \"Obscurity is not necessarily failure, though; I am a bird artist, and have more or less made a living at it. Yet I murdered the lighthouse keeper, Botho August, and that is an equal part of how I think of myself.\" There are echoes of Vladimir Nabokov's infamous narrator, Humbert Humbert, in Fabian's confessional tone, witty humor, and emotional detachment from the series of bizarre events he describes. Set at the turn of the century in a remote cod-fishing community, The Bird Artist is a love story of sorts, filled with curious characters and a chowder restaurant. The men wear \"knitted underwear all year round lined with fleece calico\" and periodically escape the island to pursue their livelihoods on the sea. But the women are land bound. Helen Twombly suspects fellow villagers of stealing her milk bottles. Alaric Vas suffers from arthritis that no liniment relieves and plots her son's arranged marriage with a fourth cousin in Richibucto, New Brunswick. Meanwhile, Fabian's childhood love, Margaret Handle, propels herself and the plot forward with unwieldy energy. How did things for a mild-mannered man who just likes \"to wake up early, wash my face, and get out and draw birds\" go so wrong? Norman, a folklorist and naturalist, presents us with the possible explanations in the form of fine details from an island life he researched while living in a remote Inuit whale-hunting community. He carefully examines the inner isolation of his characters. The severe landscape and the weather serve as the perfect metaphor. If you're looking for linguistic pyrotechnics, Norman's economy won't suit you. In The Bird Artist--a finalist for the 1994 National Book Award--there is as much to admire on the page as what's not. --Cristina Del Sesto",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Canada",
    "Mystery",
    "Literary Fiction",
    "Book Club",
    "Literature"
  ],
  "author": "Howard Norman",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/1715201.The_Bird_Artist"
}