{
  "title": "Epic Adventure of Shiva, the Destroyer of Tripura",
  "description": "Long before the global catastrophe of great floods (also known as Pralay in the scriptures) wiped out most of humanity, advanced prehistoric civilisations of the ancients spanned tropical landscape of planet Earth. Legendary order of spiritual knights known as ‘Bheeshma’ is the final hope of Devarth federation, as they face imminent invasion and subjugation by Daityan empire. In order to wield the ancient weapon 'Pinaka' against central seat of Daityan power (the indestructible citadels of Tripura), warrior monk Haŕa (Shiva) needs to undertake an arduous and dangerous journey to the mysterious Mount Kailash. Battling his grief over a personal tragedy as well as many self-doubts and fears, he must cross the barrier of death itself and face the spiritual personae of Lord Rudŕa…Traversing through many exotic ancient places like Amaravati, the capital city of Dev Lok and Atalantpuri, the capital of Atala (Atlantis), this epic adventure story also attempts to unfold the philosophy of Yoga and Vedanta.Background Theme of the Book:-While it’s not an exact retelling, this story takes inspiration from ancient scriptures of India, especially about Lord Shiva’s role as Tripurantaka - destroyer of the triple cities of Tripura. The scripture known as Shiva-Puran actually describe Tripura to be built on large mobile platforms high up among the clouds. Highly advanced in terms of technology, these city structures defied gravity and could even fly across the skies around the planet, like orbiting space stations. It’s said that the prosperous occupants of these sky-cities had eventually degenerated to decadence, greed, arrogance and violence, which led to their destruction by Shiva. In many ways, the story of ‘Tripura’ from Indian mythology is also similar to that of ‘Atlantis’ from Greek mythology.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Historical Fantasy",
    "Historical Fiction",
    "Asian Literature"
  ],
  "author": "M. Vizhakat",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/17154783-epic-adventure-of-shiva-the-destroyer-of-tripura"
}