{
  "title": "Trace Evidence",
  "description": "Award-winning author Robert Banfelder's newest thriller was inspired by the Robert Shulman serial killer trial, which gripped Long Island, NY residents in the 90's.Brothers Howard and Jeffrey Mills are suspects in the bludgeoning and dismembering murders of three prostitutes. Homicide detectives zero in on Howard as their primary target. An avalanche of forensic evidence leaves no doubt in anyone's mind that the women were killed in Howard's one-room rental. But is Howard Mills the murderer? Extraordinary pressures are applied by the district attorney's office for the police to quickly ensure a confession so as to deem Howard death penalty qualified. Homicide Detective Gary York misrepresents himself as an attorney who promises to help Howard by getting him into a mental hospital if he confesses. Howard accepts the offer but is left hanging in the wind at his arraignment, believing that he is legally well-represented. The defendant is found guilty and sentenced to die by lethal injection. However, Detective York's suspicions are raised that eventually point in another direction. The motive is money and invaluable properties-a veritable fortune if Jeffrey can successfully manipulate Howard into relinquishing his assets . . . sooner than later.\"Trace Evidence\" is based on Long Island, New York's first death penalty case in nearly a quarter century-the Robert Shulman serial killer trial-1998. On a daily basis, the author spent fifteen months following pretrial, jury selection, trial, and penalty-sentencing phase; lectured at Kirby Forensic Psychiatric Center for the criminally insane, Ward's Island [where Shulman had been evaluated]. The author interviewed the head of Suffolk County Homicide, Detective Lieutenant John Gierasch, for the finishing fictional touches. While remaining true to many of the facts of the trial, Robert Banfelder brilliantly weaves his fictional account of murder and mayhem through the fabric of justice and injustices. The book is available online at https://www.amazon.com. Robert Banfelder is the author of \"No Stranger Than I.\" His Justin Barnes character novels, \"The Author\" and \"The Teacher,\" received Best Suspense Novel awards in 2006 and 2007. As an investigative reporter, Banfelder wrote articles and editorials concerning our criminal justice system. Along with journalist Mike Taibbi of CBS News and attorney Mark Baker of Barry Slotnick's office, Banfelder worked to obtain the release of an innocent man from prison. Banfelder gives extensive talks on the phenomenon of multiple murderers, addresses the writing process, imparts anecdotal information about his observations and experiences regarding the Robert Shulman serial killer trial, and excerpts from his novels. Robert's nonfiction writings, along with four of his novels, include his love of the great outdoors. For more information about Robert Banfelder, visit https://www.robertbanfelder.com.",
  "genres": [],
  "author": "Robert Banfelder",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/17155026-trace-evidence"
}