{
  "title": "Life Code: The New Rules For Winning in the Real World",
  "description": "The rules for living in the real world have changed, because the world we live in has changed. Much of the conventional wisdom the last generation has passed on just doesn’t apply like it once did. If you want to win, and win big, and, more importantly, keep what you work so hard for, you need a crystal-clear view of how the real world works — not how you wish it worked, but how it actually works.In Life Code: The New Rules for Winning in the Real World, six-time New York Times #1 best-selling author Dr. Phil McGraw abandons traditional thinking and tells you the ugly truth about the users, abusers, and overall “bad guys” we all have in our lives. He also reveals the secrets of how they think and how they get to and exploit you and those you love. You’ll gain incredible insight into these negative people, which he refers to as BAITERs (Backstabbers, Abusers, Imposters, Takers, Exploiters, Reckless), and you’ll gain the tools to protect yourself from their assaults. Dr. Phil's new book gives you the “Evil Eight” identifiers so you can see them coming from a mile away, as well as their “Secret Playbook,” which contains the “Nefarious 15” tactics they use to exploit you and take what is yours mentally, physically, socially and professionally. Life Code then focuses on you and your playbook, which contains the “Sweet 16” tactics for winning in the real world.Edgy, controversial and sometimes irreverent, Dr. Phil again abandons convention to prepare you to claim what you deserve and claim it now. You take flying lessons to learn to fly, swimming lessons to learn to swim, and singing lessons to learn to sing. So, why not take winning lessons to learn to win?If you read this book, you’re going to have a huge leg up on the competition, regardless of whether you’re competing for a job, a spouse, a social position, or friends. You are going to have a well-thought-out, passion-fueled strategy built on the skills and confidence that flow from rolling up your sleeves and learning what others simply do not know. By the time you finish this book, you’ll have the power to define success in your life, the ability to spot potential obstacles to your success, and the tools you can immediately implement to get and protect exactly what you want in this life. If you’re stuck in old thinking about hard work, patience and “playing by the rules,” you are about to learn how to “play big” and be the star of your own life. Life Code: The New Rules for Winning in the Real World was written for you.",
  "genres": [
    "Self Help",
    "Nonfiction",
    "Psychology",
    "Personal Development",
    "Audiobook",
    "Reference",
    "Relationships"
  ],
  "author": "Phillip C. McGraw",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/17155775-life-code"
}