{
  "title": "Tenebrae",
  "description": "The narrator of Tenebrae inhabits a decaying, desolate mansion in the remote and wild countryside with his younger brother and their mad old uncle, driven insane by abuse of opium and alcohol. This nameless narrator is a morbid young man who passes most of his time in a room painted all black, poring over arcane manuscripts dealing with the mysteries of death, while sipping garishly coloured liquors brewed by his uncle or cups of coffee flavoured with arsenic. When he falls in love with a neighbour, he looks forward to marrying her and trading his life of despondency for one of joy. Perhaps unsurprisingly, though, she finds him rather unpleasant company and instead falls in love with his brother. Driven to murderous jealousy, he resolves upon a brutal crime. But after the consummation of his terrible act, he finds himself haunted by a huge, monstrous spider. Is it a delusion brought on by incipient madness? the reincarnated soul of his murdered victim, returned for vengeance? or does it foretell a fate even more horrifying than can be possibly imagined? Published in 1898, at the end of a decade in which English writers explored the literary possibilities of the Gothic with such characters as Dorian Gray, Dr Jekyll and Mr Hyde, Dracula, and The Beetle, Ernest G. Henham's weird horror novel Tenebrae is reminiscent of the works of Poe. Perhaps unequalled in its extreme darkness and gloom, and yet at times grimly, though possibly unintentionally, hilarious, Tenebrae remains one of the strangest productions of this fertile literary period. This newly typeset edition includes the unabridged text of the first edition, as well as an introduction and notes by Gerald Monsman, the foremost scholar of Henham (1870-1946), who later published under the name John Trevena. Also featured is a reproduction of the cover of the incredibly scarce first edition.",
  "genres": [
    "Horror",
    "Gothic",
    "Fiction",
    "Classics"
  ],
  "author": "Ernest George Henham",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/17155905-tenebrae"
}