{
  "title": "The Tragedy of Fidel Castro",
  "description": "Award-Winner in the Fiction: Multicultural category of The 2013 USA Best Book Awards, sponsored by USA Book News2012 ForeWord Book of The Year Awards Winner in Translations (Adult Fiction - Bronze)Nominated for the 2014 Montaigne MedalAward-Winning Finalist in the Historical Fiction category of The 2013 USA Best Book Awards, sponsored by USA Book NewsBeverly Hills Book Awards 2014 Winner in Multicultural FictionBeverly Hills Book Awards 2014 Finalist in Literary FictionWinner Global Ebook Awards 2014 - Fantasy Historical SettingWhen God receives a request from Fátima to help prevent a war between Fidel Castro and JFK, he asks his son, Jesus, to return to Earth and diffuse the conflict. On his island, Fidel Castro faces protests on the streets and realizes that he is about to be overthrown. Alone, surrounded, and aware that the end is fast approaching, he plays his last card. Meanwhile, Christ arrives on Earth and teams up with Fátima, who is convinced she can create a miracle to avoid the final battle between JFK and Fidel Castro and save the world as we know it. At the end, something really extraordinary happens!Humorous, rich with metaphor, and refreshingly imaginative, The Tragedy of Fidel Castro was chosen as the book-of-the-month and book-of-the-year by Os Meus Livros magazine.\"Joao Cerqueira's Tragedy of Fidel Castro is a phantasmagoric odyssey through a highly imaginative prose universe of discovery and inquest. It's a magic realism hybrid of sacrificial lambs and Revolution, capitalistic decadence, and celestial consequence -- in a dimension where the cogs of time got jammed. I expect that this rich and unique narrative voice will illuminate a phosphorescent trajectory in the future annals of the New Millennial World Lit!\"- Mark Spitzer - Toad Suck Review Editor, Professor of Writing at the University of Central Arkansas\"a smart, energetic and funny piece of writing.\"- Bethany Gibson, Fiction Editor of Goose Lane Editions\"Brilliant satire, playfully serious [...] do not waste even a single paragraph\"- Rita Bonet, Os Meus Livros\"João Cerqueira rewrote history, and did so with great inspiration!\"- Cita-Livros\"João Cerqueira shows a great imagination and a sense of humor far from innocent [...]\"- Blogue Bela Lugosi is Dead\"In my opinion there was only one Portuguese novel that had all the conditions to win the style of magical realism: The Tragedy of Fidel Castro\"- Blog Fanzine Tertuliando\"an imaginative author who masters metaphorical discourse and who can debate on national and international events, as well as both sacred and profane figures.''- Livros & Leituras",
  "genres": [
    "Politics",
    "Novels",
    "21st Century",
    "Humor",
    "Portuguese Literature",
    "Fiction"
  ],
  "author": "João Cerqueira",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/17156630-the-tragedy-of-fidel-castro"
}