{
  "title": "S&M - the Bundle",
  "description": "The BundleSensation and Magic Volumes 1 & 2 - PLUS an extra freebie FantasyRead the Chronicles of Jaylyn and Yvonne and their young apprentice as they journey through the sexual erotic adventures of submission, sensation and mastery in these two volumes.With a never before released story of Karolina and how you can add your own personal fantasy to her storyReviews from the first two volumes:This book is one of a kind, not the typical erotic book where sex and nothing but sex is the topic. This book have its good points; it is very educational not just for women but for guys too. This book will let you know how women want it to be on bed, how the performance matters, and the caress and touch that gives a tingling sensation. I like it because there's a story behind this book, a story about friendship and how crazy friends can be. This book is at the same time tempting, seducing, and sexy but not in a trashy way. As you continue on reading, you will feel sensations inside you. You might get carried away and that's how this book affects you. A sexy book to read, it can surely ignite something inside you especially if you read it before bedtime.................I so love the books written by this author and this one is no exception! In the second installment of Sensation and Magic, there is such an honesty that is portrayed in the journal that brings new meaning to sexy. As we follow the apprentice journey, each and every section is well-written, has immense depth, and brings to life characters that are easy to relate to. If you are looking for perfect women and men having unrealistic sexual encounters, you will be disappointed. But, if you want to read about the lives and fantasies from a very raw and real perspective, I am sure that you will love this book as much as I did..............I just finished reading this and I have to say that I thoroughly enjoyed it. I couldn't stop reading it until I got to the end (which was quite the ending, I might add). I have read Ms. Gibson's 4 other erotica books and after each one I want more. Forget about that 50 Shades or whatever that was called and get these books! Erotic Women's Journals - The First Three Books in One Volume and EROTICA- THE THEME PARK (Erotic Adventures - Women's Journals). These are the real deal! You will not be disappointed!",
  "genres": [],
  "author": "Germaine Gibson",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/17156919-s-m---the-bundle"
}