{
  "title": "Ghetto Medic: A Father in the 'Hood",
  "description": "Ghetto Medic: A Father in the 'Hood is the remarkable true story of the life of Bill Hennick, a firefighter and paramedic in Baltimore, Maryland, a city which today boasts the busiest fire stations in the United States. The story begins in 1945, when Bill, aged four, is badly burned in a terrible fire started by an older child playing with matches. When he reaches adulthood, he begins searching for his purpose in life and identifies fire as ''the enemy.'' He joins the still-segregated Baltimore City Fire Department at the height of the civil rights movement, witnesses the race riots of 1968 which followed the assassination of Martin Luther King, and battles the ensuing infernos.When the upper and middle classes abandon the city, Bill sees a ''wasteland'' and develops empathy for those people left behind. He tries to make a difference by becoming a paramedic, a service then in its infancy. His story is set against the history of Baltimore, known for its rich black heritage, the home of jazz legends such as Billie Holiday and Cab Calloway. He embarks on a spiritual journey as he risks his own life in caring for the poorest of the poor in a city with one of the world's highest crime rates.In this poignant biographical memoir about her father, Rachel Hennick tells a dramatic American story with vibrant characters, pathos and a twist of humor. Ghetto Medic penetrates the heart with a thought-provoking and universal message about the enduring power of compassion.http://www.amazon.com/Ghetto-Medic-Fa...“If H. L. Mencken were here he would say, ‘go out immediately and buy a copy of Ghetto Medic,’ for nobody knew more than Mencken about story telling, language refinement, or the city of Baltimore . . . This book is an absorbing tale, beautifully written.”—Dennis Smith, author of the bestseller Report From Engine Co. 82“Bill Hennick is an unsung hero in the history of Baltimore and in the battle against racism and segregation in the South . . . [A] remarkable story . . . vividly told.”—Lee Gutkind, Author and Editor, Creative Nonfiction Magazine“A beautifully written, instantly captivating account of one man’s unfaltering dedication to helping those in need.”—Craig Jurisevic, author of the Australian bestseller Blood on my Hands (soon to become a film produced by Academy Award winner Eva Orner)",
  "genres": [
    "Nonfiction",
    "Biography"
  ],
  "author": "Rachel Hennick",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/17157233-ghetto-medic"
}