{
  "title": "Santa Viking",
  "description": "A fun, romantic romp yule love! Meet a sexy tenth-century Viking hero and a modern day hero with a Viking heritage who both have the knack for making women melt . . . with holiday cheer. Merry Christmas from the Norse Pole.Bolthor's BrideBolthor the Skald has been there for his fellow warriors, both in battle and as a friend. Always the bridesmaid, never the bride, so to speak. This gentle giant, now scarred and retired from the fray, has never found a woman who loves him despite his rough appearance—and his poetry, which is woefully bad.Enter the sexy, Saxon widow Katherine of Wickshire Manor, a woman in need of a strong man to take care of her, her four children, not to mention about two hundred chickens, in the style none of her first three husbands could manage.When Viking meets Saxon, the sparks do fly.note: This short story was originally available on the author's website for free but have since been removed.A Viking For ChristmasBodyguard Erik Thorsson, a fiftieth generation Viking, meets Jessica Jones, dressed as a cute Santa Claus, when she stages a righteous attempt to rob the local Piggly Jiggly. All Jessica wants is a refund for a Burping Bear toy, which the store refuses to honor.Fortunately, or unfortunately, Jessica takes hostage another Santa in the store, Erik himself, after accidentally shooting the Little Debbie cupcake display. For the first time in five years, since his beloved wife died, Erik finds himself head over Santa boot heels in love, but how to convince Jessica that he's not her Christmas curse, but instead a Christmas miracle.note: This story was originally titled Naughty or Nice and published in The Night Before Christmas anthology",
  "genres": [
    "Romance",
    "Christmas",
    "Historical",
    "Contemporary",
    "Historical Romance",
    "Fiction",
    "Holiday"
  ],
  "author": "Sandra Hill",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/17157390-santa-viking"
}