{
  "title": "Rutherford Park",
  "description": "When headstrong Eleanor Grimsby arrives at the annual Rutherford Park summer house party she expects to find an Earl reputed unfit for his title, not a dashing young Lord with a devilish smile and wit to match her own. The infamous Earl of Rutherford, Lord Drayton, has spent a decade traveling abroad in what the gossip pits describe as “a life of dissipation”. This is not completely fair. True he hated his title and estates and felt them a great burden, and on occasion found himself in some healthy debacles, but nothing too outlandish for a young Earl! His mother demanded he return, and so he returned. Who could say he was not dutiful? By contrast Eleanor Grimsby is duty incarnate. She is the oldest of four orphaned, rich, beautiful sisters, who (thanks to a doting Aunt) are liberally educated and spoiled beyond reason. Full of spirit and fiercely loyal to her siblings, Eleanor Grimsby has made up her mind to reject love and marriage. When she meets Lord Drayton, the seeming antithesis of everything she knows and values, a mild house party is turned on its ear. But this summer of lavish masquerades and exotic garden parties is not as fun and lighthearted as it seems. Lord Drayton has returned to England a victim of fraud. His fortune is in jeopardy, his estates are in danger of bankruptcy, and his sole suspect is courting his own mother. The introduction of a beautiful and stubborn Eleanor Grimsby only further complicates matters. He is after all not planning to stay in dreary England, nor is he planning to fall in love. But it is too easy to exasperate Miss Grimsby, and her look of indignation all too becoming. How can a man resist such temptation? As Eleanor and Lord Drayton combat their desires, Drayton must also play detective as well as host and Eleanor must continually divert her younger sister from ruin. Rutherford Park, as the Grimsby sister’s Aunt says, “Will be left in shambles.”",
  "genres": [],
  "author": "Bettina Frank",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/17157628-rutherford-park"
}