{
  "title": "The Empress Rose",
  "description": "Which is being a victim or being a bitch?This is a question Rose Voss has been asking herself since her husband died, leaving her with a storm-wrecked house, four kids to raise, and an alcoholic brother-in-law living in a trailer in her backyard.Being a single working mom is never easy, but it's downright painful in Luscious, Missouri, where cattiness is a local pastime. For years, the neighbors have been watching and judging Rose's every move, and giving her a failing grade at every turn. In their minds, her son is a terrorist-in-training, her hydroponics farm is really a front for a large-scale marijuana operation... even walking from the car to the grocer's is bound to throw someone's nose out of joint. Whatever it takes to be popular here, Rose just doesn't have it.Things begin to change when a GoBuy superstore moves in and starts killing off the competition. Families are leaving, stores are closing, and time is running out. Luscious is desperate, and survival depends on recruiting help from the most successful business owner in Rose Voss.Now Rose has a decision to forgive past wrongs and work with her neighbors to rebuild the community, or leave everyone to reap what they've sown while she savors the sweet taste of revenge. What would you do?What readers are saying about The Empress Rose is a great character who learns from her mistakes and seeks to right them for the sake of her children. She gives hope to single working mothers who have to bear the burden and joys of raising a family while making ends meet. The Empress Rose has a strong cast of characters who show great development to the end.- Michelle Saxton, Petersburg, FLThe Empress Rose immediately caught my attention, and I was intrigued to learn more. I loved the idea of of one woman taking a dream and working hard to make a life after tragedy. Inspiring and encouraging.- Tara Schaneville, Estero, FLEastvedt writes with clarity, and she keeps the reader's interest. The story moves quickly with unpredictability and charm.- Millie Hinkle, Upland, CAVisit the author online at www.ChrisEastvedt.com.",
  "genres": [],
  "author": "Chris Eastvedt",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/10743661-the-empress-rose"
}