{
  "title": "The Bridge To Caracas",
  "description": "THE BRIDGE TO CARACAS is Volume one of THE KING TRILOGY, an epic story, spanning four tumultuous decades, of an inconvenient fortune and its catastrophic affect on a loving family.Stephen Douglass's knowledge of the Oil and Gas Industry is woven into a plot similar to John Grisham's tales of lawyers, judges, and the law. Both are terrific at storytelling at a brisk pace coming with a knowledgeable background. You will be educated as to the Oil and Gas Industry, especially the dark side of money making, and entertained by a romantic, engaging action story. This book belongs in a class with \"Unbroken\", \"Lost in Shangri-La\", \"In the Garden of the Beasts\", and other five star books that I have enjoyed this summer. (5 star review)Jim Servito shatters the hopes and aspirations of star-crossed lovers, Mike King and Karen Taylor, while simultaneously engineering a grand theft ranking as one of the largest and most audacious in Canadian and U.S. history. Cynical and remorselessly ruthless, he possesses a brilliant criminal mind, has enormous contempt for the law, police, governments, and the system in which they function. He assumes rules are for fools, and takes sadistic pleasure in breaking them. Using The Peace Bridge as his fulcrum, he steals $325,000,000 from the U.S. and Canadian governments, steals enormous quantities of gasoline by illegally installing valves in Golden National’s Buffalo refinery, then murders everyone who can implicate him.The setting is storybook perfect. The beautiful daughter of wealthy parents meets the handsome son of middle class parents. The two fall in love and assume they will marry and live happily ever after. History would prove their assumption wrong. Cruel twists of fate and the wrath of Jim Servito combine to prescribe a horrible nightmare for the two lovers, one that grows in intensity and ultimately leads them to prison, then a life and death confrontation with Servito in Caracas.Karen Taylor, tired of life in private school for girls, the endless doting of her wealthy parents, and the monotony of constant female company, wants out, to experience the real world, preferably on her own. Her priorities lead her to an endless love affair with Mike King, but his marriage to another woman leads her to a disastrous marriage to Jim Servito.Mike King has it made. A third generation medical candidate and gifted athlete, his future appears assured. He is going to be a doctor. It is the family tradition. Then, like the first snows of winter, everything changes. He falls in love with Karen Taylor, and decides he wants a future of his own, instead of the one tradition had prescribed for him. His heart is ripped from his body when Karen’s mother informs him that her daughter was killed when her airplane was hijacked in Athens and blown up in Syria. Saddened beyond all consolation, he plunges into his engineering studies with a consuming passion. Fate leads him to a doomed marriage to Barbara Larkin. The marriage is complicated when he discovers that Karen is alive. A chance meeting with Karen results in a torrid, but life-threatening affair. He relinquishes his successful career in big oil to launch what appears to be a once in a lifetime business opportunity. When Jim Servito and the Feds conspire to ruin his business, terminate his affair with Karen, and imprison both, the two lovers risk everything to violate their bail restrictions, covertly fly to Caracas, and end their nightmare.",
  "genres": [
    "Thriller",
    "Crime",
    "Romance",
    "Mystery",
    "Amazon",
    "Fiction",
    "Suspense"
  ],
  "author": "Stephen Douglass",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/17158441-the-bridge-to-caracas"
}