{
  "title": "The Odyssey",
  "description": "“A revelation. Never have I been so aware at once of the beauty of the poetry, the physicality of Homer’s world, and the moral ambiguity of those who inhabit it.” —SUSAN CHIRA, New York Times Book Review, “New & Noteworthy”“‘Each generation must translate for itself,’ T. S. Eliot declared. Emily Wilson has convincingly answered this hers is a vital Odyssey for the twenty-first century that brings into rhythmic English the power, dignity, variety, and immediacy of this great poem.” —LAURA SLATKIN, New York UniversityThis Norton Critical Edition  Emily Wilson’s authoritative translation of Homer’s masterpiece, accompanied by her informative introduction, explanatory footnotes, and book-by-book summaries.Four maps, created especially for this translation.Contextual materials including sources and analogues by Homer, Sappho, Pindar, and others. Also included are carefully chosen passages from (mainly) ancient texts that provide insight into The Odyssey and its reception by Plato, Aristotle, Ovid, Pseudo-Longinus, Lucian, Apollodorus, Heraclitus, Porphyry, Proclus, Hyginus, Dante Alighieri, Alfred Lord Tennyson, C. P. Cavafy, Derek Walcott, and Margaret Atwood.Nine critical essays addressing key topics—composition; representation of religion and the gods; class and slavery; gender; colonization and the meaning of home; trickery, intelligence, and lying; and more— essential to the study of The Odyssey. Essays by Robert Fowler, Laurel Fulkerson, Barbara Graziosi, Laura M. Slatkin, Sheila Murnaghan, Patrice Rankine, Helene P. Foley, Egbert J. Bakker, and Lillian Eileen Doherty are included.A glossary and a list of suggested further readings. About the SeriesRead by more than 12 million students over fifty-five years, Norton Critical Editions set the standard for apparatus that is right for undergraduate readers. The three-part format—annotated text, contexts, and criticism—helps students to better understand, analyze, and appreciate the literature, while opening a wide range of teaching possibilities for instructors. Whether in print or in digital format, Norton Critical Editions provide all the resources students need.",
  "genres": [
    "Fiction",
    "Poetry",
    "Mythology",
    "Fantasy",
    "School",
    "Literature",
    "Adventure"
  ],
  "author": "Homer",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/10085758-the-odyssey"
}