{
  "title": "Maggie & Me",
  "description": "BBC Radio 4 Book of the Week, Winner of the Stonewall Award and The Sunday Times  Memoir of the Year.\"Damian Barr sifts through the wreckage of a horrific childhood and manages to extract humour, generosity of spirit and ultimately joy. To say I loved it doesn't begin to convey the mixture of emotions - tears, laughter, anger - I felt while reading it.\" — Jojo Moyes. \"This amazing book tells the story of an appalling childhood with truth and clarity unsmudged by self-pity. It grips from beginning to end.\" — Diana Athill. Frank McCourt's Angela's Ashes meets Billy Elliot, Maggie & Me is a unique, tender, and witty memoir of surviving the tough streets of small town Scotland during the Thatcher years.October 12, 1984. An IRA bomb blows apart the Grand Hotel in Brighton. Miraculously, Maggie Thatcher survives. In small-town Scotland, eight-year-old Damian Barr watches in horror as his mum rips her wedding ring off and packs their bags. He knows he, too, must survive.Damian, his sister, and his Catholic mum move in with her violent new boyfriend while his Protestant dad shacks up with the glamorous Mary the Canary. Divided by sectarian suspicion, the community is held together by the sprawling Ravenscraig Steelworks. But darkness threatens as Maggie takes hold: she snatches school milk, smashes the unions, and makes greed good. Following Maggie's advice, Damian works hard and plans his escape. He discovers that stories can save your life and — in spite of violence, strikes, AIDS, and Clause 28 — manages to fall in love dancing to Madonna in Glasgow's only gay club.Maggie & Me is a touching and darkly witty memoir about surviving Thatcher's Britain; a story of growing up gay in a straight world and coming out the other side in spite of, and maybe because of, the Iron Lady.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "LGBT",
    "Scotland",
    "Queer",
    "Book Club"
  ],
  "author": "Damian Barr",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/17159976-maggie-me"
}