{
  "title": "Orr: My Story",
  "description": "One of the greatest sports figures of all time at last breaks his silence in a memoir as unique as the man himself. Number 4. It is just about the most common number in hockey, but invoke that number and you can only be talking about one player -- the man often referred to as the greatest ever to play the game: Bobby Orr.  From 1966 through the mid-70s he could change a game just by stepping on the ice. Orr could do things that others simply couldn’t, and while teammates and opponents alike scrambled to keep up, at times they could do little more than stop and watch. Many of his records still stand today and he remains the gold standard by which all other players are judged.  Mention his name to any hockey fan – or to anyone in New England – and a look of awe will appear. But skill on the ice is only a part of his story. All of the trophies, records, and press clippings leave unsaid as much about the man as they reveal. They tell us what Orr did, but don’t tell us what inspired him, who taught him, or what he learned along the way. They don’t tell what it was like for a shy small-town kid to become one of the most celebrated athletes in the history of the game, all the while in the full glare of the media. They don’t tell us what it was like when the agent he regarded as his brother betrayed him and left him in financial ruin, at the same time his battered knee left him unable to play the game he himself had redefined only a few seasons earlier. They don’t tell about the players and people he learned to most admire along the way. They don’t tell what he thinks of the game of hockey today. Orr himself has never put all this into words, until now. After decades of refusing to speak of his past in articles or “authorized” biographies, he finally tells his story, because he has something to share: “I am a parent and a grandparent and I believe that I have lessons worth passing along.”  In the end, this is not just a book about hockey. The most meaningful biographies and memoirs rise above the careers out of which they grew. Bobby Orr’s life goes far deeper than Stanley Cup rings, trophies and recognitions. His story is not only about the game, but also the age in which it was played. It’s the story of a small-town kid who came to define its highs and lows, and inevitably it is a story of the lessons he learned along the way.",
  "genres": [
    "Hockey",
    "Nonfiction",
    "Biography",
    "Sports",
    "Autobiography",
    "Memoir",
    "Canada"
  ],
  "author": "Bobby Orr",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/17159989-orr"
}