{
  "title": "Featherlight",
  "description": "The life of Jacque Winters has not been easy. After being abused by her father and shutting herself off socially, she was kidnapped by strangers. The good news is that her kidnappers are kind. The bad news? She is now forced to live in a society controlled by men, which is practically her worst nightmare.Despite her promises to never fall in love, one man is proving those promises to be extremely difficult to keep. He chips away at her barriers with kindness, and soon he may have access into her heart. On her pursuit of happiness, Jacque realizes that in order to truly be satisfied with life, she'll have to come to terms with her past.She needs to figure out whether her future is worth sacrificing in order to save the life she had left behind.Excerpt:It was a good thing I never listened to evil temptations.I held out my hand, and he took it. His grip was warm, strong, and forcibly relaxed. John’s touch didn't give my stomach butterflies or send electricity racing through my body. Instead, it ignited a flame of fear inside my heart. Here was a man who was strong enough, fast enough, and smart enough to possibly beat me in a chase. He was able to rip my freedom out from under me, and he was even planning on it in the near future. At that moment, I realized that having curves and beauty meant absolutely nothing if I didn't have freedom.This scenario might have been romantic if observed from the safety of a book or a movie. Being here, actually being here, it was terrifying. A confession of that magnitude might have made a crazier woman excited and thrilled. Another woman’s heart might have gone all ‘aflutter’ with the thought of John being her ‘mate’. Another woman would have blushed and batted her eyelashes and said some noteworthy double entendre. It was a good thing I wasn't simply another woman.I shook his hand, met his gaze, and said, “May the best one win.”",
  "genres": [],
  "author": "Laura  Fields",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/17161901-featherlight"
}