{
  "title": "الدماء تعود إلى مجاريها",
  "description": "ما نشرته جريدة \"عكاظ\" عن الرواية:في هذه الرواية ، يتبنَّى الكاتب العُماني \"محمد قرط الجزمي\" القضية الفلسطينية، ولكنه، تبنِّي من نوع آخر مغاير لما ألفته الأعمال الروائية في تعاملها مع تلك القضية، متخذاً من الإسلام منهجاً في التعامل مع الآخر المختلف عنّا ، حتى ولو كان يهودياً أو إلى اى دين أو لون ينتمي.هذه المعادلة الصعبة نجد التعبير عنها من خلال الوسائل التي اعتمدها أبطال من جماعة \"الشعب\" بزعامة (صفوان آل الحو) وصاحبه أبي (جاسم) ، وأبناؤهما \"غسان\"، \"جاسم\"، \"ضياء\" والجهاديون من حولهم مع عدو لا يرحم؛ متخذين من قول الرسول - صلى الله عليه وسلم -: [الوسائل لها أحكام المقاصد] منهجاً لعملهم ، بمعنى أنه كيفما كانت مقاصدك، فسيكون حكمنا على أفعالك اعتماداً عليها.تحكي الرواية قصة رجل فلسطيني بدأ يفكر بتأسيس جماعة تستهدف تنظيم المقاومة الفلسطينية وصدّ غارات الصهاينة المتكررة عليهم.. صحيح أن \"صفوان آل الحو\" رجل من عامة الشعب، إلا أنه يتحرك وفق فلسفة خاصة تنشد حريةٌ تقوم على (الفكر والعقل والدين والمبادئ) فالقضية التي يحملها وهي قضية العرب طبعاً (المسجد الأقصى) أولاً، ثم القدس، ثم فلسطين.. هذا الترتيب بدا وكأنه أداة للقياس اختارها \"الجزمي\" للتعبير عن رسالة بعلم الوصول مفادها أن هناك أرضاً اغتصبت ، وشعباً أعزل لا يزال يتلقى الضربات يوماً بعد يوم ، والسبب هو الطريقة التي يتم التعاطي بها مع القضية ومع مفهوم (الجهاد)\"أقول بأننا جماعة (الشعب) غايتنا توفير كل مستلزمات النصر على العدو، وليس من غاياتنا توفير أكبر عدد ممكن من الأفراد...\"، هكذا قال صفوان آل الحو رئيس جماعة الشعب وهو يخاطب ابنه ضياء الذي بدا متحمساً للشهادة \"... ثم اعلم يا ولدي أن الاستشهاد إنما هي وسيلة وليست غاية.. غايتنا هي رضى الله، وأن يدخلنا بفضله جنته\" ... \"الشهادة إذن كرامة من الله لعباده، وليست غاية نسعى إليها...\".وفي الرواية يتعرض قائد الجماعة وأفراد أسرته لهجوم من قبل قائد القوات العسكرية الإسرائيلية \"بنيامين\" ومساعده \"شامير\" فتنهار أسرته ، وتمر بعدها السنون والأعوام وفي قلب صفوان الكثير والكثير ضد بنيامين هذا ومساعده شامير ، غير أن مبادئ الجهاد التي يتبناها تمنعه من التعرض لهما في مواقف كثيرة ، وصراعات فيها من الكر والفر الكثير.ويكبر الأولاد ، وتنتقل المشاعر والأحاسيس من الآباءإلى الأولاد..ويستمر الصراع الفلسطيني ضد عدوهم الغاشم ، وتُسال الدماء غزيرة على الأرض الطاهرة ، التي كلما ابتعدت دماؤها عنها ، تعود من جديد إلى مجاريها.وبعد، إن \"الدماء تعود إلى مجاريها\" ملحمة لنضالِ شعبٍ كان ولا يزال تحت دورة الألم والقتل والاقتلاع والتشرد، فكانت الرواية تجسيداً لإرادة البقاء ، ودعوة للتغيير، ومراجعة لجوهر القضية الفلسطينية وقراءتها بعين فاحصة.",
  "genres": [],
  "author": "محمد قرط الجزمي",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/17162117"
}