{
  "title": "Rumsfeld's Rules: Leadership Lessons in Business, Politics, War, and Life",
  "description": "The man once named one of America’s ten “toughest” CEOs by Fortune magazine offers current and future leaders practical advice on how to make their companies and organizations more effective.Throughout his distinguished career—as a naval aviator, a U.S. Congressman, a top aide to four American presidents, a high-level diplomat, a CEO of two Fortune 500 companies, and the only twice-serving Secretary of Defense in American history—Donald Rumsfeld has collected hundreds of pithy, compelling, and often humorous observations about leadership, business, and life. When President Gerald Ford ordered these aphorisms distributed to his White House staff in 1974, the collection became known as \"Rumsfeld's Rules.\"First gathered as three-by-five cards in a shoebox and then typed up and circulated informally over the years, these eminently nonpartisan rules have amused and enlightened presidents, business executives, chiefs of staff, foreign officials, diplomats, and members of Congress. They earned praise from the Wall Street Journal as \"Required reading,\" and from the New York Times which \"Rumsfeld's Rules can be profitably read in any organization…The best reading, though, are his sprightly tips on inoculating oneself against that dread White House disease, the inflated ego.\"Distilled from a career of unusual breadth and accomplishment, and organized under practical topics like hiring people, running a meeting, and dealing with the press, Rumsfeld's Rules can benefit people at every stage in their careers and in every walk of life, from aspiring politicos and industrialists to recent college graduates, teachers, and business leaders.",
  "genres": [
    "Leadership",
    "Business",
    "Nonfiction",
    "Politics",
    "Biography",
    "History",
    "Self Help"
  ],
  "author": "Donald Rumsfeld",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/17162740-rumsfeld-s-rules"
}