{
  "title": "Familiar",
  "description": "Emrys Andrews lives in the quaint New England town of Salem, Massachusetts. In school he was never part of the popular “in” crowd, but he always had good friends and was generally known as a fun-loving, nice-guy geek. A label that followed him into adulthood. He just has one little problem. A secret he’s managed to keep from his friends and the world in general. You see, he’s descended from a long, esteemed line of honest-to-goodness, magick-wielding witches. Which wouldn’t be so bad, except, while the rest of his family members totally rock the witch power, Emrys…doesn’t. Any time he tries to do magick, anything that can go wrong, usually does. He’s left a trail of magickal disaster in his wake all his life, so now, for everyone’s safety, he tries to avoid his powers at all costs.David Jennings is everything Emrys is not—gorgeous, sexy, popular, athletic, and a perfectly normal non-magick person. Despite the fact Emrys is sure David’s out of his league, and possibly straight, all it takes is one look into David’s soulful blue eyes and Emrys is a goner. He keeps his crush quiet for years, however, because his magick is usually at its worst when he’s emotional or when his adrenaline is pumping, and around David, he can’t control either.When an unexpected encounter finally throws them together, Emrys discovers he’s not the only one who’s been fantasizing from afar. David’s been harboring feelings for Emrys for years, too. Unfortunately, David’s family also has secrets. The kind that can get anyone who knows too much…very much dead. With David’s life on the line and his past doing its best to tear them apart and keep them that way, and magick the only apparent solution, Emrys has to get control of his power once and for all if he wants to save the man who’s always been his destiny. But the tricky part is, he can’t do it without David’s help…",
  "genres": [
    "Paranormal",
    "M M Romance",
    "Romance",
    "Fantasy",
    "Contemporary",
    "Magic",
    "M M Fantasy"
  ],
  "author": "M.L. Rhodes",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/17162772-familiar"
}