{
  "title": "من الذي دفع للزمار؟: الحرب الباردة الثقافية",
  "description": "على مدى اكثر من عشرين عاما كانت وكالة المخابرات الأمريكية تنظم وتدير جبهة ثقافية عريضة في معركة ضارية بدعوى حرية التعبير ، وبتعريفها للحرب الباردة بأنها معركة من أجل \"الاستيلاء على عقول البشر\". وبعد ان سكت هدير المدافع وازيز الطائرات ودوي القصف أخرجت الترسانة أثقالها الثقافية: الصحف والمجلات والإذاعات والمؤتمرات ومعارض الفن التشكيلي والمهرجانات الفنية والمنح والجوائز ..الخ ، وتكونت شبكة محكمة من البشر الذين يعملون بالتوازي مع ال\"CIA\" لتمحو من الأذهان فكرة أن \"أمريكا صحراء ثقافية\" وتزرع فيها فكرة جديدة مؤداها أن العالم في حاجة إلى سلام أمريكي وإلى عصر تنوير جديد ، وأن ذلك كله سيكون اسمه \"القرن الأمريكي\".راديكاليون سابقون ومثقفون يساريون ممن تحطم إيمانهم بالماركسية والشيوعية ، ومؤسسات همية وتمويل سري ضخم وحملة إقناع هائلة في حرب دعاية ضارية تخطط لها وتديرها \"منظمة الحرية الثقافية - Congress for Cultural Freedom\" التي كانت بمثابة وزارة غير رسمية للثقافة الأمريكية ، أو لتكون \"الزمار\" الذي تدفع له CIA ثمن ما تطلبه من ألحان.هنا تضيء الباحثة البريطانية ف.س.سوندرز جانبا مظلما في تاريخ أمريكا الثقافي معتمدة على عدد كبير من المقابلات الشخصية ، وفحص عدد كبير من الوثائق الرسمية التي أفرج عنها مؤخرا .. وهنا تظهر أسماء عدد كبير من ابرز مفكري وفناني المرحلة: أشعيا برلين وكليمنت جرينبيرج وسيدني هوك وآرثر كويستلر وأندريه مالرو وجورج أورويل وبرتراند راسل وسارتر وآرثر شليزنجر الابن ..وغيرهم ..، وبينما البعض تعاون دون ان يدري ، كان البعض الآخر يعمل عن علم واستعداد لتتعاون!..انها القصة الكاملة للدور الذي قامت به CIA في الحرب الباردة الثقافية ، الأمر الذي يجعل من هذا الكتاب \"عملا مهما من أعمال البحث التاريخي\" كما وصفه الراحل المفكر إدوارد سعيد.مزيد من المعلوماتhttp://www.books4all.net/%C7%E1%D3%ED...للتحميلhttp://www.mediafire.com/view/n319z6g...اوhttp://www.4shared.com/office/xaDIwJ0...",
  "genres": [
    "History",
    "Politics",
    "Nonfiction",
    "Art",
    "American History",
    "Conspiracy Theories",
    "The United States Of America"
  ],
  "author": "Frances Stonor Saunders",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/10746622"
}