{
  "title": "Pirates",
  "description": "NASTRAGULL: Pirates is a blockbuster of a novel, a science fiction epic of an extent and scope not seen since Frank Herbert's Dune or David Brin's Uplift sequence. The first book of a projected series, it also incorporates the swashbuckling action of classic space opera like E.E. \"Doc\" Smith's Lensman series and Star Wars, accelerating the reader into a universe where humanity is just one species among many, in a multi-cultural civilization spanning many galaxies. As the story opens, a group of young Oman (human) cadets are heading home after eight years of training at a military academy, in preparation for their graduation on Tallas, the capital world of the Nastasturus Federation. As it turns out, their selection of transport was unfortunate: the civilian passenger liner Bright Star is attacked by pirates -- something that, supposedly, never happens in the sector they're traveling through. Despite a spirited defense by the cadets and others, the pirates capture the ship and imprison the passengers and crew, intending to sell them into slavery (or worse). With the help of a spirited young pirate woman, one of the cadets manages to escape. Alec Af Hornet, a.k.a. \"Alec Horn,\" is a brilliant tactician, and just happens to be the only child of Marshall Guss von Hornet, the leader of the Nastasturan military and head of one of the Federation's Elite families. During his escape, Alec frees Nikko Behl, the Bright Star's captain, and together they set out on an adventure to rescue their friends, financed by an emperor's ransom in loot recovered from the pirates.Through it all, Alec's thoughts remain with Alexa, the young woman who helped free him. Both realize when they meet that they're two halves of some mysterious whole, and that their meeting presages some glorious future. Both will do literally anything to protect and remain with the other...often with disastrous consequences to those around them. Their love will ultimately draw the universe into its devastating Third Universal War.On the opposite side of the universe, in the totalitarian Florencian Federation, a creature that has slept for over a thousand years awakes from her long rest. She is Marquessa De La Hoff, once the most infamous military commander in the universe -- a woman who only has one ultimate goal, to conquer in the service of her God. The Marquessa takes the helm of a monstrous military machine designed to enslave the Nastasturans, taking their worlds and resources for Florencia in a vast crusade meant to subjugate thousands of star systems. Alec and the Marquessa are linked by an intricate network of fate, history, and destiny, one that will ultimately draw everyone around them into a black hole of destruction and damnation. As they learn much later, the universe -- known by its proper name as Nastra -- speaks to all of us; everyone hears it, but few actually listen to its words. The day you do listen to the universe and the words of its parent -- the creator, Gull -- is the day you have Awakened. Only two people are currently Awake: the creature De La Hoff is one, and young Alec is the other. Neither understands what, exactly, is happening to them, though each is gradually becoming aware of the other, and of what Nastra is trying to tell them.But the universe cannot allow more than one listener at a time. Therefore, it prepares to birth a messiah: the NastraGull, a child who must set the universal balance right -- lest the universe cease to exist.Show More Show Less",
  "genres": [
    "Science Fiction"
  ],
  "author": "Erik Martin Willén",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/17164984-pirates"
}