{
  "title": "Thoreau at Devil's Perch",
  "description": "Henry David Thoreau leaves the seclusion of Walden Pond to help investigate a series of murders in the first in B. B. Oak’s fascinating new historical mystery series, set against the bucolic backdrop of 19th century New England. The lush, overgrown banks of Massachusetts’s Assabet river are the ideal place for Dr. Adam Walker to find coveted medicinal plants for his remedies. But on one balmy August morning he finds something very different. A stranger, identifying himself as Henry David Thoreau of nearby Walden Pond, approaches and entreats Adam to accompany him upriver. He has discovered the body of a young black man at the base of the cliff known as Devil’s Perch. As they examine the broken corpse and the surrounding scene, both men become convinced that the unfortunate victim was dead long before he fell. Yet the coroner’s jury insists otherwise, dismissing the matter as an accident. Angered by the injustice, Adam and his lovely cousin Julia Bell agree to assist Thoreau in investigating. Adam notes in his new friend all the makings of a great detective—an encyclopedic knowledge of the natural world, uncanny observational skills, a sharp instinct for detecting human foibles. As the case progresses, the mysteries only deepen and there is no mistaking the brutal slaying of a womanizing army captain as anything other than the coldest murder. Journeying from their tranquil village to Boston’s most disreputable district, they gradually uncover the monstrous truth—even while a vicious killer prepares to end their inquiry for good…Advance Praise For Thoreau At Devil’s Perch!“A favorite literary figure shows an unexpected flair for detection in this historical mystery. Original and charming.” —Laura Joh Rowland, author of The Incense Game“Well researched, captivating and compelling until the very end, Thoreau at Devil’s Perch is both mystery and love story during a time that appeared deceptively simple. Through their diaries, the main characters, Adam and Julia become to feel like old friends you want to revisit again and again. I’ve never been a fan of using historical figures in fiction—B.B. Oak has changed my mind. Well done!” —Anna Loan-Wilsey, author of Anything But Civil“B. B. Oak brings Thoreau’s nineteenth-century world to vivid life in this intriguing puzzler that will keep you guessing to the terrifying end.” —Victoria Thompson, author of Murder in Chelsea",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Historical Mystery",
    "Fiction",
    "Cozy",
    "Historical"
  ],
  "author": "B.B. Oak",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/17165231-thoreau-at-devil-s-perch"
}