{
  "title": "Secret Thoughts",
  "description": "Secret Thoughts is a startling examination of sexuality, motherhood, and society told in three novellas by Geffen Award-winning author Guy Hasson.“Guy Hasson writes with a deceptive smoothness, in the assured hand of an Old Master, and with a deep concern for the big questions of science fiction. You need to read him.”–Lavie Tidhar, author of The Bookman and An Occupation of AngelsIn “The Perfect Girl”, Alexandra Watson is a newcomer to Indianapolis Academy of Telepathic Studies. Soon, she’s reading the residual memories of a recently dead woman and tracking down the mystery of her demise.In “The Linguist”, the US government offers Rachel Akerman a chance to help her country communicate with an alien bein in exchange for her life.Finally, in “Most Beautiful Intimacy”, Susan DiOrio knows that a telepath has never successfully given birth to a child, but she finds that she is unable to give up her child.These three novellas will open your eyes, raise uncomfortable questions, and make you fall in love with the protagonists three times over.SECRET THOUGHTSGuy Hasson is an Israeli writer, playwright, and filmmaker. He is also a two-time winner of the Israeli Geffen Award for science fiction short stories. Apex readers can find more of his work in the anthologies The Apex Book of World Science Fiction, Horror, and Science Fiction and Fantasy.\"Guy startling, moving, thought-provoking, and above all, entertaining! You've got to love his work.\" --Keith Brooks, founder and editor of infinity plus\"All three stories are incredibly unique and even a day or two after reading I’m still surprised at the deep levels of intimacy, and not just physical intimacy. But when dealing with deep, pure emotions, what else should I have expected?\" --Little Red Reviewer\"The novellas consider intimacy in three distinct the living past, the Other, and the possible future. But what distinguishes “Secret Thoughts” is neither its focus on intimacy nor the choice of its contexts. It is that the stories, all first-person accounts, ask us to imagine being a telepath, to imagine living in a world where intimacy is thrust upon you, a world where intimacy is a burden, not a gift.\" --The World SF Blog, Anil Menon\"I'm calling SECRET THOUGHTS science fiction, but you could easily say it's contemporary fantasy. Paranormal. Slipstream. Magic realism. It doesn't matter how you qualify it, SECRET THOUGHTS is a fresh, insightful take on telepathy and the human condition.\" --Scribbler to Scribe, Stephanie M. Lorée",
  "genres": [
    "Science Fiction"
  ],
  "author": "Guy Hasson",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/10747800-secret-thoughts"
}