{
  "title": "The Prize: Who's In Charge of America's Schools?",
  "description": "A New York Times Bestseller\nMark Zuckerberg, Chris Christie, and Cory Booker were ready to reform our failing schools. They got an education.When Mark Zuckerberg announced to a cheering Oprah audience his $100 million pledge to transform the downtrodden schools of Newark, New Jersey, then mayor Cory Booker and Governor Chris Christie were beside him, vowing to help make Newark “a symbol of educational excellence for the whole nation.” But their plans soon ran into the city’s seasoned education players, fierce protectors of their billion-dollar-a-year system. It’s a prize that, for generations, has enriched seemingly everyone, except Newark’s children.  Dale Russakoff delivers a riveting drama of our times, encompassing the rise of celebrity politics, big philanthropy, extreme economic inequality, the charter school movement, and the struggles and triumphs of schools in one of the nation’s poorest cities. As Cory Booker navigates between his status as “rock star mayor” on Oprah’s stage and object of considerable distrust at home, the tumultuous changes planned by reformers and their highly paid consultants spark a fiery grass-roots opposition stoked by local politicians and union leaders.  The growth of charters forces the hand of Newark’s school superintendent Cami Anderson, who closes, consolidates, or redesigns more than a third of the city’s schools—a scenario on the horizon for many urban districts across America.  Russakoff provides a close-up view of twenty-six-year-old Mark Zuckerberg and his wife as they decide to give the immense sum of money to Newark and then experience an education of their own amid the fallout of the reforms. Most moving are Russakoff’s portraits from inside classrooms, as homegrown teachers and principals battle heroically to reach students damaged by extreme poverty and violence. The Prize is an absorbing portrait of a titanic struggle, indispensable for anyone who cares about the future of public education and the nation’s children.",
  "genres": [
    "Education",
    "Nonfiction",
    "Politics",
    "History",
    "Audiobook",
    "Teaching",
    "Parenting"
  ],
  "author": "Dale Russakoff",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/17165917-the-prize"
}