{
  "title": "Dead Eye",
  "description": "Ex-CIA master assassin Court Gentry gets hit with a blast from the past in the fourth Gray Man novel from #1 New York Times bestselling author Mark Greaney.\nEx-CIA master assassin Court Gentry has always prided himself on his ability to disappear at will, to fly below the radar and exist in the shadows—to survive as the near-mythical Gray Man. But when he takes revenge upon a former employer who betrayed him, he exposes himself to something he’s never had to face before: a killer who is just like him.Code-named Dead Eye, Russell Whitlock is a graduate of the same ultra-secret Autonomous Asset Program that trained and once controlled Gentry. But now, Whitlock is a free agent who has been directed to terminate his fellow student of death. He knows how his target thinks, how he moves, and how he kills. And he knows the best way to do the job is to make Gentry run for his life—right up until the moment Dead Eye finally ends it…“The various moves of each of the skilled and ruthless principals play out against a constantly shifting background of changing goals and allegiances. Fans of superhuman antiheroes will hope the Gray Man survives to fight another day.”—Publishers Weekly“Political intrigue at its finest...Dead Eye twists and turns with each new revelation as Mark Greaney takes the reader on one heck of a wild ride!”—Fresh Fiction“Writing as smooth as stainless steel and a hero as mean as razor wire.”—New York Times bestselling author David Stone“The story is so propulsive, the murders so explosive, that flipping the pages feels like playing the ultimate video game.”—The New York Times“A high-octane thriller that doesn’t pause for more than a second for all of its 464 pages.”—Chicago Sun-Times“Take fictional spy Jason Bourne, pump him up with Red Bull and meth, shake vigorously—and you’ve got the recipe for Court Gentry.”—The Memphis Commercial Appeal",
  "genres": [
    "Thriller",
    "Fiction",
    "Action",
    "Audiobook",
    "Espionage",
    "Spy Thriller",
    "Suspense"
  ],
  "author": "Mark Greaney",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/17166242-dead-eye"
}