{
  "title": "Two by Day, Three by Night",
  "description": "When Courtney Wells agreed to provide specialized care for a foreign aristocrat, she expected to encounter a commanding personality, but nothing could have prepared her for Baron Marcas Kalnovky, an incredibly handsome mountain of a man with a voice that something deep within her can't help but need to obey.Courtney is shocked to find that she has not been hired to care for the baron himself, but for his best friend and servant of many years, an old monk by the name of Brother Sebastian. She soon learns that while it is the aging monk who is sick, the baron himself has a far more unusual and disturbing condition.His voracious appetite for uncovering the archaeological treasures of his native Romania once led the baron to delve too deeply into the wrong tomb, and since that day he has been the victim of a most unusual curse. By day, he is the same man he always was, but by night, he is physically split in two-divided between his rational self and the much less reasonable side which harbors his animalistic needs. When the pretty young nurse arrives to care for Sebastian, the baron finds that both halves of himself not only want her, they need her.As they grow closer to one another, Courtney becomes torn between the worldview she has harbored over the years on the one hand and her deep need to submit to Marcas on the other, and when she discovers the effects of the curse it only adds to her confusion... and her intense need for both halves of him. Will she come to terms with herself and with Marcas, and if she does, will her love be able to break the curse and heal his wounded soul?Publisher's Note: Two by Day, Three by Night is an erotic novel that includes both consensual and non-consensual spankings, anal play, graphic sexual scenes including threesomes, and more.",
  "genres": [
    "Erotica",
    "BDSM",
    "Romance",
    "Paranormal",
    "Supernatural",
    "Paranormal Romance",
    "Fiction"
  ],
  "author": "Breanna Hayse",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/17166888-two-by-day-three-by-night"
}