{
  "title": "Tasting Never",
  "description": "Tasting Never, a New Adult Romance Novel Recommended for Ages 18 and UpTasting Never Series, book #1.(Books #2-#5 are also available! Reading list included below.)\"Never Ross wants to be loved.It's that simple, but it's not that easy.\"Never is a girl with a broken soul who doesn't date nice guys and can't seem to go to bed at night without crying herself to sleep. She doesn't need any complications in her life, especially not when they're attached to a man that could be her emotional twin.Ty McCabe can't stand Never the first time he meets her. He's aware that the feeling's mutual and the two don't think they'll ever see each other again, but when fate takes a hand and puts them both in the wrong place at the wrong time, Ty and Never form a tentative friendship that opens the door on their dark sides and shows them what it's like to live in the light.\"Sometimes, the only way to go forward, is to take a few, careful steps back.\"READING LIST#1: Tasting Never#2: Finding Never#3: Keeping NeverOR Books #1-#3 in one volume: \"Tasting, Finding, Keeping: The Story of Never\"#4: Never Can Tell#5: Never Let Go#6: Never Did SayTASTING NEVER EXCERPT:Ty's hot mouth is on my neck, and I find myself taking short, sharp, little breaths as I press my shaking hands to his chest. If I sleep with him again, I'll be making the biggest mistake of my life. He's the first real friend I've ever had, and I don't want to cheapen the feelings that are simmering between us. We made that mistake once before, and we survived. We've been through a lot since then, and I know that if I lose him now, I will never be whole again. Ty is my other half, lover or no, and just being around him is enough for me.\t“Ty,” I say, trying my best to sound stern. Instead, my voice comes out like a butterfly, flutters against Ty's hair and swirls it gently against my lips. I moan and find that my fingers are now curled in the fabric of his T-shirt.\t“Never,” he says back to me, the word like fire against my skin. In those two syllables, I hear how he feels about me. He thinks he's in love. Ty McCabe thinks he's in love with me. He doesn't say it aloud, but I can tell. Sex isn't the best way for me to show my feelings; I've abused it for far too long that it has somehow lost some of its meaning. I try to tell Ty this, but I can't speak with his lips on my throat and his hand sliding across the nape of my neck.\tI run my own hands down his chest and put them beneath his shirt, on the hard plane of his belly. His muscles contract as I press my fingers into them, touching, feeling, absorbing the man, the complication, that is Ty McCabe. All the while, my mind is racing in circles trying to talk me out of this.“Kiss me,” Ty says and it's not a question, it's a request, albeit a gentle one. His voice is softer than I've ever heard it. His words are naked, stripped of all the bullshit that's happened to him, all of the horrible things that mirror my own life. Ty and I are like twins, like two halves of the same whole. They say that opposites attract, but Ty and I are very much the same and the attraction between us burns brighter than the sun. “Kiss me,” he says again and I do.",
  "genres": [
    "New Adult",
    "Romance",
    "College",
    "Contemporary",
    "Contemporary Romance",
    "Dark",
    "Young Adult"
  ],
  "author": "C.M. Stunich",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/17166938-tasting-never"
}