{
  "title": "Finding Margaret Fuller",
  "description": "An epic reimagining of the life of Margaret Fuller—America’s forgotten leading lady and the central figure of a movement that defined a nation—from the New York Times bestselling author of The Magnificent Lives of Marjorie Post. Massachusetts, 1836. Young, brazen, beautiful, and unapologetically brilliant, Margaret Fuller accepts an invitation from Ralph Waldo Emerson, the celebrated “Sage of Concord,” to meet his coterie of enlightened friends shaping a nation in the throes of its own self-discovery. By the end of her stay, she will become “the radiant genius and fiery heart” of the Transcendentalists, a role model to young Louisa May Alcott, an inspiration to Nathaniel Hawthorne and his scandalous Scarlet Letter, a friend to Henry David Thoreau as he ventures into the woods of Walden Pond . . . and a muse to Emerson himself. But Margaret craves more than poetry and interpersonal drama, and she finds her restless soul in need of new challenges and adventure. And so she charts a singular course against a backdrop of dizzying historical drama: From Boston, where she hosts a women-only literary salon for students like Elizabeth Cady Stanton; to the editorial meetings of The Dial magazine, where she hones her pen as its co-founder; to Harvard’s library, where she is the first woman to study within its walls; to the gritty New York streets where she spars with Edgar Allan Poe and reports on the writings of Frederick Douglass. Margaret defies conventions time and again as an activist for women and an advocate for humanity, earning admirers and scathing critics alike. When the legendary Horace Greeley offers an assignment in Europe, Margaret again makes history as the first female foreign news correspondent, mingling with luminaries like Frederic Chopin, Walt Whitman, George Sand, and more. But it is in Rome where she finds a world of passion, romance, and revolution, taking a Roman count as a lover—and sparking an international scandal. Evolving yet again into the roles of mother and countess, Margaret enters a new fight for Italy’s unification. With a star-studded cast and epic sweep of historical events, this is a story of an inspiring trailblazer, a woman who loved big and lived even bigger—a fierce adventurer who transcended the rigid roles ascribed to women, and changed history for millions, all on her own terms.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Book Club",
    "Audiobook",
    "Historical",
    "Feminism",
    "Books About Books"
  ],
  "author": "Allison Pataki",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/171680310-finding-margaret-fuller"
}