{
  "title": "Spitting on Ghosts: Fables and Fairy Tales from Early China",
  "description": "Part of The Traditional Chinese Culture series, this book is an illustrated adaptation of fables and fairy tales from early China. Collected and popularized by the immensely popular Chinese illustrator Tsai Chih Chung, the book includes over 100 fabulous tales for the reader of today, bringing to life the wisdom of life through cartoon panels with a text that is irreverently humorous yet replete with wisdom. It is a great and easy tool to learn Chinese classics.About the Traditional Chinese Culture The Traditional Chinese Culture series includes a total of 22 titles that features the great thinkers in Chinese history. The writings of early Chinese thinkers have influenced all facets of Chinese culture and society, from education to art, from politics and warfare to common etiquette. The popular comic book artist Tsai Chih Chung faithfully brought the wisdom of these classics to life with his uniquely charming illustrations.Tsai Chih Chung is a world-renowned Taiwanese cartoonist and popularizer of Chinese classics whose books have sold more than 40 millions copies worldwide. He first came to prominence through his award-winning animated movies and his immensely popular daily comic strips. When he turned his hand to the classics after a prolonged period of self-education, they were acclaimed by critics and shot to the top of the bestsellers lists. His books have been published in America by Princeton University Press and Knopf, among others.Brian Bruya is an established translator of Chinese classics and a professor of history & philosophy at Eastern Michigan University. He received his B.A. in philosophy and Chinese from the University of Washington and his M.A. in comparative philosophy from the University of Hawaii. He has translated over 20 books by Tsai Chih Chung. All Titles in the Traditional Chinese Culture Sunzi The Art of War, 7801885090The Dao Speaks Whispers of Wisdom, 7801885120The Dao Speaks More Whispers of Wisdom, 7801885139Zhuangzi Speaks The Music of Nature, 7801885147Zhuangzi Speaks More Music of Nature, 7801885155Zen The Staff and Shout of the Venerable Ones, 7801885112Confucius The Message of the Benevolent, 7801884973Han Feizi The Power of Pragmatism, 7801886534Mencius The Cure for Chaos, 7801885376History The Four Princess of the Warring States, 7801886550The New Mystery and Pure Conversation, 7801886577The Roots of Wisdom, 7801886569Great Learning ; The Middle The Pinnacle of Virtue ; Living a Life of Harmony , 7801886585Spitting on Fables and Fairy Tales from Early China, 7801886542Shaolin Temple, 7801887689Dharma Sutra , 7801887158Liezi Thoughts to Ride the Wind, 7801886518Madam White Snake, 7801887697Heart Sutra, 7801887166Ghosts and Fables and Fairy Tales from Late China, 7801886526The Analects of Confucius, 7801885082Wisdom of the Zen The Quest for Enlightenment, 7801885287",
  "genres": [
    "Fairy Tales"
  ],
  "author": "Tsai Chih Chung",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/1716959.Spitting_on_Ghosts"
}