{
  "title": "God's Only Daughter",
  "description": "\"What if God had a Daughter?\" Despite the omnious cover, no one gets crucified in this 'fun with nuns' tale. This is a feel good Catholic book, or a feel good Christian book, a mystery, if you will. For some, it may conjure deep and fond Catholic school memories. For others it may offer a comedic, often humorous, glimpse of spiritual redemption. When two holy Sisters follow a heavenly chorus through the woods, they discover a little girl playing with a bear. The Sisters devise a plan to rescue the heavenly child, \"Joy \" from her new friend, and having done so, whisk her away to the nearby Catholic convent/orphanage and a doubting Mother Superior. Of course, Sister Patrice's version differs somewhat from that of our little girl, who claims that she is from Heaven; that Jesus is her brother and she is God's daughter. Joy, accompanied by an often visable-to-her guardian angel, Michael, is subsequently examined by the Catholic Bishop, a man with a funny hat who remains unconvinced of her claims. He does discover that her heart is located in her abdomen. A birth anomaly? She is taken into the already-strapped orphanage, a circa WWII era home for children. There she makes friends and experiences the oddities of life on earth, while God the Father speaks to His Only daughter through His angel Michael. She is later adopted, some might argue 'sold' by the Mother Superior for ten thousand dollars (because the orphanage is in financial duress), to a redeemable gangster and his gum-chewing mistress. Sister Patrice is appointed ward by Mother Superior and permitted to go along with Joy and her new parents for a trial period. They travel across the state visiting various gambling venues in the gangster's hapless attempts to bail himself out of trouble with the mob. In the course of the tale, Joy's new father and mother achieve a spiritual grace and redemption that could only have come from Joy. Eventually Sister Patrice herself comes to terms with her spirituality and self-doubts concerning her bad or good feelings about her Christian vowels. Finally the family settles in New York City, where Joy's dream of the Great White Way comes to fruition. Years later, as recounted to Sister Patrice by a former schoolmate who had fallen in love with Joy, --\"She really was God's daughter. It happened during a Broadway show--a host of angels surrounded her. Regardless if one was a Christian or a Catholic, it was right there before our very eyes. But only the orchestra and those in the first rows could see. The roof over the stage opened up toward the heavens, and...\" --\"An amazing achievement in the Catholic Fiction genre. A most wonderful mystery.\"--The Catholic Fiction Chronicle.",
  "genres": [],
  "author": "Damon Galeassi",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/10086148-god-s-only-daughter"
}