{
  "title": "A Christmas Tail",
  "description": "Melanie, Monty and baby Peter Mouse live in a doll's house called Cherrywood Cottage. The Mouse family are full of excitement as they await the arrival of Santa Paws. However, an unlikely turn of events sets about a hilarious twist to their Christmas festivities. Find out how Santa Paws loses his trousers. A Christmas Tail is a delightful story, the first in a new collection about a very special mouse family. This enchanting story is brought to life by the exquisite illustrations of Aaron Pocock About the Authors Donna Smith Donna Smith is an award winning children's author who lives in Victoria with her husband and their three children. Donna has had several children's stories and poems published in various anthologies, journals and as chapter books. Donna has also written over forty academic titles for the Adult Education sector and is currently completing an arts degree, which she will graduate in 2012. When Donna is not writing she enjoys piano, art, skiing and training for triathlons. You can visit Donna at www.jellibeanzpublishing.com Helen Ross Helen Ross (nee McKenzie) was born in Melbourne, Australia. As a former primary and kindergarten teacher, Helen has always loved the magic of books. She loves writing, photography, travel and art, and has won awards for her children's poetry. Her quirky sense of humour is embedded in many of her children's stories and giggle poetry. She also enjoys visiting schools and conducting giggle poetry workshops around Australia; hence, she always has a bag packed ready to go. Helen lives in sunny Brisbane with her humorous husband and their beloved pets. More information about Helen's other published children's books can be found at her www.helenross.com.au Aaron Pocock Aaron Pocock, born into a large family in the South of England, has been living in Brisbane, Australia since 2000 and has been an illustrator for 20 years or so. As well as drawing, painting and many other pursuits that keep his mind active and nimble, Aaron is also a musician and plays a mean Blues guitar. Aaron is married, has two children and works in a big studio where he scribbles away at drawings and paintings for books and things. More of his work can be found www.pocockillustration.com; aaronpocock.wordpress.com",
  "genres": [],
  "author": "Donna M. Smith",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/17177989-a-christmas-tail"
}