{
  "title": "Driving the Birds",
  "description": "Jabonkah Sackey’s only desire in life was to be like her mother and to be left alone. However, being born deep in the African bush in 1948, her desires didn’t really matter. Cursed with an abusive father, Jabonkah was saddled with the plans he had for her. Instead of being a “stupid bush woman” like her mother, she was going to learn to obey. But after repeatedly disappointing and rebelling against her father, he sets forth on a rampage targeting her mother and nearly beats her to death. After stepping in to save her mother and scalding her father with boiling water in the skirmish, Jabonkah’s fate is unfortunately sealed. She is sent to the Society as punishment, where women from her own tribe perform the ritual of female circumcision. Six weeks later, Jabonkah returns home to the continued beatings until she is eventually disowned and sent away to live with a missionary by the name of Mother Stevens. Unfortunately, it’s with Mother Stevens that her real struggle begins. Will Jabonkah escape the oppression and misery that is ruling her life, or will she succumb to her depression? Set against the harsh setting of mid-century Africa, Driving the Birds takes readers on a journey from small villages in Liberia to African missions, and eventually the United States. With this particular backdrop, Jabonkah’s story brings many issues to light that affect countless women around the world. By documenting the horrible genital mutilation that she suffers in detail, Driving the Birds aims to bring about further awareness to an issue that is still prevalent today. Though the subject matter can be intense and discouraging at times, Jabonkah uses her faith and an uncommon personal resiliency to keep the story from setting into a despondent manner. With true personal freedom as her goal, Jabonkah is able to overcome numerous obstacles and a lifetime of hardships in route to achieving her dreams and ensuring her happiness. Driving the Birds by Russell Traughber is the uplifting true story of one woman’s courageous journey from a small village in Liberia to the freedom that America offers. With unmistakable charm, unwavering determination, and a truly unique worldview, Jabonkah enthralls readers with each passing chapter. Her personal journey and repeated injustices are equal parts heartbreaking and infuriating. From repeated abuses at the hands of others and the subjection to female genital mutilation, Jabonkah’s plight provides a window to the sufferings of less fortunate women around the world. However, where parts of her story enrage and discourage, it’s her spirit and determination that ultimately leave readers feeling like they have taken part in Jabonkah’s triumphs as well.",
  "genres": [
    "Biography",
    "Africa",
    "Nonfiction",
    "Memoir"
  ],
  "author": "Russell Traughber",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/17177427-driving-the-birds"
}