{
  "title": "No One Else to Kill",
  "description": "\"No One Else to Kill\" is a literary \"tour de force! \" Author Bob Doerr hits all the marks in  Jim West travels to a small, remote hunting lodge in the Pecos Wilderness area in New Mexico to rendezvous with an old friend and do some hiking. His friend stands him up, and Jim is about to return home when a murder occurs in the lodge. Law enforcement jumps in, and Jim's early departure plans are scrubbed. When a second murder occurs less than twenty four hours later, things really start to get dicey. Both crimes were intricately planned to mislead the authorities, no one appears to have a motive for the killings, and everyone has an alibi. Up against a wall with time running out, the deputy-in-charge asks West to be their man on the inside, but West is adamant that this is not his case to solve. Since his retirement from the Air Force, however, Fate has had her own plans for West. Why should this be any different?  \"In the world of mysteries, Doerr's protagonist stands out as a unique foil, a man with the skills and knowledge to solve a murder, but a burning desire to keep a low profile and avoid attention. Jim West is perfectly flawed, reluctant, and extremely likeable. An edge-of-your-seat whodunnit, \"No One Else To Kill\" is a page turner that will keep readers guessing until the end.\" -- Holli Castillo, Award-winning author, \"Gumbo Justice and Jambalaya Justice\"  \"\"No One Else to Kill\" grabs you in scene one and doesn't let go until it has taken you on a roller coaster ride of murder, mystery, and mayhem. Veteran mystery author Bob Doerr has brought all his tools to the table in this book and created a tale that is engaging as it is compelling.\"  -- Michael Varhola, \"Texas Confidential\"  \"\"No One Else to Kill\" grabs you within the first two pages and doesn't let you go until the last page. This is the book to take on a vacation; it won't give you the moment or the inclination to think about the world outside that of Doerr's creation.\"  -- Leila Levinson author, award winning \"Gated Grief:  The Daughter of a GI Concentration Camp Liberator Discovers a Legacy of Trauma\"  Bob Doerr's \"No One Else To Kill\" was awarded third quarter 2012 Grand Prize for the Mystery Genre in the \"Books With Out Publishers\" writing contest at www.ultimateherocontest.com.",
  "genres": [],
  "author": "Bob Doerr",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/17179419-no-one-else-to-kill"
}