{
  "title": "Love Under The Mistletoe",
  "description": "Love Under the Mistletoe is a Christmas themed romance short story collection. The Ghost of Christmas Past  By Jasmine Bowen Avery Malroney was a normal child; playing in the dirt; swinging on the monkey bars, running around in the playground. Sure, her parents provided top of the line equipment to ghost hunters, but that was their world, not hers. All of this changed one fatal day when Avery’s young heart gave out, and a transplant was her only ticket to adulthood. Everything went fine during the operation, but when she woke up, with a once dead heart beating inside her-everything was different. Avery began to see ghosts. Working with her parents and their business contacts, Avery honed her skills to become one of the best young psychics in the world. Her skills even led her to work with the hippest young ghost hunter team on TV—the cast of Paranormal days. Now, Paranormal Days is relying on Avery to help them solve one of the biggest haunting of the century- a case that could propel them all into superstardom, and have them home for Christmas dinner. Avery eagerly agrees, both as a smart career move and a romantic move. As she once again draws closer to Dmitri, the team’s famous techie, a winter storm rages outside, trapping them in the house. Avery‘s body begins to mimic the mysterious in the case, and they are running out of time to solve it. Even as her romance with Dmitri blossoms, her body rapidly declines. Dmitri struggles with keeping the case on track and stepping in to protect the woman he realizes he loves. As the power goes out, young love burns strong—but will the Ghosts of Christmas Past keep them trapped in the darkness forever? Last Chance Junction by Lauren Murphy Mia Fletcher is going back to her country hometown to spend Christmas with her family. Crossing paths with her childhood best friend and ex-boyfriend Nick Holmes was not part of the plan. When a storm hits in the outback, both are forced to take shelter at a small Inn off the highway. They clearly still have feelings for each other but Mia is too headstrong to admit it and Nick is still puzzled by their fallout. Forced to share a room at the Inn, their situation only becomes more complicated when an armed drug dealer barges in and holds them captive. Nick and Mia have come to a junction and this could be their last chance to forgive and forget… Love’s Bah Humbug Debugger by LaRae L Parry This story introduces a critter that has been around as long as Christmas – no one remembers him because of his power of non-existence that Santa himself bestowed upon him. The role of the Bah Hum Debugger is to find lonely, single Bah Humbuggers and find their perfect match, thus eliminating Bah Humbugging altogether. In this story, the Bah Hum Debugger tells of one of his most memorable cases: Richard and Sandra were completely in love until a jealous roommate ruins their marriage scheduled on Christmas Eve – breaking their hearts and causing them to become two of the worst Bah Humbuggers Santa has ever heard. It is the Bah Hum Debugger’s job to get the two lovers back together again, or wipe their memories of each other completely. Their hearts are too hard because of the heartbreak. Will the Bah Hum Debugger be able to get them back together before it is too late? A Special Present by Samantha Lienhard Being an elf, Lucy spends her days working on toys in Santa’s workshop. There is more to life than just making toys, however. Lately she has realized just how much her best friend Asher means to her. He is more than just a friend—much more. With Christmas just two weeks away, she decides to make him a special present to show him her feelings. Unfortunately, as the holiday gets closer, Asher becomes strangely distant. All he seems to care about now is working on toys. For these two elves, is even their friendship just a thing of the past?",
  "genres": [],
  "author": "Jasmine Bowen",
  "average_rating": "4.80",
  "url": "https://www.goodreads.com/book/show/17179955-love-under-the-mistletoe"
}