{
  "title": "Precious Things",
  "description": "Out of PrintIsabelle Andrews isn’t supposed to be here. She isn’t supposed to be a freshman at Hartford Community College, she isn't supposed to be living at home and working at her dad’s failing bakery, and she definitely isn’t supposed to be taking Intro to Electronic Music Production, a class that will get her nowhere toward her goal of an English Lit Ph.D. by age twenty-five. But when her dad’s latest business fiasco eats up her college fund, Hartford Community College is exactly where Isabelle finds herself—and thanks to her late enrollment, she doesn’t even get to choose her classes. Stuck with Electronic Music and way-too-easy English courses, Isabelle is determined to wallow in all the misery she feels entitled to.But community college brings some unexpected benefits…like the fact that a certain overworked, over-scheduled Electronic Music professor hands over most of his duties to his teaching assistant. His tall, green-eyed, absolutely gorgeous teaching assistant. When TA Evan Strauss discovers Isabelle’s apathy toward electronic music—and, well, all music—he makes it his mission to convert her. The music Evan composes stirs something inside Isabelle, but she can’t get involved—after all, she’ll be transferring out as soon as possible. Still, no matter how tightly Isabelle holds on to her misery, she finds it slipping away in the wake of all Hartford Community offers: new friendships, a surprisingly cool poetry professor, and most of all, Evan. But Evan’s dream of owning his own music studio is as impractical as Isabelle’s dad’s bakery, and when Evan makes a terrible decision, everything Isabelle has gained threatens to unravel. Soon Isabelle discovers that some of the most important lessons take place outside the classroom…and that in life, as in Evan’s favorite Depeche Mode song, the most precious things can be the hardest to hold on to.",
  "genres": [
    "New Adult",
    "Contemporary",
    "Romance",
    "Music",
    "Young Adult",
    "Fiction",
    "Contemporary Romance"
  ],
  "author": "Stephanie Parent",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/17182158-precious-things"
}