{
  "title": "The Next American Revolutionary War",
  "description": "My book The Next American Revolutionary War is a political commentary and plan to improve democracy in America by motivating big business and government to action by withholding what they want most - our money. By using our inalienable right to spend or not to spend our money as we see fit, we can motivate government to take the necessary actions to balance our budget, protect our environment, and restore some of our Constitutional rights that have been trampled on by big business and the ultra-rich. The mission of this book is quite simple. Ideally I want to EDUCATE the American people with the knowledge that we must stand united. As individual workers and citizens we have been ignored for far too long. I want to EMPOWER the average American with the knowledge that only together can we be heard. I believe any goal can be reached, but only if we are committed to taking united steps forward daily. I want to MOTIVATE individuals to put aside the apathy, lack of hope, and pacifism that plagues America and to take daily action. With the help and power of social media, I intend to ORGANIZE a sufficient power base that can eventually force our politicians and the ultra-rich to listen to us, instead of their own greed. I believe that united together we can peacefully yet forcefully be heard, and most importantly, we can MAKE A DIFFERENCE. I believe that together we can bring about a fairer system where there is less disparity between the poor and the rich. I believe we can RESTORE DEMOCRACY and some of the constitutional rights and freedoms that have been taken away from us. And I also believe we can REMOVE THE MONEYOCRACY that exists within our government today. We can bring about a better system of government by stopping our politicians from selling their political access and influence to the banks, Wall Street, big business, and their other ultra-rich cohorts. And this all can be done if we can change America's spending habits by only 5 percent. I hope you will read this book and be motivated to join my financial revolt against the conspiracies of big money.Show More Show Less",
  "genres": [],
  "author": "L.B. Sommer",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/17182651-the-next-american-revolutionary-war"
}