{
  "title": "Unquenched",
  "description": "*** CHOOSE YOUR FAVORITE ENDING …!!!Jorie Dakelle has found her way into the hearts of her readers by soliciting their feedback and giving them a choice on how the book should end. “Everyone has their own ideas,” says Jorie, “so I gave them the chance to finish the book with the ending of their choice. Everyone is happy.”Jorie, a debut writer, cleverly creates three versions (third version to be released soon), all exactly the same, until the last chapter where each journey ends dramatically differently in order to cater to various tastes. “You would think that we all read different books,” said one of her readers. “We couldn’t stop comparing notes and wound up switching books so we could all read the other endings!”And that’s when Jorie decides to create a fourth version (not yet released) where she packages all of the endings into one book! She gives you a choice of which one to read, with the goal of experiencing the same book in many ways.Without giving away the ending, a slight variation on the book cover subtitle and the brief description below, helps the reader decide which version to buy. Unless the reader buys the fourth book with all the endings, it’s kind of a gamble as to which ending they will receive – but that’s the fun of it and that’s what all the buzz is about!!!*** Note: It is suggested that only one version of the UNQUENCHED series is purchased by each customer as the only change, from book to book, occurs in the last chapter. It is then that the characters take on completely different roles from the other versions and the story changes along with it.---------------------------------------------------------------- As a prisoner of her own experience, a young woman finds no other way to free herself of obsessive thoughts between two men except by telling her story.“A passion has erupted inside of me leaving me no choice but to share my story of dreams, emotions and experiences. By sharing it, I hope to set myself free.”Unquenched is about a tormented triangle filled with love and deception. It is about passions and dreams and discovering unquenched thirsts that lie deep within us. It is about the need to satiate our lust for life and not settling for anything less. It is about the thrill of adventure and taking risks to understand the complexity of simply feeling alive. This story is expressed through an unexpected romantic interlude that takes place in Indonesia and finds its way to New York.",
  "genres": [
    "Romance"
  ],
  "author": "Jorie Dakelle",
  "average_rating": "2.74",
  "url": "https://www.goodreads.com/book/show/17182950-unquenched"
}