{
  "title": "When I See You",
  "description": "She believes that love can never last, promises are usually broken, and true happiness is extremely elusive in the long run. He believes most risks are worth taking, the promises he makes can be kept, and love doesn't factor in his relationships any longer. They're both wrong. Jordan Holloway has never fully recovered from the unexpected deaths of her famous Hollywood parents. At 27, she is still slow to trust and remains uncertain about the true duration of love and happiness. Yet, it's been four years since she fell in love with Ethan when he rocked her world even as he marched off to war leaving her alone with their young son Max. Now, Ethan tells her this will be his last tour in Afghanistan and that soon the three of them will be together. Still anxious at his leaving again, Jordan extracts a promise for Ethan's safe return from Brock Wainwright, her husband's sniper partner and best friend. But, can she put all her trust in Brock and can he keep such a promise?At 29, Brock Wainwright fully embraces the dangerous life of a Navy Seal. He enjoys his freedom and not being committed to anyone; and, there's been a long line of women who can attest to that. Everything changes for Brock after he meets Jordan. When the two men return to Afghanistan, Brock's intent on keeping his promise to Jordan about keeping Ethan safe for a variety of reasons, including the most disturbing one of all, he is more than just attracted to his best friend's wife. This revelation plagues Brock on the battlefield and in a violent moment changes everything. PRAISE for WHEN I SEE YOU ★★★★★Owen's latest novel When I See You is intensely heartbreaking, at times achingly romantic, and will keep you turning the pages long into the dead of night. Owen's writing is beautiful; captivating...the storyline is compelling and emotionally driven. I dare you to put it down. \"This book is not a fast pace 'on the edge of your seat' mystery, not an erotica, no vampires or make believe animals this book. It's simply an emotional roller coaster that I highly recommend to everyone...\" JerseyGirl If you enjoy Nicholas Sparks' The Lucky One or Dear John and the twists and turns of storylines like those of Jodi Picoult, you've got to read When I See You.",
  "genres": [
    "Romance",
    "Military Fiction",
    "Contemporary Romance",
    "New Adult",
    "Death",
    "Chick Lit",
    "Contemporary"
  ],
  "author": "Katherine Owen",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/17183059-when-i-see-you"
}