{
  "title": "Greater Than Rubies",
  "description": "Robin Bartlett said, \"Yes!\" Will she say, \"I do,\" when the big day arrives?From his cultured handsome looks to his vast fortune, Antonio \"Tony\" Viscolli is every girl's dream. Robin comes from a blistering past, struggling for survival in a cold, cruel world. Robin never had a chance to dream of a white wedding gown or a prince charming. Instead, her dreams were nightmares -- dark and clouded with fear and desperation. By the time Tony thaws her heart, she has known hunger, poverty, violence, and want.For months, Tony courted the blond beauty with the sapphire eyes. He showered with attention, respect, and charm and covered her in diamonds, sapphires, and rubies. Finally, Robin came to understand God's love for her as imitated by the unconditional love Tony freely offered. On a sunny Florida beach, Tony proposed.Back in bitter cold Boston, doubts about becoming a billionaire's bride begin to burden her hopes for happiness. Robin struggles to cope with the never-ending details of the shower, ceremony, reception, and honeymoon; the prospects of changing her name and relocating; and the very public image she must suddenly adopt; all while dealing with her father's very serious legal problems.As the date draws inexorably near and the pressure mounts, Robin questions whether she is truly the woman God has made for him. Is she the girl of his dreams? His vast material wealth begins to overwhelm her. Nightmares from a forgotten past return in full force, reminding Robin of an even deeper and more terrifying prospect. Will she give in to her insecurities and cancel Boston's \"Royal Wedding\" for good? Or, with God's guidance, can Tony sacrifice everything to prove to his beloved Robin her true worth?",
  "genres": [
    "Romance",
    "Christian Fiction",
    "Christian",
    "Christian Romance",
    "Contemporary Romance",
    "Fiction",
    "Contemporary"
  ],
  "author": "Hallee Bridgeman",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/17183016-greater-than-rubies"
}