{
  "title": "Jako bychom dnes zemřít měli",
  "description": "Drama života, kněžství a mučednické smrti číhošťského faráře P. Josefa ToufaraAdvent 1949, zasněžená mrazivá Vysočina, nedělní dopoledne 11. prosince. V malém kostele v Číhošti se při kázání sedmačtyřicetiletého P. Josefa Toufara třikrát zakýval dřevěný oltářní křížek a zůstal zkroucen a vychýlen mimo těžiště. Pohyb křížku vidělo dvacet svědků. Následně se do rozbíhajícího církevního objasňování vlomila komunistická Státní bezpečnost. P. Toufar byl zatčen, unesen a mučením jej příslušníci StB nutili lživě doznat, že vše podvodně sestrojil. Toufarova mučednická smrt zhatila připravovaný inscenovaný monstrproces, nezastavila však otevřený útok komunistického aparátu proti katolické církvi.Autor této knihy se zdaleka nespokojil s tím, že by začal vypravovat životní příběh kněze Josefa Toufara (1902 až 1950) dnem jeho příjezdu do Číhoště. Dosud stál hlavní aktér příběhu stranou, nikde nebylo možné dočíst se, z jakých pocházel poměrů, co jej vedlo k rozhodnutí stát se knězem a jak dlouhá cesta vedla k vysvěcení. Základní pohnutkou k sepsání díla nebylo vyvrácení či potvrzení toho, zda se křížek skutečně v adventním čase roku 1949 tajemně zahýbal, ale naléhavá touha pochopit, kdo Josef Toufar byl a co všechno v jeho údělu předcházelo dějství poslednímu. Léta pátrání, shromažďování dokumentů, snímků i svědeckých výpovědí tvoří opěrný systém díla. Miloš Doležal nepojímá obsáhlý životopisný portrét patera Toufara jako chladné historické pojednání, nechybí v něm bezprostřednost ani humor, a přece ani o krok neustoupí požadavku na absolutní dokumentární věrnost, každou uvedenou informaci opírá o konkrétní nálezy v archivech a osobní svědectví pamětníků.Kniha Jako bychom dnes zemřít měli se skládá ze dvou rovnocenných částí, textové a obrazové. Vzniklý celek je také důkladně vyvedenou kronikou života jedné části Vysočiny v první polovině minulého století, krajiny, jež v sobě nese stigmata hrdinů a mučedníků. Spolu s autorem, pamětníky i fotografiemi putujeme po místech dnes zbořených, zatopených, či zjizvených necitelnými zásahy do krajinného profilu z dob komunismu. Ne náhodou říká básník a historik Zbyněk Hejda, že Miloš Doležal Vysočině vrací její paměť.",
  "genres": [
    "Czech Literature",
    "Biography",
    "Nonfiction",
    "History"
  ],
  "author": "Miloš Doležal",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/17183225-jako-bychom-dnes-zem-t-m-li"
}