{
  "title": "Noctuario",
  "description": "Thomas Ligotti, «el secreto mejor guardado de la literatura de horror contemporánea», según el Washington Post, nació en Detroit en 1953 y estudió en la universidad estatal de Michigan. Ha trabajado como editor asociado de la editorial Gale hasta 2001, año en que fijó su residencia en Florida. En 1996 reunió los mejores relatos de sus tres primeras colecciones de cuentos («Songs of a Dead Dreamer», 1986; «Grimscribe: His Lives and Works», 1991; y «Noctuary», 1994) en el volumen «The Nightmare Factory», que recibió el premio Bram Stoker a la mejor colección de relatos. En 2006 publica «Teatro Grottesco» y, finalmente, en 2010, el inclasificable «The Conspiracy Against the Human Race», una extraña combinación de guía literaria, tratado de filosofía nihilista y libro imaginario (extraído de su relato “The Shadow, the Darkness”). Descendiente en línea directa de Edgar Allan Poe y Howard Phillips Lovecraft, con quienes compone la insana, justa y necesaria Trinidad de la moderna Literatura Fantástica y Extraña, Thomas Ligotti es un escritor de ficción sobrenatural sin excusas ni condiciones, devenido ya en un clásico.Noctuario es una colección de relatos que se agrupan en tres partes: Estudios de sombra, Discurso sobre la negrura, y Cuaderno de la noche. Las historias reunidas en este “diario nocturno”, cuya escritura es tan minuciosa y cuidada como tenebroso y sutil es el hálito que las anima, nos introducen en un universo ominoso y desquiciado, poblado de sueños malsanos, de muñecas siniestras y extraños artilugios, de mentes hipersensibles y enfermizas. Todos estos fantasmas que conforman el extraño mundo de Thomas Ligotti se mueven entre la luz y la sombra, el sueño y la vigilia, lo Real y lo Irreal. Así pues, Noctuario es una crónica de las Tinieblas, una indagación narrativa sobre la esencia misma del terror, que cuestiona los cimientos sobre los que se asienta la realidad y la razón.",
  "genres": [
    "Horror",
    "Short Stories",
    "Fiction",
    "Weird Fiction",
    "Fantasy",
    "Lovecraftian",
    "Collections"
  ],
  "author": "Thomas Ligotti",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/17183444-noctuario"
}