{
  "title": "Goudstof",
  "description": "Ukhayyad krijgt van de leider van zijn Toeareg-stam een uitzonderlijk mooie, gevlektmgeving die er bestaat: de menselijke samenleving.Ibrahim al-Koni werd in 1948 geboren in Libië, nabij Gadamés. Hij groeide op in de woestijn als Toeareg en leerde op zijn twaalfde lezen en schrijven in het Arabisch. Na een studie aan het Maxim Gorky Institute in Moskou werkte hij enige tijd als journalist in Moskou en Warschau. In 1993 verhuisde hij naar Zwitserland. Al-Koni heeft een zeer omvangrijk oeuvre van zo n zeventig romans, verhalen- en dichtbundels, dat veelvuldig is bekroond.Jan Jaap de Ruiter (1959) is als arabist verbonden aan de Universiteit van Tilburg en bestudeert het Arabisch en de islam in West-Europa en Noord-Afrika en het Midden-Oosten. Hij neemt actief deel aan het debat over de positie van de islam in Nederland. Daarnaast vertaalt hij Arabische literatuur in het Nederlands. e mehari cadeau. Al snel zijn de jongeman en het dier onafscheidelijk. Maar Ukkhayad begaat veel misstappen: hij komt zijn belofte aan de godin Tanit niet na, hij trouwt tegen de wil van zijn vader met Ayur en wordt door de stam verstoten, hij geeft uit pure nood zijn mehari in onderpand en staat later zijn vrouw en zoon af aan een rivaal om hem terug te krijgen. En door het zakje goudstof dat hij ongewild in handen krijgt, komt zelfs zijn leven op het spel te staan.Ukhayyad slaat op de vlucht met zijn mehari. Terwijl in het noorden van het land een bloedige strijd wordt gevoerd tegen de Italianen en in het zuiden hongersnood heerst, trekken ze door de woestijn. In een spookachtige grot bij Jebel Hasawna wacht Ukhayyad uiteindelijk de komst van zijn bloeddorstige en goudbeluste vijanden af...Goudstof is een ontroerend verhaal over kameraadschap tussen mens en dier, over het barre bestaan in de woestijn en een parabel voor de overlevingsstrijd in de gevaarlijkste o",
  "genres": [
    "Fiction",
    "Libya",
    "Novels",
    "Africa",
    "Literature",
    "Literary Fiction",
    "Historical Fiction"
  ],
  "author": "Ibrahim al-Koni",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/17183564-goudstof"
}