{
  "title": "Deeply Superficial: Noel Coward, Marlene Dietrich, and Me",
  "description": "Michael Menzies has led the picaresque life many of us only dream of, and he sets it down with such wit and grace it's hard to know which to envy more, his wealth of once-in-a-lifetime experiences or his skill with a pen.”—Christopher Lloyd, Emmy Award-winning executive producer/writer of Modern Family and Frasier In this dazzling memoir that also serves as a dual biography of stage and film legends Noël Coward and Marlene Dietrich, film and music executive Michael Menzies chronicles in hilarious detail his life-long obsession with the theater in general and these two international superstars in particular. At age twelve, Menzies discovered the autobiography of actor/writer/composer Noël Coward and was consumed by it. Although still only a youth, Menzies identified hugely with Coward—so much so that he came to believe that he must be the star’s love child. But with whom? In a burst of inspiration Menzies worked out that his mother could only be Marlene Dietrich. The author then decides that as soon as he can he will voyage around the world to confront Coward and Dietrich in person and announce himself as their son. Yet even after he finally abandons his plan, Menzies continues his search for them—and their pasts—spending the rest of his life following in their footsteps, traveling to London, Paris, New York, Berlin, Switzerland, and Jamaica. Deeply Superficial is at once a warm and witty homage to these two legends and the lasting impact their spectacular careers left on the world—and on a twelve-year-old dreaming of fame in a faraway place. Michael Menzies has lived all over the world, and has worked with rock ’n’ roll promoter Bill Graham, impresario Sol Hurok, choreographer Agnes de Mille, Broadway producer Saint-Subber, and in film with the de Laurentiis family. He lives in Los Angeles.",
  "genres": [
    "Memoir"
  ],
  "author": "Michael Menzies",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/17184096-deeply-superficial"
}