{
  "title": "Hex of the Witch",
  "description": "It’s not paranoia when they are really out to get you…\nI’m Amber, potion and rune mistress and all round witch extraordinaire. I’ve spent half my life building my career and I finally feel like greatness is within my grasp. I’ve been working on a special potion, a potion that could change everything for witches and wizards everywhere. Unfortunately some people are allergic to change and will stop at nothing to keep the status quo.A price has been put on my head – and my enemies are coming for me. Vampyrs, ogres and black witches are gunning for me, and they want me dead by any means necessary. In their infinite wisdom, the coven council assigns me my very own griffin bodyguard – and of course, the one they assign is none other than my most hated enemy, Bastion.Bastion comes with his own baggage. He has a black witch’s curse upon him and it is slowly killing him. To save myself, I’m going to have to lift the curse and work with him – because another black witch is circling and she has me in her sights…I need to save my enemy, finish my potion, and hunt down the black witch – if she doesn’t kill me first.Don't miss this witchy series if you like humour, heart and a strong heroine with a slow burn, enemies to lovers, fade-to-black romance.Written in British English.Don't miss all the books in the Other Realm (Listed in optimal reading order)!The Glimmer Series - a Jinx Sharp adventureGlimmer of the OtherGlimmer of DragonsGlimmer of HopeGlimmer of ChristmasGlimmer of DeathGlimmer of DeceptionThe Other Wolf Series - a Lucy Barrett caperProtection of the PackGuardians of the PackSaviour of the PackThe Court Series - A Jinx Sharp taleChallenge of the CourtBetrayal of the CourtRevival of the CourtThe Other Witch - An Amber DeLea grimoireRune of the WitchHex of the WitchCoven of the WitchFamiliar of the WitchDestiny of the Witch",
  "genres": [
    "Urban Fantasy",
    "Fantasy",
    "Paranormal",
    "Action",
    "Magic",
    "Witches",
    "Young Adult"
  ],
  "author": "Heather G. Harris",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/171842644-hex-of-the-witch"
}