{
  "title": "White Girl Bleed a Lot: The Return of Racial Violence to America",
  "description": "Reading Colin Flaherty's book made it painfully clear to me that the magnitude of this problem is even greater than I had discovered from my own research. He documents both the race riots and the media and political evasions in dozens of cities across America.Thomas SowellNational ReviewColin Flaherty has done more reporting than any other journalist on what appears to be a nationwide trend of skyrocketing black-on-white crime, violence and abuse.WND.comWorld Net DailyThis is an important book. You must read White Girl Bleed a Lot.Rev. Jesse Lee PetersonSyndicated radio talk show hostMilt Rosenberg, WGN: ”My compliments to Colin Flaherty for White Girl Bleed a Lot. A very interesting book that points out an important problem that needs to be confronted.”John Derbyshire: “What’s happening, as the book makes indisputably clear is, first, black mob violence against nonblack persons and property, and second, appalling indifference, denial, and cover-up by police and the media.”Impeccably and carefully documented.Houston ExaminerThis is what makes the book White Girl Bleed a Lot, by award-winning author Colin Flaherty, such an astonishing read. It thoroughly documents what is nothing less than the modern rise of the race riot in America: dozens upon dozens of dozens of events with a clear racial component, many of them black-on-white or black-on-other-race assaults punctuated by blatantly racist hate speech. What makes it even more astonishing, though, is the prevalence of officials brushing over or covering up the truth.Global GeopoliticsImportant.WFLA radioMust read.Sevier County News.For the first time a new book breaks the code of silence and reveals the explosion of racial violence in more than 50 cities since 2010.Savannah Morning News",
  "genres": [
    "Nonfiction",
    "Politics",
    "True Crime",
    "Race",
    "Sociology",
    "Crime",
    "Anthropology"
  ],
  "author": "Colin Flaherty",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/17185409-white-girl-bleed-a-lot"
}