{
  "title": "Summer Queen",
  "description": "The Winter Queen is coming. And vengeance will be hers . . .Determined to save her family from an invading army, Nelay hires a smuggler to attempt a rescue behind enemy lines. A smuggler with a penchant for legends and a touch that threatens to melt every hard edge Nelay has honed over the years.  But their is no safety from the Winter Queen's wrath.If Nelay is to survive - if any of them are to survive - she must stop the Winter Queen. Even if that means she has to embrace the curse the fae gave her long ago. A curse that just might reduce her to ashes. To rise from those ashes, first she must burn.Fans of Sarah Maas and Leigh Bardugo will love the dark magic, forbidden romance, and daring adventure in Amber Argyle's Fairy Queens Saga. Read your copy now! \"I was completely drawn into SUMMER QUEEN, with its powerful heroine, detailed world, and unforgettable story. A captivating series!\" –Jennifer A. Nielsen, New York Times bestselling authorTwo immortal queens. A dying magic. A world to save . . . The FAIRY QUEENS SAGA is far more than a simple fairytale retelling. It's a deep dive into the Norse mythology surrounding Hans Christian Andersen's THE SNOW QUEEN. An origin story, the Fairy Queens Saga tells the stories of the Winter Queen (Ilyenna), her rival (Nelay), and Ilyenna's daughter (Elice). Reading order:1. Of Ice and Snow (Ilyenna's parents)2. Winter Queen (Ilyenna's story)3. Of Fire and Ash (prequel novella for Nelay's story)4. Summer Queen (Nelay's story)5. Of Sand and Storm (spin off novel)6. Daughter of Winter (Elice and Adar, star-crossed lovers desperate to escape the Winter Queen)7. Winter's Heir (Ilyenna, Nelay, Elice, and Adar all come together for the final showdown. Will they destroy each other or find a way to work together to save their dying world?)OTHER TITLES BY AMBER ARGYLEForbidden Forest SeriesLady of ShadowsStolen EnchantressPiper PrinceWraith KingCurse QueenWitch Song SeriesWitch SongWitch BornWitch RisingWitch Fall",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Romance",
    "Fairies",
    "Fae",
    "Fiction",
    "Paranormal Romance"
  ],
  "author": "Amber Argyle",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/17185326-summer-queen"
}