{
  "title": "The Descent Series: Vol.1",
  "description": "This is a collection of the first three titles in The Descent Series, which are gritty urban fantasy books about an exorcist, a witch, and their battles against the forces of Heaven and Hell. (Approx. 200,000 words total.)Books included:1. Death's Hand2. The Darkest Gate3. Dark UnionDEATH'S HANDElise Kavanagh doesn't want to hunt demons anymore. It's been five years since she killed her last enemy, and life has been quiet since then. She went to college. Got a job, and then lost it. Made a friend or two. Lived a normal life. Now her former partner, a powerful witch named James Faulkner, wants Elise to fight one more time. The daughter of a coven member has been possessed, and Elise is the only exorcist nearby.Becoming a hero again would mean risking discovery by old enemies. But digging into the case reveals that it might already be too late--bodies are disappearing, demons slither through the night, and the cogs of apocalypse are beginning to turn. Some enemies aren't willing to let the secrets of the past stay dead...THE DARKEST GATEWhen Elise Kavanagh retired from demon hunting, she swore it would be permanent. But an attack from a powerful necromancer forced her back into the business, and now she's trying to balance her normal boyfriend and normal job with everything supernatural.Mr. Black is a demon hunter gone rogue. He's enslaving angels and stealing ethereal artifacts in pursuit of forbidden immortality, and an old grudge drives him to make his final stand in Elise's territory. Destroying her life and killing her friends isn't the goal, but it's a definite perk.A demonic overlord offers to join against Mr. Black and protect Elise's loved ones. All she needs to do is ally with the demons she's sworn to kill, at the cost of her morals--and maybe her immortal soul. But once she crosses that line, there's no turning back.Nothing is sacred when Heaven and Hell collide on Earth...DARK UNIONEvery fifty years, the most powerful ethereal and infernal beings convene on Earth to resolve conflicts with mediation by kopides--humans born to police relations between Heaven and Hell. They're meeting in Elise Kavanagh's territory this year, and she used to be the greatest kopis in the world. But she's not invited.An old friend, Lucas McIntyre, asks her to attend the summit in his place. But when she arrives, she discovers that a human faction called The Union has taken charge of the summit, and they're not playing nice. Worse yet, someone has killed a prominent Union member... and now they're demanding blood.",
  "genres": [
    "Fantasy",
    "Urban Fantasy",
    "Paranormal",
    "Fiction",
    "Romance",
    "Amazon",
    "Witches"
  ],
  "author": "S.M. Reine",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/17185748-the-descent-series"
}