{
  "title": "Hanging Curve",
  "description": "In the bestselling tradition of Caleb Carr's The Alienist and Barbara Hambly's Fever Season, comes the latest installment in Tray Soos's critically acclaimed Mickey Rawlings mystery series. Expertly blending real events with fascinating fiction, Soos delivers a suspenseful, atmospheric slice of little-known American sports history.Mickey Rawlings, utility infielder for the St. Louis Browns, regrets that he's never had the chance to face some of the game's best players: those restricted to the Negro Leagues. So he's eager to accept an invitation to play against the East St. Louis Cubs, a black semi-pro team, even though he knows he'll be taking the biggest risk of his career. Baseball commissioner Kenesaw Mountain Landis doesn't want white major leaguers on the same field with black ball players. The only solution is for Mickey to play under an assumed name.But it's April, 1922, and Mickey is about to discover there's more at stake than winning a baseball game. East St. Louis is a city scarred by the events of 1917, when white residents massacred their black neighbors in the worst explosion of racial violence in American history. Five years later, lingering shadows of hate still hover over the community -- and when pitcher Slip Crawford leads his black team to victory, the Ku Klux Klan make their presence known, and Crawford is found dead.Now, everything Mickey has ever fought for and everything he has ever believed will be challenged. From a first hand view of segregation to meetings with stars of the new Negro National League -- including Cool Papa Bell and Oscar Charleston -- to a KKK rally in Indiana, Mickey sees a side of American life he's never experienced before.",
  "genres": [
    "Mystery",
    "Baseball",
    "Sports",
    "Fiction",
    "Historical Fiction",
    "Historical",
    "Historical Mystery"
  ],
  "author": "Troy Soos",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/1718623.Hanging_Curve"
}