{
  "title": "Seal of Doom",
  "description": "**Excerpt of Prologue and part of chapter 1 available to read-The seal of doom was opened when the veil between the realms was torn. From the seal came all manner of evil. The sky turned black with shadows and darkness swallowed the light of day. In time, humanity will disappear and the world will become hell on earthThey were subtle at first. Changes in residences or employment was common but there were other more personal changes that were deemed as best for society as a whole. People who didn’t like the changes simply vanished. There was quiet speculation that the people who didn’t fit in were “donated” to others in need of organs or for scientific purposes. Nobody really knows for certain what happened to them. The world had tumbled out of control. At first glance you would think nothing had changed but then you see it. People walking through town with their eyes averted and their lips tightly sealed. People were afraid. Afraid to talk. Afraid to smile. They were going through the motions of life but not really living. How could they enjoy life when no one could be trusted?The Nation we know is no longer governed by elected officials but by those controlling the money and dictating the direction of the economy. Financiers have shifted the balance of power and the world was only too happy to comply. The general population had no way of knowing that when they agreed to a one world economy that in fact they were sealing their fates. They are now at the mercy of a powerful new alliance between the financially elite and the new Lord Ruler. Cash was abolished and in its place are debit cards and microchips. People who don’t carry the card or have the chip can’t buy food or do any of the things they need to do in order to live in society. The world population is at the mercy of a new type of cartel. The elite who strive for total power and behind it all are the forces of darkness. The earth groans with pain as change comes. It is the dawning of another age and the old has become new again. Systematic destruction of the population is rampant. The ones who openly oppose the new order are publicly exterminated. They are replaced with versions of themselves- shape-shifters of sorts. Then there are the others. They are a handful of people who live on the fringe and risk everything to take a stand. ****I sit outside, my legs curled under me and drink a cup of coffee. The smell is strong and I am going to need the caffeine today. My breath makes streams of fog that curl in the chilly morning air. I can hear the gulls calling down by the docks and car horns in the distance. There is something disturbing about the normalcy of the morning. As though nothing has changed and life is business as usual.After taking a shower I quickly dress and make my way down the stairs. The old stairs creak with each step and I feel a strange chill. A sickening sense of sadness washed over me and I force myself to take hold of my thoughts. Nothing will ever be the same. The memories of fire, smoke, death and intense fear come and go. I am no longer the person I was a year ago. I have seen horrible things and become a sort of monster myself. Kill or be killed is my new way of life. The worst part being, that the people I cared about are targets, just by association with me. My hometown is a strange place. It’s become a place of deception. By all appearances it looks the same as the day I left but underneath there is something sinister. Like most places in the world it has evolved into something else. Flags of the new America hang in the government buildings and even on some of the businesses. Many people still believed that the new America will be a better place. Truth is- it’s all a lie.",
  "genres": [],
  "author": "M.L. Woolley",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/17186959-seal-of-doom"
}