{
  "title": "Enemy Combatant",
  "description": "The searing story of one man's years inside the notorious American prison--and his Kafkaesque struggle to clear his name.\"Under the hood I felt I couldn't breathe properly....Flashing lights--obviously from soldiers' cameras taking trophy pictures--came and went in front of me, despite the hood's darkness. From beside me a voice said in Arabic, 'Shall we pray, brother?' A guard came and screamed in my ear, 'Shut up, motherfucker, if you speak again I'll kill you.'\"--from Enemy CombatantGuantanamo Bay, Cuba, has become a worldwide symbol of the dark side of America's War on Terror. Here, for the first time, is a powerful and moving story from the other side, the first detainee's account of life inside the notorious prison. A highly educated British Muslim, Moazzam Begg spent three years in U.S. custody, nearly two of them in Guantanamo, before being released without charge in January of 2005. Enemy Combatant, written with respected UK journalist Victoria Brittain, is the wrenching narrative of Begg's detention, including his eighteen months in solitary confinement. Secretly abducted at midnight from his home in Afghanistan, held incommunicado in Kandahar and Bagram Air Force base, Begg was eventually flown to Guantanamo, where, like more than 800 Muslim men and boys--550 of whom remain in custody--he was held in shackles and the now-trademark orange prison uniform, subjected to relentless interrogations and abusive and degrading conditions.A riveting, personal story by a thoughtful and eloquent man, Enemy Combatant is a uniquely personal indictment of America's establishment of a global gulag that flouts the Geneva conventions--one of the great miscarriages ofjustice in our time.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Biography",
    "Memoir",
    "History",
    "Biography Memoir",
    "Islam"
  ],
  "author": "Moazzam Begg",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/100866.Enemy_Combatant"
}