{
  "title": "Pussy Cat Club",
  "description": "She's a firecracker, a stripper without compare, and her bouncer friend is worried that her ego is too big to contain.Legrasse knows what she needs in order to get back on the straight and narrow. She needs to be treated like a slut, to be used and whipped and spanked until she cries. It's a bitter pill to most, but Scarlett isn't most people. She willingly gives him full control over her.This work contains graphic scenes of rough anal sex, a dominant man, a wicked belt and a horrible tease of a stripper that gets what's coming to her. There's also some lesbian action between two hot strippers as they're watched by a customer - and an interloping bouncer. It is intended for adult readers. An terrifyingly hot short of over 7,000 words.~~Excerpt:He sat and watched the women's slow and careful movements as they eagerly drained the customer's pockets dry, Legrasse's large hands rested on his own thighs. He leaned back, casually, watching as Scarlett took over and was consumed by the ecstasy of her tongue trailing down Cassandra's breasts, over the cusps of her top, then down to encircle the belly button. She teased it with her adept tongue, jade eyes not leaving the man at her mercy.The other woman was pressed back to the bed, her hair fanned out around her pretty face, her thick eyelashes closed and showing the smoky cocoa eye shadow she had applied earlier in the night. There was a slight crease to it at the tops, which Scarlett both held against the girl and found endearing.Legrasse shifted in his seat, the smoky air hindering his sight, his eyes squinting faintly as he leaned forward to get closer to the glass. She looked right at him, or, at least, where she assumed him to be, her thong clad ass facing the customer as she wantonly pulled her breasts free of their meagre confines. Letting the bikini strings sit to the side of either of her large tits and underneath, the material pressed them together and allowed them to hang before leaving them to the affects of gravity.Scarlett pulled Cassandra's thong to the side, treating both of the voyeurs to a long and slow tease as she bobbed in closer and closer, her kittenish tongue at the ready as it first found the tip of her thigh, then delved lower and lower until finally that sweet, smooth taste hit her. Her tongue ran along the other woman's outer lips before parting deeper, the back of her tongue tracing up against her inner petals.Cassandra had let out a gasp but she was easily silenced by another skilful lash of the pink tongue, turning the woman's sound of surprise to one of bliss. Her tongue slowly wound around the woman's clit, lavishing attention on it, Scarlett's eyes still locked on that mirror, enjoying the sight of her eating the other woman's cunt and knowing exactly what Legrasse was seeing on the other side.",
  "genres": [],
  "author": "J.M. Keep",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/17187752-pussy-cat-club"
}