{
  "title": "The Death Series: Volume One",
  "description": "3 books in 1 DEATH WHISPERS (#1)DEATH SPEAKS (#2)DEATH INCEPTION (#3)(App. total word count 235,000)DEATH Almost fifteen-year-old Caleb Hart is a Cadaver-Manipulator in the year 2025. When teens receive a government-sanctioned pharmaceutical cocktail during school, paranormal abilities begin manifesting... making the teens more powerful than the adults.After Caleb discovers he has the rare, Affinity for the Dead, he must do whatever it takes to hide it from a super-secret government agency whose goal is exploitation.Caleb seeks refuge in his new girlfriend, Jade, until he realizes that she needs as much protection from her family, as he does from the government.Suddenly, Caleb finds that hiding his ability while protecting Jade and his friends is a full time job; can he escape the government, protect Jade and lose the bullies that are making him miserable?App. 119,000 word count.DEATH Caleb's in high school now and thinks the chaos of last year is behind him. Unfortunately, a serial killer is on the loose and children are his victims. Caleb agrees to help the police apprehend the murderer...until the killer takes notice of Caleb and his paranormal friends.Carson and Brett remain the bullies they always were and their posse continues to grow. How long can the two groups stay out of each others' way before there's a firestorm of retribution...The Government Graysheets continue to keep tabs on Caleb's every move while Jade's family threatens their relationship. Can they still be together even when events threaten to tear them apart?App. 92,000 word count.DEATH Kyle Ulysses Hart and his team of scientists mapped the human genome in the year 2010. As Brain Impulse Technology came online... so did the long arm of the United States government. A covert, military-driven regime was born with genetic manipulation the key to future widespread control.When pharmaceutical laboratories, funded by the Graysheets, discover a way to unlock paranormal potential through compulsive inoculation, their exploitative dream is realized.Clyde and Caleb's lives are predestined to intertwine as they cross paths, his history becoming Caleb's future.A lone teenager named Jeffrey Parker, falls prey when he manifests the rare, Affinity for the Dead.The Graysheets abandon all pretense of stewardship, ripping him from his family for their nefarious purposes.Can Jeffrey remain who he was destined to be in an environment exclusively built for mass control?App. 24,000 word count.Suggested reading order for The Death DEATH WHISPERSDEATH SPEAKSDEATH INCEPTIONDEATH SCREAMSDEATH WEEPSUNREQUITED DEATH",
  "genres": [
    "Fantasy",
    "Paranormal",
    "Young Adult",
    "Amazon",
    "Zombies",
    "Horror",
    "Dystopia"
  ],
  "author": "Tamara Rose Blodgett",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/17187819-the-death-series"
}