{
  "title": "The October Horse",
  "description": "In her new book about the men who were instrumental in establishing the Rome of the Emperors, Colleen McCullough tells the story of a famous love affair and a man whose sheer ability could lead to only one end -- assassination. As The October Horse begins, Gaius Julius Caesar is at the height of his stupendous career. When he becomes embroiled in a civil war between Egypt's King Ptolemy and Queen Cleopatra, he finds himself torn between the fascinations of a remarkable woman and his duty as a Roman. Though he must leave Cleopatra, she remains a force in his life as a lover and as the mother of his only son, who can never inherit Caesar's Roman mantle, and therefore cannot solve his father's greatest dilemma -- who will be Caesar's Roman heir? A hero to all of Rome except to those among his colleagues who see his dictatorial powers as threats to the democratic system they prize so highly, Caesar is determined not to be worshiped as a god or crowned king, but his unique situation conspires to make it seem otherwise. Swearing to bring him down, Caesar's enemies masquerade as friends and loyal supporters while they plot to destroy him. Among them are his cousin and Master of the Horse, Mark Antony, feral and avaricious, priapic and impulsive; Gaius Trebonius, the nobody, who owes him everything; Gaius Cassius, eaten by jealousy; and the two Brutuses, his cousin Decimus, and Marcus, the son of his mistress Servilia, sad victim of his mother and of his uncle Cato, whose daughter he marries. All are in Caesar's debt, all have been raised to high positions, all are outraged by Caesar's autocracy. Caesar must die, they decide, for only when he is dead will Rome return to her old ways, her old republican self. With her extraordinary knowledge of Roman history, Colleen McCullough brings Caesar to life as no one has ever done before and surrounds him with an enormous and vivid cast of historical characters, characters like Cleopatra who call to us from beyond the centuries, for McCullough's genius is to make them live again without losing any of the grandeur that was Rome. Packed with battles on land and sea, with intrigue, love affairs, and murders, the novel moves with amazing speed toward the assassination itself, and then into the ever more complex and dangerous consequences of that act, in which the very fate of Rome is at stake. The October Horse is about one of the world's pivotal eras, relating as it does events that have continued to echo even into our own times.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Roman",
    "Italy",
    "Egypt",
    "Ancient History"
  ],
  "author": "Colleen McCullough",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/1718801.The_October_Horse"
}