{
  "title": "Christmas is for Bad Girls",
  "description": "Five sassy funny Christmas stories from five bright new romance talents. Come enjoy the holidays with our bad girls and their lovers! Available from Elm Books: http://elm-books.comExcerpt from \"A Partridge in Pear Treacle\" by P.K. Tournes Cory pulled the door open enough to slip out into the kitchen, and was almost immediately engulfed by the arms of Mr. USDA, the Grade A Beef rent-a-cop.“Oh, thank you! Aren’t you sweet?” she purred up at him. With anyone else, she probably could have just grabbed a tray and headed out of the kitchen, but she could see the wheels turning behind those hard hazel eyes. He still thought he was going to kick her out! Damn, what a hard ass. Dropping the wounded kitten act, she opted for shock and awe. She really only needed ten minutes to get through the party set-up and up the stairs. She was pretty sure she could buy that much time.“You’re not really going to kick me out, are you? Do you think I’ve got weapons on me? What you see,” Cory pulled her blouse up, pressing her breasts together and lifting them out of the lace that held them, “is what you get.” Triumph swirled in her as she watched his pupils darken. She wasn’t done yet. Smoothly lowering her blouse, she let her hands flow over her stomach and down her legs, gently rotating them open. Cory hooked her thumbs in the skirt hem, lifting it as she ran her hands back up the length of her inner thighs. She stopped just short of her panties, her legs open just enough, thumbs out of sight in a way that she knew left little to the imagination. “This is the only weapon I have, and I don’t know if we have enough time for you to disarm it.” His mouth was still hanging open as she and her tray of Christmas goodies left the kitchen. Excerpt from \"A Very Chunky Monkey Christmas\" by M.M. Ardagna She saw a tall, dark-haired man coming down the side aisle, headed the same way, poised to reach her destination mere steps ahead of her. He looked vaguely familiar, but she couldn’t quite place him. As she caught up to him, she watched in dismay when he reached for—she scanned the shelves—what appeared to be the last carton of her favorite ice cream. “You can’t have that,” she blurted out. “It’s mine.”He turned to face her. “Pardon me?” She stared into silver-gray eyes surrounded by insanely thick black eyelashes. Him! Her heart started beating faster. No wonder she hadn’t quite recognized him. He’d only come into the restaurant a few times, and that had been more than two years ago. His dark brown hair was longer now, curling over the collar of his jacket, but he still had the same pale skin and square jaw, and she would recognize those eyes anywhere. She would have expected gray eyes to be cold, but his had always seemed warm and friendly.He dropped his hand, leaving the ice cream on the shelf. Seeing her opportunity, she reached past him and grabbed it.“Hey!” He grabbed for it again. “What are you doing? I was here first.”“No. I mean, yes, you got here first, but I was already on the trajectory toward the freezer when you turned in front of me. If we were playing basketball, that would be a foul, wouldn’t it?” She was babbling, and she knew it. Perhaps she ought to let him have the ice cream. But she really, really wanted it. In fact—“Please, let me have this ice cream. I need it.” She yanked at it to make her point, but his grip didn’t budge.“You need it? What if I need it, too?”Excerpt from \"Noisy Night\" by Yvette FranklinI fucked God. And then I was screwed. You know Henry Darden, the guy with the most incredible voice in the whole world, the one who plays God in all those different movies? Yeah, that guy. And it was totally my fault.We were at a fabulous Cinco de Mayo party given by that cute Latino actor from the last James Bond movie. Never seen so much tequila. I was wearing the dress that never fails, a little black thing that makes my boobs look like DDs and my waist look like Barbie’s. And my red Jimmy Angelo Fuck Me Pumps. With no panties. And of course I am Manda Spellman, the second coming of Marilyn Monroe, the Pamela Anderson with real tits.He was drunk and flirtatious. I was drunk and horny as hell. He put a hand on my ass, and I decided I wanted him so bad that I dragged him out behind the pool house. He objected that he was married, but I just ran my hand down his very nice if a little elderly body. His views on the sanctity of marriage changed after copping a feel of my luscious breasts, and we allowed nature to take its course.Best cheap and dirty quickie I ever had. I just unzipped his pants, straddled that long, strong cock of his, and wham—he came. Then I came so hard I almost fell off my shoes. The sensation started at my groin and spread in fast, fiery jolts through every fiber of my body. It was like lightning hit. The perfect Erica Jong zipless fuck.The lightning of God is a powerful force. Given I had not seen fit to use any protection, my ovaries did not stand a chance. Yes, Manda “I know exactly what I am doing” Spellman got knocked up. Excerpt from “Mistletoe in Minnesota” by Jess Allyn “Keep the change. Thanks.”“Thank you, miss. Have a good Christmas!”Emily flashed a smile and nodded as she took her luggage from the cab driver. As he drove away, she stood in the snow and stared at the large house in front of her, tears welling up to sting her eyes in the crisp, frigid air. Aunt Marjorie, I wish you were still here.Sniffling and wrapping her scarf tighter around her throat, she set her shoulders and stepped forward, digging the unfamiliar keys out of her purse even as she dragged her suitcase along the long driveway to the front porch. At the front door, she paused, turning to survey her surroundings. To one side of the house, the grounds extended into a wooded area along a creek, rising up on the far side to more wooded cliffs. The property line ended in the middle of the creek, but since the other side was virtually impossible to develop, the grounds afforded privacy and quiet—both qualities that her Aunt Marjorie had enjoyed. Not far beyond the hedge along the perimeter on the other side, she saw a smaller, cozy house with smoke billowing merrily from the chimney. She shivered in the cold and wished for a fire to warm her. To her surprise, she saw someone exiting the house and jogging a beeline toward her. Although she was in a small town, and remembering the stories her Aunt Marjorie had told her of the friendliness in the tight-knit community, Emily was still aware that she was a stranger, alone, and she transferred the keys to her other hand while she dug in her purse to clutch her pepper spray, ready to strike if she felt threatened. There were some lessons that being a young woman at a large, urban university taught well.The bundled-up figure approaching resolved into a man who looked to be in his early 30s, hazel eyes, auburn Van Dyke beard, and silver hoop earrings peeking out below the black knit cap covering his head and ears. His smile revealed dimples in his cheeks as he stopped on the porch steps. He tugged his fleece-lined glove off his right hand and extended it to her, saying, “Hello and welcome. My name is Lars. Lars Andersen. I live next door—obviously.” His smile quirked into an abashed, lopsided grin. “Marjorie Nichols was a great friend of mine. I’m assuming you knew her, too.”Excerpt from \"Sprig of Holly\" by Lily Callahan“I have a request. Would you by any chance consider posing as my fiancée?”Galatea said nothing, just stared at him with an unreadable expression. John was drawn into the pools of her deep green eyes and found himself way over his head. He began to backtrack and try to explain himself, appalled at his presumption. “You would make an ideal wife for a scholar such as myself, but we do not know each other very well, perhaps this would be a chance for us to get to know each other better. A respectable and lovely lady like yourself, I am sure you have many other options, but I would be most grateful if you would consider it.” He could tell he was babbling madly, digging himself into deeper trouble with every word. He finally stopped. The silence in the room felt like a solid object between them.Galatea was assaulted by waves of emotions...hope, despair, amusement. John Melford was just the sort of gentleman she had dreamed of marrying before she had sold her soul to the stage and her body to Green Room admirers. For four years she had adopted whatever persona was asked of her. To three lovers, she had sold her most intimate favors. She could do what he asked of her with a practiced ease, but the idea of the deceit pained that small part of her that was still innocent Abigail. She finally broke the silence. “I am afraid, Mr. Melford, that I am not particularly respectable.” She channeled Cleopatra, the irresistible lover, and arched her neck back in invitation, glancing sideways at him with lust in her eyes. She could feel Mr. Melford’s interest, the gentlemanly desire that had been simmering within him since they had met. Just as he began to respond to this new version of herself, she turned businesslike. He blinked as she transformed once again into a young innocent. “I would be happy to pose as a respectable young lady in exchange for a favor from you.”Who is she? thought John as he felt himself pulled and pushed by the lovely woman shifting characters in front of him.",
  "genres": [
    "Christmas",
    "Holiday",
    "Romance"
  ],
  "author": "M.M. Ardagna",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/17188845-christmas-is-for-bad-girls"
}