{
  "title": "Consolation",
  "description": "“There is a vast part of this city with mouths buried in it . . . . Mouths capable of speaking to us. But we stop them up with concrete and build over them and whatever it is they wanted to say gets whispered down empty alleys and turns into wind. . . .” These are among the last words of Professor David Hollis before he throws himself off a ferry into the frigid waters of Lake Ontario. A renowned professor of “forensic geology,” David leaves in his wake both a historical mystery and an academic scandal. He postulated that on the site where a sports arena is about to be built lie the ruins of a Victorian boat containing an extraordinary treasure: a strongbox full of hundreds of never-seen photographs of early Toronto, a priceless record of a lost city. His colleagues, however, are convinced that he faked his research materials.Determined to vindicate him, his widow, Marianne, sets up camp in a hotel overlooking the construction site, watching and waiting for the boat to be unearthed. The only person to share her vigil is John Lewis, fiancé to her daughter, Bridget. An orphan who had come to love David as his own father, John finds himself caught in a struggle between mother and daughter–all the while keeping a dark secret from both women.Interwoven into the contemporary story is another narrative set in 1850s: the tale of Jem Hallam, a young apothecary struggling to make a living in the harsh new city so he can bring his wife and daughters from England. Crushed by ruthless competitors, he develops an unlikely friendship with two other down-on-their-luck Torontonians: Samuel Ennis, a brilliant but dissolute Irishman, and Claudia Rowe, a destitute widow. Together they establish a photography business and set out to create images of a fledgling city where wooden sidewalks are put together with penny nails, where Indians spear salmon at the river mouth and the occasional bear ambles down King Street, where department stores display international wares and fine mansions sit cheek-by-jowl with shantytowns.Consolation moves back and forth between David Hollis’s legacy and Jem Hallam’s struggle to survive, ultimately revealing a mysterious connection between the two narratives. Exquisitely crafted and masterfully written, Michael Redhill’s superlative book reveals how history is often transformed into a species of fantasy, and how time alters the contours of even the things we hold most certain. As complex and layered as the city whose story it tells, Consolation evokes the mysteries of love and memory, and what suffering the absence of the beloved truly means.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Canada",
    "Book Club",
    "Historical",
    "Literature",
    "Literary Fiction"
  ],
  "author": "Michael Redhill",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/1718914.Consolation"
}