{
  "title": "رتوش اللوحة",
  "description": "رواية \" رتوش اللوحة \" هي رواية اجتماعية تتضمن لمحات سياسية وتقع في 288 صفحة من القطع المتوسط ، وتتناول عدة شخصيات تعبر عن فئات مختلفة من المجتمع المصري وترتبط هذه الشخصيات إما بعلاقات الصداقة أو القربى أو الجوار المكاني ، حيث يربط حي \"باب اللوق\" وكذلك منطقة \"وسط البلد\" بين معظم شخصيات الرواية ، وتتعرض الرواية للتطور النفسي لهذه الشخصيات تبعاً لتعقيدات الحياة التي تواجههم والتي يظهر من خلالها أيضاً جانب من الفساد بشكل جزئي حيث تطرح الرواية من خلال الشخصيات والأحداث عدة قضايا من صميم المجتمع المصري وتركز على التحليل النفسي والاجتماعي لشخصياتها بكل جوانبها الإنسانية وتتضمن إسقاطات سياسية من واقعنا المصري منذ عدة عقود وصولاً إلى إرهاصات ثورة 25 يناير وذلك دون إقحام فج للسياسة في ثنايا الأحداثوتتخلل الرواية بين حين وآخر في ثنايا سطورها إسقاطات تاريخية وأدبية في لمحات سريعة من كل من التاريخ الفرعوني القديم والتاريخ العربي والإسلامي وألف ليلة وليلة والأدب الروسي وتتوالى أحداث الرواية عبر فصول متصلة الأحداث جاءت عناوينها كالآتي: وسط البلد، ليلة سلام ، كلاكيت ألف ليلة وليلة ، مجرد لفتة جـِـيد ، كلاكيت ميتروبوليس ، حلم والا علم؟ ، الشك ، أرصاد الكنز ، كلاكيت نادنكا ، استـُضعفوا في الأرض ، ديكونستركشن ، منطق الإسكافي والضرير ، عينا الفلاح الفصيح ، النيات الحسنة ، المـَجـاز ، اليد صاحبة الرجاء ومن بعض جمل الرواية : \" لم يكن علي ممعناً في الركض إلى أفق بعيد في خياله وتصوره حين خطر بباله الفلاح الفصيح لدى رؤيته تلك العينين الحزينتين لذلك الأب ، بل كان سطوع هذه الصورة العابرة فجأة في ذهنه من المصادفات والومضات الروحية الغريبة التي ليس لها تفسير .. فمن الصدف الغريبة أن زملاء الموظف الكبير الفاسد \" تحوت نخت \" الذي ظلم الفلاح الفصيح \" خونانوب \" في تلك القصة المصرية القديمة قد تواطأوا هم أيضاً ضد هذا المظلوم منحازين إلى صف زميلهم الموظف الكبير... إلى أن تحقق العدل في النهاية وتم إنصاف الفلاح الفصيح ، ولكن ليس قبل تسع شكاوى مريرة أرسلها ذلك الفلاح المسكين للوزير \" رنسي \" ، يبدو أن الانحياز بالباطل للزميل المخطئ هو أيضاً أحد الطقوس المصرية الصميمة المتوارثة منذ قديم الزمان .. \" كما تقام يوم الأربعاء القادم 30 يناير 2013 بإذن الله ندوة بالمقهى الثقافي بمعرض الكتاب من الساعة الواحدة ظهراً إلى الثالثة عصراً عن رواية \" رتوش اللوحة \" للكاتبة لمياء مختار ، يناقش الرواية كل من : الروائية الأستاذة سلوى بكر ، الروائي والصحفي الأستاذ محمد شمروخ ، الكاتب والناقد الأدبي د. حسام عقل ، الكاتب الأستاذ أسامة ريان ، بالإضافة إلى كاتبة الرواية لمياء مختار ، والمقهى الثقافي يشرف عليه الشاعر والناقد الأدبي الأستاذ شعبان يوسفثم يعقب الندوة حفل توقيع لرواية \" رتوش اللوحة \" بجناح دار العين بصالة 4 بمعرض الكتاب ، يعقد حفل التوقيع من الساعة الرابعة أو الرابعة والنصف مساء إلى الخامسة أو الخامسة والنصف مساءوقد كتب الناقد الأدبي الكبير د. جابر عصفور مقالاً بجريدة الأهرام بتاريخ الاثنين 16 يوليو 2012 عن رواية \" رتوش اللوحة \" بعنوان : لوحة جيل شاب ، ونص المقال :رواية رتوش اللوحة هي الرواية الأولى للكاتبة الشابة لمياء مختار‏.‏ وقد صدرت الرواية عن دار العين التي أخذت تضيف بقوة إلى المشهد الروائي المعاصر‏،‏ خصوصا إبداع الأجيال الجديدة التي أخذت تصوغ ملامحها الإبداعية الخاصة التي تمايز رؤيتها أو- بمعني أدق- رؤاها المائزة عن العالم.ورواية لمياء رواية تكوين شريحة من جيل ولد مع زمن السادات، وعاصر زمن مبارك إلى أن أسهم في الثورة عليه آملاً- ولايزال- في تغيير جذري للنظام الذي لم يرحل بعد. والعلامة الأولي على تشكل الوعي السياسي لهذا الجيل هي انتفاضة الخبز في يناير 1977 التي رأى أحد الأبطال الأساسيين للرواية بعض آثارها على زملائه من الطلاب القدامى حين كان في سنته الأولي في كلية الطب.ولذلك يمكن تحديد الزمن الروائي في رتوش اللوحة بأنه يبدأ من بعد هزيمة 1967 وموت عبدالناصر وتولي السادات الحكم في مطلع السبعينيات إلى امتداد حكم مبارك لثلاثين عاما، انتهت بالثورة عليه. أعني الثورة التي نرى بداياتها في نهاية الرواية، حيث يبرز جيل أشب يساهم في أحداث الثورة، علي نحو ما فعل ابن البطل الأساسي نفسه الذي سبقت الإشارة إليه.والبطولة في الرواية جماعية، إذ تتوزع أحداثها على عشر شخصيات تقريبا، تربط بين كل اثنين منهم علاقة ثنائية، هي ثنائية تواز أحيانا، وثنائية تضاد في أحيان أخرى. وتتوزع الثنائيات في تراتب طبقي، أعلاه الشريحة العليا من الطبقة المتوسطة، وأدناه الشريحة الأكثر فقرا التي تتجاور مع الشريحة الفقيرة من معذبي الأرض في المجتمع. وتمضي حياة الأبطال عبر زمن صاعد، ينقلهم من الطفولة إلى النضج، ومن أول التعليم إلى ما بعد التخرج، حيث تتباين المصائر نتيجة تفاعل كل شخصية مع واقعها الخاص والعام، خاضعة لكل المؤثرات التي تمايز ما بين الشخصيات من ناحية، وتسهم في تكوين اللوحة الروائية التي تتولى تصوير حياة الأبطال الأساسيين والفرعيين بكل رتوش اللوحة وتفاصيلها من ناحية موازية. وهي الدلالة التي ينبني عليها عنوان الرواية: رتوش اللوحة. أعني دلالة لا تبتعد كثيرا عن حيوات الأبطال الذين يبدون كما لو كانوا انعكاسات متغايرة الخواص للمؤلف المضمر الذي ليس متورطا بحكم النشأة في نشاط سياسي مباشر، فالأبطال كلهم عينات لشرائح اجتماعية، تتأثر بأحداث وطنها، ويحركها شعورها الوطني لكن دون أن يكون واحد منها عضوا في حزب، أو جماعة، فهم جميعا يحملون الهموم الوطنية نفسها، بحسب الوضع الطبقي (ومن ثم الوعي الطبقي) لكل شخصية من الشخصيات. ولذلك نراهم بعيدين عن النشاط السياسي الذي يتخذ شكل الانتماء إلى جماعة سرية أو علنية، أو حتي حزب. والمسارات المتوازية أو المتعارضة التي يمضون فيها، خلال الزمن الروائي، هي مسارات تحدد الملمح النوعي للرواية من حيث هي \" رواية تكوين \" نرى فيها تعاقب أشكال التفاعل الاجتماعي التي تجعل الأبطال على ما هم عليه. وانتماء أغلب الأبطال للطبقة الوسطى بشرائحها المختلفة يجعل منهم نماذج لأبناء هذه الطبقة التي هي العمود الفقري للمجتمع المصري. وهي الطبقة التي تنتج اليمين واليسار، في كل تنوعاتهما الفكرية، والتي هي منبع الفضائل والرذائل علي السواء. وهي الصفات التي قامت بتأصيلها روايات نجيب محفوظ على وجه التحديد، خصوصا في مرحلته الاجتماعية. وإذا كان محفوظ كتب عن القاهرة 30 ومضت الأجيال المعاصرة له أو اللاحقة له في الكتابة عن قاهرة الأربعينيات والخمسينيات والستينيات، فإن جيل لمياء مختار يكتب عن قاهرة الثمانينيات والتسعينيات إلى مطالع القرن الحالي الذي شهد نهاية زمن وبداية زمن لم تتشكل ملامحه بعد. ولذلك نرى في رواية لمياء شخصية علي الانتهازي الذي يغدو أستاذا في كلية الطب مجاملة لأبيه الأستاذ الكبير، ويتنقل ما بين ملامح الفساد، بعد أن فقد حلم البراءة الذي كانت تجسده مروة زميلته التي تنتسب إلى شريحة اجتماعية أدنى، ويظل علي البرجوازي على ما هو عليه من انتهازية إلى أن ينال عقابه القدري بمرض ابنه. وفي مقابل شخصية علي شخصية أخته نورا التي تفضي أزمة وفاة والدتها بها إلى الانغماس في التدين والإفراط فيه، لعلها تهرب من مأساتها، فينتهي بها الحال إلى الوقوع في شباك جماعات التطرف الديني، فتنفصل عن صديقتها أسماء التي تمثل التدين الوسطي والعقلانية المدنية، وذلك في ثنائية ضدية توازي الثنائية نفسها التي تصل بقدر ما تفصل بين علي ومجاهد، وتمضي الثنائية الضدية نفسها لتصل بقدر ما تباعد بين مروة وعلي، وبين أحمد وهديل، وذلك مقابل علاقة التوازي التي تصل بين مسار عبير ومجاهد. وظني أن غلبة الثنائيات الضدية على علاقات الشخصيات إنما هي علامة على زمنها الروائي وزمنها التاريخي في آن.ويفرض نوع الرواية، من حيث هي رواية تكوين، حضورها على تقنية الحكي، فالراوي يبدأ من الزمن الحاضر، عائدا إلى نقطة البداية للتعاقب التاريخي لحيوات الشخصيات، وذلك على هيئة حركة بندولية جزئية للزمن، لا تتعارض مع المسار الكلي للاسترجاع، حتي لو أدت إلى ارتباك السرد في بعض المواضع. وهو أمر يشفع له قدرة التشويق في القص، ورسم ملامح الشخصيات، وإيقاع التوازن بينها، وذلك في نسيج لا يخلو من علاقات التناص والإشارات إلى الأعمال الإبداعية التي تسهم في تحديد التوازي بين الزمن الروائي والزمن التاريخي.قد يجد القارئ الخبير بالفن الروائي بعض الاستطرادات هنا أو هناك، وبعض الإسراف في النزوع الأخلاقي، وشيئا من التورط في اتخاذ مواقف سياسية، أو تسطيحا لبعض المواقف، ولكن كل هذه الهنات هي ضريبة البداية التي قد تقترن ببعض الرعشة التي تصيب الأصابع التي تضع رتوش اللوحة. وهي رعشة يغفر لها النتيجة التي تدل عليها اللوحة نفسها بكل ما تنطوي عليه من وعد بما هو أكمل.",
  "genres": [],
  "author": "لمياء مختار",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/17189554"
}