{
  "title": "Her Two Billionaires",
  "description": "From New York Times and USA Today Bestselling Author Julia Kent comes the third in the Her Billionaires series... TWO MEN WITH TWO ENORMOUS...SECRETS Dylan Stanwyck and Mike Pine are looking for a certain kind of woman. The firefighter and ski instructor aren't picky - blonde, brunette, Asian, African-American, Caucasian, athletic, Rubenesque, boyish - any type will do, but there is one pesky little deal breaker - she needs to want a long-term threesome. So far, that's caused some problems as Dylan took to the dating field and found no takers, search for someone he and Mike could share. Laura Michaels fits the bill - they hope. Working class stiffs who become accidental billionaires in a mysterious turn of events involving their dearly departed longtime lover's estate, the men are looking now for a third to complete them. When Dylan discovers Mike's gone behind his back and slept with Laura, the deception makes them both realize that they want Laura, desperately - to be their permanent third. The question is - how can they untangle the web they've caught them all in? Will Laura flee when she learns the truth? WHAT THEY DON'T KNOW IS THAT (SOME OF) THEIR SECRETS ARE HERS Laura Michaels took a last-ditch chance at online dating and hit the jackpot - twice. After waking up in Dylan's apartment and being surrounded with pictures of his wife, she follows the advice to DTMFA - so she dumped him. Mike popped up out of nowhere on the online dating site where she met Dylan, and in a whirlwind two days she managed to sleep with both. Adding insult to injury, when Dylan appeared at her workplace disguised as a flower delivery guy, the truth came the pictures were of his dead lover. Passion overrode reason and Laura found herself caught between two incredible men. And wishing she could have both. Dylan and Mike might be in for the surprise of their life, because maybe - just maybe - Laura has some threesome desires of her own that she's finding it harder and harder to control. When Dylan and Mike give them all an opportunity to consummate their brewing desires, the result is hotter and more passionate than any of them ever imagined, yet as Laura realizes she'd been manipulated, her old insecurities come back. Fleeing, she leaves Mike and Dylan wondering whether they've ruined their second chance at a perfect triad - but they haven't seen the last of Laura.... This title is published by Prosaic Press and is distributed worldwide by Untreed Reads.",
  "genres": [
    "Romance",
    "Menage",
    "Erotica",
    "Contemporary Romance",
    "M F M",
    "Erotic Romance",
    "Novella"
  ],
  "author": "Julia Kent",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/17189954-her-two-billionaires"
}