{
  "title": "Her Second Billionaire",
  "description": "From New York Times bestselling author Julia Kent comes the second in the Her Billionaires series... SHE DREW A LINE WITH A ONE NIGHT STAND When Laura Michaels got one hot firefighter pinging her for a date after joining a popular online dating service, she thought she had won the lottery. A night with Dylan Stanwyck, professional (firefighting) hunk and former model, had been too much. Fearful her curves would turn him off like so many other guys, her pleasant surprise turned to white-hot passion as she broke her own rule and slept with him on the first date. That turned to regret when she awoke in the wee hours of the morning and found pictures of a hot, buff surfer-type woman with Dylan plastered all over his bedroom. Taking the hint, she made the walk of shame home, deleted him from her contacts and chalked it up to experience. To her shock, within hours a new guy - Mike Pine, a ski instructor and marathon runner with a body and face like an actor in a superhero movie - messaged her and asked her out. Lightning struck twice in 24 hours! Laura was incredulous but, emboldened by encouragement from her best friend, Josie, she took the plunge and accepted the date. HE WANTS TO BE LOVED ON HIS OWN Mike likes simple things. Skiing. Running. Being outside. Uncomplicated love. Good food. For nearly ten years he, Dylan and Jill had a simple love that was achingly easy on the inside, and oh, so complicated from the outside. It worked, though, and made him whole - until Jill's lymphoma diagnosis and her early death. What he and Dylan had never expected was what came more than a year after Jill's an inheritance. From her family's trust fund. More than $1 billion each, with a perpetual income that made everything go from simple to chaotic. What Laura doesn't know is that Dylan and Mike are roommates. More than roommates. And they are looking for a third in their relationship. More than a third...but Mike has something to prove, first, and snagging this first date with her is just the beginning. This title is published by Prosaic Press and is distributed worldwide by Untreed Reads.",
  "genres": [
    "Romance",
    "Menage",
    "Erotica",
    "Contemporary Romance",
    "Short Stories",
    "Erotic Romance",
    "Novella"
  ],
  "author": "Julia Kent",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/17189952-her-second-billionaire"
}