{
  "title": "Blood Knot",
  "description": "To survive they must trust each other. Only...can they?Winter, a professional thief who can manipulate others' biologies by touch, accidentally \"healed\" her former partner--and former vampire--Sebastian, whom she secretly loves. Her healing created a symbiotic pairing between them that neither of them wants.Nathanial, a sexy thousand-year-old vampire and Sebastian's ex-lover, talks Sebastian and Winter into stealing evidence that will expose all vampires to the world. But Nathanial is a puppet-master who doesn't believe in falling in love with humans, leaving Winter unsure of his real feelings for her once he seduces her, or how he feels about Sebastian, the former vampire-now-human whose life he has turned upside down once more.But the evidence they steal is hot property. The future of all vampires is on the line and others will stop at nothing to get it, leaving Sebastian, Winter and Nathanial with no allies but each other. They must trust each other to survive. Only...can they? This book contains two hot, sexy alpha heroes, frequent, explicit and frank sex scenes and sexual language.It includes heart-stopping sexual scenes between the aforementioned sexy heroes, menage scenes, anal sex and the use of sex toys. Don't proceed beyond this point if hot love scenes offend you.No vampires were harmed in the making of this novel.The Blood Stone Blood Stone 1: Blood Knot (#1 Amazon Best Seller, Fantasy Romance)Blood Drops 1.1: Southampton Swindle*Blood Drops 1.2: Broken Promise*Blood Stone 2: Blood StoneBlood Stone 3: Blood UnleashedBlood Stone 3.5: Blood Drive - Blood Stone Boxed Set 1Blood Stone 4: Blood Revealed (Upcoming)[*Blood Drops are short and novella length stories featuring the characters and situations in the Blood Stone series. Droplet sized morsels for your reading pleasure.]These are continuing characters and storylines. Reading the series in order is strongly recommended.Now also  Blood Drive  -- Books 1-3 in one volume at a discount price!____#1 Best-Selling Fantasy, Futuristic & Ghost Romance Amazon Best-SellerTop 100, Amazon Vampire Romance Best-SellerWinner of the Coffee Time Reviewer's Recommended AwardListed as one of Goodread's \"Most Drool-worthy Covers\"Nominated for Erotic Vampire Book of the Year by The Romance Reviews, November 2011CAPA Best Paranormal Book of the Year by The Romance Studio, December, 2011",
  "genres": [
    "Vampires",
    "Menage",
    "Paranormal",
    "Romance",
    "M M F",
    "Erotica",
    "Paranormal Romance"
  ],
  "author": "Tracy Cooper-Posey",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/10753584-blood-knot"
}