{
  "title": "A Maldição da Pedra",
  "description": "John Reckless, pai de Jacob e Will, sumiu sem deixar vestígios. Inconformado, Jacob gasta o dia procurando pistas que lhe deem alguma ideia do seu paradeiro. O garoto vasculha cada cantos do escritório do pai, até que um dia descobre um espelho que servia como um portal para um mundo mágico - um mundo que lhe oferece a perspectiva de liberdade e aventura.Mantendo segredo do seu achado, Jacob passa cada vez mais tempo do outro lado do espelho. Após doze anos, o mundo sombrio se torna seu verdadeiro lar, onde tem amigos e inimigos e é reconhecido como um dos melhores caçadores de tesouros que já existiram por ali.Will, o caçula, sente falta do irmão e estranha aqueles sumiços prolongados. Um dia, consegue burlar sua constante vigilância e o segue através do espelho, ato que tem uma consequência terrível. Ferido pelos goyls - homens frios e violentos, que têm pele de pedra e olhos de ouro -, ele acaba vítima de uma maldição: vai se transformando lenta e dolorosamente em uma dessas sinistras criaturas.Numa corrida contra o tempo, Jacob precisa encontrar o antídoto para o feitiço. Para empreender essa jornada, ele conta com a ajuda da raposa Fox, sua companheira de muito tempo, e Clara, a namorada de Will, que atravessa o espelho para encontrá-lo. Juntos, eles vão enfrentar os perigos e as armadilhas do Mundo do Espelho - antes que seja tarde demais e Jacob perca o irmão para sempre.Povoado por fadas, bruxas, unicórnios e tritões, e tendo cenários como o castelo da Bela Adormecida e a casa de doces da bruxa de \"João e Maria\", o mundo criado por Cornelia Funke remete o leitor aos mais conhecidos contos de fadas de todos os tempos. Na narrativa, contudo, a ênfase da autora recai nos aspectos mais sombrios e brutais das histórias, criando-se uma atmosfera ao mesmo tempo familiar e soturna. É nesse mundo que se desenrolam as aventuras dos irmãos Reckless, uma história de maldição, traições e vingança, mas também de coragem, lealdade e amor.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Fiction",
    "Adventure",
    "Magic",
    "Fairy Tales",
    "Audiobook"
  ],
  "author": "Cornelia Funke",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/17191219-a-maldi-o-da-pedra"
}