{
  "title": "Abandoned Ship: An Intimate Account of the Costa Concordia Shipwreck",
  "description": "On January 13, 2012, the Costa Concordia — a thousand foot long luxury cruise ship, twice the size of the Titanic — ventured into shallow water and smashed into the rocks of a tiny island off the coast of Italy, throwing the four thousand passengers and crew members into a state of chaos. The captain and officers all abandoned ship, leaving the few remaining castaways to fend for themselves as the boat toppled onto its side and water flooded into the passenger decks.In the wee hours of the night, newlyweds Benji Smith and Emily Lau feared for their lives, desparate and terrified after a malfunctioning lifeboat left them stranded on the sinking ship. By this point, the other lifeboats had all gone. They had been left behind.This thoughtful memoir — hailed by The Daily Telegraph as \"a compelling, minute-by-minute account of the chaotic evacuation\" — tells the remarkable story of the couple's harrowing escape, as they clung to a rope and rapelled down the hull of the doomed vessel.But the astonishing story continues, as they find themselves stranded in Rome and ignored by the United States Embassy. With only the clothes on their backs, they relied upon the kindness of strangers to help them find food and shelter, clothing and medical attention. And finally a ticket home.But even then, in the safety of their own home, they would find their sleep haunted by nightmares and their days crippled by anxiety and insecurity. And even as they struggled to overcome PTSD, they would simultaneously find themselves in a battle with the news media to even have their story told.Praised by Newsweek/The Daily Beast for its \"honest reflection and frightening detail\", this gripping, triumphant story is ultimately a spiritual tale, the story of a pair of survivors who find hope and meaning in the aftermath of a tragedy.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "History",
    "Travel",
    "Biography Memoir",
    "Biography",
    "Amazon"
  ],
  "author": "Benji Smith",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/17191734-abandoned-ship"
}