{
  "title": "The Art of Redemption",
  "description": "Prequel to The Art of D/s series. This can be read before The Art of D/s Trilogy, but it does contain mild spoilers. For Isabel, art was her saving grace and redemption from a life of abuse and cruel words. Having escaped her father's iron fist and making her way in a strange city, she finds herself alone, going from empty relationship to unfulfilling relationship. Bored with conventional sex, creativity becomes the outlet for her secret desires. Introverted, self-critical yet spirited, she yearns for love, acceptance and control.For Dylan, the answer to his control issues and sadistic fantasies was waiting for him within the walls of the Dark Asylum in the form of an acronym - BDSM. His redemption from his overwhelming guilt and sadness over the loss of his parents was discovering the escapism of art. Feeling undeserving of happiness, he delves into the art world and BDSM with voracious passion. As he concentrates on mastering his knowledge in all things art, he also sets about honing his Dominant skills while training new submissives, never wanting anything more than brief physical encounters. This prequel explores Dylan and Isa's pasts and the people who crossed their paths and became integral parts of their lives. This is the journey that led them to the fated Studio 210 gallery show where Dylan first caught glimpse of the erotic paintings that spoke to him, leading him to find the love of his life, his soul mate and his own little artist with a hidden dominant streak - Mistress Isabel. The very same night that forever changed Isabel's future, leading her to the man who would capture her heart, Dominate her world, and ultimately give her complete control.",
  "genres": [
    "BDSM",
    "Erotica",
    "Contemporary Romance",
    "Adult",
    "Novella",
    "Short Stories",
    "Abuse"
  ],
  "author": "Ella Dominguez",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/17192182-the-art-of-redemption"
}