{
  "title": "Edward VI: The Lost King of England",
  "description": "The birth of Edward on October 12, 1537, ended his father’s twenty-seven-year wait for an heir. Nine years later, Edward was on the throne, a boy-king in a court where manipulation, treachery, and plotting were rife.Henry VIII’s death in January 1547 marked the end of a political giant whose reign had dominated his kingdom with an iron grip for thirty-eight years. Few could remember an England without him--certainly little had remained untouched: the monasteries and friaries had been ripped down, the Pope’s authority discarded, and new authoritarian laws had been introduced that placed his subjects under constant fear of death.Edward came to the throne promising a new start; the harsh legislation of his father’s was repealed and the country’s social and economic problems approached with greater sensitivity. Yet the early hope and promise he offered soon turned sour. Despite the terms of Henry’s will, real power had gone to just one man--the Protector, Edward’s uncle, the Duke of Somerset, and there were violent struggles for power, headed by the duke’s own brother, Thomas Seymour.Chris Skidmore reveals how the countrywide rebellions of 1549 were orchestrated by the plotters at court and were all connected to the burning issue of religion: Henry VIII had left England in a religious limbo. Court intrigue, deceit, and treason very nearly plunged the country into civil war. The stability that the Tudors had sought to achieve came close to being torn apart in the six years of Edward’s reign.Even today, the two dominant figures of the Tudor period are held to be Henry VIII and Elizabeth I. Yet Edward’s reign is equally important. His reign was one of dramatic change and tumult, yet many of the changes that were instigated during this period--certainly in terms of religious reformation--not only exceeded Henry’s ambitions but have endured for over four centuries since Edward’s death in 1553.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Tudor Period",
    "British Literature",
    "Historical",
    "European History"
  ],
  "author": "Chris Skidmore",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/1719217.Edward_VI"
}