{
  "title": "Every Frat Boy Wants It",
  "description": "Jeff Morgan is about to get the education of a lifetime . . . At eighteen, Jeff Morgan is the quintessential all-American boy-blond, blue-eyed, and a star jock at his small Kansas high school. Enrolling at California State University-Polk, Jeff plans to become a writer. He also hopes that the macho nature of fraternity life will help him get over his lifelong attraction to other men. The reality couldn't be more different . . . Through Blair Blanchard, the drama major son of divorced movie stars, Jeff discovers the Beta Kappa fraternity, and enters a world where alcohol and drugs serve as an excuse for covert trysts between frat brothers . . . where the pledging process becomes a sensual, S&M-fueled bacchanal . . . where weekends in L.A. and Palm Springs are no-holds-barred adventures in sexual exploration . . . and where Spring Break is a boys-gone-wild porn movie come to life. Through every encounter, from intense couplings with older frat brothers to sizzling three-ways with hot new pledges, Jeff also deals with his increasingly complex feelings-for Blair, for a handsome new arrival, and for life within Beta Kappa itself. Sexy, steamy, and incredibly erotic, Every Frat Boy Wants It proves that when it comes to learning all there is to know about mind-blowing pleasure, nothing beats hands-on experience . . . Todd Gregory is a New Orleans based writer who survived Hurricane Katrina and its aftermath with the help of prescription medication. He has edited the anthologies Rough Trade, His Underwear and Blood Lust (with M. Christian). He has published short stories in numerous anthologies and his works have been translated into German. He is currently working on an erotic suspense thriller titled Sunburn.",
  "genres": [
    "M M Romance",
    "Erotica",
    "Romance",
    "Gay",
    "LGBT",
    "Contemporary",
    "Fiction"
  ],
  "author": "Todd Gregory",
  "average_rating": "3.21",
  "url": "https://www.goodreads.com/book/show/1719220.Every_Frat_Boy_Wants_It"
}