{
  "title": "Declassified",
  "description": "The worlds of Jason Bourne/Robert Ludlum and Michael Crichton collide in this fast paced two-part cross over genre of the action/adventure-thriller and the emerging genre of women's thriller fiction as seen in recent movies and cable series. If you like strong female leads, thriller novels and films, and cable thriller series, starring strong women who get things done, you'll enjoy these books.Someone knows a Biological Eve may be alive and hiding in America.During WW II, a woman from Ethiopia is captured by the S.S. and with great expectations is taken to Ravensbruck for experimentation. A few weeks ago, traces of her are found in a declassified WWII document, supporting evidence she may be in the U.S. The hunt for her has begun.Book One: Declassified returns briefly to the eve of the signing of the German surrender the 7th of May, 1945 Reim, France. General Eisenhower delays his participation in the signing of the documents of surrender. Deep in the bowels of the red brick French schoolhouse, Ike is captivated by the incredible story of two people desperate to defect, but only to him. The documents that convinced Ike to give these defectors asylum were assumed destroyed, only to resurface nearly seven decades later.The story breaks open in present day after a declassified document from Eisenhower's WW II file is released to the public on the National Archive website. This document creates conclusions to old rumors, and innocent people begin to die, forcing a billionaire to carry out a plot to kill his beloved, jet-setter grand-daughter.Metaphor, an underground protection network of retired intelligence analysts and field agents fails in their mission to protect the late in life, adult daughter of Eisenhower's personal navigator. This daughter, now a prominent attorney has been an unknowing secret keeper since childhood.Desperate, Metaphor considers exposure to recruit a White House employee to help them continue their life long mission, set in motion decades earlier when General Eisenhower brought one of the defectors to Mrs. Roosevelt at war's end. Together, Ike and Eleanor created a plan to protect THEIR LAST SECRET. Aging, surviving players remain on mission, nearly seventy years later. DECLASSIFIED is PART ONE and immediately continues on in Part Two, \"Discovered.\" THEIR LAST SECRET: DISCOVERED is Part Two, the finale of this long form, fast paced, thriller.\"WELL BEHAVED WOMEN RARELY MAKE HISTORY\" - Eleanor Roosevelt",
  "genres": [],
  "author": "Carl  Hansen",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/17194456-declassified"
}