{
  "title": "Career Progression Guide for Airmen: March in Step and Close Ranks with Proven Strategies of Success for Earning Your Next Stripe 1st Edition",
  "description": "\"You’re considering joining or joined the United States Air Force (USAF). You desireto put your best foot forward at your new job and achieve a rewarding career. Torally toward your goal, “march in step’ ---work as a team---with proven strategiesof success to “close ranks”---get and stay ahead in your career---for building yourleadership skills and earning your next stripe.This scaled down, second book in the Career Progression Guide for Airmenseries ‘cuts to the chase’ and walks you through career progression steps –from A toZ – allowing you to still hone in on the hard-core information for leadership andpromotion increase opportunities.As you near the milestone of making the next rank, it then becomes a stepping stonefor you to further mission accomplishment and see, sense, and smell a ‘rewardingcareer’ fi nish line. You’re also supplied with coaching and mentoring you musthave for growth and value as a professional Airmen.The Basics features inspirational lead-off chapter quotes, step-by-step arrangementof the performance report’s accomplishment bullet statement’ sequence, which isimportant for documenting your job performance, and a 6-point key summary toreinforce your learning and help you to keep your job and career goals in sight.From goal setting, successfully performing to meet expectations, to serving othersand self, “The Basics” cuts to the quick and provides you the means to get the jobdone well and touch and taste the promotion you earn!Chief Master Sergeant Mark C. Overton, USAF (Retired), is a graduate of theUSAF Chiefs’ Leadership Course and earned a masters degree in computer resourcesand information management. During his twenty six years in the Air Force, ChiefOverton’s background includes various duties in 25 communications-computersystems assignments and deployments at the unit, wing and numbered air force levels.Offering a rare perspective of serving as a chief master sergeant, retiree, key spousementor, and federal civilian employee, he has penned commentaries on leadership\"",
  "genres": [],
  "author": "Mark C. Overton",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/17194401-career-progression-guide-for-airmen"
}