{
  "title": "Good-Bye, Robinson Crusoe and Other Stories",
  "description": "Contents 9 • Introduction (Good-Bye, Robinson Crusoe and Other Stories) • essay by John Varley 11 • The Funhouse Effect • [Eight Worlds] • (1976) • novelette by John Varley 37 • Retrograde Summer • [Eight Worlds] • (1975) • novelette by John Varley 59 • In the Bowl • [Eight Worlds] • (1975) • novelette by John Varley 93 • Blue Champagne • [Anna-Louise Bach] • (1981) • novella by John Varley 159 • Bagatelle • [Anna-Louise Bach] • (1976) • novelette by John Varley 185 • Equinoctial • [Eight Worlds] • (1977) • novella by John Varley 235 • Good-Bye, Robinson Crusoe • [Eight Worlds] • (1977) • novelette by John Varley 267 • Lollipop and the Tar Baby • [Eight Worlds] • (1977) • novelette by John Varley 291 • The Black Hole Passes • [Eight Worlds] • (1975) • novelette by John Varley 317 • The Unprocessed Word • (1986) • short story by John Varley 333 • The Manhattan Phone Book (Abridged) • (1984) • short story by John Varley This stellar collection by John Varley contains eleven provocative, utterly distinctive stories and novellas. None of them are currently available in any other book. Some have been unavailable in any form for twenty-five years or more. The result is a publishing event that no admirer of Varley—or of first-rate imaginative fiction—can afford to miss.The bulk of these stories comprise what the author calls a “Grand Tour of the Solar System,” moving from one thoroughly imagined setting to another with deceptive ease. “The Funhouse Effect” is a tale of mystery, intrigue, and illusion that takes place on a mechanized comet moving toward the sun’s corona. “Retrograde Summer” is an account of gender reversals and family secrets set against the radically unstable backdrop of Mercury. “Bagatelle” pits a recurring Varley character—Police Chief Anna-Louise Bach—against a living bomb that threatens to devastate Luna’s Dresden City. Other stories range from Venus (“In the Bowl”) to an underground “disneyland” on Pluto (“Good-Bye, Robinson Crusoe) to the unexplored reaches of deep space (“The Black Hole Passes”). The collection ends with two very different offerings that are nonetheless vintage Varley. “The Unprocessed Word” is a whimsical reflection on one writer’s relationship with a ubiquitous, constantly evolving technology, while “The Manhattan Phone Book (Abridged)” is a brief, absolutely chilling meditation on the consequences of nuclear proliferation.Whatever the tone, style, or subject matter, Varley remains in complete control of this impressively varied material. Good-Bye, Robinson Crusoe and Other Stories provides intellectual stimulation and pure entertainment in equal measure, and bears the unmistakable hallmark of a master storyteller on every page.",
  "genres": [
    "Science Fiction",
    "Short Stories",
    "Collections",
    "Speculative Fiction",
    "Fiction"
  ],
  "author": "John Varley",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/17194514-good-bye-robinson-crusoe-and-other-stories"
}