{
  "title": "Fire Island Pines: Polaroids 1975-1983",
  "description": "Growing up in the 1950s, Tom Bianchi would head into downtown Chicago and pick up 25-cent -physique- magazines at newsstands. In one such magazine, he found a photograph of bodybuilder Glenn Bishop on Fire Island. -Fire Island sounded exotic, perhaps a name made up by the photographer, - he recalls in the preface to his latest monograph. -I had no idea it was a real place. Certainly, I had no idea then that it was a place I would one day call home.- In 1970, fresh out of law school, Bianchi began traveling to New York, and was invited to spend a weekend at Fire Island Pines, where he encountered a community of gay men. Using an SX-70 Polaroid camera, Bianchi documented his friends' lives in the Pines, amassing an image archive of people, parties and private moments. These images, published here for the first time, and accompanied by Bianchi's moving memoir of the era, record the birth and development of a new culture. Soaked in sun, sex, camaraderie and reverie, Fire Island Pines conjures a magical bygone era.Tom Bianchi was born and raised in the suburbs of Chicago and graduated from Northwestern University School of Law in 1970. He became a corporate attorney, eventually working with Columbia Pictures in New York, painting and drawing on weekends. His artwork came to the attention of Betty Parsons and Carol Dreyfuss and they gave him his first one-man painting show in 1980. In 1984, he was given his first solo museum exhibition at the Spoleto Festival. After Bianchi's partner died of AIDS in 1988, he turned his focus to photography, producing Out of the Studio, a candid portrayal of gay intimacy. Its success led to producing numerous monographs, including On the Couch, Deep Sex and In Defense of Beauty.",
  "genres": [
    "Photography",
    "Art",
    "LGBT",
    "Sexuality",
    "Queer",
    "Gay"
  ],
  "author": "Tom Bianchi",
  "average_rating": "4.76",
  "url": "https://www.goodreads.com/book/show/17195713-fire-island-pines"
}