{
  "title": "The New Rules of Marketing & PR: How to Use Social Media, Online Video, Mobile Applications, Blogs, News Releases, & Viral Marketing to Reach Buyers Directly",
  "description": "\"The\" benchmark guide to marketing and PR, updated with the latest social media and marketing trends, tools, and real-world examples of success\"The New Rules of Marketing & PR, 4th Edition\" is the pioneering guide to the future of marketing, an international bestseller with more than 300,000 copies sold in over 25 languages. It offers a step-by-step action plan for harnessing the power modern marketing and PR to communicate with buyers directly, raise visibility, and increase sales. It shows how large and small companies, nonprofits, and more can leverage Web-based content to get the right information to the right people at the right time for a fraction of the cost of big-budget campaigns.Including a wealth of compelling case studies and real-world examples of content marketing and inbound marketing success, this is a practical guide to the new reality of reaching buyers when they're ready.Includes updated information, examples, and case studies plus an examination of newly popular tools such as Infographics, photo-sharing using Pinterest and Instagram, as well as expanded information on social media such as YouTube, Twitter, Facebook, and LinkedInDavid Meerman Scott is a marketing strategist, bestselling author of eight books including three international bestsellers, advisor to emerging companies including HubSpot and Eloqua, and a professional speaker on topics including marketing, leadership, and social media. Prior to starting his own business, he was marketing VP for two U.S. publicly traded companies and was Asia marketing director for Knight-Ridder, at the time one of the world's largest information companies.\"The New Rules of Marketing & PR\" offers the single resource for entrepreneurs, business owners, nonprofit managers as well as those working in marketing or publicity departments to build a marketing and PR strategy to grow any business.",
  "genres": [
    "Business",
    "Nonfiction",
    "Social Media",
    "Reference",
    "Communication",
    "Buisness",
    "School"
  ],
  "author": "David Meerman Scott",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/17197005-the-new-rules-of-marketing-pr"
}