{
  "title": "Oil & Water: Two Faiths: One God",
  "description": "Listen to any news broadcast today and the message comes through loud and Islam is a religion of violence and behind every Muslim there lurks a potential terrorist. Islam is a threat to values of the Christian West. They are like oil and water. Clearly, they don't mix. Oil & Two Faiths One God confronts these popular perceptions head-on. With keen insight and gentle understanding, it explores the differences between Christianity and Islam, as well as the many things these two enduring faith traditions hold in common - including, first and foremost, their belief in and desire to be faithful to the one, true God; their shared roots and scripture (from the Jewish faith); and the spiritual values of peace and social justice. Written for Christians by Muslim world-religions scholar Amir Hussain, the book is divided into two parts. Part 1, provides an overview of the Islamic faith and of the lives of Muslims in North America today. Chapters focus on the place and identity of Muslims in society, as well as on the importance and role of Muhammad, the Qur'an, and basic beliefs and practices (The Five Pillars of Islam). Having provided a foundation for understanding, the book moves on, in Part 2, to explore key points for dialogue today, including issues of violence and jihad, the roles of women and men, and the mystical tradition within Islam. The final two chapters look at interfaith dialogue and the practical aspects of being good \"neighbours.\" In all of this, the book invites the reader to a place of reconciliation, to a place where the truth and value of each of these great faith traditions can be recognized and honoured by the other. In the end, the metaphor of oil and water is an interesting one for the reality of conflict and the hope for reconciliation between Islam and Christianity today.",
  "genres": [
    "Religion",
    "Islam",
    "Nonfiction"
  ],
  "author": "Amir Hussain",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/172000.Oil_Water"
}