{
  "title": "DraculaVille",
  "description": "Super Ad/Publicity Agent, Talia Quinton, is poised at the top of her career to receive a much coveted job representing the world’s largest advertiser. She’s shocked and humiliated when the account is given to a rival agent with much less experience. Instead, Talia is ordered to come up with a publicity plan to bring tourists to Romania. An account not worth a tenth of the one she’d hoped for.  But she’s not called Talia the Tiger by the New York ad world for nothing. When she discovers a newly made and abandoned vampire named Drake, she takes on the job of healing and grooming him into the face of her new campaign. Instead of touting the ancient country's rolling hills and historic castles, she turns the advertising world on its head by bringing Romania’s dark past to the center of the presentation. She proposes they build a fantasy themed amusement park/resort for adults called, DraculaVille, right in the heart of Transylvania. And Drake will pose as Dracula, their spokesperson. A vampire pretending to be an actor, pretending to be a vampire. Talia’s disturbing attraction to Drake is only one obstacle in her path. She soon discovers New York fairly swarms with warring vampire communities and she and Drake have landed right in the middle of their biggest conflict. On top of that, the odd members of the Romanian National Publicity Committee begin making strange demands that keep Talia constantly on the edge of losing the account and her reputation as New York’s most formidable Account Executive. As a last straw, Talia and Drake are kidnapped by a ruthless vampire gang and forced to fight for their lives as the clock ticks on completing the assignment necessary to retain the DraculaVille account. Their only hope of gaining freedom is to consent to an ancient vampire bonding ceremony. There's one problem. To complete the ceremony, Drake must kill Talia and turn her into a vampire. But despite her unavoidable attraction to the hunky vampire she saved, Talia's not ready to die.",
  "genres": [
    "Vampires",
    "Paranormal",
    "Amazon",
    "Romance",
    "Audiobook",
    "Paranormal Romance"
  ],
  "author": "Lara Nance",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/17200427-draculaville"
}