{
  "title": "The Earth Shifter",
  "description": "Who will save the world? And is it worth saving?Comet of Karma tasked with destroying a failing civilization...Earth Keepers agonizing over the ultimate decision....Protectors risking their lives to keep the world intact...Global secret society bent on usurping power on Earth...Old spy organization with a secret human weapon...Shifters, with power over mind, matter, time, and space... And two teenagers, born to become the all-important Key of Destiny....If they succeed in keeping their souls uncorrupted, and if they come together before it's too late! Prophecy of the Key: \"When this civilization reaches a crucial threshold, the Key of Destiny will appear to light up the path and open the coveted door, offering a glimpse into the future of unheard potential for humans. It has happened before...and it is about to happen now. Except the new Key is unique and precious, even by the Cosmic Key of Destiny standards. It is simultaneously yin and yang, light and dark, assertive and nurturing. Its perilous path is fraught with mystical discovery and mortal danger, as many powerful and ruthless forces line up to prevent the Key from fulfilling its destiny.\"Much more than a novel, The Earth Shifter is a top-rated, visionary \"real world\" fantasy set on Sacred Lake Baikal in Siberia, Moscow & New York, and filled with stand-out characters, dramatic action, and profound spiritual revelations. A satisfying and world-enriching read for most ages, early teen through adult. 104,000 words, 394 print pages.Also by Lada RayEarth Keepers Chronicles - companion & prequel mini-series to The Earth Shifter Book 1, Catharsis (Legend of the Lemurians)- Karma can be a beautiful maiden or a bitch...Coming soon!Book 2, Lemurian Crystal (ebook), and Book 3, Atlantis (ebook) - release 2013. Earth Keepers Chronicles: Origins (ebook & paperback) - release 2013 Accidental Spy Adventure SeriesGold Train (Accidental Spy Russia Adventure) - Destiny brings Jade to Russia, where she must prevent a major conspiracy...Stepford USA (Accidental Spy Small Town Adventure) - Not all conspiracies are global - some are hidden in small towns with perfect facades...Green Desert (Accidental Spy Iraq Prequel) - The Butterfly Effect with a twist.BLOG: LadaRay.wordpress.comOFFICIAL AUTHOR WEBSITE: LadaRay.com",
  "genres": [
    "Science Fiction"
  ],
  "author": "Lada Ray",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/17200424-the-earth-shifter"
}