{
  "title": "Riftglade",
  "description": "On a clear night, the iced countryside of Overland shimmers in deep dark purples as it absorbs the light from the stars overhead. But this night, everything is dark as onyx; the occasional gloomy twinkle playing peek-a-boo with the eventide.The currents of the atmosphere sense a disturbance, shifting and shivering as if in expectation of some cyclopean storm. Intruding in the peaceful song of the frozen ebony sleep comes a sweet, but perplexing hum.At once it is as if the things of nature recognize the color of the exciting hum. The snow covered hills begin to glow warmly, a rhapsody of inner light coating the frozen tundra. In moments the air snaps to attention, exuding the scent of ancient virgin forests untouched by fae. A mix of pine, cedar and oak, fighting to dominate, release their heady perfume into the ozone.An obscurity of bright and colorful streaks stream from over the mountains miles away. Red blending into purple; purple blending into indigo; indigo into pink evinces a masterpiece of surrealism. If you stopped time in that instant before the ancient one was impelled by the Realm of Clouds to reach out and taste fate, you would see an amazing sight. If you hovered in the face of the masterpiece of light and color, you would behold the sorrowful expression of an exquisite fairy. Long red hair flowed out behind her as she flies. Drawing your attention would be the reddest lips and the most beautiful blue eyes. Rimming those eyes, which are at once clear and open but deep and dark as well, were the darkest lashes. The whisper of a crystalline tear hovered at the edges of those nymph eyes; the tears stretching out with the speed at which she flew.This paragon of beauty is Princess Yaliza, daughter of Vodianyk, High King of All You See.Come and join Princess Yaliza on her adventure in Riftglade by K.R. Jordan.",
  "genres": [],
  "author": "K.R. Jordan",
  "average_rating": "4.71",
  "url": "https://www.goodreads.com/book/show/17200697-riftglade"
}