{
  "title": "Along Wooded Paths",
  "description": "All she wanted was a simple Amish life . . . But now Marianna Sommer finds herself depending on Englisch neighbors. Although proud of living apart from the world, she and her newly relocated Amish family have discovered that life in the remote mountains of Montana requires working together.As Marianna begins helping those different from herself—and receiving their help—her heart contemplates two directions. She’s torn between the Amish man from Indiana whom she has long planned on marrying and the friendly Englischer who models a closer walk with God than she’s ever seen before.Who should have young Marianna’s heart? What is God asking her to sacrifice? Her traditions? Her community? The answer is found along the wooded paths.Acclaim for Tricia Goyer’s Big Sky Series“A wonderful story about the Amish and the way they live their lives by the writings of the Bible. Readers will delight in this.”RT Book Reviews“A sweet, tender tale that’s sure to please readers. Amish fiction fans will be wanting more from Ms. Goyer!”AmishHearts.com“A captivating story . . . the reader can’t wait to turn the page.”Suzanne Woods Fisher , best-selling author, Lancaster County Series\"A sweet, tender story about God's gentle workings in the hearts of His own. Tricia Goyer has a true talent for creating believable characters readers can identify and empathize with. Anyone who enjoys Amish fiction will appreciate this moving tale.\"Sally Laity , author of Remnant of Forgiveness\"I was pulled into Tricia Goyer's  Along Wooded Paths  from the first page! A devastating past, a heart-breaking choice, this story has it all. Endearing, lovely in every way. If you love heart-warming Amish fiction you can't go wrong here.\"Traci DePree , author of the Lake Emily series and  Into the Wilderness",
  "genres": [
    "Amish",
    "Christian Fiction",
    "Amish Fiction",
    "Romance",
    "Fiction",
    "Christian",
    "Christian Romance"
  ],
  "author": "Tricia Goyer",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/10755299-along-wooded-paths"
}