{
  "title": "الدبور المصري وقصص أخرى",
  "description": "إذا تحدثنا عن أدب الرعب، فعادة ما نتكلم عن الأشياء المخيفة، عن الإبداعات المرعبة والكوابيس التي أخرجتها قريحة مئات الكتاب، ولكن إن أردنا التحدث عن الخوف ذاته، الخوف كغريزة وجزء من تكوين البشر، كشيء مؤثر في أرواحنا وأنفسنا جميعا، ويستحق أن نفرد له أدبا ونقدا، فلابد أن نتكلم عنه: عن الكاتب الذي اعتنق دراسة الخوف حتى يصل للإخافة مسميا إياه مبدأ \"الخوف الروحاني\". حديثنا اليوم عن: ألجرنون بلاكوود1869 – 1951هو رحالة، مغامر، مراسل صحفي، رجل صناعة، مزارع، باحث نفسي وروحاني. لكن على الرغم من كل هذا اشتهر فقط بأنه أحد كتاب الرعب في بدايات القرن العشرين، بل ربما واحد من أفضلهم على الإطلاق. وصفه عميد أدب الرعب لافكرافت نفسه بأنه \"السيد بلا أدنى منازع للأجواء المرعبة. \" هو ابن دوقة مانشستر من زوجها الثاني السير ستيفنسون آرثر بلاكوود. كان والده يعمل كواعظ وراعٍ للكنيسة، ولذا فقد قام بتربية ألجرنون تربية دينية صارمة جدًا جعلته نافرًا من الطقوس الدينية المتشددة وانعكس ذلك على كثير من كتاباته. تأثر بعدد من أساتذته وزملاء دراسته فنشأ لديه ولع بالطب وعلم النفس والفلسفة الهندوسية، وتعمق في دراسة الأمور الروحانية والسحر والتنجيم وعلوم ما وراء الطبيعة والقدرات الروحية الخارقة الكامنة لدى البشر. ثم اشترك في جمعية سرية تدعى الفجر الذهبي، تخصصت في الروحانيات، وألهمه اشتراكه فيها روايته الوتر البشريThe Human Chordكان يستمد إلهامه من خبراته الشخصية ورحلاته وحياته في عدد من الدول المختلفة، فمثلا أشهر أعماله: رواية الصفصاف ( التي نقدمها هنا) استوحاها من إحدى رحلاته في نهر الدانوب. أما رحلته لمصر، فقد ألهمته رواية الرمال وغيرها، واختفاؤه عن الأنظار لصيف كامل في إحدى غابات كندا ألهمه كتابة روايته الأقل شهرة وينديجو. نشر أول مجموعاته القصصية عام 1906 تحت عنوان البيت الخاوي وقصص أخرى، وتلاها بعدد من الأعمال المتنوعة من أشهرها مجموعته جون سايلانس (John Silence، Physician Extraordinary) المنشورة في 1908 عن وسيط روحاني يستغل موهبته في العمل كمخبر سري. حاز ألجرنون على شهرة كبيرة جدا، وفي أخريات أيامه قدم برنامجا ناجحا جدا على البي بي سي، يقرأ فيه بعض أعمال الرعب. كما نشر سيرته الذاتية في كتاب بعنوان (حلقات ما قبل الثلاثينات) عام 1932. بالنسبة لأدبه، فقد كان فهمه الإنساني للطبيعة النفسية والروحانية للبشر هو المسئول الأول عن قوة كتاباته وعمق تأثيرها على قراءه ومتابعيه. و كثير من رواياته المرعبة تميزت بمعان غامضة مبطنة لها مما جعلها تتقدم على كثير من روايات معاصريه. ويعتبر أسلوبه في الكتابة واستخدام التحليل النفسي ودقة وصفه لمشاعر الخوف ونسبه المتفاوتة ونموه في النفس، أسلوبًا جديدًا في عصره، تميز به، وأثر على العديد من كتاب الرعب من بعده. لم يعتمد في الأساس على مبدأ الإخافة قدر ما اعتمد على غرابة الوضع الذي يضع به أبطاله، بما يحفز من قدراتهم الخاصة، سواء قدرتهم على التخيل أو قدراتهم الروحانية. أحيانًا - كما في الدبور المصري- نجده يختار مواقفا عادية جدا تقابل كل البشر، ويبدأ بتحليل مشاعر خوفهم منها، وأحيانا أخرى نجد انه يضع أبطاله في مواقف غريبة، مثل روايته القنطور والتي يرى بطلها قطيع من المخلوقات الأسطورية يمر أمامه!وفي هذا العدد، نقدم لكم أشهر رواياته \"الصفصاف\" مع قصتين من قصصه القصيرة الشهيرة \"البيت الخاوي\"، وهي أول أعماله المنشورة، و\"الدبور المصري\" والتي استوحاها من رحلته لمصر.",
  "genres": [
    "Short Stories",
    "Horror",
    "Gothic"
  ],
  "author": "Algernon Blackwood",
  "average_rating": "3.21",
  "url": "https://www.goodreads.com/book/show/17201136"
}