{
  "title": "Dragonthology",
  "description": "Enter the pages of the Dragonthology. No single story has ever been great enough to contain the mystical, wondrous creature known as the dragon. We assembled the greatest draconian tales and put them between the covers of a single tome to satisfy your hunger for everything dragon. Seven magnificent stories, ranging from science fiction to mystery, await you within.The Case of the Bloodstone Dragon by G.L. JacksonA washed up has been, Private Investigator Clark is down to his last $100. That is, until the night a mysterious femme fatale walks through his door weaving a tale of intrigue in hope of recovering an artifact steeped in mystery and danger. What follows is a raucous ride through a little known human anddragon history, played out on the streets of New York City.Unto the Breach by Jason AndrewJonathan Heller uncovers an unusual secret during one of the bloodiest campaigns of World War One in the middle of horrific trench warfare. Can he convince an ancient dragon that humanity is worthy of life during their darkest hour?The Dragon of Sullivan Hall by Marian AllenA dormitory full of fun loving female students, an angry red dragon with a litter full of hungry whelps, and a particular student of Irish descent. Thiswon't end well for the dragon.Egg Hunt by Jay WilburnA lonely smuggler must make decisions he never dreamt possible in the darkness of space to elude capture and protect his precious cargo of dragon eggs. When one of them hatches, it threatens to damage his ship. Can a person change enough to save a ship, a dragon, and himself?The Clan by Troy LambertDragons return to the earth and humanity enslaves them with the last remnants of technology of their dying race. Now the technology of old is fading. Will the dragons be able to rise again? Will the humans declare war, or will a peaceful solution be found? It all rests in the hands of an ancient dragon, and alowly shepherd and his clan.Dragon Seeks a Wife by Sandra GravesWhat happens when a dragon falls ill and is told he will die in a year and a day unless he finds his one true love? The only thing a dragon can do. He sets out on a quest to win the hand of the perfect mate for a dragon–the daughter of the king. Aided by a Quetzal bird sorcerer, he begins his quest. An old fashioned fairy tale with a Meso-American twist.Darkness Taken by J.A. CampbellIn a land where children are warriors and the only adults are mythical creatures, all are called to fight the Darkness. Til and her dragon partner, Heliodor, complete the perfect Welcome Ceremony, but their joy is short lived. The Dark has slain a unicorn and taken her foal back to the Darklands. Can Til and Heliodor venture where none go and rescue the young unicorn?",
  "genres": [
    "Fantasy",
    "Anthologies",
    "Dragons"
  ],
  "author": "G.L. Jackson",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/17202659-dragonthology"
}