{
  "title": "Soul Savers Box Set",
  "description": "New Adult Paranormal Romance Series by bestselling author Kristie Cook ** Mature Content ** Recommended for ages 16+ due to sexual situations and languageFirst three books of the award-winning Soul Savers Series, plus discover how the Amadis began in the bonus prequel, Genesis!Book 1 – PromiseWhen Alexis Ames is attacked by creatures that can't be real, she decides it's time she learns who she really is, with or without the help of her mother, who guards their family's secrets closely. After meeting the inhumanly attractive, multi-talented Tristan Knight, however, Alexis retreats behind her façade of normalcy...until she discovers he's not exactly normal either. Then their secrets begin to unravel.Their union brings hope and promise to her family's secret society, the Angels' army, and to the future of mankind. But it also incites a dangerous pursuit by the enemy - Satan's minions and Tristan's creators. After all, Alexis and Tristan are a match made in Heaven and in Hell.Book 2 - Purpose Lost in despair, Alexis teeters on the edge of an abyss, her lifeline of hope fraying into a thin thread. If it snaps, she'll plunge into complete darkness. With the help of her son and her writing, she's been able to hold on. Until now. Erratic impulses, disturbing delusions and her own demonic blood threaten her sanity. When she's forced to choose between hanging onto hope or letting go to serve her Amadis purposes, she faces a decision with inconceivable sacrifices. Alexis runs to the one place she thinks will provide answers, only to find herself at the center of another battle of good versus evil, not only with the Daemoni, not only within herself...but also against the worst opponent imaginable. But even if she wins, what will she lose?Book 3 - DevotionWith powerful abilities gained from the Ang'dora and Tristan back by her side, Alexis thinks she's ready for the next challenge-- protecting her son from what appears to be the inevitable. But she has so much to learn about her powers, her new world and the people in it. Nothing is what it seems to be on the surface, including the Amadis.Power-hungry politicians comprise the council and make impossible demands. A traitor lurks among them all, inciting trouble that could destroy the Amadis and, ultimately, humanity. The Daemoni wreak havoc in the human world, with the ultimatum that they'll continue attacking innocents until Alexis and Tristan are expelled from the Amadis' protection. The couple's own society begins to shut them out. But that's not all.Someone's keeping a secret. A big one. Faith and hope in Alexis and Tristan will be restored if she can uncover the truth in time.But the search for answers leads only to the discovery of more betrayals by those closest to Alexis. Her devotion is put to the test--devotion to her husband, to her family, to her people and to her beliefs--leaving her to question whom she's fighting for and why she should even bother. But if she won't fight . . . who will?Bonus - Genesis: A Soul Savers NovellaWhile the land of Ancient Greece is plagued with mortals' wars, twins Cassandra and Jordan have lived more than a lifetime as outcasts. When their dying father divulges a secret that's been buried in his soul, his children come to opposite conclusions, launching them down two very different paths.Jordan descends down a road of darkness and discovers the Daemoni, servants to Satan. His passion to gain their inhuman abilities, especially that of immortality, nearly consumes him, but when he thinks he's achieved his ultimate goal, he yearns for his sister to share in his power.Cassandra, however, follows the path of healing and light. She cares for the wounded and dying on the battlefields, while praying for the end to such atrocities. But her brother is determined to bring her into the war of all ages - the one for human souls.",
  "genres": [
    "Paranormal",
    "New Adult",
    "Fantasy",
    "Urban Fantasy",
    "Paranormal Romance",
    "Romance",
    "Science Fiction"
  ],
  "author": "Kristie Cook",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/17204723-soul-savers-box-set"
}