{
  "title": "The Sword and the Shield: The Mitrokhin Archive and the Secret History of the KGB",
  "description": "The Sword and the Shield is based on one of the most extraordinary intelligence coups of recent a secret archive of top-level KGB documents smuggled out of the Soviet Union which the FBI has described, after close examination, as the \"most complete and extensive intelligence ever received from any source.\" Its presence in the West represents a catastrophic hemorrhage of the KGB's secrets and reveals for the first time the full extent of its worldwide network. Vasili Mitrokhin, a secret dissident who worked in the KGB archive, smuggled out copies of its most highly classified files every day for twelve years. In 1992, a U.S. ally succeeded in exfiltrating the KGB officer and his entire archive out of Moscow. The archive covers the entire period from the Bolshevik Revolution to the 1980s and includes revelations concerning almost every country in the world. But the KGB's main target, of course, was the United States. Though there is top-secret material on almost every country in the world, the United States is at the top of the list. As well as containing many fascinating revelations, this is a major contribution to the secret history of the twentieth century. Among the topics and revelations explored The KGB's covert operations in the United States and throughout the West, some of which remain dangerous today. KGB files on Oswald and the JFK assassination that Boris Yeltsin almost certainly has no intention of showing President Clinton. The KGB's attempts to discredit civil rights leader in the 1960s, including its infiltration of the inner circle of a key leader. The KGB's use of radio intercept posts in New York and Washington, D.C., in the 1970s to intercept high-level U.S. government communications. The KGB's attempts to steal technological secrets from major U.S. aerospace and technology corporations. KGB covert operations against former President Ronald Reagan, which began five years before he became president. KGB spies who successfully posed as U.S. citizens under a series of ingenious disguises, including several who attained access to the upper echelons of New York society.",
  "genres": [
    "History",
    "Nonfiction",
    "Espionage",
    "Russia",
    "Politics",
    "Military Fiction",
    "Russian History"
  ],
  "author": "Christopher Andrew",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/10756.The_Sword_and_the_Shield"
}