{
  "title": "عاملة المنزل",
  "description": "\"عاملة المنزل\" هي ترجمة لرواية \"المساعدة\" للكاتبة الأميركية كاترين ستوكيت، والتي تصدّرت روايتها هذه قائمة الكتب الأكثر مبيعًا على لائحة نيويورك تايمز على الرغم من أنها روايتها الأولى. في هذه الرواية تحاول ستوكيت أن تخلق عالمًا مغايرًا من ثلاث نساء استثنائيات كان قدرهن أن تبدأ حركة خاصة بهنَّ لإحداث تغييرات في المدينة، وفي الطريقة التي يُنظر فيها إلى الأميركيين السود. وهنا، تأخذنا الروائية إلى مفصل تاريخي مهم من تاريخ الولايات المتحدة الاجتماعي والسياسي في ستينيات القرن الماضي، حيث كان التمييز العنصري على أشدِّه؛ فكان الأجدر أن تسمَّى الرواية بـ \"عدالة مسروقة\". \"عاملة المنزل\" تدور في عالم النساء بداية من موضوعها (العلاقة بين سيدة المنزل والخادمة) ومروراً بشخصيات الرواية الرئيسة (آيبلين - ميني - سكيتر) وفي هذا العالم، سوف نقرأ التعاطف والفهم جنباً إلى جنب مع الكيد اللاذع والظرف الحاد. وعلى يد سكيتر تحيك الروائية أحداث روايتها، بأسلوب سردي مشوِّق يطغى عليه التحليل النفسي والاجتماعي في جميع مراحل عملها الأدبي. فبعد تخرُّجها من الجامعة تعود سكيتر إلى مدينتها تحلم بالعمل ككاتبة، فتراسل مجموعة من دور النشر، حتى يصلها ردًا من إحداها تنصحها فيه \"هيلي\" المحررة، بمساعدتها في كتابة مشروع حملة، تدعو فيها السيدات البيض إلى إدراج حمامات خاصة بـ \"الملونين\" كما تصفهم، في أقنية المنازل الخلفية للوقاية من إصابة الأسر البيضاء بالأمراض. هنا يهتزّ هدوء سكيتر، ويتشكّل أمامها بالتدريج ما تريد أن ترويه. (كتاب تحكي فيه الخادمات السود، بأسماء مستعارة، حكاياتهن عن الخدمة في منازل الأسر البيضاء). ومع هذا القرار تفجِّر الروائية بلسان سكيتر مشكلة التفرقة العنصرية بسماع قصص النساء المروعة لتحوّلها إلى رواية تعيد الأمل والفخر إلى المجتمع الأسود، وتضخ الشجاعة في نفسها في خطوة إلى الأمام تحطِّم فيها قيود مجتمعها دافعة أحلامها بقوة مطالبة بحقوق السود المدنية. إنه اعتراف مؤثر وعميق لجريمة التمييز العنصري، عبّرت عنه الروائية في حوارات عاملات المنازل، يعيدنا بالذاكرة إلى حركات التحرر الشعبية التي كان مارتن لوثر كينغ من قادتها، وأدّت في نهايتها إلى تحصيل حقوق الأميركيين السود كاملة، والتي سُمِّيت فيما بعد بحركة الحقوق المدنية. وهنا سؤال يطرح نفسه باستمرار وفي كل عصر، لماذا لا تتحصّل الحقوق ويحدث التغيير إلا بالثورة، وهذا يعني أن إشكالية معرفية قائمة لا تزال بين عالمين، بين ثقافتين، أو بين مصالح متضاربة حتى داخل المجتمع الواحد، فعمل العبيد هو ما أدّى إلى تراكم الثروات وظهور الرأسمالية كنظام أزال رويداً رويداً ما سبقه دون النظر إلى بديهية خصَّ الله بها البشر \"العدالة\" والتي هي منحة إلهية مقدسة؛ فما يجمع البشر ويوحدهم في هذا العالم، هو مقدار ما يحمل كل واحد من خير في داخله قبل أي شيء آخر أسودًا كان أم أبيض.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Book Club",
    "Historical",
    "Adult",
    "Adult Fiction",
    "Contemporary"
  ],
  "author": "Kathryn Stockett",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/10756012"
}