{
  "title": "The Era of the Witness",
  "description": "What is the role of survivor testimony in Holocaust remembrance? Today such recollections are considered among the most compelling and important historical sources we have, but this has not always been true. In The Era of the Witness, a concise, rigorously argued, and provocative work of cultural and intellectual history, Annette Wieviorka seeks to answer this surpassingly complex question. She analyzes the conditions under which survivor testimonies have been produced, how they have been received over time, and how the testimonies shaped the construction of history and collective memory. Wieviorka discerns three successive phases in the evolution of the roles and images of the Holocaust witness. The first phase is marked by the testimony left by those who did not survive the Holocaust but managed nevertheless to record their experiences. The second, most important, phase is centered on the Eichmann trial, which for Wieviorka is the moment (1961–1962) when a broad cultural deafness to survivors' stories was replaced by the image of the witness as \"bearer of history.\" The author follows the changing nature of the witness into a third phase, which she calls \"the era of the witness.\" Especially concerned with the pedagogical and political uses to which survivor testimony has been put, Wieviorka examines factors that determine when and how survivor testimonies are incorporated into the larger narrative of the Holocaust, according it a privileged place in our understanding. By exploring the ways in which the Holocaust is remembered, The Era of the Witness also deepens our understanding of how testimony can help to define not only twentieth-century history but also more recent episodes of mass killing that are only now \"becoming history.\"",
  "genres": [
    "History",
    "Nonfiction",
    "Holocaust",
    "Jewish",
    "Academic"
  ],
  "author": "Annette Wieviorka",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/1720616.The_Era_of_the_Witness"
}