{
  "title": "Everything You Were Taught about the Civil War Is Wrong, Ask a Southerner!",
  "description": "There are two things that enemies of the traditional conservative South cannot being faced with the facts and having their myths and lies about Lincoln's War exposed. But if we are ever to learn the full and honest truth about the conflict, then exposed they must be.In Everything You Were Taught About the Civil War is Wrong, Ask a Southerner! award-winning historian and author Colonel Lochlainn Seabrook sets the record straight in this easy-to-read, well documented handbook that confronts the North's many falsehoods about the American Civil War - important facts the anti-South Movement has been suppressing for 150 years! Divided into convenient chapters, such as \"Cause of the War,\" \"Secession,\" \"Slavery,\" \"The Abolition Movement,\" \"Jefferson Davis,\" \"Abraham Lincoln,\" \"The Emancipation Proclamation,\" \"The Union and Blacks,\" \"Yankee War Crimes,\" \"Prisons,\" and \"The Confederate Flag\" (among many others), this bestselling exposé of Yankee anti-South propaganda has the power to heal hearts and change minds. For in reeducating the world about Lincoln's War it will give Northerners a better understanding of the conflict itself, while making Southerners, of all races and political persuasions, proud to be Southern.Read the politically incorrect, international blockbuster that everyone's talking about - the book that totally blows the lid off Yankee mythology and debunks the Left's fake Civil War history - and learn the Truth for yourself, from Dixie's perspective. You will never completely understand the conflict until you do. Contains over 1,000 endnotes and a 700-book bibliography, and is endorsed by Dixie Outfitters, the Southern National Congress, League of the South, and numerous other pro Southern heritage organizations and individuals - and even by many Yankees. The Foreword is by noted African-American educator and Sons of Confederate Veterans member Nelson W. Winbush, M.Ed., the grandson of Private Louis Napoleon Nelson, just one of the hundreds of thousands of black Confederate soldiers who fought for the South.Everything You Were Taught About the Civil War is Wrong, Ask a Southerner! has become required reading in homes and schools all over the world and is available in paperback, hardcover, and large print. Blurbs are by Thomas Moore (Chairman, Southern National Congress), Ronny Mangrum (Adjutant, Roderick, Forrest's War Horse Camp 2072, Sons of Confederate Veterans), Timothy D. Manning (Exec. Dir., The Southern Partisan Reader), J. T. Thompson (Exec. Dir., Lotz House Museum, Franklin, TN), Scott Bowden (award-winning historian and author), and Barbara Marthal, B.A., M.Ed., (African-American educator and Civil War reenactor).Neo-Victorian historian Lochlainn Seabrook, whose literary works range from astronomy to zoology, is one of the most prolific and popular writers in the world today. A descendant of the families of Alexander H. Stephens, John S. Mosby, Edmund W. Rucker, and William Giles Harding, he is known by literary critics as the \"new Shelby Foote\" and the \"American Robert Graves,\" and by his fans as the \"Voice of the Traditional South.\" The Sons of Confederate Veterans member is a Kentucky Colonel, a recipient of the prestigious Jefferson Davis Historical Gold Medal, and the author and editor of nearly 100 scholarly books (currently). Described by his readers as \"game changers\" and \"life-altering,\" his voluminous writings have introduced hundreds of thousands to vital facts that have been left out of our mainstream books. A 7th generation Kentuckian of Appalachian heritage and the 6th great-grandson of the Earl of Oxford, Col. Seabrook has a 45-year background in American and Southern history, and is the author of the sensational bestseller Abraham Lincoln Was a Liberal, Jefferson Davis Was a The Missing Key to Understanding the American Civil War .",
  "genres": [
    "History",
    "Nonfiction",
    "Civil War",
    "American History"
  ],
  "author": "Lochlainn Seabrook",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/10756230-everything-you-were-taught-about-the-civil-war-is-wrong-ask-a-southerne"
}