{
  "title": "Ocean's Gift",
  "description": "Sirens don't fall in love with humans. For centuries it has been so... But Sirena is different. She lost her first love to sharks and a storm, cursing the islands that stole him from her.Times have changed and she must swim ashore once more, to the islands she once cursed. Gone are the boats powered by sail and steam - jet boats with GPS are now the order of the day. Enter Joe, the deckhand on the Dolphin. A handy man to have around when the lights go out. He'll fix your generator and have the lights back on in no time, no worries.But can he seduce a siren? Or will she swim away before he can uncover her secret? A book about lobsters, beer and boobs, on some cursed islands off the coast of Western Australia. At least, that's how Joe tells it.For Sirena, it's a very different story.A tiny taste of what's in store:The boat was almost full of water now, I realised in panic, as I groped for a bucket to start bailing. Throwing bucket after bucket overboard, I couldn't tell if I was making any difference to the water level in the boat.One moment I was holding the bucket, about to scoop up more water, the next I was flying through the air. Immersed in cold, black water, I couldn't see the surface. I struggled, kicking in the direction I thought was up, and hit a rock. I jerked back reflexively and my head cleared the water. I gulped a huge lungful of air and grabbed for the rock. I had to hold on 'til daylight. Another big wave broke. I tried to keep hold of the slimy rock, but I was pushed out of reach, drifting in the current. I tried to kick my legs, but I wasn't sure if I did. I couldn't feel my feet and the numbness was creeping up my legs. I could hear the breakers on the outer reef, louder than they were from shore. I could feel the spray on my face. A wave washed over me and I was under the water again. I thought I could feel someone beside me, rolling me over so my face was at the surface, pulling my body through the water. All I could hear was an unearthly singing, high and sad, like some kind of suicidal dolphin. I could say I blacked out, but everything was already so black I wouldn't have noticed the difference. I checked out of Hotel Consciousness. At least I got to dream of Vanessa naked. Ocean's Gift seriesThis is the first book in Demelza Carlton's Ocean's Gift series, which currently includes: \nOcean's Gift (Book 1) \n  \nOcean's Infiltrator (Book 2) \n  \nWater and Fire\nYou'll never look at mermaids the same way again.",
  "genres": [
    "Fantasy",
    "Mermaids",
    "Romance",
    "Paranormal Romance",
    "Paranormal",
    "Shapeshifters"
  ],
  "author": "Demelza Carlton",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/17206620-ocean-s-gift"
}