{
  "title": "البداية والنهاية - الجزء الثاني",
  "description": "ذكر جماعة من أنبياء بني إسرائيل بعد موسى عليه السلام | قصة حزقيل | قصة اليسع عليه السلام | فصل في حال بني إسرائيل | قصة شمويل عليه السلام | قصة داود وما كان في أيامه وذكر فضائله وشمائله ودلائل نبوته وإعلامه | ذكر كمية حياته وكيفية وفاته عليه السلام | قصة سليمان بن داود عليهما السلام | ذكر وفاته وكم كانت مدة ملكه وحياته | باب ذكر جماعة من أنبياء بني إسرائيل بعد داود وسليمان | ومنهم ارميا بن حلقيا من سبط لاوي بن يعقوب | ذكر خراب بيت المقدس | ذكر شيء من خبر دانيال عليه السلام | ذكر عمارة بيت المقدس بعد خرابها | وهذه قصة العزير | فصل:حفظ عزيرا التوراة | قصة زكريا ويحيى عليهما السلام | بيان سبب قتل يحيى عليه السلام | قصة عيسى بن مريم عبد الله ورسوله وابن أمته عليه من الله أفضل الصلاة والسلام | ميلاد العبد الرسول عيسى بن مريم العذراء البتول | باب بيان أن الله تعالى منزه عن الولد تعالى الله عما يقولون علوا كبيرا | ذكر منشأ عيسى بن مريم عليهما السلام | بيان نزول الكتب الأربعة ومواقيتها | بيان شجرة طوبى ما هي؟ | ذكر خبر المائدة | فصل توجه عيسى عليه السلام نحو البحر. | ذكر رفع عيسى عليه السلام إلى السماء | ذكر صفة عيسى عليه السلام وشمائله وفضائله | فصل اختلاف أصحاب المسيح في رفع عيسى إلى السماء. | بيان بناء بيت لحم والقمامة | كتاب أخبار الماضين من بني إسرائيل وغيرهم | خبر ذي القرنين | بيان طلب ذي القرنين عين الحياة | ذكر أمتي يأجوج ومأجوج وصفاتهم | قصة أصحاب الكهف | قصة الرجلين المؤمن والكافر | قصة أصحاب الجنة | قصة أصحاب أيلة الذين اعتدوا في سبتهم | قصة أصحاب القرية | قصة لقمان | قصة أصحاب الأخدود | بيان الإذن في الرواية عن أخبار بني إسرائيل | قصة جريج أحد عباد بني إسرائيل | قصة برصيصا | قصة الثلاثة الذين أووا إلى الغار فانطبق عليهم | خبر الثلاثة الأعمى والأبرص والأقرع | حديث الذي استلف من صاحبه ألف دينار فأداها | قصة أخرى شبيهة بهذه القصة في الصدق والأمانة | قصة توبة قاتل التسعة وتسعين نفسا | حديث بينما رجل يسوق بقرة إذ ركبها | حديث كان فيما مضى قبلكم من الأمم محدثون | حديث إنما هلكت بنو إسرائيل | حديث بينما كلب يطيف بركيه كاد يقتله العطش | حديث عذبت امرأة في هرة | حديث كان في بني إسرائيل امرأة قصيرة | حديث إن مما أدرك الناس | حديث بينما رجل وامرأة له في السلف الخالي | قصة الملكين التائبين | حديث إن رجلا كان قبلكم رغسه الله مالا | حديث كان رجل يداين الناس | حديث الطاعون رجس أرسل على طائفة من بني إسرائيل | حديث أتشفع في حد من حدود الله؟ | حديث كلاكما محسن | حديث إن اليهود والنصارى لا يصبغون فخالفوهم | حديث لعن الله اليهود | حديث فأمر بلال أن يشفع الأذان | حديث لعنة الله على اليهود والنصارى | حديث لتتبعن سنن من قبلكم شبرا بشبر | حديث إنما أجلكم في أجل من خلا من قبلكم من الأمم | فصل: بعض القصص من الإسرائيليات | تحريف أهل الكتاب وتبديلهم أديانهم | ليس للجنب لمس التوراة | كتاب الجامع الأخبار الأنبياء المتقدمين | حديث إني خاتم ألف نبي | ذكر أخبار العرب | قصة سبأ | فصل إقامة ست قبائل من سبأ في اليمن. | قصة ربيعة بن نصر بن أبي حارثة بن عمرو بن عامر | قصة تبع أبي كرب مع أهل المدينة | وثوب لخنيعة ذي شناتر على ملك اليمن | خروج الملك باليمن من حمير إلى الحبشة السودان | خروج أبرهة الأشرم على أرياط واختلافهما | سبب قصر أبرهة بالفيل مكة ليخرب الكعبة | خروج الملك عن الحبشة ورجوعه إلى سيف بن ذي يزن | ما آل إليه أمر الفرس باليمن | قصة الساطرون صاحب الحضر | خبر ملوك الطوائف | ذكر بني إسماعيل وما كان من أمور الجاهلية إلى زمان البعثة | قصة خزاعة وعمرو بن يحيى وعبادة العرب للأصنام | باب جهل العرب | خبر عدنان جد عرب الحجاز | أصول أنساب عرب الحجاز إلى عدنان | قريش نسبا واشتقاقا وفضلا وهم بنو النضر بن كنانة | خبر قصي بن كلاب وارتجاعه ولاية البيت إلى قريش وانتزاعه ذلك من خزاعة | فصل: تفويض قصي أمر الوظائف لابنه عبد الدار | ذكر جمل من الأحداث في الجاهلية | ذكر جماعة مشهورين في الجاهلية | حاتم الطائي أحد أجواد الجاهلية | شيء من أخبار عبد الله بن جدعان | امرؤ القيس بن حجر الكندي صاحب إحدى المعلقات | أخبار أمية بن أبي الصلت الثقفي | بحيرا الراهب | ذكر قس بن ساعدة الإيادي | زيد بن عمرو بن نفيل رضي الله عنه | شيء من الحوادث في زمن الفترة | كعب بن لؤي | تجديد حفر زمزم | نذر عبد المطلب ذبح ولده | تزويج عبد المطلب ابنه عبد الله من آمنة بنت وهب الزهرية | كتاب سيرة رسول الله صلى الله عليه وسلم | باب مولد رسول الله صلى الله عليه وسلم | صفة مولده الشريف عليه الصلاة والسلام | فصل فيما وقع من الآيات ليلة مولده عليه الصلاة والسلام | ذكر ارتجاس إيوان كسرى، وسقوط الشرفات | حواضنه ومراضعه عليه الصلاة والسلام | رضاعه عليه الصلاة والسلام من حليمة | فصل ذكر رجوعه عليه الصلاة والسلام إلى أمه آمنة بعد رضاعة حليمة | فصل كفالة عبد المطلب للنبي عليه الصلاة والسلام | فصل في خروجه عليه الصلاة والسلام مع عمه أبي طالب إلى الشام | قصة بحيرا | فصل في منشئه ومرباه عليه الصلاة والسلام | شهوده عليه الصلاة والسلام حرب الفجار | فصل شهود رسول الله عليه الصلاة والسلام حلف المطيبين مع عمومته | تزويجه عليه الصلاة والسلام خديجة بنت خويلد | باب ما كان يشتغل به رسول الله صلى الله عليه وسلم قبل أن يتزوج خديجة | فصل ذكر خديجة لورقة بن نوفل عن النبي عليه الصلاة والسلام | فصل في تجديد قريش بناء الكعبة قبل المبعث بخمس سنين | فصل تعظيم قريش للحرم تعظيما زائدا أدى إلى الابتداع | مبعث رسول الله صلى الله عليه وسلم تسليما كثيرا وذكر شيء من البشارات بذلك | فصل طلب اليهود من الله تعالى أن يبعث لهم نبيا يحكم بينهم وبين الناس | ذكر أخبار غريبة في ذلك | قصة عمرو بن مرة الجهني | قصة سيف بن ذي يزن وبشارته بالنبي | باب في هواتف الجان",
  "genres": [
    "Nonfiction",
    "Religion",
    "History"
  ],
  "author": "ابن كثير",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/17207395--"
}