{
  "title": "Always & Forever",
  "description": "WARNING: This book is not for the faint hearted. If you do not like to read about dark themes, obsessive love or crazy, jealous and possessive heroes, then this book is not for you.\"Being with you isn’t a choice; we’re not an option, Bethany. Don’t you understand that? I’ve actually reached the stage where I know I wouldn’t even be able to exist without you. My need for you is like oxygen, it’s not something I can control or even try to explain. I can honestly say that I would cease to exist without you in my life; I would sooner die than be separated from you. You’ve taken over my mind, body and soul, all I think about is you. You’re the centre of my universe, you’re all I can see and you know what? That’s absolutely fine; it’s fine because you’re the only one I need. It’s you, Bethany. It will always be you.” - Jake.\"Jake’s intensity can sometimes scare me and yet it is the same unyielding intensity that draws me to him. I’ve never wanted anything or anyone as much as I want Jake. I crave him and I’m not ashamed or embarrassed to admit that he’s now become the centre of my world. He’s completely taken over my mind, my body and my soul. The truly messed up part of this is... I don’t mind.\" - Bethany.Bethany is a twenty year old young woman craves freedom. She longs for an escape which will free her from her controlling father's clutches but hope of escape has always been impossible. Until now......Until Jake.Irresistibly handsome and fiercely protective over the fragile young girl he's just met, Jake is adamant that nothing will keep them apart. He soon becomes fixated on the idea of them being together and will stop at nothing to make sure that happens.Bethany knows her father and the lengths that he will go to. He's a cruel man who wants to keep her for himself and will share Bethany with no one. However, Jake is not to be underestimated. He hasn't always been the good man that he is today.Jake is desperate to keep Bethany in his life. He also wants to protect her from the darkness which surrounds him and his past, a past which continues to haunt him. Jake has a secret... one which is dark and extremely painful, threatening to tear his whole world apart if he allows it.But will he?It's love versus evil in this enthralling debut about first love, passion, obsession and jealousy... ***Read at your own risk.****** This New Adult romance novel contains mature themes, scenes of violence, strong language and sexual citations. It is recommended for readers 18+ ***",
  "genres": [
    "New Adult",
    "Romance",
    "Dark",
    "Young Adult",
    "Contemporary Romance"
  ],
  "author": "Lauren  Crossley",
  "average_rating": "3.27",
  "url": "https://www.goodreads.com/book/show/17208412-always-forever"
}