{
  "title": "Dressing Renaissance Florence: Families, Fortunes, and Fine Clothing",
  "description": "As portraits, private diaries, and estate inventories make clear, elite families of the Italian Renaissance were obsessed with fashion, investing as much as forty percent of their fortunes on clothing. In fact, the most elaborate outfits of the period could cost more than a good-sized farm out in the Mugello. Yet despite its prominence in both daily life and the economy, clothing has been largely overlooked in the rich historiography of Renaissance Italy. In Dressing Renaissance Florence , however, Carole Collier Frick provides the first in-depth study of the Renaissance fashion industry, focusing on Florence, a city founded on cloth, a city of wool manufacturers, finishers, and merchants, of silk dyers, brocade weavers, pearl dealers, and goldsmiths. From the artisans who designed and assembled the outfits to the families who amassed fabulous wardrobes, Frick's wide-ranging and innovative interdisciplinary history explores the social and political implications of clothing in Renaissance Italy's most style-conscious city. Frick begins with a detailed account of the industry itself―its organization within the guild structure of the city, the specialized work done by male and female workers of differing social status, the materials used and their sources, and the garments and accessories produced. She then shows how the driving force behind the growth of the industry was the elite families of Florence, who, in order to maintain their social standing and family honor, made continuous purchases of clothing―whether for everyday use or special occasions―for their families and households. And she concludes with an analysis of the clothes what pieces made up an outfit; how outfits differed for men, women, and children; and what colors, fabrics, and design elements were popular. Further, and perhaps more basically, she asks how we know what we know about Renaissance fashion and looks to both Florence's sumptuary laws, which defined what could be worn on the streets, and the depiction of contemporary clothing in Florentine art for the answer. For Florence's elite, appearance and display were intimately bound up with self-identity. Dressing Renaissance Florence enables us to better understand the social and cultural milieu of Renaissance Italy.",
  "genres": [
    "History",
    "Fashion History",
    "Nonfiction",
    "Fashion",
    "Italy"
  ],
  "author": "Carole Collier Frick",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/1720902.Dressing_Renaissance_Florence"
}