{
  "title": "Achtung...We Rule the Waves: A Saga of War at Sea",
  "description": "Achtung...We Rule the Waves (Volume 1) is a comedy war novel by the very talented writer Alfred Nestor. The superlative of “gripping from start to finish” is certainly true of this World War Two war at sea novel.Out in the Irish Sea is a U-boat lurking about, it keeps watch over shipping movements in and out of Liverpool, and reports all sightings to U-boat Command in France. The result is that the convoys are set upon by Hitler’s U-boat wolf packs, and convoys that reach Liverpool get attacked by the Luftwaffe. The problem is that the elusive U-boat moves about like a ghost in the night. Whenever the British Navy think they have found it, they send out destroyers to sink it... and it’s vanished before they can seek it out! The U-boat is using a base somewhere in Southern Ireland, and there is the job for Commander Hurst, to seek out their hidey-hole, destroy it and the U-boat along with it.The story begins in Liverpool, England when Commander John Hurst RN DSM/Bar is being driven by his Wren Navy driver through the bomb-damaged streets of Liverpool. After ramming his corvette, HMS Daisy, into a U-boat in the Atlantic, Commander John Hurst had been “resting”. Now he was summoned to Derby House by Admiral Cunningham. Admiral Cunningham tells the unwitting Commander, “Well... it’s all terribly hush-hush. I wondered whether I should even tell myself, but, then again, it was my idea, so I had to know. The plan was to find an officer who can think for himself... honour but no guide book... get a job done with no big brother... just get the bloody job done, very difficult you know.”The plan Admiral Cunningham has for Commander Hurst involves him and a specially redesigned corvette class ship, HMS Sunflower, that is berthed in Liverpool Docks. Commander Hurst’s mission: Destroy the Irish U-boat base, and the Port of Liverpool lives again.The story then moves into the Irish Sea, followed by fast-paced and tense cat and mouse chasses between HMS Sunflower and U-554X (U-boat) with the rather stern Kapitan Kruger in charge of it. Many real place names are used as well as the author’s licence to include various other real names, but all in a fictional manner.There are some hilariously eye-wateringly funny situations for both crews, and Alfred Nestor is to be applauded for his unique talent in creating a masterpiece.EXTRACTS FROM NOVELThere was silence while John gave all this some deep thought and then, after several minutes had passed, he made his decision. He said, “I will do it, sir, but I’m worried about how this might affect my officers and crew if, as you said, the manure hits the fan? I would hate to think that by following my unofficial orders and getting myself in official trouble, I also get my men in official trouble. Can I be certain that the buck will stop with me?”The Admiral looked delighted with John’s answer, and said, “Don’t worry... had a feeling I picked the right man... an officer who cares for his men... have no fear, there’ll be no court marshal or trouble for your men. If any of you are caught by the Irish you will all be returned here for trial and court marshal, that’s our deal with them. You, my boy, will carry the can and the crew go free.” *****The message was sent from the powerful transmitter in the cave and within 10 minutes a message arrived from Admiral Dönitz’s Headquarters. The radioman brought it to the control room himself and handed it to Kapitan Kruger.Hans Kruger read it and then, keeping his face as straight as he could, he handed it to Kapitan Finkelstien.It read as follows: “From U-boat Command. All surface ships engaged. Try stealing a fishing boat. Have brick wall here dedicated to Finkelstien. Suggest you hide until war is over.” WHAT THE AUTHOR SAYS“War is a serious business, and not just for the armies involved, it is not a laughing matter... normally, but if all around you are throwing rocks, and things that go BANG then it’s always best to keep your sense of humour, and throw custard pies at the others. Now if you believe this, just read this book! It’s just full of pies of all flavours.” - Alfred NestorABOUT THE AUTHORAlfred Nestor was born in Strausberg, a city in Brandenburg, Germany. Now resident in Liverpool, England, Alfred is married with a large and active family.",
  "genres": [],
  "author": "Alfred Nestor",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/17209480-achtung-we-rule-the-waves"
}