{
  "title": "Classic Cult Fiction: A Companion to Popular Cult Literature",
  "description": "Question: What does Salinger's \"The Catcher in the Rye\" (1951) have in common with Goethe's \"The Sorrows of Young Werther\" (1774)? Answer: Actually a great deal. They are classics of cult fiction and share many attributes. Cult fiction is a reader-created genre. A cult book can appear within any type of literary genre--for instance, romance, mystery, science fiction--but will achieve cult status only on the basis of reader response. It has qualities that speak to a reader, who may feel that it has been written for him or her alone; yet this very personal appeal is widespread, and such a book may grow in popularity almost as an underground movement, inspiring a generation of readers and sometimes enduring as a mainstream classic. Though amazingly diverse, such books also have astonishing commonalities pervasive enough to qualify them as comprising a genre.\"Classic Cult Fiction\" is a history, analysis, and reference guide to books that have become bibles to generations of Europeans and Americans over the past two hundred years. Though canon formation is an awesome prospect, sure to lead to challenges by scholars and readers alike, author Thomas Whissen fearlessly identifies the top fifty classic cult books, first presenting an informed and witty interpretation of the phenomenon and its characteristics with examples from different cultures and periods. Cult fiction is shown to be a product of the Romantic movement and a reflection of the persistent romantic temperament in Western civilization. The work offers insights into the mentality of the Golden Age of Cult Fiction, the 1960s, by analyzing the cult books that both influenced the age and were influenced by it. The fifty individual works are each discussed relative to time and place, impact, and audience psychology and analyzed in terms of common cult attributes. A chronological listing of cult fiction adds a number of titles not chosen for the top fifty. An original approach to criticism, this literary companion argues the case for cult fiction as a distinct genre and offers fifty fresh and thought provoking essays to back up the contention.",
  "genres": [],
  "author": "Thomas Reed Whissen",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/1720972.Classic_Cult_Fiction"
}