{
  "title": "De hemel boven Vietnam",
  "description": "Memory is the one who builds you a permanent court of justice. Memory is the one at your side from whom you cannot run... A sweeping tale of thwarted love, political intrigue, and the price of power--\"The Doctor Zhivago of Vietnam\" (Boston Globe)--about Ho Chi Minh, the founding father of modern Vietnam, a man beloved by millions but shrouded in controversy and mysteryVietnam's most popular dissident writer, Duong Thu Huong has won acclaim for her exceptional lyricism and psychological acumen, as well as for her unflinching portraits of modern Vietnam and its culture and people. Built on 15 years of research, The Zenith imagines the final months in the life of Ho Chi Minh--president of North Vietnam from 1945 until his death in 1969--at an isolated mountain compound where he is imprisoned both physically and emotionally.Complex, daring, and elegiac, Huong's novel weaves Ho Chi Minh's story together with narratives of members of his inner circle and a village elder, illuminating the personal costs of political struggle, the addictive quality of power and influence, and how a tragedy can threaten to engulf not just one individual but an entire nation. Most radically, it is a multidimensional portrait of Ho Chi Minh himself; a man who is often painted as a saint, martyr, or puppet, but whom Huong portrays as a real person whose life encapsulated humanity's capacity for vision, greed, pain, love, and fallibility.An epic masterpiece that is both a gripping political thriller and a haunting excavation of the human heart, The Zenith is an unforgettable novel that leaves readers unsettled, transformed, and closer to life's fundamental mysteries.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Asian Literature",
    "Asia",
    "Novels",
    "Literature",
    "Politics"
  ],
  "author": "Dương Thu Hương",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/17210944-de-hemel-boven-vietnam"
}