{
  "title": "The Oxford Book of English Ghost Stories",
  "description": "With their evocative settings amid mists and shadows, in ruinous houses, on lonely roads and wild moorlands, in abandoned churches and over-grown gardens, ghost stories have long exercised a universal fascination. Here at last is an anthology of some of the very best English ghost stories which combines a serious literary purpose with the plain intention of arousing a pleasurable fear at the doings of the dead. This selection of forty-two stories, written between 1829 and 1968, is the first to present the full range and vitality of the ghost fiction tradition by demonstrating its historical development as well as its major themes and characteristics. It includes stories by Walter Scott, M. R. James, Bram Stoker, Rudyard Kipling, Edith Wharton, Somerset Maugham and T. H. White. Elizabeth Bowen suggested that the ghost story works \"through a series of happenings whose horror lies in their being just, just, out of time,\" and the success of a story may be judged by what Edith Wharton called its \"thermometrical quality; if it sends a cold shiver down the spine, it has done its job and done it well.\" The challenge of this most demanding form has been taken up by a host of writers, both 'specialists' like J. S. Le Fanu and Algernon Blackwood, and those, such as Henry James and H. G. Wells, for whom ghost stories were only a part of their literary output. Nor does this collection overlook the important contribution of women writers, with eight stories included from Amelia Edward's The Phantom Ghost (1864) to Elizabeth Bowen's Hand in Glove (1952).The tapestried chamber / Walter Scott --The phantom coach / Amelia B. Edwards --Squire Toby's will / J.S. Le Fanu --The shadow in the corner / M.E. Braddon --The upper berth / F. Marion Crawford --A wicked voice / Vernon Lee --The judge's house / Bram Stoker --Man-size in marble / E. Nesbit --The roll-call of the reef / Arthur Quiller-Couch --The friends of the friends / Henry James --The red room / H.G. Wells --The monkey's paw / W.W. Jacobs --The lost ghost / Mary E. Wilkins --\"Oh, whistle, and I'll come to you, my lad\" / M.R. James --The empty house / Algernon Blackwood --The cigarette case / Oliver Onions --Rose Rose / Barry Pain --The confession of Charles Linkworth / E.F. Benson --On the Brighton Road / Richard Middleton --Bone to his bone / E.G. Swain --The true history of Anthony Ffryar / Arthur Gray --The Taipan / W. Somerset Maugham --The victim / May Sinclair --A visitor from down under / L.P. Hartley --Fullcircle / John Buchan --The clock / W.F. Harvey --Old man's beard / H. Russell Wakefield --Mr Jones / Edith Wharton --Smee / A.M. Burrage --The little ghost / Hugh Walpole --Ahoy, sailor boy! / A.E. Coppard --The hollow man / Thomas Burke --Et in sempiternum pereant / Charles Williams --Bosworth summit pound / L.T.C. Rolt --An encounter in the mist / A.N.L. Munby --Hand in glove / Elizabeth Bowen --A story of Don Juan / V.S. Pritchett --Cushi / Charistopher Woodforde --Bad company / Walter de la Mare --The bottle of 1912 / Simon Raven --The Cicerones / Robert Aickman --Soft voices at Passenham / T.H. White",
  "genres": [
    "Horror",
    "Short Stories",
    "Fiction",
    "Ghost Stories",
    "Anthologies",
    "Ghosts",
    "Classics"
  ],
  "author": "Michael Cox",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/1721148.The_Oxford_Book_of_English_Ghost_Stories"
}