{
  "title": "Raphael/Parish",
  "description": "New Year. New World. New Species.In the depths of the bayous lives a secret race of puma shifters. The creation of a powerful magic, they have lived in peace until the threat of extinction drives them to seek the world beyond their homelands. Now the Pantera must discover the answer to their dying magic and halt an ancient enemy before it can destroy them all. RAPHAELThe brilliant and dangerous diplomat of the Pantera shapeshifters, Raphael has devoted his life to discovering the key to the infertility that is threatening the extinction of his puma race. Creating a vast network of spies worldwide, he never expected to discover that the answer might be beneath his very nose. But when Ashe, a beautiful human female, crosses his path, his most primitive instincts are stirred. Unable to resist, he takes her to his bed, and is shocked when she becomes pregnant with his child. It’s a miracle that might prove to be the salvation of his people, but only if he can keep her safe from the mercenaries determined to kill her.PARISHUntamed and undeniably sexy, Parish, leader of the Pantera hunters, rarely leaves the magic of the Wildlands to deal with the humans he despises. But with the prized and risky Pantera birth on the way, puma shifter, Parish must travel to New Orleans to find and bring back a human doctor. The moment he sees the lovely, talented and all too human Dr. Julia Cabot he cannot resist the wild, potent drive to make her his. Betrayed and destroyed by love, Julia will not let her heart choose her path again. But as she and Parish fight to save the life of an unborn child, a fierce and overwhelming bond develops between them, threatening her frozen heart with the secret hope and ultimate temptation of love and family.",
  "genres": [
    "Paranormal",
    "Paranormal Romance",
    "Shapeshifters",
    "Romance",
    "Fantasy",
    "Magic",
    "Novella"
  ],
  "author": "Alexandra Ivy",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/17212956-raphael-parish"
}