{
  "title": "80/20 Sales and Marketing: The Definitive Guide to Working Less and Making More",
  "description": "Stop \"Just Getting By\" ... Master The 80/20 Principle And Make More Money Without More Work.When you know how to walk into any situation and see the 80/20's, you can solve almost ANY marketing problem.80/20 can demolish any sales and advertising problem.\"If you don't know who Perry Marshall is--unforgivable. Perry's an honest man in a field rife with charlatans.\"- Dan Kennedy, Author, The Ultimate Marketing PlanIf you're a sales and marketing professional, you can save 80 percent of your time and money by zeroing in on the right 20 percent of your market. By page 5 you'll be applying 80/20² and 80/20³ to gain 10X, even 100X the success.With powerful 80/20 software (online, included with the book), you'll apply the Pareto Principle to:Created by direct marketing and sales consultant and best-selling author Perry Marshall, unique tools show you exactly how much money you're leaving on the table, and how to put it back in your pocket - then reinvest for even greater success.You'll identify untapped markets (page 164), incremental improvements and high-profit opportunities, gaining time and greater income potential.Easy Read\"It is an easy read...very accessible, shortchapters, and actually quite entertaining,\" says Susan Kruger, Master of Education & founder of SOAR Study Skills. This book is peppered with stories that demonstrate powerful sales principles.Optimized for Speed LearningSpecially marked \"Pareto Points\" help you digest the most valuable 80/20 Principles in 1-5 minutes. Each chapter concludes with a Pareto Summary. The book features an online 1-page \"80/20 Cheat Sheet.\"80/20 = Law of Nature  The 80/20 Principle is an inviolable law of nature, which makes it  the  #1 organizing principle of every business. Perry shows how to laser focus the 80/20 Principle in outsourcing, hiring, publicity, controversy, market research, lead generation, and web traffic; online, offline and social media (page 82). He also shows you how to glean huge insights from tiny clues, not only in your own business but from competitors.Online Marketing Tools Come with the Book  Supported by online services including The 80/20 Power Curve ,  which helps you find invisible money, and the Marketing DNA Test , a personal assessment that zeroes in on your natural selling assets, this timeless guide is a game-changer for seasoned and novice marketers and sellers.",
  "genres": [
    "Business",
    "Nonfiction",
    "Entrepreneurship",
    "Finance",
    "Buisness",
    "Money",
    "Self Help"
  ],
  "author": "Perry Marshall",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/17214272-80-20-sales-and-marketing"
}