{
  "title": "Hearts Unleashed: A Second Acts Novel",
  "description": "Hearts Unleashed is Julia Dumont's third novel in the Second Acts contemporary romance series. Cynthia Amas, matchmaking guru to everyone but herself, has just opened the new offices of her highly personalized boutique dating service in Hollywood, California. One of her new clients——a gorgeous, well-connected, uber-rich widow——comes in search of a new lease on life in the form of no less than a social and sexual reawakening. The story moves across the endlessly entertaining landscape of Los Angeles——from an astonishingly erotic art exhibit to a decidedly intoxicating voyage with a wildly attractive crew of love and lust seekers via a luxury yacht up the Southern California coast.Colorful supporting characters in this sensuous and deliciously convoluted farce include Cynthia’s best friend Lolita and her ever-mystifying pack of talented dogs; Paloma, Cynthia’s beautiful young assistant; a passionate new import from Dublin named Seamus O’Brien; baddest-of-bad-boy ex-lovers Max; and superstar screen idol Jack Stone...all seemingly hell-bent on complicating the matters of the heart beyond belief. Meanwhile, Cynthia’s lovably eccentric mother has run off to Italy with one of the biggest philanderers in Hollywood.Throughout it all, Cynthia attempts to maintain a long distance affair with her own possible once-in-a-lifetime true love match, but as she encounters the sensual on-the-job temptations of a life in the romance business, it all seems to be slipping through her fingers.Love and lust stir up jealousies and romantic entanglements that come to a passionate and hilarious climax, leaving the reader breathless from laughter and pretty much every other emotion.Kirkus Reviews as well as reader reviews for the first two books in the Second Acts series are extremely positive. The Kirkus Review for Starstruck Romance and Other Hollywood Tails \"A sexy romp through glamorous modern Hollywood as seen through the eyes of a self-possessed matchmaker who cannot find her own match. Dumont's second foray into the turbulent, sexy, often-hilarious world of celebrity dating provides a delightful diversion.\"",
  "genres": [
    "Romance"
  ],
  "author": "Julia Dumont",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/17214444-hearts-unleashed"
}