{
  "title": "Landscapes of War: From Sarajevo to Chechnya",
  "description": "Landscapes of From Sarajevo to Chechnya is an incisive examination of the tensions that exist between the West and Islamic societies of Europe, North Africa and the Middle East. These essays, originating in Goytisolo's travels in the late 1990s, provide rich historical analysis and moving first-person reportage of life in four explosive Sarajevo, Algeria, the West Bank and Gaza, and Chechnya. From the 17th century to the Gulf War, the West has regarded Islam as the enemy on the doorstep, and this book elucidates how relations between Islam and the West continue to be shaped in a climate of ideological, political and cultural confrontation. Goytisolo examines the fratricidal frenzy in Algeria and the war waged by French police against North African migrants in France, and he describes a besieged Sarajevo transformed into a concentration camp surrounded by barbed wire. He contemplates the despair and poverty of Palestinian youth living in the Occupied Territories and details the brutality of the Russian war in the Caucasus. Whether reporting on the fate of the Bosnians after the break up of the former Yugoslavia or analyzing the growing appeal of fundamentalisms—Islamic, Jewish and Russian Orthodox—Goytisolo displays the same blend of intelligence, vision, and warm fellow-feeling that has made him one the most imposing literary figures of our time. Many of these succinct and eloquent essays first appeared in Spain's leading newspaper El Pais , and English translations were published in the Times Literary Supplement (London). Juan Goytisolo was born in Barcelona in 1931. In 1993 he was awarded the Nelly Sachs Prize for his literary achievement and contribution to world culture. His translated works include a two volume autobiography, Forbidden Territory and Realms of Strife ; the trilogy Marks of Identity, Count Julian and Juan the Landless; and the essays, Saracen Chronicles . Other works by him and published by City Lights Publishers include The Marx Family Saga , published in 1999, and A Cock-Eyed Comedy , published in 2005. Peter Bush is Director of the British Center for Literary Translation and translated Juan Goytisolo's The Marx Family Saga , which was awarded the Premio Valle-Inclan.",
  "genres": [
    "History",
    "Russia"
  ],
  "author": "Juan Goytisolo",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/172153.Landscapes_of_War"
}