{
  "title": "Письма к Андрею",
  "description": "Эта книга - попытка ответить на вопросы об искусстве человеку, искусство любящему. Человеку, переживающему и способному к сопереживанию. Человеку, способному затрачивать своё время и силы на любовь к музыке, кино и литературе, несмотря на собственную непростую жизнь. С большим желанием помочь и поддержать в любви к искусству и в любви к жизни.\"То, что вы прочтете далее - это… А что это? Это точно не теоретические статьи. В этих письмах нет и намёка на теорию. Это не манифест и даже близко не манифест. Набор ли это эмоциональных банальностей? Возможно! Эмоций и банальностей в этих письмах хватает. Но мне хочется верить, что Андрею Тарковскому было бы радостно прочитать мною написанное. Для него там ничего нового нет. Где-то я почти копирую его стиль. Где-то почти повторяю им сказанное. Это я знаю. Но на некоторые поставленные им вопросы я все же даю ответы. Удовлетворили бы они его или нет - не знаю.Сомневаюсь.Я о другой радости...Лично я был бы рад получить письмо с попытками ответить на поставленные мною вопросы. Я написал то, чем хотел бы поддержать человека, живущего искусством! Почему? А потому что он, Андрей, сам поддерживал и поддерживает меня в моей к искусству любви. Он своей жизнью, своими картинами, своими текстами, своими высказываниями, поступками и даже снятыми им полароидными снимками помог и помогает мне удержаться от соблазнов и безумия. Он позволяет мне ощущать призвание читать, видеть, слышать и чувствовать произведения искусства, создавать искусство как важнейшую человеческую способность и важнейшее переживание. Кто-то может обидеться на мною написанное, и даже наверняка обидится. Этого я хотел меньше всего, когда писал свои письма.Кто-то откажет мне в праве так и писать и так рассуждать... Что ж?! Имеет полное право! Я же писал о любви. Прежде всего о любви к жизни... А потом уже об искусстве.Кому я написал? Андрею Тарковскому? Андрею Рублеву? Художнику? Зрителю? Читателю?... Не скажу. Не знаю. Я написал письма, которые не ведаю кому и как попадут в руки и на глаза. Не знаю, как и в ком они отзовутся и отзовутся ли вообще.Но я написал их в надежде поддержать того, кто любит... Любит читать или писать, смотреть или снимать, исполнять или слушать... Любит искусство, любит жизнь, и кому нужна поддержка в этой любви. Мне лично поддержка нужна... Вот я и написал... Андрею\".Евгений Гришковец",
  "genres": [
    "Art"
  ],
  "author": "Yevgeni Grishkovetz",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/17216773"
}