{
  "title": "Freshman Focus: Carter G. Woodson High School",
  "description": "Welcome Class of 2006 to your freshman year!Freshman FocusBook SummaryThe first bell has just rung to start the freshman year for Kendra Hayes, Lamar Adams, Destiny Jameson, and Steven Phillips. The four of them share feelings of excitement and uncertainty, but they walk the hallways of Carter G. Woodson High School with a different focus, or perspective, in mind.An excellent student, Kendra is focused on making good grades in high school. She is also determined to make a name for herself at Woodson and not be known as Malcolm Hayes' little sister. Her classes, the basketball team, and other activities will keep Kendra busy. Soon after Kendra starts school, she is invited for membership in a high school sorority. Kendra's invitation alters her perceptions of others and herself.Lamar's focus is to make the basketball team and have as much fun as possible in high school. He also wouldn't mind meeting as many girls as he can. After all, he knew that girls want to have fun too. At home, Lamar's goal is to get his mother to honor her promise to him. Standing up to his mother challenges Lamar as well as his relationship with her and his stepfather, but Lamar is determined to regain what he lost.Destiny is focused on maintaining her superiority over everyone around her. Rich and beautiful, Destiny is perfect and is determined to make sure everyone believes that. Isolated in her perfect world, Destiny is all alone until she meets a popular senior who invites her to join her sorority. Destiny is excited to be asked and looks forward to kicking up her superiority a notch. But Destiny's condescending attitude might jeopardize her membership in the sorority.New to Charlotte, Steven is focused on shaking off his past. His parents' life of crime stripped Steven and his brothers of having a childhood. Lessons surround Steven at school and at home, but he is committed to making his new beginnings with his foster parents a happy ending. As a member of the JV football team, Steven has another outlet to direct his energy.Freshman year is tough, but these four are intent on finding their way as they navigate the hallways, demands from teachers, tests, extra curricular activities, friendships, and parents. They have to navigate their journey all while maintaining their focus on what's important to them.",
  "genres": [],
  "author": "Carla R. Sarratt",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/1075893.Freshman_Focus"
}