{
  "title": "Falling Into Paradise",
  "description": "A woman too afraid to commit. A man too hurt to love again. A passion that refuses to be denied. Sophie Redmond knew betrayal, she knew mistrust. She knew everything that was wrong with the world, until Damon Watson charmed his way into her life. The rules she used to shield her heart were broken one by one, as Damon showed her compassion and kindness. When no one else believes in her, he shows her hope. But is hope ever enough?Damon knew trouble when he saw it. He was the sheriff. He could spot it a mile away and Sophie was trouble with a capital T. What was it about this City Slicker doctor that made him want to forget everything but those whiskey brown eyes and that honey blonde hair spilled against his naked chest. Can Damon put the past behind him and choose to love again? Reader Alert!: Sophie thought sex was a game that could be controlled with rules, but add a playboy who knew every trick in the book, and she couldn't help but throw her rule book away. Caution! Sophie and Damon tend to sizzle on the page as much as they do in bed, so take care to stock up on the ice! \nTo My Readers: This has been a very emotional story to write. It started out as being a story about Sophie and her journey into discovering herself but I wanted to dig deeper and ask what if she never had the love of her mother? My mum is half way across the world and when I am sad I miss her terribly. The interesting thing is we never got on growing up, because I was daddy's girl but now she's my mum. It's amazing how you appreciate your parents after you become one. So I thought about Sophie's journey and gave her many tests along the way. But it is Damon who is that sexy alpha hero that makes it all possible. I like a sexy alpha hero. I believe we all need them in our lives.",
  "genres": [
    "Contemporary",
    "Romance"
  ],
  "author": "Kamy Chetty",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/17221087-falling-into-paradise"
}