{
  "title": "The Writer as Migrant",
  "description": "As a teenager during China's Cultural Revolution, Ha Jin served as an uneducated soldier in the People's Liberation Army. Thirty years later, a resident of the United States, he won the National Book Award for his novel \"Waiting,\" completing a trajectory that has established him as one of the most admired exemplars of world literature.  Ha Jin's journey raises rich and fascinating questions about language, migration, and the place of literature in a rapidly globalizing world-questions that take center stage in \"The Writer as Migrant,\" his first work of nonfiction. Consisting of three interconnected essays, this book sets Ha Jin's own work and life alongside those of other literary exiles, creating a conversation across cultures and between eras. He employs the cases of Alexander Solzhenitsyn and Chinese novelist Lin Yutang to illustrate the obligation a writer feels to the land of his birth, while Joseph Conrad and Vladimir Nabokov-who, like Ha Jin, adopted English for their writing-are enlisted to explore a migrant author's conscious choice of a literary language. A final essay draws on V. S. Naipaul and Milan Kundera to consider the ways in which our era of perpetual change forces a migrant writer to reconceptualize the very idea of home. Throughout, Jin brings other celebrated writers into the conversation as well, including W. G. Sebald, C. P. Cavafy, and Salman Rushdie-refracting and refining the very idea of a literature of migration. Simultaneously a reflection on a crucial theme and a fascinating glimpse at the writers who compose Ha Jin's mental library, \"The Writer as Migrant\" is a work of passionately engaged criticism, one rooted in departures but feeling like a new arrival.",
  "genres": [
    "Nonfiction",
    "China",
    "Writing",
    "Essays",
    "Memoir",
    "Literary Criticism",
    "Biography"
  ],
  "author": "Ha Jin",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/17224166-the-writer-as-migrant"
}