{
  "title": "American Indian Ethnic Renewal: Red Power and the Resurgence of Identity and Culture",
  "description": "Does activism matter? This book answers with a clear \"yes.\" American Indian Ethnic Renewal traces the growth of the American Indian population over the past forty years, when the number of Native Americans grew from fewer than one-half million in 1950 to nearly 2 million in 1990. This quadrupling of the American Indian population cannot be explained by rising birth rates, declining death rates, or immigration. Instead, the growth in the number of American Indians is the result of an increased willingness of Americans to identify themselves as Indians. What is driving this increased ethnic identification? In American Indian Ethnic Renewal , Joane Nagel identifies several historical forces which have converged to create an urban Indian population base, a reservation and urban Indian organizational infrastructure, and a broad cultural climate of ethnic pride and militancy. Central among these forces was federal Indian \"Termination\" policy which, ironically, was designed to assimilateand de-tribalize Native America. Reactions against Termination were nurtured by the Civil Rights era atmosphere of ethnic pride to become a central focus of the native rights activist movement known as \"Red Power.\" This resurgence of American Indian ethnic pride inspired increased Indian ethnic identification, launched a renaissance in American Indian culture, language, art, and spirituality, and eventually contributed to the replacement of Termination with new federal policies affirming tribal Self- Determination. American Indian Ethnic Renewal offers a general theory of ethnic resurgence which stresses both structure and agency--the role of politics and the importance of collective and individual action--in understanding how ethnic groups revitalize and reinvent themselves. Scholars and students of American Indians, social movements and activism, and recent United States history, as well as the general reader interested in Native American life, will all find this an engaging andinformative work.",
  "genres": [
    "History",
    "Native American",
    "American History",
    "Nonfiction",
    "Native American History",
    "Cultural Studies",
    "Cultural"
  ],
  "author": "Joane Nagel",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/1075926.American_Indian_Ethnic_Renewal"
}