{
  "title": "Intellectual Property",
  "description": "Ownership of intellectual property is paramount in today’s technology-driven markets and leaving your business unprotected can be perilous—and expensive. In a monumental verdict, a jury recently awarded Apple $1.05 billion dollars in damages, determining that Samsung copied the technology used on the iPhone and iPad. Christian Louboutin did not make out as well in its case against Yves St. Laurent. Despite having applied for a trademark for their brand-defining red-soled shoes, the court found that Louboutin could not impede the creativity of other designers and granted Yves St. Laurent the right to copy the well-known fashion statement. From smart phones to high heels, song lyrics to Spider-Man, possessing copyrights, patents and trademarks is the first line of self-defense, as well as highly lucrative. In INTELLECTUAL PROPERTY: Money and Power in a New Era (Thomson Reuters, September 2012) attorney Alexandre Montagu explores the pitfalls of being caught unaware of Intellectual Property law. Montagu’s clients include Fortune 500 companies and his practice encompasses a broad variety of industries such as culinary, financial services, entertainment, publishing, and cosmetics. “Whether it’s the trade secrets of a hedge fund’s algorithms, the copyrights or patents underlying the smart phone, the trademarks that protect well-known brands, intellectual property bastes the modern economy,” he says. Through fascinating anecdotes and compelling court cases, Montagu brings home just how important legal literacy can be for your business—think how different social media would be if the Winklevoss brothers had a written agreement with Mark Zuckerburg.INTELLECTUAL PROPERTY fascinates with cases pulled from the evening news. Montagu provides inside access to The Da Vinci Code lawsuit when an author sued publisher Random House for stealing his previously published plot for the best-selling novel. Montagu explains why the case was dismissed, even though there are blatant similarities between the two books. Compelling stories and legal insight make this book essential for songwriters, CEOs, Web designers, inventors, restaurateurs, and anyone who’s ever signed a legal document without reading all of the fine print.",
  "genres": [
    "Business",
    "Law",
    "Entrepreneurship"
  ],
  "author": "Alexandre Montagu",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/17225193-intellectual-property"
}