{
  "title": "دراكولا",
  "description": "أخيرا النسخة الكاملة والترجمة الامينة لرواية دراكولاالنسخة تحتوي علي رواية دراكولا و رواية ضيف دراكولامنضما اليها لاول مرة في التاريخ الفصل الاول المحذوف ومقدمة المؤلف ونص النهاية الاصلية التي تم اكتشافها في ثماثنينات القرن الماضيمن ترجمة د-محمد الدواخلي و منى الدواخلياصدار دار اكتبمراجعة ايمان الدواخليغلاف محمد عيدإنه الكونت في أبهى حلة عربيةإنه ملك مصاصي الدماء الكونت دراكولا بشحمه ولحمه وأنيابه أتى بعد أكثر من مائة عام لزيارة الأدب العربي! ربما يقول البعض لماذا نترجم رواية قديمة كهذه قد تكون ترجمت من قبل؟أولا أنها ليست بالرواية العادية, كما أن القراء العرب يبحثون دوما عنها.ثانيا لأن هذه ليست مجرد ترجمة للرواية, بل حاولنا أن نجعلها - كما سيرى القارئ بإذن الله- أكمل ترجمة لرواية دراكولا على الإطلاق, ليس في اللغة العربية فحسب بل في كل لغات العالم.فهي ليست فقط ترجمة كاملة وأمينة غير مختصرة للرواية وإنما أضفنا لها إضافات مشوقة:1. المقدمة التي كتبها برام ستوكر بنفسه للرواية ولم تنشر إلا مع الترجمة الإيسلندية عام 1901 وأشار فيها إلى أن الكثير من أحداث الرواية وقائع حقيقية.2. الفصل الأول المحذوف من الرواية: بناءا على طلب الناشر حذف برام ستوكر الفصل الأول من الرواية الذي رآه الناشر غير مهم للأحداث, وتجاوز ستوكر المشكلة بذكاء بأن أشار في الفصل الرابع إلى أن الكونت استولى على كل أوراق هاركر القديمة. إلا أن أرملة برام ستوكر نشرت الفصل المحذوف في صورة قصة قصيرة تحت عنوان ضيف دراكولا في مجموعة نشرت بنفس الاسم. وقد أضفنا الفصل المحذوف في بداية الترجمة.3. النهاية الأصلية المحذوفة للرواية: عندما عثر عام 1984على المسودة النهائية الأصلية التي كتبها برام ستوكر بنفسه وجدت نهايتها مختلفة عن النسخة المطبوعة إذ حذف منها قرابة الصفحة. أضفنا ترجمة النهاية الأصلية في ملحق في نهاية الرواية.4. الرواية تحوي الكثير والكثير من الإشارات لأحداث تاريخية وأعمال أدبية قمنا بالإشارة لها في الهوامش حتى لا تبدو غامضة على القارئ.5. أضفنا ملحقا تاريخيا عن شخصية الأميرين دراكولا: فلاد الثالث ووالده فلاد الثاني في نهاية الرواية.وهكذا سعينا بإخلاص أن تكون هذه هي أبهى حلل الكونت على الإطلاق, وفي انتظار حكمكم عليها!ننتظركم في معرض الكتابهذه هي النسخة الشرعية الوحيدة من اصدار دار اكتب, توجد نسخ مزورة في بعض الدول العربية",
  "genres": [
    "Horror",
    "Fiction",
    "Fantasy",
    "Gothic",
    "Paranormal",
    "Literature",
    "Vampires"
  ],
  "author": "Bram Stoker",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/17226373"
}