{
  "title": "Scorpion Soup",
  "description": "Inspired by a book his grandfather wrote eighty years ago, master storyteller and author Tahir Shah set about creating SCORPION SOUP, an intense experience of interlinked and overlapping tales.\tHaving been raised on stories from both East and West, Shah believes that tales work on numerous levels, subtly influencing the way we see the world, and the way we learn from it. Magical instruments, and secret machineries in their own right, stories are within us all. And, the way we appreciate them, from the cradle is, Shah believes, part of the default setting of Mankind.\tIntroduced in early childhood to the wonders of A Thousand and One Nights, Shah learned to receive and appreciate complex structures and storytelling devices. These have been used throughout history to pass on ideas, cultural values and information, as well as, of course, to entertain.\tHaving been inspired by The Nights, especially in the way that one story leads into another, and yet another, Shah used this technique (known as the “frame story”) in SCORPION SOUP.\tAn interwoven and intoxicating collection of tales, the book descends down through many layers, as one story progresses into the next, and eventually brings us back to the first.\tThere is the tale of the Capilongo, a sophisticated bird-like creature that lives in the jungle with sloth-servants, who invites his would-be assassin to dine before allowing himself to be killed. And there is the tale of the Clockmaker who harnesses the soul of a Jinn, in the guise of a hoopoe, and uses it to travel back in time to the realm of Harun Al-Rachid. There is the cautionary tale, too, of the Man Whose Arms Grew Branches, and the story of the Fish’s Dream.\tUnlike anything that has been published in the Occidental world before, SCORPION SOUP is a rich and diverse feast for the senses, and a book that instructs as much as it does entertain.",
  "genres": [
    "Fiction",
    "Short Stories",
    "Mythology"
  ],
  "author": "Tahir Shah",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/17227564-scorpion-soup"
}