{
  "title": "Broken Crowns",
  "description": "Jack and Jill went up the hill... Jill Lyons' life turns upside down the day she walks into her office to find her boss sprawled across his desk with a bullet between his eyes. Jeff Siegle's past catches up to him the moment he finds out his children have been kidnapped. A riddle and a shadow from the past pull them relentlessly towards death's door as they struggle to find answers... before it's too late.A Kindle bestseller and Christian fiction mystery, Broken Crowns is the first book in the Shadows in the Nursery series. It's a Christian mystery with just a touch of Christian romance that keeps readers in suspense page after thrilling page as Jeff and Jill face the unexpected, and often harrowing, consequences of their pasts. Set in Virginia, the two find themselves traveling to London, where they discover their own histories and futures are intertwined with London Tower's own ancient legends.While living in Ireland as a missionary with her husband, author Tamara Shoemaker visited and researched the history of London's Tower. With elements of historical fiction, Broken Crowns weaves threads of the Tower's history and the associated nursery rhyme into a contemporary thriller.About the Shadows in the Nursery This mystery and suspense thriller series invokes our favorite childhood nursery rhymes. Characters, haunted by their pasts, seek to solve riddles based on nursery rhymes, in order to redeem their futures. These novels present characters who struggle with issues of faith, romance, and the consequences of their choices. Tamara places her characters in dark, but real-life situations that threaten their faith and their lives. Themes focus on the occult, human trafficking, and other realities of the human condition.",
  "genres": [
    "Mystery",
    "Fiction",
    "Christian",
    "Christian Fiction"
  ],
  "author": "Tamara Shoemaker",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/17227686-broken-crowns"
}