{
  "title": "Swallows & Robins - The Guests In My Garden",
  "description": "A hilarious tale of restoring and running two holiday cottages in a remote hamlet of SW France As the world's worst housekeeper, running holiday homes wasn't, with hindsight, a sensible idea. But two collapsing buildings on Susie Kelly's land would cost more to demolish than to restore. Thus she became a seasonal landlady. Before the guests came the builders. No's 1, 2, 3 all started promisingly, but by builder No. 4, and with her first guests just hours away, her patience was stretched to its limit. Her summer and winter visitors couldn't, as they say, be made up, though, to spare their blushes some of them have been air-brushed. They brought with them laughter, tears, romance, friendship and occasional madness. And they all left behind jars of jam and pots of pepper. From them Susie learned that you don't need to travel to find adventure. If you run holiday homes it comes to your doorstep. Unfortunately for Susie this included Ivy. The cleaning lady from hell. Like her other bestselling books – Best Foot Forward: A 500 Mile Walk Through Hidden France, The Valley of Heaven and Hell: Cycling In The Shadow of Marie Antoinette and Travels with Tinkerbelle - 6,000 Miles Around France In A Mechanical Wreck, Susie's unique, opinionated but self-depreciating humour shines through on every page. 'This is another Susie Kelly great read that often had me laughing out loud as we meet the various builders, her local friends, the good guests and the bad who popped into her life over a four year period. Anyone who has any experience of running gites in France will love this book and anyone who is thinking about having gites in France should read this book.' French Village Diaries 'Its absolutely brilliant, it made me laugh - in fact snort out loud - and then cry when her dog died. Susie is a marvellous writer.' The Good Life France Magazine",
  "genres": [
    "Nonfiction",
    "Humor",
    "France",
    "Romance",
    "Memoir",
    "Womens"
  ],
  "author": "Susie Kelly",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/17231250-swallows-robins---the-guests-in-my-garden"
}