{
  "title": "White Flag",
  "description": "Nick (a famous pop star) and Layla met and fell in love when they were both young and stupid, and fell into the superficial trappings of fame and wealth. They soon discovered that they brought out the best and the worst in each other, and their marriage - a secret to even their own families - suffered as a result.\"The Romance of Nick and Layla\" is a series of six novellas that tells the story of a couple's dysfunctional relationship over the course of ten years.Available in the Nick and Layla \"Walk Away\" (Part 1)\"Sorry\" (Part 2)\"White Flag\" (Part 3)\"Damaged\" (Part 4)\"Undone\" (Part 5) - coming Fall 2013Part 6 coming soonWHITE Nick Hudson and Layla Garrett are in unfamiliar territory. Divorced. Expecting. Living under one roof. While Nick's career has taken a backseat to his impending responsibilities as a father, Layla's professional life is just starting, and she's found a life for herself she can finally enjoy. The connection between them is as potent as ever, but sometimes people just aren't meant to be, no matter how much they used to love each other.Cut to 14 months later. Nick is back on the road devoted as ever to music. Layla is a single mom trying to build her own career. Neither one is speaking to the other. Just when their lives seem to be settling into something familiar, Nick does something that brings him back into Layla's life in the most intrusive way possible. Can these two finally get things right now that there's a third person in the picture? How will these two unstable lovers manage the ups and downs of parenthood while also trying to figure out what they mean to each other, once and for all?Previously, in \"Sorry, The Romance of Nick and Layla (Part 2)\":Four months after their bitter fall-out, Nick and Layla are on the brink of divorce. He wants to start anew, but she's keeping a secret that could change the very shape of their relationship for good. Still, their emotional manipulations are the only way they know how to communicate, even when it seems there is little left to save of their tumultuous marriage.",
  "genres": [
    "Divorce",
    "Romance"
  ],
  "author": "Crystal Cierlak",
  "average_rating": "3.31",
  "url": "https://www.goodreads.com/book/show/17234162-white-flag"
}