{
  "title": "Historical and Theological Foundations of Law: Ancient Wisdom",
  "description": "The Law! What is it, and where does it get its authority? Because someone with a crown and scepter has commanded it? Because a council has adopted it? Because a judge has upheld it? Or is law “law” because a Higher Authority has ordained it so? The Laws of Nature? And of Nature’s God? Do “echoes of Eden” remain, faintly reminding us of an Original Plan? What is the Common Law? When did it begin? Is it relevant or binding today? And what of the Laws of the ancient Hebrews—an irrelevant footnote, or the cornerstone of all true Law? With unparalleled scope and minute detail, Historical &Theological Foundations of Law studies the legal systems of ancient societies all across the earth, explores their common threads and differences, and traces their development through history, and notes common trends that should cause hope or alarm today.Embark with us on a journey to discover the earliest origins of Law. Volume I - Ancient WisdomIn Book One, The Foundation, we explore the laws of ancient civilizations: Egyptian stability, Babylon precision, Persian enlightenment, Indian philosophy, Chinese Taoism/Buddhism/Confucianism, Polynesian kapu, Incan absolutism and efficiency, Mayan oligarchy, Aztec judicial independence, Cheyenne volunteerism, and the Iroquois Confederacy’s sage balancing of power. What trends do we see? Polytheism to monotheism, or monotheism to polytheism? Decentralization, or centralization of power? Fewer laws, or more laws? Gentleness, or brutality? In Book Two, The Cornerstone, we focus upon a unique people who, many believe, have influenced the world more than any other. In a canon of thirty-nine books, the Hebrews have given us the Tanakh (Old Testament). How did the Hebrew constitution function, and upon what precepts was it based? How did the Hebrew laws and institutions change over the centuries? Are the Ten Commandments truly the foundation of Western Law?",
  "genres": [
    "Law",
    "History",
    "Theology",
    "Nonfiction"
  ],
  "author": "John Eidsmoe",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/17234345-historical-and-theological-foundations-of-law"
}