{
  "title": "The Mystic Princesses and the Whirlpool",
  "description": "This edition is out of print and the ebook is no longer on sale. A second edition will be available approximately May 31, 2014.Judge, Writer's Digest, 21st Annual Self-Published Book Awards\"...Unique...believable...clever...\"5 STAR Review by Kelly Santana for Readers' Favoritehttp://readersfavorite.com/book-revie...The Mystic Princesses and the Whirlpool, by P. J. LaRue, is a tale of four princesses, gifted with elemental powers (air, water, earth and fire). They have the task of protecting the Princess of Peace (Princess Harmonie). In this adventure, the God of War, Ares, sends his five children to capture Princess Harmonie. In an attempt to protect his sister, Eros sends Princess Harmonie to a kingdom in the island of Hawaii where the Mystic Princesses are located. Each one of the Mystic Princesses gets permission from King Neptune and Queen Pearl to develop their skills. Princess Coral, a merson, is the water element; Princess Janna is the earth element; Princess Catie is the air element; and Princess Breanna is the fire element. Now, with a big responsibility ahead of them, they get together to work on their skills and learn important life lessons.The Mystic Princesses and the Whirlpool has a delightful plot. P. J. LaRue uses mythological characters to tell a lively story of bravery and friendship. The story of princesses with special powers, who work on their skills and learn the ropes to protect a friend and bring peace to the world, is appealing. The book teaches important lessons on strengths and weaknesses, conservation and safety. The Mystic Princesses and the Whirlpool has colorful illustrations and the characters are captivating. I liked that Ms LaRue used her travelling experiences to develop the story in different places. This is the first book in the Mystic Princesses series, and I cannot wait for the next princesses’ adventure to come. Young girls will love The Mystic Princesses adventure on their bedside table.Author's Book Summary:Princess Harmonie, the daughter of Aphrodite, makes people feel peaceful. Her life in New York is disrupted when the war-god, Ares, demands that his five warrior children capture her so they can fight and cause wars. Princess Harmonie must give up all that she loves, including her beloved brother, Eros, move to Hawaii, and live with her new protectors, whom she doesn’t even know. Together, the five girls are The Mystic Princesses, and they learn they have inherited powers from their mythological parents. Along the way, The Mystic Princesses learn life-lessons in personal safety, trust, keeping secrets that could cause harm and stopping bullies. But will the princesses learn how to use their powers in time to protect Princess Harmonie from the Children of Ares, when their hiding place is discovered?",
  "genres": [
    "Childrens",
    "Fantasy",
    "Adventure"
  ],
  "author": "P.J. LaRue",
  "average_rating": "4.47",
  "url": "https://www.goodreads.com/book/show/17235412-the-mystic-princesses-and-the-whirlpool"
}