{
  "title": "The Glad Man",
  "description": "Melissa feels pretty average. She's not a great student, and she tends to be a bit sloppy. To make matters worse, her seven-year-old brother Troy is nearly perfect--studious, methodical, and neat. Melissa has big dreams, though. She plays baseball every day after school, and she is determined to be the first girl to make the school team. One day, Melissa is certain, she is going to play for the St. Louis Cardinals! Nothing seems more important than baseball, until a chance trip to the city dump turns Melissa's life, and her priorities, upside-down.Melissa and Troy's father usually spends his Saturday mornings collecting scrap metal at the dump. One morning, his helper can't join him, so he puts the kids to work for the day. Easily bored, Troy wanders off and makes an amazing discovery. There, in amongst the mountains of refuse, is an old bus. The rusted, decrepit vehicle has no tires, and its windows are boarded up. Melissa and Troy are sure the ancient bus is abandoned, until they run right smack into the old man who lives there! The children flee, fearful of the dangerous maniac they think is chasing them. The next day, however, the children sneak back to take a closer look at the crazy dump-dweller and his dog. Unfortunately, the garbage mountain they climbed collapses, pitching Troy to the ground. The old man, Eddie Bebberidge, saves Melissa just before she falls, too, and he carries Troy back to the bus where the boy quickly recovers.The children learn that Mr. Bebberidge is a widower who used to run a mobile flower business. After his wife died, Mr. Bebberidge sold his home, and moved into the bus he used to sell flowers. He parked the bus on farmland, but the city dump grew up around him after the farmers sold the land to the city.As a school assignment, Melissa writes a mock letter to the editor thanking Mr. Bebberidge for his help. Unbeknownst to Melissa, her teacher, Miss Wilson, sends the letter to the real newspaper. The printing of the letter thrusts Melissa, her family, her school, and their new friend front and center in a political debate about homelessness and caring for society's elderly citizens. Now, Melissa has to put her expansive imagination to work solving a real-world problem. She soon comes up with a plan, and amasses an army of allies--including her family, her schoolmates, and even strict Miss Wilson--to help save Mr. Bebberidge's home, his freedom, and even his big, goofy black dog.",
  "genres": [],
  "author": "Gloria Gonzalez",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/10763768-the-glad-man"
}