{
  "title": "Far Out",
  "description": "Saffron's father has been grouchy since her mother died of fever after they moved to the Seaweed Slum. Life there could send anyone of the cliff edge, but Dad is all Saffron has in the world and she prays to Infinity the patrols won't catch him when he sneaks off on his secret missions. Dad was an astronautics engineer in his heyday, and his obsession with space junk gives metal fatigue a whole new meaning. That stuff is a waste of space. Dad could be doing better things with his time. Hippie Hermione scrapes by with her quack medicine and her stinky meat pies, but Saffron has ambitions. She will qualify as an herbalist and create delicious cosmetics and perfumes for the rich people in Server City. Hermione offers to coach Saffron for the exam, but Hermione's methods don't ring true. Her strawberry dreadlocks, black fingernails and pothead lifestyle are vile, and her recipes stink like rancid rats tails. Sophisticated Marianne the master herbalist is the new neighbour. Dad invites her to tea, but for Saffron the tea party is a disaster. First Marianne steals Nigel's heart and he squirms round her ankles like a pole dancer; then the woman tells her she won't pass her exam under Hermione's tuition. Saffron's father has absolutely no resistance to the woman's charms. Their cosy hearts-and-flowers club leaves Saffron out in the cold. Dad and Marianne? At their age? It's disgusting.Student Nate the astrophysicist seeks the engineer's help to rescue his space probe, snagged on a defunct satellite in the junk orbit. Unaware the servants are watching him, Nate brings trouble and the three of them have to leg it to Astro Station in Cornwall, where Saffron discovers what is running rings round her father. Curly-haired Nate makes Saffron's head spin and her stomach fizz and it's quite obvious he's starry-eyed about her. Grumpy old Dad might not approve, but he'll just have to grow up. For Infinity's sake, she's not a child anymore; she'll turn eighteen in December. When Astro Station becomes too dangerous he sends her to the slum for safety, but he won't tell her why. Instead, he's arranged for her to stay at predatory Marianne's; the last place in the universe she wants to be. Nate has dumped her. Life is as sparkly as a soggy biscuit.Titan sends a bouquet of flowers as insipid as a cup of seaweed tea. Who would send anyone dead flowers, Saffron wants to know, but she learns flowers have a language and they bring a coded message. Nate is trapped and the servants have arrested her father. Marianne and Saffron venture into the deadly city to discover what they can, but the plan goes wrong. Wandering the metropolis at night and evading the robo-guards, Saffron risks talking to Nate on his contact disc. He is thin and exhausted. She asks about her father, but Nate says he is on the machines and he can't tell her any more. If Saffron wants to see Nate and her father alive again, first she must survive the dangers of the city and find them.",
  "genres": [],
  "author": "Fiona Faith Ross",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/17235156-far-out"
}