{
  "title": "The Guy Your Friends Warned You About",
  "description": "The Consortium of Chaos: The super-villain organization semi-unwillingly thrust into the field of heroics. They’re not nice people, but now they do nice things. …Occasionally. If it’s during office hours and there’s nothing good on TV, anyway.Librarian: Marian Willson, AKA “the Librarian,” takes super villainy seriously. Whether it’s memorizing the internet or knowing just which chemicals to mix to make a teargas bomb, Marian is an encyclopedia of criminal schemes. She also knows eight thousand recipes for pie, even if she’s never taken the time have a slice. Doctor, lawyers, weapons expert… Marian can do it all and she doesn’t tolerate failure. Yep, she’s just the person you want on your team the next time you’re being targeted by dozens of trained killers. Which seems to happen to Cynic. A lot. Aside from the fact he isn’t too unpleasant to look at, it’s hard to imagine why she bothers to keep saving him.Cynic: Steven O’Probrian AKA “The Cynic,” takes nothing seriously, except pushing all Marian’s buttons. He’s been fantasizing about her cool blue eyes and awesome martial arts skills for years. Unfortunately, Cynic is the most annoying person in the world. Ask anyone. Being a jerk is his only hobby. He makes a habit of saying the wrong thing and doing the wrong thing and killing the wrong thing. And now a whole lot of crazed assassins are trying to kill him. Given his superpowers, Cynic isn’t too concerned about the whole “dying” thing, but having a price on his head sure is a good excuse to skip town with Marian. Soon, the two of them are on the road trip of his dreams, with ninjas, and casinos, and killer clowns. If he can just find a way to be less like himself, Cynic knows he can get Marian to love him back. Unfortunately, his enemies might know a way to end Cynic’s fun once and for all…",
  "genres": [
    "Paranormal",
    "Fantasy",
    "Superheroes",
    "Romance",
    "Adult"
  ],
  "author": "Elizabeth Gannon",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/17235223-the-guy-your-friends-warned-you-about"
}