{
  "title": "Drop Dead Sexy",
  "description": "For Olivia Sullivan, love is more a four letter curse word than a sentiment. Growing up as the daughter of a small town mortician, guys didn’t warm to the fact there were dead people in her house. At thirty, taking over the family business and becoming the town Coroner helped to cement her undateable status. Of course her past sex history didn’t help matters either.Attempt number one with her first love ended barely before it got started with a horrific latex allergy hospitalization. Attempt number two had him coming and then going with an undiagnosed heart condition. For the past three years, Olivia has closed up shop for fear of what might happen next in the bedroom.After being forced to go single to her mother’s lingerie shower, Olivia stumbles into an out of town bar with one intention: find an able bodied stud to go home with to end her losing sex streak. Enter Holden Caulfield Mains aka Catcher, who earned his nickname not just from the book he was named for, but for the fact he was sure to catch the attention any woman who came within a five mile radius. Waking up after a night of the most mind blowing sex she could have ever imagined, a horrified Olivia runs away thinking she’s left Catcher behind.When Olivia’s small town is wracked by its first murder, she never could have imagined her one night stand would reappear in the form of the GBI’s lead investigator. To her mortification, Catcher isn’t ready to let go of their sizzling chemistry, and he doesn’t understand the meaning of no. As things start to heat up between them, the body count starts to rise, and they’re led on a wild goose chase from back woods mountain Nudist Colonies to altercations with the Dixie Mafia. Can Olivia and Catcher survive to solve the murder while also not succumbing to their explosive passion?",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Humor",
    "Contemporary",
    "Mystery",
    "Chick Lit",
    "Suspense"
  ],
  "author": "Katie Ashley",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/17236244-drop-dead-sexy"
}