{
  "title": "La reina descalza",
  "description": "En la España del siglo XVIII, una conmovedora historia de amistad, pasión y venganza une dos voces de mujer en un canto desgarrado por la libertad.«Canta hasta que la boca te sepa a sangre…»  En enero de 1748, una mujer negra deambula por las calles de Sevilla. Atrás ha dejado un pasado esclavo en la lejana Cuba, el hijo al que nunca volverá a ver y un largo viaje en barco hasta las costas españolas. Caridad ya no tiene un amo que le dé órdenes, pero tampoco un lugar donde cobijarse cuando se cruza en su camino Milagros Carmona, una joven gitana de Triana por cuyas venas corre la sangre de la rebeldía y el arte de los de su raza. Las dos mujeres se convierten en inseparables y, entre zarabandas y fandangos, la gitana confiesa a su nueva amiga su amor por el apuesto y arrogante Pedro García, de quien la separan antiguos odios entre ambas familias. Por su parte, Caridad se esfuerza por acallar el sentimiento que está naciendo en su corazón hacia Melchor Vega, el abuelo de Milagros, un hombre desafiante, bribón y seductor aunque también firme defensor del honor y la lealtad para con los suyos. Pero cuando un mandato real convierte a todos los gitanos en proscritos, la vida de Milagros y Caridad da un trágico vuelco. Aunque sus caminos se separan, el destino volverá a unirlas en un Madrid donde confluyen contrabandistas y cómicos, nobles y villanos; un Madrid que se rinde a la pasión que emana de las voces y bailes de esa raza de príncipes descalzos. Ildefonso Falcones nos propone un viaje a una época apasionante, teñida por los prejuicios y la intolerancia. Desde Sevilla hasta Madrid, desde el tumultuoso bullicio de la gitanería hasta los teatros señoriales de la capital, los lectores disfrutarán de un fresco histórico poblado por personajes que viven, aman, sufren y pelean por lo que creen justo. Fiel reflejo de unos hombres y mujeres que no agacharon la cabeza y que alzaron la voz para enfrentarse al orden establecido.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Spain",
    "Historical",
    "Spanish Literature",
    "18th Century",
    "Literature"
  ],
  "author": "Ildefonso Falcones",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/17237141-la-reina-descalza"
}