{
  "title": "The Hired Man",
  "description": "The new novel from the winner of the Commonwealth Writer’s Prize, The Hired Man is a taut, powerful novel of a small town and its dark wartime secrets, unwittingly brought into the light by a family of outsiders.Aminatta Forna has established herself as one of our most perceptive and uncompromising chroniclers of war and the way it reverberates, sometimes imperceptibly, in the daily lives of those touched by it. With The Hired Man, she has delivered a tale of a Croatian village after the War of Independence, and a family of newcomers who expose its secrets.Duro is off on a morning’s hunt when he sees something one rarely does in Gost: a strange car. Later that day, he overhears its occupants, a British woman, Laura, and her two children, who have taken up residence in a house Duro knows well. He offers his assistance getting their water working again, and soon he is at the house every day, helping get it ready as their summer cottage, and serving as Laura’s trusted confidant.But the other residents of Gost are not as pleased to have the interlopers, and as Duro and Laura’s daughter Grace uncover and begin to restore a mosaic in the front that has been plastered over, Duro must be increasingly creative to shield the family from the town’s hostility, and his own past with the house’s former occupants. As the inhabitants of Gost go about their days, working, striving to better themselves and their town, and arguing, the town’s volatile truths whisper ever louder.A masterpiece of storytelling haunted by lost love and a restrained menace, this novel recalls Disgrace by J.M. Coetzee and Anil’s Ghost by Michael Ondaatje. The Hired Man confirms Aminatta Forna as one of our most important writers.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "War",
    "Literary Fiction",
    "Book Club",
    "Contemporary",
    "Historical"
  ],
  "author": "Aminatta Forna",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/17237713-the-hired-man"
}