{
  "title": "Always Been You",
  "description": "The best way to ruin a perfectly wonderful friendship? Have sex with your BFF.A mistake.That’s what Troy calls what was easily the single best sexual experience of my life. He claims our \"slip\" was due to too much alcohol. I respond the only way I know how, which is by burying the entire experience under a six-foot mound of denial and regret. Lesson learned.When I’m finally in a place emotionally where I can move on with someone else, Troy does a complete about face. Now he wants me. And he wants more.That should have been the end, right? I’m getting what I’ve wanted since I was sixteen. But devastating news turns Troy’s life upside down and soon becomes my cross to bear. And the only way I can get back everything I lost is to bare it all. Literally.Now my boyfriend may be a progressive, twenty-first century kind of guy, but when it comes to his girlfriend posing nude for Playboy?He's 100% Neanderthal.---------------Sneak Peek!Unedited Excerpt from ALWAYS BEEN YOUPROLOGUE[The night that changed everything]I’m probably a little tipsy but Troy must be drunk. He doesn’t look drunk. But then he’s one of those sober-looking drunks. You know the type whose heavy-lidded eyes and panty-dampening smile may be the only things that hint at his true condition.But you want to know the real reason I know he’s drunk? I’ve known Troy for over seventeen years—so since we were toddlers. He’s the best friend I’ve ever had and probably the best one I’ll ever have. We’ve seen each other at our worst and stood by each other through the good and bad times. Snort. We’re a regular Hallmark card. However, never in all those seventeen years has he ever squeezed my ass. His hand is doing a good job of it right now.It's about damn time.",
  "genres": [
    "Romance",
    "New Adult",
    "Friends To Lovers",
    "College",
    "Contemporary",
    "Contemporary Romance"
  ],
  "author": "Beverley Kendall",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/17238483-always-been-you"
}