{
  "title": "Tropical Heat Series Box Set",
  "description": "USA Today Bestselling Author Sophia Knightly delivers two fun, sexy and heartwarming romances of her Tropical Heat Series in one bundled volume. In Wild for You (Book One), Detective Clay Blackthorne has his hands full when he promises to safeguard an old college pal's sister without letting her know what he's up to. He never imagines that lively Marisol Calderon will knock his socks off and put a ring on his finger--and all at his suggestion! Their marriage of convenience is meant to protect her and Clay doesn't plan on being hitched for long to the tempting beauty. But the honeymoon sure feels real to him...Sassy Marisol is used to doing whatever she wants--and right now her plan is to shake up the hot detective's hard-edged demeanor. But the fun turns to danger when a mystery stalker bent on marrying her marks her as his prey. Temporarily becoming Clay's wife seems like a practical way to thwart the stalker. But as passion ignites and Marisol falls for the tender heart buried beneath the tough detective's chest, Clay's true identity is revealed and she begins to wonder who--if anyone--she can trust...In Sold on You, (Book Two) Confirmed bachelor Dr. Marcos Calderon is in hot water. He needs to come up with a fake fiancée fast or he'll disappoint his beloved grandma who's arriving on the next flight to meet her. Proper social worker Gabriela Morales should fit the bill--but tonight, in that sexy, slit-to-there red evening gown, she looks anything but proper. Gabriela only volunteered for the hospital's charity bachelorette auction to benefit a cause dear to her heart. Now she's reeling from the hot doctor's bid of fifteen thousand dollars for a weekend date with her! She's not sure what Dr. Handsome has in mind, but the smoldering look in his eyes is unmistakable...",
  "genres": [
    "Romance",
    "Contemporary"
  ],
  "author": "Sophia Knightly",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/17238645-tropical-heat-series-box-set"
}