{
  "title": "3 Gates of the Dead",
  "description": "Sometimes, the most evil things come from the most holy… Conflicted with his faith in God and the hypocrisy of the church, Aidan Schaeffer, a young assistant pastor, is in a constant state of spiritual turmoil. When Aidan learns that his ex-fiancée is the first victim in a string of ritualistic killings, he finds himself in the middle of an even deeper fight. Tormented by demonic threats and haunted by spirits, Aidan throws himself into investigating Amanda’s death; all the while supernatural forces have begun to attack the people around him. The more questions he asks, the more he is drawn into the world of a mysterious Anglican priest, a paranormal investigation group and a rogue female detective investigating the murders. As the gruesome rituals escalate, ancient hidden secrets and an evil long buried threaten to rip Aidan’s world apart.Reviews: \"Ryan's first novel skillfully blends theology, murder mystery, horror, and paranormal investigation through one man's struggle with his belief in God. Solid characterization and a grounding in his subject matter make this series opener a real attraction for fans of The Exorcist and the darker fiction of C.S. Lewis and Charles Williams.\" - Library Journal (starred review)“Very well written…3 Gates of the Dead is like a Harry Potter novel for adults.”-Sam Alexander, Dir. of Development, The Wolper Organization at Warner Bros. (Bates Motel, Mists of Avalon) \"I cannot recall the last time I was so enthralled by a book that I was unable to walk away to even do the most normal things - like eat. However, that is exactly the impact 3 Gates of the Dead had on me. I became so caught up in the original story (which is refreshingly filled with lifelike characters), that time just vanished. This is a MUST READ for all horror fans, and anyone seeking out an original and creepy tale. Even if you are not a \"reader,\" this book is so well-written it doesn't feel like you are reading, just that you are a fly on the wall watching the tale unfold. I cannot wait to see what Jonathan Ryan writes next; I will be first in line to read it! 3 Gates of the Dead will make one hell of a film!”-Jessica Cameron, Scream Queen (Truth or Dare, Silent Night, The Black Dahlia Haunting, TLC’s Brides of Beverly Hills) “A roller coaster ride of a horror story – the suspense keeps building and you know when you hit the other side you are going to come out screaming. This book falls in with the tradition of the Exorcist and Stephen King’s supernatural thrillers. There is a quality to the story that reminds me of Poe’s short stories at their best with their unforeseen macabre twists.”-Tracy Riva, Midwest Book Review “3 Gates of the Dead brought me to that place of intellectual terror that only results in pure joy over a book that so immediately transports one to other realms of the deeply macabre, in a primordial, Lovecraftian scope…and send shivers down our necks.”-Scotty Roberts, Publisher, Intrepid Magazine; former Editor-In-Chief of TAPS ParaMagazine, the official publication of SyFy's Ghost Hunters",
  "genres": [
    "Horror",
    "Paranormal",
    "Mystery",
    "Thriller",
    "Supernatural",
    "Fiction",
    "Detective"
  ],
  "author": "Jonathan Ryan",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/17239328-3-gates-of-the-dead"
}