{
  "title": "Queen of the Magnetland",
  "description": "Elementals: Water, Earth, Fire and Air are only the beginning. Elementals support everything from Darkness to Time, secretly maintaining the processes of nature. Only now the Elementals are nearly extinct. Two years ago, the Air House released a plague that killed ninety percent of them. With their society in chaos and so many of their kind dead, they can’t find their Phase-Matches; the other halves of themselves. Without Matches they can’t have any more children and, without the Elementals, the world will end. Again.Chason: Since the plague killed his Match, Chason, of the Magnet House has been going crazy. He hears music that isn’t there. His mind wanders off into madness. He no longer trusts anything he sees. Once he was the honorable and principled king of a thriving land. Now all he wants to do is follow Mara into the darkness, leaving his grief and pain behind. Unfortunately, he can’t give up on life until he finishes his final mission. Someone has stolen Mara right out of her crypt and Chason won’t rest until he finds her body. When he finally locates her, though, he knows he’s finally lost his mind. Because Mara now seems kinda… alive.Mara: Mara, Queen of the Magnet House has woken up in hell. The last things she remembers is a Time Phase appearing in her room and telling her that she’s needed in the future. When she opens her eyes, two years have passed and her entire life is in shambles. Mara’s kingdom is deserted. Everybody thinks she’s dead. And Chason is a grim specter of his former self. The old Chason won Elemental of the Year for three consecutive decades. This Chason looks at her with deep hunger and has a new wildness that sets her body alight. Mara knows that she’s been given a second chance at life and she’s determined to seize it. But, in order to have a future, she needs to pull Chason out of the past… and discover the truth about who really brought her back.",
  "genres": [
    "Fantasy",
    "Romance",
    "Paranormal",
    "Fantasy Romance",
    "Second Chance",
    "Paranormal Romance",
    "Contemporary"
  ],
  "author": "Cassandra Gannon",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/17240339-queen-of-the-magnetland"
}