{
  "title": "L'isola dell'amore proibito",
  "description": "L'acqua cristallina lambisce dolcemente i suoi piedi nudi. Anna apre gli occhi all'improvviso e davanti le si apre la distesa sconfinata di un mare dalle mille sfumature, dal turchese allo smeraldo più intenso. Intorno, una spiaggia di un bianco accecante, ombreggiata da palme frondose. Le dita della ragazza stringono ancora spasmodicamente la mano di T.J., disteso accanto a lei, esausto dopo averla trascinata fino alla riva. Anna non ricorda niente di quello che è successo, solo il viaggio in aereo, la superficie blu che si avvicina troppo velocemente e gli occhi impauriti di T.J., il ragazzo di sedici anni a cui dovrebbe dare ripetizioni per tutta l'estate. Un lavoro inaspettato, ma chi rifiuterebbe una vacanza retribuita alle Maldive? E poi Anna, insegnante trentenne, è partita per un disperato bisogno di fuga da una relazione che non sembra andare da nessuna parte. Ma adesso la loro vita passata non è più importante. Anna e T.J. sono naufraghi e l'isola è deserta. La priorità è quella di sopravvivere fino ai soccorsi. I giorni diventano settimane, poi mesi e infine anni. L'isola sembra un paradiso, eppure è anche piena di pericoli. I due devono imparare a lottare insieme per la vita. Ma per Anna la sfida più grande è quella di vivere accanto a un ragazzo che sta diventando un uomo. Perché quella che all'inizio era solo un'innocente amicizia, attimo dopo attimo si trasforma in un'attrazione che li lega sempre più indissolubilmente. L'isola dell'amore proibito è un fenomeno editoriale senza precedenti. Pubblicato in proprio dall'autrice, in pochissime settimane ha venduto più di 200.000 copie solo negli Stati Uniti. Il libro, ora pubblicato da una delle più importanti case editrici americane dopo un'asta milionaria, ha scalato tutte le classifiche. Una storia d'amore unica, intrisa di travolgente romanticismo e intensa come la vita, sullo sfondo del mare incontaminato dell'oceano Indiano.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Fiction",
    "Chick Lit",
    "New Adult",
    "Adult"
  ],
  "author": "Tracey Garvis Graves",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/17240664-l-isola-dell-amore-proibito"
}