{
  "title": "Into The Trenches",
  "description": "Annelyse Ortiz is a carefree young lady in her early twenties breezing through life. She's on track to achieve her goal of finishing college, she's content with her boyfriend, and she goes to church to keep her parents happy. Her carefully-constructed plans begin to shatter when she discovers that her boyfriend has been cheating on her. She does the most drastic thing she can think of: join the Army. Then one day during a deployment to Iraq, tragedy strikes. Annelyse, now a war veteran suffering from PTSD, struggles with severe bouts of depression and suicidal thoughts while she attempts to come to grips with the death of a loved one. How can the statement \"God is good all the time\" be true even during such dire circumstances? Join Annelyse in this journey of spiritual healing. Being a believer in Christ does not promise us a life without struggle or pain. In fact, Jesus himself says in John 16:33 that we will have tribulation in this world. He did not say we might, He said that we will. Nevertheless, our protagonist feels abandoned by God when a loved one dies during battle, and worst of all, she knows she's to blame for his demise. Her crippling despair is too much for her to bear and it leads her onto a road of self-destruction where thoughts of suicide seem like sweet surrender as opposed to facing another sleepless round of night terrors. Annelyse can't forgive herself and cannot fathom that God could forgive her for something so wretched. When she decides to pick up her cross and follow God, even in the valley of shadow and death, she discovers the hope and healing that can provide encouragement to all believers. Author Bio: Andrea Barringer is a veteran of the United States Army having served four years active duty at Walter Reed Army Medical Center in Washington, DC and four years in the Reserves. She is happily married to James Barringer and lives in Florida. She writes to share the hope and redemption that is found by having faith in the one true God and His Son, Jesus Christ. keywords: Religion, Christianity, God, Grace, Mercy, Loss, Healing, Military, Love, Redemption",
  "genres": [
    "Military Fiction",
    "Christian",
    "Christian Fiction"
  ],
  "author": "Andrea Barringer",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/17241237-into-the-trenches"
}