{
  "title": "The Mist on Brontë Moor",
  "description": "When fifteen-year-old Heather Jane Bell is diagnosed with alopecia and her hair starts falling out in clumps, she wants nothing more than to escape her home in London and disappear off the face of the earth. Heather gets her wish when her concerned parents send her to stay with a great-aunt in West Yorkshire. But shortly after she arrives, Heather becomes lost on the moors and is swept through the mist back to the year 1833. There she encounters fifteen-year-old Emily Bronte and is given refuge in the Bronte Parsonage. Unaware of her host family's genius and future fame, Heather struggles to cope with alopecia amongst strangers in a world foreign to her. While Heather finds comfort and strength in her growing friendship with Emily and in the embrace of the close-knit Bronte family, her emotions are stretched to the limit when she falls for Emily's brilliant but troubled brother, Branwell. Will Heather find her way back to the comforts and conveniences of the twenty-first century? Or will destiny keep her in the harsh world of nineteenth-century Haworth? \"Absolutely spectacular! I couldn't put this book down, and was mesmerized from the first word until the very last. The Mist on Bronte Moor has made it to my favorites list.\" ~Kerri Cuevas, author, Deadly Kisses \"...a quick and engaging read that YA readers of all ages will enjoy.\" ~The Reading Cafe \"Mixing time travel, romance, history, and suspense, this new take on the Brontë family is refreshing and unique. Although a work of fiction, the story makes you imagine what it was like for the Brontë family in the 19th century. The Mist on Bronte Moor brings you on a vivid journey to a historical past.\" ~YA Vixens",
  "genres": [
    "Historical Fiction",
    "Young Adult",
    "Time Travel",
    "Fantasy",
    "Romance",
    "Fiction",
    "Historical"
  ],
  "author": "Aviva Orr",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/17241431-the-mist-on-bront-moor"
}