{
  "title": "Blue Jeans and Coffee Beans",
  "description": "New York Times Bestseller Escape to Stony Point, cuff your jeans and walk along the water's edge in this nostalgic story bringing old friends, and their lives, back to the sea.After years of pursuing a denim design career, Maris Carrington never imagined trading her Chicago studio for a New England shingled cottage. But a forgotten home movie tucked inside a dusty attic box leads to an unexpected summer ... One of uncovering family secrets while settling her father's estate, one of inheriting a forlorn German shepherd, one of reconnecting with old friends on a weathered boardwalk, beneath starlit skies on a beach nestled in a crook of the Connecticut coast.Her design career had become a shell, curving around her like the intricate whorls of a conch, shielding her until now. Until fried clam dinners and carousel rides beckon a lost love. But can Maris ever really go back? Can these beach friends ever be who they were to each other all those summers ago? Now one of her circle is dead; another unemployed and struggling in a tenuous marriage; another regretting a fateful decision; while one is missing a mother, ever seeking a connection she longs for.To the backdrop of seaside cottages and a boarded-up beach hangout, to the soundtrack of whispering lagoon grasses and a vintage jukebox, \nBlue Jeans and Coffee Beans\n asks if we can really design our own lives, or if our fate lies somewhere in the stars.The Seaside Saga Reading Order:Book 1 - Blue Jeans and Coffee BeansBook 2 - The Denim Blue SeaBook 3 - Beach BluesBook 4 - Beach BreezeBook 5 - The Beach InnBook 6 - Beach BlissBook 7 - Castaway CottageBook 8 - Night BeachBook 9 - Little Beach BungalowBook 10 - Every SummerBook 11 - Salt Air SecretsBook 12 - Stony Point SummerBook 13 - The BeachgoersBook 14 - Shore RoadBook 15 - The WaitBook 16 - The GoodbyeBook 17 - The BarlowsBook 18 - The VisitorBook 19 - Stairway to the SeaAnd more Seaside Saga Books",
  "genres": [
    "Romance",
    "Fiction",
    "Chick Lit",
    "Contemporary",
    "Womens Fiction",
    "Book Club",
    "Drama"
  ],
  "author": "Joanne DeMaio",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/17241697-blue-jeans-and-coffee-beans"
}