{
  "title": "Stars and Stripes Triumphant",
  "description": "In England, Irish-born citizens are being herded into prison camps. On the high seas, a furious British Navy is seizing American cargo ships bound for Europe. And on the Thames, a new weapon of unparalleled destructive force is sailing toward an impregnable city–spearheaded by a daring act of espionage. For U.S. president Abraham Lincoln, Britain’s Queen Victoria, Lord Palmerston, and a loyal opposition, a day of reckoning is at hand . . . and so is history’s most astounding battle.Harry Harrison’s series of alternate history, based on the U.S. Civil War, stands as a provocative work of imagination, drama, and brilliant historical insight. Now in the thrilling finale, Harrison tells a stunning, action-packed story of America’s rapidly growing military might being locked, loaded, and aimed at the heart of England itself.For the two countries that share a language and a heritage, the conflict began at the dawn of the U.S. Civil War. Just as America was about to tear itself to pieces, Britain itself committed an act of war by seizing a U.S. packet ship. In retaliation, the Confederate States rejoined the Union and took up arms against England. Repulsing a British invasion, and defeating her majesty’s army first in Canada, then in Mexico, then in Ireland, American pride and power swelled. Britain, like a wounded lion, howled in shame and anger. Now, Queen Victoria’s empire is more dangerous than ever before, turning against the Irish on her own soil, flexing her naval might, and all but forcing a weary President Lincoln to authorize the next step in a headlong journey toward war.A tale of daring and strategy, Stars and Stripes Triumphant explores how arrogance turns superpowers into victims, how regional conflicts can explode into world wars, and how the personalities of a few men and women can change the course of history itself–for better or for worse.From the Hardcover edition.",
  "genres": [
    "Alternate History",
    "Fiction",
    "Science Fiction",
    "War",
    "Civil War",
    "Military Fiction",
    "Fantasy"
  ],
  "author": "Harry Harrison",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/172487.Stars_and_Stripes_Triumphant"
}