{
  "title": "Behind the Beautiful Forevers: Life, Death and Hope in a Mumbai Slum",
  "description": "NATIONAL BOOK AWARD WINNER NAMED ONE OF THE TEN BEST BOOKS OF THE YEAR BY\"The New York Times - The Washington Post - O: The Oprah Magazine - USA Today - New York - Newsday\"\" \"NAMED ONE OF THE BEST BOOKS OF THE YEAR BY\"People - Slate - The Economist - Financial Times - Newsweek - Foreign Policy - The Seattle Times - St. Louis Post-Dispatch - The Plain Dealer - Kansas City Star - Publishers Weekly\" \"A book of extraordinary intelligence [and] humanity . . . beyond groundbreaking.\"--Junot Diaz, \"The New York Times Book Review \"  In this brilliant, breathtaking book by Pulitzer Prize winner Katherine Boo, a bewildering age of global change and inequality is made human through the dramatic story of families striving toward a better life in Annawadi, a makeshift settlement in the shadow of luxury hotels near the Mumbai airport. As India starts to prosper, the residents of Annawadi are electric with hope. Abdul, an enterprising teenager, sees \"a fortune beyond counting\" in the recyclable garbage that richer people throw away. Meanwhile Asha, a woman of formidable ambition, has identified a shadier route to the middle class. With a little luck, her beautiful daughter, Annawadi's \"most-everything girl,\" might become its first female college graduate. And even the poorest children, like the young thief Kalu, feel themselves inching closer to their dreams. But then Abdul is falsely accused in a shocking tragedy; terror and global recession rock the city; and suppressed tensions over religion, caste, sex, power, and economic envy turn brutal. With intelligence, humor, and deep insight into what connects people to one another in an era of tumultuous change, \"Behind the Beautiful Forevers, \"based on years of uncompromising reporting, \"\"carries the reader headlong into one of the twenty-first century's hidden worlds--and into the hearts of families impossible to forget. \"NEW YORK TIMES\" BESTSELLER  \"An instant classic of narrative nonfiction.\"--\"Elle\"  \"[A] landmark book.\"--\"The Wall Street Journal\"\" \" \"Riveting, fearlessly reported . . . [Grade: ] A\"--\"Entertainment Weekly\"\" \" \"A Mumbai slum understood and imagined as never before in language of intense beauty.\"--Salman Rushdie  \"One of the most powerful indictments of inequality I've ever read.\"--Barbara Ehrenreich  \"Incandescent writing and excruciatingly good storytelling . . . Read it, and the forgotten people of Annawadi will be with you forever.\"--\"The Philadelphia Inquirer\"",
  "genres": [
    "Nonfiction",
    "India",
    "Book Club",
    "History",
    "Audiobook",
    "Poverty",
    "Sociology"
  ],
  "author": "Katherine Boo",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/17248749-behind-the-beautiful-forevers"
}