{
  "title": "Of Such Is The Kingdom Parts I & II, A Novel of The Christ and the Roman Empire",
  "description": "Step back into New Testament times--to Ancient Jerusalem at the time of Christ and of the historical Roman Empire, and ask: What could a cynical, non-conformist dry-goods salesman, a disgruntled blacksmith, and a musing mendicant all have in common? The answer: Down deep, they all seek something better. But will they find the true fulfillment they are seeking? The non-conformist, Manaheem, Herod's foster brother, is hired by Herod to foment an insurrection against Pontius Pilate, whom he distrusts. Manaheem recruits the blacksmith, Barabbas, to be the insurrection leader, to the dismay of Barabbas' Godly but fearful wife (when he finally tells her). The mendicant, an unfortunate but pensive young man named Timotheus, joins with an older beggar completely unsympathetic to his musings. Pontius Pilate sees himself as a weak ruler, but his wife pushes him to be stronger and to even take over Herod's territory. Manaheem re-unites with his former wife, Claressa. In need of more money, he tries to blackmail Herod over his illicit affair With Herodius, his brother’s wife, but, Herod decides to marry Herodius and send his present wife back to her father. John the Baptist preaches to Herod and looses his head. Herod's palace is attacked, and suspecting Pilate, he tells Manaheem go ahead with the mission. Barabbas is successful in forming a group of insurrectionists and they rehearse for the big day. But will the insurrection succeed? What's next, and how will Barabbas and Manaheem get the money they need? More importantly, will all find the fulfillment they seek? purchase this book to find out.-----------------------WRITING STYLE: The writing style is a unique eclectic style, combining poetry, straight dialogue and 1st person stream-of-consciousness narrative with the 3rd person narration.",
  "genres": [],
  "author": "James M. Becher",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/17250741-of-such-is-the-kingdom-parts-i-ii-a-novel-of-the-christ-and-the-roman"
}