{
  "title": "Of Such Is The Kingdom Part III",
  "description": ".This is the complete 3-Part edition of this Biblical, your best bet price-wise,Step back into New Testament times--to Ancient Jerusalem at the time of Christ and of the historical Roman Empire, and ask: What could a cynical, non-conformist dry-goods salesman, a disgruntled blacksmith, and a musing mendicant all have in common? The answer: Down deep, they all seek something better. But will they find the true fulfillment they are seeking? The non-conformist, Manaheem, Herod's foster brother, is hired by Herod to foment an insurrection against Pontius Pilate, whom he distrusts. Manaheem recruits the blacksmith, Barabbas, to be the insurrection leader, to the dismay of Barabbas' Godly but fearful wife (when he finally tells her). The mendicant, an unfortunate but pensive young man named Timotheus, joins with an older beggar completely unsympathetic to his musings. Pontius Pilate sees himself as a weak ruler, but his wife pushes him to be stronger and to even take over Herod's territory. Manaheem re-unites with his former wife, Claressa. In need of more money, he tries to blackmail Herod over his illicit affair With Herodius, his brother’s wife, but, Herod decides to marry Herodius and send his present wife back to her father. John the Baptist preaches to Herod and loses his head. Herod's palace is attacked, and suspecting Pilate, he tells Manaheem to go ahead with the mission. Barabbas is successful in forming a group of insurrectionists and they rehearse for the big day. But the insurrection fails. Manaheem turns to blackmail, and Barabbas turns to robbery, enlisting the aid of our two beggars. Manaheem almost loses his one true love, his former wife, Claressa, with whom he is trying to reunite. The robbery goes bad, and Barabbas and the beggars get caught and are sentenced to death. This is the newly revised 2nd edition of this work, and the newly added part III takes things a step further, as it deals with the early church and the reactions of the rulers to this new sect called Christians. It employs those characters who were still alive at the end of Part II and adds some new ones. The new characters added include Saul, who becomes Paul, Herod Agrippa, the nephew of Herod Antipas, who wants to take over the latter's territory, and Caligula, the crazy son of Emperor Tiberius and friend of Agrippa. Against the background of suspicion and treachery within the empire and disdain for and persecution of the new faith, the Church continues to grow and flourish. Follow the travels of Manaheem as he tries in vain to convert the two Herods. Follow the machinations of Herod Agrippa in his aim to take over his uncle's territory. Follow the foibles of Pilate as he seeks to become a stronger ruler, while still regretting his decision to crucify Jesus. Follow the new life of Barabbas and his family. Follow the lives of Benjamen's family as they cope and deal with their loss and the now seeming impossibility of Joseph's schooling. Will he get to go to Rabbi school and what will it mean for their future? But mainly follow the early church as it grows and flourishes amidst and in spite of persecution.",
  "genres": [],
  "author": "James M. Becher",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/17250756-of-such-is-the-kingdom-part-iii"
}