{
  "title": "Venetian Love Knots",
  "description": "In Venice, Allison Fox will find love in the arms of two men. Her past collides with her future in a battle for her heart. Which one will win?Travelling to Venice to be the maid of honour in her best friend’s wedding sounds like a great vacation, and a romantic way to spend Valentine’s Day. But when Allison Fox discovers who the best man is, she is torn between duty and self-preservation.It has taken Allison four years to put her tumultuous relationship with the rodeo cowboy behind her. A violent incident ripped them apart. Now Allison must find a way to face her past and find closure with her old flame. But will she be able to put the past behind her?Cole is the Texas cowboy has never got over his love for Allison. But when he declares his love for her after all this time, is she strong enough to walk away from the intense passion they share?For years Nico, a handsome Italian, was committed to nothing but his work. Nico never expected he would meet an American beauty who would awaken in him a desire to love again. Once he finds her, Nico vows to never let Allison go.It will be a Valentine’s Day to remember, but who will win Allison’s heart?Normandie AllemanOne day Normandie saw an interview with author Stephanie Meyer, in which Stephanie said that idea for her book, Twilight, came to her in a dream. Normandie determined that she needed to write down her next really good dream. Little did she know that vow would lead her to a career writing erotic fiction.When she’s not writing, Normandie has a busy life with a large family that relies on her. \"There’s always lots to do. I love to cook and bake, and I make a lot – big batches. My husband is an athlete and the boys are too. So they all eat a lot! There’s never a dull moment at our house. Writing is my escape. I sit down with the dog and write while my kids are at school.\"",
  "genres": [
    "Novella",
    "Erotic Romance",
    "Romance",
    "Menage",
    "BDSM",
    "Erotica",
    "Adult"
  ],
  "author": "Normandie Alleman",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/17250812-venetian-love-knots"
}