{
  "title": "Hanka Bielicka. Umarłam ze śmiechu",
  "description": "Opowieść o Hance Bielickiej autorstwa Zbigniewa Korpolewskiego Autor z właściwym sobie poczuciem humoru przedstawia jedną z najwybitniejszych artystek polskiej sceny. Opisuje jej życie zawodowe, drogę do wielkiej kariery, trudne wybory sceniczne, a potem okres, w którym niepodzielnie królowała na polskiej scenie. Autor pisze także o dotychczas ukrytym za kulisami życiu osobistym Pani Hanki – o jej charakterze, upodobaniach i rozterkach, o relacjach z mężczyznami i oczywiście o jej niekłamanej miłości do kapeluszy. Książka to hołd dla wielkiej artystki, którą tak bardzo pokochała polska widownia, ale też utrzymana w lekkim tonie refleksja nad sztuką kabaretu i miejscem dobrego humoru w kulturze. EPITAFIUM Tu w tym miejscu miała spocząć Hanka Bielicka – sługa Boży, ale nie daje się położyć. Krzysztof Daukszewicz (na Jej prośbę napisałem 2 lata przed śmiercią) Zbigniew Korpolewski z właściwą sobie swadą dotyka fenomenalnego i niepowtarzalnego zjawiska, jakim była Hanka Bielicka. Autor przerzuca pomost między czasami, w których tworzyła legendarna już dzisiaj artystka a dniem dzisiejszym, kiedy nie narodziła się żadna jej następczyni. A widzowie wciąż odczuwają brak Bielickiej. Wojciech Malajkat Mój przyjaciel Jerzy Filar, który przez pięć lata występował na scenie razem z Hanką Bielicką, opowiadał mi o koncercie Artystki, jaki odbył się w Domu Kultury w Strykowie. – Widzisz Jureczku – mówiła Pani Hania – myślałam, że ostatni koncert zagram w Sali Kongresowej, a tu proszę, Stryków! Mam propozycję, żeby imieniem Hanki Bielickiej nazwać nieistniejącą autostradę ze Strykowa do Warszawy. Natomiast książka jest wspaniałą autostradą, drogą do zrozumienia fenomenu genialnej Artystki i kochanego człowieka. Jacek Cygan Aktor, reżyser, konferansjer, dyrektor, satyryk. Chodząca encyklopedia polskiego show businessu. Był przy narodzinach big beatu, zapowiadał Animalsów, Rolling Stonesów, ostatnie koncerty Anny German, pisał teksty dla kabaretu „Dudek”, przez lata kierował Teatrem Syrena... Kiedyś powiedziałam, że jest najbardziej uważnym i dowcipnym świadkiem historii polskiego show businessu. A Zbyszek na to, że jest świadkiem koronnym i w związku z tym liczy na lżejszy wymiar kary. Drogi Autorze, to my, czytelnicy zostaniemy ukarani, jeśli nie zabierzesz się poważnie do spisywania tego wszystkiego, co przeżyłeś. Mam nadzieję, że biografia Hanki Bielickiej, dla której napisałeś tyle monologów i której byłeś nie tylko dyrektorem, ale i przyjacielem, to dopiero początek Twoich „zeznań”. Maria Szabłowska o Zbigniewie Korpolewskim",
  "genres": [],
  "author": "Zbigniew Korpolewski",
  "average_rating": "2.00",
  "url": "https://www.goodreads.com/book/show/17251292-hanka-bielicka-umar-am-ze-miechu"
}