{
  "title": "T.T. Gristman",
  "description": "Story about a one-armed Kentucky mountain man called T.T. Gristman who faces losing his mountains to greedy investors that want to steel his land for back taxes. He never knew he had to pay taxes because his grandparents took care of everything, and becomes a time traveler to save his home. He would do anything to save his home where he lived with his grandparents until they died leaving him the two and half mountains that had been his home for as long as he could recall. David approached two others before finally going to T.T. because he was laughed at by the other two. David's father was one of those planning to bid on the mountains. That was how he learned of T.T.'s predictament. David's offer to pay the back taxes, convinces T.T. to accept.T. T. thought at first it was a joke when he was told David's sister ran through it until he came to the barn where David had his time portal. He explained to T.T. the ins in outs of going through the portal. While he was back in time, it was easy to find Joyce or Joy as her brother called her. He found she was no joy to be with, not listening, a snob and over all rich bitch!Bringing only enough supplies for three days, he found it was even worse because she refused to eat meat being a vegetarian. Things go from bad to worse for the two of them.T.T., or Tee as his family knew him finds he is falling in love with her but she couldn't stand him!When things go wrong, they keep going wrong. Finding they were trapped back in time longer than three days, Joy forced her self to eat meat and then fight savages. Learning to hunt when Tee becomes wounded, Joy keeps them fed.By the time they get back to their own time, Joy is a changed person but still doesn't want to have anything to do with Tee!Heartbroken, Tee goes back in time to save David's great grandmother. When he returns after doing that, he finds out what caused him and Joy to stay back in time longer than the three days that he was originally told. A tornado came through and wiped the power out! Tee then found out his home was destroyed as well. Making friends, Diane starts teaching him about things he never knew while living on the mountaintop all alone with no electricity, TV or telephone. Heck, he didn't even know what a computer was! The tornado that destroyed his home also showed him he was not the poor man he thought he was or Joy did. Rebuilding his home while moving into the modern era, he has secret desires to share his new modern home with Joy but believing she was married, he tried to keep those thoughts to himself. In the meantime, he meets Jackie who helps him through his heartache. At first they were lovers then became friends knowing each other loved someone else!Tee finally goes back in time to find out who his parents really were and why was he dumped off at his grandparents or were they? Joy shocked him by going with him back to learn the truth and on that trip, Tee gets his heart wishes as she becomes his lover, then his wife.Tee returns to his own time once again after learning the truth of why he was with those he called Grandpa and Grandma. He has one more adventure after that going back in time before his time traveling days are over.",
  "genres": [],
  "author": "A.G. Moye",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/17251182-t-t-gristman"
}