{
  "title": "How Was I Supposed to Know? The Adventures of a Girl Whose Name Means Lost",
  "description": "Have you ever…1.\tfelt as if you never really got over your childhood?2.\tlooked at your life choices and asked, “What was I thinking?”3.\twondered if you would have made the same choices if you then what you know now?4.\thad trouble establishing and maintaining healthy relationships, either with yourself or with other people? Probably both?5.\tbeen told that you are “too sensitive,” “the problem,” or “an alcoholic?”6.\tbeen curious about how people who aren’t fictional face their fears?7.\twished you fretted less and laughed more when life throws you a curve ball?Well, then, this book is for you!Lorna is like everyone you’ve ever known. She is also like no one you’ll ever meet again. She’s just an ordinary person trying to make the best of the predicament du jour. What makes her different? The answers are revealed in this, her first, book. Here’s a hint: Lorna finds herself in more knotty predicaments than a novice knitter, yet she tells her often grim life story with a grin.  Was Lorna born curious and insecure or did her father’s mysterious disappearance when she was four years old make her that way? Was she really a Good Girl or was she clever enough to be an adept actress? Why did she wait until she was fifty years old to start saying what was really on her mind? Lorna’s story is one of decisions and their consequences born out of ignorance, or innocence. Information was withheld; secrets were kept. Looking back, she asks, “How was I supposed to know?” And then she laughs, because what else can she do? This book explores Lorna’s adventure of not knowing what was around the next corner (or why she was even turning a corner) and the sometimes delightful, sometimes shocking, but always enlightening surprises that awaited her.",
  "genres": [],
  "author": "Lorna Lee",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/17251946-how-was-i-supposed-to-know-the-adventures-of-a-girl-whose-name-means-lo"
}