{
  "title": "Starlight",
  "description": "**Includes The Best of Times**\nThe Triangle\nAnchorpoint City, 2082. Half a year after the death of his lover Takeshi, Rory remains devastated, deflecting Nick's attempts to draw him out. Lorcan takes it upon himself to coax Rory back to life. Then an innocent gesture of affection explodes into a sensational scandal, forcing them to make choices they would otherwise never have considered. Will their friendship survive the pressure of Nightwalker politics, or will their relationship be just another casualty of war?\nThe Spacers\nIn memory of his love for Tobias, Rafael became Antonio's closest friend and ally, supporting his protégé's advancement in the Spacer Guild despite Nick's deep disapproval. Captain of the Jumpvessel Singularity, Antonio has spent his entire adult life navigating the void between the stars, blissfully avoiding any part of the fate decreed for him in the war between the White Wind and the Red. Mentor and student are reunited when Antonio returns home on the one hundredth anniversary of his father's death, intending to stay only long enough to pay his respects to a man he never had a chance to know and the family he left behind. But in a world where immortality is commonplace, death is not always what it seems, and destiny is not so easily cast aside.\nThe Spy\nRazheel has served the Court of Shadows with honor for over a century as the Night's Herald, never openly taking sides in the divide between Nightwalker and Daywalker alliances. Now, after thirty thousand years of conflict, something new walks the Earth, which may be the greatest weapon yet in the battle between the races. As Antonio's fate becomes clear, she steps seamlessly into the role of revolutionary, and her carefully planned insurrection will set the Nightwalker race on the path to final victory, or to total extinction.",
  "genres": [
    "M M Romance",
    "Vampires",
    "Science Fiction",
    "Fantasy",
    "Paranormal",
    "M M M",
    "Romance"
  ],
  "author": "Arshad Ahsanuddin",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/17252100-starlight"
}