{
  "title": "Pole Dance",
  "description": "Caitlin Tomas was at the end of her rope. She's working four menial jobs to make ends meet and supplement her half-ride scholarship at the University where she's determined to get her degree in four years as her parents had planned. But it's hard to find time to study, much less sleep, when you've got so much going on. Overhearing her lab partner describing her Pole Dancing job at the Fuego Club and how much she gets paid and tipped, Caitlin decides to apply.Expecting to interview with a middle-aged mafia-type, troglodyte, Caitlin was shocked to find her interview was with the young, smoking hot, co-owner, Jake Stanton. He soon discovers that Caitlin is not suited as a dancer for the Fuego's, but is definitely suited for him especially when he has first hand evidence of how she is treated by one of her bosses and a bank president that makes a visit to her apartment after banking hours.He is further intrigued when he receives a background check on her and discovers that she was exactly who she said she was--a starving student with no living family, struggling to meet commitments of work and school. In his business, that kind of honesty is rare and he is completely captivated.Jake begins a campaign to win Cait's heart, but she is so fiercely independent that he has trouble breaking down her walls. She views his help as 'trying to take over' and tries to resist him at every turn. It doesn't help when she is accosted by a jealous ex-lover who says that Jake will try and buy his way into her bed. His efforts are further hampered by a distrustful business partner, a serial killer who's victims are current or former dancers of Fuego's, and Floyd, the cat.Through all this can the world-weary Jake convince the naïve but independent Caitlin that sharing his life doesn't mean giving up hers?Pole Dance is the first in the Dance series and is intended for mature readers only. Graphic language and detailed sexual situations.",
  "genres": [
    "Romance",
    "Contemporary",
    "Erotica",
    "College",
    "Contemporary Romance",
    "New Adult",
    "Adult"
  ],
  "author": "J.A. Hornbuckle",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/17252200-pole-dance"
}