{
  "title": "آيات علمانية",
  "description": "د. خالد منتصر:\"آيات علمانية\" كتاب يواجه الإسلاميين بجسارة«الجري في المكان» تمرين شهير يعرفه ويُتقنه كلُّ من التحق بالجيش، هذا التمرين يُلخِّص حالنا العقلي والفكري في المرحلة الانتقالية، قبل وبعد الثورة، تمرين الجري في المكان يُزيح الرِّمال، لكنه يغرس قدميك أكثر فيها، لا تتحرك مللي مترًا واحدًا عن مكانك، لكنك تبذل كل الجهد في ألَّا تغادر مكانك، تستنفذ العرق والجهد في الثبات والتكلُّس والتحنُّط في المكان، وهكذا كانت ثورتنا، أزاحت رمال مبارك لكنها لم تُزِح أفكار عصر مبارك وزمن مبارك، بذل شبابُنا كل الجهد والعرق والدم لكي نقف في مكاننا ونسلم الثورة لأكثر التيارات رجعيَّة، تمرين ثورتنا يستحق لقب التقهقُر في المكان... وليس الجري في المكان.الكتاب الذي تتصفحونه الآن فيه رصد لفترة التقهقُر في المكان، قراءة لعقل مصر في هذه الفترة، يؤكد فيه المؤلف د.عماد نصر ذِكري على أن بذور التخلُّف والرَّجعية زُرِعَت في زمن مبارك وبمباركة مباركية! جنين السلفية الوهابية كان في رحم عصر مبارك ورجاله، كانت ذقونهم تنبت إلى الداخل، ولذلك لم تكن مفاجأة أن هؤلاء هم الرابح الوحيد في برنامج من سيربح الميدان!فرج فودةاغتيل في عهده، نصر أبو زيد نُفي في عهده، أمن الدولة استخدم التيار السلفي في عهده، المرة الوحيدة في عهده التي انتُقِد فيها وزير من الحزب الوطني كانت لأنه انتقد الحجاب! الفاترينة ليبرالية والبضاعة سلفية.المؤلف مُدافع جَسور عن العلمانية، لا يرضى بأنصاف الحلول ولا يُمسك العصا من المنتصف، يعرف أن العلمانية هي الحل، حتى لمن يُريد أن يُحافظ على دينه ويمارسه بحُرية، العلمانية ضد الفاشية والعنصرية وليست ضد الدين، هي ضد تحكُّم رجال الدين في السياسة. ستتعرف من خلال الكتاب أنه لا عِلم في ظِل دولة دينية، لا فنَّ في ظِل دولة دينية، لا إبداع في ظِل دولة دينية، مواطنو الدولة الدينية ببساطة أعداء حياة... أعداء خيال... أعداء بهجة، ولا يمكن لهؤلاء الأعداء أن يُنتجوا عِلمًا أو يُبدعوا فنًّا.المؤلِّف من كُتَّاب كتيبة التنوير المصرية، وقد منحته دراسة الطِّب مشرطًا للتشريح والتحليل، ورؤية ثاقبة وقدرة زرقاء اليمامة على الاستشراف والتنبؤ، فرغم أن هناك مقالات كُتبت قبل الثورة إلا أنك تحس أن توقُّعاته قد حدثت، وكأنه يكتب سيناريو سابق التجهيز، عماد نصر ذِكري طبيب يُحاول أن يُجري جراحة للوطن ويرفض أن يكون حانوتيًّا يدفن جثته، مُحب عاشق صبابة لمصر المحروسة، يكتب بدمع المآقي وحبر الشريان عن مصر التى يتمناها والتي تستحق أفضل من خفافيش الظلام، تستحق تغريد العندليب وشجن الكروان وتحليق النوارس.هل سنظل نجري في المكان؟ نطرح بَدهيات حُسِمَت منذ ألف سنة، نجترُّ أفكارًا تجاوزها الزمن منذ القرون الوسطى، نشرح الشروح ونهمش الهوامش ونكتب عن المكتوب وعليه ولا نتقدَّم خطوة واحدة في سبيل إبداع أو نقد أو تجاوز أو جنون مشروع؟! الكتاب يطرح أسئلة وعلامات استفهام مثله مثل أي عمل ثوري جاد، أما الإجابة فهي في رحم الزمن الذي نرجو ألَّا يلد سرابًا.د. خالد منتصر",
  "genres": [],
  "author": "عماد نصر ذكرى",
  "average_rating": "3.07",
  "url": "https://www.goodreads.com/book/show/17253002"
}