{
  "title": "With Cruel Intent",
  "description": "The author of 'With Cruel Intent' takes the reader on a roller coaster of a ride, evoking an array of emotions as the main characters experience happiness, romance, treachery and pain.A stagnant heat and economy push Blanche Delaney, a beautiful 33-year-old librarian, to pack her bags and head for Valdosta, Georgia in search of happiness, adventure and love. Concerned that life is passing her by she is compelled to travel the thousands of miles away from family and friends to start a new life among a host of Southern characters that will ultimately change her life forever. Her new home, a temporary room at Caroline's Bed & Breakfast, introduces the woman to true Southern hospitality. The array of guests, coming and going, opens the door for antics that prove to be both humorous and horrifying.A trio of unlikely suitors enters the librarian's life, each with unique capabilities and characteristics; Jasper, a black bodybuilder who is liked by all, an unlikely hero in Seymour, an awkward university student that falls for Blanche and lastly, an accomplished burglar, with no rap sheet but an obsession with the shapely newcomer.The untimely death of a local real estate tycoon pits Beverly Marshall, the middle aged widow, against her stepson, Jeremy, for control of the estate. A conspiracy develops that draws the unknowing lovers into the fray, leading the reader on a wild crime-ladened ride through the homes and streets of Lowndes County. Before long the entire populace is scared and seeking answers from the local Sheriff's Office, headed by Sheriff Angelo Lupo, 'The Wolf'. Twists and turns aplenty as the entire cast of unlikely characters will be pulled together in an explosive and very unexpected ending.",
  "genres": [
    "Romance",
    "Romantic Suspense",
    "Suspense",
    "Thriller",
    "Crime"
  ],
  "author": "Dennis F. Larsen",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/17253906-with-cruel-intent"
}