{
  "title": "The Green Man and Other Stories",
  "description": "The Green Man & Other Stories collects for the first time anywhere eleven of the early short stories of openly-gay fantasist Rand B. Lee, who since 1981 has been delighting — and shocking — readers with tales characterized by humor, pathos, sensuality, and a keen sensitivity to life on the borderland of consensus reality. In \"The Green Man,\" a lonely little boy encounters a strange, shadowy figure at woods' edge, a figure who will change his life forever;In \"The Pearl,\" a seedy cityscape becomes the backdrop for the death — and redemptive afterlife — of a gay male prostitute;In \"Shriving Autumn,\" prepared especially for this collection, a tormented nobleman seeks his son, who was stolen away by fairies;In \"End Cruise,\" the brain of a dying holo star tells a horrifying tale of seduction, transformation, and betrayal;In \"Heart In Winter\", a psychic child with multiple personality disorder flees a telekinetic monster;In \"On Springfield Mountain,\" a community of quarantined psi-talents is forced to face its inner demons when a handsome stranger crashes on their mountain;In \"Letting Go of Waverley,\" the husband and followers of a dead channeler grapple with loss, hope, and thwarted ambition;In \"Still Life With Doves,\" a physician imprisoned on an alien planet by a conservative, repressive regime suffers a twisted version of \"let the punishment fit the crime;\" In \"Knight of Shallows\" (originally published many years before the appearance of Jet Li's \"The One\"), a young man is catapulted into a series of alternate universes, seeking a murderous version of himself;In \"Full Fathom Five My Father Lies,\" Rand Lee's first published story, castaways on an alien planet forge an all-male society that is anything but Utopian;And in \"The Sound of His Wings,\" an old man and his psi-talented lover are threatened with the loss of all they hold dear.",
  "genres": [
    "Anthologies"
  ],
  "author": "Rand B. Lee",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/17254021-the-green-man-and-other-stories"
}