{
  "title": "The Billionaire Who Cloned Me",
  "description": "THE BILLIONAIRE WHO...A leggy blonde flight attendant, Lisa gets plenty of offers from wealthy men, but the one she keeps refusing just won't take no for an answer. Lisa doesn't know how she keeps getting into these messes, but when it comes to good-looking billionaire Tristan Vargas, rough sex is the drug that seems to wipe away her good sense and land her into his bed, his dungeon, and his possession over and over again. In The Billionaire Who (Diary of a Fuckdoll) series parts 1-3, Tristan bones her, owns her, and stones her before she eventually decides to break away from him forever.In Part 4, Lisa plans to fool Tristan, but the joke's on her when she lands in a jail cell with her skeezy step-brother and his buddies. The last person Lisa wants to call on for help becomes her only hope for rescue, as the rough group sex she endures makes Tristan look like a knight in comparison. Tristan may turn rescuer, but will it be enough to make Lisa fall for him, forever? The Billionaire Who Phoned Me ends with yet another cliff-hanger.Diary of a Fuckdoll Part 5 promises to deliver more kinky sex and depraved acts as Tristan continues to pursue ownership of Lisa. Waking from a coma, Lisa is at first unable to remember--legitimately, this time--how she got into this mess, and is in turns confused and slaked by Tristan's treatment of her, physically & emotionally as well as medically. When Lisa overhears Tristan receiving a blow job from a flight attendant on their way to Dubai, she decides to go off her meds just to see what happens. What comes next is a life-changing experience she'll never forget, pitting her against the man whose throbbing hot cock she adores, but whose dominance she loves to hate. Who will prevail? Discover how the wealthy men of the world bond over blondes and sex alongside Lisa in this leg of her journey: THE BILLIONAIRE WHO CLONED ME, Diary of a Fuckdoll part 5.",
  "genres": [
    "Erotica"
  ],
  "author": "A. Violet End",
  "average_rating": "3.23",
  "url": "https://www.goodreads.com/book/show/17255065-the-billionaire-who-cloned-me"
}