{
  "title": "Indexsuche nach Abkuerzungen / Kuerzel Fachgebiete: Informationstechnik (PC-Begriffe / Elektronik Telekommunikation",
  "description": "ebook- Neuerscheinung Januar 2013:runterladen unter:http://www.amazon.de/dp/B00B0X3MQU/oder:http://www.amazon.com/dp/B00B0X3MQU/Indexsuche nach Abkuerzungen / Kuerzel Fachgebiete: Informationstechnik (PC-Begriffe / Elektronik Telekommunikation+Indexsuche nach erklaerten Begriffen in deutschFachbereiche: Computer / Multimedia (Unterhaltungselektronik) / Automation (Automatisierungstechnik) / Antriebstechnikindex search: abbreviations information technology / electronic engineering / telecommunications+index search: technical terms / words: computer /multimedia / automation / of drives in german language LESEPROBE:ABD Automatic Baudrate Detection. Das heißt: Empfangende Datenstationen (wie Modems) justieren sich automatisch auf die gesendeten Übertragungsgeschwindigkeiten ein.ACCArea Communication Controller. Bezeichnung fuer einen vermaschten Vermittlungsknoten im Modacom-Netz.ACK Acknowledge/Acknowledgement. Bestätigung. Ein bei Netzprotokollen verwendetes Signal, um den Empfang von Daten zu quittieren.ACS {Multimedia}Access Control Server/System. Zugriffssteuerungssystem. Es werden Übertragungsdienste nur für berechtigten Personen zur Verfügung gestellt. Das System ist aus drei Hauptelementen zusammengesetzt: Der Signalverschlüsselung, der Kodierung elektronischer \"Schlüssel\", die der Empfänger benötigt, und einem Abonnentenverwaltungssystem. Mit dem Abonnentenverwaltungssystem erreicht man, dass die berechtigten Empfänger die verschlüsselten Programme auch wirklich sehen können.ACSR Amplitude- compandered single sideband. Einseitenband mit kompandierter Amplitude.ADR advanced digital recording. ADR dient der Archivierung und Sicherung von Daten. Die Daten werden mittels eines linearen Aufzeichnungsverfahrens auf einem Magnetband gespeichert.Adressregister AR address register. Sind Temporäre Speicherplätze innerhalb eines Mikroprozessors. Ein Adressenregister (AR) ist ein Funktionselement der Zentraleinheit (CPU) eines Computers und fungiert zwischen dem Datenbus und dem Adressbus.AFE Active Front End-Stromrichter. Der Umrichter hat als Netzstromrichter einen Vier-Quadrantensteller.AFGC automatic frequency and gain control. Automatische Frequenz- und Verstärkungsregelung.AVR automatic gain control. Automatische Verstärkungsregelung.DMA Direct Memory Access. Direktspeicherzugriff. Ein intelligentes Gerät greift auf den Speicher eines anderen zu.DMS Data Management System. Datenverwaltungssystem.DOCSIS Data Over Cable Service Interface Specifications. Ist die Spezifikationen für eine Schnittstelle für die Datenübertragung über Fernsehkabel (Koaxialkabel).DRAM Dynamic Random Access Memory. Ist ein dynamischer Arbeitsspeicher (Hauptspeicher). Bezeichnung für Speicher-Chip für den Arbeitsspeicher von Computern. Die Daten werden hierbei immer wieder erneuert.LSI large scale integration. Bezeichnung fuer ein Integrationsgrad. Dieser gibt die absolute Anzahl von Transistoren in einem integrierten Schaltkreis wieder.L-TTL low power TTL. L-TTL ist eine Low-Power-Transistor-Transistor-Logik und ist der Logikfamilie für logische Schaltungen zuzuordnen. Es werden Transistoren, Dioden und Widerstände zusammengeschaltet. Man erreicht eine kleine Leistungsaufnahme.usw.Impressum:http://www.englisch-woerterbuch-mecha...ebooks Technische Woerterbuecher + Lexika mechatronik elektronik edv unter:http://www.amazon.com/Markus-Wagner/e...Verlag Lehrmittel-WagnerTechnischer Autor Dipl.-Ing. (FH), ElektrotechnikMarkus WagnerIm Grundgewann 32aGermany – 63500 SeligenstadtUSt-IdNr: DE238350635Tel.: 06182/22908Fax: 06182843098",
  "genres": [],
  "author": "Markus Wagner",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/17257346-indexsuche-nach-abkuerzungen-kuerzel-fachgebiete"
}