{
  "title": "Royalty",
  "description": "Short descriptionCrown Prince Zhaiden Sinclair has found the lady of his dreams, child psychologist Renee Delacorte. Yet intelligence, education, and deep understanding cannot mitigate her fear to be in the public spotlight, a legacy of childhood trauma. Hard-pressed with Imperial duties, Zhaiden's private life suddenly comes under horrific public scrutiny when his fiancée is abducted. Has he lost Renee forever? Extended descriptionBeing the Crown Prince means responsibility, but being a single father can be more responsibility than one man can handle. Thus Crown Prince Zhaiden Sinclair finds himself looking for a child psychologist to help his Heir Matthieu deal with the absence of his mother Colette, who has been barred from the lives of her children since their ugly divorce.Enter Lady Renee Delacorte, whose expertise was driven by her own childhood trauma. When Zhaiden’s desire to court Renee is met with her reticence to pursue a relationship, he spends inordinate amounts of time to win her love, despite the press of his political duties. As the enemy planet of Javonia causes more galactic upheaval, Zhaiden strives to keep the peace without jeopardizing his family, his Empire, or his budding romance with the exquisite Renee, already dear to his precious sons.Just when the Javonian troubles seem almost impossible to negotiate, Zhaiden’s ex-wife proves enemies closer to home can devastate an Empire as surely as any war. Can Zhaiden convince Renee to marry him after Colette’s treasonous attack? Will Renee’s nurturing ways turn her away from dealing with the traitors in the way the Imperial Family must, by execution? And can a lady who has never experienced true social pressure find the courage and sheer gumption to become the next Empress of the Sinclair Demesnes?This futuristic romance is the fourth book of the seven-part To Be Sinclair series. The saga continues with FEALTY and its companion volume ROYALTY, which detail the romances and political struggles of the Prince Second and Crown Prince of the Sinclair Demesnes. A few scenes describe sexually explicit behavior.",
  "genres": [],
  "author": "Eva Caye",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/17257305-royalty"
}