{
  "title": "Remember When",
  "description": "Alternate cover edition of ASIN B00AUV1R42Ever wonder how often Brad Pitt’s high school girlfriend must ponder jumping off a bridge? Ever think about the girl that had her hooks in George Clooney before he took off for TV stardom? How about Leonardo DiCaprio’s ex, or Johnny Depp’s first groupie, or any number of young women who got left behind when their boyfriends set off for greener pastures and eventually achieved unfathomable Hollywood fame?  My name is Layla Warren and I don’t need to wonder about any of those things. I already know. Because years before Trip Wiley could be seen on movie screens all over the world, he could be seen sitting in the desk behind me in my high school English class.  This was back in 1990, and I cite the year only to avoid dumbfounding you when references to big hair or stretch pants are mentioned. Although, come to think of it, I am from New Jersey, which may serve as explanation enough. We were teenagers then, way back in a time before anyone could even dream he’d turn into the Hollywood commodity that he is today.  In case you live under a rock and don't know who Trip Wiley is, just know that these days, he’s the actor found at the top of every casting director’s wish list. He’s incredibly talented and insanely gorgeous, the combination of which has made him very rich, very famous and very desirable.  And not just to casting directors, either.  I can’t confirm any of the gossip from his early years out in Tinseltown, but based on what I knew of his life before he was famous, I can tell you that the idea of Girls-Throwing-Themselves-At-Trip is not a new concept.  I should know. I was one of them.  And my life hasn’t been the same since.",
  "genres": [
    "Romance",
    "New Adult",
    "Young Adult",
    "Contemporary",
    "Contemporary Romance",
    "Friends To Lovers",
    "High School"
  ],
  "author": "T. Torrest",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/17258829-remember-when"
}