{
  "title": "Lazarus, Man",
  "description": "This is the story of Lazarus of Bethany, told through tale and tribulation. * Darkness. Nothing. There was a void in the world around him, without light or sound. A heaviness weighed on Lazarus’ soul as he grasped for being. He sensed in the darkness there had been light only moments before but he could not grasp what that light was. Suddenly he felt a pulse in his chest. Something heavy held his body firm. Memories flooded through his mind of heat, cattle… family. The world was somehow wrong. He tried to move but found he could not, could not raise the heaviness above him. He smelt earth. Then, with a thrust, he pushed his bound arms out of the cave soil he was buried in and braced them on the earth, using his weakened strength to pull upward. Earth caved in about him as he rose from his grave, his arms and legs bound with bandages. There was a cloth over his face he could not remove. He saw a faint light before him through the cloth. “Lazarus, come out,” a voice beckoned. He walked slowly in his bandages toward the light and could feel a warm breeze move about him. The sun radiated in the cloth over his eyes. “Unbind him, and let him go,” the voice returned. He felt coarse hands on his arms as bandages were unwrapped from him. Coolness came over his skin where they had been. Lazarus breathed heavily, unsure of what was happening. He had a vague memory of being sick before this. He was barely aware of who he was. The cloth over his face was pulled away and he squinted as sunlight blinded him. A bearded man with long wavy hair stood in the light. Jesus, he thought in disbelief as the man approached, placing his palm on Lazarus’ forehead. “You are healed, brother,” Jesus told him as Lazarus’ sisters rushed to his side. “You are still needed in this world.”",
  "genres": [
    "Christian Fiction"
  ],
  "author": "Scott J. Toney",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/17259254-lazarus-man"
}