{
  "title": "The Happy Hollisters at Circus Island",
  "description": "The Happy Hollisters at Circus Island (#8 in the Happy Hollisters series)The purchase of a houseboat for a customer at Mr. Hollister’s sport and toy store, The Trading Post, sends the Hollister family to Circus Island, the home of the Sunshine Circus, in Florida. Before they are to leave, however, Pam enters her dog Zip in a dog show where the theft of two French poodles and an injury to Zip begin a mystery which has some connection with the Hollisters’ destination in Florida.The five Hollister children are amazed when they discover the thief at the dog show has preceded them all along the way to Circus Island. Through clues, such as a handbill announcing the Wizard Circus and the disappearance of another dog, they learn the thief’s activities are far more sinister than anyone had at first suspected.Along with the strange occurrences of the mystery is the inside story of a circus. The boys learn a tumbling act, Holly tries her skill at tightrope walking, and they all find that a clown’s smile is sometimes only a happy mask that hides sorrow.An excellent new Hollister tale, set in a fascinating part of the United States and concerned with a way of life that’s almost like another world, this book will provide exciting reading.First published in 1955, this charming mystery-adventure story, faithfully reproduced, is now available in paperback and eBook for the first time! Written for boys and girls between the ages of six and twelve, The Happy Hollisters are wholesome books, with an accent on humor and good, clean fun. Integrity always pays off and right wins over wrong. Parents, grandparents, and teachers love these books for their healthy celebration of life in simpler times. Kids are thrilled with the fast-paced action and will not want to put them down. The action-packed illustrations make the story – and the Hollister family – so vivid that the reader has a feeling of really sharing in on the adventures of this lovable and interesting family.",
  "genres": [
    "Mystery",
    "Fiction",
    "Childrens",
    "Classics",
    "Juvenile",
    "Chapter Books",
    "Kids"
  ],
  "author": "Jerry  West",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/1726150.The_Happy_Hollisters_at_Circus_Island"
}