{
  "title": "Russia",
  "description": "This is book fifteen of an eighty part series. Julianne, Morgan's boss, finally meets her long lost love after more than a decade, but will she accept him back in to her heart? Is she mad at Morgan for telling?When the young girl gets to Russia, she's greeted by a group of men that remind of a situation she was in not long ago. But does she judge them too quickly? Not everything is how it appears on the surface.Excerpt:She wasn't even paying attention to the creep group that had made their way to nearly two feet from her.“Morgan?” The largest man in the group spoke up and nearly scared the girl to death. They were right there in front of her, AND knew her name. His accent was thick, and she barely recognized the word that he spoke, but it was close enough. In response, with wide and terrified eyes, she nodded slowly. He put his hand out in her direction, and smiled. “Come.” His smile was nice, but she wouldn't bend to the leader of the pack that easily. Clearly, he knew her client, and clearly, she needed answers before she would agree to go anywhere with him. “Where's.. the man that is supposed to be here?” That was good, she thought, she would make him say her client's name, just for more proof. He shook his head, his English wasn't great, and she caught on to that much. “Oh, wait!” Morgan opened her phone and signed onto the database, then showed the pack leader a picture of her client. “Where is he?” The big man smiled and nodded.“Vladimir. Come to Vladimir.” He turned slightly and waved for her to follow him, still smiling at their small connection. *****Special Note to readers*****Morgan is a high-end call girl. Her clients are gorgeous, wealthy and they know how to please a woman. This contains hot, super hot, boiling lava hot, scenes! Here's what's not going to happen: They gazed at each other longingly, desire filling them to the core. She blushed and offered her hand to his. With her head hung low, the two retreated to the bedroom for some adult time. Here's what will happen: Oh, just kidding, I can't write that here! What are you waiting for??? Click the button and follow Morgan as she goes around the world in 80 men.This is a novella, with a word count just shy of 27,000. Enjoy!",
  "genres": [],
  "author": "Brandi Ratliff",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/17261719-russia"
}