{
  "title": "Ghost on the Throne: The Death of Alexander the Great and the War for Crown and Empire",
  "description": "Alexander the Great, perhaps the most commanding leader in history, united his empire and his army by the titanic force of his will. His death at the age of thirty-two spelled the end of that unity.The story of Alexander's conquest of the Persian empire is known to many readers, but the dramatic and consequential saga of the empire's collapse remains virtually untold. It is a tale of loss that begins with the greatest loss of all, the death of the Macedonian king who had held the empire together. With his demise, it was as if the sun had disappeared from the solar system, as if planets and moons began to spin crazily in new directions, crashing into one another with unimaginable force.Alexander bequeathed his power, legend has it, 'to the strongest,' leaving behind a mentally damaged half brother and a posthumously born son as his only heirs. In a strange compromise, both figures, Philip III and Alexander IV, were elevated to the kingship, quickly becoming prizes, pawns, fought over by a half-dozen Macedonian generals. Each successor could confer legitimacy on whichever general controlled him.At the book's center is the monarch's most vigorous defender; Alexander's former Greek secretary, now transformed into a general himself. He was a man both fascinating and entertaining, a man full of tricks and connivances, like the enthroned ghost of Alexander that gives the book its title, and becomes the determining factor in the precarious fortunes of the royal family.James Romm, brilliant classicist and storyteller, tells the galvanizing saga of the men who followed Alexander and found themselves incapable of preserving his empire. The result was the undoing of a world, formerly united in a single empire, now ripped apart into a nightmare of warring nation-states struggling for domination, the template of our own times.",
  "genres": [
    "History",
    "Nonfiction",
    "Ancient History",
    "Biography",
    "Greece",
    "War",
    "Historical"
  ],
  "author": "James Romm",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/10767816-ghost-on-the-throne"
}