{
  "title": "Wales",
  "description": "This is book fourteen of an eighty part series.Morgan had decided to spend her birthday in London with her friends, Angel and Angela. Except, there are more guests than she had originally anticipated. Morgan learns that it won't always be possible to please everyone, but who is the unhappy one? Then the young girl goes onto Wales and meets a man that's unlike anyone she has met so far.Excerpt:Morgan smiled at Angel and shook her head, then sarcastically mouthed THANKS to him. She took a deep breath and started talking before she was fully turned around. “My friend here thinks you're hot, but I don't care what you....holy shit.” When she looked up, she saw he wasn't bachelor number four.... “What...what are you....Michael?”“You know this hot drippin' slab of....uh...you know him?” Angel's mouth hung open as he waited for his answer, and Morgan's head moved quickly between the man behind her and the one across from her. Michael was more than happy to put her out of her misery. He stepped to the side of her and took a seat at their small table.“I was invited.” He dropped his head and smiled at Morgan's confusion, then continued. “In your room, during our small Christmas party, you told me to meet you here for your birthday.” His genuine smile brought one to Morgan's face as the foggy memory surfaced just enough to make his story legit. Angel's giggling from across the table also helped to relieve the slight tension of the near-awkward situation.*****Special Note to readers*****Morgan is a high-end call girl. Her clients are gorgeous, wealthy and they know how to please a woman. This contains hot, super hot, boiling lava hot, scenes! Here's what's not going to happen: They gazed at each other longingly, desire filling them to the core. She blushed and offered her hand to his. With her head hung low, the two retreated to the bedroom for some adult time. Here's what will happen: Oh, just kidding, I can't write that here! What are you waiting for??? Click the button and follow Morgan as she goes around the world in 80 men.This is a novella, with a word count just under 28,000. Enjoy!",
  "genres": [],
  "author": "Rebecca Ratliff",
  "average_rating": "4.54",
  "url": "https://www.goodreads.com/book/show/17261697-wales"
}