{
  "title": "The Burglary: The Discovery of J. Edgar Hoover's Secret FBI",
  "description": "The never-before-told full story of the history-changing break-in at the FBI office in Media, Pennsylvania, by a group of unlikely activists—quiet, ordinary, hardworking Americans—that made clear the shocking truth and confirmed what some had long suspected, that J. Edgar Hoover had created and was operating, in violation of the U.S. Constitution, his own shadow Bureau of Investigation.  It begins in 1971 in an America being split apart by the Vietnam War . . . A small group of activists—eight men and women—the Citizens Commission to Investigate the FBI, inspired by Daniel Berrigan’s rebellious Catholic peace movement, set out to use a more active, but nonviolent, method of civil disobedience to provide hard evidence once and for all that the government was operating outside the laws of the land.             The would-be burglars—nonpro’s—were ordinary people leading lives of purpose: a professor of religion and former freedom rider; a day-care director; a physicist; a cab driver; an antiwar activist, a lock picker; a graduate student haunted by members of her family lost to the Holocaust and the passivity of German civilians under Nazi rule.Betty Medsger's extraordinary book re-creates in resonant detail how this group of unknowing thieves, in their meticulous planning of the burglary, scouted out the low-security FBI building in a small town just west of Philadelphia, taking into consideration every possible factor, and how they planned the break-in for the night of the long-anticipated boxing match between Joe Frazier (war supporter and friend to President Nixon) and Muhammad Ali (convicted for refusing to serve in the military), knowing that all would be fixated on their televisions and radios.Medsger writes that the burglars removed all of the FBI files and, with the utmost deliberation, released them to various journalists and members of Congress, soon upending the public’s perception of the inviolate head of the Bureau and paving the way for the first overhaul of the FBI since Hoover became its director in 1924.  And we see how the release of the FBI files to the press set the stage for the sensational release three months later, by Daniel Ellsberg, of the top-secret, seven-thousand-page Pentagon study on U.S. decision-making regarding the Vietnam War, which became known as the Pentagon Papers.             At the heart of the heist—and the book—the contents of the FBI files revealing J. Edgar Hoover’s “secret counterintelligence program” COINTELPRO, set up in 1956 to investigate and disrupt dissident political groups in the United States in order “to enhance the paranoia endemic in these circles,” to make clear to all Americans that an FBI agent was “behind every mailbox,” a plan that would discredit, destabilize, and demoralize groups, many of them legal civil rights organizations and antiwar groups that Hoover found offensive—as well as black power groups, student activists, antidraft protestors, conscientious objectors. The author, the first reporter to receive the FBI files, began to cover this story during the three years she worked for The Washington Post and continued her investigation long after she'd left the paper, figuring out who the burglars were, and convincing them, after decades of silence, to come forward and tell their extraordinary story.  The Burglary is an important and riveting book, a portrait of the potential power of non­violent resistance and the destructive power of excessive government secrecy and spying.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "True Crime",
    "American History",
    "Biography",
    "Crime"
  ],
  "author": "Betty Medsger",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/17262123-the-burglary"
}