{
  "title": "The Bones of Paris",
  "description": "In this thrilling new book New York Times bestselling author Laurie R. King, beloved for her acclaimed Mary Russell/Sherlock Holmes series, leads readers into the vibrant and sensual Paris of the Jazz Age—and reveals the darkest secrets of its denizens.Paris, France: September 1929. For Harris Stuyvesant, the assignment is a private investigator’s dream—he’s getting paid to troll the cafés and bars of Montparnasse, looking for a pretty young woman. The American agent has a healthy appreciation for la vie de bohème, despite having worked for years at the U.S. Bureau of Investigation. The missing person in question is Philippa Crosby, a twenty-two year old from Boston who has been living in Paris, modeling and acting. Her family became alarmed when she stopped all communications, and Stuyvesant agreed to track her down. He wholly expects to find her in the arms of some up-and-coming artist, perhaps experimenting with the decadent lifestyle that is suddenly available on every rue and boulevard.   As Stuyvesant follows Philippa’s trail through the expatriate community of artists and writers, he finds that she is known to many of its famous—and infamous—inhabitants, from Shakespeare and Company’s Sylvia Beach to Ernest Hemingway to the Surrealist photographer Man Ray. But when the evidence leads Stuyvesant to the Théâtre du Grand-Guignol in Montmartre, his investigation takes a sharp, disturbing turn. At the Grand-Guignol, murder, insanity, and sexual perversion are all staged to shocking, brutal effect: depravity as art, savage human nature on stage.   Soon it becomes clear that one missing girl is a drop in the bucket. Here, amid the glittering lights of the cabarets, hides a monster whose artistic coup de grâce is to be rendered in blood. And Stuyvesant will have to descend into the darkest depths of perversion to find a killer . . . sifting through The Bones of Paris.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Fiction",
    "France",
    "Historical",
    "Historical Mystery",
    "Crime"
  ],
  "author": "Laurie R. King",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/17262138-the-bones-of-paris"
}