{
  "title": "Countrymen: The Untold Story of How Denmark's Jews Escaped the Nazis",
  "description": "Amid the dark, ghastly history of World War II, the literally extraordinary story, never before fully researched by a historian, of how the Danish people banded together to save their fellow Jews from the Nazis—told through the remarkable unpublished diaries and documents of families forced to run for safety, leaving their homes and possessions behind, and of those who courageously came to their aid.  In 1943, with its king and administration weakened but intact during the Nazi occupation, Denmark did something that no other country in Western Europe even attempted. Anticipating that the German occupying powers would soon issue the long-feared order to round up the entire population of Jews for deportation to concentration camps, the Danish people stood up in defiance and resisted. The king, politicians, and ordinary civilians were united in their response—these threatened people were not simply Jews but fellow Danes who happened to be Jewish, and no one would help in rounding them up for confinement and deportation.   While diplomats used their limited but very real power to maneuver and impede matters in both Copenhagen and Berlin, the warning that the crisis was at hand quickly spread through the Jewish community. Over fourteen harrowing days, as they were helped, hidden, and protected by ordinary people who spontaneously rushed to save their fellow citizens, an incredible 7,742 out of 8,200 Jewish refugees were smuggled out all along the coast—on ships, schooners, fishing boats, anything that floated—to Sweden. While the bare facts of this exodus have been known for decades, astonishingly no full history of it has been written. Unfolding on a day-to-day basis, Countrymen brings together accounts written by individuals and officials as events happened, offering a comprehensive overview that underlines occupied Denmark’s historical importance to Hitler as a prop for the model Nazi state and revealing the savage conflict among top Nazi brass for control of the country. This is a story of ordinary glory, of simple courage and moral fortitude that shines out in the midst of the terrible history of the twentieth century and demonstrates how it was possible for a small and fragile democracy to stand against the Third Reich.",
  "genres": [
    "History",
    "Nonfiction",
    "Holocaust",
    "Denmark",
    "World War II",
    "Historical",
    "War"
  ],
  "author": "Bo Lidegaard",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/17262195-countrymen"
}