{
  "title": "Mad About the Boy",
  "description": "Logo que foi lançado, O diário de Bridget Jones conquistou uma legião de fãs e se tornou a voz de toda uma geração de mulheres modernas, de trinta e poucos anos, divididas entre a esperança de encontrar o verdadeiro amor e as frustrações dessa busca. Mulheres que, como Bridget, precisam se desdobrar entre as realizações profissionais e os cômicos percalços que mancham seu currículo, entre as exaustivas demandas familiares e as farras com amigos, entre os cuidados com a silhueta e o prazer de devorar cinco barras de chocolate antes do café da manhã.Catorze anos após o último livro, Bridget Jones: No limite da razão, nossa heroína retoma seu diário abandonado e mostra que continua a mesma, e ainda mais viva - e ativa - do que nunca. O tempo se encarregou de trazer à sua vida outros dramas e dilemas, mas não levou embora seu jeito estabanado e a personalidade luminosa sem a qual ela não poderia enfrentar os momentos comoventes que a aguardam. Além de não descuidar da balança e manter-se longe dos cigarros, agora ela também precisa se preocupar com sites de relacionamentos, o número de seguidores no Twitter e os perigos de trocar mensagens de texto depois de algumas taças de vinho.Ainda às voltas com os amores, Bridget tropeça em novas confusões e tenta em vão se esquivar das gafes que ajudaram a consagrá-la como uma das personagens mais divertidas da literatura feminina contemporânea, enquanto figuras antigas e recentes desfilam por sua vida - sobretudo um garoto misterioso que vem para balançar seriamente suas certezas.Bridget Jones: Louca pelo garoto traz um desfecho inesperado para a história que já conhecemos, sem deixar de abrir portas a outras aventuras. Leitura obrigatória para qualquer mulher de hoje, o romance é um retrato fiel e bem-humorado das tribulações ao mesmo tempo trágicas e risíveis que compõem nosso dia a dia.",
  "genres": [
    "Chick Lit",
    "Fiction",
    "Romance",
    "Humor",
    "Contemporary",
    "Audiobook",
    "Comedy"
  ],
  "author": "Helen Fielding",
  "average_rating": "3.40",
  "url": "https://www.goodreads.com/book/show/17262155-mad-about-the-boy"
}