{
  "title": "Dancing With the Enemy: My Family's Holocaust Secret",
  "description": "The gripping story of the author’s aunt, a Jewish dance instructor who was betrayed to the Nazis by the two men she loved, yet managed to survive WWII by teaching dance lessons to the SS at Auschwitz. Her epic life becomes a window into the author’s own past and the key to discovering his Jewish roots. Raised in a devout Roman Catholic family in the Netherlands, Paul Glaser was shocked to learn as an adult of his father's Jewish heritage. Grappling with his newfound identity and stunned by his father’s secrecy, Paul set out to discover what happened to his family during World War II and what had caused the long-standing rift between his father and his estranged aunt, Rosie, who moved to Sweden after the war. Piecing together his aunt’s wartime diaries, photographs, and letters, Paul reconstructed the dramatic story of a woman who was caught up in the tragic sweep of World War II.  Rosie Glaser was a magnetic force – hopeful, exuberant, and cunning. An emancipated woman who defied convention, she toured Western Europe teaching ballroom dancing to high acclaim, falling in love hard and often. By the age of twenty-five, she had lost the great love of her life in an aviation accident, married the wrong man, and sought consolation in the arms of yet another. Then the Nazis seized power. For Rosie, a nonpracticing Jew, this marked the beginning of an extremely dangerous ordeal. After operating an illegal dance school in her parents’ attic, Rosie was betrayed by both her ex-husband and her lover, taken prisoner by the SS and sent to a series of concentration camps. But her enemies were unable to destroy her and, remarkably, she survived, in part by giving dance and etiquette lessons to her captors. Rosie was an entertainer at heart, and her vivacious spirit, her effervescent charm, and her incredible resourcefulness kept her alive amid horrendous tragedy. Of the twelve hundred people who arrived with her at Auschwitz, only eight survived. Illustrated with more than ninety photos, Dancing with the Enemy recalls an extraordinary life marked by love, betrayal, and fierce determination. It is being published in ten languages.",
  "genres": [
    "Nonfiction",
    "History",
    "Holocaust",
    "Memoir",
    "World War II",
    "Biography",
    "War"
  ],
  "author": "Paul Glaser",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/17262209-dancing-with-the-enemy"
}