{
  "title": "The System: The Glory and Scandal of Big-Time College Football",
  "description": "AN EXPLOSIVE AND REVELATORY PORTRAIT REPORTED FROM DEEP BEHIND THE SCENES OF BIG-TIME NCAA COLLEGE THE PASSION, THE THRILLING ACTION—AND THE SHOCKING REALITIES THAT LIE BENEATH THIS COLOSSAL, MULTIBILLION-DOLLAR BUSINESS COLLEGE FOOTBALL has never been more popular—or more chaotic. Millions fill 100,000-seat stadiums every Saturday; tens of millions more watch on television every weekend. The 2013 Discover BCS National Championship game between Notre Dame and Alabama had a viewership of 26.4 million people, second only to the Super Bowl. Billions of dollars from television deals now flow into the game; the average budget for a top-ten team is $80 million; top coaches make more than $3 million a year; the highest paid, more than $5 million.     But behind this glittering success are darker “athlete-students” working essentially full-time jobs with no share in the oceans of money; players who often don’t graduate and end their careers with broken bodies; “janitors” who clean up player misconduct; football “hostesses” willing to do whatever it takes to land a top recruit; seven-figure black box recruiting slush funds. And Despite the millions of dollars pouring into the game, 90 percent of major athletic departments still lose money. Yet schools remain caught up in an ever-escalating “arms race”—at the expense of academic scholarships, facilities and faculty.     Celebrated investigative journalists Jeff Benedict and Armen Keteyian were granted unprecedented access during the 2012 season to programs at the highest levels across the country at a time of convulsive change in college football. Through dogged reporting, they explored every nook and cranny of this high-powered machine, and reveal how it operates from the inside out. The the system through the eyes of athletic directors and coaches, high-flying boosters and high-profile TV stars, five-star recruits and tireless NCAA investigators and the kids on whom the whole vast enterprise depends.     Both a celebration of the power and pageantry of NCAA football and a groundbreaking, thought-provoking critique of its excesses, The System is the definitive book on the college game.",
  "genres": [
    "Sports",
    "Nonfiction",
    "Football",
    "History",
    "Business",
    "Audiobook",
    "Economics"
  ],
  "author": "Jeff Benedict",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/17262205-the-system"
}