{
  "title": "Doomed",
  "description": "Madison Spencer, the liveliest and snarkiest dead girl in the universe, continues the afterlife adventure begun in Chuck Palahniuk’s bestseller Damned. Just as that novel brought us a brilliant Hell that only he could imagine, Doomed is a dark and twisted apocalyptic vision from this provocative storyteller.The bestselling Damned chronicled Madison’s journey across the unspeakable (and really gross) landscape of the afterlife to confront the Devil himself. But her story isn’t over yet. In a series of electronic dispatches from the Great Beyond, Doomed describes the ultimate showdown between Good and Evil. After a Halloween ritual gone awry, Madison finds herself trapped in Purgatory—or, as mortals like you and I know it, Earth. She can see and hear every detail of the world she left behind, yet she’s invisible to everyone who’s still alive. Not only do people look right through her, they walk right through her as well. The upside is that, no longer subject to physical limitations, she can pass through doors and walls. Her first stop is her parents’ luxurious apartment, where she encounters the ghost of her long-deceased grandmother. For Madison, the encounter triggers memories of the awful summer she spent upstate with Nana Minnie and her grandfather, Papadaddy. As she revisits the painful truth of what transpired over those months (including a disturbing and finally fatal meeting in a rest stop’s fetid men’s room, in which . . . well, never mind), her saga of eternal damnation takes on a new and sinister meaning. Satan has had Madison in his sights from the very beginning: through her and her narcissistic celebrity parents, he plans to engineer an era of eternal damnation. For everyone. Once again, our unconventional but plucky heroine must face her fears and gather her wits for the battle of a lifetime. Dante Alighieri, watch your back; Chuck Palahniuk is gaining on you.",
  "genres": [
    "Fiction",
    "Horror",
    "Fantasy",
    "Humor",
    "Contemporary",
    "Audiobook",
    "Novels"
  ],
  "author": "Chuck Palahniuk",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/17262208-doomed"
}