{
  "title": "The Global War on Christians: Dispatches from the Front Lines of Anti-Christian Persecution",
  "description": "One of the most respected journalists in the United States and the bestselling author of The Future Church uses his unparalleled knowledge of world affairs and religious insight to investigate the troubling worldwide persecution of Christians. From Iraq and Egypt to Sudan and Nigeria, from Indonesia to the Indian subcontinent, Christians in the early 21st century are the world's most persecuted religious group. According to the secular International Society for Human Rights, 80 percent of violations of religious freedom in the world today are directed against Christians. In effect, our era is witnessing the rise of a new generation of martyrs. Underlying the global war on Christians is the demographic reality that more than two-thirds of the world's 2.3 billion Christians now live outside the West, often as a beleaguered minority up against a hostile majority-- whether it's Islamic fundamentalism in the Middle East and parts of Africa and Asia, Hindu radicalism in India, or state-imposed atheism in China and North Korea. In Europe and North America, Christians face political and legal challenges to religious freedom. Allen exposes the deadly threats and offers investigative insight into what is and can be done to stop these atrocities. “This book is about the most dramatic religion story of the early 21st century, yet one that most people in the West have little idea is even The global war on Christians,” writes John Allen. “We’re not talking about a metaphorical ‘war on religion’ in Europe and the United States, fought on symbolic terrain such as whether it’s okay to erect a nativity set on the courthouse steps, but a rising tide of legal oppression, social harassment and direct physical violence, with Christians as its leading victims. However counter-intuitive it may seem in light of popular stereotypes of Christianity as a powerful and sometimes oppressive social force, Christians today indisputably form the most persecuted religious body on the planet, and too often its new martyrs suffer in silence.” This book looks to shatter that silence.",
  "genres": [
    "Nonfiction",
    "Religion",
    "Christian",
    "History",
    "Christianity",
    "Catholic",
    "Islam"
  ],
  "author": "John L. Allen Jr.",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/17262363-the-global-war-on-christians"
}