{
  "title": "A Disability History of the United States",
  "description": "The first book to cover the entirety of disability history, from pre-1492 to the present Disability is not just the story of someone we love or the story of whom we may become; rather it is undoubtedly the story of our nation. Covering the entirety of US history from pre-1492 to the present, A Disability History of the United States is the first book to place the experiences of people with disabilities at the center of the American narrative. In many ways, it’s a familiar telling. In other ways, however, it is a radical repositioning of US history. By doing so, the book casts new light on familiar stories, such as slavery and immigration, while breaking ground about the ties between nativism and oralism in the late nineteenth  century and the role of ableism in the development of democracy. A Disability History of the United States pulls from primary-source documents and social histories to retell American history through the eyes, words, and impressions of the people who lived it. As historian and disability scholar Nielsen argues, to understand disability history isn’t to narrowly focus on a series of individual triumphs but rather to examine mass movements and pivotal daily events through the lens of varied experiences. Throughout the book, Nielsen deftly illustrates how concepts of disability have deeply shaped the American experience—from deciding who was allowed to immigrate to establishing labor laws and justifying slavery and gender discrimination. Included are absorbing—at times horrific—narratives of blinded slaves being thrown overboard and women being involuntarily sterilized, as well as triumphant accounts of disabled miners organizing strikes and disability rights activists picketing Washington.  Engrossing and profound, A Disability History of the United States fundamentally reinterprets how we view our nation’s past: from a stifling master narrative to a shared history that encompasses us all.",
  "genres": [
    "History",
    "Disability",
    "Nonfiction",
    "Social Justice",
    "Disability Studies",
    "Politics",
    "American History"
  ],
  "author": "Kim E. Nielsen",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/17262462-a-disability-history-of-the-united-states"
}