{
  "title": "A Schoolboy's Diary and Other Stories",
  "description": "This new collection of more than seventy stories by the iconic modern writer Robert Walser, includes stories that have appeared in Harper’s Magazine, n+1 online, Vice, and elsewhere. Also included is the complete “Fritz Kocher’s Essays,” the “collected works,” so to speak, of a boy who died young, consisting entirely of classroom writing assignments on themes such as “Music,” “Christmas,” and “The Fatherland.” As the opening title sequence of Walser’s first book, this was a brilliant way to frame and introduce his unique voice, oscillating wildly as it does between naïveté (the ludicrous teacher wearing “high boots, as though just returning from the Battle of Austerlitz”), faux-naïveté, and faux-faux-naïveté (“Factories and the areas around them do not look nice. I don’t understand how anyone can be around such unclean things. All the poor people work in the factories, maybe to punish them for being so poor”).  Fritz Kocher’s Essays and Other Stories is centered around schoolboy life—the subject of his greatest novel, Jakob von Gunten—and dispatches from the edge of the writer’s life, as Walser’s modest, extravagant, careening narrators lash out at uncomprehending editors, overly solicitous publishers, and disdainers of Odol mouthwash. There are vignettes that swoon over the innocent beauties of the Swiss landscape, but from sexual adventures on a train, to dissecting an adulterous love triangle by “wading knee-deep into what is generally called the Danish or psychological novel,” to three stories about Walser’s service in the Swiss military during World War I, the collection has an unexpected range of subject matter.   Because Walser’s stories have been translated into English in the form of selected volumes, and because of his reputation as a quasi–outsider artist, it has been all but impossible for English-language readers to appreciate that he was a professional writer publishing ten books of stories during his active career. By giving tables of contents for all ten books and indexing the stories’ appearances in the various English collections, the afterword provides a valuable resource for Walser’s many English-language readers.",
  "genres": [
    "Short Stories",
    "Fiction",
    "German Literature",
    "Germany",
    "Literature",
    "20th Century",
    "Classics"
  ],
  "author": "Robert Walser",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/17262562-a-schoolboy-s-diary-and-other-stories"
}