{
  "title": "Loss of Innocence",
  "description": "Number one New York Times best-selling author Richard North Patterson, author of more than twenty novels, including Degree of Guilt and Silent Witness, returns with a sweeping family drama of dark secrets and individual awakenings.Loss of Innocence, the second book in the Blaine trilogy, \"in one life of the 1960s, symbolizes a movement that keeps changing all our lives\" (Gloria Steinem) in \"a richly-layered look at the loss of innocence not only among his characters but that which America lost as a nation.\" (Martha's Vineyard Times) \"An extraordinary novel--profound, emotionally involving and totally addictive,\" said actor and author Stephen Fry, \"this may be Richard North Patterson's best work.\"In 1968 America is in turmoil, engulfed in civil unrest and in the midst of an unpopular war. Yet for Whitney Dane--spending the summer of her twenty-first year on Martha's Vineyard, planning a September wedding to her handsome and equally privileged fiance--life could not be safer, nor the future more certain. Educated at Wheaton, soon to be married, and the youngest daughter of the patrician Dane family, Whitney has everything she has ever wanted, and is everything her doting father, Wall Street titan Charles Dane, wants her to be: smart, sensible, predictable. Nonetheless, Whitney's nascent disquiet about society and her potential role in it is powerfully stimulated by the forces transforming the nation. The Vineyard's still waters are disturbed by the appearance of Benjamin Blaine, an underprivileged, yet fiercely ambitious and charismatic figure who worked as an aide to the recently slain Bobby Kennedy. Ben's presence accelerates Whitney's growing intellectual independence, inspires her to question long-held truths about her family, and stirs her sexual curiosity. It also brings deep-rooted tensions within the Dane clan to a dangerous head. Soon, Whitney's future seems far less secure, and her ideal family far more human, than she ever could have suspected. An acknowledged master of the courtroom thriller, Patterson's Blaine trilogy, a bold and surprising departure from his past novels, is a complex family drama pulsing with the tumult of the time and \"dripping with summer diversions, youthful passion and ideals, class tensions, and familial disruptions.\" (Library Journal)",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Audiobook",
    "Thriller",
    "Romance",
    "Historical",
    "Adult Fiction"
  ],
  "author": "Richard North Patterson",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/17262777-loss-of-innocence"
}