{
  "title": "Engelszungen",
  "description": "Wer einen Roman schreibt, muss etwas zu erzählen haben und dafür braucht man Platz. Deshalb können eigentlich Romane nicht dünn sein, meint der junge bulgarisch-österreichische Autor Dimitré Dinev. Was wie eine kokette Erklärung klingt, hat bei ihm seine Berechtigung und muss sie auch haben, denn sein Debütroman Engelszungen hat den stolzen Umfang von 600 Seiten. Wie schon in seinem ersten Erzählungsband Die Inschrift sind Emigranten und deren Schicksal sein bevorzugtes Thema. Damals musste er sich allerdings noch beschränken, doch nun ließ man ihm Platz und den nützt er aus, nicht um zu dehnen oder strecken, sondern um seinen Einfällen und verblüffenden Wendungen Raum zu geben. In Engelszungen sind Svetljo und Iskren seine zentralen Figuren. Beide stammen aus Bulgarien, leben in Wien und sind finanziell ziemlich am Ende. Ihre letzte Chance ist ein Serbe namens Miro. Das Problem ist nur, er ist tot und begraben unter einer großen Engelsstatue am Zentralfriedhof. Doch selbst als Toter versteht er es zu helfen, so erzählt man es sich zumindest in Emigrantenkreisen, wo Miro den Status eines Engels der Flüchtlinge einnimmt. Man muss ihm nur seine Geschichte schildern, dann gibt es vielleicht eine Lösung. Da Svetljo und Iskren sowieso keine andere Chance haben, steigen sie darauf ein, und so nimmt am Wiener Zentralfriedhof die Geschichte ihren Lauf. Daraus entwickelt sich ein weit gespanntes und verzweigtes Familienpanorama, in das Dinev auch gleich die Geschichte Bulgariens der letzten Jahrzehnte verwebt. Er ist ein genauer Beobachter, der keine larmoyante oder anklagende Aufarbeitung tragischer Schicksale betreibt, sondern mit seinen Figuren sehr menschlich umgeht und dabei auch nicht seinen Witz versteckt. Er erzählt mit Wucht, Intensität und einem Bilderreichtum, die einfach verblüffen, besonders wenn man weiß, dass Dinev, der 1990 nach Österreich geflüchtet ist, auf Deutsch schreibt. --Tobias Hierl",
  "genres": [
    "Bulgarian Literature",
    "Contemporary",
    "Bulgaria",
    "Fiction",
    "Literature"
  ],
  "author": "Dimitré Dinev",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/1726306.Engelszungen"
}