{
  "title": "Ravenstoke Forging the Way",
  "description": "The World of Seaton and the TowerThe Tower, ancient and mysterious, connects the thirteen worlds of man. It allows safe passage across the great void that separates these various realms. Of these thirteen worlds, Seaton circles closest to the ancient construct. This close proximity allows the people of Seaton to sense and manipulate the living mesh of their world. Magic exists on Seaton, magic that will challenge the Eternal Warriors of the Tower. Magic that will make this particular journey long and unpredictable. For the Heralds of Light, delivering Seaton from darkness will prove difficult.The Realms of Sol-Perithia and CattkardeThree hundred years have passed since the Great Kings War. Victorious in that long ago war, Sol-Perithia has experienced a long lasting golden age of peace and prosperity. The three races of this land, Elf, Dwarf and Man, exist in a profitable, if sometimes uneasy, alliance. A Tribunal, under the combined leadership of their three kings, rules the people of Sol-Perithia.Cattkarde—both the aggressor and the vanquished in this long ago war—has known only strife, famine, political bickering, multiple usurper Kings and countless coups in the long years following their defeat. Cattkarde is a ruthless, wild and unforgiving land where the strong prey upon the weak, every advantage taken, and no quarter given. Into this setting, an ancient evil is set to return and destroy man and his companion races. The Assembled FewThe Wizard Derrick, a member of the Brotherhood of the Olcán, has waited his entire life for this last great struggle between good and evil, between harmony and discord. Born in the time of the Great Kings War, he used the arcane arts to preserve his life in anticipation of this last great battle. Now, however, his lifeline grows weak and his old body frail. With a resolute spirit and a sharp mind, he must overcome his physical limitations, assemble those who will join him, and make his stand.Mara Elbanairo, Elfin Princess and sole heir to the Kingdom of Simsherral, must choose between the palace and a life of luxury, or follow Derrick on his obscure quest and risk losing everything. She must make this decision at a most precarious time in her life. Swept up in the maiden desires of Or-rappa, she must choose, and couple, with her life-mate. Or-rappa is the ‘unreasonable’ time, when her carnal desires outweigh all other sensibilities. Rok Hammer, Dwarven Warrior and second in the famous Ruarc Brigade, is a lost hero, long believed to be dead. A broad shouldered and powerfully built Troshtagh dwarf, fearless and heroic in his youth, he must rekindle the fire that once burned within and rediscover the courage and faith that only noble purpose can give.The beautiful Keara Patrick, a refugee fleeing the sacked and pillaged city of Alldan, must venture beyond the protective walls of her fallen city. Forced to flee into the hostile and unforgiving realm of Cattkarde, her wits, and the three protective charms bestowed upon her at birth, are her only allies. In the wilds, she discovers her true nature and perhaps her greater purpose.Ruarc Ravenstoke, the cursed, a long ago leader of men, a Sol-Perithian hero, and a principal player in the Great Kings War, is lost. Too long the warrior, too long the drifter and the rogue; he exists as a disconnected man, a callous man far removed from the noble and heroic deeds of his youth. Those who know him for the man that he once was, and Keara—the woman that loves him for the man that he may yet be—must help him bridge the chasm that exists within his empty heart.",
  "genres": [
    "Fantasy"
  ],
  "author": "Stephen Cool",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/17264374-ravenstoke-forging-the-way"
}