{
  "title": "Out of the FOG: Information & Support for those with a Family Member or Loved One who Suffers From a Personality Disorder",
  "description": "Out of the FOG was written by a group of people who have experienced a relationship with a family member, spouse or partner who suffers from a personality disorder.Personality disorders are serious mental-health conditions which affect millions of people but which often go undiagnosed and misunderstood. Personality disorders often deteriorate the quality of life not only of the people who suffer from them, but also their family members, spouses, partners, friends, colleagues and acquaintances.The acronym FOG stands for Fear, Obligation & Guilt - feelings which often result from being in a relationship with a person who suffers from a Personality Disorder. It was first coined by Susan Forward & Donna Frazier in their book \"Emotional Blackmail: When the People in Your Life Use Fear, Obligation, and Guilt to Manipulate You.\"It is the goal of this book to help inform and encourage family members, spouses, partners, friends and caregivers as they try to work their way out of the confusion, out of the chaos and out of the FOG.The emphasis of Out of the FOG is to describe personality disorders from a Non-personality-disordered individual's point of view. In other words; what is it like to live with a person with Narcissitic or Borderline Personality Disorder? What’s it like to have a parent with a Histrionic or Dependent Personality Disorder? How do you cope when confronted with the prospect of caring for someone with Obsessive-Compulsive or Avoidant Personality Disorder?The descriptions of personality disorders given in this book are based not only on the clinical criteria used for diagnosis but also on the experiences of people who have cared for someone who suffers from a personality disorder; what it feels like, what works and what doesn't.We often think of people in simple terms such as good and bad, friends and enemies, loving and hateful. Personality disorders are not so simple and the people who suffer from them often exhibit behaviors which are at times constructive and at other times destructive. This often creates confusion for those who come into contact with them.If you have a family member or loved-one who suffers from a personality disorder, it is our hope that the information contained here may help you understand these behaviors better and navigate out of the FOG in your own life.",
  "genres": [
    "Self Help",
    "Nonfiction",
    "Psychology",
    "Mental Health"
  ],
  "author": "Gary Walters",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/17264533-out-of-the-fog"
}