{
  "title": "Pearl Harbor: Hinge of War",
  "description": "Just over seventy years ago the world witnessed one of the most audacious and villainous surprise attacks in history. While Tokyo and Washington talked peace, hundreds of Japanese war planes descended on the Sunday morning calm of Pearl Harbor on 7 December 1941. In less than 90 minutes four battleships were sunk, four more badly damaged and hundreds of American warplanes lay burnt out in tangled heaps on the runways.The events leading up to the attack are a heady tale. In Hawaii the Japanese spy Yoshikawa kept Tokyo informed of the weaknesses in the harbour’s defences. In Japan the Foreign Office plotted deception after deception to disguise their iniquitous war plans. In Washington the Japanese ambassador talked peace and goodwill while his country armed itself for war.In America the code-breakers read all the Japanese despatches and passed warning after warning to their masters. Day by day the signs of an imminent and sudden attack grew. But both in Washington and in Hawaii politicians and service chiefs failed to read the signs.The story of the raid is one of Japanese military skill meeting American courage. As airfields and ships were attacked, as planes caught fire and ships capsized, the men of the army and navy heroically fought to save the planes, the ships and their compatriots. ‘Pearl Harbor: Hinge of War’ is packed with tales of heroism, valour and lucky escapes as ships became towering infernos and airfields were turned into bonfires of exploding planes. Its pages are filled with the stories of many of the survivors from the moment they first heard the throb of an aeroplane engine in the early morning calm to the departure of the last Japanese plane 90 minutes later.The book ends with a look at the raid’s consequences and shows how what seemed a brilliant master-stroke by Japan proved to be their undoing: they had woken the sleeping giant.Richard Freeman graduated in mathematics before following a career in distance education. He now writes on naval history. His other books include; 'The Great Edwardian Naval Feud', 'Britain's Greatest Naval Battle: The Armada, Trafalgar, Jutland' and 'A Close Run Thing: The Navy and the Falklands War'. Endeavour Press is the UK's leading publisher of digital books.",
  "genres": [
    "History",
    "Nonfiction"
  ],
  "author": "Richard   Freeman",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/17265036-pearl-harbor"
}