{
  "title": "Thirty Years that Shook Physics: The Story of Quantum Theory",
  "description": "“Dr. Gamow, physicist and gifted writer, has sketched an intriguing portrait of the scientists and clashing ideas that made the quantum revolution…”—Christian Science MonitorIn 1900, German physicist Max Planck postulated that light, or radiant energy can exist only in the form of discrete packages or quanta. This profound insight, along with Einstein's equally momentous theories of relativity, completely revolutionized man's view of matter, energy, and the nature of physics itself.In this lucid layman's introduction to quantum theory, an eminent physicist and noted popularizer of science traces the development of quantum theory from the turn of the century to about 1930—from Planck's seminal concept (still developing) to anti-particles, mesons and Enrico Fermi's nuclear research. Gamow was not just a spectator at the theoretical breakthroughs which fundamentally altered our view of the universe, he was an active participant who made important contributions of his own. This “insider's” vantage point lends special validity to his careful, accessible explanation of Heisenberg's Uncertainty Principle, Neils Bohr's model of the atom, the pilot waves of Louis de Broglie and other path-breaking ideas.In addition, Gamow recounts a wealth of revealing personal anecdotes which give a warm human dimension to many giants of 20th-century physics. He end the book with the Blegdamsvej Faust, a delightful play written in 1932 by Niels Bohr's students and colleagues to satirize the epochal developments that were revolutionizing physics. This celebrated play is available only in this volume.Written in a clear, lively style, and enhanced by 12 photographs (including candid shots of Rutherford, Bohr, Pauli, Heisenberg, Fermi and other notables), Thirty Years that Shook Physics offers both scientists and laymen a highly readable introduction to the brilliant conception that helped unlock many secrets of energy and matter and laid the groundwork for future discoveries.(Back Cover)",
  "genres": [
    "Science",
    "Physics",
    "History",
    "Nonfiction",
    "History Of Science",
    "Biography",
    "Popular Science"
  ],
  "author": "George Gamow",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/17265.Thirty_Years_that_Shook_Physics"
}