{
  "title": "The Valentine's Day Mini-Mystery Compendium",
  "description": "What do you think of when you think of Valentine’s Day? If it happens to be romance, love, and mystery then this fun and flirty compendium is for you. Full of scavenger hunts, mysterious love letters, secret admirers, and missing jewels, this collection of stories is capable of bringing out the romantic side of any mystery connoisseur.First in the compendium is the fast-paced scavenger hunt mystery “An Unusual Request” by T.B. Audrey. When Beatrice agreed to meet her best friend (and longtime crush), Tommy, at an out of the way diner, she never imagined that it would lead to her spending Valentine’s Day hosting a dinner party for a group of strangers in the middle of nowhere. To make matters more bizarre, it was all at the request of a dead man. Soon the peculiar guests begin to arrive: A flower child painter, a cold businessman and his rigid wife, and a young playboy accompanied by a gorgeous blond. To Beatrice it seems the guests are so diverse that the only thing they seem to have in common is a love of money and a grudge against Tommy. Then things take an even stranger turn, as it’s revealed that the party is just an elaborate scavenger hunt to decide who will inherit Tommy’s late uncle’s fortune. Soon Beatrice and Tommy find themselves embroiled in a wild and wacky contest, in which not everyone is who they seem or what they appear to be. Filled with lighthearted one-liners and a cast of quirky characters, the pages seem to fly by as the characters race from clue to clue, the excitement pausing only long enough for love and romance to blossom.Next up is the romantic and mysterious “Samson’s Corner” by K.B. Clyde. When Megan Walker makes reservations for her and her husband, Dave, at Samson’s Corner, a bed and breakfast set in the scenic southern countryside, she hopes for a quiet, relaxing vacation. However, when the pair arrives at the bed and breakfast, Dave is constantly distracted by work and Meg is left mostly to her own devices. It’s not exactly what she had in mind for a romantic week away. Then, Meg accidently discovers a stash of old, anonymous love letters in a book from the bed and breakfast’s library and her curiosity gets the best of her. She vows to find out who the letters belong to, convinced the receiver is someone who still lives at Samson’s Corner. Do the letters belong to Joanne, an Aunt Bea type and owner of Samson’s Corner? Or maybe Cicily, the pretty waitress with the no-good boyfriend? Romance abounds at the bed and breakfast, so investigating the letters is not an easy task. Dave joins in on the search, putting his work on the backburner, and the couple teams up to try and solve this Valentine’s Day mystery. With little information to go on, will the couple find out who the letters belong to before they must leave Samson’s Corner? In “The Ruby Necklace”, by Price McNaughton, Cara is working as a caterer at a local jewelry store's Valentine's Day party, she expects the night to be like any other, but it does not go quite as planned. When one of the contest entries, a ruby necklace, goes missing Cara finds herself thrust into a mystery. To make matters worse, her longtime crush, Rick, could be blamed. With only an hour to solve the mystery, will she be able to find the necklace in time? McNaughton weaves a riveting tale full of mystery and intrigue, brimming with shifty characters, shocking twists, and a hint of romance, which will keep you guessing until the very end.Giles Kent finishes up the compendium on the perfect note of romance, in her short story “Signed, Your Secret Admirer”, Kent’s leading lady, Helen, somehow manages to be tough and lovable at the same time, capable of both coldness and touching moments of insecurity. Anyone who is a romantic at heart will find her inner journey a compelling and touching message, mixed with just enough mystery and comedy to make it an irresistible read.",
  "genres": [
    "Mystery"
  ],
  "author": "Giles Kent",
  "average_rating": "3.38",
  "url": "https://www.goodreads.com/book/show/17266725-the-valentine-s-day-mini-mystery-compendium"
}