{
  "title": "An American Requiem: God, My Father & the War That Came Between Us",
  "description": "A National Book Award Winner, New York Times bestselling author James Carroll's An American Requiem is \"a tragic, moving book about a family torn apart by the Vietnam War, a young man looking for God, a writer finding his voice\" ( Boston Magazine ). An American Requiem is the story of one man's coming of age. But more than that, it is a coming to terms with the conflicts that disrupted many families, inflicting personal wounds that were also social, political, and religious. James Carroll grew up in a Catholic family that seemed blessed. His father Joe had abandoned his own dream of becoming a priest to rise through the ranks of Hoover's FBI and then become one of the most powerful men in the Pentagon, the founder of the Defense Intelligence Agency. Young Jim lived the privileged life of a general's son, dating the daughter of a vice president and meeting the pope, all in the shadow of nuclear war, waiting for the red telephone to ring in his parents' house. He worshiped his father until Martin Luther King, Jr., the civil rights movement, turmoil in the Catholic Church, and then Vietnam combined to outweigh the bond between father and son. These were issues on which they would never agree. Only after Carroll left the priesthood to become a writer and husband with children of his own did he come to understand fully the struggles his father had faced. In this work of nonfiction, the bestselling novelist draws on the skills he honed with nine much-admired novels to tell the story he was, literally, born to tell. An American Requiem is a benediction on his father's life, his family's struggles, and the legacies of an entire generation.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Biography",
    "History",
    "War",
    "Biography Memoir",
    "Autobiography"
  ],
  "author": "James Carroll",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/107700.An_American_Requiem"
}