{
  "title": "Oltre il varco incantato",
  "description": "Se potesse, Odyssea, sedici anni e nessuna bellezza, chiederebbe molte cose a sua madre. Ad esempio perché da anni sono costrette a vivere come fuggiasche, senza una meta, una casa stabile e, soprattutto, senza un padre. Finché in una tiepida notte d’estate, attraversando un varco incantato nascosto nel bosco, sua madre la riporta a Wizzieville, dove è nata, e lei scopre di appartenere a una cerchia di persone speciali, dotate di rari poteri. Incredula, Odyssea si immergerà in un mondo intriso di magia, dove ogni esperienza – per lei che è sempre vissuta lontano da tutto e da tutti – ha il sapore della prima volta, ma si accorgerà presto, suo malgrado, che dietro la facciata idilliaca e fatata di Wizzieville brulica il Male. Un nemico sanguinario – lo stesso che ha ucciso suo padre dodici anni prima – perseguita la sua famiglia da generazioni ed è tornato sotto mentite spoglie per attuare il suo crudele disegno. Mentre la paura di non essere in grado di gestire i propri poteri arriverà a farle rimpiangere la vita fuori di lì – senza amicizie, né legami né radici – e a temere per l’incolumità di chi ama, terribili, inconfessabili incubi la assaliranno come artigli di un doloroso passato. Come se non bastasse, l’amore la coglie di sorpresa. Il misterioso e impavido Jacko, un giovanotto di poche parole che, a differenza di tutti gli altri, la tratta senza solennità e cerimonie, entra nella sua vita e devasta il suo cuore inesperto. Ma come mai tutti lo temono e lo disapprovano? Può fidarsi di lui? Minacciata da un’oscura condanna, Odyssea dovrà crescere e trovare in sé la forza di difendersi. Non può concedersi errori. Il nemico è in agguato. Potrebbe essere ovunque, potrebbe essere chiunque.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Urban Fantasy",
    "Romance",
    "Magic",
    "Young Adult Fantasy"
  ],
  "author": "Amabile Giusti",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/17268397-oltre-il-varco-incantato"
}