{
  "title": "It's Only Rock 'n' Roll: Thirty Years Married to a Rolling Stone",
  "description": "In this wild, behind-the-scenes portrait of one of the biggest rock bands in history, Jo Wood comes clean about her three decades as the girlfriend and eventually the wife of Rolling Stones guitarist Ronnie Wood. This startlingly honest, laugh-out-loud memoir vividly describes life on tour, in the studio, at the legendary parties—and every raucous moment in between.From teenage model to hard-partying rock 'n' roll devotee, through motherhood, marriage, breakdown, and the challenge of starting over again, Jo Wood has had a roller-coaster ride of a life. At the age of sixteen, Jo burst onto the British modeling scene and became a fixture at London's most glamorous parties. A few years later, just twenty-two years old and a single mom, she met Ronnie Wood and her life changed forever.Holding nothing back, Jo paints an astonishing picture of the sex, drugs, booze, groupies, and—above all—the fun that filled her thirty years as a member of the Stones' inner circle. Telling never-before-heard stories about what life on the road with the Stones was really like, she offers intimate portraits of the band's legendary cast of characters, including Mick Jagger, Keith Richards, Jerry Hall, and Patti Hansen. She recalls the excitement of getting to know international A-list celebrities like Kate Moss, Andy Warhol, Johnny Depp, and Slash.Jo also opens up about her family life with Ronnie: their passionate love affair, the demands of being a mother by day and a wild child by night, and eventually coping with Ronnie's increasingly difficult behavior as his addictions consumed him. For the first time, she reveals her heartbreaking account of what happened when Ronnie left her for an eighteen-year-old waitress, explaining how she was able to forgive, live without bitterness or regret, and find new happiness as an entrepreneur and organic beauty expert.Including never-before-seen photographs from Jo's personal collection, It's Only Rock 'n' Roll is a compelling piece of rock 'n' roll history from a woman with a backstage pass and front-row seat. Enchanting, candid, and moving, this page-turning fairy tale of fame and fortune has the best of the era's many euphoric and reckless moments within its pages.",
  "genres": [
    "Music",
    "Biography",
    "Nonfiction",
    "Memoir",
    "Autobiography",
    "Rock N Roll",
    "Biography Memoir"
  ],
  "author": "Jo Wood",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/17268887-it-s-only-rock-n-roll"
}