{
  "title": "The Kindle Publishing Bible: How To Sell More Kindle Ebooks on Amazon",
  "description": "How To Sell More Kindle Ebooks In 7 DaysI Believe Kindle Publishing Should Be Fun, Profitable And Very, Very EasyIf you want your book to become a Kindle best seller I can show you how!In this best selling book with over 25,000 copies sold, you will learn how Increase Your Book's Amazon And Google Search Traffic By 423% In 30 MinutesIf you're a self-published author without a large platform or following, you will never be able to promote more than the published authors with huge marketing budgets. But you can outrank them on Amazon search every time! Why? Because 99% of Kindle authors don't know how to increase their search engine rankings in Amazon and Google. But I do - and I'm going to show you how in this book (it won't cost you a dime to implement these strategies).Most authors (even the ones with publishers and big marketing budgets) have no idea how to do keyword research, tag their book, add the right search keywords when they publish their book or insert keywords in their book description without it sounding like it was written by a robot.For New Step-By-Step Instructions With Picture TutorialsIf you're a first-time Kindle publisher or technologically challenged then this book is for you! I even had my Grandma Ann Knowles follow the instructions step by step and she gave it a big thumbs up for easy to use instructions. The playing field has been leveled with ebook publishing - and if my Grandma can do it I guarantee you can too!For Existing How To Sell More Books In 5 Days Than You Did Last MonthI'm going to share with you my KDP Select Free Promotion Marketing Formula for getting tens of thousands of readers to download your book in just 5 days. All you have to do is read the Marketing Formula instructions and follow them (it takes about 3 hours of work to get thousands of new readers).How To Sell On Kindle Using Your Book DescriptionIf you think your book is going to sell itself think again! If you're a fiction author or novelist, you have to show your readers the story and engage them in it or they won't buy a book from an unknown author. And if you're a non-fiction author, you have to tell potential readers how your book is going to help them solve their problem fast or they'll click away without buying. I'm going to show you the Show And Tell system for selling more books on Kindle by giving you readers what they want and overcoming objections in your book description!Kindle marketing isn't about having a big marketing budget or publisher behind you - but you still need exposure and a great offer. This book will help you with get more exposure with Amazon search and other great marketing tips.You also have to make buying your book an irresistible offer so that when browsers get done reading your book description they say, \"I have to buy this book!\" You can't do that without a strategic plan and a well-written book description.Bonus! Video interviews with best-selling Kindle authors as they share their coveted book marketing strategies.About The AuthorMy poetry was first published at age 16 in Teen Ink magazine and I started writing books at age 19 but had no idea how to get my message out to anyone other than my friends and family. Finally, I discovered Amazon's Kindle Publishing platform and published my first book on Kindle on February 10, 2012.Since then, I've sold tens of thousands of ebooks on Kindle and now earn a full-time income as a part-time Kindle author. I've since helped hundreds of self-published authors like myself sell more books on Kindle. If I can do it you can too!Learn how to sell more books on Amazon today. Scroll up and grab your copy today.",
  "genres": [
    "Writing",
    "Nonfiction",
    "Reference"
  ],
  "author": "Tom Corson-Knowles",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/17271424-the-kindle-publishing-bible"
}