{
  "title": "Dead Lines",
  "description": "With his acclaimed novels Darwin’s Children and Vitals , award-winning author Greg Bear turned intriguing speculation about human evolution and immortality into tales of unrelenting suspense. Now he ventures into decidedly more frightening territory in a haunting thriller that blends modern technology and old-fashioned terror, as it charts one man’s inexorable descent into a world of mounting supernatural dread.For the last two years, Peter Russell has mourned the death of one of his twin daughters—who was just ten when she was murdered. Recent news of his best friend’s fatal heart attack has now come as another devastating blow. Divorced, despondent, and going nowhere in his career, Peter fears his life is circling the drain. Then Trans comes along. The brainchild of an upstart telecom company, Trans is (as its name suggests) a transcendent a sleek, handheld interpersonal communication device capable of flawless operation anywhere in the world, at any time. “A cell phone, but not”—transmitting with crystal clarity across a newly discovered, never-utilized bandwidth . . . and poised to spark a new-technology revolution. When its creators offer Peter a position on their team, it should be a golden opportunity for him. If only he wasn’t seemingly going mad.Everywhere Peter turns, inexplicable apparitions are walking before him or reaching out in torment. After a chilling encounter with his own lost child he begins to grasp the terrifying Trans is a Pandora’s box that has tapped into a frequency not of this world . . . but of the next. And now, via this open channel to oblivion, the dead have gained access to the living. For Peter, and for humankind, a long, shadowy night of the soul has descended, bringing with it the stuff of a horrifying nightmare from which they may never awaken.By turns spine-tingling, provocative, and heart-wrenching, Dead Lines marks a major turning point in the consistently dazzling storytelling career of Greg Bear. Alongside its hero, Dead Lines peers into the darkest place we can imagine and wonders—fearfully—what might be peering back.From the Hardcover edition.",
  "genres": [
    "Science Fiction",
    "Horror",
    "Fiction",
    "Thriller",
    "Fantasy",
    "Audiobook",
    "Supernatural"
  ],
  "author": "Greg Bear",
  "average_rating": "3.13",
  "url": "https://www.goodreads.com/book/show/172739.Dead_Lines"
}