{
  "title": "Dead Trees",
  "description": "Undergrounders have risen from the belly of the planet to wreak havoc on humanity. They hunt in darkness, dragging bodies into tunnels teeming with primitive life. Elise is a widowed mother trying to keep her daughters alive, but bloody battles with beasties define survival road. Even when Elise finds Jason – a strong, capable man – she feels no safer, no more confident that her babies will see a tomorrow. Barely staying alive becomes the norm.Against all odds, Elise and her group reach a sanctuary. Yet there is no rest for the weary.Doctors O’Toole and Peters have been experimenting on the humanoid monsters… but they aren’t interested in saving humanity. Elise assists them reluctantly, all the while working secretly with Nick and Jamie to return the world to what it once was—Before the undergrounders came out to play on the surface. (Dead Trees is a classic dystopian, post-apocalyptic, Sci-Fi novel. It contains scenes of graphic violence, mild romantic elements, and some foul language).-------------------Reader Comments: \"I must congratulate you on what looks to be a well crafted story. Well written, too. You have obviously put a lot of thought and effort into your writing and it shows.\" -John P. Authonomy Reviewer\"What a nice change from zombies, vampires, trolls, aliens and giant earthworms. Quadruped humanoids who eat their dead are certainly monstrous enough to qualify for the role of abomination bent on killing off humankind. Your protagonist, Elise, using the first person POV makes the narrative introspective and immediate- a sympathetic character worth cheering on from one impossible situtation to the next. The dialogue is to the point, even raw at times, but always true to character. Thank you so much for the intriguing read.\" -Ken E.L. Authonomy Reviewer\"I'm à huge fan of sci-fi and the occasional zombie stories. Though this didn't have zombies per se, there was the same feel to it. With very few inconsistencies, it was a story that can keep you interested in finding out what happens next. Whenever you think things are becoming \"normal,\" it gets the adrenaline rushing all over again. It was nice to have a strong female lead in the story! I can easily see this being made into a movie. Very entertaining and I was sorry to have it end.\" Donna Davis - Amazon Reviewer",
  "genres": [
    "Horror",
    "Dystopia",
    "Post Apocalyptic",
    "Adventure",
    "Action",
    "Survival",
    "Science Fiction"
  ],
  "author": "Eli Constant",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/17274511-dead-trees"
}