{
  "title": "Tornado Valley: Huntsville's Havoc",
  "description": "Touchdown! Folks in Alabama don't know whether to cheer or run when hearing the expression. Touchdown could mean that we've just won another football National Championship or it could indicate that a tornado is on the ground. I could never be a storm chaser. I'm the one the storm chases. Funnels circle around me like shark fins as I bow my head in a school hallway, kneel down in a convent, or give birth to a newborn baby wailing in unison with the tornado sirens. I huddle with toddlers in showers and beg for shelter in a McDonald's freezer. I remain a sitting duck in a second-floor apartment, and find myself in the wrong place at the wrong time while in the emergency room with storm victims. Life in the Rocket City is a thrill ride which is not for the faint of heart, this I know. So brace yourself for a front row seat on a ride through Tornado Valley! Alabama is the home of the world's deadliest twisters, and Huntsville is in the heart of the arena. Our space history is out of this world, but our tornado history will blow you away. Take a rollercoaster ride through the history of Alabama tornadoes before plunging into the gripping story of the Day of Devastation. Witness the stars falling on Alabama in 1833. Then get ready for the sky to fall! The plot twists as Huntsville's torrid tornado past comes alive in the 1974 Super Tornado Outbreak. The rollercoaster corkscrews as it encounters an unexpected twister in 1989 that slingshots the reader into the angry vortex on Airport Road. The ride cruises before taking another gut-wrenching dive that catapults its riders into an inverted twist from yet another Anderson Hills tornado in 1995. The town turns upside-down but Huntsville survives, revives, and thrives. But the worst is yet to come. Another tornado season is just around the corner. Beware of the month of April, especially on a Wednesday. The warning sirens wail, we're bombarded by softball-sized hail, and an EF3 tornado slams into the jail. It's just another day in Alabama, but the countdown clock is ticking. The next tornado warning could be \"the one.\" Our voice drops to a whisper when we mention an EF5. We realize life is too short. The coaster accelerates. Here comes the torque. We have no idea what's around the next bend. Suddenly, the nightmare comes true as the ride zooms out of control, this time in a free-fall on April 27, 2011. Alabama is bombarded by a record 62 tornadoes in one day. Abruptly, the ride comes to a screeching halt. The adrenaline rush subsides. You've just experienced Huntsville's Havoc. Immediately the passengers ask one another, \"Do you want to ride again?\" Some will and some swear, never again.",
  "genres": [
    "Nonfiction",
    "History"
  ],
  "author": "Shelly Van Meter Miller",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/17274689-tornado-valley"
}