{
  "title": "Justified Means",
  "description": "The Agency Files:Whatever it takes: the motto of “The Agency.” It doesn’t exist–not legally speaking. However its effect in the lives of those who benefit from their aid is incalculable. Lives saved, restored, guarded–protected from the side of life most never see. Their clients are usually wealthy, important–desperate. Their other clients–well, they don’t always appreciate the efforts expended on their behalf–not until they aren’t lying on a slab in the morgue.Justified Means~Erika Polowski, in grave danger–danger she has no idea exists,finds herself captive, shackled, bound, gagged. Her captors have the most unbelievable story, yet as the enemy manages, time after time, to get too close, she has to decide who or what to trust. Can she believe the man who daily holds her at gunpoint? Does she trust her gut? She is certain that she knows nothing that could possibly matter to anyone–has done nothing that should put her in danger.For Keith Auger, it’s just another assignment. Extract the client, protect the client, return the client to her life with minimal interruption. Except that this “client” isn’t so keen on being protected. His usual cheerful demeanor disappeared the night he helped her escape from her home–escape with the aid of duct tape, rope, and the dark of night.His faith seems incongruous with his job. Her feisty personality might just keep her alive–if he can’t. How long can they stay one step ahead of their pursuers? How long can he protect her when every move they make seems only half a step behind those who want Erika dead. Why can’t they get a break?The only answer is the one thing that he fears most. Is there a mole within The Agency?",
  "genres": [
    "Suspense",
    "Christian Fiction",
    "Mystery",
    "Fiction",
    "Christian",
    "Romance",
    "Contemporary"
  ],
  "author": "Chautona Havig",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/17274757-justified-means"
}