{
  "title": "Lord of Fire, Lady of Ice",
  "description": "Medieval Historical Romance127,000 Words\"She found herself unimpressed with him, having expected more of the legendary man--Brant. Lord Blackwell. Brant the Gladiator. Brant the Vigorous. Brant the Flame. Brant the Viking Hero. Della snorted in unladylike disgust. More like, Brant the Thorn in my Arse!\"Lady Della the Cold-HeartedLady Della despises all things Viking. They may rule the land, but they will never rule her. Unfortunately, her father doesn't seem to agree. To prove his continued allegiance to the Viking king, the Ealdorman of Strathfeld betroths his only daughter to a respected Viking Lord--a warrior who's legendary prowess isn't reserved for the battlefield. Fighting the newfound craving in her body and the unwelcome fire in her heart, Della must choose between everything she knows to be true and the one thing she never expected...Lord Brant of Blackwell, the Fiery OneLord Blackwell is as fiery on the battlefield as he is in his passions. He has fought valiantly for King Guthrum and has earned the respect of the nobles. When his overlord offers the hand of his beautiful daughter and the right to inherit his lands, Blackwell can hardly refuse. However, he soon discovers that his noble bride is anything but the meek and mild woman he envisioned for his wife. One minute she's kissing him back, the next she's swearing to do whatever it takes to dissuaded him from their marriage. Can his lust for life and his new bride melt the ice that surrounds her heart? Or will Lady Della the Cold be this warrior's undoing?Length: Long NovelHeat Level: Very SensualThis novel contains adult content. Mustbe 18 years or older to read.",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Medieval",
    "Audiobook",
    "Historical Fiction",
    "Fantasy"
  ],
  "author": "Michelle M. Pillow",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/17275809-lord-of-fire-lady-of-ice"
}