{
  "title": "Pendelton Manor",
  "description": "Haunted by memories of her beloved daughter, Sophie Turner leaves Arizona for a new position in Maine as housekeeper in Pendelton Manor. Arriving late, she walks in on a threesome between her boss’s cousin and two friends. Embarrassed, she hides while peering in on the group and growing more turned on by the sight. Sophie wonders if she should announce her arrival or run back the way she came. Soon, however, the trio discovers her and makes their introductions while Sophie tries to hide her mortification at getting caught watching the orgy.Her first meeting with her boss, widower Adrian Pendelton, leaves her with a feeling of empathy and arousal for this cold, brooding man who has clearly suffered the pain of loss as she has. Not wanting to give up on the new position and the excitement of living in a new town, Sophie decides to give the housekeeping position a try, though she is quite leery about the people who inhabit the manor and their wicked ways.Soon, Sophie gets to know the family members of Pendelton Manor and the scandal that rocked the foundation of the household. Adrian suspects someone had been having an affair with his wife shortly before her suspicious death. Sophie cannot believe any of the wonderful people she's met would be responsible for it, but does her best to stay out of it.Sophie soon finds her self-enforced celibacy coming to an end when she is lured into the sexually deviant parties held by Adrian, his cousins and the women who hang around them. Discovering her wild-side, it brings her closer to confronting Adrian with her growing desire for him.Can Sophie warm up the cold-hearted Adrian? Will he see her as more than a housekeeper and as an actual eye-catching woman? Can they solve Adrian's wife's death while distracted by their carnal attraction?BJ Wane proves once again she is the mistress of spanking stories with this wonderful tale of mystery, intrigue and sumptuous sex. Includes: spanking, threesomes, lesbian scenes, anal sex, oral sex, multiple partners and so much more!",
  "genres": [
    "BDSM",
    "Erotica"
  ],
  "author": "B.J. Wane",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/17278072-pendelton-manor"
}