{
  "title": "Sizzle",
  "description": "Librarian's Note: This is an alternate title and cover edition of ASIN B00E3VT93GThalia is twenty-one and has just finished her sophomore year of college, and is trying to avoid going home to her stifling parents who have a curfew of nine every night, and have a bad habit of treating her like she's still ten years old. Her new boyfriend, Liam, invites her to spend the summer with him and his family, so as she’s been unable to find a local job to keep her at college, Thalia jumps at the chance. Liam tells her that she can be his guest at his brother, Jack’s, wedding at the end of the summer.Jack is twenty-five and feels as though he’s drowning. He’s engaged to Mia, against his will, because it’s always been drilled into him, family comes first. Jack’s studying for a law degree, and wants to go out on his own once he graduates, specializing in criminal law. His father wants him to accept a junior partnership in the law firm owned jointly by him and Lewis, his fiancées father, to practice family law.Then he meets his brother’s girlfriend, Thalia, and he can’t get her out of his head. He needs her to keep her distance, because every time she smiles in his direction, he wants to carry her to his room and do really naughty things to her.Then Saturday night arrives and Liam takes Thalia to a new bar that has opened on the outskirts of town, where she discovers Jack’s big secret. By day he’s the good looking, slightly older brother with a chip on his shoulder, who gives her hot looks, and by night he’s Phoenix, singer/guitar player for bad boy group ‘Deception’, who makes her sizzle to the core!He has muscle.He has tattoos.He has piercings.He has a mouth that makes her panties wet every time he opens it. He is supposed to be getting married.He is also her boyfriend’s brother....Read Thalia’s story in Sizzle, book one of Summer Bad Boy Rockers Series. Coming July 2013.",
  "genres": [
    "Romance",
    "New Adult",
    "College",
    "Music",
    "Contemporary Romance",
    "Contemporary",
    "Erotica"
  ],
  "author": "Lexi Buchanan",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/17278581-sizzle"
}