{
  "title": "Feed Your Brain, Lose Your Belly",
  "description": "<!--[if gte mso 9]> <![endif]--><!--[if gte mso 9]> Normal 0 false false false EN-US X-NONE X-NONE <![endif]--><!--[if gte mso 9]> <![endif]--><!--[if gte mso 10]> /* Style Definitions */ table.MsoNormalTable {\"Table Normal\"; \"\"; 5.4pt 0in 5.4pt; %; \"Calibri\",\"sans-serif\"; \"Times New Roman\"; } <![endif]--> Stay slim and mentally sharp by choosing foods that keep your waistline trim and your brain well fed. Renowned neurosurgeon Larry McCleary, M. D., became fascinated by the paradox of the fattening of America and the brain starvation he was seeing in aging brains. His research led to this innovative Calories you consume are bypassing your brain and being stored in fat cells. In Feed Your Brain Lose Your Belly, he reveals how ''sticky'' fat cells send mixed messages to your brain, causing you to experience persistent hunger, to overeat, and to gain weight as a result. If you are ready to get in touch with the signals your body generates so that you work with, not against, your innate metabolic machinery, this book is the tool you've been seeking. Weight loss will be easy as you keep hunger at bay while providing your brain with the high-octane fuel it thrives on. Feed Your Brain Lose Your Belly pairs its advice with 7 days' worth of helpful meal plans and plenty of delicious recipes. Dr. McCleary's counterintuitive perspective on the benefits of brain-healthy fat consumption--supported by clinical testing with a group that called themselves the ''Biggest Losers''--will help you make critical decisions about your diet. Learning to choose foods that prevent the production of sticky fat cells rather than forcing yourself to eat less is the best way for you to feed your hungry brain cells and stay thin.",
  "genres": [
    "Health",
    "Self Help",
    "Nonfiction",
    "Food",
    "Neuroscience",
    "Brain"
  ],
  "author": "Larry McCleary",
  "average_rating": "3.35",
  "url": "https://www.goodreads.com/book/show/10771121-feed-your-brain-lose-your-belly"
}