{
  "title": "Archangels: Rise of the Jesuits",
  "description": "When control of the Vatican is at stake--money talks, and nobody plays fair.The murder of a Jesuit priest and church financier thrusts investigator Michael Visconte into a web of Vatican conspiracy and intrigue — with deadly consequences.Tavakoli's pulse-pounding thriller predicted a pope would step aside, and for the first time in the history of the Catholic Church, a Jesuit would rule the Vatican. This mesmerizing murder mystery combines authentic history with riveting suspense of first-class fiction.When Jesuits recruit Italian intelligence specialist Michael Visconte to investigate the brutal murder of a young priest, he discovers the crime is tied to his personal complicated past and to his ongoing investigation into the money laundering operations of the Archangeli, a secret society inside the Vatican.Michael enters the enclave of the extraordinary men known as the Society of Jesus who practice memory arts, hypnotism, and spiritual exercises, and he uncovers multi-layered conspiracies involving hackers, high-finance, tax evasion, political intrigue, and blackmail.His lucky break—one that should provide critical evidence—blurs the line between good and evil and not only endangers the lives of Michael and the Jesuits, but also imperils the lives of his wife and children.Tavakoli weaves a rousing tale of murder, embezzlement, psychological manipulation, and ultimate power.\"Conspiracies within conspiracies...a fast-paced thriller.his fast-paced thriller.\"Publisher's WeeklyFrom the Back Cover\"A word of advice, Mr. Visconte. This is Vatican business. It's dangerous to forget that.\"Michael Visconte never forgot the Vatican Bank's $250 million payoff to the defrauded depositors of Banco Ambrosiano or the murder of Roberto Calvi. The fresh corpse at his feet told him it was far from over. He thought he already knew the consequences of double-crossing the Vatican.But that was before he agreed to help the Jesuits blackmail the Pope...This is an alternate edition for ISBN-10: 0985159022ISBN-13: 978-0985159023",
  "genres": [
    "Mystery",
    "Thriller",
    "Fiction",
    "Amazon",
    "Historical Fiction",
    "Suspense",
    "Mystery Thriller"
  ],
  "author": "Janet M. Tavakoli",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/17279868-archangels"
}