{
  "title": "Elizabeth's Bondage Boxed Set",
  "description": "All 5 Sexy Stories in the Elizabeth’s Bondage Series in One Boxed Set!Elizabeth's Erotic Bondage (Sex Stories #1)Elizabeth and her husband Mark arrive in Las Vegas to celebrate their first wedding anniversary in style. But their celebrations quickly take an unexpected turn when Elizabeth wakes up naked and tied to a bed with no recollection of what happened. Where is she? Where is her husband? And who is the strangely seductive captor of hers? And so begins Elizabeth's and Mark's journey of sexual discovery through bondage, submission and domination.Sex Stories 2: Elizabeth's Anal Submission (Sex Stories #2)Anal toys, bondage, and shower sex. Elizabeth is further seduced by her captor, \"Sir\" and becomes sexually awakened through bondage and domination during sex. Having never experienced BDSM she now finds that it is what has been missing from her marriage. Elizabeth finds herself unintentionally confessing things to \"Sir\" that she has never told anyone, not even her husband Mark. For a start she has been faking orgasms. But how can she tell her husband that? Or that \"Sir\" really gets her off? Sex Stories 3: Elizabeth's Pain and Pleasure (Sex Stories #3)Bondage, spanking, nipple clamps, vibrators, riding crops and VERY hot chocolate! Our prisoner is given a choice, and finds that she chooses to submit completely to her sexy captor, \"Sir.\" For some strange reason she trusts him. Elizabeth's inability to climax is a thing of the past. In this book Elizabeth discovers indescribable pleasure through sex. Meanwhile her captive husband, Mark, gets some training from \"Sir,\" too.Sex Stories 4: Elizabeth's Cherry (Sex Stories #4)Corsets, cuffs, and canes. \"Sir\" having stretched Elizabeth's derrière through the use of butt plugs and vibrators, finally takes Elizabeth's anal cherry. Yet the seductive kidnapper gets far more than he expected. Not to mention real difficulties with Elizabeth's husband Mark. What is in Mark's past that makes him so dangerous?Elizabeth's Love Ties (Sex Stories #5))Elizabeth has lots of secrets she doesn't want her husband to find out, and she is worried that she might be forced to tell him. Mark however, already knows all her secrets – and there is going to be trouble. Will Sir and Mark come to blows? Will Mark and Elizabeth's abduction end in divorce? Or will it all be resolved with a delicious Ménage à Trois?Elizabeth’s Bondage is XXX erotica for women, and is definitely for adults only! If you are into hot and sexy stories, and don’t mind Sex Toys, Anal Sex, Oral Sex, Rough Fucking, Rope Bondage Stories, Submission and Domination, Spanking, BDSM Stories, Handcuffs, Hot Wife Stories, and the occasional MFM Threesome, then this might be just the series for you. If you like adult stories with a bit twist, then you should definitely try the ‘Elizabeth’s Bondage’ collection!",
  "genres": [
    "BDSM",
    "Erotica",
    "Romance",
    "Menage",
    "Adult",
    "Contemporary Romance",
    "M F M"
  ],
  "author": "Nikki Sex",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/17280329-elizabeth-s-bondage-boxed-set"
}