{
  "title": "Tove Jansson. Mama Muminków",
  "description": "Genialne książki dla dzieci są genialne nie bez powodu. Stoi za nimi niezwykła siła osobowość autorów. Talent, jaki zdarza się raz na milion - tajemniczy splot okoliczności, rodzinnego bagażu, determinacji, młodzieńczych zranień, rozczarowań i pasji.Czyżby istniała - myślimy - jakaś tajemna recepta na bestseller, który swobodnie przekracza granice? Jaka sekretna ingrediencja, która czyni fabułę nośną na wszelkich krańcach świata?Muminki podbiły serca ludzi w każdym wieku, na wszystkich kontynentach. A zatem - zgadujemy - sekret kryje się w biografii? Może, wziąwszy życiorys Tove pod lupę, znajdziemy kluczowy punkt - tę magiczną chwilę, kiedy młoda malarka z perkatym nosem przemieniła się w sławną na całym świecie „Mamę Muminków”? Czego trzeba było, aby trafić w sedno (nienazwanych, domyślnych) potrzeb małego czytelnika? Co wyzwoliło ukryty potencjał pisarki?... Trauma? Olśnienie? Miłość?...Do tej pory czerpaliśmy wiedzę o Tove z okruchów - z gazetowych rewelacji i nużąco przewidywalnych „szkolnych” wypracowań dziennikarskich. Niektóre detale życiorysu pisarki zostały wyeksploatowane do cna, polerowane tak długo, aż zatraciły sens i kształt. I oto - hurra! - mamy grubą jak cegła, rzetelną i drobiazgową biografię, sporządzoną w oparciu o ogromne archiwum domowe, jakim po śmierci pisarki opiekowała się Tuulikki Pietilä - życiowa partnerka Tove (nota bene - pierwowór muminkowej Too-tiki). Ten papierowy skarb i wszystkie sekrety powierzone zostały, po śmierci pisarki, profesor Boel Westin - zaufanej przyjaciółce domu, znanej literaturoznawczyni, która doktoryzowała się w oparciu o dorobek literacki Jove Jansson.Pamiętniki pisarki, pisane przez niemal całe życie, tysiące listów, a nawet szpargały i notatki - wszystko to posłużyło autorce biografii do sporządzenia „mapy” długiego, bardzo pracowitego i twórczego życia Tove. Jest to zapis rzeczowy - jak to mapa. Autorka unika wartościowania, nadinterpretacji i zbyt pochopnych sądów. Jest lojalna wobec pisarki, która własne dzieciństwo i atmosferę domu zawarła w przetworzonej literacko, subiektywnej kreacji - w książce „Córka Rzeźbiarza”. Mamy zatem dwa wiarygodne źródła wiedzy o Tove: Jedno, pisane „ze środka” - emocjonalne, zmysłowe, osobiste... ale też rozmyślnie ubrane w kostium cudzego losu, nie aspirujące do bycia autobiografią. I drugie - pisane „od zewnątrz” - solenne, zbudowane na korespondencji i dziennikach - odwołujące się do faktów bardziej niż do uczuć. Ten rozległy „portret życia” systematyzuje i objaśnia fenomen niezwykłej pisarki. Szkicuje tło - dla nas egzotyczne, bo odległe kulturowo. Rodzina Jansson była przecież częścią fińskiej bohemy - bardzo szczególnym klanem, spajanym artystycznymi aspiracjami. Ale i podzielonym różnicami światopoglądowymi, które silnie pogłębiły się podczas wojny. Boel Westin odsłania to, co w doświadczeniu wybitnej artystki, jaką była Tove, wspólne, ludzkie, sprytnie zaszyfrowane w baśniowej metaforze, a co z jej książek uczyniło ponadnarodowy, uniwersalny kanon literacki. Waham się dopisać „dla dzieci”, jako że zalety tej literatury są ponad-generacyjne, adresowane także do czytelnika dorosłego. Niesłusznie redukowana do roli „Mamy Muminków” Tove Jansson była w istocie znakomitą pisarką dla każdej generacji, czego dała dowody w swoich „dorosłych” książkach („Lato”, Podróż z małym bagażem”).Dzięki biografii Boel Westin możemy tropić ścieżkę spełnionego życia pisarki, która posiadła sekret literackiego „esperanto” - języka zrozumiałego dla wszystkich dzieci... I wszystkich trolli.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Art",
    "Finnish Literature",
    "Biography Memoir",
    "History",
    "Scandinavian Literature"
  ],
  "author": "Boel Westin",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/17280933-tove-jansson-mama-mumink-w"
}