{
  "title": "When I'm with You: When You Trust Me",
  "description": "Part 6 in new 8 part serial.The next serial sensation from Beth Kery, New York Times and USA Today bestselling author of Because You Are Mine. New York Times bestselling author Beth Kery's blistering new novel of a man and woman bound by the scandalous secrets of the past--and by the sexual hunger that still fuels their uncontrollable desires...Restaurateur and self-exiled heir Lucien Lenault's first look at the breathtaking young chef trainee for his trendy Chicago restaurant is a shock. She's Elise Martin, daughter of a wealthy French fashion designer. She's also the holder of a secret that could explode his carefully laid plans.Notorious for her flagrant exhibitionism, and for flouting the respectable façade of her aristocratic background, the coquine's wild streak shocked most people. Not Lucien. He was tempted by it. It was a deliriously punishable offense as far as Lucien was concerned. But taking on Elise is more than a game. She's a catastrophe waiting to happen, an inferno that's burned many a lover. Lucien isn't most men, however, and he won't allow her to manipulate him. In order to control the defiant beauty--in order to see her submit--he's going to have to willingly walk in the flames...More to come. Don't miss When I'm With You, Part II, available 3/12***Dear Reader,When I'm With You continues the story begun in Because You Are Mine, although this time the camera lens is focused on Lucien and Elise, whose undeniable and scorching desire for one another burns away surface facades, revealing secrets that will forever change Lucien, Elise, Ian and Francesca's lives. Please note that like Because You Are Mine, When I'm With You will be released in eight parts, each installment debuting weekly. I hope you enjoy watching Lucien and Elise's romance unfold, seeing Lucien's immense control tried by the irrepressible Elise, while the self-indulgent Elise is challenged sexually and emotionally by Lucien into fulfilling her full potential as a giving, caring and vibrant woman.Look for more of Ian's and Francesca's love story in Because We Belong, out in November of 2013.Happy Reading!~Beth***",
  "genres": [
    "Erotica",
    "Romance",
    "Contemporary Romance",
    "BDSM",
    "Contemporary",
    "Erotic Romance",
    "Adult"
  ],
  "author": "Beth Kery",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/17281163-when-i-m-with-you"
}