{
  "title": "Holy Warriors: A Journey Into the Heart of Indian Fundamentalism",
  "description": "No other nation has witnessed as much proselytization or heard as many war cries in the name of God as has India. Hindus have fought Muslims, Christians have sought to convert animists, Sikhs have armed themselves against Muslims, and Muslims have declared jihad on the kind of Hindu that took delight in the demolition of the Babri mosque. Here in India, writes journalist Edna Fernandes, there is evidence that every religion can be hijacked by the forces of fundamentalism. Fernandes travels to the country’s recent and past theatres of fundamentalism—from Kashmir to Gujarat, Punjab to Goa—to meet the generals and foot soldiers of communal wars, and lets their rage and rhetoric speak for them. The Imam of Delhi’s Jama Masjid calls upon his co-religionists to form militant squads to combat persecution by Hindus. In Nagaland—as in Kashmir—what was once a political insurgency is now a holy war, and armed Baptists demand a separate homeland for Christ. Twenty years after the storming of the Golden Temple and the anti-Sikh riots, an Akali leader in Amritsar cannot forgive, and speaks of continuing the fight for Sikh honour—‘Sometimes through the pen. Sometimes down the barrel of a gun.’ And in shakhas across India, Hindu hardliners ready themselves for the final ethnic cleansing. There are as many stories of prejudice and violence in these pages as there are of insecurity and despair. But they are told by an investigative writer who has readied herself to hear out all with understanding, tolerance and even humour. Examining India’s contemporary history of rabble-rousing and worse, Fernandes has written an important book about the compulsions and consequences of bigotry. ‘The cancer of religious bigotry and intolerance has afflicted all communities—Hindus, Muslims, Sikhs and Christians. This is vividly brought out in Edna Fernandes’s powerful book. Holy Warriors is as fair and objective an assessment of the perils that lie ahead for India as any that I have ever read. It is a must for all of those who wish this country to prosper as a secular democracy.’ —Khushwant Singh",
  "genres": [
    "History",
    "Nonfiction"
  ],
  "author": "Edna Fernandes",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/1077184.Holy_Warriors"
}