{
  "title": "L'invasione dell'America. Indiani, coloni e miti della conquista",
  "description": "Il libro di Francis Jenning è diventato il modello di una radicale revisione della storiografia dell'America coloniale che sta modificando l'immagine tradizionale della conquista e della \"civilizzazione\" del Nuovo Mondo da parte degli europei e in particolare da parte degli inglesi. L'autore muove da una critica dei presupposti ideologici presenti nella formidabile documentazione prodotta dall'espansionismo europeo, a partire dalle Crociate fino al culmine del colonialismo settecentesco, mettendone in risalto il carattere unilaterale e strumentale: la religione come il diritto, l'erudizione come l'iconografia contribuivano a collocare \"l'altro\" - il pagano, il selvaggio, l'antropofago e l'amerindo cui tutti questi caratteri venivano addebitati - in una specie di limbo umano, definibile e appropiabile a piacere da parte della forza superiore. Non solo: questi condizionamenti gettano la loro ombra al di là del periodo coloniale, per invadere lo stesso mito costitutivo dell'America moderna, quella \"teoria della frontiera\" che dall'opera tardo-ottocentesca di F.J. Turner in poi tanto ha contribuito a plasmare l'autocoscienza di tutta una cultura. Ai capisaldi di questa radicata visione storica Jennings oppone essenzialmente due prospettive: la prima chiama in causa non una comunità soltanto, quella evoluta e superiore che detta legge ovunque, ma due comunità che si studiano e si compenetrano; non uno ma due popoli e due culture, l'europea e l'amerindiana, enormemente distanti tra loro eppure necessariamente complementari, addirittura cooperanti nell'insediamento e oltre; due comunità che a dispetto di un corpo documentario tutto parziale, entrano insieme nella storia moderna, e insieme la costruiscono, atrraverso lo scambio capillare di conoscenze e di tecniche fino ad allora indipendenti, attraverso il commercio e la caccia, attraverso, in una parola, una reciproca, intensa acculturazione.",
  "genres": [
    "History",
    "American History",
    "Native American",
    "Nonfiction",
    "Indigenous",
    "Native American History",
    "American"
  ],
  "author": "Francis Jennings",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/10771867-l-invasione-dell-america-indiani-coloni-e-miti-della-conquista"
}