{
  "title": "Because of You",
  "description": "Brady Marshall has made a career of playing it safe. When he decides to do something rash and becomes a Navy SEAL, he thinks he's finally escaped the rigid structure of the high society life his parents forced down his throat. All he does is trade in one set of rules for another. He follows military protocol to a T, but it still results in the death of an entire team of Navy SEALS and puts his best friends directly in harm's way. He’s struggled to stay afloat and not drown in grief, guilt, and booze, but he's losing that battle quickly. When his baby sister flees her abusive husband and shows up on his doorstep with his young niece in tow, he has no choice but to clean up his act. He will stop at nothing to protect them and never let them down again, even if it means taking a job that goes against everything he believes in. If protecting a pop star princess who thinks she's better than everyone means he can keep a roof over their head, what other choice does he have? Layla Carlysle has lived a life of luxury. She's been a star since the young age of fifteen, and every record she releases shoots straight to the top of the charts. She has people surrounding her every single day telling her how amazing she is, how beautiful she is, and how lucky she is, but she’s never felt more alone in her entire life. She wants nothing more than to break free and do what she really wants to do: write her own music, sing her own songs, and find a way to finally be happy with her life. The only thing standing in her way is her mother, Eve Carlysle. Eve has controlled every single aspect of her daughter’s life and will stop at nothing to achieve fame and fortune, even if that means using her daughter to get there. When an overly-amorous fan’s letters become increasingly more sinister, Brady will have to suck up his opinion of how the other half lives to take the job seriously. The pair will need to learn to trust each other and put aside their differences before the letters become a reality and someone’s life is in jeopardy. Brady has been to hell and back, and he refuses to let anyone else get close to him again. Layla has never lived her life for herself, and the emptiness is threatening to break her for good. Sometimes our lives are already planned for us, but because of you, all of that could change in an instant.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "New Adult",
    "Military Fiction",
    "Romantic Suspense",
    "Contemporary",
    "Suspense"
  ],
  "author": "T.E. Sivec",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/17281845-because-of-you"
}