{
  "title": "Thirteen for Dinner",
  "description": "Averie Cooke is bribed to sit in as the fourteenth guest at an exclusive dinner party, in order to rescue the other attendees from bad luck. But it’s Averie who needs rescuing when all hell begins to break loose.   Averie Cooke has never set foot on the old Faulkner plantation. The macabre history surrounding it is what keeps her away; not to mention everyone says the place is haunted. A hundred and fifty years ago Lunar Wilson was hung there. His lifeless body dangled in the breeze along with the gray Spanish moss. Later that same night, the petite southern belle, Emily Faulkner wrapped a thick rope around her delicate neck and joined her lover in the afterlife. Legend says all hell broke loose after that. Unaware that their only daughter was hanging dead up in the cupola, Emily’s parents continued on with their festivities, gorging themselves on prime rib, and guzzling expensive wine. They were pretty drunk by the time the Wilson boys burst inside the house slinging their hatchets, vindicating their brother’s murder. They decapitated James Faulkner, his socialite wife, Elizabeth and dismembered all eleven dinner guest. The massacre was the bloodiest ever recorded. \tSo why does Averie agree to attend a dinner party in the same mansion where the massacre took place? She needs the money that’s why. But, she gets much more than a paycheck when she and another mysterious guest transports back to the year 1859, exactly one month before the gruesome event. Things go from bad to worse when she discovers the only way back home is to stop the murders. But can she put her fears aside long enough to change the past and find life in the place she fears the most?Thirteen for Dinner is a page turning thriller that will have you on the edge of your seat one minute, laughing out loud the next, and crying while you contemplate the meaning of life. Dealing with issues such as racism, slavery, hatred, and fear you’ll discover the only weapon that has the power to damage them all is love.",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Paranormal",
    "Fiction",
    "Horror",
    "Time Travel",
    "Fantasy"
  ],
  "author": "Denise Daisy",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/17282821-thirteen-for-dinner"
}