{
  "title": "The Earth Girl and Queen Eliza",
  "description": "The Earth Girl and Queen Eliza is about the first generation of young adults who grew up on humanity’s first space colony. Adeena Frias is the “Earth Girl” who meets and befriends a group of them, and then the characters act out the answer to this how would the residents of a space colony react to the sudden death of their Mother Earth? Fundamentalist religions gain power; there is panic and denial amidst strangely ordinary days, and the characters form loyal, desperate bonds.This is also a story with moments of lightness and humor. Soon a gentle alien queen offers to share her planet with the human refugees, a decision that causes adventure, mayhem, and disaster. In the end, Adeena gains great insight into her life and her place in the natural world.This is how the story People have been asking me to tell my story, and I agree that my memories should be a part of the new nation's permanent records. I hope that the future generations of our new planet will be interested in what I've experienced. So far my life has been a fascinating ride. I lie in bed many nights, sleepless, and marvel at the events that brought me here. I used to daydream about being a famous author, as many people do. I just didn't think I'd become one in quite this way!My name is Adeena Frias. At age sixty, I am the last surviving Human who was any part of ordinary daily life on Planet Earth, although my grandparents were the last real generation of land-dwellers. My existence on Earth was in name only, like a game-player's \"relationship\" with his electronic friends on the big surround-screen. I'd never even felt a natural breeze on my face when I lived on Earth. If only my grandparents, instead of me, were around to tell their stories about life on our mother planet. But I am all that is left.How do I begin to tell about the history that I've seen? This is a story about the events I experienced when I was nineteen . . .",
  "genres": [
    "Science Fiction",
    "Fantasy",
    "Young Adult"
  ],
  "author": "C.C. Alma",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/17283924-the-earth-girl-and-queen-eliza"
}