{
  "title": "The Year of the Horse",
  "description": "Listen, my children, and you shall hear of the wildest ride since Paul Revere...But that's getting ahead of the story, a warm, wacky, wonderful story about a father's attempts to win the love and respect of his teenage daughter who has eyes only for a horse. Anyone who has ever had a daughter is bound to be enchanted by Freddie Bolton, a charming, harassed suburban ad executive playing--and losing--Madison Avenue's favorite sport of living beyond his income. Nothing is too good for his daughter, but when Hellie asks for a horse of her own, he has an adman's brainstorm. He cooks up a deal to name the horse after a product he just happens to represent, and Freddie, who knows nothing about horses--he's allergic to them; they make him sneeze!--finds himself anchor man in an insane triangle with a prize thoroughbred.Not since Mr. Blandings succumbed to his single moment of weakness has one man been subjected to more bewildering--and hilarious--adventures. Most unaccountably, Freddie finds himself falling for the big, beer-swilling animal, who has turned out to be the hottest show horse ever to point his nose toward Madison Square Garden. The scene where Freddie, finding himself out of cigarettes, hops aboard the championship hunter for a quick trip to the supermarket--and gets arrested for stealing his own horse!--is one of the most sidesplitting in all humorous writing.A human comedy brimming with delightful characters from the phony aristocratic riding master Wolfgang von Roetz to Suzie, Freddie's beguiling secretary who's an expert horsewoman in her own right, The Year of the Horse, filled with warmth and tenderness and understanding, is a master performance by the dean of American humorists whose My Man Godfrey has already become something of a classic.",
  "genres": [
    "Humor"
  ],
  "author": "Eric Hatch",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/17284576-the-year-of-the-horse"
}