{
  "title": "Duiwelskloof",
  "description": "In die ontoeganklike Duiwelskloof in die Swartberge van die Klein Karoo het 'n verdwaalde groep Voortrekkers onder leiding van die befoeterde patriarg Lukas Hermiet, die Siener, hulle gaan vestig. Vandag, 'n eeu en 'n half later, bring 'n knellende droogte die skrikwekkende gevolge van dié oer-Afrikaanse gemeenskappie se isolasie en inteelt tot 'n uitbarsting. Die katalisator is die gehawende joernalis Flip Lochner - 'n vuil-uil met 'n mislukte lewe agter hom - wat van buite inkom om die Duiwelskloof se geskiedenis op te skryf en verseil raak tussen die plek se mense, die donker geheim wat die gemeenskap so naarstig probeer bewaar, en al die stories wat hulle daar romdom versin. Oor 'n man wat sewentien kinders op sy teenstander se graf verwerk het. 'n Vrou wat met volmaan in 'n bokooi verander. 'n Swerwer wat die Duisternis van Egipteland in 'n boksie teruggebring het. 'n Man wat deur 'n swerm voëls hemel toe getrek is. 'n Meisie met vier borste...En daar is die mense van vandag: Soon Heilig wat die koolkoppe in hulle verdoemenis in preek. Smeed Smit wat probeer om 'n nagmerrie te beslaan, Ouma Liesbet Pruim wat met haar trommeltjie op die dak sit en wag dat die Here haar moet kom haal, Hans Toordenaar met sy gevaarlike gawe oor ander se lewens, Tant Poppie Vollemaan met haar rate vir enige iets behalwe die dood, Henta Voorperske met haar swerm nimfies wat saans kaal in die bloekombos dans. En dan die raaiselagtige Emma wie se lewe met Flip Lochner s'n deurmekaar raak, met gevolge wat niemand kon voorsien nie.Onbeteulde humor, 'n onheilspellende opbou van bose magte, 'n wemeling van stories, 'n allergorie oor die ontstaan van geskiedenis, 'n hellevaart, 'n besinning oor die Suid-Afrika van gister en vandag, 'n beurtelingse makabere en uitbundige spel van die verbeelding...dit alles is Duiwelskloof, wat reeds in verskeie lande bestempel is as André P. Brink se grootste roman tot op hede.",
  "genres": [
    "Fiction",
    "Africa",
    "South Africa",
    "Historical Fiction",
    "Fantasy",
    "Literary Fiction"
  ],
  "author": "André Brink",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/17284632-duiwelskloof"
}