{
  "title": "The Goob Factor",
  "description": "Parents… school… friends… bullies… fourteen years old is a tough age to be. Especially if your name is Gooby.Like most teenagers, Jay Gooby is convinced he has it worse than anyone else. His parents don’t fit the normal mold, and he has endured a lifetime of merciless teasing ― especially at the hands of his lifelong enemy, Mike Thornley. But Jay has to take on more than just school and hockey when two major events take his parents adopt a special needs child, and a freak accident occurs at the hockey rink. Life sure can get a lot more complicated… and at the same time, a lot simpler.EXCERPTLet’s face it, if you come into this world with a name like Gooby, you’re pretty much done for. I can’t believe that after decades (centuries, maybe!) of kids getting pummeled in playgrounds, the world hasn’t figured this one out by now. Hey, attention parents ― newsflash! This just in! Don’t land your kid with a stupid name!Jeez, you’d think they’d have done studies on it or something, proven what a nightmare effect it has on a kid’s formative years. Not that anyone really needs to do a study. I mean, take a look around you at school, and you have your answer. How easy a time is a kid going to have if his name is, I don’t know, Dilbert or something? Not exactly a name that screams “leadership!” But maybe if some brainiac were to write it up in a scientific journal, parents would actually take notice. I could write the whole thing myself, but even if I wrote in letters ten feet high, my parents still probably wouldn’t get it.“Hey Goober!” a voice calls out.Nickname number one. Takes a real genius to come up with that one. I don’t even turn around; I already know the genius in question is Mike Thornley. It’s the hey-world-look-at-me, I’m MIKE THORNLEY in his voice that gives it away. Oh, that and the fact he’s been calling me names for nine straight years now. I could probably pick his voice out of a screaming crowd of a thousand people. While wearing headphones.“Goobs!”Nickname number two.There’s Gooby, Goobs, Goober, Goobster, and then my personal Booger. That one doesn’t even make sense. Whack. Ow. Textbook. Head.I swing around, ready to nail Thornley with my backpack, but he’s already jumped out of the way. He’s always hitting me with books or tripping me up or slamming me against lockers.Nine years is a long time. I should know; I’m fourteen.“So Goob-Goob!” (Oh, did I forget to mention that one?) “You going to practice tomorrow?”I turn to look at him. He’s smiling. He’d actually look friendly if it weren’t for all the years of nicknames, jokes, punches, wedgies, and general roughhousing on his slate. “Yeah, I’m goin’.”“Great! ‘Cause my team really needs you, man.”This would sound nice if I weren’t on a different team.",
  "genres": [],
  "author": "Jody Kihara",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/10772923-the-goob-factor"
}