{
  "title": "12 Science Fiction Short Stories",
  "description": "Philip Kindred Dick (December 16, 1928 – March 2, 1982) was an American novelist, short story writer and essayist whose published work is almost entirely in the science fiction genre. Dick explored sociological, political and metaphysical themes in novels dominated by monopolistic corporations, authoritarian governments, and altered states. In his later works Dick's thematic focus strongly reflected his personal interest in metaphysics and theology. He often drew upon his own life experiences in addressing the nature of drug abuse, paranoia, schizophrenia, and transcendental experiences in novels such as A Scanner Darkly and VALIS.The novel The Man in the High Castle bridged the genres of alternate history and science fiction, earning Dick a Hugo Award for Best Novel in 1963. Flow My Tears, the Policeman Said, a novel about a celebrity who awakens in a parallel universe where he is unknown, won the John W. Campbell Memorial Award for best novel in 1975. \"I want to write about people I love, and put them into a fictional world spun out of my own mind, not the world we actually have, because the world we actually have does not meet my standards,\" Dick wrote of these stories. \"In my writing I even question the universe; I wonder out loud if it is real, and I wonder out loud if all of us are real.\"In addition to 44 published novels, Dick wrote approximately 121 short stories, most of which appeared in science fiction magazines during his lifetime. Although Dick spent most of his career as a writer in near-poverty, ten popular films based on his works have been produced, including Blade Runner, Total Recall, A Scanner Darkly, Minority Report, Paycheck, Next, Screamers, and The Adjustment Bureau. In 2005, Time magazine named Ubik one of the one hundred greatest English-language novels published since 1923. In 2007, Dick became the first science fiction writer to be included in The Library of America series.Awards and honorsDuring his lifetime, Dick received the following awards and nominations: Hugo Awards Best Novel 1963 – winner: The Man in the High Castle[7] 1975 – nominee: Flow My Tears, the Policeman Said[8] Best Novelette 1968 – nominee: Faith of Our Fathers Nebula Awards Best Novel 1965 – nominee: Dr. Bloodmoney[92] 1965 – nominee: The Three Stigmata of Palmer Eldritch[92] 1968 – nominee: Do Androids Dream of Electric Sheep?[93] 1974 – nominee: Flow My Tears, the Policeman Said[94] 1982 – nominee: The Transmigration of Timothy Archer[95] John W. Campbell Memorial Award Best Novel 1975 – winner: Flow My Tears, the Policeman Said[8] British Science Fiction Association Award Best Novel 1978 – winner: A Scanner Darkly[96] Graouilly d'Or (Festival de Metz, France) 1979 – winner: A Scanner Darkly",
  "genres": [
    "Science Fiction"
  ],
  "author": "Philip K. Dick",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/17286338-12-science-fiction-short-stories"
}