{
  "title": "Jefferson and Hamilton: The Rivalry That Forged a Nation",
  "description": "From the award-winning author of Almost a Miracle and The Ascent of George Washington, this is the rare work of scholarship that offers us irresistible human drama even as it enriches our understanding of deep themes in our nation's history.The decade of the 1790s has been called the “age of passion.” Fervor ran high as rival factions battled over the course of the new republic-each side convinced that the other's goals would betray the legacy of the Revolution so recently fought and so dearly won. All understood as well that what was at stake was not a moment's political advantage, but the future course of the American experiment in democracy. In this epochal debate, no two figures loomed larger than Thomas Jefferson and Alexander Hamilton.Both men were visionaries, but their visions of what the United States should be were diametrically opposed. Jefferson, a true revolutionary, believed passionately in individual liberty and a more egalitarian society, with a weak central government and greater powers for the states. Hamilton, a brilliant organizer and tactician, feared chaos and social disorder. He sought to build a powerful national government that could ensure the young nation's security and drive it toward economic greatness.Jefferson and Hamilton is the story of the fierce struggle-both public and, ultimately, bitterly personal-between these two titans. It ended only with the death of Hamilton in a pistol duel, felled by Aaron Burr, Jefferson's vice president. Their competing legacies, like the twin strands of DNA, continue to shape our country to this day. Their personalities, their passions, and their bold dreams for America leap from the page in this epic new work from one of our finest historians.",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Biography",
    "American Revolution",
    "Politics",
    "Presidents"
  ],
  "author": "John Ferling",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/17286684-jefferson-and-hamilton"
}