{
  "title": "Junkyard Planet: Travels in the Billion-Dollar Trash Trade",
  "description": "When you drop your Diet Coke can or yesterday’s newspaper in the recycling bin, where does it go? Probably halfway around the world, to people and places that clean up what you don’t want and turn it into something you can’t wait to buy. In Junkyard Planet, Adam Minter—veteran journalist and son of an American junkyard owner—travels deeply into a vast, often hidden, multibillion-dollar industry that’s transforming our economy and environment.Minter takes us from back-alley Chinese computer recycling operations to high-tech facilities capable of processing a jumbo jet’s worth of recyclable trash every day. Along the way, we meet an unforgettable cast of characters who've figured out how to build fortunes from what we throw away: Leonard Fritz, a young boy \"grubbing\" in Detroit's city dumps in the 1930s; Johnson Zeng, a former plastics engineer roaming America in search of scrap; and Homer Lai, an unassuming barber turned scrap titan in Qingyuan, China. Junkyard Planet reveals how “going green” usually means making money—and why that’s often the most sustainable choice, even when the recycling methods aren’t pretty.With unmatched access to and insight on the junk trade, and the explanatory gifts and an eye for detail worthy of a John McPhee or William Langewiesche, Minter traces the export of America’s recyclables and the massive profits that China and other rising nations earn from it. What emerges is an engaging, colorful, and sometimes troubling tale of consumption, innovation, and the ascent of a developing world that recognizes value where Americans don’t. Junkyard Planet reveals that we might need to learn a smarter way to take out the trash.",
  "genres": [
    "Nonfiction",
    "Environment",
    "Business",
    "Economics",
    "Sustainability",
    "Science",
    "China"
  ],
  "author": "Adam Minter",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/17286721-junkyard-planet"
}