{
  "title": "Why Can't I Get Better? Solving the Mystery of Lyme and Chronic Disease: Solving the Mystery of Lyme and Chronic Disease",
  "description": "From one of the country's foremost doctors comes a ground-breaking book about diagnosing, treating and healing Lyme, and peeling away the layers that lead to chronic disease.You may not know that you have Lyme. It can mimic every disease process including Chronic Fatigue Syndrome, Fibromyalgia, autoimmune conditions like MS, psychiatric conditions like depression and anxiety, and cause significant memory and concentration problems, mimicking early dementia. It is called the “Great Imitator,” and inaccurate testing—combined with a fierce, ongoing debate that questions chronic infection—makes it difficult for sufferers to find effective care.When Dr. Richard Horowitz moved to the Hudson Valley over two decades ago to start his own medical practice, he had no idea that he was jumping into a hotbed of Lyme disease. He would soon realize that many of the chronic disease diagnoses people were receiving were also the result of Lyme—and he would discover how once-treatable infections, in the absence of timely intervention, could cause dis­abling conditions. In a field where the number of cases is growing exponentially around the world and answers remain elusive, Dr. Horowitz has treated over 12,000 patients and made extraordinary progress. His plan represents a crucial paradigm shift, without which the suffering will continue.In this book, Dr. Horowitz:• Breaks new ground with a 16 Point Differential Diagnostic Map, the basis for his revolutionary Lyme treatment plan, and an overarching approach to treating all chronic illness.• Introduces MSIDS, or Multiple Systemic Infectious Disease Syndrome, a new lens on chronic illness that may prove to be an important missing link.• Covers in detail Lyme’s leading symptoms and co-infections, including immune dysfunction, sleep disorders, chronic pain and neurodegenerative disorders – pro­viding a unique functional and integrative health care model, based on the most up-to-date scientific research, for physicians and health care providers to effectively treat Lyme and other chronic illnesses.Cutting through the frustration, misinformation and endless questions, Dr. Horowitz’s enlightening story of medical discovery, science and politics is an all-in-one source for patients of chronic illness to identify their own symptoms and work with their doctors for the best possible treatment outcome.",
  "genres": [
    "Health",
    "Nonfiction",
    "Medical",
    "Medicine",
    "Science",
    "Self Help",
    "Disease"
  ],
  "author": "Richard I. Horowitz",
  "average_rating": "4.36",
  "url": "https://www.goodreads.com/book/show/17286772-why-can-t-i-get-better-solving-the-mystery-of-lyme-and-chronic-disease"
}