{
  "title": "Glorious War: The Civil War Adventures of George Armstrong Custer",
  "description": "Glorious War, the thrilling and definitive biography of George Armstrong Custer's Civil War years, is nothing short of a heart-pounding cavalry charge through the battlefield heroics that thrust the gallant young officer into the national spotlight in the midst of the country's darkest hours. From West Point to the daring military actions that propelled him to the rank of general at age twenty-three to his unlikely romance with Libbie Bacon, Custer's exploits are the stuff of legend.Always leading his men from the front with a personal courage seldom seen before or since, he was a key part of nearly every major engagement in the east. Not only did Custer capture the first battle flag taken by the Union Army and receive the white flag of surrender at Appomattox, but his field generalship at Gettysburg against Confederate cavalry General Jeb Stuart had historic implications in changing the course of that pivotal battle.For decades, historians have looked at Custer strictly through the lens of his death on the frontier, his last stand, casting him as a failure. While some may say that the events that took place at the Little Big Horn are illustrative of America's bloody westward expansion, they have in the process unjustly eclipsed Custer's otherwise extraordinarily life and outstanding career and fall far short of encompassing his incredible service to his country. This biography of thundering cannons, pounding hooves, and stunning successes tells the true story of the origins of one of history's most dynamic and misunderstood figures. Award-winning historian Thom Hatch reexamines Custer's early career to rebalance the scales and show why Custer's epic fall could never have happened without the spectacular rise that made him an American legend.",
  "genres": [
    "Civil War",
    "Biography",
    "History",
    "American Civil War",
    "Nonfiction",
    "American History",
    "War"
  ],
  "author": "Thom Hatch",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/17286832-glorious-war"
}