{
  "title": "Melissa Explains It All: Tales from My Abnormally Normal Life",
  "description": "Melissa Joan Hart explained it all-from dating to bullies-in her groundbreaking role as Clarissa Darling on Clarissa Explains It All . She cast a spell on millions more viewers as Sabrina, the Teenage Witch . Now, in Melissa Explains It All, Melissa tells the frank and funny behind-the-scenes stories from her extraordinary past and her refreshingly normal present.Melissa has been entertaining audiences most of her life; when there were no girls named Melissa on her favorite show, the forceful four year old decided she'd get on television her way. From that moment on, Melissa has shown a singular determination and focus-whether it's for booking three national commercials so her dad would build her a tree house or for nailing the audition for Clarissa .From her first commercial to her current starring role in ABC Family's hit Melissa and Joey , Hart never let fame go to her head. She always had one foot in Hollywood and one foot in reality-and still does. Melissa makes us laugh along with her as she talks --guest appearances in shows like Saturday Night Live and The Equalizer--auditioning for Punky Brewster and Clarissa--her early Broadway days--wacky parties she's thrown and attended-- the actors who influenced her and whom she befriended, worked with and competed against--her experiences both on and off-set-with Sabrina 's Salem the Cat and Elvis the Alligator on Clarissa--how she met the love of her life at the Kentucky DerbyMelissa Joan Hart explains all that she's learned along the way-what's kept her grounded, normal and working when others have not been so fortunate-and that she's the approachable, hilarious girl-next-door her fans have always thought she'd be.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "Audiobook",
    "Autobiography",
    "Biography Memoir",
    "Adult"
  ],
  "author": "Melissa Joan Hart",
  "average_rating": "3.42",
  "url": "https://www.goodreads.com/book/show/17286857-melissa-explains-it-all"
}