{
  "title": "Work of Art",
  "description": "Ten years ago, Harper Connelly was unceremoniously dumped by her high school boyfriend during the same week her mom kicked her out of her house. So she moved across the country and started over. It was all she could do. Now she’s one of the most sought after female tattoo artists in the country, she has a successful business, and she has great friends. But she hasn’t had great luck in love, and she doesn’t exactly let people in. Then on a cross-country flight, she meets Brandon Cooper, a guy who’s been through the love ringer a few times himself and is just looking to have some fun. And for some reason, Harper and Brandon click. He tells her all about his friend he’s visiting in San Francisco, a guy who is about to marry the wrong girl, who Brandon is determined to corrupt during his visit. And part of that corruption is getting his friend a tattoo from the hot girl he met on the plane. But neither Harper nor Brandon realize that she actually knows his friend. And when he walks into her tattoo parlor, for the first time in ten years, Harper comes face-to-face with Ryan Carson, the guy who stole her heart ten years earlier and then broke it into pieces.In \"Just Watch the Fireworks\", Ryan Carson was on the losing end of a love triangle. And in response to being dumped, he dove headfirst into work, a new relationship with a girl his mother set him up with and a new life in San Francisco. On paper, his life is perfect, but in reality it’s anything but – and he’s getting married in four weeks. Then one weekend everything changes when he runs into Harper Connelly, the girl he lost ten years earlier.Old secrets still haunt them and old feelings dominate their interactions with each other, but Ryan and Harper are drawn to each other in ways even they can’t explain. And when the ultimate secret is revealed, Ryan starts to think long and hard about his life and the people he thought he could trust, but one thing is clear – he still loves Harper. But when it comes down to it, can Harper get past everything that happened between them and give him a second chance?Work of Art is a spin-off novel from Just Watch the Fireworks, but it is also a stand-alone novel.*Recommended for mature audiences only.",
  "genres": [
    "New Adult",
    "Contemporary",
    "Romance",
    "Contemporary Romance",
    "Second Chance",
    "Chick Lit",
    "Adult"
  ],
  "author": "Monica Alexander",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/17287997-work-of-art"
}