{
  "title": "A Pretty Pill",
  "description": "Please be warned... this book is:Mature content (New Adult): Recommended for readers 18+ due to explicit sexual content, harsh language and adult themes.Jade Tayte is an athlete and party girl, living on campus at university and enjoying the carefree lifestyle that comes with being a 19 year old student, living away from home. Finishing up her second year of study, she gets a call that changes her life forever.In a freak accident while driving along the New England Highway, on their way to collect her, Jade’s parents are killed and her brother Silas is left fighting for his life.Jade is forced to consider her future, when it becomes apparent that her Grandparents do not intend to step in and take on the challenging behaviours that Silas manifests, when it becomes clear that he will survive.At 19, and with no script to follow, Jade must take on a parenting role for her 12 year old brother.Benjamin Reynolds is living the high life in LA, and he’s about to renegotiate his UFC contract, when suddenly he’s called home to Australia to care for his ailing mother who has been diagnosed with Metastatic Breast Cancer. Ben has been professionally fighting since he was 18, and it’s all he knows... so he finds himself instructing mixed-martial arts classes at his local Police Citizens Youth Club, three evenings a week; in between juggling his mother’s medications, her chemotherapy and her doctor’s appointments.Here he is introduced to a talented hopeful, Silas Tayte, who at 17 years old has more potential than anyone else he’s ever trained. Problem is, Silas has issues... he’s bi-polar, and he struggles with controlling his illness.Ben is determined to help Silas to become a champion in his own right, so he begins to embed himself in the talented young man’s life... which brings with it another challenge... Jade Tayte!",
  "genres": [
    "Romance",
    "New Adult",
    "Contemporary",
    "Mental Illness",
    "Sports",
    "Contemporary Romance",
    "Fighters"
  ],
  "author": "Criss Copp",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/17288253-a-pretty-pill"
}