{
  "title": "Loving Your Lies",
  "description": "There are alternate cover editions for this ISBN here, here, here, and here.Julian is drop-dead gorgeous, annoyingly provocative, and he's fast becoming her best friend. But he also has a secret that makes the little hairs on her arms stand on end...My name is Jona Montiniere, and that’s pretty much the only good thing to say about me. I’m seventeen, I’m snarky, and I’m a crap-load of trouble. Or so they say. But what did they expect from me really, when they dumped me in an orphanage at age five? That I’d grow up to become the new first lady? Nah, I think it’s much more fun to raid Camden Market in London with my friend, Debby. She’s cool. She lives on the street. I learned so much from her. The only thing she missed to teach me was how to tend to a vineyard. And yeah, that’s what I’m going to do for the next 6 weeks, courtesy to this darn judge, who sent me off to France after I was caught stealing again. Fair enough, the vineyards are okay, and so are my aunt and uncle, who I haven’t met up ‘til now. What isn’t okay, and I mean it, is that I have to live in the same house with my mother, that god-awful dragon, who spurned when I was only a child. And now she wants me back? Demands my forgiveness? Why, because she’s about to die of cancer? Uh-uh. Sorry, but that’s not gonna happen. I want no contact with that woman, thanks. But what’s Julian got to do with all of this? About my age, he’s too young to be my mother’s lover. So why doesn’t he leave her side? Ever. He’s different, as in the paranormal kind of different, but he’s sa-woon-worthy gorgeous. He obviously has secrets, but he’s also get-under-my-skin charming. In short, he’s a riddle to me. But he likes me, and that’s scaring the shit out of me. I sure won’t let anyone come too close. So now I'm wondering only two things: How did he manage to hold me in his arms after only three days? And how the hell do you keep an angel earth bound?",
  "genres": [
    "Romance",
    "Paranormal",
    "Angels",
    "Young Adult",
    "Fantasy",
    "Paranormal Romance",
    "New Adult"
  ],
  "author": "Piper Shelly",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/17288193-loving-your-lies"
}