{
  "title": "Landslide: LBJ and Ronald Reagan at the Dawn of a New America",
  "description": "In politics, the man who takes the highest spot after a landslide is not standing on solid ground. In this riveting work of narrative nonfiction, Jonathan Darman tells the story of two giants of American politics, Lyndon Johnson and Ronald Reagan, and shows how, from 1963 to 1966, these two men—the same age, and driven by the same heroic ambitions—changed American politics forever. The liberal and the conservative. The deal-making arm twister and the cool communicator. The Texas rancher and the Hollywood star. Opposites in politics and style, Johnson and Reagan shared a defining impulse: to set forth a grand story of America, a story in which he could be the hero. In the tumultuous days after the Kennedy assassination, Johnson and Reagan each, in turn, seized the chance to offer the country a new vision for the future. Bringing to life their vivid personalities and the anxious mood of America in a radically transformative time, Darman shows how, in promising the impossible, Johnson and Reagan jointly dismantled the long American tradition of consensus politics and ushered in a new era of fracture. History comes to life in Darman’s vivid, fly-on-the wall storytelling. Even as Johnson publicly revels in his triumphs, we see him grow obsessed with dark forces he believes are out to destroy him, while his wife, Lady Bird, urges her husband to put aside his paranoia and see the world as it really is. And as the war in Vietnam threatens to overtake his presidency, we witness Johnson desperately struggling to compensate with ever more extravagant promises for his Great Society. On the other side of the country, Ronald Reagan, a fading actor years removed from his Hollywood glory, gradually turns toward a new career in California politics. We watch him delivering speeches to crowds who are desperate for a new leader. And we see him wielding his well-honed instinct for timing, waiting for Johnson’s majestic promises to prove empty before he steps back into the spotlight, on his long journey toward the presidency. From Johnson’s election in 1964, the greatest popular-vote landslide in American history, to the pivotal 1966 midterms, when Reagan burst forth onto the national stage, Landslide brings alive a country transformed—by riots, protests, the rise of television, the shattering of consensus—and the two towering personalities whose choices in those moments would reverberate through the country for decades to come.",
  "genres": [
    "History",
    "Politics",
    "Nonfiction",
    "Presidents",
    "American History",
    "Biography",
    "American"
  ],
  "author": "Jonathan Darman",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/17288749-landslide"
}