{
  "title": "Blood, Smoke and Ashes",
  "description": "In the Fall of 1955, the state of Nevada used the electric chair to execute a prisoner for the first time. It was also the last time. Molly Blackburn, nicknamed Jane the Ripper by the Las Vegas press after killing eleven men while posing as a prostitute, was strapped to the chair without incident. The switch was flipped.Everything after that went horribly wrong.Since that day, a copycat Jane the Ripper has appeared almost every decade in a different city, mimicking Molly's choice in victims as well as her methods of murder. She kills eleven men then disappears, never to be found. The similarities between the bodies left behind each decade is uncanny. As if they are all the victims of the same murderer, not a copycat.But that's impossible, of course, because Molly Blackburn is dead, her execution witnessed by a dozen people.FBI Agent Jack Shaw, the lead investigator in the Jane the Ripper cases since the seventies, finally catches a break in 2009 when the intended fifth victim manages to turn the tables on the newest copycat . Everyone believes that the horror has finally ended with her capture. Shaw is not so sure, though, wondering if someone else will take up the mantle and kill seven more men to complete the cycle. But when no more bodies with her distinctive markings show up over the next two years, Shaw allows himself to believe that maybe he has seen the end of the Jane the Ripper murders.As it turns out, what he thought was the end was only the beginning.His hunt will take him across the country, and even when he thinks he's finally discovered the truth, he quickly learns that not everything is as it seems.That not every monster is created equal.That the nature of good and evil is not as black and white as he has always believed.That not everything that is broken can be put back together.That not every fractured soul can be saved.When blood, smoke and ashes rise, no one comes out the same on the other side.Blood, Smoke and Ashes is a 115,00 word supernatural thriller/horror",
  "genres": [
    "Horror",
    "Mystery",
    "Thriller",
    "Fiction",
    "Crime",
    "Mystery Thriller",
    "Fantasy"
  ],
  "author": "Bradley Convissar",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/17289429-blood-smoke-and-ashes"
}