{
  "title": "Works of Claude Monet",
  "description": "This is the fourth volume of a new series of publications by Delphi Classics, the best-selling publisher of classical works. A first of its kind in digital print, the ‘Masters of Art’ series allows Kindle readers to explore the works of the world’s greatest artists in comprehensive detail. This volume presents over 500 paintings of the Impressionist master Claude Monet. For all art lovers, this stunning collection offers a beautiful feast of images by one of the most influential artists of the twentieth century. Features:* over 500 paintings, indexed and arranged in chronological order* special ‘Highlights’ section, with concise introductions to the masterpieces, giving valuable contextual information* beautiful 'detail' images, allowing you to explore Monet's celebrated works* numerous images relating to Monet’s life and works* learn about the history of the Impressionists and the celebrated works that shaped the art movement in the detailed biography THE FRENCH IMPRESSIONISTS by Camille Mauclair* hundreds of images in stunning colour - highly recommended for Kindle Fire, iPhone and iPad users, or as a valuable reference tool on traditional KindlesCONTENTS:The HighlightsLUNCHEON ON THE GRASSSELF PORTRAIT WITH A BERETTHE TERRACE AT SAINTE-ADRESSEWOMEN IN THE GARDENBATHERS-AT-LA-GRENOUILLÈREON THE BANK OF THE SEINE, BENNECOURTTHE MAGPIEPOPPIES BLOOMINGWOMAN WITH A PARASOLIMPRESSION, SUNRISEGARE SAINT LAZARE, ARRIVAL OF A TRAININ THE WOODS AT GIVERNY BLANCHE HOSCHEDÉHAYSTACKS, (SUNSET)ROUEN CATHEDRAL, FAÇADE (SUNSET)BRIDGE OVER A POND OF WATER LILIESHOUSES OF PARLIAMENT, LONDONWATER LILIESTHE GRAND CANAL, VENICENYMPHEASTHE ROSE-WAY IN GIVERNYThe PaintingsTHE PAINTINGS IN CHRONOLOGICAL ORDERALPHABETICAL LIST OF PAINTINGSThe BiographyTHE FRENCH IMPRESSIONISTS by Camille Mauclair",
  "genres": [
    "Art",
    "Nonfiction"
  ],
  "author": "Claude Monet",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/17289660-works-of-claude-monet"
}