{
  "title": "Growth Shock",
  "description": "We are living in the age of Growth Shock...Around the world, we see income inequality increasing. Economic growth in much of the world no longer benefits broader populations but increasingly benefits only the wealthy. Growth, in large part, has come to be based on rapidly exploiting dirty fossil fuel reserves and an expanding base of cheap, slave-wage labor from the world's 7 billion, and growing, population. All while reliance on fossil fuels creates a double bind of increasing energy prices and growing damage due to climate change. Growth, in this case, primarily enriches a diminishing few, erodes the prospect for prosperity for many, and rapidly wrecks the life support capacity of our planet.This brand of growth, promoted for so long by entrenched global special interests, is simply no longer sustainable. With each passing year, the continued pursuit of such growth results in increasingly harmful shock.In this case, the words of Limits to Growth authors ring all too true:“If a society's implicit goals are to exploit nature, enrich the elites, and ignore the long-term, then that society will develop technologies and markets that destroy the environment, widen the gap between the rich and the poor, and optimize for short-term gains. In short, that society develops technologies and markets that hasten a collapse instead of preventing it.”In Growth Shock, emerging threats expert Robert Marston Fanney examines the four underlying structures of Shock: population growth, resource depletion, climate change, and institutionalized inequality. Drawing from a host of sources including such diverse works as The Limits to Growth, Collapse, and Storms of My Grandchildren he links each to current corporate and government structures enforcing dependence on an ever-increasing consumption of dangerous and depleting non-renewable resources and on economic systems that primarily benefit the wealthy. Finally, he provides a raft of solutions for re-establishing and advancing the systems of sustainability, cooperation, and economic fairness that are the best means to effectively confront a worsening Growth Shock crisis.(Proceeds for the sales of this book go to benefit the climate action group 350.org and to funding a number of individual, local, and community sustainability efforts.)",
  "genres": [],
  "author": "Robert Fanney",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/17289827-growth-shock"
}