{
  "title": "Secrets of the Terra-Cotta Soldier",
  "description": "In this action-packed adventure and coming-of-age story that finely weaves fact and fiction, thirteen-year-old Ming lives in a small village in Maoist China in the 1970s. His father is convinced that Emperor Qin’s tomb—and the life-size terra-cotta army created to serve and protect the emperor in the afterlife—lies hidden in the hills around them. But if Ming’s father doesn’t prove it soon, the town’s Political Officer will condemn him to the brutal labor camps. From the stories of a terra-cotta soldier who has survived through the centuries, Ming learns the history of Emperor Qin, known for building the Great Wall of China, and how and why the terra-cotta soldiers came to be. As their unlikely friendship develops, Ming experiences the mysterious tomb firsthand, braving deadly traps and witnessing the terra-cotta army in action. Most importantly, he comes to see how he can save both the terra-cotta soldiers and his father from the corrupt Political Officer and his Communist cronies. The book is illustrated with photographs of Communist Chinese village life in the 1970s, the Great Wall, and, of course, the excavated tomb with its many terra-cotta soldiers. It also features a special recipe from the story.\nPraise for Secrets of the Terra-Cotta Soldier\n \"Historical photos and Indiana Jones-style adventure enrich this tale of an unusual meeting between the Qin Dynasty and the 20th century.\" --Kirkus Reviews \"Despite the hardships, both courageous characters work to uphold their respective duties: Shi to protect the tomb and Ming to protect the cultural legacy of China’s people. With archival art, recipes, and end notes, this title is sure to be a hit in the classroom.\" --Booklist",
  "genres": [
    "Historical Fiction",
    "Fantasy",
    "Middle Grade",
    "Historical",
    "China",
    "Adventure",
    "Childrens"
  ],
  "author": "Ying Chang Compestine",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/17290236-secrets-of-the-terra-cotta-soldier"
}