{
  "title": "The Lost Islands",
  "description": "The highly anticipated second volume to the critically acclaimed Explorer series, The Lost Islands is a collection of seven all-new stories written and illustrated by an award-winning roster of comics artists, with each story centered around the theme of hidden places. Edited by the New York Times bestselling comics creator Kazu Kibuishi, this graphic anthology includes well-written, beautifully illustrated stories by Kazu (the Amulet series), Jason Caffoe (the Flight series), Raina Telgemeier (Drama and Smile), Dave Roman (the Astronaut Academy series), Jake Parker (the Missile Mouse series), Michel Gagné (The Saga of Rex), Katie and Steven Shanahan (the Flight series), and up-and-coming new artist Chrystin Garland.\nPraise for Explorer 2: The Lost Islands\nSTARRED REVIEWS \"A second gathering of new graphic tales, diverse of plot and atmosphere but thematically linked by island settings and every bit as stellar as its predecessor…First rate.\" --Kirkus Reviews, starred review \"With this second showcase Kibuishi affirms his editorial savvy for amassing talented creators and providing a vehicle to let them do what they do best: use comics to tell funny, thoughtful, and just plain good stories.\" --Publishers Weekly, starred review \"Lost Islands is a great sequel to The Mystery Boxes (Abrams, 2012) that is masterfully told and beautifully drawn. A must-have for any collection.\" --School Library Journal, starred review \"This sophomore effort’s solid artwork, dialogue, and stories will still be a great introductory title for young or struggling middle-school readers starting to explore the world of graphic novels.\" --Booklist \"Variety of style is the real draw of Kibuishi’s graphic anthologies, and tweens reluctant to stray from their comic-book favorites will find the gamut of visual presentations eye-opening.\" --The Bulletin of The Center for Children’s Books \"Another satisfying anthology that will leave readers eager for the next.\" --The Horn Book",
  "genres": [
    "Graphic Novels",
    "Fantasy",
    "Short Stories",
    "Comics",
    "Middle Grade",
    "Adventure",
    "Childrens"
  ],
  "author": "Kazu Kibuishi",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/17290285-the-lost-islands"
}