{
  "title": "The Nazi and the Psychiatrist: Hermann Göring, Dr. Douglas M. Kelley, and a Fatal Meeting of Minds at the End of WWII",
  "description": "In 1945, after his capture at the end of the Second World War, Hermann Göring arrived at an American-run detention center in war-torn Luxembourg, accompanied by sixteen suitcases and a red hatbox. The suitcases contained all manner of paraphernalia: medals, gems, two cigar cutters, silk underwear, a hot water bottle, and the equivalent of 1 million in cash. Hidden in a coffee can, a set of brass vials housed glass capsules containing a clear liquid and a white precipitate: potassium cyanide. Joining Göring in the detention center were the elite of the captured Nazi regime—Grand Admiral Dönitz; armed forces commander Wilhelm Keitel and his deputy Alfred Jodl; the mentally unstable Robert Ley; the suicidal Hans Frank; the pornographic propagandist Julius Streicher—fifty-two senior Nazis in all, of whom the dominant figure was Göring.To ensure that the villainous captives were fit for trial at Nuremberg, the US army sent an ambitious army psychiatrist, Captain Douglas M. Kelley, to supervise their mental well-being during their detention. Kelley realized he was being offered the professional opportunity of a lifetime: to discover a distinguishing trait among these arch-criminals that would mark them as psychologically different from the rest of humanity. So began a remarkable relationship between Kelley and his captors, told here for the first time with unique access to Kelley's long-hidden papers and medical records.Kelley's was a hazardous quest, dangerous because against all his expectations he began to appreciate and understand some of the Nazi captives, none more so than the former Reichsmarshall, Hermann Göring. Evil had its charms.",
  "genres": [
    "History",
    "Nonfiction",
    "Psychology",
    "World War II",
    "War",
    "Biography",
    "Audiobook"
  ],
  "author": "Jack El-Hai",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/17290707-the-nazi-and-the-psychiatrist"
}