{
  "title": "Last Stand at Khe Sanh: The U.S. Marines' Finest Hour in Vietnam",
  "description": "In a remote mountain stronghold in 1968, six thousand US Marines awoke one January morning to find themselves surrounded by 20,000 enemy troops. Their only road to the coast was cut, and bad weather and enemy fire threatened their fragile air lifeline. The siege of Khe Sanh—the Vietnam War's epic confrontation—was under way. For seventy-seven days, the Marines and a contingent of US Army Special Forces endured artillery barrages, sniper fire, ground assaults, and ambushes. Air Force, Marine, and Navy pilots braved perilous flying conditions to deliver supplies, evacuate casualties, and stem the North Vietnamese Army's onslaught. As President Lyndon B. Johnson weighed the use of tactical nuclear weapons, Americans watched the shocking drama unfold on nightly newscasts. Through it all, the bloodied defenders of Khe Sanh held firm and prepared for an Alamo-like last stand. Now, Gregg Jones takes readers into the trenches and bunkers at Khe Sanh to tell the story of this extraordinary moment in American history. Last Stand at Khe Sanh captures the exceptional courage and brotherhood that sustained the American fighting men throughout the ordeal. It brings to life an unforgettable cast of characters—young high school dropouts and rootless rebels in search of John Wayne glory; grizzled Korean War veterans; daredevil pilots; gritty platoon leaders and company commanders; and courageous Navy surgeons who volunteered to serve in combat with the storied Marines. Drawing on in-depth interviews with siege survivors, thousands of pages of archival documents, and scores of oral history accounts, Gregg Jones delivers a poignant and heart-pounding narrative worthy of the heroic defense of Khe Sanh.",
  "genres": [
    "History",
    "Military History",
    "Military Fiction",
    "Nonfiction",
    "War",
    "American History",
    "Audiobook"
  ],
  "author": "Gregg Jones",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/17290703-last-stand-at-khe-sanh"
}