{
  "title": "The Gap: The Science of What Separates Us from Other Animals",
  "description": "There exists an undeniable chasm between the capacities of humans and those of animals. Our minds have spawned civilizations and technologies that have changed the face of the Earth, whereas even our closest animal relatives sit unobtrusively in their dwindling habitats. Yet despite longstanding debates, the nature of this apparent gap has remained unclear. What exactly is the difference between our minds and theirs?In The Gap , psychologist Thomas Suddendorf provides a definitive account of the mental qualities that separate humans from other animals, as well as how these differences arose. Drawing on two decades of research on apes, children, and human evolution, he surveys the abilities most often cited as uniquely human -- language, intelligence, morality, culture, theory of mind, and mental time travel -- and finds that two traits account for most of the ways in which our minds appear so Namely, our open-ended ability to imagine and reflect on scenarios, and our insatiable drive to link our minds together. These two traits explain how our species was able to amplify qualities that we inherited in parallel with our animal counterparts; transforming animal communication into language, memory into mental time travel, sociality into mind reading, problem solving into abstract reasoning, traditions into culture, and empathy into morality.Suddendorf concludes with the provocative suggestion that our unrivalled status may be our own creation -- and that the gap is growing wider not so much because we are becoming smarter but because we are killing off our closest intelligent animal relatives.Weaving together the latest findings in animal behavior, child development, anthropology, psychology, and neuroscience, this book will change the way we think about our place in nature. A major argument for reconsidering what makes us human, The Gap is essential reading for anyone interested in our evolutionary origins and our relationship with the rest of the animal kingdom.",
  "genres": [
    "Science",
    "Nonfiction",
    "Evolution",
    "Psychology",
    "Anthropology",
    "Biology",
    "Animals"
  ],
  "author": "Thomas Suddendorf",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/17290783-the-gap"
}