{
  "title": "The Murder Book",
  "description": "In seventeen consecutive bestselling novels, Jonathan Kellerman has distinguished himself as the master of the psychological thriller. Now in Kellerman's most compelling and powerful novel yet, L.A. psychologist-detective Alex Delaware confronts a long-unsolved murder of unspeakable brutality -- an ice-cold case whose resolution threatens his survival, and that of longtime friend, homicide detective, Milo Sturgis.The nightmare begins when Alex receives a strange package in the mail with no return address. Inside is an ornate album filled with gruesome crime scene photos -- a homicide scrapbook entitled The Murder Book. Alex can find no reason for anyone to send him this compendium of death, but when Milo views the book, he is immediately shaken by one of the images: a young woman, tortured, strangled, and dumped near a freeway ramp. This was one of Milo's first cases as a rookie homicide cop: a vicious killing that he failed to solve, because just as he and his training partner began to make headway, the department closed them down. Being forced to abandon the young victim tormented Milo. But his fears prevented him from pursuing the truth, and over the years he managed to forget. Or so he thought.Now, two decades later, someone has chosen to stir up the past. As Alex and Milo set out to uncover what really happened twenty years ago, their every move is followed and their lives are placed in jeopardy. The relentless investigation reaches deep into L.A.'s nerve-centers of power and wealth-past and present. While peeling back layer after layer of ugly secrets, they discover that the murder of one forgotten girl has chilling ramifications that extend far beyond the tragic loss of a single life.A classic story of good and evil, sacrifice and sin, The Murder Book is a gripping page-turner that illuminates the darkest corridors of the human mind. It is a stunning tour de force.",
  "genres": [
    "Mystery",
    "Fiction",
    "Crime",
    "Thriller",
    "Mystery Thriller",
    "Suspense",
    "Audiobook"
  ],
  "author": "Jonathan Kellerman",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/172938.The_Murder_Book"
}