{
  "title": "Tell, Don't Show!",
  "description": "This book will dramatically change the way you write your next first draft. And your next, and your next... The technique I share within these pages is extremely easy to learn and do. You will be able to start using it now, today, and see immediate differences in your writing.It's also a fast read. I've condensed the book down to just a handful of pages, so you can read it all in less than an hour. I know what it's like to try and improve my writing by reading books on how to write. Too much time is lost wading through pages and pages of filler. And the more of these books that we read, the thicker our brains become, with too many details and steps and opinions. This book is different. Read it over lunch, and then go try it out. You'll see for yourself that it works.Here is a bit more about why Tell, Don't Show! is truly worth your time.First of all, the words will come much easier. I promise it. I've seen it transform the writing of many students and friends over the years, and before that, my own writing. The technique is so simple that you won't have any excuse for not using it the next time you sit down to write. It's a real pleasure to write this way. Forget about being a suffering writer. With this one little technique, you'll actually learn to love the process of writing.And do you ever wonder why you aren't writing so much? Do you think that if you could write faster, much faster, you'd want to write more? We're not talking about blindly banging away at the keys, but rather, quickly penning powerful stories and novels in a fraction of the time it takes you right now. That is, if you're even writing now. The truth is that when our writing is too slow and introspective, we lose momentum, and sooner or later, we finally stop. Don't do that. Write faster. The technique I'm sharing in this book will show you how to write faster and a lot more than you are now.Finally, by using this technique, you'll find your creativity expanding by the hour, by the day! It will free up your imagination to focus on the big picture, lifting you up and away from both micromanagement and nitpickiness, such common traps during first drafts. Your stories will grow richer and deeper, and you'll find yourself seeing your characters and settings more vividly. Subtext and subplots will rise up and beg for your attention. And this is just the beginning.You'll find all of the above and much more in Tell, Don't Show!",
  "genres": [
    "Writing",
    "Nonfiction",
    "Reference"
  ],
  "author": "James Lofquist",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/17296621-tell-don-t-show"
}