{
  "title": "Song of the Six Realms",
  "description": "Judy I. Lin, #1 New York Times bestselling author of A Magic Steeped in Poison, weaves a dreamy gothic romance worthy of the heavens in Song of the Six Realms.Xue, a talented young musician, has no past and probably no future. Orphaned at a young age, her kindly poet uncle took her in and arranged for an apprenticeship at one of the most esteemed entertainment houses in the kingdom. She doesn’t remember much from before entering the House of Flowing Water, and when her uncle is suddenly killed in a bandit attack, she is devastated to lose her last connection to a life outside of her indenture contract.With no family and no patron, Xue is facing the possibility of a lifetime of servitude playing the qin for nobles that praise her talent with one breath and sneer at her lowly social status with the next. Then one night she is unexpectedly called to the garden to put on a private performance for the enigmatic Duke Meng. The young man is strangely kind and awkward for nobility, and surprises Xue further with an irresistible offer: serve as a musician in residence at his manor for one year, and he’ll set her free of her indenture.But the Duke’s motives become increasingly more suspect when he and Xue barely survive an attack by a nightmarish monster, and when he whisks her away to his estate, she discovers he’s not just some country noble: He’s the Duke of Dreams, one of the divine rulers of the Celestial Realm. There she learns the Six Realms are on the brink of disaster, and incursions by demonic beasts are growing more frequent.The Duke needs Xue’s help to unlock memories from her past that could hold the answers to how to stop the impending war… but first Xue will need to survive being the target of every monster and deity in the Six Realms.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Romance",
    "Mythology",
    "Fiction",
    "Young Adult Fantasy",
    "Historical Fiction"
  ],
  "author": "Judy I. Lin",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/172979755-song-of-the-six-realms"
}