{
  "title": "Don't Talk to Strangers",
  "description": "\"An explosive read . . . Amanda Kyle Williams sets the classic private eye novel on fire.\"--#1 New York Times bestselling author Lee ChildHailed by The Atlanta Journal-Constitution as \"one of the most addictive new series heroines,\" Keye Street is the brilliant, brash heart of a sizzling thriller full of fear and temptation, judgments and secrets, infidelity and murder.\nHe likes them smart.\n \n \n In the woods of Whisper, Georgia, two bodies are found: one recently dead, the other decayed from a decade of exposure to the elements. The sheriff is going to need help to track down an experienced predator--one who abducts girls and holds them for months before ending their lives. Enter ex-FBI profiler and private investigator Keye Street.\nHe lives for the struggle.\n \n \n After a few weeks, Keye is finally used to sharing her downtown Atlanta loft with her boyfriend, A.P.D. Lieutenant Aaron Rauser. Along with their pets (his dog, her cat) they seem almost like a family. But when Rauser plunks a few ice cubes in a tumbler and pours a whiskey, Keye tenses. Her addiction recovery is tenuous at best.\nAnd loves the fear.\n \n \n Though reluctant to head out into the country, Keye agrees to assist Sheriff Ken Meltzer. Once in Whisper, where the locals have no love for outsiders, Keye starts to piece together a psychological profile: The killer is someone who stalks and plans and waits. But why does the sociopath hold the victims for so long, and what horrible things must they endure? When a third girl goes missing, Keye races against time to connect the scant bits of evidence. All the while, she cannot shake the chilling feeling: Something dark and disturbing lives in these woods--and it is watching her every move.Praise for Amanda Kyle Williams and Don't Talk to Strangers \n \n \"There's a new voice in Atlanta, and her name is Amanda Kyle Williams.\"--Julia Spencer-Fleming, New York Times bestselling author \"One of the most addictive new series heroines since Stephanie Plum.\"--The Atlanta Journal-Constitution   \"Keye Street is my kind of detective--complicated, savvy, flawed, and blessed with a sharply observant dark wit.\"--Joshilyn Jackson, New York Times bestselling author \"Both Williams and Street should be around for the long haul, so discover them now from the start.\"--Alafair Burke, author of Long Gone   \"The exciting thing about Williams' writing is how easily she draws the reader into the drama of the story . . . and she adds enough twists and turns to keep the reader off kilter to the very end.\"--The Huffington PostFrom the Hardcover edition.",
  "genres": [
    "Mystery",
    "Thriller",
    "Fiction",
    "Crime",
    "Suspense",
    "Mystery Thriller",
    "Audiobook"
  ],
  "author": "Amanda Kyle Williams",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/17297045-don-t-talk-to-strangers"
}