{
  "title": "Nobody's Perfect",
  "description": "NOBODY'S PERFECT is the continuing story of Savannah Gentry (now Savi Baker) and Damián Orlando from MASTERS AT ARMS & NOBODY’S ANGEL (Rescue Me Saga #1) and NOBODY'S HERO (Rescue Me Saga #2). Savannah/Savi escaped eleven years of abuse at the hands of her father and finally made a safe life for herself and her daughter. But when her father once again threatens her peace of mind—and her daughter’s safety—Savi runs to Damián Orlando for protection. Eight years earlier as Savannah, she shared one perfect day with Damián that changed both their young lives and resulted in a secret she no longer can hide. But being with Damián reawakens repressed memories and feelings she wants to keep buried. After witnessing a scene with Damián on Savi's first night at his private club, however, she begins to wonder if he could help her regain control of her life and reclaim her sexuality and identity. Damián, a wounded warrior, has had his own dragons to fight in life, but has never forgotten Savannah. He will lay down his life to protect her and her daughter, but doesn’t believe he can offer more than that. She deserves a whole man, something he can never be after a firefight in Iraq. Damián has turned to SM to regain control of his life and emotions and fulfills the role of Service Top to “bottoms” at the club. However, he could never deliver those services to Savi, who needs someone gentle and loving, not the man he has become. Will two wounded survivors find love and healing in each other’s arms? ABOUT THE RESCUE ME The books in the ongoing Rescue Me Saga are not stand-alone stories and should be read in order. Characters will recur in later books to deal with further issues in their lives as the saga continues and each book builds upon all previous ones. Sometimes main characters even need another book to help resolve major issues affecting their relationships. BONUS MATERIAL in this Kallypso Masters has added the PLAYLIST of music that inspired her as she wrote about the first three couples mentioned in this combined volume, as well as a GLOSSARY OF TERMS and a CAST OF CHARACTERS in these books in the saga. CONTENT These books are intended for mature adult readers who are not offended by profanity and graphic (but never gratuitous!) sex scenes. Due to the emotional way in which the author presents the subject matter in the characters’ lives (past and present), the books might cause triggers while reading. Please click the preview to read the Author's Notes at the beginnings of each book before reading.",
  "genres": [
    "BDSM",
    "Erotica",
    "Romance",
    "Military Fiction",
    "Contemporary Romance",
    "Contemporary",
    "Abuse"
  ],
  "author": "Kallypso Masters",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/17299927-nobody-s-perfect"
}