{
  "title": "How To Write An eBook In 40 Days",
  "description": "How to Write an eBook in 40 Days (or less!) is part motivational technique and part helpful guide, but 100% useful for first-time authors looking to meet the challenge of writing a manuscript in 40 days. Written based on the author’s experience as a three time winner of NanoWrimo, as a professional ghost writer, and as a regular blogger, this book presents the methods she personally used to overcome such hurdles as finding the time to write, finding the motivation to keep going, and even covers what to do when you fail to achieve your goal.Warning: This book is not a shortcut to writing.The author does not pretend to offer a writing shortcut to anyone. Even when the manuscript is finished, readers should be ready to devote time to rewriting and editing the manuscript. However, this book will help readers: come up with ideas for non-fiction book topics and create a basic outline; create a main character for a fiction novel and a backstory to go with it; map out the amount of time available to work on this book and set appropriate goals based on that time; form a group that will provide support for the writing effort; fight off writer burnout and stay motivated.Warning: This book does not offer a get-rich quick scheme.Writers purchasing this book should not expect to create the next Harry Potter series in 40 days, nor should they expect their writing to wind up on the New York Time’s Best Seller’s List. What this book will give the reader at the end of 40 days is a diamond-in-the-rough which can be shaped and formed into something suitable for publication. What readers will get out of the time they devote to writing is a guaranteed sense of accomplishment, a working manuscript, and the ability to claim the title author at any cocktail parties, family reunions, or high school reunions they might attend.Warning: Not responsible for Compulsive Writer’s DiseaseThose who suffer from Compulsive Writer’s Disease (CWD) frequently experience serious changes in their lifestyle including: loss of time spent playing video games, decreased reaction times in first-person shooter games, increased awareness of proper usage of grammar and spelling, and loss of interest in watching T.V.CWD presents itself in the following symptoms: an obsessive need to write daily; viewing of friends, relatives, co-workers, and complete strangers as potential characters for a book; notebooks and hard drives filled with ideas for the next book; writer’s cramp and carpal tunnel syndrome. The author and publishers of this book are not responsible for any writers who may manifest these symptoms after reading this book.",
  "genres": [],
  "author": "Brandy Miller",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/17301859-how-to-write-an-ebook-in-40-days"
}