{
  "title": "Trouble at Toff Towers",
  "description": "Meet Louisa Toff, a St Thinnian’s old girl who still lives by the old school motto: “Outdo and move on”. Louisa enjoyed her heyday in the 1960s/70s (when she was a top model with the Bone Idol Model Agency) and is now trying her best to stay in the limelight, cashing in on today’s celebrity culture, helped (well, hindered usually) along the way by an assortment of madcap characters. Louisa, or ‘Ell - The Glowering Inferno as she was (unfairly, she thought) christened by the Press, is happily married to millionaire Jack Toff and goes to great lengths to keep it that way. After all, it is easier and quicker to have sex with Jack than to make up an excuse not to and when you’ve found someone like that you hang onto them!Both ‘Ell and Jack get along famously with her ex-husbands, Hugh Jass and Stu Pendous. Hugh is very good looking if rather vain. He was one of the most celebrated actors of the 1960s/70s. Stu is a rock singer. You remember The Who, of course. Stu was front man for their rival band The Why. They split up when two of the members died. It was (almost) classic rock n roll. You’ve heard of people choking on their own vomit. Well, these two choked on each other’s! Stu made a swift exit and formed his current band, The What On Earth Four.‘Ell stumbles from one crisis to the next, constantly trying to manipulate the Press to her own advantage. Things rarely go smoothly but, with the help of her Analyst, Di Laffin and her PR Agent, Sue Perdooper, she usually manages to take something positive from each unfortunate experience, and there are plenty of them! However, she does manage to enjoy some success with various business enterprises and it is when she launches her Food For Toffs range and gets mixed up with Sardino Codleone of Finned-Us Frozen Foods that things start to get a little (more) complicated (than usual) at Toff Towers.",
  "genres": [],
  "author": "Anne Ullah",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/17301763-trouble-at-toff-towers"
}