{
  "title": "The Omega Paradox",
  "description": "Something new walks the face of the Earth.A scientific mystery on a collision course with occult and religious beliefs.Some believe he is a new phase in human evolution; others believe he is the Second Coming of Jesus Christ - the New Messiah.It all started as a mild preoccupation for geneticist Tim Leigh; then swiftly blossomed into a full blown obsession. Never a moment can go by without him being drawn to the series of framed prints on his office wall. As he stares at the images, the images stare back through dark inscrutable eyes. There they sit, little fat Buddhas, challenging him to solve the mystery behind their imperturbable gaze.The images Tim gazed at in this daily mind-game were a series of ancient acupuncture charts; but behind their deceptive facade lay hidden a mystery that had survived down the ages. An ancient enigma waiting to be revealed.Rachel Kardo had no idea what she was being roped into when she agreed to help a colleague investigate what he believed to be a hidden message within ancient medical charts. Before she knew it she was at the centre of the most extraordinary events in human history. Some say it is a New Beginning, some say it is the End of Days for humanity as we know it. Only one thing is certain; by whatever forces rule our fate it has been decreed that the time for a new beginning is now.The ancient code is decrypted and the message reveals something deeply mystifying, unprecedented and bizarre. An event that will change everyone's lives – forever.Now there is something new on the surface of the Earth; a thing more hotly argued over and disputed or accepted than any previously revealed scientific discovery. Whichever side of the argument you choose to adopt there is an opposing force that intends to destroy your belief system. Descendants of a Nazi Elite who have remained hidden while still engaged in their evil pursuits set out to destroy the promised new beginning.Nazi scientists embark on a project to create a super-race. What they actually create is an abomination of the human form – a being inherently evil. It's Creator, Erica Wiligut, is the nemesis of all that is good - to some she will be seen as the Anti-Christ.Events culminate in the ultimate battle between good and evil – played out at one of mankind's most sacred religious locations – and a revelation for all humanity.Be warned: All is not what it seems.Could the Second Coming of Jesus Christ be revealed in ancient code? Or is the Omega Man a new and evolved type of human.FIVE STAR REVIEWS (Reader reviews from Amazon)MINDBLOWING:- I couldn't put it down! Can't wait for future books. Really makes you want to find out what's real, theory, or fiction. Very well written. No filler stories or background fluff. Don't mind missing a night of sleep for a book like this!A CRACKING GOOD READ:- Loved this book, really original plot and I shall certainly be first in line for the second book by this author.",
  "genres": [],
  "author": "Richard Kellier",
  "average_rating": "3.46",
  "url": "https://www.goodreads.com/book/show/17302022-the-omega-paradox"
}