{
  "title": "The Unholy Bible: Exposing the Lies Your Sunday School Teacher Told You",
  "description": "Publisher's Description:This book makes the argument that Christians are “someone who has not read the Bible,” because when subjected to even a moderate amount of scrutiny, the Bible falls to pieces. It provides quotes of all the horror that the Bible contains like the slaughter of entire cities, rape, and even baby killing. And it shows that the prophecy Jesus made about the end of the world failed.Harris provides an eye-opening critique of the Bible, showing that the least-read, most-sold book in all of history is a work of fiction.From the Introduction:Most of what people are taught about Christianity seems to be interpretation and not what the Bible actually says. And, even then, Christians seem to preach what they want the Bible to say, which sometimes can’t even be interpreted from it.Throughout this book we will look at what the Bible actually says and show that a Christian can only be someone who has not read the Bible, because it is so filled with inconsistencies and outright errors that no one could believe in it if they actually knew what the Bible said.Throughout this book, we will take a look at quotes that show the Christian God is more of a monster than something to be worshipped. And many of the passages we will examine show that God displays less compassion than normal human beings would in the same situation. We will also see that Jesus’ prophecy about the end of the world failed; that Satan is not the evil enemy of God the Church makes him out to be; that the conception of the afterlife in the Old and New Testaments are so different that they seem to come from two different religions; that many observable facts of nature contained in the Bible are completely wrong as well as the creation story of Genesis.Essentially, this book will show that the Sunday School Christianity that everyone learns is a lie and that Christianity is not something that people should shape their lives with.",
  "genres": [],
  "author": "Nathan Harris",
  "average_rating": "4.68",
  "url": "https://www.goodreads.com/book/show/17302401-the-unholy-bible"
}