{
  "title": "Archangel",
  "description": "Wrapping his arms tightly around her, Ashton pulled Roxy against the chiseled-muscular-perfection that was his body. Waiting patiently for her defiance to crumble, he lightly traced his lips over hers, beckoning her like a siren. She could almost taste his irrefutable hunger when she finally gave into him. A deep moan escaped his throat as she trembled under his embrace. She gasped when he finally released her of his enslaving kiss. Hitherto, Ashton never demanded that she disclose her secret about the blood-lust urges that ruled her body. Even so, his curiosity burned in his hauntingly exquisite, blue-green eyes. “Who poisoned your heart with animosity, my beloved?” Ashton whispered so quietly she hardly heard him. “Silencing your urges by dirtying a knife with your blood is not a sight my soul can bear any longer.”Once upon a time...Two courts rule Faierie – the Seelie and Unseelie. Seelie faie are recognized for their illusionists and magic that mimics fantasy. The darker, wicked Unseelie are coveted for their extraordinary senses and trickery spells. Their rivalry flourishes between their courts, especially when seemingly random faie turn up missing and dead. Accompanied by her guardian lover, Roxy is appointed to unmask the criminal mastermind. As evidence leads her back to the Goblin Territory – the very place where her destructive, blood-lust tale began – her guarded, dark past unravels. Unseelie accusations develop as she attempts to keep her secrets hidden. They scrutinize Roxy’s association with the atrocious goblins and suspect her murderous involvement. However, what’s more alarming than the allegations, is the growing suspicion and distrust in her lover eyes. With each clue uncovered, he gets closer to discovering the truth behind it all, which has unforeseeable consequences...",
  "genres": [],
  "author": "Sarah J. Pepper",
  "average_rating": "4.71",
  "url": "https://www.goodreads.com/book/show/17303215-archangel"
}