{
  "title": "نساء ولكن",
  "description": "أؤمن أن المرأة عندما تتحول إلى أم تصبح جنساً ثالثاً لا هو رجل ولا هو امرأة!!\"، و\"رائع حقا أن تصبح من الجنس الثالث لكنه صعب..صعب جداً\"، تقول الكاتبة في مقدمة روايتها المتماسكة بنياناً ولغة، المشبعة بالأحداث والتفاصيل. رواية يطغى عليها التحليل النفسي والاجتماعي لشخصيات متعددة من النساء والرجال، تحكّمت بها الراوية بحنكة، كي لا تفلت من الإطار التي أرادت وضعها به، ومن السياق الذي أرادته لها. فهي لا تحكم عليها ولا تلومها ولا توبخّها على أفعالها المسيئة أو المشينة، بل على العكس من ذلك أحياناً، تقوم بتبرير تصرفاتها وتعاطيها، فلا تدين الضعف الإنساني والأذى الناتج عنه بقدر ما تبحث عن أسبابه وظروفه ودوافعه. فـ \"كلنا مكسورين حنخاف على إيه تاني\"، و\"هو دا اللي بيحصل لكل الغلابة!\"، و\"ليه الشعور بالأمن والأمان أصبح رفاهية تتمتع بها طبقات معينة ويحرم منها السواد الأعظم من المواطنين.. ليه مفهوم وطن نفسه اختلف بهذه القسوة.. ليه؟!\".\"الأمومة\"، و\"الإعاقة\"، هما الموضوعان \"المفصلان\" اللذان يحركان الحدث، ويحددان المشاعر المختلفة والمواقع المتعددة لمعظم الشخصيات، وهما اللذان تدور حولهما المواضيع الأخرى كالحب، والحقد والفقر والموت والكبرياء والتعالي والانتهازية، وغيرها من المفاهيم والمواضيع التي قد لا تقل أهمية.تبدأ الرواية بشخصية \"د. منصور دياب\" الاستثنائية، التي ستواجه حقيقة موتها القريب، إذ يكتشف منصور أنه مريض بالسرطان. فإلى ما ستؤول حالة ابنتيه من بعده؟ خاصة أن إحداهما \"رباب\" ولدت معاقة بتخلّف عقلي، والثانية \"سميحة\" فرض عليها لعب جميع الأدوار، بعد أن تركتهم أمهما \"نوال\" التي لم تحتمل فكرة العيش اليومي مع ابنة معاقة، فتزوجت ثانية من \"طاهر\" صديق زوجها السابق، وأنجبت منه ابنها \"ماجد\". وتتشعب المواضيع بتكاثر الشخصيات، كشخصية \"أحمد\" معدّ البرنامج التلفزيوني المغرم بسميحة التي تحبه، لكنها ستتزوج \"علاء\"، و\"أم سعيد\" التي أمضت عمرها في خدمة منصور، تعيش مع \"سيد\" ابنها الذي يسلبها كل ما تجنيه لينفقه على المخدرات، و\"سعيد\" ابنها الذي يعمل خارج البلاد، و\"عزيزة\" خطيبته ذات الأصول المتواضعة التي لم تعد قادرة على انتظاره، فتبيع نفسها للحج \"محروس\"، فهي إن كانت \"اختارت العار، فالخطيئة هي التي اختارت عزيزة يوم ولدت من أم قاسية وأب فقير\". كل من هؤلاء الأشخاص \"يكتفي بما يعلمه.. كل منهم يظن أنه يعلم أكثر من الآخر.. والحقيقة تبقى أن كلا منهم يجهل أكثر من الآخر..\".رواية ممتعة، غنية بأحداثها وبتنوع شخصياتها، وبعواطفها وانفعالاتها، وتعدد مواضيعها، وبتحليلاتها \"الحنونة\" لتركيبات إنسانية فرزتها تركيبة اجتماعية هي التي يجب أن تدان.",
  "genres": [
    "Novels"
  ],
  "author": "نور عبدالمجيد",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/10776267"
}