{
  "title": "Outview",
  "description": "Hearing voices, seeing visions, reading minds...He might be crazy.Then why is the CIA after him?Click now to start reading!A mystical adventure from the USA Today bestselling author (a million books sold/downloaded) of The Last Librarian and The Cosega Sequence.Only the thinnest veil separates life and death. For thousands of years, humans have sought to lift it. Imagine the secrets waiting for discovery, insights into the unknown, and powers beyond the possible. Nate wondered. After the death of his father, the loss of his brother, and mysterious messages, he finds himself enmeshed in a centuries-old conspiracy to hide the truth about what lies beyond that veil. He must juggle prophecies and mystic knowledge, trace a quest across countless lifetimes, and grasp a complex destiny, before he can unravel the ancient puzzle. Scores have died to protect the secrets. The \"trusted\"few whispered clues, guarded locations, and hid keys to what humanity was not yet ready for. Until Nate found a way. Those protecting the “veil” know he did. And so do the ones who have been searching since before he was born. At the same time, a clandestine group, wielding overwhelming power, wants him silenced. Nate is running. _________________________________________________________________Readers who enjoy contemporary, urban fantasy, metaphysical genres and books such as David Mitchell’s Cloud Atlas and The Bone Clocks, Paulo Coelho’s The Alchemist, Neil Gaiman’s The Ocean at the End of the Lane, James Redfield’s The Celestine Prophecy, Dan Millman’s Way of the Peaceful Warrior, Night Circus and Snow Child are sure to love The Inner Movement trilogy – A mystical adventure . . . a metaphysical thriller. The Inner MovementInternational Bestseller – hundreds of thousands of copies sold/downloaded! 1000+ 5-Star reviews worldwide! Thousands of To-Read and recommended lists. #1 Fantasy #1 Metaphysical & Visionary #1 Conspiracy Thriller Find out why a million copies of Brandt Legg's books have been sold/downloaded worldwide.The entire series is available now!OUTVIEW (Inner Movement #1)OUTIN (Inner Movement #2)OUTMOVE (Inner Movement #3)Also By Brandt LeggCOSEGA SEARCH (Cosega Sequence #1)COSEGA STORM (Cosega Sequence #2)COSEGA SHIFT (Cosega Sequence #3)COSEGA SPHERE (Cosega Sequence #4)THE LAST LIBRARIAN (Justar Journal #1)THE LOST TREERUNNER (Justar Journal #2)THE LIST KEEPERS (Justar Journal #3)CapWar ELECTION (CapStone Conspiracy #1) CapWar EXPERIENCE (CapStone Conspiracy #2) CapWar EMPIRE (CapStone Conspiracy #3)",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Paranormal",
    "Fiction",
    "Mystery",
    "Time Travel",
    "Thriller"
  ],
  "author": "Brandt Legg",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/17304282-outview"
}