{
  "title": "Tales of Madness and Murder",
  "description": "Four stories, together embodying mystery, horror, fantasy, comedy, written in a period of fifty years, all having two elements in common---a crazy protagonist, and a homicide. And for good measure, I’ve thrown in a synopsis and excerpts from my science fiction novel, The Laughing Man---a novel of a superman.The earliest of the four stories in this book was written when I was in my twenties, the latest in my seventies. One day, looking over them, I noticed a certain unity of theme---all four were about a guy who was nuts, and all involved a homicide. Thus the title, Tales of Madness and Murder was inevitable for this volume which brings them together. So, there they are, along with a synopsis and excerpts from my novel, The Laughing Man---a novel of a superman.---“The Center of the Universe” The title of this story might be misleading. It is not science fiction, but refers to the theme of man’s attempt to defend his ego against reality. It was first published in 1962. I considered updating it, but decided it better to let it stand in the original. Younger readers who never heard of Brigitte Bardot can Google her.---“Nemesis”  The origin of this story recalls the circumstances under which Frankenstein was written. My wife and I used to attend a regular get-together where we viewed classic movies and read stories and poetry. One time it was decided that another aspiring writer and I would each write a story on the same theme, to be read at the next meeting.We kicked possible themes around, and one fellow called out “Revenge!” His suggestion was followed, and this story was my contribution.---“The Nine Lives of Professor LeBaron”A typical deal with the Devil? Naw, the ol’ boy already has Lucas LeBaron’s soul. He’s just doing him a favor---or, rather, nine favors---out of the goodness of his tender heart. Brian Koscienski, editor of the fine genre magazine Trail of Indiscretion, gave me excellent suggestions to sharpen up this story.---Shriek! Shriek! Shriek!This turned out to be a mystery, fantasy, horror, comedy story. What more could you want?---The Laughing Man---a novel of a superman Synopsis (without a spoiler) and excerpts",
  "genres": [],
  "author": "John LaCarna",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/17305331-tales-of-madness-and-murder"
}