{
  "title": "Games of Fate",
  "description": "Rysa Torres’s stumbles through life an overwhelmed young woman fighting against her attention deficit disorder. She can’t get a handle on the world, no matter how she tries. But when monsters activate a part of her she didn’t know she had, Rysa becomes the Fate at the center of an epic battle against a terrifying future—and a world consumed by fire.When Ladon and his companion beast, Dragon, find Rysa, they see only the potential hell a young Fate might unleash into their lives. But Ladon quickly realizes Rysa is much more than the daughter of an old enemy—she is his key to forgiveness.With the threat of a burning future distorting Rysa’s Fate abilities, she sees only two options: End her own life, or watch Ladon, the only man to see beyond her attention issues and love her for who she is, die. Will they accept the only future they see, or will they find the strength to break the bonds of fate?The Fate - Fire - Shifter - Dragon Series:New Adult Urban Fantasy RomanceThe Fate - Fire - Shifter - Dragon series takes Rysa and Ladon—and Ladon’s companion beast, Dragon—through a landscape punctuated by unfamiliar creatures: Fates with the ability to see past, present, and future. Ghouls called Burners who devour with fire and acid. Shifters who shape much more than their bodies. And two dragons who speak with color and pattern. #0 Prolusio: Three Prelude Stories of Fates Fire Shifters and Dragons. #1 Games of Fate: It’s not a good love story until something explodes.#1.5 Conpulsio: A Fate ~ Fire ~ Shifter ~ Dragon novella of binding and compulsion.#2 Flux of Skin: All Shifters understand fury. Now they learn rupture.#3 Fifth of Blood: Available now.#3.5 Silence: Coming Summer 2014.",
  "genres": [
    "Dragons",
    "Paranormal",
    "Fantasy",
    "Shapeshifters",
    "Romance",
    "Urban Fantasy",
    "Paranormal Romance"
  ],
  "author": "Kris Austen Radcliffe",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/17305194-games-of-fate"
}