{
  "title": "Pimped to Satan",
  "description": "Pimped to Satan by Joslyn Corvis, Cover Art by Dan Dillard.Official Release Date: February 13, 2013Horror at its raunchiest!Pimped to Satan (Unofficial title: \"Brosmary's Baby\")\"I probably would've called the story \"Brosmary's Baby\" if I had to choose a name, but that's just because it strikes me as funny.\"---from reader Ed Rendon Phil answers an orgy party invite on Gregslist, but what he thinks is going to be a night of complete sexual debauchery turns into an experience that will change his life forever. Not long after the party, the smells at Phil’s fast-food job, as well as other aromas, start to trigger his gag-reflex, leaving him in a constant state of nausea. His best friend and roommate, Manny, becomes concerned and makes him see a doctor, but with Phil having no insurance he has no choice but to seek help from Ned, a schoolmate since Kindergarten who is now a doctor. Although Phil is hesitant to ask for Ned’s expertise after victimizing him with childish prank after prank, even years after high school, he is also just that desperate. New to the medical field, Ned was still in the habit of consulting with his father, also a doctor, before treating a patient, but this time he had to use his own medical knowledge to figure out what’s wrong with Phil. He runs the simplest test he can think of to find a possible cause for Phil’s perpetual stomach ailment: An ultrasound. Ned’s diagnosis? “It’s a…baby?” But it’s not just any baby. This baby appears to have a tail. And horns. And cloven feet. Phil has been PIMPED TO SATAN.Read on as the awkwardly homoerotic, yet touchingly sweet, relationship between Phil and Manny blossoms as they go through the ups and downs of Phil’s Devil-Baby pregnancy together. It’s a horrorifically heartwarming story about Bromance and the unconditional love a new parent holds for their child…Even if that child is the spawn of Satan.(Less)",
  "genres": [],
  "author": "Joslyn Corvis",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/17305619-pimped-to-satan"
}