{
  "title": "I Want To Be Popular",
  "description": "Rewritten and revised as of 4/19/13What could be more important to a girl just about to turn sixteen, than being popular? It can be all consuming, but the popular crowd is a difficult crowd and trying to fit in can be painful. High school gossip spreads quickly and mean girls who can be cruel and selfish fill the halls. They rule the school and decide with the flick of an eye who will be an outcast.  For Brittney Ellis, someone who has always been on the outside looking in, the world of the popular kids is heaven. In her mind, these girls are the most fortunate people because they have great clothes, beauty, and boyfriends. They walk the high school halls like royalty. Little does Brittney realize that the popular girls have problems too. They just hide them well. Brittney also has a secret, one that makes her yearn so badly she cannot sleep. Brittney is in love with Chase, one of the top football stars. He does not even know she exists. To make matters worse, she has other issues that threaten to destroy her, like an eating disorder that left as a scar on her soul from a devastating childhood experience.  Even with all of the heartache in Brittney’s life, there is still a bright and shinning light. Sadly, Brittney stands blinded by what she thinks she wants and consequently does not recognize the good things she has. Brittney is blessed with genuine, caring friends, even if they are not the most popular kids. Mark a science and computer nerd and Alicia an art enthusiast are always there for her. Nevertheless, Brittney has grown tired of being the outcast, so she undertakes a project to make major changes in herself. Changes she believes will win her Chase’s romantic attentions.  Meanwhile there are elements stirring under the surface, and although Brittney is not aware of it, she is about to learn that one of her close friends has a secret that will change Brittney’s life forever. If you like “Gossip Girl,” “Mean Girls,” or “Glee” then you’ll love, “I want To Be Popular.”",
  "genres": [],
  "author": "Roberta Kagan",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/17306415-i-want-to-be-popular"
}