{
  "title": "The Hunger Games and Philosophy: A Critique of Pure Treason",
  "description": "A philosophical exploration of Suzanne Collins's New York Times bestselling series, just in time for the release of The Hunger Games movie Katniss Everdeen is \"the girl who was on fire,\" but she is also the girl who made us think, dream, question authority, and rebel. The post-apocalyptic world of Panem's twelve districts is a divided society on the brink of war and struggling to survive, while the Capitol lives in the lap of luxury and pure contentment. At every turn in the Hunger Games trilogy, Katniss, Peeta, Gale, and their many allies wrestle with harrowing choices and ethical dilemmas that push them to the brink. Is it okay for Katniss to break the law to ensure her family's survival? Do ordinary moral rules apply in the Arena? Can the world of The Hunger Games shine a light into the dark corners of our world? Why do we often enjoy watching others suffer? How can we distinguish between what's Real and Not Real? This book draws on some of history's most engaging philosophical thinkers to take you deeper into the story and its themes, such as sacrifice, altruism, moral choice, and gender.Gives you new insights into the Hunger Games series and its key characters, plot lines, and ideas Examines important themes such as the state of nature, war, celebrity, authenticity, and social class Applies the perspective of some of world's greatest minds, such as Charles Darwin, Thomas Hobbes, Friedrich Nietzsche, Plato, and Immanuel Kant to the Hunger Games trilogy Covers all three books in the Hunger Games trilogy An essential companion for Hunger Games fans, this book will take you deeper into the dystopic world of Panem and into the minds and motivations of those who occupy it.",
  "genres": [
    "Philosophy",
    "Nonfiction",
    "Essays",
    "Pop Culture",
    "Books About Books",
    "Psychology",
    "Textbooks"
  ],
  "author": "George A. Dunn",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/10776887-the-hunger-games-and-philosophy"
}