{
  "title": "Carl B. Stokes and the Rise of Black Political Power",
  "description": "As the first elected black mayor of a major U.S. city, Cleveland's Carl B. Stokes embodied the transformation of the civil rights movement from a vehicle of protest to one of black political power.In this wide-ranging political biography, Leonard N. Moore examines the convictions and alliances that brought Stokes to power. Impelled by the problems plaguing Cleveland's ghettos in the decades following World War II, Stokes and other Clevelanders questioned how the sit-ins and marches of the civil rights movement could correct the exclusionary zoning practices, police brutality, substandard housing, and de facto school segregation that African Americans in the country's northern urban centers viewed as evidence of their oppression. As civil unrest in the country's ghettos turned to violence in the 1960s, Cleveland was one of the first cities to heed the call of Malcolm X's infamous \"The Ballot or the Bullet\" speech. Understanding the importance of controlling the city's political system, Cleveland's blacks utilized their substantial voting base to put Stokes in office in 1967. Stokes was committed to showing the country that an African American could be an effective political leader. He employed an ambitious and radically progressive agenda to clean up Cleveland's ghettos, reform law enforcement, move public housing to middle-class neighborhoods, and jump-start black economic power. Hindered by resistance from the black middle class and the Cleveland City Council, spurned by the media and fellow politicians who deemed him a black nationalist, and unable to prove that black leadership could thwart black unrest, Stokes finished his four years in office with many of his legislative goals unfulfilled.Focusing on Stokes and Cleveland, but attending to themes that affected many urban centers after the second great migration of African Americans to the North, Moore balances Stokes's failures and successes to provide a thorough and engaging portrait of his life and his pioneering contributions to a distinct African American political culture that continues to shape American life.",
  "genres": [
    "History",
    "Nonfiction"
  ],
  "author": "Leonard N. Moore",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/1730756.Carl_B_Stokes_and_the_Rise_of_Black_Political_Power"
}