{
  "title": "Rags & Bones: New Twists on Timeless Tales",
  "description": "The best writers of our generation retell classic tales. From Sir Edmund Spenser's \"The Faerie Queene\" to E. M. Forster's \"The Machine Stops\", literature is filled with sexy, deadly, and downright twisted tales. In this collection, today's most acclaimed award-winning and bestselling authors reimagine their favorite classic stories and use their own unique styles to rebuild these timeless stories, the ones that have inspired, awed, and enraged them, the ones that have become ingrained in modern culture, and the ones that have been too long overlooked. They take these twelve stories and boil them down to their bones, and reassemble them for a new generation of readers. Written from a twenty-first century perspective and set within the realms of science fiction, dystopian fiction, fantasy, and realistic fiction, these short stories are as moving and thought provoking as their originators. They pay homage to groundbreaking literary achievements of the past while celebrating each author's unique perception and innovative style.Contents:Introduction: Rags & Bones: New Twists on Timeless Tales (2013) • essay by Tim Pratt and Melissa MarrThat the Machine May Progress Eternally (2013) / shortfiction by Carrie Ryan, inspired by E.M. Forster's The Machine StopsThe King of Elfland's Daughter (2013) • interior artwork by Charles VessLosing Her Divinity [Sir Hereward and Mister Fitz] (2013) / shortfiction by Garth Nix, inspired by The Man Who Would Be KingThe Sleeper and the Spindle (2013) / novelette by Neil Gaiman, inspired by Sleeping BeautyKai Lung's Golden Hours (2013) • interior artwork by Charles VessThe Cold Corner (2013) / shortfiction by Tim Pratt, inspired by Henry James' The Jolly CornerMillcara (2013) / shortfiction by Holly Black, inspired by Joseph Sheridan Le Fanu's CarmillaFigures of Earth (2013) • interior artwork by Charles VessWhen First We Were Gods (2013) / shortfiction by Rick Yancey, inspired by Nathaniel Hawthorne's The BirthmarkSirocco (2013) / shortfiction by Margaret Stohl, inspired by Horace Walpole's The Castle of OtrantoThe Shaving of Shagpat (2013) • interior artwork by Charles VessAwakened (2013) / shortfiction by Melissa Marr, inspired by Kate Chopin's The AwakeningNew Chicago (2013) / shortfiction by Kelley Armstrong, inspired by W. W. Jacob's The Monkey's PawThe Wood Beyond the World (2013) • interior artwork by Charles VessThe Soul Collector (2013) / shortfiction by Kami Garcia, inspired by the Brothers Grimm's RumpelstiltskinWithout Faith, Without Law, Without Joy (2013) / shortfiction by Saladin Ahmed, inspired by Sir Edmund Spenser's Faerie QueeneGoblin Market (2013) • interior artwork by Charles VessUncaged (2013) / shortfiction by Gene Wolf, inspired by William Seabrook's The Caged White Werewolf..",
  "genres": [
    "Fantasy",
    "Short Stories",
    "Young Adult",
    "Anthologies",
    "Fiction",
    "Retellings",
    "Fairy Tales"
  ],
  "author": "Melissa Marr",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/17310066-rags-bones"
}