{
  "title": "Bound by Wolves",
  "description": "Rachel and her best friends are off to spend a girl's weekend together in the mountains. No Men Allowed. The girls get drunk and a little too raunchy the night before their big climb, secretly wishing they had men around to fill their appetites, little do they know that they are being watched. The next day Rachel is captured by a masculine werewolf who ties her up and has his way with her tight human body. Rachel can't get enough of his powerful lustful fucking, she gets her wish when she's taken away to his den for more.Read on for a small taste of what's inside:She could feel her pussy lubricating itself, her body imagining for itself what it would need to handle such a massive phallus. The side of her face began to sweat, she was consumed with a kind of desire she had only ever felt in nature. This thing, this creature, was the perfect combination of the masculine energy of the wilderness and the human-likeness of a man. Finally, she knew what he was. Something she had only ever thought of as a fairytale. A story told to scare hikers. He was a werewolf. “I thought you could only come out in the light of a full moon?” Rachel said. She was no folklore expert, but some things she knew about creatures like this. Creatures she always thought were imaginary, but would soon know to the fullest and widest extent. “You’ve been reading too much science fiction,” said Rannulf. She nodded, as much as she could with her head held tight against the tree. “Besides, sexual energy gives people nearly invincible powers. You must know that yourself. We control the moon, not the other way around.”“What do you mean by that?” she asked.“You’ll see,” he said, “if you’re lucky.”Rannulf walked closer to her, coming right up to her body, standing upright and placing his giant paws against the tree above her head. Standing near her she could see just how tall he was, towering over her, casting his shadow down her whole body. A chill came over her, and she shuddered in the wake of his presence. She could smell his fur, the woody musk of his body. The full extent of his need reached out and she felt the tip of his head grazing her thigh. “Aren’t you going to fuck me?” she asked. She had never been more ready in her life. She could feel her dripping cunt pulse with desire. She wanted to taste the fur of his chest, the musk of his thick canine cock, and to inhale the essence of his body into hers. Rannulf growled and leaned his head down toward her face, which was so much smaller than his. She realized he could take her whole head is his mouth if he wanted to, he could almost eat her whole. She looked over at his powerful jaw and saw a glimpse of his sharp teeth. She could almost feel them biting into her skin. She could imagine them tearing into her and her insides coming out, splayed on the forest floor. She couldn’t tell now if she was more afraid for her life or for her own sexual desire. Before she could decide, Rannulf leaned towards her, and put his giant man piece into her waiting feminine folds. Nature was having its way with her, and all she could do was to hang there and take it.",
  "genres": [
    "Erotica",
    "Adult",
    "Shapeshifters"
  ],
  "author": "Bree Bellucci",
  "average_rating": "2.30",
  "url": "https://www.goodreads.com/book/show/17311858-bound-by-wolves"
}