{
  "title": "Courier",
  "description": "In his daily rounds as a Washington motorcycle courier, Vietnam veteran Rick Putnam has found that the only way to blast the demons from his soul is with the sheer speed of his beloved BMW. However, the race turns very real when he suddenly becomes the target in a lethal pursuit and Rick must find out just who is trying to kill him—and why. Courier is the high-velocity thriller by long-time Washington journalist Terry Irving that slashes through the darkness at the heart of our nation’s capital. It’s a fast-paced, finely crafted foray into high-level intrigue, political corruption, and the invisible wounds of war that will keep readers hanging on as the danger threatens to spin out of control.The year is 1972 in Washington, DC, a hotbed of government secrets and fractured souls, with the Watergate Scandal heating up and the Vietnam War slowing down. One day during his courier gig, Rick unknowingly picks up a roll of news film that proves the President took money from the South Vietnamese to prolong the war. This is High Treason: a transgression that would mean not only impeachment and conviction but lifelong disgrace. A rogue CIA agent backed by a Korean assassin and two Saigon cowboys is sent to recover the film and silence Rick - permanently. Rick fights back with the assistance of some of the world’s first computer hackers, two brave congressional staffers, and a motorcycle gang leader who fought by his side in Vietnam’s toughest battle. In the middle of it all, Rick falls in love with a Native American law student who may just be able to bring some peace to his tortured soul. With its white-knuckle pace and absorbing intrigue, Courier is a heart-pumping, riveting read full of high menace, hot motorcycles, and Washington’s own brand of mayhem – the kind you never read about on the front page. It’s a must for anyone who likes their thrillers real and their motorcycles very, very fast.\"If the phrase 'a crackling good yarn' evokes an era before Twitter, Facebook, cell phones, videotape, DVDs or cable television, welcome to Terry Irving's fast-paced thriller from a bygone age. The Vietnam War is winding down; a wounded vet takes a job as a motorcycle courier at a network's Washington news bureau, and finds himself caught up in the backwash of a harrowing conspiracy. Terry Irving knows the landscape. I was there. So was he.\" ---Nightline Anchor Ted Koppel \"The year is 1972, mix the White House, the Watergate burglary, the war in Vietnam and murder in Washington and you've got a terrific story...Kudos to one of television's best producers for writing the thriller of the year!\"--- White House Reporter Sam Donaldson \"Terry was one of the most imaginative and enterprising television producers I ever worked with. It's not surprising then that \"Courier\" is a terrific page-turner with a clever backdrop and compelling characters.\"--Erik Sorenson President of MSNBC",
  "genres": [
    "Thriller",
    "Mystery",
    "Fiction",
    "Adventure",
    "Action",
    "Mystery Thriller",
    "Historical Fiction"
  ],
  "author": "Terry  Irving",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/17312647-courier"
}