{
  "title": "Boyhood Days - Book 2",
  "description": "Boyhood Days – Book two, is part of a five piece collection of Caribbean Narratives which is revered to some extent, on the actual experiences of the author and a host of other people in his time, and collectively combined to form a single story. In reality, all of the events mentioned in the book and played by its main characters are actually a combination of experiences of the author and other persons, which had sometimes occurred in different places, to different persons (other than the author) and at different time periods, but arrayed together to form one consistent line of occurrences. While the entire activities of the book itself are grounded entirely in Guyana (then British Guiana), the book’s main imaginary character, Joshua Williams (called Josh) depicts a life that resonates broadly across our Caribbean culture in the 1960’s, and more or less, depicts the generally live-loose nature of our Caribbean people in those times. Those were the times when there were no television sets, no Ipods, no computers, no microwaves, no mobile phones, and no major technological innovations. Those were the times when in despite of the absence of these novelties, people lived more happily, showed more tolerance for each other, demonstrated respect for the elderly, and were never knowingly short of food, as every neighbours pot was always open to the other. Those were the times when a man’s word was as good as his handshake, and his promise was as genuine as 24 karat gold. Indeed those were the times when children were playful, yet committed to the tasks bestowed upon them. Those were the days when boys played cricket in the streets and endured the black sage whip fuh cussin, and breaking their neighbours’ glass windows. Those were the days when you ketch patwa and houri, strayed whole day, and mercilessly steal from the neighbours fruit trees. Yes, my Caribbean friends, those were the wonderful days that you embrace with nostalgia and craze. Yes, you and I would always remember, our “Boyhood Days”.",
  "genres": [],
  "author": "Dennis E. Adonis",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/17312801-boyhood-days---book-2"
}