{
  "title": "Summer Wedding Collection",
  "description": "Six Award-Winning Authors have contributed new stories to A Timeless Romance Anthology: Summer Wedding Collection. Readers will love this collection of six sweet contemporary romance novellas, centered on a Summer Wedding, all with one thing in common: Romance.In Melanie Jacobson’s charming novella, \nLove Bytes\n, Bree is the maid-of-honor and Dallen is the best-man. While they plan and plot over email and texting, Bree realizes that the best part about the Maui wedding might be meeting Dallen. She just hopes that he’ll feel the same way.\nRomeo and Julie-ex\n is a sweet romance by Julie Wright. “Romeo” turns out to be a two-timing jerk, and when Juliet Moore’s pre-ordered wedding dress arrives from UPS, Juliet curses everything male. In a stubborn streak, she decides to keep the bridal photography appointment—when Juliet shows up for the appointment and meets photographer Jack Montague, she might have to take back some of her curses on men.In Rachael Anderson’s enchanting novella, \nThe Meltdown Match\n, Courtney spends each summer in her hometown of Heimel, Alaska, to find inspiration for her next novel. But when she runs into former high school friend, Mitch Winters, and they both win the Meltdown Match—a traditional dating contest—Courtney discovers that leaving her hometown at the end of the summer might not be so easy this time.In \nGolden Sunrise\n, an engaging romance by Annette Lyon, Natalie takes time out of her crazy schedule to fly to Vegas for her best friend’s wedding. Sierra and Jason, high-school sweethearts, are finally getting married. Fortunately for Natalie, her old high-school flame, Adam, has a work commitment and can’t be there as best man. But when she arrives at the wedding rehearsal—late and ragged—Adam is there. When Adam makes a wild suggestion, Natalie just may take him up on it, even though she knows he’s moved on. A single choice may mean Natalie is taking a shot at reclaiming the past—or that she’s putting her heart in harm’s way a second time.\nTide Pools\n is a captivating story by Heather B. Moore. Lexi makes a quick trip to Hawaii to attend her friend’s wedding, and she discovers that the engaged couple, Sydney and Apelu, are still trying to match-make for her. Lexi laughs because not only does their friend David have a serious girlfriend, but he owns a restaurant on the island. But when Lexi meets David, she has a hard time remembering why all of her plans were so important.In Sarah M. Eden’s delightful novella, \nA Regular Bloke from Stanmore\n, Abby is helping her sister, Caroline, plan her British wedding. That’s right, Caroline is obsessed with all things British and insists on an authentic wedding in...Oregon. When they arrive at Sainsbury House reception hall, it has everything Caroline loves, and the host, Matthew Carlton, even has a British accent. Yet Abby isn’t buying the whole good-looking-British man with impeccable manners thing; she’s determined to expose him as a fake. But the more Abby gets to know Matthew, the more she realizes how wrong she really is.",
  "genres": [
    "Romance",
    "Contemporary",
    "Clean Romance",
    "Anthologies",
    "Novella",
    "Fiction",
    "Contemporary Romance"
  ],
  "author": "Melanie Jacobson",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/17314153-summer-wedding-collection"
}