{
  "title": "Finding Never",
  "description": "Finding Never, a New Adult Novel Recommended for Ages 18 and Up#2 in the series beginning with \"Tasting Never\"(Books 1-5 are available now - Reading list included below!)\"Tell me, Never, do you still love him?\"Never Ross and Ty McCabe have come a long way – but they can't stop now. Their pasts are still there, ready to sweep over and consume them if they don't confront them. A visit to Never's family seems like the first logical step, but will it make things better or worse? And what about Noah Scott? Ty is Never's tortured other half, but can he also be the healing balm that she so desperately needs? With McCabe's past still a virtual unknown, Never is going to have to make more than one decision capable of breaking both their hearts.\"Ty has changed; I have changed, and things are not always what they seem.\"READING LIST:#1: Tasting Never#2: Finding Never#3: Keeping NeverOR #1-3: \"Tasting, Finding, Keeping: The Story of Never\"#4: Never Can Tell#5: Never Let Go#6: Never Did Say (Releases July 2015)FINDING NEVER EXCERPT:“Before you say whatever it is that you're going to say, can I show you something?” he asks as the fog of his breath tangles and dances with mine in the crisp winter air.“Ty, you don't – ”He cuts me off.“Please.” He says the word like it's a question, but it's not. He's not asking my permission. Ty is telling me that he's going to show me whether I like it or not, so I better be ready for it. “I need to show you how much you rock my f*cking world.” And then Ty is kissing me hot and hungry, down my neck and back up again. He's biting my lip and making me bleed, brushing his lips across the beating pulse in my neck, the one that throbs like crazy when he's around.“Ty, stop,” I say because we're on a playground for God's sake, but he doesn't. He doesn't stop. He adjusts my wrists so that he's holding them with one hand, and although I probably could fight him if I wanted to, I don't. I don't want him to stop, not now, not ever.",
  "genres": [
    "New Adult",
    "Romance",
    "Contemporary Romance",
    "College",
    "Contemporary",
    "Abuse",
    "Young Adult"
  ],
  "author": "C.M. Stunich",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/17314424-finding-never"
}