{
  "title": "Longing for Love",
  "description": "The problem with most relationship-advice systems is that they assume that we are rational people and then give us rational advice as to how to attract another rational person. But we aren’t rational. If we were, life would be much easier.Longing for Love backs up to the beginning – explaining how our irrational infatuations are based on familiar patterns rather than healthy attraction. It teaches us how to retrain our hearts to love the kind of people that will nurture our souls, not just satisfy our lusts. Full of profound insights and practical advice, it is unlike any relationship guide you’ve ever read.The problem with most relationship guides is that they assume that we are rational people and then give us rational advice as to how to attract another rational person. This is book three in the series Love, Lust and the Longing for God. In the first book of this series, The Secret of Emotions, I explain that emotions are sensations that tell us about the attributes of God, or virtues, that we experience in our environment, and that love, in particular, is an attraction to these virtues.An understanding of these two ideas, especially the second, is critical to any attempt to find true love and have healthy relationships.The goal of this third book is to expand our ability to recognize and become attracted to virtues so that we fall in love with people who are ready to have healthy, nurturing relationships. We will take a look at what these ideas look like when applied to finding and building healthy relationships in the real world.How does our understanding of the relationship between emotions and virtues help us find healthy people to be friends with?How does understanding the difference between love and lust change the way we enter into sexual relationships?How do we tell the difference between the sensation of love and all of the other sensations that are generated by relationships?How do we maintain healthy relationships once we commit to them?How do we avoid temptations that can destroy the relationship we have?These are the questions that we will be exploring in this third book. If you are unsure of the answers, then this book is a good place to start.This series can also be used by therapists and treatment centers to build a foundation for a wide range of recovery programs.Chapters include:Introduction: What Emotions Are\tiRetraining Your Heart\t1Our Love Affair with Lust\t20Other Sensations We Mistake for Love 33Filling the Emptiness\t45How to Find Love\t55From Love to Commitment\t61How to Remain Faithful\t70Dealing with Compulsive Behaviors\t80Tools for Personal Growth\t\t96Conclusion\t107",
  "genres": [
    "Relationships"
  ],
  "author": "Justice Saint Rain",
  "average_rating": "4.83",
  "url": "https://www.goodreads.com/book/show/17315928-longing-for-love"
}