{
  "title": "بريود - صمت أنثوي صاخب",
  "description": "بِريود كلمة إنجليزية تعني فترة زمنية. والكلمة لها أصل يوناني من كلمة \"بِريودوس\" وتعني الزمن. وفي علم اللغويات Linguistics كلمة \"بِريود\" تعني النقطة التي توضع في آخر الجملة لتدل على نهايتها. أما في العصر الحديث فقد صارت الكلمة تُشير إلى الدورة الشهرية، والتي تُعَد من أكبر التابوهات في عالم النساء. وكعادتنا حين نود إضفاء شيء من التقبُّل إلى غير المُتقبَّل دخلت كلمة \"بِريود\" إلى عالمنا الناطق بالعربية لوصف تلك الأيام. وفي الحضارات القديمة لم تكن الدورة الشهرية من الأسرار، بل كانت واضحة للجميع كجزء أساسي من أنوثة المرأة التي ارتفعت إلى منصب الإلهة، وحكمت البلدان، واستحوذت على مكانة شديدة العلو كساحرة أو حكيمة أو عرَّافة. أما أيام النزيف في الدورة الشهرية فكانت فترة مُقدَّسة sacred time أحيطت بهالة من الإجلال، كهِبة أو مِنحة من الطبيعة أو من الآلهة للمرأة، تتسم بنشاط رُوحاني وقدرة عالية على التواصل مع الطبيعة أو الآلهة. وكان يصحب بلوغ الفتاة ونزول أول قطرات من دمائها الكثير من الاحتفالات لوصولها إلى هذه المرحلة المتطورة من الحياة.ثم جاءت الأديان السماوية تحمل فكرة الإله الواحد الذكر ذي السُّلطة الأبوية المطلقة، وحرمت المرأة من ذلك التقديس لطبيعتها كأنثى. فالله مذكر، فالأنبياء والرُّسل والعلماء والمفسرون رجال، والمرأة لا تصلح لهذه الأعمال، فهي الأضعف جسمانيًّا، وهي العاطفية متقلِّبة المزاج المفتقدة للعقلانية، وهي مصدر الفتنة للرِّجال، فهي الزانية إذا فاح عطرها أو بدت زينتها للعالم، وهي التي خُلِقَت من ضلع أعوج وحملت عبء الخطيئة الأولى فتعاونت مع الشيطان على غواية آدم ليأكل من الشجرة المحرمة ويطرد من الجنة، فكان أكثر اهل النار من النساء. ثم اضافت الأديان السماوية أعباءا نفسية إلى أيام النزيف، وكأن عبء الألم الشديد لا يكفي فتم إلصاق تهمة النجاسة إلى المرأة في هذه الأيام، وتم فرض عزلة دينية واجتماعية أضافت إلى العزلة النفسية والإحساس بالخجل والقذارة آلاما تفوق ألم النزيف. ثم انتقلت الفكرة في سلاسة شديدة إلى مجتمعاتنا الذكورية التي تمجد الخجل في النساء وتنتقده في الرجال. أصبحت تلك الفترة تابوه ليس من الممكن الاقتراب منه، فيجب أن تخفيه البنت عن أبيها وأخيها بل وقد تخفيه عن زوجها إذا أمكن. فتم فرض ذلك الحصار التاريخي على هذه الأيام لتتألم المرأة في صمت. ولكن صمت المرأة يتحول إلى صخب داخلي يختفي عن أسماع لعالم ويدوي فقط في جنبات النفس ليصبح صمتا أنثويا صاخبا لا يسمعه الرجال.في هذه المجموعة تخلَّيت عن كل ما يميز الرجال واقتربت في حذر من ذلك العالم الخفي الغامض، واستمعت واستمتعت بهذا الصخب، فكان يجب أن أشارك العالم شيئًا منه.محمد متولي",
  "genres": [
    "Short Stories",
    "Novels",
    "Fiction",
    "Feminism"
  ],
  "author": "محمد  متولي",
  "average_rating": "3.02",
  "url": "https://www.goodreads.com/book/show/17315828--"
}