{
  "title": "The Hungry Ocean: A Swordboat Captain's Journey",
  "description": "The term fisherwoman does not exactly roll trippingly off the tongue, and Linda Greenlaw, the world's only female swordfish boat captain, isn't flattered when people insist on calling her one. \"I am a woman. I am a fisherman. . . I am not a fisherwoman, fisherlady, or fishergirl. If anything else, I am a thirty-seven-year-old tomboy. It's a word I have never outgrown.\"Greenlaw also happens to be one of the most successful fishermen in the Grand Banks commercial fleet, though until the publication of Sebastian Junger's The Perfect Storm , \"nobody cared.\" Greenlaw's boat, the Hannah Boden , was the sister ship to the doomed Andrea Gail , which disappeared in the mother of all storms in 1991 and became the focus of Junger's book.The Hungry Ocean , Greenlaw's account of a monthlong swordfishing trip over 1,000 nautical miles out to sea, tells the story of what happens when things go right -- proving, in the process, that every successful voyage is a study in narrowly averted disaster. There is the weather, the constant danger of mechanical failure, the perils of controlling five sleep-, women-, and booze-deprived young fishermen in close quarters, not to mention the threat of a bad fishing \"If we don't catch fish, we don't get paid, period. In short, there is no labor union.\"Greenlaw's straightforward, uncluttered prose underscores the qualities that make her a good captain, regardless of fairness, physical and mental endurance, obsessive attention to detail. But, ultimately, Greenlaw proves that the love of fishing -- in all of its grueling, isolating, suspenseful glory -- is a matter of the heart and blood, not the mind.\"I knew that the ocean had stories to tell me, all I needed to do was listen.\" -- Svenja Soldovieri",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Adventure",
    "Biography",
    "Biography Memoir",
    "Autobiography",
    "Travel"
  ],
  "author": "Linda Greenlaw",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/173165.The_Hungry_Ocean"
}