{
  "title": "Letters from Skye",
  "description": "NAMED ONE OF THE BEST BOOKS OF THE YEAR BY PUBLISHERS WEEKLYA sweeping story told in letters, spanning two continents and two world wars, Jessica Brockmole’s atmospheric debut novel captures the indelible ways that people fall in love, and celebrates the power of the written word to stir the heart.   March 1912: Twenty-four-year-old Elspeth Dunn, a published poet, has never seen the world beyond her home on Scotland’s remote Isle of Skye. So she is astonished when her first fan letter arrives, from a college student, David Graham, in far-away America. As the two strike up a correspondence—sharing their favorite books, wildest hopes, and deepest secrets—their exchanges blossom into friendship, and eventually into love. But as World War I engulfs Europe and David volunteers as an ambulance driver on the Western front, Elspeth can only wait for him on Skye, hoping he’ll survive.   June 1940: At the start of World War II, Elspeth’s daughter, Margaret, has fallen for a pilot in the Royal Air Force. Her mother warns her against seeking love in wartime, an admonition Margaret doesn’t understand. Then, after a bomb rocks Elspeth’s house, and letters that were hidden in a wall come raining down, Elspeth disappears. Only a single letter remains as a clue to Elspeth’s whereabouts. As Margaret sets out to discover where her mother has gone, she must also face the truth of what happened to her family long ago.   Sparkling with charm and full of captivating period detail, Letters from Skye is a testament to the power of love to overcome great adversity, and marks Jessica Brockmole as a stunning new literary voice.Look for special features inside. Join the Random House Reader’s Circle for author chats and more.Praise for Letters from Skye “Letters from Skye is a captivating love story that celebrates the power of hope to triumph over time and circumstance.”—Vanessa Diffenbaugh, New York Times bestselling author of The Language of Flowers  “[A] remarkable story of two women, their loves, their secrets, and two world wars . . . [in which] the beauty of Scotland, the tragedy of war, the longings of the heart, and the struggles of a family torn apart by disloyalty are brilliantly drawn, leaving just enough blanks to be filled by the reader’s imagination.”—Publishers Weekly (starred review) “Tantalizing . . . sure to please readers who enjoyed other epistolary novels like The Guernsey Literary and Potato Peel Pie Society.”\n—Stratford Gazette\n   “An absorbing and rewarding saga of loss and discovery.”—Kate Alcott, New York Times bestselling author of The Dressmaker   “A sweeping and sweet (but not saccharine) love story.”—USA Today   “[A] dazzling little jewel.”—Richmond Times-DispatchFrom the Trade Paperback edition.",
  "genres": [
    "Historical Fiction",
    "Romance",
    "Fiction",
    "Historical",
    "Scotland",
    "War",
    "World War II"
  ],
  "author": "Jessica Brockmole",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/17316712-letters-from-skye"
}