{
  "title": "Stroke Rate",
  "description": "Stroke Rate by L.M. SomertonLucien Thorne likes to be in control, but the boy he wants to own may take some convincing.Gorgeous but shy, Benedict Astor does his best to keep a low profile at the rowing club where he works. However, unbeknown to Benedict, he has attracted the attention of Lucien Thorne, rowing aristocracy, an Olympic medallist and a Lord.Whilst looking for a new rowing partner, Lucien believes he has found what he needs in Ben. He pushes him to his limits on the water and it becomes clear that rowing with the pretty young man is not his only interest. Ben is attracted to Lucien but confused about his feelings. Lucien is demanding, arrogant and dominant—which Benedict responds to even though he feels he should resist.Fighting emotions he doesn’t understand, Ben has to contend with the bullying rowing club president and a humiliating auction of promises.Lucien recognises Ben’s hidden submissive streak and makes his own need for control very clear. He bids for Ben’s time and then forces Ben to admit to his own desire to test the ground between them.When the deeds to the boat club are gambled away, Lucien and Ben must work together to save it. Will their growing love survive the pressure, Ben’s uncertainty and Lucien’s desire to own him completely?L.M. SomertonAbout the Lucinda lives in a small village in the English countryside, surrounded by rolling hills, cows and sheep. She started writing to fill time between jobs and is now firmly and unashamedly addicted.She loves the English weather, especially the rain, and adores a thunderstorm. She loves good food, warm company and a crackling fire. She’s fascinated by the psychology of relationships, especially between men, and her stories contain some subtle (and not so subtle) leanings towards BDSM.",
  "genres": [
    "BDSM",
    "M M Romance",
    "Contemporary",
    "Sports",
    "Romance",
    "Erotica",
    "College"
  ],
  "author": "L.M. Somerton",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/17317084-stroke-rate"
}