{
  "title": "Shades of Grace",
  "description": "“Can I take it from your reaction that I have convinced you to forgive me,” Cullen asked seductively pulling away from Grace’s lips, sending a shock wave of pleasure jolting through her. He was so sure and confident in his ability to melt the object of his attention.“Forgive you? No, Marshal McKinnon, I just wanted you to have a taste of what you can never have.”In this third installment of The McKinnon Legends, we see Cullen McKinnon, Brother to the Seventh Duke of Seabridge deeply entrenched in a tale of murder, assassination attempts, and the mystery of who is Gray Martin.Cullen is used to having his way with women. He treats them well and respectfully, not that it matters. Most of these ultra-easy conquests mean nothing to him. The personification of sin itself in a pair of Wranglers, Cullen is well connected socially, politically, and physically. He is all about control when it comes to his professional life. As a U.S. Marshal based out of San Antonio, Texas, he has to be in control. That goes double for his love life and control in that arena is easy. There is zero risk of him loosing his head over a woman, because his heart already belongs to his brother’s wife. And he has certainly come to terms with the fact that Morgan is certainly a woman he can never have, ever. Immortalizing her, he remains comfortable in unrequited love. It is just easier then letting it go.As a lawman, Cullen is naturally suspicious. When he contracts with Amazing Grace Genealogy Services to locate any record of his long lost nephew, Decklyn McKinnon suspicion raises the longer he works with the company’s representative. Something about Gray Martin peaks his interest. Unable to leave well enough alone, Cullen inadvertently blows Grace’s cover exposing her to the assassin she has been on the run from for the past three years.Cullen has a decision to make, but is he prepared to let the ghost of Morgan go?",
  "genres": [
    "Time Travel",
    "Romance",
    "Historical Romance",
    "Paranormal",
    "Fantasy",
    "Suspense"
  ],
  "author": "Ranay James",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/17317688-shades-of-grace"
}