{
  "title": "Sex, Doug, and a Rocky Road",
  "description": "A new full length novel by Michele Bardsley!Ellie Johnson is a housewife and mother scorned. Hiring a private detective to check up on her husband Stan’s late nights verifies her long-held suspicions of his outside activities.Her name is Rose. She’s blonde, big-boobed, and Australian. Ellie is almost devastated by her husband’s betrayal. Almost. As she deals with the fallout of her husband’s affair, she begins to realize that she wasn’t happy, either. In fact, she hadn’t been happy in a long time, and the further she gets away from her marriage, the more she realizes how oppressed she’d felt in the housewife role she’d slipped into over the years. Throw in Ellie’s melodramatic, hypochondriac, alcoholic mother, revelations about her dead father’s lascivious past, a comedy club faux pas, a yoga date gone wrong, the incident where “The Other Woman Almost Killed My Son with Tiny Shrimp,” a very scary divorce attorney, and—well, and you have one messed-up former housewife. And then there’s Doug.Doug is her ex-boyfriend—the man she dated before Stan “Whore-man” Johnson. Doug is a cop these days, older, but with the same muscles and chocolate-brown eyes she remembers from their college days. He’s also made it abundantly clear he’d like to take up with Ellie where they left off more than fifteen years ago.Ellie, however, is trying to go from married to unmarried, and her journey is messy, chaotic, and fraught with ice cream and booze. A lot of booze. Thank goodness for her best friend, Cindy, who stands by Ellie through thick, thin, and many cartons of Rocky Road ice cream. Sometimes life just falls apart. And sometimes life is sex, Doug, and a rocky road.Please note: SEX, DOUG, AND A ROCKY ROAD is being released as an exclusive read on Amazon Kindle!",
  "genres": [
    "Romance",
    "Contemporary"
  ],
  "author": "Michele Bardsley",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/17318210-sex-doug-and-a-rocky-road"
}