{
  "title": "Jane Austen's Country Life",
  "description": "Jane Austen lived for nearly all her life in two Hampshire for 25 years in her birthplace of Steventon, and then for the last 8 years of her life in Chawton, during which she wrote and published her great novels. While there are plenty of books describing her periods of urban life in Bath, Southampton and London, and the summer holidays in Lyme Regis and other West Country seaside resorts, no consideration has been given to this rural background to her life. Her father was not only the rector of Steventon but a farmer there as well, managing a property of some 200 acres. Her brother Edward, in addition, was a large landowner, holding the three estates of Godmersham in Kent, Steventon and Chawton in Hampshire. Agriculture in all its aspects was even more important to Jane than clerical life or the naval careers of her younger brothers.This book fills a gap in the Austen family background, discussing the state of agriculture in general in the south of England during the wartime conditions which lasted for most of Jane Austen's life, and considering in particular the villages and their inhabitants, the weather conditions, field crops, farm and domestic animals, and the Austens' household economy and rural way of life. All appear in Austen's letters, and appear also unobtrusively in her novels, lending that air of verisimilitude for which her works are famous. Apart from these obvious sources, there are other Austen family manuscripts, as yet unpublished, which provide particular and unique information.Richly illustrated with contemporary depictions of country folk, landscapes and animals, Jane Austen and Country Life conjures up a world which has vanished more thoroughly than the familiar regency townscapes of Bath or London, but which is no less important to an understanding of this most treasured writer's life and work.",
  "genres": [
    "Nonfiction",
    "History",
    "Biography",
    "British Literature",
    "Regency"
  ],
  "author": "Deirdre Le Faye",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/17318217-jane-austen-s-country-life"
}