{
  "title": "Testing Arthur",
  "description": "Mercenary men. Sexy, muscled men with weapons. What happens when hard men fall in love with other men? When another person becomes more important to them than their own lives? Hard, ruthless, men who will put everything on the line for love and honour are the focus of this series. With unexpected love comes grave responsibility, and the rocky path to a happy ending can sometimes leave bodies along the way. The heart may love where it may, but sometimes, to protect it, you need a big weapon and a lot of attitude…Testing Arthur by Amber KellBook two in the Mercenary Love SeriesIf you loved Texas Pride by Kindle Alexander and Set Ablaze (Uniform Encounters) by Morticia Knight then you will not be able to put down this absolute treat!Sometimes strong men need help too…When Arthur Turner is injured on the job, he relies on his sometimes lover Patrick Edwards to see him through. But Patrick is evidently finished being Arthur's secret lover tells Arthur he only came to check on him because he still cares. After almost dying, Arthur has to re-evaluate his life choices.Patrick is part owner of his own business, has a solid group of friends…and is utterly in love with a closeted man. When Arthur offers to give up everything for him, he wonders if pressuring Arthur was the right thing to do. Would his lover eventually regret choosing Patrick over his previous life?Now a killer is on the loose. Fixated on Arthur, the killer is enraged to discover Patrick is part of Arthur’s life. Determined to have Arthur for himself, he lays a trap hoping to get Arthur alone and under his control.Two men torn apart by lies come together to finally have the relationship they always secretly wanted",
  "genres": [
    "M M Romance",
    "Romance",
    "Contemporary",
    "Novella",
    "LGBT",
    "Mystery",
    "Military Fiction"
  ],
  "author": "Amber Kell",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/17319434-testing-arthur"
}