{
  "title": "Caged Warrior",
  "description": "McCutcheon Daniels' life is full of bone-cracking violence. As a star fighter in the gritty underground Mixed Martial Arts circuit in the poorest section of Detroit, McCutcheon fights under the tutelage of his volatile and violent father, not so much for himself but to survive as protector of his beloved five-year old sister, Gemma. We get to know McCutcheon as he battles opponents who are literally trying to kill him. Mr. Freedman, his science teacher, spots his intellectual potential, befriends him, and encourages him to enter the lottery for a scholarship to an elite charter school so he can obtain a first-class education. He is at first dead-set against the idea, and of course his tyrannical father forbids it. But the school's headmaster, Kaitlyn, a student assigned to be his guide, and Mr. Freedman continue to encourage him to consider it. His father and the Priests, the local Mafia-like crew that run Detroit's organized crime, have other plans for McCutcheon. For them, he is simply a tool to make them money. And when that cash flow is threatened, his father hits McCutcheon where it hurts most-he hides Gemma and threatens his own son that he'll never see his beloved sister again if he doesn't play by the Priests' rules.For the first time in his life, McCutcheon reaches out for help. Mr. Freedman turns out to have a very mysterious past and not only helps McCutcheon find his sister but also his mother who had simply disappeared on McCutcheon's 13th birthday. All seems well, but happy endings aren't really something McCutcheon feels he can rely on. And he may be right.A ferocious novel, Caged Warrior is like a great fight movie, a tour-de-force of relentless conflict, but one that is leavened with rich characters and meaningful and loving relationships.",
  "genres": [
    "Sports",
    "Young Adult",
    "Realistic Fiction",
    "Contemporary",
    "Crime",
    "Fiction",
    "Family"
  ],
  "author": "Alan Sitomer",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/17323431-caged-warrior"
}