{
  "title": "The Reluctant Admiral: Yamamoto and the Imperial Navy",
  "description": "This is a portrait both of an individual and of an organization. The individual is the Japanese admiral who, as architect of the Pearl Harbor raid and commander of the Combined Fleet throughout the first part of World War II, is one of the most widely known of Japanese wartime leaders. The organization is the Japanese Imperial Navy, whose \"gentlemanly\" traditions and outlook contrasted strongly with those of the Japanese army and whose failure to check the latter in its headstrong course makes one of the sadder episodes of recent history.Here, for the first time, Yamamoto emerges as the complex, sympathetic, and in many ways contradictory character that he was. A realist who foresaw the future importance of the airplane for the navy long before his contemporaries and who believed that Japan would inevitably be defeated in any war with America and Britain, he was also an inveterate gambler with an odd streak of superstition. A tough leader, he had at the same time a vein of sentimentality that would allow him to burst into tears at the funeral of a young subordinate. In public the very epitome of the dignified national hero, in private he often showed a schoolboyish playfulness that was sometimes endearing and occasionally embarrassing. He was always ready to express his views with a frankness uncommon in his day, yet he revealed in the end the same readiness as most of his fellow countrymen to accept passively \"the call of duty.\"The author, refusing the temptation to indulge in speculation or \"reconstruction,\" has gone straight to the original sources--accounts written by those who worked with Yamamoto; scores of interviews with men and women who knew him personally; above all, letters written by Yamamoto himself. The latter range from his more circumspect, semi-official communications to intimate letters addressed to his mistress or long-standing friends of both sexes, in which he bares his private doubts and pessimism. It is these personal documents and reminiscences that make the character so human and, ultimately, give such a moving quality to the account of his dramatic wartime death in the South Pacific.An intimate portrait of the man who planned the attack on Pearl Harbor and died a dramatic death in the South Pacific.",
  "genres": [
    "History",
    "Biography",
    "World War II",
    "Nonfiction",
    "War",
    "Military Fiction",
    "Japan"
  ],
  "author": "Hiroyuki Agawa",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/1732434.The_Reluctant_Admiral"
}