{
  "title": "The Big Book of Dumb White Husband",
  "description": "If you're not him, you know him.He's challenged the grocery store. He's confronted the HOA. He's even taken on Santa himself. He doesn't usually win. These are the tales of the Dumb White Husband and they are all available here in this collected edition.This handsome volume includes:Dumb White Husband vs. the Grocery Store - John would rather sit and watch the game, but his wife needs some things at the store. Can he complete the list and get back in time to see the end of the game?Dumb White Husband vs. Halloween - Every Halloween, Chris has the scariest house on the block and gives out the best candy. But, this year, someone is showing him up and he'll stop at nothing to find out who.Dumb White Husband vs. Santa - Erik has planned the perfect Christmas for his family. The plan is foolproof, bulletproof and flame retardant. Nothing can undo the hours of planning and preparation. Nothing except maybe odd-shaped packages, ill-timed fruitcakes or an errant neighborhood Santa Claus.Dumb White Husband vs. the Tooth Fairy - Erik always has a plan and he's sure he would have figured out the whole Tooth Fairy thing eventually. But, when his three-year-old son takes a frisbee to the mouth, he's forced to speed things up. Between neighborhood kids with big mouths and unhelpful dentists he's going to need to improvise. Will he bend to the pressure of inflation? Will he get caught in the act? And, what do you do with those teeth anyway?Dumb White Husband for President (A novella) - There comes a time in every man's life when he must stand for the things he believes in. John doesn't believe in bagging his grass. So, when a new allergy-prone neighbor gets the HOA to require it, there's only one thing he can do - run for President of The Creeks of Sage Valley Phase II.John, Chris and Erik put aside most of their differences to run a campaign that they hope will see John elected as President and end the meddling of the rule-loving new kid on the block. Will they succeed? It's doubtful.",
  "genres": [
    "Humor",
    "Short Stories",
    "Contemporary"
  ],
  "author": "Benjamin  Wallace",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/17326546-the-big-book-of-dumb-white-husband"
}