{
  "title": "Nameless Indignities: Unraveling the Mystery of One of Illinois's Most Infamous Crimes",
  "description": "2013 GOLD MEDAL/INDIEFAB AWARDS(ForeWord Review); 2014 BRONZE MEDAL/IPPY AWARDS: If you like history relating to crime, law, medicine, psychology, journalism, or genealogy – then this Victorian mystery is for you. Nameless Indignities is a true story, full of incredible twists and turns, and will hold you in its grip from beginning to end with multiple suspects, a lynch mob, perjury and bribery, failed kidnappings, broken family ties, cover-ups, financial devastation, and at least two suicides. When young schoolteacher Emma Bond was brutally gang-raped and left for dead in her rural Illinois schoolhouse in June 1882, an enduring mystery was born. Although she survived, her recovery was hindered by hysteria, amnesia, and some unusual physical complications. The story was covered by newspapers across the land, but some of the wounds inflicted upon the victim were so appalling that the press refused to print the ugliest details, referring to them only as “nameless indignities.” Eighteen months went by before three of the six suspects were brought to trial. After the verdict, however, the public’s unwavering support for the victim began to fade amid persistent theories and rumors that she had lied and that no crime had been committed. At the time, educators, editors, politicians, lawyers, and doctors eagerly weighed in on the case and its ramifications. But with Victorian doctors unable to agree on anything of a physical or a psychological nature, Emma’s life went into a tailspin from which she never recovered. The crime also took a heavy toll on local residents, pitting families and neighbors against one another. The fact that the case was never fully resolved gave it a certain staying power, with its many unanswered questions persisting well into the twentieth century. The author, whose great-great aunt was the victim, concludes with her own theory on the crime, based on some new evidence that she recently uncovered.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "Crime",
    "Mystery",
    "History",
    "Microhistory",
    "Historical"
  ],
  "author": "Susan Elmore",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/17326980-nameless-indignities"
}