{
  "title": "The Pandora Sequence: The Jesus Incident, The Lazarus Effect, The Ascension Factor",
  "description": "All three novels in the Pandora Sequence by Frank Herbert & Bill Ransom, sequels to Frank Herbert's Void.The Jesus Incident—A sentient Ship with godlike powers (and aspirations) delivers the last survivors of humanity to a horrific, poisonous planet, Pandora—rife with deadly Nerve-Runners, Hooded Dashers, airborne jellyfish, and intelligent kelp. Chaplain/Psychiatrist Raja Lon Flattery is brought back out of hybernation to witness Ship’s machinations as well as the schemes of human scientists manipulating the genetic structure of humanity. Book 1 in Herbert & Ransom’s Pandora Sequence.The Lazarus Effect—In The Jesus Incident Herbert and Ransom introduced Ship, an artificial intelligence that believed it was God, abandoning its unworthy human cargo on the all-sea world of Pandora. Now centuries have passed. The descendants of humanity, split into Mermen and Islanders, must reunite … because Pandora’s original owner is returning to life!Book 2 in Herbert & Ransom’s Pandora Sequence.The Ascension Factor—Pandora’s humans have been recovering land from its raging seas at an accelerated pace since The Lazarus Effect. The great kelp of the seas, sentient but electronically manipulated by humans, buffers Pandora’s wild currents to restore land and facilitate the booming sea trade. New settlements rise overnight, but children starve in their shadows. An orbiting assembly station is near completion of Project Voidship, which is the hope of many for finding a better world.Pandora is under the fist of an ambitious clone from hibernation called The Director, who rules with a sadistic security force led by the assassin Spider Nevi. Small resistance groups, like the one led by Twisp Queets and Ben Ozette, have had little effect on his absolute power. The Director controls the transportation of foodstuffs; uprisings are punished with starvation.The resistance fighters’ main hope is Crista Galli, a woman believed by some to be the child of God. Crista pools her talents with Dwarf MacIntosh, Beatriz Tatoosh, and Rico LaPush to transcend the barriers between the different species and overthrow The Director and the sinister cabal with which he rules.Book 3 in Herbert & Ransom’s Pandora Sequence.",
  "genres": [
    "Science Fiction"
  ],
  "author": "Frank Herbert",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/17327213-the-pandora-sequence"
}