{
  "title": "The Silver Bough",
  "description": "The award-winning author of The Mysteries returns with another captivating novel in which modern-day enigmas and age-old myths come together with spellbinding results. Here is an enchanting tale set in a land rich with folklore–and ripe for a rekindling of the old ways.Nestled on the coast of Scotland, Appleton was once famous for its apples. Now, though the orchards are long gone, locals still dream of the town’s glory days, when an Apple Queen was crowned at the annual fair and good luck seemed a way of life. And outsiders are still drawn to the charming village, including three very different American women.Enchanted by Appleton’s famously ornate, gold-domed library, divorcée Kathleen Mullaroy has left her cosmopolitan job to start anew as the town’s head librarian. Widowed Nell Westray hopes for a quiet life of gardening in the place where she and her husband spent their happiest moments. And young Ashley Kaldis has come to find her roots, and learns that the town’s fortunes turned when her grandmother was crowned Apple Queen–then mysteriously disappeared.When a sudden landslide cuts Appleton off from the wider world–and the usual constraints of reality–the village reveals itself to be an extraordinary place, inhabited by legendary beings, secret rooms, and the blossoming of a rare fruit not seen in decades. Most unexpected is a handsome stranger who will draw all three women into an Otherworld in which luck and love will return to Appleton–if only one of them will believe. Lush with the romance and allure of ancient traditions, The Silver Bough will propel you into a land where, as in Eden, the bite of a single apple can alter the whole course of reality.From the Hardcover edition.",
  "genres": [
    "Fantasy",
    "Romance",
    "Magical Realism",
    "Scotland",
    "Fiction",
    "Adult",
    "Supernatural"
  ],
  "author": "Lisa Tuttle",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/17328110-the-silver-bough"
}