{
  "title": "Giants: The Dwarfs of Auschwitz",
  "description": "Giants: The Dwarfs of Auschwitz is a moving and inspirational story of survival, of a troupe of seven dwarf siblings, whose story starts like a fairy tale, before moving into the darkest moments of their history; the darkest moments of modern history. At a time when the phrase survival of the fittest was paramount, the Ovitz family, seven of whose ten members were dwarfs, less than three feet tall, defied the fate of so many other Holocaust victims. The irony was that, doubly doomed for being Jewish and disabled, it was their dwarfism that ultimately saved their lives. Authors Yehuda Koren and Eilat Negev deftly weave the tale of this beloved and successful family of singers and actors, the Lilliput Troupe. Their dazzling Vaudeville program, the only all-dwarf show at the time, made them famous entertainers in Central Europe in the 1930s and 40s. Descending from the cattle train into the death camp of Auschwitz, the Ovitz family was separated from other Jewish victims on the orders of one Dr Joseph Mengele. Obsessed with eugenics, Dr. Mengele experimented on the family, aiming to discover the biological and pathological causes of the birth of dwarfs. Like a single-minded scientist, he guarded his human lab-rats, and subsequently, when the Russian army liberated Auschwitz, all members of the family - the youngest, a baby boy just 18 months-old, the oldest, a 58 year-old woman - were alive. It was the only family that entered the death camp and lived to tell the tale. The family eventually restructured their lives and became successful performers once again, but the indelible mark of their experiences was carried with them until the end. Giants is based on thorough exhaustive research and interviews with Perla Ovitz, the troupe's last surviving member, and scores of Auschwitz survivors. The authors tracked down significant medical documentation and unearthed original Nazi records.",
  "genres": [
    "Nonfiction",
    "History",
    "Holocaust",
    "Biography",
    "War",
    "World War II",
    "European History"
  ],
  "author": "Eilat Koren",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/17328752-giants"
}