{
  "title": "The Tilted World",
  "description": "Set against the backdrop of the historic 1927 Mississippi Flood, a story of murder and moonshine, sandbagging and saboteurs, dynamite and deluge-and a man and a woman who find unexpected love-from Tom Franklin, author of the bestselling Crooked Letter, Crooked Letter, and his wife, Pushcart Prize-winning poet Beth Ann FennellyThe year is 1927. As rains swell the Mississippi, the mighty river threatens to burst its banks and engulf all in its path, including federal revenue agent Ted Ingersoll and his partner, Ham Johnson. Arriving in the tiny hamlet of Hobnob, Mississippi, to investigate the disappearance of two fellow agents on the trail of a local bootlegger, they unexpectedly find an abandoned baby boy at a crime scene.An orphan raised by nuns, Ingersoll is determined to find the infant a home, a search that leads him to Dixie Clay Holliver. A lonely woman married too young to a charming and sometimes violent philanderer, Dixie Clay has lost her only child to illness and is powerless to resist this second chance at motherhood. From the moment they meet, Ingersoll and Dixie Clay are drawn to each other. He has no idea that she's the best bootlegger in the county and may be connected to the missing agents. And while he seems kind and gentle, Dixie Clay knows he is the enemy and must not be trusted.Then a deadly new peril arises, endangering them all. A saboteur, hired by rich New Orleans bankers eager to protect their city, is planning to dynamite the levee and flood Hobnob, where the river bends precariously. Now, with time running out, Ingersoll, Ham, and Dixie Clay must make desperate choices, choices that will radically transform their lives-if they survive.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Book Club",
    "Historical",
    "Mystery",
    "Southern",
    "Romance"
  ],
  "author": "Tom Franklin",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/17331267-the-tilted-world"
}