{
  "title": "Disease: The extraordinary stories of history's deadliest killers",
  "description": "Essays on 50 key diseases, plagues and epidemics function both as self contained mini histories of individual diseases and as part of a larger narrative chronicling the history of medicine. Includes timelines, boxed features on significant medical breakthroughs, fascinating case histories, anecdotes and medical curiosities. Contains 150 color photographs.Disease is the true 'serial killer' of human history: the horrors of bubonic plague, cholera, leprosy, syphilis, typhoid and the like have had a more devastating impact on humankind than the depredations of warfare, famine and natural disaster. And despite the many advances in treatment over the past two hundred years, disease continues to blight the lives of many millions today, especially in the countries of the developing world. Some of the diseases selected - malaria, rabies and tuberculosis, for example - are ancient in origin - possibly first occurring when humans and domestic animals began to live in close proximity. Others, notably AIDS, are 'new' to human society, emerging only in the recent past.And a few have seemingly come and gone. SARS - the latest of the new and easily transmissible diseases to emerge in the 21st century - spread around the globe in 2003, disappeared and has, so far, not re-appeared. Only one major disease covered in this book - smallpox - has, so far, been effectively eradicated by human intervention. This book is an enthralling, richly illustrated collection of tales of the terror and fascination of plague, pox and pestilence, and a concise and accessible history of disease and humankind's struggle against it over three millennia. It is a timely and revelatory work of popular social history by a writer whose knowledge of, and enthusiasm for, her subject shines out from her every word.",
  "genres": [
    "History",
    "Nonfiction",
    "Science",
    "Medical",
    "Medicine",
    "Health",
    "Reference"
  ],
  "author": "Mary Dobson",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/17332115-disease"
}