{
  "title": "Son of Our Blood",
  "description": "Mac McManus has everything going for him, but he doesn’t see it that way. All he sees is his limitations. Like his father, Aaron, he is a vampire—forced into the darkness and to sustain himself on blood. He hates himself for what he has become and would rather meet the sun than remain immortal as a vampire or drink from another. It’s not anything he wants his family to know about.He strikes a bargain with his aunt, the Queen, to get what he wants—an end to his suffering. In the bargain he must save a woman, his mate, from another vampire, Zachariah Roberts, a murdering fiend that has been plaguing Mac’s dreams since he turned. But the woman he must save, the one the Queen is making him save has turned out to be more than he bargained for. More than he ever wanted.Brandi Daniel, Andi to her friends, has been on the run for years. Never staying in any one place long, she has managed to stay just one step ahead of her step-father—a cruel man with a nasty temper. Andi has a talent of her own. She can move things with her mind and her step-father thinks he can sell her to a science lab for a quick buck.Andi is caught squatting on Bradley Wolf’s land and is given an ultimatum. She can work off the debt or spend a few days in jail. She figures she’ll make a quick buck and leave before her step-father finds her. She has learned to rely only on herself and isn’t bargaining for a gorgeous overbearing vampire, Mac, stepping in and dictating her every move. A man who can and will fulfill her every fantasy and desire...Mac’s dreams of Zachariah have gotten worse and he knows that Andi is foretold to be one of his victims, but the danged woman won’t stay put. The entire Kiss is banding together to keep Andi safe and it pisses her off in the process. Will an entire Kiss of vampires and an entire pack of werewolves be enough to protect one stubborn human? Has Mac found a new purpose in life? Will either of them live long enough to find out?",
  "genres": [
    "Paranormal",
    "Vampires",
    "Paranormal Romance",
    "Romance",
    "Contemporary",
    "Fantasy",
    "Shapeshifters"
  ],
  "author": "Kathi S. Barton",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/17332189-son-of-our-blood"
}