{
  "title": "Khan",
  "description": "“Is it her?”Khan didn’t turn, but shook his head.\"Are you sure? Because you smell like her, and if what you say is true, then you won’t mind if Caitlynne and I take her back to Washington with us.”Khan didn’t remember moving or that he’d taken Walker to the ground. He was just suddenly over him with his hands around his throat. When he realized what he was doing, he let him go and stood up. Backing away from him, he looked at the rest of his brothers.“I won’t claim her. You know how I feel about this and I won’t have anything to do with her. None of you can make me either.” He flushed when he realized how stupid he sounded. “I’m going home and I don’t want any of you to come near me. Take her with you, I don’t give a shit. You can have her.”Khan Bowen doesn’t want a mate, especially a human one. He pushes her away at every turn. But…no matter how hard he tries, he can’t seem to let her go.Monica Preston is hurt bad and not for the first time. It seems like every time she runs, Tony Barr, a homicidal stalker, finds her and hurts her again. Her boss, Marc Bowen, finds her beaten and takes her home to heal. All Monica wants to do is leave because Tony will kill anyone in his way to get to her.Monica has had it up to her eyeballs with Khan ordering her around. The man doesn’t know how to ask, just order. She doesn’t want a mate either, whatever that is. But when Khan reveals who he and his family really are and lets his panther come out to play. Monica discovers a side of Khan that she can fall in love with, if she doesn’t kill him first.Things heat up when the body count mounts as Tony tries to find her. In his twisted reality, Monica is the solution and the cause to all his problems. And he won’t stop until he has her.Hot sex, danger and intrigue follow the fiery couple. Can they stay a few steps ahead of Tony? Can Khan keep her safe or will Tony play the final hand?",
  "genres": [
    "Paranormal",
    "Paranormal Romance",
    "Shapeshifters"
  ],
  "author": "Kathi S. Barton",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/17332260-khan"
}