{
  "title": "The Dogs of Christmas",
  "description": "A delightful Christmas gift from W. Bruce Cameron, the author of the New York Times and USA Today bestselling novel A Dog's Purpose , which is now a major motion picture!While nursing a broken heart, Josh Michaels is outraged when a neighbor abandons his very pregnant dog, Lucy, at Josh's Colorado home. But Josh can't resist Lucy's soulful brown eyes, and though he's never had a dog before, he's determined to do the best he can for Lucy―and her soon-to-arrive, bound-to-be-adorable puppies.Soon in over his head, Josh calls the local animal shelter for help, and meets Kerri, a beautiful woman with a quick wit and a fierce love for animals. As Kerri teaches Josh how to care for Lucy's tiny puppies and gets them ready to be adopted through the shelter's \"Dogs of Christmas\" program, Josh surprises himself by falling for her.But he's fallen even harder for his new furry family, which has brought incredible joy into Josh's life. He barely has time to sit down, between chasing after adventurous Sophie and brave Oliver, but when he does, his lap is quickly filled by the affectionate Lola. And Rufus and Cody's strong bond makes Josh wonder about his own relationships with his family.With Christmas and the adoption date looming, Josh finds himself wondering if he can separate himself from his beloved puppies. At odds with Kerri, Josh isn't willing to lose her, but doesn't know how to set things right. Can a surprise litter of Christmas puppies really change one man's life?W. Bruce Cameron's The Dogs of Christmas is a charming and heartwarming holiday tale that explores the power of love, trust, and a basket full of puppies.A Dog's Purpose Series#1 A Dog’s Purpose#2 A Dog’s Journey#3 A Dog's PromiseBooks for Young ReadersEllie's A Dog’s Purpose Puppy TaleBailey’s A Dog’s Purpose Puppy TaleMolly's A Dog's Purpose Puppy TaleMax's A Dog’s Purpose Puppy TaleToby's A Dog's Purpose Puppy TaleShelby's A Dog's Way Home NovelThe Rudy McCann SeriesThe Midnight Plan of the Repo ManRepo MadnessOther NovelsA Dog's Way HomeThe Dog MasterThe Dogs of ChristmasEmory’s Gift",
  "genres": [
    "Christmas",
    "Fiction",
    "Animals",
    "Romance",
    "Dogs",
    "Holiday",
    "Contemporary"
  ],
  "author": "W. Bruce Cameron",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/17332247-the-dogs-of-christmas"
}