{
  "title": "Marc",
  "description": "“I’m talking to you, the least you can do is acknowledge me.”“Hello. Now get the fuck away from me. I’m on my lunch hour. My time, not yours.” Marc growled low and Jonny’s entire body went on alert; her cat seemed to skim along her skin. She stood up, dumping her lunch on the table and backed up.“You felt it, didn’t you?” He moved toward her slowly as he spoke low. “You want to come to me, don’t you? You want to touch me.”“I’m not feeling well. I would like to go home.” He shook his head and continued coming toward her. “You can’t keep me here. I can go when I want to.”The vending machine touched her back. She knew she was trapped. Looking to her left, she could see the wall, and to her right was another table. He was nearly to her when she looked at him. Putting out her hand made him stop, but when he took it into his hand and then to his mouth, she jerked away.“You feel it. This attraction between us. You want me as much as I want you.” She shook her head at him. “If I touch you right now, what will you do? Will I smell your arousal?”Jonny Thomas is on the run. She has just escaped Dawson’s little house of horrors and has no plans of going back. Roy Dawson deals in exotic animals and has a high demand for black panthers…he wants Jonny back at any costs. She thinks she is the only panther shifter in existence and a freak of nature. She has no idea she isn’t alone. Marc Bowen lost his original mate in a freak accident when they were teenagers. He has resigned himself to stay in the background watching his brothers finding their other halves to find happiness. He’s even considered moving away for a while. Fate, however, has other plans for Marc. Now that Marc has found Jonny, there is no way he’s letting her go. He needs her to be complete. Earning her trust, however, is easier said than done. Jonny trusts no one and is afraid to love. Everyone she has ever loved has always gotten hurt because of her and she won’t stand around and just let that happen.Family is everything to the Bowens. Now that Dawson has tracked Jonny down the Bowens band together to protect her. Their plans are nearly fail proof…nearly…what could go wrong? Right? Find out in the fourth installment of the Bowen Boys―Marc.",
  "genres": [
    "Paranormal Romance",
    "Paranormal",
    "Shapeshifters"
  ],
  "author": "Kathi S. Barton",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/17332391-marc"
}