{
  "title": "Dylan",
  "description": "“I think you might want to sit down, dear,” Corrine said to her. “This is about to become very frightening for you. Oh, and don’t run. If you do, it will cause you problems, and I don’t believe you need any more of those right now, do you?”She shook her head and looked back at Dylan. The man had a chest that just screamed to be licked. When he winked at her, she flushed. Then thought of shooting his dick off.“Not nice. What will I do with you if you do that?” She flushed more when she caught images of them together in the big bed, and looked at the bed. She knew that he was doing that and tried not to think how enjoyable it would be. His low growl had her looking at him again.The room tightened, and she had a feeling that all the air had been sucked out of the room. When she lifted her gun up, she only raised it a few inches when she realized what had happened. The room was full of panthers.As soon as Jack Crosby found the tracking device implanted in her head and had it removed, she knew she was in trouble. She had managed to avoid her employers for the past couple of weeks but knew that this next job was a setup and would more than likely get her killed.When Dylan Bowen walked out his front door, he was startled to find a beautiful woman on his porch aiming a gun at his chest. She sat on his swing with a puddle of blood pooling beneath her. She had several gunshot wounds and no memory of who she was. Dylan knew by her scent who she was to him or would be if she didn’t die first.When Jack’s memory returns she knows they’re all dead if she’s found and leaving is the only answer, but not if Dylan has anything to say about it. Dylan will say or do anything to stop her from going…anything…including tricking her into bonding as his mate.Kirby Mann, Jack’s employer, wants her dead. All he has to do is find her. She’s a liability to them all.Lucius wants Jerry Small released from prison and put in the White House. A man like Small in the White House was just the type of man to start wars. War was the perfect environment for a vampire like Lucius where people could disappear, and no one would be the wiser. In his mind, Jack was the person to make that happen.The Bowens must band together if they are all to survive because danger lurks in dark corners and Jack and Dylan’s destiny is yet uncharted. But when one of their own is captured by Lucius will they be strong enough to defeat him? Find out in the third installment of The Bowen Boys.",
  "genres": [
    "Paranormal Romance",
    "Paranormal",
    "Shapeshifters"
  ],
  "author": "Kathi S. Barton",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/17332387-dylan"
}