{
  "title": "The Orchardist",
  "description": "At the turn of the twentieth century, in a rural stretch of the Pacific Northwest in the foothills of the Cascade Mountains, an orchardist named Talmadge carefully tends the grove of fruit trees he has cultivated for nearly half a century. A gentle, solitary man, he finds solace and purpose in the sweetness of the apples, apricots, and plums he grows, and in the quiet, beating heart of the land. Everything he is and has known is tied to this patch of earth. It is where his widowed mother is buried, taken by illness when he was just thirteen, and where his beloved sister Elsbeth mysteriously disappeared. It is where the horse wranglers pass through each spring with their wild herds, setting up camp in the flowering meadows between the trees.One day, while in town to sell his fruit at the market, two girls, barefoot and dirty, steal some apples. Later, they appear on his homestead, cautious yet curious about the man who gave them no chase. Feral, scared, and very pregnant, Jane and her sister Della take up on Talmadage's land and indulge in his compassion. Yet just as the girls begin to trust him, brutal men with guns arrive in the orchard, and the shattering tragedy that follows sets Talmadge on an irrevocable course not only to save and protect the girls but to reconcile the ghosts of his own troubled past.Writing with breathtaking precision and empathy, Amanda Coplin has crafted an astonishing debut novel about a man who disrupts the lonely harmony of an ordered life when he opens his heart and lets the world in. Transcribing America as it was before railways and roads connected its corners, she weaves a tapestry of solitary souls who come together in the wake of unspeakable cruelty and misfortune, bound by their search to discover where they belong. At once intimate and epic, evocative and atmospheric, filled with characters both vivid and realistic, and told in a distinctive narrative voice, The Orchardist marks the beginning of a stellar literary career.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Book Club",
    "Historical",
    "Literary Fiction",
    "Audiobook",
    "Westerns"
  ],
  "author": "Amanda Coplin",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/17332920-the-orchardist"
}