{
  "title": "Mrythdom: Game of Time",
  "description": "Drums were beating mercilessly; the air was thick and stifling, making every breath feel like his last. People were shouting somewhere in the distance, an argument of some kind. The accents were strange, but he could understand the words. His eyes were shut as though with glue, leaving everything in terrifying blackness.“What have I done?”Cackling laughter.\"You’ve brought me an elder. What a delightful gift, Gabrian. The relic, now, if you please.”“Come and get it.”. . .While flying his courier vessel through an asteroid belt to lose pursuing patrollers, Aurelius accidentally flies through a portal into the future where he discovers that his entire civilization has been destroyed by some climactic event. The decaying ruins of cities are everywhere, tucked neatly between vast tracts of unfamiliar land. Whatever destroyed his civilization, reformed the face of Meridia, too.Everything about Meridia has changed. Where before humans were the only sentient species, now there are countless magical and mythical beings. . . . Meridia has become Mrythdom.Aurelius realizes that in this strange world his only hope of survival is to find a way back to his time. On the other side of the time gate, he encounters Gabrian, an ill-tempered old wizard who needs his help to get back the relic which brought Aurelius to the future. But the relic was stolen by a powerful gremlin mage, and recovering it will not be easy.Along their quest they’ll hunt with the giant woodsmen of Nordom in the towering Elder Forest. They’ll fight gryphons, leviathans, werewolves, and trolls; they’ll bring some of these strange creatures along on their quest, and they’ll discover the city of Meria, far beneath the Misty Sea, ruled by mermaids and their human captives, a place where men are little more than studs to provide offspring for their mermaid wives, and where the old, the ugly, or the unwanted men must go to the Ring and fight for their lives as gladiators for the mermaids’ entertainment. But as Aurelius travels through Mrythdom, he begins to realize that not everything is as it seems; he is but a pawn in a much larger game, and he is being watched. Aurelius must find a way home quickly before he loses everything in this Game of Time.",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Amazon"
  ],
  "author": "Jasper T. Scott",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/17333172-mrythdom"
}