{
  "title": "Man Repeller: Seeking Love. Finding Overalls.",
  "description": "The bold voice behind the popular Man Repeller blog shares humorous and deeply personal essays demonstrating that what we choose to wear may hold our dearest memories.Engage using #manrepeller.Silk parachute pants. A gold lamé jumpsuit. Ankle boots with fringe. Were these fashion-forward items sending men running in the opposite direction? Maybe, but Leandra Medine never cared.Slipping into drop-crotch shorts and a boxed sequin blazer in the dressing room of Topshop in downtown Manhattan, a brokenhearted Leandra had an epiphany. Looking in the mirror, she suddenly realized she didn't have a boyfriend because of the way she dressed. And the more she thought about it, the more she realized that such outfits said a lot about her life-romantic and otherwise.Now, in her first book, the acclaimed blogger and fashion darling recounts her most significant memories through the lens of her sartorial choices. With her signature sass, blunt honesty, and some personal photos, Leandra shares details of the night she lost her virginity right down to the pair of white tube socks she forgot to take off, as well as when and why she realized her grandma's vintage Hermès ostrich skin clutch could hold much more than just keys and a cell phone. Through it all, she proves you don't need to compromise even your most repellent qualities to find your way into that big white dress (and an organza moto jacket). See? You can have your yeti and wear it, too.Showcasing the singular voice that has won Leandra millions of fans, this book is a collection of awkwardly funny experiences, a sweet love story, and above all, a reminder to celebrate and embrace a world made for women, by women.",
  "genres": [
    "Fashion",
    "Memoir",
    "Nonfiction",
    "Biography",
    "Essays",
    "Feminism",
    "Humor"
  ],
  "author": "Leandra Medine",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/17333432-man-repeller"
}