{
  "title": "The Secret Influence of the Moon: Alien Origins and Occult Powers",
  "description": "The Moon is not a cold, dead rock but a rich, fascinating world just as alive as Earth• Investigates the Moon as the home of an alien intelligence who controls humanity• Examines several of NASA’s Apollo missions and the findings they concealed• Reveals the many holes in the “Giant Impact” theory about the Moon’s origins and the evidence for a hollow, artificial Moon• Explores the deep influence of the Moon on the collective mind of humanity and occult teachings about the Moon from the Qabbalah, tarot, and other sourcesDespite being the most prominent celestial body after the Sun, the Moon has many qualities that science has yet to explain. Lunar rock samples reveal the Moon once had a magnetic field like the Earth, and seismic experiments by NASA suggest the Moon is at least partially hollow. For centuries people have observed lights, moving clouds and shadows, and even the disappearance of entire craters via telescope. Apollo astronauts repeatedly felt the presence of a “non-human intelligence” during their Moon visits, and many indigenous traditions speak of malevolent visitors from the Moon. A growing body of astrophysical and geological evidence shows the Moon is not an entirely natural world--that someone or something altered it long ago.Louis Proud explores the phases and movements of the Moon along with its ancient and mysterious features--its craters, maria, rilles, tunnels, and domes. He examines several of NASA’s Apollo missions, showing not that NASA faked the Moon expeditions but that they concealed what the astronauts found there. He explains the many holes in the commonly accepted “Giant Impact” theory of the Moon’s origins and reveals the evidence for a hollow, artificial Moon placed in orbit eons ago to observe Earth. Examining the deep influence of the Moon on the collective mind of humanity, Proud looks at what the Qabbalah, the tarot, and other occult traditions say about the Moon and interprets G. I. Gurdjieff’s teachings that “we are food for the Moon.” He investigates the Moon as a gateway to another realm, as the Purgatory of Christianity, and as the home of an alien intelligence who controls and exploits humanity.Examining the Moon from both scientific and esoteric perspectives, Proud shows the Moon is not a cold, dead rock but a rich, fascinating world just as alive as Earth.",
  "genres": [
    "Metaphysics",
    "Astrology",
    "Aliens"
  ],
  "author": "Louis Proud",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/17334304-the-secret-influence-of-the-moon"
}