{
  "title": "Secrets of Aboriginal Healing: A Physicist's Journey with a Remote Australian Tribe",
  "description": "AWARD-WINNING - READ IN OVER 43 COUNTRIES! A guide to the 60,000-year-old healing system of the Aborigines revealed through one man's journey to overcome multiple sclerosis* Written at the request of the Aboriginal people the author stayed with* Explores the use of dreamtime, spirit guides, and telepathy to discover and reprogram the subconscious motivations, thought patterns, and beliefs behind illness* Reveals how to tap in to healing support through the body/mind/spirit connectionIn 1983 award-winning physicist Gary Holz was diagnosed with chronic progressive multiple sclerosis. By 1988 he was a quadriplegic. Then, in 1994, his doctors told him he had two years to live. Desperate and depressed, he followed a synchronistic suggestion and went to Australia to live with a remote Aboriginal tribe. Arriving in a wheelchair, alone, with almost no feeling left from the neck down, Holz embarked on a remarkable healing transformation of body, mind, and spirit and discovered his own gift for healing others.Written at the request of the Aboriginal healers Holz worked with, this book reveals the beliefs and principles of the 60,000-year-old healing system of the Aborigines of Australia, the world's oldest continuous culture. Chronicling the step-by-step process that led to his miraculous recovery, he explains the role played by thought in the creation of health or disease and details the five essential steps in the Aboriginal healing process. He explores the use of dreamtime, spirit guides, and telepathy to discover and reprogram the subconscious motivations behind illness--a process that enacts healing at the cellular and the soul level, where the root of physical illness is found.Supported by modern science, including quantum physics, Aboriginal medicine enables each of us to tap in to healing support through the power of the body/mind/spirit connection.",
  "genres": [
    "Nonfiction",
    "Health",
    "Spirituality",
    "Alternative Medicine"
  ],
  "author": "Gary Holz D.Sc.",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/17334311-secrets-of-aboriginal-healing"
}