{
  "title": "The Ancient Giants Who Ruled America: The Missing Skeletons and the Great Smithsonian Cover-Up",
  "description": "A study of the substantial evidence for a former race of giants in North America and its 150-year suppression by the Smithsonian Institution • Shows how thousands of giant skeletons have been found, particularly in the Mississippi Valley, as well as the ruins of the giants’ cities • Explores 400 years of giant finds, including newspaper articles, first person accounts, state historical records, and illustrated field reports • Reveals the Stonehenge-era megalithic burial complex on Catalina Island with over 4,000 giant skeletons, including kings more than 9 feet tall • Includes more than 100 rare photographs and illustrations of the lost evidence Drawing on 400 years of newspaper articles and photos, first person accounts, state historical records, and illustrated field reports, Richard J. Dewhurst reveals not only that North America was once ruled by an advanced race of giants but also that the Smithsonian has been actively suppressing the physical evidence for nearly 150 years. He shows how thousands of giant skeletons have been unearthed at Mound Builder sites across the continent, only to disappear from the historical record. He examines other concealed giant discoveries, such as the giant mummies found in Spirit Cave, Nevada, wrapped in fine textiles and dating to 8000 BCE; the hundreds of red-haired bog mummies found at sinkhole “cenotes” on the west coast of Florida and dating to 7500 BCE; and the ruins of the giants’ cities with populations in excess of 100,000 in Arizona, Oklahoma, Alabama, and Louisiana. Dewhurst shows how this suppression began shortly after the Civil War and transformed into an outright cover-up in 1879 when Major John Wesley Powell was appointed Smithsonian director, launching a strict pro-evolution, pro-Manifest Destiny agenda. He also reveals the 1920s’ discovery on Catalina Island of a megalithic burial complex with 6,000 years of continuous burials and over 4,000 skeletons, including a succession of kings and queens, some more than 9 feet tall--the evidence for which is hidden in the restricted-access evidence rooms at the Smithsonian.",
  "genres": [
    "History",
    "Nonfiction",
    "Conspiracy Theories",
    "Science",
    "Archaeology",
    "Mythology",
    "Ancient History"
  ],
  "author": "Richard J. Dewhurst",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/17334410-the-ancient-giants-who-ruled-america"
}