{
  "title": "Salinger",
  "description": "Based on eight years of exhaustive research and exclusive interviews with more than 200 people—and published in coordination with the international theatrical release of a major documentary film from the Weinstein Company—Salinger is a global cultural event: the definitive biography of one of the most beloved and mysterious figures of the twentieth century.For more than fifty years, the ever elusive author of The Catcher in the Rye has been the subject of a relentless stream of newspaper and magazine articles as well as several biographies. Yet all of these attempts have been hampered by a fundamental lack of access and by the persistent recycling of inaccurate information. Salinger remains, astonishingly, an enigma. The complex and contradictory human being behind the myth has never been revealed.No longer. In the eight years since Salinger was begun, and especially in the three years since Salinger’s death, the authors interviewed on five continents more than 200 people, many of whom had previously refused to go on the record about their relationship with Salinger. This oral biography offers direct eyewitness accounts from Salinger’s World War II brothers-in-arms, his family members, his close friends, his lovers, his classmates, his neighbors, his editors, his publishers, his New Yorker colleagues, and people with whom he had relationships that were secret even to his own family. Shields and Salerno illuminate most brightly the last fifty-six years of Salinger’s life: a period that, until now, had remained completely dark to biographers. Provided unprecedented access to never-before-published photographs (more than 100 throughout the book), diaries, letters, legal records, and secret documents, readers will feel they have, for the first time, gotten beyond Salinger’s meticulously built-up wall. The result is the definitive portrait of one of the most fascinating figures of the twentieth century.",
  "genres": [
    "Biography",
    "Nonfiction",
    "History",
    "Literature",
    "Biography Memoir",
    "Literary Criticism",
    "Audiobook"
  ],
  "author": "David Shields",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/17334220-salinger"
}