{
  "title": "Straddling the Edge",
  "description": "Summer McGallian … the scandalous home wrecker from Against the Wall and Between The Sheets. The one who stole her co-worker’s fiancé, the other woman, the one people whisper about and stay away from. Only for Summer, things aren't always as they appear and she knows that better than anyone. She hasn’t been herself since she was in high school, when life was less complicated and relationships weren’t about making compromises to land the guy. When her heart is broken, there's only one thing left for her to do … prove she isn't who everyone thinks she is. And maybe, just maybe, she can get back to being comfortable in her own skin again, without input from a man. But when she encounters Sexy Guy, Dean Michaels, everything Summer has ever known about the opposite sex is about to change.Dean Michaels knew he’d seen her somewhere before. What he never imagined was that the gorgeous woman in a baseball cap and hooded sweatshirt tossing back a beer in his favorite spot could be Summer McGallian—the woman who always looked like she’d stepped off the pages of a glamour magazine when he’d seen her from afar at work. And to make matters worse, she’s Chase Marino’s ex, the one guy who gets under his skin like no other. If the thought of being someone’s bitch in jail wasn’t enough to scare him, he would’ve strangled that bastard years ago and tossed the body in the Mojave Desert. But forget about Chase … Dean knew from the moment he saw Summer’s sexy smile and heard her cute laugh, she had to be his. And he won't let anything get in the way of that.The Against The Wall series isn’t just about steamy sex scenes and swoon-worthy romance, but about new friendships, undying love, and a ton of laughter. Enjoy the ride as you get to know and love Summer and Dean, just as you did Shelly and Matt, and Melissa and Tyler, in the third book, Straddling The Edge.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "New Adult",
    "Amazon",
    "Humor",
    "Teachers"
  ],
  "author": "Julie Prestsater",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/17336450-straddling-the-edge"
}