{
  "title": "The Anne Stories (Anne of Green Gables, #1-3, 5, 7-8)",
  "description": "The Anne of Green Gables Series and MUCH MORE in one Collection!As the father of four daughters who LOVE the Anne books, I set out to create the ultimate Kindle edition of these timeless books. I wanted a perfectly-formatted, easy-to-use Kindle release that included these amazing books at a fantastic price. And here is the result!This exciting collection has these great features:The complete text of eight great books featuring Anne \"with an e\" ShirleyThree additional novels from Lucy Maud MontgomeryOne complete book of poetry by Montgomery, \"The Watchman and Other Poems\"142 wonderful short stories written by MontgomeryLinks to download the unabridged audiobooks of all 11 novels for FREE!The ability to easily jump to any book using the Kindle \"go to\" featureAn individual, active table of contents for each book so you can go to any chapterClean formatting, giving you full control over fonts and font sizesDid I mention an unbeatable price?All titles in this Anne of Green Gables collection, along with their publication date, are listed below.Anne of Green Gables (1908)Anne of Avonlea (1909)Anne of the Island (1915)Anne's House of Dreams (1917)Rainbow Valley (1919)Rilla of Ingleside (1921)Chronicles of Avonlea (1912)Further Chronicles of Avonlea (1920)The Story Girl (1911)The Golden Road (Sequel to The Story Girl, 1913)Kilmeny of the Orchard (1910)The Watchman and Other Poems (1916)The Short Story Collection (1896-1922)Unfortunately, there are two books in the Anne of Green Gables series which were published later and can't yet be included in this Kindle collection because of copyright restrictions. These are \"Anne of Windy Poplars\" (1936) and \"Anne of Ingleside\" (1939).Thanks for checking out my Anne Stories collection. I hope you and your family enjoy these books as much as we have!",
  "genres": [
    "Classics",
    "Fiction",
    "Historical Fiction",
    "Young Adult",
    "Childrens",
    "Romance",
    "Historical"
  ],
  "author": "L.M. Montgomery",
  "average_rating": "4.64",
  "url": "https://www.goodreads.com/book/show/17336384-the-anne-stories-anne-of-green-gables-1-3-5-7-8"
}