{
  "title": "Ne Güzel Şey Hatırlamak Seni",
  "description": "Genco Erkalın Sesinden Nâzım Hikmet ŞiirleriNe güzel şey hatırlamak seni. Sana tahtadan bir şeyler oymalıyım yine:bir çekmecebir yüzük, ve üç metre kadar ince ipekli dokumalıyım. Ve hemen fırlayarak yerimden Penceremde demirlere yapışarak hürriyetin sütbeyaz maviliğine sana yazdıklarımı bağıra bağıra okumalıyım...Nâzım Hikmetin seçme şiirlerinden oluşan Ne Güzel Şey Hatırlamak Seni kitabı, kitap ve kitapla birlikte verilen 4 CD ekinden oluşuyor.CDlerde sanatçı Genco Erkalın sesinden dinleyeceğimiz 51 Nâzım şiiri, şairin hemen bütün kitaplarından, şiir serüveninin gelişmesini de gözeten, sevda, hasret ve siyasi şiirlerinden dengeli bir seçim yapılarak hazırlandı.Yapı Kredi Yayınları tarafından yayımlanan Ne Güzel Şey Hatırlamak Seni kitabındaki Nâzım Hikmet şiirlerinden bazıları ise şöyle: Hasret, Sesini Kaybeden Şehir, Mavi Gözlü Dev, Minnacık Kadın ve Hanımelleri, Karıma Mektup, Ne Güzel Şey Hatırlamak Seni, Karlı Kayın Ormanında, Ceviz Ağacı, Mavi Liman, Kara Haber ve Henüz Vakit Varken Gülüm.\"Genco Erkal'ın sesinden Nâzım Hikmet Şiirleri'ni seçerken, YKY'nin (daha önceden Memet Fuat'ın yönetiminde yayımlanan) Nâzım külliyatının sırasını gözettik. Bu çalışma sırasında Nâzım'ın hemen bütün kitaplarından, şiir serüveninin gelişmesini de gözeten örnekler seçmeye çalıştık. Genco Erkal'ın önerisiyle listeye ekler de yaptık. Sonuçta Nâzım'ın sevda, hasret ve siyasi şiirlerinden dengeli bir seçim ortaya çıktı.Bazı şiirler uzun şiirlerin parçası ya da adsız (bazen de başlıklı) olduğu için, CD listesinde ve içindekilerde, arandığında kolay bulunsun diye, bilinen ve hemen hatırlanan ilk dizelerini, köşeli parantez içinde belirttik. O yüzden içindekiler listesi ile CD listesinde küçük farklılıklar oluştu.Nâzım külliyatından yalnızca Memleketimden İnsan Manzaraları'ndan parçalar almadık. Belki bu bizi yeni bir çalışma yapmaya yöneltecektir.",
  "genres": [
    "Poetry",
    "Turkish Literature",
    "Turkish"
  ],
  "author": "Nâzım Hikmet",
  "average_rating": "4.70",
  "url": "https://www.goodreads.com/book/show/17336894-ne-g-zel-ey-hat-rlamak-seni"
}