{
  "title": "Chosen",
  "description": "In CHOSEN (Book #4 of the Vampire Legends), Rachel Wood wakes after having just taken the leap of faith with Benji with the Blue Tablet. She searches for him, amazed she is still alive, only to find that he did not fare as well: he is mortally injured. And with only days left to live, he needs her help to survive. He needs her to find the ancient Red Amulet, the only element known to be able to heal a vampire.Rachel embarks on a journey to save her love—a journey which will take her deep into the heart of the gravest danger. She will have to confront rival covens, and to search far and wide as she follows the trail of clues. It leads her to Hunter, to Benji's parents, who still live in an ancient castle in Maine, on a remote island. And it leads her back home, to her family and friends, who she will have to confront once again. Her journeys take her into the heart of fraternity parties, and of old houses with hidden secrets and ancient books.In the meantime, Rob is now a fully turned vampire—and he has never given up his feelings for Rachel. In fact, as a vampire, they are even more intense. He will stop at nothing until he finds her and has her again. Along the way, he will leave a trail of devastation, out of control with his newfound vampire powers and his lust to feed. He will confront Arielle, Rachel's brother Marc, and even track down her sister Sarah at her dorm room in Syracuse. He will stop at nothing to find Rachel.But Rachel is on an urgent mission herself, to save Benji, and it may be too late. When her mission finally ends, she will be left with a choice, one that will force her to choose if she will make the greatest sacrifice of her life. Is she willing to give up her life to save her one and only true love? How much is she willing to sacrifice?CHOSEN is book #4 of the Vampire Legends series (following SWORN, TAKEN and BITTEN), and is also a standalone novel.",
  "genres": [
    "Vampires",
    "Young Adult",
    "Paranormal",
    "Fiction",
    "Fantasy",
    "Amazon"
  ],
  "author": "Emma Knight",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/17337223-chosen"
}