{
  "title": "Personal Statement",
  "description": "Getting into college has never been harder. Can't rely on a perfect SAT score or a 5 on your AP Mandarin exam anymore. And field hockey and basketball? Please. The real sport is Volunteering. Change the world—and tell Harvard all about it.In Emmy Award nominee Jason Odell Williams’ hilarious first novel, PERSONAL STATEMENT, it’s open season on admissions—and a Category-3 hurricane is headed for Connecticut. Self-proclaimed tiger-daughter Emily Kim drags her best friend, apathetic test-taking genius Rani Caldwell, to the coastal town of Cawdor, where Emily’s sure her humanitarian efforts will make her Harvard application stand out from the pack. Problem is: so does everyone else.When Emily and Rani arrive, hundreds of other teenagers—including Robert Clinton III, gay, black and meant for the Sorbonne—are already in Cawdor with the same idea. Observing the battle royale is Alexis J. Gould, aide to the Governor and a veteran of the college admissions rat race. To the kids in Cawdor, it’s not a natural disaster. It’s an opportunity. Let the games begin!ADVANCE PRAISE FOR PERSONAL STATEMENT:“For the striver and slacker in all of us, 'Personal Statement' hits deliciously close to the bone with a mordantly hilarious satire of resume-polishing and ambition. For anyone who ever inflated a title, or wished they did. A page-turning delight!” - Sarah Ellison, Vanity Fair Contributing Editor and Author of War at The Wall Street Journal“A hilarious take on the merciless winner-take-all world of college applications. A wild book.” - Tony D'Souza, author of Mule“Don’t tell the person you hired to take the SATs for you that you are reading Personal Statement! This delightful book has a lot of fun with college mania. You will, too.” - Gregg Easterbrook, author of The Leading Indicators\"Whip smart and sharply observed, Jason Odell Williams' PERSONAL STATEMENT is a hilarious take on the coming of age novel.  I couldn't put it down.\" - Brenda Janowitz, Author, RECIPE FOR A HAPPY LIFE “In a society where so many kids and families have accepted busyness as a norm, it’s refreshing to find a book that inspires us to think deeply about our current culture and how we can create a healthier educational culture for our children. And it’s invigorating to see such a call to action come in the form of smart humor and playful self-deprecation. Personal Statement is a must-read for parents, educators, counselors, and students.”  - Vicki Abeles, director of the critically acclaimed documentary film Race to Nowhere\"Four deeply intelligent, motivated, driven, over-achievers in a coming of age story and not a single one is a straight white guy. This is the kind of diversity that YA fiction so very often lacks. It is a breath of fresh air to see such well-written, well-developed, compelling characters like this. Excellent… an air of realism and depth that a lot of realistic YA novels miss…. Definitely high on my list. Give this one a look. It’s really fun.\" - Fandoms and Feminism",
  "genres": [
    "Young Adult",
    "Humor",
    "Fiction",
    "College",
    "Teen"
  ],
  "author": "Jason Odell Williams",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/17337123-personal-statement"
}