{
  "title": "The Second Vatican Council: An Unwritten Story",
  "description": "No event of the 20th century produced a greater effect upon the Catholic Church than Vatican II, the 21st Ecumenical Council. To many it might seem to have been simply a meeting of important churchmen gathered to discuss church matters, but because the Catholic Church is the only church founded on this earth by God himself to guide men to salvation, the reality is that centuries from now historians will likely consider it, (as well as the message to the world delivered by the Mother of God during her personal visit at Fatima in 1917), as one of the two pivotal events of world history for the recently ended century.Vatican II opened fifty years ago on October 11, 1962. Since it ended in 1965, the council has been written of in countless books, articles, scholarly journals, magazines, and newspapers all over the world. Things said and done since the council, in the name of the council and in opposition to it, have affected the lives of everyone living since that time.As with any significant historical event, it is only after considerable time has elapsed that a fuller story of exactly what happened in those years before,during, and after “the event” can be engagingly told and wisely summarized. Professor de Mattei’s genius lies in the application of a lucid, literate,and philosophical mind to thorough scholarly research and mountains of documentation. From this framework he has presented us with a story; a story of an event, a previously unwritten story that has been begging to be told for many years. This book will unfold for you the answer to the question, What happened at the Council?”“A work that is as erudite as it is relevant. I am certain that thanks to its rigorous historical-critical method it will convince a vast readership.”Cardinal Walter Brandmüller, President Emeritusof the Pontifical Committee for Historical Science",
  "genres": [
    "Religion",
    "Catholic",
    "History",
    "Christianity",
    "Nonfiction",
    "Church History"
  ],
  "author": "Roberto de Mattei",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/17337330-the-second-vatican-council"
}