{
  "title": "Talking to Your Doctor: A Patient's Guide to Communication in the Exam Room and Beyond",
  "description": "TALKING TO YOUR DOCTOR presents the new science of communication to help improve not just your time in the doctor's office and your own health, but promote the health of your community, guiding our entire health care system toward a humane medicine based on relationships.The author, Zackary Berger, M.D., Ph.D., is a practicing primary care/internal medicine doctor and an Assistant Professor at the Johns Hopkins School of Medicine, where he teaches medical students and residents. He researches doctor-patient communication in the clinic and in the hospital to understand how our health care system can be made more responsive to ordinary people. This book is based on his expertise and the experience of his patients.The last time you went to your doctor, you might have emerged feeling dissatisfied and disoriented. What did you talk about together, after all? You didn’t ask all the questions you wanted answers to, and you don’t remember everything the doctor told you. What is the plan? How do we get there? Nothing was clear after you left the office, and you don’t know whether it’s your fault or the doctor’s.Maybe it’s your fault, or the doctor’s fault, or the blame can be laid at the feet of the entire health care system. But that’s beside the point: the important thing is to identify the problem at the root of this experience and take steps to change it. That’s what this book does.In “Talking to your Doctor,” you’ll:•\tLearn how to talk to your doctor – and get your doctor to talk to you•\tDiscover the science of doctor-patient communication to the lay public•\tRemake the relationship with your doctor, and our health care system, on the basis of good communication•\tMake sure your visit with the doctor is productive and meets your needs•\tHelp yourself and others avoid over-testing and over-treatment",
  "genres": [
    "Medicine",
    "Health"
  ],
  "author": "Zackary Berger",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/17337935-talking-to-your-doctor"
}