{
  "title": "Uncle Ovid's Exercise Book",
  "description": "In these postmodernist episodes of high comedy, Don Webb turns Ovid's classic work, The Metamorphosis, on its head. Awarded the 1988 Illinois State University/Fiction Collective Prize through a nationwide fiction competition, Webb's first book of fiction, Uncle Ovid's Exercise Book, explores the theme of change in hitherto unimagined manifestations—from the everyday to the mysterious to the miraculous. These eight dozen \"metamorphoses\" are widely funny, profound, and—ike change itself—always surprising.With rare originality and breadth, Webb draws upon Egyptian mythology, molecular biology, classical poetry, contemporary pop culture, literary theory, Eastern mysticism, and science fiction, composing them into an offbeat fugue on the theme of transformation.\"Metamorphosis No. 39\" resurrects the ancient Egyptian gods, Set, Toth, and Osiris, who return to America to mastermind a plot to alter contemporary consciousness. Their scheme includes the broadcast of subliminal archetypal images during returns of \"I Love Lucy.\" In a later metamorphosis, another ancient god—Dionysius—returns to modern day Atlantic City to recruit winos for a new band of satyrs.Ancient gods are not the only agents of change. Metamorphosis also spreads to the White House in an episode describing the clandestine life of the president's drug supplier—who risks death to satisfy the chief executive's taste for organic hallucinogens.A hilarious New Age western saga unfolds in \"Metamorphosis No.5\" W.B. Porter, the \"Last of the Singing Cowboys\"— a hero with a degree in chemical engineering and a proficiency on the sitar—foils the Uzi-toting Mendoza gang—\"tough hombres schooled in the Fourteen Mysteries of Toltec Sorcery\"—in their attempt to pull a heist on a condo construction project.This theme of transformation extends even to the farming narrative of UOEB itself, which at one point unexpectedly becomes the diary of an Englishwoman who is held captive in a potting shed by a maniacal pastor.These variations on a theme are sometimes hilarious, sometimes cryptic, sometimes curiously moving—and always disturbingly provocative. With his hat off to Ovid, Don Webb pulls together high-spirited wit, eclecticism, and sheer inventiveness to make Uncle Ovid's Exercise Book a richly comic, absorbing, and singular work of a new order.",
  "genres": [
    "Fantasy"
  ],
  "author": "Don Webb",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/1733991.Uncle_Ovid_s_Exercise_Book"
}