{
  "title": "Disciplined by the Dom",
  "description": "What happens when the man you fall in love with is the man you have to betray? What happens when the only woman you’ve ever loved has to choose between you and her family?Actress Catie Roberts had a glamorous life that many people might envy—if they didn’t look too closely. But when Catie's mom dies and her deadbeat dad runs away with her trust fund, Catie ends up broke and the sole support of her only remaining family: her sick grandmother, who requires constant care. Catie has just one thing to fall back on. She knows about the secretive Club Volare, a New York-based BDSM club whose powerful, rich, and famous members wish to remain discreet--and she knows someone at the gossip rags willing to buy those secrets.With the backing of a gossip mag, Catie lies her way into Club Volare to research a red-hot expose. When she’s nearly caught by Jacob Jayson, heir to an old industrial fortune and all around dark, brooding, and damaged Dom, Catie gets desperate: she’ll have to submit to Jake for training as a new sub, and hope her secret never gets out. She doesn’t expect Jake to be able to see through her, and she certainly doesn’t expect to fall in love. But as their training sessions heat up and Jake turns out to be the Dom she’s always dreamed of, Catie finds out she’s in serious danger of both exposure and heartbreak.Jacob Jayson had a life that looked good from the outside, too—immense wealth concealing a vile, abusive childhood. He’s since accepted the fact that he’s irreparably damaged, a man with an inhuman heart who is incapable of love. That is, until Catie Roberts shows up. Catie sees into him like no one else can, sees so far that Jake finds himself feeling things he’s never dreamed of. Yet Jake can tell that Catie is hiding something, and unless he can find out what, he fears he may lose her. But Jake has secrets of his own, secrets that, if exposed, might cost him everything—including Catie.Both of them have every reason not to trust in love. Can they learn to trust each other?DISCIPLINED BY THE DOM is an intense BDSM erotic romance about learning how to love. It contains mature themes and content, and at least one thing you really shouldn't try at home without some training, first...",
  "genres": [
    "BDSM",
    "Erotica",
    "Romance",
    "Erotic Romance",
    "Contemporary",
    "Contemporary Romance",
    "Adult"
  ],
  "author": "Chloe Cox",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/17340129-disciplined-by-the-dom"
}