{
  "title": "But You Don't Look Arab: And Other Tales of Unbelonging",
  "description": "Emmy Award-winning international journalist Hala Gorani weaves stories from her time as a globe-trotting anchor and correspondent with her own lifelong search for identity as the daughter of Syrian immigrants. What is it like to have no clear identity in a world full of labels? How can people find a sense of belonging when they have never felt part of a “tribe?” And how does a blonde-haired, blue-eyed woman who’s never lived in the Middle East honor her Arab Muslim ancestry and displaced family—a family forced to scatter when their home country was torn apart by war? Hala Gorani’s path to self-discovery started the moment she could understand that she was “other” wherever she found herself to be. Born of Syrian parents in America and raised mainly in France, she didn’t feel at home in Aleppo, Seattle, Paris, or London. She is a citizen of everywhere and nowhere. And like many journalists who’ve covered wars and conflicts, she felt most at home on the ground reporting and in front of the camera.  As a journalist, Gorani has traveled to some of the most dangerous places in the world, covering the Arab Spring in Cairo and the Syrian civil war, reporting on suicide bombers in Beirut and the chemical attacks in Damascus, watching the growth of ISIS and the war in Iraq—sometimes escaping with her life by a hair. But through it all, she came to understand that finding herself meant not only looking inward, but tracing a long family history of uprooted ancestors. From the  courts of Ottoman Empire sultans through the stories of the citizens from her home country and other places torn apart by unrest, But You Don’t Look Arab combines Gorani’s family history with rigorous reporting, explaining—and most importantly, humanizing—the constant upheavals in the Middle East over the last century.",
  "genres": [
    "Memoir",
    "Biography",
    "Nonfiction",
    "Audiobook",
    "Biography Memoir",
    "Social Justice",
    "Autobiography"
  ],
  "author": "Hala Gorani",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/173403901-but-you-don-t-look-arab"
}