{
  "title": "Fathomfolk",
  "description": "From one of fantasy’s most exciting new voices Eliza Chan comes a modern, myth-inflected story of revolution and magic set against the glittering, semi-submerged city of Tiankawi, perfect for fans of Jade City and The Bone Shard Daughter . Welcome to Tiankawi – shining pearl of human civilization and a safe haven for those fleeing civil unrest. Or at least, that’s how it first appears. But in the semi-flooded city, humans are, quite literally, on peering down from skyscrapers and aerial walkways on the fathomfolk — sirens, seawitches, kelpies and kappas—who live in the polluted waters below. For half-siren Mira, promotion to captain of the border guard means an opportunity to reform. At last, she has the ear of the city council and a chance to lift the repressive laws that restrict fathomfolk at every turn. But if earning the trust and respect of her human colleagues wasn't hard enough, everything Mira has worked towards is put in jeopardy when a water dragon is exiled to the city. New arrival Nami is an aristocratic water dragon with an opinion on everything. Frustrated by the lack of progress from Mira's softly-softly approach in gaining equality, Nami throws her lot in with an anti-human extremist group, leaving Mira to find the headstrong youth before she makes everything worse. And pulling strings behind everything is Cordelia, a second-generation sea-witch determined to do what she must to survive and see her family flourish, even if it means climbing over the bodies of her competitors. Her political game-playing and underground connections could disrupt everything Nami and Mira are fighting for. When the extremists sabotage the annual boat race, violence erupts, as does the clampdown on fathomfolk rights. Even Nami realises her new friends are not what they seem. Both she and Mira must decide if the cost of change is worth it, or if Tiankawi should be left to drown.",
  "genres": [
    "Fantasy",
    "Mythology",
    "Dragons",
    "Fiction",
    "Adult",
    "High Fantasy",
    "Audiobook"
  ],
  "author": "Eliza Chan",
  "average_rating": "3.15",
  "url": "https://www.goodreads.com/book/show/173404001-fathomfolk"
}