{
  "title": "Slow Noodles: A Cambodian Memoir of Love, Loss, and Family Recipes",
  "description": "A haunting and beautiful memoir from a Cambodian refugee who lost her country and her family during Pol Pot's genocide in the 1970s but who finds hope by reclaiming the recipes she tasted in her mother's kitchen. With over 20 Khmer recipes included, Slow Noodles will resonate with readers who loved the food and emotional truth of Michelle Zauner's Crying in H Mart, and it has the staying power of Loung Ung's  First They Killed My Father.Take a well-fed nine-year-old with a big family and a fancy education. Fold in 2 revolutions, 2 civil wars, and one wholesale extermination. Subtract a reliable source of food, life savings, and family members, until all are gone. Shave down childhood dreams for approximately two decades, until only subsistence remains. In Slow Noodles, Chantha Nguon recounts her life as a Cambodia refugee who lost everything and everyone—her house, her country, her parents, her siblings, her friends—everything but the memories of her mother’s kitchen, the tastes and aromas of the foods her mother made before the dictator Pol Pot tore her country apart in the 1970s, killing millions of her compatriots. Nguon’s irrepressible spirit and determination come through in this emotional and poignant but also lyrical and magical memoir that includes over 20 recipes for Khmer dishes like chicken lime soup, banh sung noodles, pâté de foie, curries, spring rolls, and stir-fries. For Nguon, recreating these dishes becomes an act of resistance, of reclaiming her place in the world, of upholding the values the Khmer Rouge sought to destroy, and of honoring the memory of her beloved mother.From her idyllic early years in Battambang to hiding as a young girl in Phnom Penh as the country purges ethnic Vietnamese like Nguon and her family, from her escape to Saigon to the deaths of mother and sister there, from the poverty and devastation she experiences in a war-ravaged Vietnam to her decision to flee the country. We follow Chantha on a harrowing river crossing into Thailand—part of the exodus that gave rise to the name “boat people”—and her decades in a refugee camp there, until finally, denied passage to the West, she returns to a forever changed Cambodia. Nguon survives by cooking in a brothel, serving drinks in a nightclub, making and selling street food, becoming a suture-nurse treating refugees abused by Thai authorities, and weaving silk. Through it all, Nguon relies on her mother’s “slow noodles” approach to healing and to cooking, one that prioritizes time and care over expediency. Haunting and evocative, Slow Noodles is a testament to the power of culinary heritage to spark the rebirth of a young woman’s hopes for a beautiful life.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Food",
    "Audiobook",
    "History",
    "Asia",
    "Cookbooks"
  ],
  "author": "Chantha Nguon",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/173404032-slow-noodles"
}