{
  "title": "Lonely Planet Best Beaches: 100 of the World’s Most Incredible Beaches",
  "description": "Discover 100 of the world's most breathtaking beaches in this inspirational coffee table book that features exquisite photography throughout. From hidden paradises in Thailand to the pink-white sands of Greece’s Elafonisi Beach, this guide offers the ultimate collection of extraordinary beaches - perfect for inspiring your next beach adventure.   From remote islands to secret coves, urban seasides to sprawling golden shorelines, tropical archipelagos to dramatic coasts, this alluring guide to our planet's most magnificent and interesting beaches uses a combination of aerial and ground photography to capture unique perspectives of must-visit utopias. With expert insights as to why each beach is so special, plus essential information on how to get there, and handy lists detailing the best family beaches; surfing beaches; remote beaches; and more - readers will find all the inspiration they need to pack their bags and make way for the waves. Inside Lonely Planet's Best - 100 exceptional beaches around the world including the location of each beach and how to access it- Stunning photography throughout that captures the extreme beauty and dazzling scenery of each beach- Expert knowledge and insider tips to help you get there plus top 5 featured beaches so you can find the best beach experiences to suit your travel interests- Contents include Trang Islands (Thailand); Ha Long Bay (Vietnam); Las Cabanas Best at El Nido (Philippines); Sunayama Beach (Japan); Whitehaven Beach, Queensland (Australia); Zlatni Rat, Brac (Croatia); Scala dei Turchi, Sicily (Italy); Formentera, Balearic Islands (Spain); Elafonissi Beach, Crete (Greece); Rauoisandur (Iceland); Baia dos Porcos (Brazil); Manuel Antonio Beach (Costa Rica); Gardner Bay, Espanola, Galapagos (Ecuador); Tulum Beach (Mexico); Sandbanks Provincial Park, Ontario (Canada); Sand Harbor, Lake Tahoe (USA); Hanalei Bay, Kauai (USA) and many more!   Whether you're looking for the perfect collection of beach photography for your home or you're seeking out ideas for your next out-of-this-world trip, Lonely Planet's Best Beaches offers a definitive compendia of sandy destinations for readers - and makes the perfect gift for those who feel the pull of the ocean.About Lonely Lonely Planet, a Red Ventures Company, is the world's number one travel guidebook brand. Providing both inspiring and trustworthy information for every kind of traveller since 1973, Lonely Planet reaches hundreds of millions of travellers each year online and in print and helps them unlock amazing experiences. Visit us at lonelyplanet.com and join our community of followers on Facebook (facebook.com/lonelyplanet), Twitter (@lonelyplanet), Instagram (instagram.com/lonelyplanet), and TikTok (@lonelyplanet).",
  "genres": [
    "Travel"
  ],
  "author": "Lonely Planet",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/173404117-lonely-planet-best-beaches"
}