{
  "title": "Five Words In Black",
  "description": "Twenty-seven years ago, a brutal civil war destroyed North America. Known as \"The Cull,\" over fifty percent of the population was wiped out in the struggle for power. Only the totalitarian Cause Party emerged from the smoke. The paramilitary Patrols keep order in the streets, ensuring the taboos are never violated. Any who oppose are reeducated in the BootSchools - or more commonly, STATCulled and their bodies processed for profit on the organ market.Twenty-nine days ago, Dana Adcox was hit by a car, leaving him in a coma. Yesterday, he woke up. Today, he holds a secret against his will that could topple the Cause.Many would kill for it. And many intend to.The grassroots rebellion, The Sect, offer him protection and information, revealing what he contains - a biological anomaly that could be used to free the people of the United American Republic. The Cull was a blind genocide crusading under the banner of toxoplasmosis - a mind-altering parasite a great deal of people carry, even in our world. A cure for toxo would undercut The Cause and provide a thread by which to unravel their dominance. The Cause Party knows this too, and also knows how to reconfigure the anomaly into a viral bioweapon. They would know - they were the ones who put it in him. The ChristCorps, the military wing of the once-again rejoined church and state, has their own player in the race for Dana, knowing securing him first could mean a resurgence of papal power.The Cause, the insidious ChristCorps, and the rebelling Sect all race to reach him, each for their own means. Forced to run through dystopian cityscapes and shunned by his loved ones, time is running out.ANUBIS Combat drones stalk his path. Fascist Patrolmen are running him down. A renegade ChristCorpsman is personally tasked with his destruction.In this haunting possible view of the near future, at the end - only one thing is certain: FIVE WORDS IN BLACK.",
  "genres": [],
  "author": "Ian DG Sandusky",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/17340470-five-words-in-black"
}