{
  "title": "Death of a Spy",
  "description": "Sergeant Hamish Macbeth faces a string of mysterious robberies that are only the beginning of an international threat to his sleepy Scottish village of Lochudch in the latest mystery in M.C. Beaton’s beloved, New York Times bestselling series.Sergeant Hamish Macbeth has some major problems to deal with – crimes and criminals, even law enforcement agents, that he doesn’t want anywhere near his beloved Highland village in Lochdubh. Hamish is worried about how the locals, as well as those in the wider area of his territory in Sutherland, will react to his new assistant officer. The officer is none other than the enigmatic American James Bland who is on an exchange scheme from his home city of Chicago in the United States, supposedly to study policing methods in Scotland.Hamish knows that this is far from the truth. Having recently become involved in identifying a Russian spy ring to solve a murder, he is aware that Bland’s mission is to track down the members of the spy network still at large. Bland trusts Hamish to help him find all of those who may have been, or may still be, in league with the Russians.In the meantime, he and Bland have to contend with the everyday chores of rural policing. The tourist season brings with it the usual crop of traffic incidents, lost wallets, lost dogs, and people who are simply lost, but a spate of burglaries and robberies committed by a man described as having a gold tooth and a spider’s web tattoo on his neck give Hamish cause for serious concern. The robberies become increasingly violent and the man is dubbed \"Spiderman\" by the local press. Hamish has to use all of his contacts and every ounce of his Highland guile to find the robber.",
  "genres": [
    "Mystery",
    "Fiction",
    "Cozy Mystery",
    "Audiobook",
    "Scotland",
    "Crime",
    "Humor"
  ],
  "author": "M.C. Beaton",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/173404035-death-of-a-spy"
}