{
  "title": "The Unconquered: In Search of the Amazon's Last Uncontacted Tribes",
  "description": "THE UNCONQUERED TELLS THE EXTRAORDINARY TRUE STORY OF A JOURNEY INTO THE DEEPEST RECESSES OF THE AMAZON TO TRACK ONE OF THE PLANET’S LAST UN-CONTACTED INDIGENOUS TRIBES.Even today there remain tribes in the far reaches of the Amazon rainforest that have avoided contact with modern civilization. Deliberately hiding from the outside world, they are the unconquered, the last survivors of an ancient culture that predates the arrival of Columbus in the New World.  In this gripping first-person account of adventure and survival, author Scott Wallace chronicles an expedition into the Amazon’s uncharted depths, discovering the rainforest’s secrets while moving ever closer to a possible encounter with one such tribe—the mysterious flecheiros, or “People of the Arrow,” seldom-glimpsed warriors known to repulse all intruders with showers of deadly arrows. On assignment for National Geographic, Wallace joins Brazilian explorer Sydney Possuelo at the head of a thirty-four-man team that ventures deep into the unknown in search of the tribe. Possuelo’s mission is to protect the Arrow People. But the information he needs to do so can only be gleaned by entering a world of permanent twilight beneath the forest canopy.Danger lurks at every step as the expedition seeks out the Arrow People even while trying to avoid them. Along the way, Wallace uncovers clues as to who the Arrow People might be, how they have managed to endure as one of the last unconquered tribes, and why so much about them must remain shrouded in mystery if they are to survive. Laced with lessons from anthropology and the Amazon’s own convulsed history, and boasting a Conradian cast of unforgettable characters—all driven by a passion to preserve the wild, but also wracked by fear, suspicion, and the desperate need to make it home alive—The Unconquered reveals this critical battleground in the fight to save the planet as it has rarely been seen, wrapped in a page-turning tale of adventure.",
  "genres": [
    "Nonfiction",
    "Travel",
    "History",
    "Adventure",
    "Anthropology",
    "Science",
    "Nature"
  ],
  "author": "Scott  Wallace",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/10782759-the-unconquered"
}