{
  "title": "Lady Belling's Secret",
  "description": "Lady Francesca Bellings has been madly in love with her older brother’s best friend for as long as she can remember and, of course, the object of her affection never considered her much more than an annoyance in braids. But while Thomas Wallingham was off fighting Napoleon, she grew up. Now her life is moving along in all the expected directions of a well-bred lady of the ton, but a chance encounter with her first love throws everything into turmoil. From a young age, Thomas Wallingham escapes the crushing apathy of his own parents by spending as much time as possible with his best friend’s family. In order to avoid a messy scandal, he enlists in service of the Crown, disappointing his adopted family by going off to war. When he unexpectedly inherits a title, the new Earl of Harrington returns to London desperately hoping five years of estrangement can be forgiven. All his plans are cast asunder when he rediscovers Francesca. Thomas finds that he can think of little else than the willowy flame haired beauty. After a heated encounter and giddy with romantic feelings, Thomas plans to ask for her hand in marriage but is devastated when a nearly hysterical Francesca tells him she is already engaged to be wed to the Marquess of Dalton in less than two weeks. Loving him more than she ever thought possible, Francesca is terrified of repeating a scandal that nearly destroyed her family. But if she thinks that Thomas is going to go away quietly, she is sadly mistaken. Endeavoring to be in her presence as much as possible, Thomas chips away at her resolve to honor her family and her commitments, and they find it nearly impossible to keep their hands off each other even as her wedding date draws devastatingly nearer.The problem of a fiancé who won’t disappear is compounded by the discouraging fact that Thomas comes to discover the man is not the evil, lecherous brute he’d imagined, rather a great fellow he comes to genuinely like and respect. But just as soon as Thomas can finally see a clear path to all he desires, the wrath of his best friend, Francesca’s brother, crashes down on them. As the date of the wedding draws menacingly closer, it’s only by the machinations of unexpected parties that clear the way for Thomas and Francesca to be together. But even then, it will only work if Thomas can overcome the diminished self-worth beaten into him by his father, and Francesca can accept the actions of a man who loves her - even if he can’t say the words.",
  "genres": [
    "Romance",
    "Historical",
    "Historical Romance",
    "Regency",
    "Historical Fiction"
  ],
  "author": "Amylynn Bright",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/17342518-lady-belling-s-secret"
}