{
  "title": "Business Sutra: A Very Indian Approach to Management",
  "description": "Why we do business impacts how we do it and what ultimately gets done. As is belief, so is behavior, so is business. This is Business Sutra, a very Indian way of doing business.It is very different from Management Science, taught in business schools around the world, which does not factor in belief, because belief is subjective truth, hence cannot be measured.Despite the veneer of objectivity, Management Science is rooted in Western belief. Just as ancient Greeks celebrated Elysium, much-cherished heaven of heroes, and the Bible speaks of the Promised Land, ultimate destination of faithful, Management Science is goal-oriented, obsessed with vision, mission, objectives, milestones, and targets.By contrast, Business Sutra is gaze-oriented. Great value is placed on the practice of darshan: how we see the world and our relationship with Lakshmi, goddess of wealth, whose image adorns Hindu homes, Jain temples and Buddhist stupas.If we believe that wealth is something that needs to be pursued, we end up turning the workplace into a rana-bhoomi, a battleground of investors, regulators, employers, employees, vendors, competitors and customers.If we believe that wealth is something that needs to be attracted, we end up turning the workplace into a ranga-bhoomi, a playground where everyone is happy.Communicated symbolically through the stories, symbols and rituals of India, which have been transmitted across the subcontinent for centuries, Business Sutra reveals a radically different approach to management, business, goverance, leadership, even economics and politics, that India seems to have forgotten, and the world has overlooked.Who better to unravel it than India’s foremost mythologist, renowned speaker, columnist, author, leadership coach and Chief Belief Officer of Future Group, Devdutt Pattanaik.He reveals how Management Science is based on the assumption that the world is finite, certain, controllable and linear. But in a global village, where everything is volatile and vibrant, there is need for a theory that is more comfortable with infinity, diversity, uncertainty and non-linear modes of thinking. Hence, Business Sutra.",
  "genres": [
    "Business",
    "Management",
    "Mythology",
    "Nonfiction",
    "Leadership",
    "India",
    "Spirituality"
  ],
  "author": "Devdutt Pattanaik",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/17342664-business-sutra"
}