{
  "title": "The Good House",
  "description": "How can you prove you're not an alcoholic?You can't.It's like trying to prove you're not a witch.Hildy Good is a townie. A lifelong resident of an historic community on the rocky coast of Boston's North Shore, she knows pretty much everything about everyone. Hildy is a descendant of one of the witches hung in nearby Salem, and is believed, by some, to have inherited psychic gifts. Not true, of course; she's just good at reading people. Hildy is good at lots of things. A successful real-estate broker, mother and grandmother, her days are full. But her nights have become lonely ever since her daughters, convinced their mother was drinking too much, staged an intervention and sent her off to rehab. Now she's in recovery--more or less.Alone and feeling unjustly persecuted, Hildy needs a friend. She finds one in Rebecca McCallister, a beautiful young mother and one of the town's wealthy newcomers. Rebecca feels out-of-step in her new surroundings and is grateful for the friendship. And Hildy feels like a person of the world again, as she and Rebecca escape their worries with some harmless gossip, and a bottle of wine by the fire--just one of their secrets.But not everyone takes to Rebecca, who is herself the subject of town gossip. When Frank Getchell, an eccentric local who shares a complicated history with Hildy, tries to warn her away from Rebecca, Hildy attempts to protect her friend from a potential scandal. Soon, however, Hildy is busy trying to cover her own tracks and protect her reputation. When a cluster of secrets become dangerously entwined, the reckless behavior of one threatens to expose the other, and this darkly comic novel takes a chilling turn.THE GOOD HOUSE, by Ann Leary is funny, poignant, and terrifying. A classic New England tale that lays bare the secrets of one little town, this spirited novel will stay with you long after the story has ended.",
  "genres": [
    "Fiction",
    "Audiobook",
    "Book Club",
    "Contemporary",
    "Chick Lit",
    "Adult Fiction",
    "Literary Fiction"
  ],
  "author": "Ann Leary",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/17343449-the-good-house"
}