{
  "title": "More Holmes for the Holidays",
  "description": "In Holmes for the Holidays, today's best mystery writers featured Arthur Conan Doyle's inimitable Sherlock Holmes and Dr. Watson in an original anthology of holiday whodunits. Now, Berkley Prime Crime is proud to present More Holmes for the Holidays — in which the beloved duo returns…to the scene of the crime.In Anne Perry's \"The Christmas Gift,\" a Stradivarius is plucked away from a master violinist just before a holiday performance — one Sherlock Holmes had his heart set on attending…In Loren D. Estleman's \"The Adventure of the Greatest Gift,\" Holmes receives an unusual present, a wax recording cylinder bearing festive greetings — or is it a warning about an impending war between England and France?In Carolyn Wheat's \"The Case of the Rajah's Emerald,\" Timothy \"Tiny Tim\" Cratchit requests Holmes and Watson's assistance in identifying the true heir of the late philanthropist Ebenezer Scrooge…In Peter Lovesey's \"The Four Wise Men,\" Watson's former army superior invites him to appear in a Nativity service and guard the valuable Star of Bethlehem treasure from being stolen by a villain from Holmes's past…With these and seven more merry mysteries, you can spend the season with the world's most famous detective courtesy of today's masters of mystery in More Holmes for the Holidays.ContentsIntroduction - Jon L. LellenbergThe Christmas Gift - Anne PerryThe Four Wise Men - Peter LoveseyEleemosynary, My Dear Watson - Barbara PaulThe Adventure of the Greatest Gift - Loren D. EstlemanThe Case of the Rajah's Emerald - Carolyn WheatThe Christmas Conspiracy - Edward D. HochThe Music of Christmas - L.B. BreenwoodThe Adventure of the Christmas Bear - Bill CriderThe Adventure of the Naturalist's Stock Pin - Jon L. BreenThe Adventure of the Second Violet - Daniel StashowerThe Human Mystery - Tanith Lee",
  "genres": [
    "Mystery",
    "Short Stories",
    "Fiction",
    "Christmas",
    "Anthologies",
    "Historical Fiction",
    "Holiday"
  ],
  "author": "Martin H. Greenberg",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/1734373.More_Holmes_for_the_Holidays"
}