{
  "title": "Denial the key to her enslavement",
  "description": "This tale is all about one girl who misbehaved. Now she’ll be punished with ongoing orgasm denial.Chloe has always been a brat, but she gets away with it because she is smart, funny, and beautiful. Her classmates listen to her and do whatever she wants. She’s just that good. So Chloe rules her college campus until she makes one critical mistake. Just because she can, she convinces Cindy that her boyfriend is cheating on her. Distraught but trusting her friend, Cindy breaks up with Warren. That should have been the end of it except Warren wants to know exactly what happens. Besides, someone is going to need to be punished.Chloe wakes up in the middle of the night, her arms and legs cuffed to the bed. At first, she thinks it’s a prank, at least until Warren comes out and tells her that he knows Chloe said something to his girlfriend. Now he wants to know exactly what.He cuts away her clothes, leaving her open and exposed. Rather than interrogate her with pain, Warren takes a different approach with his captive. He teases her. He strokes and plays with her until she is wet, hot, and completely desperate. Under these circumstances, she has no choice but to confess.That’s when her punishment really begins.Warren has a very special piece of hardware he forces her to wear: a locking chastity belt equipped with a vibrator. It’s connected to his phone, so he can make it tease her to arousal at any time. And because Chloe cost Warren his girlfriend, he decides that she will service him whenever he wants. He finds her on campus. He finds her at home. Warren can enjoy his new sex toy whenever he wants, however he wants. Chloe will belong to him until he’s satisfied that she has learned her lesson.Publisher's Note: This 30,000 word novella contains explicit sexual content, graphic language, and situations that some readers may find objectionable. BDSM themes include: sexual domination, extensive orgasm denial, chastity belts, various sex toys, humiliation, and spanking. This title is intended for readers over the age of 18 only.",
  "genres": [
    "BDSM"
  ],
  "author": "Ashley K. Bennet",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/17343641-denial-the-key-to-her-enslavement"
}