{
  "title": "Cliff Diver",
  "description": "When Emilia Cruz, Acapulco’s first and only female police detective, dives into the investigation of a dirty cop’s death, she might just hit the rocks instead of the water. With hot nights on the beach and suspense straight out of the headlines, CLIFF DIVER and the Emilia Cruz mystery series goes inside Mexico's drug war with a fearless style and a woman who'll be hard to forget.THE DEATH OF A DIRTY COPForced to lead the murder investigation into the death of her shady lieutenant, Emilia faces resentment from the other detectives as well as a blood-spattered crime scene, no witnesses, and the shadow of counterfeit ransom money. Reluctant to take on the investigation, Emilia soon learns that the dead lieutenant led a double life in Acapulco full of illicit sex and financial manipulation, all of which would be either red herrings or keys to the crime. Missing police files, the lieutenant’s involvement with a past kidnapping, and a possible link to a gang working for a drug cartel further combine to make this a messy case with too many loose ends.A GAME OF MONEY AND POWERExpecting to become a target herself because of her own brush with the lieutenant’s counterfeit scheme, Emilia must move quickly to find the killer. But as she pieces together the lieutenant's last hours, she becomes a pawn in an ugly game of corruption, money, and power being played by the Pacific resort city’s ambitious mayor and a police union strongman with questionable motives. Luxury hotel manager Kurt Rucker has some advice for Emilia but the heat between them quickly becomes a complicating factor.Under pressure from politicians, other cops, and the powerful union, Emilia feels like Acapulco’s famous cliff divers, plunging into suspense and praying not to crash on the rocks below. She’ll follow her instincts but will she survive if she uncovers the truth?A WOMAN WHO CAN TAKE THE HEATAcapulco police detective Emilia Cruz joins John Rebus, Harry Hole, Arkady Renko, and Guido Brunetti as international fiction’s most memorable crime fighters. Emilia Cruz is a good liar, a fast thinker, a determined investigator and a mean kickboxer. An Acapulco native forced to grow up too fast, she’s been a cop for nearly 12 years and a detective for two; a strong Latina woman in a squadroom that didn’t want her and is still trying to break her. But Emilia isn’t afraid to defend herself and get what she’s rightfully earned. She knows that many women in Mexico don’t get the chances she’s had and the proof is in a log she tracks of women who have gone missing.But the one thing she doesn’t know how to handle is gringo Kurt Rucker, the manager of a luxury hotel in Acapulco. A former US Marine, he has the confidence and leadership qualities she admires. A triathlete, he’s calm under pressure and knows what he wants. But does Emilia?THE TWO FACES OF ACAPULCOThere’s the Acapulco that tourists know; the sweep of the most beautiful bay in the world, the majesty of the clear blue Pacific, candlelit nights on the beach, and luxury hi-rises. There’s also the Acapulco that is a prize to be fought over by drug cartels--the city that is home to hookers and thieves, the streets where life is cheap and poverty is as pervasive as the wind off the ocean. Both of these versions of Acapulco claw at each other and force Emilia to survive between them. No investigation will be easy, no crime will be simple.",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Crime",
    "Suspense",
    "Mystery Thriller",
    "Audiobook"
  ],
  "author": "Carmen Amato",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/17344470-cliff-diver"
}