{
  "title": "Japan 1941: Countdown to Infamy",
  "description": "A groundbreaking history that considers the attack on Pearl Harbor from the Japanese perspective and is certain to revolutionize how we think of the war in the Pacific.When Japan launched hostilities against the United States in 1941, argues Eri Hotta, its leaders, in large part, understood they were entering a war they were almost certain to lose. Drawing on material little known to Western readers, and barely explored in depth in Japan itself, Hotta poses an essential question: Why did these men--military men, civilian politicians, diplomats, the emperor--put their country and its citizens so unnecessarily in harm's way? Introducing us to the doubters, schemers, and would-be patriots who led their nation into this conflagration, Hotta brilliantly shows us a Japan rarely glimpsed--eager to avoid war but fraught with tensions with the West, blinded by reckless militarism couched in traditional notions of pride and honor, tempted by the gambler's dream of scoring the biggest win against impossible odds and nearly escaping disaster before it finally proved inevitable. In an intimate account of the increasingly heated debates and doomed diplomatic overtures preceding Pearl Harbor, Hotta reveals just how divided Japan's leaders were, right up to (and, in fact, beyond) their eleventh-hour decision to attack. We see a ruling cadre rich in regional ambition and hubris: many of the same leaders seeking to avoid war with the United States continued to adamantly advocate Asian expansionism, hoping to advance, or at least maintain, the occupation of China that began in 1931, unable to end the second Sino-Japanese War and unwilling to acknowledge Washington's hardening disapproval of their continental incursions. Even as Japanese diplomats continued to negotiate with the Roosevelt administration, Matsuoka Yosuke, the egomaniacal foreign minister who relished paying court to both Stalin and Hitler, and his facile supporters cemented Japan's place in the fascist alliance with Germany and Italy--unaware (or unconcerned) that in so doing they destroyed the nation's bona fides with the West.We see a dysfunctional political system in which military leaders reported to both the civilian government and the emperor, creating a structure that facilitated intrigues and stoked a jingoistic rivalry between Japan's army and navy. Roles are recast and blame reexamined as Hotta analyzes the actions and motivations of the hawks and skeptics among Japan's elite. Emperor Hirohito and General Hideki Tojo are newly appraised as we discover how the two men fumbled for a way to avoid war before finally acceding to it. Hotta peels back seventy years of historical mythologizing--both Japanese and Western--to expose all-too-human Japanese leaders torn by doubt in the months preceding the attack, more concerned with saving face than saving lives, finally drawn into war as much by incompetence and lack of political will as by bellicosity. An essential book for any student of the Second World War, this compelling reassessment will forever change the way we remember those days of infamy.",
  "genres": [
    "History",
    "Nonfiction",
    "Japan",
    "World War II",
    "War",
    "Military History",
    "Asia"
  ],
  "author": "Eri Hotta",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/17345183-japan-1941"
}