{
  "title": "Things That Matter: Three Decades of Passions, Pastimes and Politics",
  "description": "From America’s preeminent columnist, named by the Financial Times the most influential commentator in the nation, the long-awaited collection of Charles Krauthammer’s essential, timeless writings.   A brilliant stylist known for an uncompromising honesty that challenges conventional wisdom at every turn, Krauthammer has for decades daz­zled readers with his keen insight into politics and government. His weekly column is a must-read in Washington and across the country. Now, finally, the best of Krauthammer’s intelligence, erudition and wit are collected in one volume.   Readers will find here not only the country’s leading conservative thinker offering a pas­sionate defense of limited government, but also a highly independent mind whose views—on feminism, evolution and the death penalty, for example—defy ideological convention. Things That Matter also features several of Krautham­mer’s major path-breaking essays—on bioeth­ics, on Jewish destiny and on America’s role as the world’s superpower—that have pro­foundly influenced the nation’s thoughts and policies. And finally, the collection presents a trove of always penetrating, often bemused re­flections on everything from border collies to Halley’s Comet, from Woody Allen to Win­ston Churchill, from the punishing pleasures of speed chess to the elegance of the perfectly thrown outfield assist.   With a special, highly autobiographical in­troduction in which Krauthammer reflects on the events that shaped his career and political philosophy, this indispensible chronicle takes the reader on a fascinating journey through the fashions and follies, the tragedies and triumphs, of the last three decades of American life.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Essays",
    "Biography",
    "Philosophy",
    "Audiobook"
  ],
  "author": "Charles Krauthammer",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/17345217-things-that-matter"
}