{
  "title": "The Last Coach: A Life of Paul \"Bear\" Bryant",
  "description": "The explosive biography of the greatest college football coach in history. When Paul William \"Bear\" Bryant died on January 26, 1983, it was the lead story on the all three networks' evening news. New York City newspapers reported his death on their front pages. (\"Crimson Tears,\" read the headline in the New York Post , \"Nation weeps over death of legendary Bear Bryant, 69.\") Three days later, America watched in awe as an estimated quarter of a million mourners lined the fifty-five mile stretch from Tuscaloosa to a Birmingham cemetery to pay their respects as his three-mile long funeral cortege drove by.President Reagan and the three former American presidents sent flowers, as did people as diverse as Bob Hope, ABC's Roone Arledge, advice columnist Ann Landers and the Reverend Billy Graham. Scores of Bryant's former players, including Joe Namath, Lee Roy Jordan, Ken Stabler and Ozzie Newsome, were in attendance. So were Bryant's most distinguished colleagues, the greatest living football coaches, including Southern Cal's John McKay, who said, \"It was like a presidential funeral procession. No coach in America could have gotten that. No coach but him. But then, he wasn't just a coach. He was the coach.\"Bryant's passing was noted with the kind of reverence our country reserved for statesmen or military leaders, though Paul \"Bear\" Bryant had insisted for much of his life that he was \"just a football coach.\" For millions he was much more, he was the greatest coach the game ever saw, the heir to the tradition established by Knute Rockne. He took his Alabama Crimson Tide teams to an unmatched six national championships. But to the players, journalists and fans whose lives he touched in his more than half a century as a player and coach, he was the last symbol of values that transcended football―courage, discipline, loyalty, and hard work.To his critics, Bryant represented the dark side of big-time college football―brutality, fanaticism and blind adherence to authority. The real Bear Bryant was far more complex than either his admirers or detractors knew. While maintaining a public friendship with Alabama governor George Wallace, he continually sought ways to undermine the governor's segregationist policies, finally forcing a legendary football game in Birmingham with the University of Southern California that opened the floodgates to the integration of football at the University of Alabama, including its coaching staff. Old fashioned in his politics, he was nonetheless an admirer of Robert Kennedy, whom he planning to vote for in 1968.Allen Barra's The Last Coach traces Paul Bryant's rise from a family of truck farmers to recognition as the most successful and influential coach in the game's history. The eleventh of thirteen children, Bryant was born in tiny Moro Bottom, Arkansas in 1913 and grew up in nearby Fordyce―where his legend was born when he wrestled a live bear on the stage of a local theater. Paul was raised by his mother, who barely managed to keep him out of trouble and on the Fordyce High School Redbugs long enough to get a football scholarship at Alabama, where he would meet and marry the love of his life, campus beauty queen Mary Harmon Black.At the height of the Depression, football took Bryant to the Rose Bowl with Alabama's 1934 national champions and on to a career as an assistant and, finally, a head football coach, where he matched wit and grit with the greatest coaches of two generations, men like Tennessee's General Robert Neyland, Oklahoma's Bud Wilkinson, Notre Dame's Ara Parseghian, Ohio State's Woody Hayes, and Penn State's Joe Paterno. Along the way, he stirred controversy with his infamous \"Junction Boys\" training camp in 1954, during which almost two-thirds of the Texas A&M football team quit; his legal battle with The Saturday Evening Post over the accusation that he had conspired to fix a college football game, a trial which rocked the sports world; and his pursuit of Amos Alonzo Stagg's all-time record for college coaching victories.Through it all, Bryant's influence has not only endured but prevailed as his former players and assistants continue to define the best in not only college but professional football. A USA Today and Washington Post Best Sports Book.",
  "genres": [
    "Sports",
    "Biography",
    "Football",
    "Nonfiction",
    "United States",
    "History"
  ],
  "author": "Allen Barra",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/107834.The_Last_Coach"
}