{
  "title": "The All-Girl Filling Station's Last Reunion",
  "description": "The one and only Fannie Flagg, beloved author of \"Fried Green Tomatoes at the Whistle Stop Cafe, Can't Wait to Get to Heaven, \"and\" I Still Dream About You, \" is at her hilarious and superb best in this new comic mystery novel about two women who are forced to reimagine who they are. Mrs. Sookie Poole of Point Clear, Alabama, has just married off the last of her daughters and is looking forward to relaxing and perhaps traveling with her husband, Earle. The only thing left to contend with is her mother, the formidable Lenore Simmons Krackenberry. Lenore may be a lot of fun for other people, but is, for the most part, an overbearing presence for her daughter. Then one day, quite by accident, Sookie discovers a secret about her mother's past that knocks her for a loop and suddenly calls into question everything she ever thought she knew about herself, her family, and her future. Sookie begins a search for answers that takes her to California, the Midwest, and back in time, to the 1940s, when an irrepressible woman named Fritzi takes on the job of running her family's filling station. Soon truck drivers are changing their routes to fill up at the All-Girl Filling Station. Then, Fritzi sees an opportunity for an even more groundbreaking adventure. As Sookie learns about the adventures of the girls at the All-Girl Filling Station, she finds herself with new inspiration for her own life. Fabulous, fun-filled, spanning decades and generations, and centered on a little-known aspect of America's twentieth-century story, \"The All-Girl Filling Station's Last Reunion\" is another irresistible novel by the remarkable Fannie Flagg.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Book Club",
    "Humor",
    "Audiobook",
    "Chick Lit",
    "Southern"
  ],
  "author": "Fannie Flagg",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/17345228-the-all-girl-filling-station-s-last-reunion"
}