{
  "title": "The Oblivion Room: Stories of Violation",
  "description": "A woman finds herself alone in a pitch-black room without doors or windows, completely cut off from human contact...A man wakes one morning certain that today is the day he must commit an unspeakable atrocity...A gifted jazz musician runs from her past--but even she has no idea how lethal that past truly is. THE OBLIVION ROOM: STORIES OF VIOLATION collects six of Christopher Conlon's most nightmarish works, tales in which the horrific can come from anywhere--or from everywhere at once.“Since the publication of his first novel, MIDNIGHT ON MOURN STREET (2008), Conlon has quickly established himself as one of the preeminent names in contemporary literary horror. His newest collection of short fiction showcases his penchant for bending genre conventions in imaginative and provocative new ways…Every piece in the volume bears the stamp of Conlon’s gift for combining subtle terror with unforeseeable plot twists. Connoisseurs of cutting-edge horror will not want to miss it.\" —Carl Hays, BOOKLIST“THE OBLIVION ROOM: STORIES OF VIOLATION is a perfect title for the collection. Throughout there is violation: physical, mental, emotional, spiritual…[for] those seeking the deeper realms of fear and terror, terror found primarily in suggestion and indirection and obliqueness, THE OBLIVION ROOM is a must.”—Michael R. Collings, HELLNOTES“I can’t remember when I have read a collection of stories that had me as spellbound as THE OBLIVION ROOM. Collectively, these tales are tours de force of intellectual dark fiction. Individually, these stories are some of the most enthralling and emotional I’ve ever come across, each one of them a mini-masterpiece of heart-wrenching fiction.”—TT Zuma, HORROR WORLD“THE OBLIVION ROOM is a real treat. Conlon’s tales go from flat-out terrifying to subtle, quiet horrors…The writing is razor sharp and a real pleasure to read. Highly recommended and easily one of the best releases of 2013.”—Nick Cato, HORROR FICTION REVIEW(June 2013 Book of the Month)“THE OBLIVION ROOM is, simply put, one of the best collections of short stories I've ever read. Remember that feeling you got the first time you read Ray Bradbury, or Stephen King, or Shirley Jackson, how magical the prose felt? Well, get ready to experience that magic again, because Christopher Conlon has it in spades. The stories presented here are absolutely fantastic. I devoured them all, and I’m willing to bet you will too. Along with Laird Barron and John Langan, Christopher Conlon is carrying the torch for literary horror in the 21st century. Pay attention, because Conlon is one of our best, hands down.”—Bram Stoker Award Winner Joe McKinney, author of MUTATED and INHERITANCE",
  "genres": [
    "Horror",
    "Short Stories",
    "Thriller"
  ],
  "author": "Christopher Conlon",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/17346258-the-oblivion-room"
}