{
  "title": "The Martha Stewart Living Cookbook: The Original Classics",
  "description": "There are certain tools no home cook should be without: a well-sharpened chef’s knife, sturdy mixing bowls, and The Martha Stewart Living Cookbook–The Original Classics. This indispensable reference book gathers more than 1,100 recipes published in Martha Stewart Living from its inception in 1990 to 2000–a decade’s worth of the best of the best from every issue. Now, well into the magazine’s second decade, the editors of Martha’s flagship magazine have revisited this landmark cookbook, adding new content such as suggested menus, an updated pantry and equipment section, a revised source list, how-to photos, and nutritional information to reflect the way we cook today.From basics to breakfast, from poultry to pastry, The Martha Stewart Living Cookbook–The Original Classics is filled with recipes for every cook and every occasion. Whether it’s a special dinner party, a sit-down luncheon for a bride-to-be, or a casual weeknight supper, this updated collection offers wonderful options across 22 categories, including Starters, Meat, Poultry, Fish and Shellfish, Salads, Soups, Meatless Main Dishes, and Desserts. Throughout, there are essential classes (cooking 101s) for dishes that should be in every cook’s repertoire: roast turkey, whole poached salmon, glazed ham, prime rib roast, macaroni and cheese, fried chicken, and mashed potatoes, as well as recipes that invite you to stretch your cooking knowledge and expertise.Helpful tips and techniques, comprehensive equipment glossaries, plus a guide to finding unusual ingredients make the kitchen-tested recipes accessible to home cooks everywhere. The Martha Stewart Living Cookbook–The Original Classics belongs on every kitchen counter in America.",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction",
    "Reference"
  ],
  "author": "Martha Stewart",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/1734640.The_Martha_Stewart_Living_Cookbook"
}