{
  "title": "The Mad Sculptor: The Maniac, the Model, and the Murder That Shook the Nation",
  "description": "2015 Edgar Award NomineeBeekman Place, once one of the most exclusive addresses in Manhattan, had a curious way of making it into the tabloids in the 1930 “SKYSCRAPER SLAYER,” “BEAUTY SLAIN IN BATHTUB” read the headlines. On Easter Sunday in 1937, the discovery of a grisly triple homicide at Beekman Place would rock the neighborhood yet again—and enthrall the nation. The young man who committed the murders would come to be known in the annals of American crime as the Mad Sculptor.Caught up in the Easter Sunday slayings was a bizarre and sensationalistic cast of characters, seemingly cooked up in a tabloid editor’s overheated imagination. The charismatic perpetrator, Robert Irwin, was a brilliant young sculptor who had studied with some of the masters of the era. But with his genius also came a deeply disturbed psyche; Irwin was obsessed with sexual self-mutilation and was frequently overcome by outbursts of violent rage.Irwin’s primary victim, Veronica Gedeon, was a figure from the world of pulp fantasy—a stunning photographer's model whose scandalous seminude pinups would titillate the public for weeks after her death. Irwin’s defense attorney, Samuel Leibowitz, was a courtroom celebrity with an unmatched record of acquittals and clients ranging from Al Capone to the Scottsboro Boys. And Dr. Fredric Wertham, psychiatrist and forensic scientist, befriended Irwin years before the murders and had predicted them in a public lecture months before the crime.Based on extensive research and archival records, The Mad Sculptor recounts the chilling story of the Easter Sunday murders—a case that sparked a nationwide manhunt and endures as one of the most engrossing American crime dramas of the twentieth century. Harold Schechter’s masterful prose evokes the faded glory of post-depression New York and the singular madness of a brilliant mind turned against itself. It will keep you riveted until the very last page.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "History",
    "Crime",
    "Biography",
    "American History",
    "Historical"
  ],
  "author": "Harold Schechter",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/17346823-the-mad-sculptor"
}