{
  "title": "The Luminous Life of Lucy Landry",
  "description": "Lucy, a spirited French-Ojibwe orphan, is sent to the stormy waters of Lake Superior to live with a mysterious family of lighthouse-keepers—and, she hopes, to find the legendary necklace her father spent his life seeking…Selena Lucy Landry (named for a ship, as every sailor’s child should be) has been frightened of the water ever since she lost her father at sea. But with no one else to care for her, she’s sent to foster with the Martins—a large Anishinaabe family living on a lighthouse in the middle of stormy Lake Superior.The Martin family is big, hard-working, and close, and Lucy—who has always been a dreamer—struggles to fit in. Can she go one day without ruining the laundry or forgetting the sweeping? Will she ever be less afraid of the lake?Although life at the lighthouse isn’t what Lucy hoped for, it is beautiful—ships come and go, waves pound the rocks—and it has one major It’s near the site of a famous shipwreck, a shipwreck that went down with a treasure her father wanted more than anything . If Lucy can find that treasure—a priceless ruby necklace—won’t it be like having Papa back again, just a little bit?But someone else is hunting for the treasure, too. And as the lighthouse company becomes increasingly skeptical that the Martins can juggle Lucy and their duties, Lucy and the Martin children will need to find the necklace quickly—or they may not have a home at all.The Luminous Life of Lucy Landry is a timelessly sweet tale of found family from rising Ojibwe voice Anna Rose Johnson, author of NPR Best Book of the Year The Star That Always Stays . Perfect for fans of L.M. Montgomery and Karina Yan Glaser!",
  "genres": [
    "Middle Grade",
    "Historical Fiction",
    "Historical",
    "Fiction",
    "Family",
    "Adventure",
    "Audiobook"
  ],
  "author": "Anna Rose  Johnson",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/173476119-the-luminous-life-of-lucy-landry"
}