{
  "title": "Forest of a Thousand Daemons: A Hunter's Saga",
  "description": "\"His total conviction in multiple existences within our physical world is as much an inspiration to some of the most brilliant fiction in Yoruba writing as it is a deeply felt urge to 'justify the ways of God to man.'\"— Wole Soyinka , translator and Nobel Laureate A classic work of African literature, Forest of a Thousand Daemons is the first novel to be written in the Yoruba language. First published in Nigeria in 1939, it is one of that country's most revered and widely read works, and its influence on Nigerian literature is profound, most notably in the works of Amos Tutuola. A triumph of the mythic imagination, the narrative unfolds in a landscape where, true to Yoruba cosmology, human, natural and supernatural beings are compellingly and wonderfully alive at a world of warriors, sages and kings; magical trees and snake people; spirits, Ghommids and bog-trolls. Here are the adventures of Akara-ogun—son of a brave warrior and wicked witch—as he journeys into the forest, encountering and dealing with all-too-real unforeseen forces, engaging in dynamic spiritual and moral relationships with personifications of his fate, projections of the terrors that haunt man. Distinguished Nobel Prize-winning author Wole Soyinka offers a supple and elegant translation and provides an essay on the special challenges of translating Fagunwa from the Yoruba into English, along with a glossary of Yoruba and unfamiliar words. With illustrations by acclaimed Nigerian printmaker Bruce Onobrakpeya. Daniel Orowole Fagunwa was born in western Nigeria in 1903. He died in a motorcycle accident in 1963. Praise for Forest of a Thousand Daemons : “A deep tale of the spirit; a classic of the African imagination.”—Ben Okri \"Fagunwa is as important to the Nigerian imagination as Grimm’s tales to the Western imagination. Except that Fagunwa’s book is not a collection of oral tales, but an original modern novel, one that sets out to test the limits of the form of the novel, the range of myth and its overlap into daily life. Soyinka offers us not a simple translation but a complex and truly respectful re-rendering. With this tender touch by Soyinka, Fagunwa’s book comes alive—reanimated in this new language. Beautiful, important and endlessly fascinating. A must read.\"—Chris Abani, author of The Virgin of Flames and The Secret History of Las Vegas Praise for the \"The work of Fagunwa stands at the head of creative writing in the Yorùbá language and exerts the most pervasive influence on every category of Yorùbá literary expression . . . He responded early to the need for a literature in the vernacular, at a moment when a new cultural consciousness began to emerge out of changing social conditions.”—Abiola Irele, scholar of African literature “Among the Africans who deserve some kind of secular sainthood is Wole Soyinka.”— The New York Times “Mr. Onobrakpeya . . . is one of the best known and most prolific African printmakers.”— The New York Times",
  "genres": [
    "Fantasy",
    "Fiction",
    "Africa",
    "Classics",
    "African Literature",
    "Nigeria",
    "Literature"
  ],
  "author": "D.O. Fagunwa",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/17347680-forest-of-a-thousand-daemons"
}