{
  "title": "Shores Beyond the World",
  "description": "They did a terrible thing. They’ve returned to make it right. The price will be high.**ILLUSTRATED VERSION**Chaos is sweeping the islands of Wefrivain—slave revolts, attacks on temples, and questions about the true nature of the wyvern gods. The catalyst is a single book called The Guild of the Cowry Catchers. The authors are a band of pirates.Gerard and his friends are not content to merely spread unrest. They’re determined to free the fauns of Maijha Minor, who are scheduled to be sold or slaughtered. This is a situation that Gerard, Silveo, and Gwain created, and they want to make it right.However, things are not as they seem on the deadly island game park. Priestess Morchella is pulling strings, and the fauns may want their own brand of revenge. Gerard lost everything last time he stepped onto Maijha Minor. If he’s not careful, the same could happen again.Shores Beyond the World is the fifth and final book in the Guild of the Cowry Catchers series. The books are:EmbersFlamesAshesOut of the AshesShores Beyond the WorldWarning: This is an illustrated series for grown-ups. It includes beautiful, whimsical artwork, because adults deserve pretty pictures, too. However, the explicit elements of the story escalate as the series progresses. There are sexual scenes and situations in these books, as well as types of violence not usually found in children's books. These books are not intended for children or young teens.This 70,000-word novel is DRM-free and carefully formatted. It includes 13 character portraits, 16 full-page illustrations, and 2 versions of the map. Cowry Catchers looks beautiful on a black-and-white viewer, but you can also open this eBook on a color screen to view the illustrations at their best.",
  "genres": [
    "Fantasy",
    "Romance",
    "M M Romance",
    "LGBT",
    "Queer",
    "Audiobook",
    "Sexuality"
  ],
  "author": "Abigail Hilton",
  "average_rating": "4.53",
  "url": "https://www.goodreads.com/book/show/17347884-shores-beyond-the-world"
}