{
  "title": "Sleigh Rides, Jingle Bells, and Silent Nights: A Cultural History of American Christmas Songs",
  "description": "“Santa Claus, singing cowboys, love, hymns, satire, snow, Bing and Dean and Frank, fictional reindeer and warbling American Christmas music! Ronald Lankford has the rare ability to reconcile the sacred and the profane in an easy narrative that manages both to cherish and illuminate the vast contradictions that adhere to December 25th in the U.S.A.!”—Karal Ann Marling, author of Merry Christmas! Celebrating America’s Greatest Holiday   “Thorough and well documented. Spins interesting and novel insights into songs with which we are already familiar.”—Paul Mullins, author of The Archaeology of Consumer CultureWhen Bing Crosby’s “White Christmas” debuted in 1942, no one imagined that a holiday song would top the charts year after year. One of the best-selling singles ever released, it remains on rotation at tree lighting ceremonies across the country, in crowded shopping malls on Black Friday, and at warm diners on lonely Christmas Eve nights. Over the years, other favorites have been added to America’s annual playlist, including Elvis Presley’s “Blue Christmas,” the King Cole Trio’s “The Christmas Song,”  Gene Autry’s “Rudolph the Red-Nosed Reindeer,” Willie Nelson’s “Pretty Paper,” and, of course, Elmo & Patsy’s “Grandma Got Run Over by a Reindeer.”Resting just beneath the surface of familiar melodies and words, jolly Santas, winter wonderlands, and roasting chestnuts both mask and represent an intricate cultural landscape crowded with the meanings of a modern American Christmas. Songs that most readily evoke those meanings, desires, and anxieties have become classics, painting a portrait of the American psyche past and present.Viewing American holiday values through the filter of familiar Christmas songs, Ronald Lankford examines popular culture, consumerism, and the dynamics of the traditional American family. He surveys more than seventy-five years of songs and reveals that the “modern American Christmas” has carried a complex and sometimes contradictory set of meanings. Interpreting tunes against the backdrop of the eras in which they were first released, he identifies the repeated themes of nostalgia, commerce, holiday blues, carnival, and travesty that underscore so much beloved music. This first full-length analysis of the lyrics, images, and commercial forces inextricably linked to Yuletide music hits the heart of what many Americans think Christmas is?or should be.",
  "genres": [
    "Nonfiction",
    "Christmas",
    "Music",
    "History",
    "Holiday",
    "American History"
  ],
  "author": "Ronald D. Lankford Jr.",
  "average_rating": "2.86",
  "url": "https://www.goodreads.com/book/show/17347814-sleigh-rides-jingle-bells-and-silent-nights"
}