{
  "title": "Her Master's Kiss 4",
  "description": "\"In ‘Her Master’s Kiss 4’ Vivien Sparx manages to take her reader on a living breathing journey while riding a plethora of emotions. I am completely in awe of the magnificent way in which she depicts this steamy, tumultuous and downright heartbreaking story to perfection.\"-Nevena ReadTHE GRIPPING NEW CHAPTER IN THE LIVES OF RENEE AND STEFANJust when they had the promise of a 'happily ever after' life together, Renee and Stefan's love for each other faces the ultimate challenge when a cruel twist of fate tears their lives apart. Faced with uncertainty, tragedy and emotions they struggle to control, the couple are forced to confront questions they never thought they would be asked. Is their love strong to overcome even the greatest of challenges?A story of approximately 26,000 words.JUST A TASTE OF HER MASTER'S KISS 4:He broke the kiss suddenly and bowed his head to the silky sheen of her breasts. She arched her back in a slow voluptuous movement, and with one hand guided him to her nipple. When she felt his lips, gentle and tugging, she gasped aloud and clawed the fingernails of her other hand into his shoulder, like a cat reacting to a caress. She began to shake, the tremors starting in her legs and shuddering up to the heat between her thighs. Renee felt her hips begin to undulate, responding with an instinctive, primitive need for her man’s attention.When she could take no more, Renee pulled his mouth away. Then she moved his head to her other breast and guided the hardened nipple between his lips. Again, she gasped as Stefan sucked.She groped for one of his hands and pressed it against the heat of her body. Warm wetness coated Stefan’s fingers as they began to explore and feel within the folds of her. His mouth came away from her breast and he murmured, “When did you take off your panties?” Renee wrapped her fingers into his hair and guided him back to her stiffened nipple.“When you were shaving,” she panted softly. “When I decided I was going to seduce you.”",
  "genres": [
    "BDSM",
    "Erotica",
    "Romance",
    "Drama",
    "Adult"
  ],
  "author": "Vivien Sparx",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/17347916-her-master-s-kiss-4"
}