{
  "title": "A Feast of Dragons",
  "description": "A FATE OF DRAGONS is book #3 in the Bestselling series THE SORCERER'S RING, which begins with Book #1, A QUEST OF HEROES.A FATE OF DRAGONS (Book #3 in the Sorcerer's Ring) takes us deeper into Thor’s epic journey to becoming a warrior, as he journeys across the Sea of Fire to the dragon’s Isle of Mist. An unforgiving place, home to the most elite warriors of the world, Thor’s powers and abilities deepen as he trains. His friendships deepen, too, as they face adversities together, beyond what they could imagine. But as they find themselves up against unimaginable monsters , The Hundred quickly goes from training session to a matter of life or death. Not all will survive. Along the way, Thor’s dreams, along with his mysterious encounters with Argon, will continue to plague him, to press him to try to learn more about who he is, who his mother is, and what the source of his powers are. What is his destiny?Back in the Ring, matters are getting much worse. As Kendrick is imprisoned, Gwendolyn finds it landing on her to try to save him, to save the Ring by bringing down her brother Gareth. She hunts for clues for her father’s murderer along with her brother Godfrey, and along the way, the two of them will become much closer, united in their cause. But Gwendolyn finds herself in mortal danger as she presses too deep, and she may be in over her head. Gareth attempts to wield the Dynasty Sword and learns what it means to be King, becoming drunk with the abuse of power. He rules ruthlessly, becoming paranoid. As the noose tightens on the king’s assassin, the McClouds attack deeper into the Ring, and King’s Court finds itself in an increasingly precarious position. Gwendolyn pines for Thor’s return, for them to be together, for their love to blossom. But with powerful forces in their way, it is questionable if that chance will ever come. Will Thor survive The Hundred? Will King’s Court collapse? Will MacGil’s murderer be found? Will Gwendolyn end up with Thor? And will Thor finally learn the secret of his destiny? With its sophisticated world-building and characterization, A FATE OF DRAGONS is an epic tale of friends and lovers, of rivals and suitors, of knights and dragons, of intrigues and political machinations, of coming of age, of broken hearts, of deception, ambition and betrayal. It is a tale of honor and courage, of fate and destiny, of sorcery. It is a fantasy that brings us into a world we will never forget, and which will appeal to all ages and genders. Books #3--#13 in the series are also available!",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Fiction",
    "Magic",
    "Dragons",
    "Amazon",
    "Adventure"
  ],
  "author": "Morgan Rice",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/17348771-a-feast-of-dragons"
}