{
  "title": "Miss Anne in Harlem: The White Women of the Black Renaissance",
  "description": "One of the nation's foremost scholars of ethnic and gender studies offers a new perspective of the 1920s in this lively, groundbreaking group biography of the white women of the Harlem RenaissanceThe 1920s in New York was a time of passion and freedom, in which new forms of art, including jazz and modern dance, flourished. At the heart of this cultural explosion was Harlem, where everything was changing, including the influential denizens who helped define it. Among these were a little-known group of white women who for decades have been relegated to the shadows of history. In this groundbreaking cultural biography, esteemed scholar Carla Kaplan offers a captivating and full-blooded portrait of this band of independent-minded and spirited white women collectively referred to as \"Miss Anne.\"Sexualized and sensationalized in the white press--often portrayed as monstrous or insane--Miss Anne was sometimes derided in black literature and among the Harlem community as well. While it was socially acceptable for white men to head uptown for \"exotic\" dancers and \"hot\" jazz, a white woman who embraced life on West 125th Street found herself ostracized. Miss Anne in Harlem introduces these women--many from New York's highest social echelons, many of them Jewish--who became patrons of, and romantic participants in, the Harlem Renaissance. In this superb blend of social history and biography, illustrated with black-and-white photos and two eight-page color inserts, Kaplan illuminates the myriad faces of Miss Anne, explores her motivations, and makes clear her often misunderstood choices. Returning Miss Anne to her rightful place in the interracial history of the Harlem Renaissance, Kaplan's formidable history remaps the landscape of the 1920s and alters our perception of this historical moment.",
  "genres": [
    "History",
    "Nonfiction",
    "Race",
    "American History",
    "Biography",
    "New York",
    "African American"
  ],
  "author": "Carla Kaplan",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/17348988-miss-anne-in-harlem"
}