{
  "title": "The Tilted World",
  "description": "Set against the backdrop of the historic flooding of the Mississippi River, The Tilted World is an extraordinary tale of murder and moonshine, sandbagging and saboteurs, and a man and a woman who find unexpected love, from Tom Franklin, the acclaimed author of the New York Times bestseller Crooked Letter, Crooked Letter, and award-winning poet Beth Ann FennellyThe year is 1927. As rains swell the Mississippi, the mighty river threatens to burst its banks and engulf everything in its path, including federal revenue agent Ted Ingersoll and his partner, Ham Johnson. Arriving in the tiny hamlet of Hobnob, Mississippi, to investigate the disappearance of two fellow agents who’d been on the trail of a local bootlegger, they are astonished to find a baby boy abandoned in the middle of a crime scene.Ingersoll, an orphan raised by nuns, is determined to find the infant a home, and his search leads him to Dixie Clay Holliver. A strong woman married too young to a philandering charmer, Dixie Clay has lost a child to illness and is powerless to resist this second chance at motherhood. From the moment they meet, Ingersoll and Dixie Clay are drawn to each other. He has no idea that she's the best bootlegger in the county and may be connected to the agents’ disappearance. And while he seems kind and gentle, Dixie Clay knows full well that he is an enemy who can never be trusted.When Ingersoll learns that a saboteur might be among them, planning a catastrophe along the river that would wreak havoc in Hobnob, he knows that he and Dixie Clay will face challenges and choices that they will be fortunate to survive. Written with extraordinary insight and tenderness, The Tilted World is that rarest of creations, a story of seemingly ordinary people who find hope and deliverance where they least expect it—in each other.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Book Club",
    "Historical",
    "Mystery",
    "Southern",
    "Romance"
  ],
  "author": "Tom Franklin",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/17349083-the-tilted-world"
}