{
  "title": "Focus: The Hidden Driver of Excellence",
  "description": "Bestselling author Daniel Goleman returns with a groundbreaking look at today's scarcest resource and the secret to high performance and fulfillment: attentionFor more than two decades, psychologist and journalist Daniel Goleman has been scouting the leading edge of the human sciences for what's new, surprising, and important. In Focus, he delves into the science of attention in all its varieties, presenting a long overdue discussion of this little-noticed and under-rated mental asset that matters enormously for how we navigate life. Attention works much like a muscle: use it poorly and it can wither; work it well and it grows. In an era of unstoppable distractions, Goleman persuasively argues that now more than ever we must learn to sharpen focus if we are to contend with, let alone thrive, in a complex world.Goleman boils down attention research into a threesome: inner, other, and outer focus. A well-lived life demands we be nimble at each. Goleman shows why high-achievers need all three kinds of focus, as demonstrated by rich case studies from fields as diverse as competitive sports, education, the arts, and business. Those who excel rely on what he calls Smart Practices such as mindfulness meditation, focused preparation and recovery, positive emotions and connections, and mental \"prosthetics\" that help them improve habits, add new skills, and sustain excellence. Combining cutting-edge research with practical findings, Focus reveals what distinguishes experts from amateurs and stars from average performers. Ultimately, Focus calls upon readers not only to pay attention to what matters most to them personally, but also to turn their attention to the pressing problems of the wider world, to the powerless and the poor, and to the future, not just to the seductively simple demands of here-and-now.",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Self Help",
    "Business",
    "Personal Development",
    "Productivity",
    "Leadership"
  ],
  "author": "Daniel Goleman",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/17349126-focus"
}