{
  "title": "Lighthouse Island",
  "description": "The bestselling author of the highly praised novels The Color of Lightning, Stormy Weather, and Enemy Women pushes into new territory with this captivating and atmospheric story set in the far future-a literary dystopian tale resonant with love and hopeIn the coming centuries the world's population has exploded and covered the earth with cities, animals are nearly all gone and drought has taken over so that cloudy water is issued by the quart. There are no maps, no borders, no numbered years. On this urban planet the only relief from overcrowding and the harsh rule of the big Agencies is the television in every living space, with its dreams of vanished waterfalls and the promise of virtual vacations in green spaces, won by the lucky few.It is an unwelcoming world for an orphan like Nadia Stepan. Abandoned by her parents on a crowded street when she was four, the little girl is shuttled from orphanage to orphanage, foster-family to foster-family. Nadia grows up dreaming of the vacation spot called Lighthouse Island, in a place called the Pacific Northwest. She becomes obsessed with it and is determined to somehow find her way there. In the meantime this bright and witty orphan falls into the refuge of old and neglected books; the lost world of the imagination. And beyond the confusion and overcrowding and the relentless television noise, comes a radio voice from an abandoned satellite that patiently reads, over and over, the great classical books of the world-Big Radio, a voice in the night that lifts Nadia out of the dull and perpetual Present.An opportunity for escape appears and Nadia takes it, abandoning everything to strike out for Lighthouse Island in a dangerous and sometimes comic adventure. She meets every contingency with bottomless inventiveness meets the man who changes the course of her life: James Orotov, mapmaker and demolition expert. Together they evade arrest and head north toward a place of wild beauty that lies beyond the megapolis-Lighthouse Island and its all-seeing eye.",
  "genres": [
    "Fiction",
    "Dystopia",
    "Science Fiction",
    "Audiobook",
    "Fantasy",
    "Post Apocalyptic",
    "Science Fiction Fantasy"
  ],
  "author": "Paulette Jiles",
  "average_rating": "3.28",
  "url": "https://www.goodreads.com/book/show/17349213-lighthouse-island"
}