{
  "title": "Drinking with Strangers: Music Lessons from a Teenage Bullet Belt",
  "description": "From his days with his band the Marvelous 3 to his current work producing some of today's hottest talent - from Weezer and Katy Perry to Pink and The Donnas - Butch Walker has been a major influence in contemporary pop music. But the road to success wasn't easy. \"Drinking with Strangers\" takes readers beyond the studio for a rare glimpse into a life that has been defined by raw talent, adversity and a drive for perfection. As a teenager, Walker and his band left Cartersville, Georgia for the mean streets of Los Angeles to try to make it in the rock world. When the fairy tale label dream never quite materialized after many false starts - including a really bad video from the guy who did all the Aerosmith videos - Walker and his band quickly converted to the DIY (do it yourself) approach, touring the country and doing over 250 gigs a year, selling his merch, records, and even tapes out of any van that he happened to be driving that day. There are a lot of life lessons to be learned while out on the road trying to make it as a musician, and Walker is no exception - and here he shares his anecdotes and tales with insight and candor and what it's really like to spend a life of drinking with strangers. Almost a primer for anyone who wants to make it in the music business, \"Drinking with Strangers\" will be interspersed with lots of Butchisms, including \"the world's most depressing pie chart about music publishing\"; how in 1984 his production \"studio\" consisted of a boom box, while today it's a Studer and Pro Tools; how to make a really bad music video and spend 3x what the album cost to make; and of course what all musicians need to know - how and why their A&R guy (or gal) could get fired and leave you and your band in the dust.",
  "genres": [
    "Music",
    "Biography",
    "Nonfiction",
    "Memoir"
  ],
  "author": "Butch Walker",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/10784962-drinking-with-strangers"
}