{
  "title": "Judgement at Tokyo: World War II on Trial and the Making of Modern Asia",
  "description": "'Every so often, a new work emerges of such immense scholarship and weight that it really does add a significant difference to our understanding of the Second World War and its consequences. Judgement in Tokyo is one such, a monumental work in both scale and detail, beautifully constructed and written, leaving the reader not only moved but disturbed as well.' – James Holland, The Sunday Telegraph'A work of singular importance . . . balanced, original, human, accessible, and riveting' – Philippe Sands, author of East-West Street'Always engrossing . . . a breathtakingly ambitious and well-executed piece of history, unlikely to be bettered as a portrait of the trials and their place in postwar global history' – History TodayA landmark, magisterial history of the postwar trial of Japan’s leaders as war criminals, and their impact on the modern history of Asia and the world.In the weeks after Japan finally surrendered to the Allies to end World War II, the victorious powers turned to the question of how to move on from years of carnage and destruction. For the Allied powers, the trials were an opportunity both to render judgment on their vanquished foes and to create a legal framework to prosecute war crimes and prohibit the use of aggressive war. For the Japanese leaders on trial, it was their chance to argue that their war had been waged to liberate Asia from Western imperialism and that the court was no more than victors’ justice.Gary J. Bass' Judgement at Tokyo is a magnificent, riveting story of wartime action, dramatic courtroom battles, and the epic formative years that set the stage for the postwar era in the Asia–Pacific.'A comprehensive, landmark and riveting book' – The Washington Post, 'The 10 Best Books of 2023'",
  "genres": [
    "History",
    "Nonfiction",
    "Japan",
    "Politics",
    "World War II",
    "Asia",
    "War"
  ],
  "author": "Gary J. Bass",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/173509030-judgement-at-tokyo"
}