{
  "title": "The Brothers' Keepers",
  "description": "The Brothers' Keepers is a collaborative work written by John H. Paddison and Charles D. Orvik. Based on the book's tone, theme, and literary intention, this work will prove to be a significant contribution to contemporary literature. As a novel dealing with the saga of one family, the work closely analyzes an ongoing cultural myth of small Midwest American towns and families-that is, the idea and ideal of family values that have come to symbolize that geographic region. The story takes place in the Northeastern part of North Dakota, in the fictional town of Farmington, during and after the Great Depression. The storyline develops around the neglect and then abandonment of five young boys-the Lambson brothers-by their alcoholic mother and their drifter father, and indeed by society in general. Having been exhaustively researched, the novel details in a sensitive yet realistic way the brothers' development under very adverse physical and social conditions and the five boys' eventual outcome. The brothers' hardships form a strong, familial bond between them-the only definition of family that they can construct from their aberrant circumstances. Events of the story are structured so as to extract meaning from the youngsters' trials. The broader narrative, though, becomes an attempt to understand how a society that traditionally has always placed so much emphasis on family and family values, at least seemingly so, can condone such treatment of the five youngsters. The narrative voice is sensitive yet forceful in adding understanding of their tribulations, thus bringing light to two social ills that plague America today-child neglect and child abuse. In a larger sense, this probing of social responsibility is relevant to today's society, where children increasingly becoming the victims of abuse and neglect.",
  "genres": [
    "Book Club"
  ],
  "author": "John H. Paddison",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/10785902-the-brothers-keepers"
}