{
  "title": "Finding Verity",
  "description": "Finding Verity is a moving story about a young man's survival and search for truth.After being abandoned by his mother, thirteen-year-old Puck Scarsi follows Fin, a homeless man, into the underground bowels of New York City.\"I had speculated about the tunnels before I'd gone under, and I'd cheerfully imagined dragons, wizards and monsters. But once I set foot under the city, my childlike fantasies were replaced with something else, a kind of fearful exhilaration, addictive in a way, but frightful, too. A warning.\"I had no idea what lurked in the shadows. Even though my eyes had adjusted to the dark, it was difficult to differentiate between shadows, some being pitch black, others dark gray. I tried to convince myself that the tunnel was no worse than the city at night, but I knew that was not true.\"Fin knows the tunnels are no place for teens, so he escorts Puck to Child Services. An escape from an abusive foster family, leads Puck to an unlikely adoption and early success as a novelist.Ten years later, on a visit to Central Park, Puck rescues an elderly woman from a brutal attack. A friendship develops, and Puck reveals his troubled past and his longing to reconnect with Fin. One day, Puck returns to the tunnels in search of his friend.\"I lowered myself into the underground's netherworld. I was back! I had returned to the underbelly of the biggest city in the world, submerging myself into a world of darkness where evil flourished, where most people would never go. A place where staying too long could prove detrimental.\"As I walked deeper into the tunnel, I realized my life had always been about survival. I laughed at my epiphany. Life was survival! Such a simple concept.\"At thirteen, I had been forced to became an adult. Too soon. I'd been forced to survive by myself. Alone.\"Verity means truth. Follow Puck as he discovers the meanings of love, life, family, and friendship.",
  "genres": [],
  "author": "Faith Friese Nelson",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/17366747-finding-verity"
}