{
  "title": "Nevermor",
  "description": "\"I told you this was a place of dreams. Sometimes, there are nightmares.\"LONDON, 1873 - In the foggy city, polluted by coal smoke from the factories along the river, 15-year-old Wren is clinging to a small thread of hope: the shimmering silver dream of a better life. Wren and her brothers, Henry and Max, are orphans. They wish to be adopted, but no one wants to take in all three of them. Wren won’t be separated from her family, but no matter how hard she fights to keep them together, she fears she will lose them nonetheless. Henry grows more distant by the day, and Wren worries about how young Max will be affected if he continues along the path of this hard life. She wants more for both of them - for herself. She wants an escape.Prompted by a world she sees in a dream, Wren begins to tell her brothers stories of a place where they can be carefree forever - a place called Nevermor. It is an island at the edge of the universe, where all dreams go. There is a boy who guards it, and he is known only as the Rifter. Wren believes that this place truly exists and desires her own life there, where she can keep her family together without anyone tearing them apart.Wren gets more than she bargained for when she is kidnapped by the arrogant and volatile Rifter and taken to Nevermor against her will. It is not completely unwelcome, however. The land is beautiful and there is freedom. The Rifter and his pack of wild boys accept her, and she feels that her brothers will be happy in this place too. Wren falls in love with Nevermor - and with the Rifter - and yet the more she learns of the conflict between the Rifter and a wicked man called the Scourge, the more she comes to realize that Nevermor is not a place for children.Nevermor is a dark fantasy based on the legend of Peter Pan.",
  "genres": [
    "Fantasy",
    "Retellings",
    "Young Adult",
    "Fairy Tales",
    "Fairy Tale Retellings",
    "Adventure",
    "Dark"
  ],
  "author": "Lani Lenore",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/17367700-nevermor"
}