{
  "title": "Cosmos and Psyche: Intimations of a New World View",
  "description": "From a philosopher whose history of Western thought was praised by Joseph Campbell & Huston Smith comes a book tracing the connection between cosmic cycles & archetypal patterns of experience. Drawing on years of research & on thinkers from Plato to Jung, Tarnas explores the planetary correlations of epochal events like the French Revolution, the world wars & 9/11. Whether read as astrology updated for the quantum age or as a contemporary classic of spirituality, Cosmos & Psyche is an important work of sophistication & learning. importance.Preface1 The transformation of the cosmos. The birth of the modern selfThe dawn of a new universe Two paradigms of historyForging the self, disenchanting the worldThe cosmological situation today 2 In search of a deeper order. Two suitors: a parableThe interior quest Synchronicity & its implicationsThe archetypal cosmos3 Through the archetypal telescope. The evolving traditionArchetypal principlesThe planets Forms of correspondence Personal transit cycles Archetypal coherence & concrete diversityAssessing patterns of correlation 4 Epochs of revolution. From the French Revolution to the 1960sSynchronic & diachronic patterns in historyScientific & technological revolutionsAwakenings of the DionysianThe liberation of natureReligious rebellion & erotic emancipationFilling in the cyclical sequence The individual & the collectiveA larger view of the sixties5 Cycles of crisis & contraction. World Wars, Cold War & 9/11Historical contrasts & tensionsConservative empowermentSplitting, evil & terror\"Moby Dick\" & nature's depthHistorical determinism, realpolitik & apocalypseMoral courage, facing the shadow & the tension of oppositesParadigmatic works of artForging deep structures 6 Cycles of creativity & expansion. Opening new horizons Convergences of scientific breakthroughsSocial & political rebellions & awakeningsQuantum leaps & peak experiencesFrom Copernicus to DarwinMusic & literatureIconic moments & cultural milestonesGreat heights & shadowsHidden births 7 Awakenings of spirit & soul. Epochal shifts of cultural visionSpiritual epiphanies & the emergence of new religionsUtopian social visions Romanticism, imaginative genius & cosmic epiphanyRevelations of the numinous The great awakening of the Axial Age The late 20th century & the turn of the millennium8 Towards a new heaven & a new earth. Understanding the past, creating the futureObservations on future planetary alignmentsSources of the world orderEpilogueNotesSourcesAcknowledgmentsIndex",
  "genres": [
    "Astrology",
    "Philosophy",
    "Psychology",
    "Nonfiction",
    "History",
    "Spirituality",
    "Science"
  ],
  "author": "Richard Tarnas",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/173693.Cosmos_and_Psyche"
}