{
  "title": "American Indian Literature, Environmental Justice, and Ecocriticism: The Middle Place",
  "description": "Although much contemporary American Indian literature examines the relationship between humans and the land, most Native authors do not set their work in the \"pristine wilderness\" celebrated by mainstream nature writers. Instead, they focus on settings such as reservations, open-pit mines, and contested borderlands. Drawing on her own teaching experience among Native Americans and on lessons learned from such recent scenes of confrontation as Chiapas and Black Mesa, Joni Adamson explores why what counts as \"nature\" is often very different for multicultural writers and activist groups than it is for mainstream environmentalists.This powerful book is one of the first to examine the intersections between literature and the environment from the perspective of the oppressions of race, class, gender, and nature, and the first to review American Indian literature from the standpoint of environmental justice and ecocriticism. By examining such texts as Sherman Alexie's short stories and Leslie Marmon Silko's novel Almanac of the Dead, Adamson contends that these works, in addition to being literary, are examples of ecological criticism that expand Euro-American concepts of nature and place.Adamson shows that when we begin exploring the differences that shape diverse cultural and literary representations of nature, we discover the challenge they present to mainstream American culture, environmentalism, and literature. By comparing the work of Native authors such as Simon Ortiz with that of environmental writers such as Edward Abbey, she reveals opportunities for more multicultural conceptions of nature and the environment.More than a work of literary criticism, this is a book about the search to find ways to understand our cultural and historical differences and similarities in order to arrive at a better agreement of what the human role in nature is and should be. It exposes the blind spots in early ecocriticism and shows the possibilities for building common ground— a middle place— where writers, scholars, teachers, and environmentalists might come together to work for social and environmental change.",
  "genres": [
    "Indigenous"
  ],
  "author": "Joni Adamson",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/1737021.American_Indian_Literature_Environmental_Justice_and_Ecocriticism"
}