{
  "title": "Gardens of Water",
  "description": "Powerful, emotional, and beautifully written, Alan Drew’s stunning first novel brings to life two unforgettable families–one Kurdish, one American–and the sacrifice and love that bind them together.In a small town outside Istanbul, Sinan Basioglu, a devout Muslim, and his wife, Nilüfer, are preparing for their nine-year-old son’s coming-of-age ceremony. Their headstrong fifteen-year-old daughter, İrem, resents the attention her brother, Ismail, receives from their parents. For her, there was no such festive observance–only the wrapping of her head in a dark scarf and strict rules that keep her hidden away from boys and her friends. But even before the night of the celebration, İrem has started to change, to the dismay of her Kurdish father. What Sinan doesn’t know is that much of her transformation is due to her secret relationship with their neighbor, Dylan, the seventeen-year-old American son of expatriate teachers.İrem sees Dylan as the gateway to a new life, one that will free her from the confines of conservative Islam. Yet the young man’s presence and Sinan’s growing awareness of their relationship affirms Sinan’s wish to move his family to the safety of his old village, a place where his children would be sheltered from the cosmopolitan temptations of Istanbul, and where, as the civil war in the south wanes, he hopes to raise his children in the Kurdish tradition.But when a massive earthquake hits in the middle of the night, the Basioglu family is faced with greater challenges. Losing everything, they are forced to forage for themselves, living as refugees in their own country. And their survival becomes dependent on their American neighbors, to whom they are unnervingly indebted. As love develops between İrem and Dylan, Sinan makes a series of increasingly dangerous decisions that push him toward a betrayal that will change everyone’s lives forever.The deep bonds among father, son, and daughter; the tension between honoring tradition and embracing personal freedom; the conflict between cultures and faiths; the regrets of age and the passions of youth–these are the timeless themes Alan Drew weaves into a brilliant fiction debut.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Book Club",
    "Family",
    "Religion",
    "Romance",
    "Audiobook"
  ],
  "author": "Alan Drew",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/1737114.Gardens_of_Water"
}