{
  "title": "Grave New Day",
  "description": "“ . . . a very satisfying ending.”—RT Book Reviews “ . . . a fast-paced urban fantasy that grips fans of the series from the beginning to the cliffhanging climax that ties up some threads, but adds new danglers.”—Genre Go Round ReviewsJess Vandermire, Vampire Hunter. . .Tough vampire cop, Jess Vandermire, fights against her unholy brethren in New York City to protect the two men she loves more than life itself. But Jess is waging a personal war, too—to save the tiny shred of soul she has left. If she loses, so does the city . . . Captain Jess Vandermire is facing the hardest decision of her life—become human again and regain her soul, or remain a vampire forever and fight an ancient evil that is a threat to every human on the planet. Ensnared in a plan that might go terribly wrong, she has little choice. As a human, she can't fight the ancient enemy.Then a mysterious stranger shows up and offers to help. She discovers her entire existence has been leading up to the challenge ahead—a challenge that has insurmountable odds.And if she doesn't win, every human on the planet will pay the price . . . Lina Gardiner, award-winning author of the Jess Vandermire, Vampire Hunter Series, has writing in her blood. Her books have been well received by such reviewers as Kirkus Reviews and USA Today’s HEA blog, including a 4.5-star rating from RT Book Reviews and a nomination for a Romantic Times Reader’s Choice Award. On the home front, Lina lives in New Brunswick, Canada, a hot spot for legendary ghosts, tall tales and odd happenings, which probably add to her love of a good mystery. The spooky stories her grandfather told his grandchildren in the \"parlor\" when their grandmother wasn't paying attention didn’t hurt either . . .",
  "genres": [
    "Urban Fantasy",
    "Vampires",
    "Paranormal",
    "Fiction"
  ],
  "author": "Lina Gardiner",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/10788303-grave-new-day"
}