{
  "title": "Benevolent",
  "description": "Award winner, Paris Book Festival 2013, Beach Book Festival 2013, and Hollywood Book Festival 2013, and Readers' Favorite Five Star Review.There she goes...Charming and addictive, Benevolent is sure to keep you turning the pages from one humanitarian mishap to another. Beginning with a roadkill-burying nine-year-old and a gas-leak explosion, it follows Gaby LeFevre, a suburban, Midwestern firecraker, as she traverses the 80s and 90s with characteristic intensity and a penchant for disaster. Meanwhile, the large cast of compelling characters entertains and the Northwhyth legends draw you into their magic. You'll leave the book wondering what is and what isn't. Thought-provoking and honest, entertaining and magical. A great debut leaving the reader waiting for the next book.Gaby LeFevre is a suburban, Midwestern firecracker, growing up in the 80s and 90s and looking to save the world one homeless person, centenarian, and orphan at a time. With her crew of twin sister, Annie, smitten Mikhail, frenemy Mel, and wanderlust friend Afentra, she’s a pamphlet-wielding humanitarian, tackling a broken world full of heroes and heroines, villains and magical seeds, and saturated with variations of the Northwyth legends.Beginning with a roadkill-burying nine-year-old and a gas-leak explosion, Benevolent follows Gaby from her formative years; through her awakening (during a soup kitchen stampede); through high school drama; a college career filled with an epic term paper, a building fire, and a protest-gone-bad; to Israel, a land full of romance and mysticism. It all ends back in metro-Detroit with a cataclysmic clash to resolve all good intentions. Accidents abound in Gaby’s life. As does love. And, thankfully, as does mercy.Meanwhile, Benevolent is woven with tales of The Queen, The Angel, Jaden the Great, and The Sage. Are they figments of John’s and Mercedes’ imaginative stories? Or are they something more? You’ll want to find out for yourself.",
  "genres": [
    "Fiction"
  ],
  "author": "Devon Trevarrow Flaherty",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/17373990-benevolent"
}