{
  "title": "Cool, Calm & Contentious",
  "description": "In this hilarious collection of personal essays, New York Times bestselling author Merrill Markoe reveals, among other things, the secret formula for comedy: Start out with a difficult mother, develop some classic teenage insecurities, add a few relationships with narcissistic men, toss in an unruly pack of selfish dogs, finish it off with the kind of crystalline perspective that only comes from years of navigating a roiling sea of unpleasant and unappeasable people, and--voila --you're funny!But in Cool, Calm & Contentious, Markoe also reveals something more: herself. This is by far her most personal, affecting collection yet--honest, unapologetic, often painful, but always shot through with the bracing, wicked sense of humor that has made her such a beloved and incisive observer of life, both human and canine. In Cool, Calm & Contentious, she goes there: from the anal-retentive father who once spent ten minutes lecturing Markoe's forty-year-old, Ph.D.-wielding brother on how to fold a napkin, to the eternally aggrieved mother who took pleasure in being unpleasant to waiters and spent most of her life, Markoe says, in \"varying degrees of pissed off\"; from the way she surrendered her virginity as a freshman in college (to her, it was \"something to be gotten rid of quickly, then never discussed again, like body odor\"), to why, later in life, she ultimately came to find dogs so much more appealing than humans, Markoe holds nothing back. It's all here, in all its messy, poignant glory, and told the way only Merril Markoe knows how--with honesty, wit, and bite. Cool, Calm & Contentious offers something for everyone--fans of humorous essays, fans of memoir, fans of great writing and finely drawn characters, fans of dogs, fans of talking dogs, and fans of reading about mothers who are so difficult and demanding they actually make you feel good about your own life. But most of all, this book is for the many fans of Merrill Markoe, who will finally get a chance to learn what makes her tick--and what makes her so funny and wise.",
  "genres": [
    "Humor",
    "Essays",
    "Nonfiction",
    "Memoir",
    "Book Club",
    "Biography",
    "Comedy"
  ],
  "author": "Merrill Markoe",
  "average_rating": "3.26",
  "url": "https://www.goodreads.com/book/show/10788688-cool-calm-contentious"
}