{
  "title": "Doubt",
  "description": "Doubt is the first book of the Among Us Trilogy series. At 21 years old, Harry and Cristal are fresh out of university with their PhD’s. Labeled all their lives as being ‘weird’ and ‘geeky’, they find true friendships with other outcasts by playing online virtual reality games. Now they face the challenges of starting out in the work force, while at the same time trying to get used to their ‘adult’ identities. Harry Doubt, a genius programmer and creator of the popular online game ‘Truth Seekers’, has a personal mission of his own; to find his mother who went mysteriously missing while volunteering on a peacekeeping mission in Palestine. His gaming friends and followers inadvertently join in helping him find her; believing that they are on missions to find out what has happened to their own missing loved ones. During Harry’s missions, Cristal and the team of ‘Truth Seekers’ stumble upon things that make them doubt the reality of their own lives. As they get closer to the truth, they realize that there are spiritual forces among them both good and evil, but in learning this, they activate a chain of events that start the beginning of the ‘end of the world’ as they know it.-----Among Us is a book series which delves into the world of the super natural and how it intersects with the every day lives of seemingly ordinary people as catastrophic events on Earth lead to the end of times. Among Us will attract fans of the TV shows Fringe, Lost, and 4400.The Among Us Trilogy is about a group of outcasts (online gamers) who band together to investigate who or what is behind the catastrophic events happening around the world. Harry Doubt, a programming genius and creator of the virtual online game \"Truth Seekers\", brings his gaming friends into undercover missions in the Middle East, Europe, and the USA to uncover the truth when his mother mysteriously disappears on a Global Nation volunteer assignment in the Middle East. Little does he know that there are forces more powerful than governments and more dangerous than he or his friends can imagine. Reluctant heroes, Harry Doubt and his group of gaming friends find themselves in a battle to save humanity.",
  "genres": [
    "Science Fiction",
    "Fantasy",
    "Mystery",
    "Paranormal",
    "Young Adult",
    "Dystopia",
    "New Adult"
  ],
  "author": "Anne-Rae Vasquez",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/17374535-doubt"
}