{
  "title": "The House of Rothschild, Vol 2: The World's Banker 1849-1999",
  "description": "A major work of economic, social and political history, Niall Ferguson's The House of Rothschild: The World's Banker 1849-1999 is the second volume of the acclaimed, landmark history of the legendary Rothschild banking dynasty. Niall Ferguson's House of Rothschild: Money's Prophets 1798-1848 was hailed as a 'great biography' by Time magazine and named one of the best books of 1998 by Business Week.Now, with all the depth, clarity and drama with which he traced their ascent, Ferguson - the first historian with access to the long-lost Rothschild family archives - concludes his myth-breaking portrait of once of the most fascinating and power families of all time.From Crimea to World War II, wars repeatedly threatened the stability of the Rothschilds' worldwide empire. Despite these many global upheavals, theirs remained the biggest bank in the world up until the First World War, their interests extending far beyond the realm of finance. Yet the Rothschilds' failure to establish themselves successfully in the United States proved fateful, and as financial power shifted from London to New York after 1914, their power waned.'A stupendous achievement, a triumph of historical research and imagination' Robert Skidelsky, The New York Review of Books 'Niall Ferguson's brilliant and altogether enthralling two-volume family saga proves that academic historians can still tell great stories that the rest of us want to read'The New York Times Book Review'Superb ... An impressive ... account of the Rothschilds and their role in history'Boston GlobeNiall Ferguson is one of Britain's most renowned historians. He is Laurence A. Tisch Professor of History at Harvard University and a Senior Research Fellow of Jesus College, Oxford. He is the bestselling author of The Pity of War, The Ascent of Money, Empire, Colossus, The War of the World and Civilization.",
  "genres": [
    "History",
    "Biography",
    "Finance",
    "Business",
    "Economics",
    "Nonfiction",
    "Politics"
  ],
  "author": "Niall Ferguson",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/173746.The_House_of_Rothschild_Vol_2"
}