{
  "title": "Colossus: The Rise and Fall of the American Empire",
  "description": "From the bestselling author of  The Ascent of Money  and  The Square and the TowerIs America an empire? Certainly not, according to our government. Despite the conquest of two sovereign states in as many years, despite the presence of more than 750 military installations in two thirds of the world’s countries and despite his stated intention \"to extend the benefits of freedom...to every corner of the world,\" George W. Bush maintains that \"America has never been an empire.\" \"We don’t seek empires,\" insists Defense Secretary Rumsfeld. \"We’re not imperialistic.\" Nonsense, says Niall Ferguson. In Colossus he argues that in both military and economic terms America is nothing less than the most powerful empire the world has ever seen. Just like the British Empire a century ago, the United States aspires to globalize free markets, the rule of law, and representative government. In theory it’s a good project, says Ferguson. Yet Americans shy away from the long-term commitments of manpower and money that are indispensable if rogue regimes and failed states really are to be changed for the better. Ours, he argues, is an empire with an attention deficit disorder, imposing ever more unrealistic timescales on its overseas interventions. Worse, it’s an empire in denial—a hyperpower that simply refuses to admit the scale of its global responsibilities. And the negative consequences will be felt at home as well as abroad. In an alarmingly persuasive final chapter Ferguson warns that this chronic myopia also applies to our domestic responsibilities. When overstretch comes, he warns, it will come from within—and it will reveal that more than just the feet of the American colossus is made of clay.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "American History",
    "Economics",
    "International Relations",
    "The United States Of America"
  ],
  "author": "Niall Ferguson",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/173744.Colossus"
}