{
  "title": "Kane's Mate",
  "description": "Faith's life has always balanced in two worlds—the normal human world and the supernatural. Now she has to choose between the two.Faith York is human, but she has psychic powers, which is a little odd since neither of her parents have paranormal abilities. Thankfully, the werewolf family who lived around the corner help her learn to control her powers. She instantly fell in love with the entire family, but especially Kane, the oldest son who is next in line to be Alpha. Unfortunately, Kane doesn't see Faith the same way she sees him. Heartbroken, she leaves town.When Faith returns from two years overseas, her parents throw her a welcome home party. Faith is shocked when Kane kidnaps her from the party and mate marks her. Now she struggles with the choice of whether to leave again and live a normal life—a life she yearns for—or stay with the man she's always dreamed of and live a supernatural life.To complicate matters further, her psychic powers intensify and she begins to have visions of an upcoming demon Armageddon. Then she learns she was switched at birth, and she has a half-brother…who is half demon.Faith must be stronger than she ever believed possible, and maybe in the process, she can trust herself to give Kane another chance.Content Sexy werewolf alpha, graphic sex, strong language, and violence\"The paranormal elements in the story enchant, the twists and turns are suspenseful and seductive and the interesting and well-rounded characters plain and simple just shine! Take time to savor the richly detailed plot because once you finish this story you will be clamoring for the next installment in this mesmerizing new series.\" Shannon at The Romance Studio",
  "genres": [
    "Paranormal",
    "Paranormal Romance",
    "Shapeshifters",
    "Romance",
    "Werewolves",
    "Demons",
    "Fantasy"
  ],
  "author": "Hazel Gower",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/17374715-kane-s-mate"
}