{
  "title": "All The Blue of Heaven",
  "description": "Eight years ago, Allie Hathaway scandalized the wealthy elite of Chicago when she ran away to San Francisco. Now a world-renowned portrait painter, her life is filled with laughter and friendship, including being a mother to her orphaned niece. Life is perfect, so why can’t she forget her first love? Thomas Bradford has come a long way from being the Hathaway family’s carriage boy. A veterinary degree, ambition and hard work have made him one of Chicago’s most sought-after bachelors. If only he could forget those stolen moments with Allie, Thomas might be able to enjoy his success. The Great Quake of 1906 stuns the nation and Allie’s art studio burns to the ground, destroying years of valuable work. She’s forced to return to Chicago with little Janey, the only spark of hope in a life reduced to ashes. Her faith is crushed by her tragic reversal of fortune.Thomas knows better than to fall for the beautiful young painter again, but he’s never been very wise around Allie Hathaway. The carriage man’s son is all grown up and Allie doesn’t expect a second chance at a love that was refused eight years ago. Her life is in shambles and she has a child to support, so why won’t her heart accept the truth?Once their love was torn apart by circumstance, but Thomas and Allie must decide whether to forge a future of hope together. This is the first book in the Colors of Faith, a Christian historical romance series by Virginia Carmichael. The next, Pockets Full of Gold, will be released in August 2013.Virginia was born near the Rocky Mountains and although she has traveled around the world, the wilds of Colorado run in her veins. A big fan of the wide open sky and all four seasons, she believes in embracing the small moments of everyday life. A home schooling mom of six young children who rarely wear shoes, those moments usually involve a lot of noise, a lot of mess, or a whole bunch of warm cookies. Virginia holds degrees in Linguistics and Religious Studies from the University of Oregon. She lives with her habanero-eating husband, Crusberto, who is her polar opposite in all things except faith. They've learned to speak in short-hand code and look forward to the day they can actually finish a sentence. In the meantime, Virginia thanks God for the laughter and abundance of hugs that fill her day as she plots her next book.",
  "genres": [
    "Christian Fiction",
    "Historical Fiction",
    "Romance",
    "Christian",
    "Historical",
    "Fiction",
    "Christian Romance"
  ],
  "author": "Virginia  Carmichael",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/17374817-all-the-blue-of-heaven"
}