{
  "title": "Entangled",
  "description": "Maddy Walker has lived a difficult life in a small town in Colorado. After losing her mother in a horrific car accident as a child, her father becomes nonexistent due to the aftermath. She has to pick up the pieces of her crumbled life and move on. For all intents and purposes she’s an orphan. But thanks to her best friend Andi and her family, she’s not completely alone; spending most of her childhood and adolescence with them. After turning 18, she and Andi move in together and she makes a decision to move forward with her life, working and putting her past behind her. Only, another tragedy hits her world and she must relive everything she has tried to forget.Noah Parker is ready to move away from the busy New York City life…and his dark past where he is harboring a lot of guilt and pain. He just wants a fresh start and being the destructive bad boy in town is not a way to do that. He doesn't ever date girls; it’s all about sex for him. He figures if he could block his pain and bury it, it will go away. Little does he know, it never just goes away. Moving to a small town close to his aunt, he’s hoping for a good change.What he doesn't expect, is to meet Maddy. She turns his world upside down. He finds himself wanting to get to know her, not on a sexual level but a deep, emotional one. It seems they have more in common than they ever imagined. And they are both having a hard time denying their attraction to one another. But the more time they spend together, the more they learn about themselves and that in order to move on, you have to learn to let go. Can Noah and Maddy make their growing relationship work together in the midst of more heartbreak and tragedy, or are their lives already too complicated as it is? In both Maddy and Noah’s POV, this is their story of loss, pain and learning to overcome it all-through love.Recommended for mature audience 17+ due to language and sexual content.",
  "genres": [
    "New Adult",
    "Contemporary Romance",
    "Erotic Romance",
    "Contemporary",
    "Romance"
  ],
  "author": "Annie Brewer",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/17375089-entangled"
}