{
  "title": "Love in the Land of Lakes",
  "description": "Minnesota is the land of 10,000 lakes, and just as many love stories. Love in the Land of Lakes brings you seventeen of these stories, from two childhood sweethearts connecting on the end of a dock on a warm summer's evening, to a city boy's chaotic weekend at his girlfriend's primitive cabin. We bring you the story of a savvy horse who leads her owner to love in post–Civil War farm country, and the haunting romance of an ageless gambler who inhabits a historic riverboat and charms the boat's new owner.A kaleidoscope of sunshine, snowstorms, and thunderstorms grace our contemporary, mystery, historical, and paranormal stories as the authors of Midwest Fiction Writers spin lovely romances that will send you drifting into happily ever afters.All proceeds from this book will benefit Midwest Fiction Writers http://www.midwestfiction.com/ in providing learning opportunities for writers of all levels.Our StoriesA Cut Above the Rest by Rhonda Brutt Rachel knew that a simple haircut had the power to change someone’s life. What she wasn’t counting on though, was how it would change hers.Bobbers 'N Bait by Laura Breck The evocative marketing gimmick at the new bait store in town has the fishing outfitter all hot and bothered.Coming Home by Jana Otto A young widow’s faith and courage are tested when she falls in love with her husband’s best friend.Dancing in the Moonlight by Rose Marie Meuwissen - Anna Thorstad never imagined reopening her parents' lake cabin would also open her heart to love again.Henrietta's Man by J.S. Overmier A savvy horse carries her Civil War-torn soldier north in search of healing and a future.Her Stranger by Michel Prince Each night a stranger comes to Rachel’s cabin door. What is it that makes her fall into his arms?Hook, Line and Stinker by Ann Hinnenkamp An LA makeover artist comes home to Minnesota and must use all her skills to tame a wild man. Hooked by Barbara Mills An avid outdoorswoman takes her city born and raised boyfriend for a chaotic weekend at her family's primitive cabin on the lake.Lake Dreams by Rosemary Heim Olivia had her life all planned out. All except for that one impulsive night with her childhood crush. Can he convince her the result is worth the risk?Lake Secrets by Mary Schenten A weekend getaway at the scene of the crime has Elly struggling to keep a secret from her best friend.Lira & Gavril by Amy Hahn A dilapidated riverboat brings together a passionate historic preservationist and a man who called it home during the Victorian era.Roadside Catch by Jody Vitek She swore off relationships with doctors, until one finds her injured on the roadside and has her rethinking the possibilities.Snowbound by Kathy Johnson Caught in a snowstorm, the last person she expects to need her help is the man she loved but lost to someone else.The Bouncing Bobber by Joel Skelton Will a budding romance, sidetracked by youth and ambition, be what it takes to lure Jacob and Nate back into love’s net?The Wind from the Lake by Naomi Stone Wishing on a star? Alien contact? When childhood friends Connie and Hank meet again, they don't need to believe in anything but each other.Unwrapped by Susan Sey Movie star Sloan Leighton sells love; she doesn’t believe in it. Then one frozen midnight on the shores of Lake Superior, everything changes.What's Up Dock? by Lizbeth Selvig Sophie’s handsome new neighbor is burying body bags in his garden. But he’s afraid of raccoons—how could he be a killer?",
  "genres": [
    "Chick Lit"
  ],
  "author": "Jody Vitek",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/17375598-love-in-the-land-of-lakes"
}