{
  "title": "Episode 1: Confessions of a Gay Rugby Player: What Goes on Tour, Stay on Tour!",
  "description": "Episode 1: Confessions of a Gay Rugby Player: What Goes on Tour, Stay on Tour!The perfect one-handed read for those who like their erotica man-on-man and full of hot detailed sex. Robert India’s serialized novel begins with this sex filled episode. How sleazy can two men be, and how much sex can one man crave? The series will explore the life and sexual exploits of an Irish, gay rugby player, Conor, his deepest desires and sexual exploits. Each episode will reveal more and more of Conor’s sexual appetites, as he lives out all his fantasies and never denies himself any pleasures. Star rugby player, Conor Murphy, lives and breathes rugby. He spends his weekends playing rugby, drinking beer, and singing songs with his teammates. There is only one thing he loves more than rugby, and that is hot rugby players. Every summer, Conor and his teammates compete in gay rugby tournaments, bruising flesh and breaking bones in their quest for glory. But after the final whistle sounds, the real competition begins: the hunt for the hottest men.Conor’s muscular body and roguish good looks ensure he can have his pick of the sexiest players. But what happens when this alpha male meets his match on and off the field? Hard muscle against hard muscle. Passion versus fire. Who will come out on top when he meets the horniest rugby players from the USA? Can two alpha males have the night of their lives? Both need to dominate; both need to win, on and off the field. Where will it all end? In one night of incredible hot sex.WARNING: This book is suitable for adults only. Contains sexual content, highly explicit sex scenes and language, and rough sex, which some readers may find offensive.Approx. 12,500 wordsEpisode 2: The Ice-Men of Copenhagen on sale now at the Kindle Store. Find out more about Conor, where has he come from and what fuels his insatiable appetite.",
  "genres": [],
  "author": "Robert India",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/17376041-episode-1"
}