{
  "title": "Confessions of a Gay Rugby Player Part 2: The Ice-Men of Copenhagen",
  "description": "Episode 2: Confessions of a Gay Rugby Player: The Ice-Men of Copenhagen The perfect one-handed read for those who like their erotica man-on-man and full of hot detailed sex. Robert India’s serialized novel continues with this sex filled episode. How sleazy can gay men be, and how much sex can one man crave? The series will explore the life and sexual exploits of an Irish, gay rugby player, Conor, his deepest desires and sexual exploits. In this episode, the boys are in Copenhagen, and it sure ain’t Kanas. These Europeans love sex, have no inhibitions, and they want Irish meat. Copenhagen is full of hot distractions, but there is a job to be done, and the lads are going to do it.Nothing is going to stop the Irish from bringing home the trophy and then taking the spoils of victory. What happens when two hot rugby players share a room on a rugby tour? Each full of aggression, testosterone, and the desire to dominate and defeat the opposition. The blood is pumping, and the men need to out hit, out run, and crush the opposition. Does that aggression stop at the teammates’ bedroom door?Teammates Conor and Sean work hard on the field to beat the competition; nothing can stop them, as they put their bodies on the line for their team. But after the teammates lift the cup, they compete against each other for the hottest men. Where will it end, as these two hot men put their friendship aside in the pursuit of the hottest players? Will their friendship survive the real sport of man hunting?Find out what drives Conor, why his hunger is never satisfied. Who is he, and who was he? Why is it so important to beat Sean in their own private competition? InstallmentWARNING: This book is suitable for adults only. Contains sexual content, highly explicit sex scenes and language, and rough sex, which some readers may find offensive.",
  "genres": [],
  "author": "Robert India",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/17376058-confessions-of-a-gay-rugby-player-part-2"
}