{
  "title": "Cosmos' Promise",
  "description": "Cosmos Raines is considered to be one of the most brilliant inventors in the world. A prodigy, he is a self-made billionaire who would rather be in his lab than jet-setting around the world. Things change when his latest experiment literally opens a Gateway into a whole new world. Now, not only has his best friend and her family moved to a new star system through the Gateway he has opened but he finds himself with a warehouse full of alien guests, including one very aggravating female that has turned him inside out.Terra ‘Tag Krell Manok has spent her life in the shadows of her three older brothers. Her home world of Baade is a male dominated world where females are few in numbers and protected to the point of captivity. Terra’s father is the high chancellor of the Prime and considered to be the fiercest warrior of their world next to her brothers. No one defies him and lives. Terra is surprised when her father suddenly sends her through the Gateway into hiding to protect her from a clan insisting that she be mated for political purposes. The last thing she expects to find there is her bond mate - in the form of a human male!Cosmos may not have been expecting to find the woman of his dreams on the other side of the Gateway he built but he knows one thing for sure - no one is going to take her away from him - not the clan who wants to use her nor her father who thinks all human males are worthless.When she is taken from him, he will use every bit of his intelligence and ingenuity to not only track her down but steal her back. He will prove that human males are just as much a warrior as a Prime one, especially when it involves the woman he loves.",
  "genres": [
    "Science Fiction",
    "Aliens",
    "Romance",
    "Science Fiction Romance",
    "Fantasy",
    "Audiobook",
    "Paranormal"
  ],
  "author": "S.E. Smith",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/17376204-cosmos-promise"
}