{
  "title": "The Outline of History",
  "description": "The Outline of History, subtitled either \"The Whole Story of Man\" or \"Being a Plain History of Life and Mankind\", is a work by H. G. Wells chronicling the history of the world from the origin of the Earth to the First World War.It appeared in an illustrated version of 24 fortnightly installments beginning on 22 November 1919 and was published as a single volume in 1920. It sold more than two million copies, was translated into many languages, and had a considerable impact on the teaching of history in institutions of higher education. Wells modeled the Outline on the Encyclopédie of Denis Diderot.In the years leading up to the writing of The Outline of History Wells was increasingly preoccupied by history, as many works testify. (See, for example, The New Machiavelli, Marriage, An Englishman Looks at the World, The Wife of Sir Isaac Harman, Mr. Britling Sees It Through, etc.) During World War I, he tried to promote a world history to be sponsored by the League of Nations Union, of which he was a member. But no professional historian would commit to undertake it, and Wells, in a financially sound position thanks to the success of Mr. Britling Sees It Through and believing that his work would earn little, resolved to devote a year to the project. His wife Catherine (Jane) agreed to be his collaborator in typing, research, organisation, correspondence, and criticism. Wells relied heavily on the Encyclopaedia Britannica (11th ed., 1911), and standard secondary texts.He made use of the London Library, and enlisted as critical readers \"a team of advisers for comment and correction, chief among them Ernest Barker, Harry Johnston, E. Ray Lankester, and Gilbert Murray. The sections were then rewritten and circulated for further discussion until Wells judged that they had reached a satisfactory standard.\" The bulk of the work was written between October 1918 and November 1919.",
  "genres": [
    "History",
    "Nonfiction",
    "Classics",
    "Reference",
    "World History",
    "Historical",
    "Collections"
  ],
  "author": "H.G. Wells",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/17376287-the-outline-of-history"
}