{
  "title": "Daric's Mate",
  "description": "GENRE: Adult Paranormal Erotic RomanceBook 5 of The Vampire Coalition:Prince Daric Carvillius is the twelve hundred year old Prince of the Vampire Healers, the most powerful being on earth, and very accustomed to getting his own way in every situation. When one of his healers, Liam, finds his mate after an entire millennium had passed without one healer mating, Daric is hopeful that the Carvillius Curse is finally broken; the results of a mistake he made a thousand years ago finally righted, allowing healers to find their mates. The only vampire healer he doesn’t want to see mated is himself, positive that the last thing he wants is a female he has to protect in addition to babysitting his unruly lot of vampire healers. But Daric has a destiny to fulfill, and his fate crashes into his life, literally, one snowy night in Colorado when he rescues a female human, Hannah Temple, from a blizzard.Hannah Temple has returned to her small town after eight years in Vail, her ex-boyfriend having dumped her after a tragic accident that has left her unable to ski or even walk without a limp. Still reeling from the sudden loss of her father from a fatal heart attack, she tries to put her life back together after a year of loss and pain. Running the small pizzeria her father had left her, she feels compelled to make a delivery that is probably unwise, but important to keeping the business of Daric Carvillius, the most mysterious and notorious resident in the small mountain town.Sparks fly when Hannah and Daric meet, and danger lingers in the background from the fallen that are eager to get to the mate of a vampire prince. Can these two lonely, lost souls who were meant to be together actually mate and find a happily ever after?Find out in the final book of The Vampire Coalition, Daric’s Mate!Note: This book is not intended for YA readers. The book contains graphic language, explicit sex and other material not suitable for YA readers. As noted above, this is an erotic romance",
  "genres": [
    "Vampires",
    "Paranormal",
    "Romance",
    "Paranormal Romance",
    "Erotica",
    "Fantasy",
    "Short Stories"
  ],
  "author": "J.S. Scott",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/17377242-daric-s-mate"
}