{
  "title": "BlackMoon Beginnings",
  "description": "Large gorgeous men, a hidden race, and a magical secret. Ryanne Arden was on track to being Stormfield High School’s Valedictorian. Being the shy, quiet studious type, she’s always done her own thing. That all changed when a drunk man decided to get behind the wheel of a car. With the death of her mother, Ryanne is suddenly more alone than she’s ever been. With no friends or family to turn to, a local woman named Jane offers to help Ryanne in her time of need. With graduation looming ahead of her, eighteen year old Ryanne must get her act together if she wants to get out of the small town of Stormfield, Maine and away from her painful memories.Meeting the attractive Colton Wagner, changes everything. He awakes something in Ryanne that even she didn’t know she had. Magic. With her life suddenly thrown upside down, Ryanne has been thrust into a world completely unbeknown to her. Being the only non-mage to ever gain magic, paints a target on Ryanne’s back. She’s the girl the whole mage world has been searching for. It has been prophesized for thousands of years that a young non-mage female would put an end to the chaos created by rogue mages, the Gadramicks. Their manipulative leader, Dravin, will do anything within his power to prevent the prophecy from being fulfilled.Finding out that she's an intricate part to ending a supernatural war, Ryanne has the weight of all mages on her shoulders. With the help of Colton and his family, along with a healer, a dream-walker, and a loud-mouthed mage, Ryanne sets out on the journey of a lifetime. Can she overcome her insecurities and do what is needed of her or will she lose her identity behind the magic inside of her?BlackMoon Beginnings is part one in the four-part Prophesized Series.",
  "genres": [
    "Fantasy",
    "Paranormal",
    "Young Adult",
    "Magic",
    "Romance",
    "Paranormal Romance",
    "Supernatural"
  ],
  "author": "Kaitlyn Hoyt",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/17379473-blackmoon-beginnings"
}