{
  "title": "Legends",
  "description": "Martin Odum is a CIA field agent turned private detective, struggling his way through a labyrinth of past identities - \"legends\" in CIA parlance. Is he really Martin Odum? Or is he Dante Pippen, an IRA explosives maven? Or Lincoln Dittmann, Civil War expert? These men like different foods, speak different languages, have different skills. Is he suffering from multiple personality disorder, brainwashing, or simply exhaustion? Can Odum trust the CIA psychiatrist? Or Stella Kastner, a young Russian woman who engages him to find her brother-in-law so he can give her sister a divorce.As Odum redeploys his dormant tradecraft skills to solve Stella's case, he travels the globe battling mortal danger and psychological disorientation. Part Three Faces of Eve, part The Spy Who Came in From the Cold, and always pure Robert Littell, Legends—from unforgettable opening to astonishing ending—again proves Littell's unparalleled prowess as a seductive storyteller.Robert Littell is today widely considered one of the true grand masters of American spy fiction, hailed for his profound grasp of the ambiguous world of international espionage, grippingly displayed in his thirteen novels. His most recent international bestseller, The Company, was praised as being \"popular fiction at its finest\" by the Washington Post Book World and as \"one of the best spy novels ever written\" by the Chicago Tribune. Now delving into one agent's labyrinth of memories and past identities—\"legends,\" in CIA parlance—Legends again displays Littell's unparalleled prowess as a seductive storyteller exploring the clandestine but always very human world of secret agents.Now a TNT series starring Sean Bean, from the producers of 24 and Homeland.",
  "genres": [
    "Fiction",
    "Thriller",
    "Espionage",
    "Mystery",
    "Mystery Thriller",
    "Audiobook",
    "Suspense"
  ],
  "author": "Robert Littell",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/173798.Legends"
}