{
  "title": "Breaking Silence- A Poetic Lifeline From Slavery To Love",
  "description": "Breaking Silence anthology defines the rising of a fresh sun, the birth of a new child and the eruption of voices of silences from dungeons of oppression scattering into the streets of justice. It is a revolution of sons and daughters of Mother Earth armed with a poetic license dedicating metaphors of justice to the world.The enthusiasm, velvet imagery, peppermint metaphors, juxtapositions and arrow realism in the poetry brings us a world of new generation of poets taking the world by storm. This collection is embodied with great thoughts, minds and emotions of progressive literary genes of variegated age groups, colour, ideologies, geographies and cultures.Poetry on love, childhood memories, affection for mother Africa, centuries of slavery and colonial tides, all is cocooned in this well thought work of literature.Fifty-two poets from Ghana, Zimbabwe, Nigeria, Australia, Kenya, South Africa, United States, Canada, Belgium, Spain, Malaysia, India and Philippine have come together to conceive Breaking Silence.One exciting issue is that, the collection is coordinated and compiled by a teen poet from the mother of freedom in Africa, Ghana, once called Gold Coast. I have a strong belief that readers will find reading this worldwide collection, reasonable, cheerful and thought provoking.“A dream doesn’t become reality through magic; it takes sweat, determination and hard work”- Colin PowellI firmly believe that almost anything is possible in this life, if you are willing to back your dreams with hard work. I have seen miracles accomplished again and again by people who understand hard work’s value and importance.Finally, I will end with quotes by one of our greatest; Ayi Kwei Armah“I did point out that I have no prophetic gifts. I write books because I tried to do something more useful and failed. Since I've been trained to write, I do that as a defense against total despair. And seeing people like you, who are actively engaged in trying to salvage pieces of our wrecked lives, gives me hope that after all we are not alone.”Let readers get liberated poetically!",
  "genres": [],
  "author": "James Robert Myers",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/17380474-breaking-silence--a-poetic-lifeline-from-slavery-to-love"
}