{
  "title": "Die Laaste Trek - 'n Nuwe Begin",
  "description": "On April 27, 1994, millions of South Africans stood in mile-long queues for hours to cast their votes in the country's first democratic election. F.W. de Klerk, the last apartheid president, must have known his party would lose and that he was effectively handing the power of the volk to the African National Congress and its leader, Nelson Mandela. De Klerk's motivation for writing The Last Trek appears to be to show this surrender of power as the act of the country's \"great reformer.\" The book is also an attempt to reassure the volk that this is not the end for them--merely a fresh challenge. De Klerk was brought up as an Afrikaner nationalist and his view of the world was shaped by racism. He unapologetically tells how, as a young man, he was impressed with Dr. Hendrik Verwoerd's plans to create separate black homelands and was relieved when Nelson Mandela was sentenced to life imprisonment. Throughout the time he was a nationalist parliament member, minister, and later president, de Klerk insists, he did not know about his government's reign of terror and its attendant massacres and death squads. (Though he was a \"compassionate reformer\" and lawyer, it seems unbelievable that he did not try harder to find out if the allegations were true.) He does apologize for apartheid crimes--but urges they should be seen in context of the cold war and his political background, as well as in comparison with other nations: a weak apology, indeed. The Last Trek offers interesting insights into de Klerk's mind, but its most interesting material may well be its description of how his relationship with Mandela deteriorated, leading to the collapse of the coalition government--an event that angered de Klerk's colleagues because it caused a rift in the party and eroded international confidence in multiracial government.",
  "genres": [
    "Africa",
    "Biography",
    "History",
    "South Africa",
    "Politics"
  ],
  "author": "F.W. de Klerk",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/1738194.Die_Laaste_Trek_n_Nuwe_Begin"
}