{
  "title": "Genesis",
  "description": "In the dark heart of the Horn of Africa, our shadow wars rage.But beneath the violence and terror, a bio-engineered serial killer lurks.Come back in time with ARISEN and live through the beginning of the end of the world...The Horn of Africa, place of various madness and horror – home to depraved warlords, Islamist militias, famine, drought... and regular outbreaks of killer viruses.Tucked away in a high-tech Tactical Operations Center, inside an isolated safehouse in Somalia, sits Agency analyst Zack Altringham. He is Kenyan-born, Princeton-educated, badly burnt-out – and condemned by his language and cultural skills to a lifetime of fighting America's shadow counter-terror wars. But a threat many times worse than any suicide bombing lurks in the corner of Zack's tortured consciousness – just as it lurks out in the lawless bush of Somaliland. And when another mystery epidemic breaks out, Zack must find out if it is connected to a bio-terror plot he believed he thwarted years ago...But, terrifyingly quickly, the epidemic reaches a tipping point and chaos descends – and Zack and his team (including two former Team Six SEALs) are trapped between the millstones of the sick and the dying on one side, and heavily armed militias on the other. Soon their “safe” house is in flames, and their only remaining option is to get in their up-armored SUV and try to escape the imploding gravity well of the city, to the safety of the American military base in Djibouti. But by then, will there be anywhere safe left on Earth to escape to?Come back in time with the ARISEN prequel and live through the beginning of the end of the world. Nothing will ever look the same again.",
  "genres": [
    "Zombies",
    "Horror",
    "Fiction",
    "Audiobook",
    "Post Apocalyptic",
    "Military Fiction",
    "Apocalyptic"
  ],
  "author": "Michael Stephen Fuchs",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/17382593-genesis"
}