{
  "title": "Unbreakable: My Story, My Way",
  "description": "The story behind Telemundo’s Jenni Mariposa del Barrio series, now streaming. A New York Times bestseller, this is the official biography from the beloved Mexican-American singer who lost her life in a tragic plane crash.The only autobiography authorized by Jenni Rivera \"I can’t get caught up in the negative because that destroys you. Perhaps trying to move away from my problems and focus on the positive is the best I can do. I am a woman like any other, and ugly things happen to me like any other woman. The number of times I have fallen down is the number of times I have gotten up.\" These are the last words that beloved Mexican American singer Jenni Rivera spoke publicly before boarding the plane that would crash and cut her life short on December 9, 2012. However, they are not the final words that La Diva de la Banda had for the world. Those are found in the pages you hold in your hands, Jenni’s own account of the highs and lows of her extraordinary journey. She became the most acclaimed Spanish-language singer in the United States and sold more than 15 million records worldwide. A single mother of five and grandmother of two, she was also an actress, a television producer, the star of her own reality show, and an entrepreneur. But for all its immense success, Jenni’s life often seemed to be a series of personal battles in which perseverance was her only weapon. As her fame grew, she made it her mission to speak about her struggles, forging an intimate connection with her fans. She became a figure of strength and a source of encouragement to women of all ages. In Unbreakable, Jenni recounts the crucial moments in her past, revealing her experiences with domestic and sexual abuse, divorce, body image issues, making her way in a male-dominated industry, raising her children as a single mother, and learning that she could depend only on herself. Though she is no longer with us, Jenni will always be the \"Rivera rebel from Long Beach,\" the girl who maintained her sense of humor and fighting spirit in every circumstance. In this remarkable memoir, Jenni leaves behind a legacy of inspiration and determination that will forever live on through her precious family, friends, and fans.",
  "genres": [
    "Biography",
    "Memoir",
    "Nonfiction",
    "Autobiography",
    "Spanish Literature"
  ],
  "author": "Jenni Rivera",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/17382724-unbreakable"
}