{
  "title": "Everybody Loves Our Town: An Oral History of Grunge",
  "description": "Twenty years after the release of Nirvana’s landmark album Nevermind comes Everybody Loves Our Town: An Oral History of Grunge, the definitive word on the grunge era, straight from the mouths of those at the center of it all. In 1986, fledgling Seattle label C/Z Records released Deep Six, a compilation featuring a half-dozen local bands: Soundgarden, Green River, Melvins, Malfunkshun, the U-Men and Skin Yard. Though it sold miserably, the record made music history by documenting a burgeoning regional sound, the raw fusion of heavy metal and punk rock that we now know as grunge. But it wasn’t until five years later, with the seemingly overnight success of Nirvana’s “Smells Like Teen Spirit,” that grunge became a household word and Seattle ground zero for the nineties alternative-rock explosion.Everybody Loves Our Town captures the grunge era in the words of the musicians, producers, managers, record executives, video directors, photographers, journalists, publicists, club owners, roadies, scenesters and hangers-on who lived through it. The book tells the whole story: from the founding of the Deep Six bands to the worldwide success of grunge’s big four (Nirvana, Pearl Jam, Soundgarden and Alice in Chains); from the rise of Seattle’s cash-poor, hype-rich indie label Sub Pop to the major-label feeding frenzy that overtook the Pacific Northwest; from the simple joys of making noise at basement parties and tiny rock clubs to the tragic, lonely deaths of superstars Kurt Cobain and Layne Staley.Drawn from more than 250 new interviews—with members of Nirvana, Pearl Jam, Soundgarden, Alice in Chains, Screaming Trees, Hole, Melvins, Mudhoney, Green River, Mother Love Bone, Temple of the Dog, Mad Season, L7, Babes in Toyland, 7 Year Bitch, TAD, the U-Men, Candlebox and many more — and featuring previously untold stories and never-before-published photographs, Everybody Loves Our Town is at once a moving, funny, lurid, and hugely insightful portrait of an extraordinary musical era.",
  "genres": [
    "Music",
    "Nonfiction",
    "History",
    "Biography",
    "Oral History",
    "Pop Culture",
    "The United States Of America"
  ],
  "author": "Mark Yarm",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/10790499-everybody-loves-our-town"
}