{
  "title": "Bill's Im-Perfect Time Management Adventure",
  "description": "Bill’s Im-Perfect Time Management Adventure begins with an anonymous email – it warns Bill, an engineer at Syscon, that he's on a list of project managers at risk of layoff. A conversation with his boss confirms his fears – his poor time management skills threaten his financial security and his family’s wellbeing. To escape failure, he must improve dramatically, and fast.In quick succession, he tries several prescriptions for better time management – a new smartphone, a popular book and a colleague-turned-coach. None yield the results his management team wants, and he sinks deeper into panic. To make matters worse, Syscon temporarily transfers him to another company: a cost-saving move that the company has used in the past a precursor for permanent separation.Backed against the wall, Bill finds space to think, and he discovers the need for every working professional to develop an individual time management system. He tests his ideas on himself before speaking up to his colleagues-on-loan. Brewed in the company’s culture and supported by an open-minded executive and an eccentric time management researcher, Bill’s ideas start to bear fruit. He and his new colleagues realize that they already have time management systems in place; asking working professionals to implement new systems without taking their original habits, practices and rituals into account just doesn’t make sense.With his colleagues' help, he visualizes the group of core skills that people already use unconsciously to manage their time as seven “ladders” that people can climb in order to improve dramatically in a short time.His good luck runs out, however, when Syscon calls him back. Though his future unnerves him, he returns with a commitment to apply his new approach to help turn the company's chronic problem of low productivity around.When he arrives, he must lead a sub-par team, and the pressure to keep his own job rises as he struggles to save theirs. To make matters worse, his colleague-turned-coach now sees him as a threat to his own upward mobility at Syscon.To survive the test of attrition, Bill must boost his whole team’s productivity, and his new method offers the only chance.“Finally! An engaging story about time management with flesh-and-blood characters. Bill’s Im-Perfect Time Management Adventure reads like a suspense novel. You’ll hardly know that you’re learning the most organic and flexible system for managing your time that exists.”- Judith Kolberg, author Getting Organized in the Era of Endless: What To Do When Information, Interruptions and Work is Endless and Time is Not\"Francis is unique because he has not only come up with a good time management system for himself, but he has then gone on to dissect what works and then present it to the world in a format other people can directly apply without any prior knowledge.” - Yaro Starak, Entrepreneurs-Journey.com\"Substantial productivity tips packed up and rolled into a superb novel.\"- Leon Ho, founder of Lifehack",
  "genres": [],
  "author": "Francis Wade",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/17382841-bill-s-im-perfect-time-management-adventure"
}