{
  "title": "Yours to Savor",
  "description": "*An adult contemporary romance intended for mature readers.* AN INNOCENT WOMAN... Twenty-five year old Sandra Hawthorne once had a life that many would envy. Smart, beautiful, and engaged to an accomplished young professional, she seemed to have anything she desired at her fingertips.Nobody suspects the emotional turmoil she lives with under the surface. Stalked by demons from her past, Sandra abandons everything on the cusp of her wedding and seeks refuge in a small town far away. But no matter where she hides, she cannot escape from the nightmares that torment her existence. ...AND A DANGEROUS MAN... Having made his fortune supplying high-end drugs to the most affluent clientele, thirty-three year old Brandon Galliani now seeks to reform himself and reestablish ties with his long-estranged family. But when one final business trip beckons him to a small Washington seacoast community, the last thing he expects to find is a secretive, enigmatic woman who captures his heart, enraptures his soul, and changes his life forever. ...BROUGHT TOGETHER BY FATE. For two years, Sandra has kept to herself while desperately hunting for relief from her nightmares. Everything changes when she crosses paths with a mysterious, dazzling stranger one crisp spring morning. Sandra knows she cannot afford to let down her guard around him. Yet the man quickly becomes hell-bent on breaking through the walls of her self-imposed prison. Sandra resists, but soon discovers that what her mind thinks it wants and what her heart knows it needs are two very different things. --Your to Savor is the riveting, erotic tale of two opposites colliding in a fiery clash of passion, lust, and love. Each holds secrets from the other. The truth will strain the flawed underpinnings of their relationship. In the end, will Sandra and Brandon's budding love be enough to overcome the most despairing odds?",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Adult",
    "Crime",
    "Chick Lit",
    "New Adult"
  ],
  "author": "Scarlett Edwards",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/17383074-yours-to-savor"
}