{
  "title": "Inventing Freedom: How the English-Speaking Peoples Made the Modern World",
  "description": "Does freedom have a future? The renowned conservative and author of The New Road to Serfdom argues that it rests with the fate of the Anglosphere: the English-speaking nations that invented political liberty and introduced it to the worldUntil very recently, historians and politicians on both sides of the Atlantic took for granted that personal liberty, free contract, the rule of law and representative government-the foundations of Anglosphere civilization-contributed to the success of the English-speaking peoples. Yet today we see those ideas abandoned and scorned in places where they once went unchallenged, including Washington, D.C.We often mistake these principles for universal liberal values: free elections, equality for women, jury trials, the accountability of the executive to the legislature. It is easy to lose sight of the fact that all these things, in their modern form, are products of a very specific English-speaking civilization. There was nothing inevitable about their triumph. They could easily have been snuffed out in the 1940s. They would not be ascendant if the Cold War had ended differently.When we speak of \"the West\" in a geopolitical sense, we really mean the alliance of free English-speaking democracies. It is they, not France or Germany or Italy or Spain, who have disseminated and preserved liberty. If we lose them, humanity itself will be the poorer. Inventing Freedom is an analysis of why the extraordinary idea that the state was the servant, and not the ruler, of the individual evolved in the English-speaking world. It is a chronicle of the success of Anglosphere exceptionalism, offered at a time that may turn out to be the end of the age of political freedom.",
  "genres": [
    "History",
    "Politics",
    "Nonfiction",
    "Political Science",
    "Audiobook",
    "World History",
    "American History"
  ],
  "author": "Daniel Hannan",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/17383973-inventing-freedom"
}