{
  "title": "Jab, Jab, Jab, Right Hook: How to Tell Your Story in a Noisy Social World",
  "description": "The New York Times bestselling author and social media expert returns with hard-won advice on how to connect with customers and beat the competition by mastering social media marketingWhen managers and marketers outline their social media strategies, they often plan for the \"right hook\"-their next highly anticipated sale or campaign that's going to put the competition out for the count. Even companies committed to jabbing-patiently engaging with customers to build the relationships so crucial to successful social media campaigns-still yearn to land the powerful, bruising swing that will knock out their opponent or their customer's resistance in one tooth-spritzing, killer blow. Right hooks, after all, convert traffic to sales. They easily show results and ROI. Except when they don't.In the same passionate, street-wise style readers have come to expect, Gary Vaynerchuk is on a mission to improve marketers' right hooks by changing the way they fight to make their customers happy, and ultimately to compete. Thanks to the massive change and proliferation in social media platforms in the last four years, the winning combination of jabs and right hooks is different now. Communication is still key, but context matters more than ever. It's not just about developing high-quality content, but developing high-quality content perfectly adapted to specific social media platforms and mobile devices-content tailor-made for Facebook, YouTube, Instagram, Pinterest, Twitter, and Tumblr. A mash-up of the best elements of Crush It! and The Thank You Economy with a 2013 spin, here is a blueprint to social media marketing strategies that really works.",
  "genres": [
    "Business",
    "Nonfiction",
    "Social Media",
    "Entrepreneurship",
    "Personal Development",
    "Self Help",
    "Writing"
  ],
  "author": "Gary Vaynerchuk",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/17383989-jab-jab-jab-right-hook"
}