{
  "title": "Winning from Within: A Breakthrough Method for Leading, Living, and Lasting Change",
  "description": "An expert on managing yourself for high performance presents a proven approach for getting more of what you want, improving your relationships, and enjoying life's deeper rewards, revealing how winning at work and in life begins by learning how to negotiate with yourself Life is a series of negotiations, whether or not you think of yourself as a negotiator. From seemingly insignificant daily decisions to major life choices, you negotiate every time you aim to persuade, argue over a decision, or resolve a conflict. But as negotiations and leadership expert Erica Ariel Fox reveals, the most important negotiations-the ones that determine the impact of our actions and the quality of our lives-are those we have with ourselves.Most of us recognize the difference between our knowledge-what we know we should do and say-and our know-how-what we actually do and say in real life when it counts. Fox calls this the \"Performance Gap,\" and she shows you how to close it, turning breakdowns into breakthroughs, whether struggling with a difficult client, arguing with a combative teenager, or organizing for community action.Winning from Within combines insights from Western psychology and Eastern philosophy with practical applications from real business situations and everyday life. Fox shows that the ability to achieve mastery over how we interact with each other comes from within, from the \"center\" where desires, thoughts, feelings, and impulses to take action live side-by-side. Winning from Within offers a profound and highly practical seven-step method for making changes that last-at work and at home. As Erica Ariel Fox demonstrates, we can actually get what we want-and feel good about the result.",
  "genres": [
    "Leadership",
    "Business",
    "Nonfiction",
    "Self Help",
    "Psychology",
    "Management",
    "Personal Development"
  ],
  "author": "Erica Ariel Fox",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/17383958-winning-from-within"
}