{
  "title": "The Fifth Wave: A Strategic Vision for Mobile Internet Innovation, Investment and Return",
  "description": "The mobile internet—the fifth wave of computing—is a tsunami. The convergence of mobile networks and devices with the internet creates a near-universal market of six billion users and generates $2.5 trillion in annual economic value, yet it has barely begun to gather force. The first book to fully and insightfully explain this technological revolution and how it will radically alter life, society, and commerce, The Fifth Wave introduces:- The Connected Generation. Citizens of the ageless, nationless Global Village, whose embrace of mobile technologies is changing every social, commercial and political relationship, forever.- The Democratization of Innovation. The decentralization of power away from closed systems and organizations, including Silicon Valley itself, distributing innovation to new technology hubs around the globe.- The Four Cs. Communication, content, community, and commerce—the activities and commercial applications of the more than six billion mobile internet users—restructuring every market and remaking every business.- The first in-depth analysis of the IPO debacle by Facebook and other mispriced firms and what these incidents say about the lack of understanding of value in this new and uncertain market space.- The Mobile Internet Genome. A lingua franca, a technology classification system, and the analytical tool that innovators and investors need in order to understand, value and manage this new class of strategic asset.- Mobile Presence. A quality, not a technology; the principal monetization mechanism for the mobile internet, a form of ‘always-on’ autonomous search, intelligently managing the flow of our communications, content, and commercial transactions.The mobile internet is going to change more lives, create more wealth, destroy more businesses, and upend more political systems than any force in history. The Fifth Wave is the indispensable sourcebook for navigating this time of great unpredictability and even greater opportunity.",
  "genres": [
    "Business"
  ],
  "author": "Robert Marcus",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/17384224-the-fifth-wave"
}