{
  "title": "Exo-Vaticana : Petrus Romanus, Project L.U.C.I.F.E.R. And the Vatican's Astonishing Plan for the Arrival of an Alien Savior",
  "description": "Pope Benedict XVI has resigned as Pope, just like the authors predicted he would do in their 2012 best-seller Petrus The Final Pope Is Here. Since then Tom Horn and Cris Putnam have been inundated with invitations from around the world to be interviewed on radio, television, and in print media. These included segments in The History Channel's \"Countdown to Apocalypse,\" a special feature on Canada's largest Christian channel VisionTV titled \"I The Apocalypse Series,\" invitations to Rome to discuss with Italian media their findings on René Thibaut (a Belgian Jesuit whose meticulous analysis of the Prophecy of the Popes predicted the arrival of Petrus Romanus in this era), and dozens more.  But during a show on Omega Man Radio the author's disclosed an \"extraterrestrial\" connection between Petrus Romanus, the Vatican, and the Mount Graham Observatory, which rocketed that program into the #1 position in the world, illustrating to the authors that modern civilization is more than casually interested not only in the final pope, but in the connection between Rome and their secret work on extraterrestrial intelligence, astrobiology, and the intriguing preparations they are making for the arrival of an alien 'savior.'  Thus, the new investigation began and quickly resulted in findings far more disturbing than the authors expected to find.NOW, FOR THE FIRST TIME, \"EXO-VATICANA\" REVEALS...Unveiled! The Vatican's secret plan for the arrival of an alien godDisclosed! Secret files in the Vatican library on the reality of the alien presenceFound! The private document detailing the Vatican's position on the extraterrestrialsRevealed! Project LUCIFER and the hidden quest for \"Fallen Star\"2013! The year top astronomers say the alien world and its inhabitants will be divulgedThe Collins Elite, Occultism, and the covert breeding and hybridization programThe incredible family secret that Tom Horn has kept concealed for decades!What top Government and Vatican Officials told the authors about the reality of UFOs, ETIsThe Vatican's Top Astronomer agrees to and is interviewed by Horn & PutnamNick Pope, Bruce Maccabee, Stanton Friedman, Jesse Marcel Jr. and others weigh inBack to Cydonia! The truth behind the face on Mars and artificial structures on other worldsIn Petrus Romanus, PROJECT LUCIFER, and the Vatican's astonishing exo-theological plan for the arrival of an alien savior , internationally acclaimed investigative authors Thomas Horn and Cris Putnam break the greatest story of our time and expose the elitists and intellectuals who are planning to assimilate mankind under a coming 'savior,' one whom the prophet Daniel foresaw as \"an alien god.\"",
  "genres": [
    "Religion",
    "Conspiracy Theories",
    "Nonfiction",
    "Paranormal",
    "History",
    "Reference",
    "Catholic"
  ],
  "author": "Thomas Horn",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/17384780-exo-vaticana"
}