{
  "title": "GroundTies",
  "description": "The NSpace Communication A really big computer with an even bigger problem.Stephen An enigmatic computer genius in search of his own sanity.Wesley A perennial thorn in the ComNetAuthority's side.Admiral Loren A woman with a mission to which an unwilling Stephen holds the key, and an even less cooperative Smith is the roadblock. a distant world that holds--all the answers.GroundTies is the beginning of a much larger story, first of the three book story arc previously published by Warner Books. It is continued in UpLink and Harmonies of the 'Net and expanded in the upcoming 'NetWalkers, Nexus, Wildcard and ColdFusion. The final volume, Homecoming Games, is in production. Together they form the core of Fancher's future history of the ComNet Alliance.135,000 words. Approximately 400 pages. Original Warner EditionSpecial Introductory Price! When the sequel, UpLink, goes up, the price of GroundTies will go up to a whopping $2.99!\"--award-worthy. An edgy, often funny, sometimes frightening work in which you only think you know where you're going.\"--CJ multiple award winning author of Cyteen\"--['NetWalkers is] everything science fiction should a slam-bang adventure that leaves you thinking, a character story with a social conscience and stylish writing paired with brilliant plotting...\"--Robert J. multiple award winning author of FlashForward\"... reads like Cherryh near her own top form...No padding or wheelspinning here, just the genuine article.\"--Faren Locus\"Reading any book by Jane Fancher is like sitting down to a cup of really good hot cocoa--rich with just the right touch of darkness to make it interesting...\"--Patricia #1 NY Times Best Selling Author of the Mercy Thompson Series",
  "genres": [
    "Science Fiction",
    "Science Fiction Fantasy",
    "Space Opera",
    "Cyberpunk",
    "Fiction"
  ],
  "author": "Jane S. Fancher",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/10790943-groundties"
}