{
  "title": "Beyond Belief: Agnostic Musings for 12 Step Life: finally, a daily reflection book for nonbelievers, freethinkers and everyone",
  "description": "Finally, a daily reflection book for everyone from Rebellion Dogs Publishing. Beyond Belief is the first secular daily reflection book written in a contemporary language for today's addicts and alcoholics in recovery.From the Foreword by Dr. Ernie Kurtz (author of Not A History of Alcoholics Anonymous & The Spirituality of Imperfection ):\"The book is aimed at a general 12-Step readership, but it is mindful that there heretofore exist no such aids for unbelievers, freethinkers, and the unconventionally spiritual. Given that the latest Pew Research survey found that twenty percent of the American people list their religious affiliation as 'None,' it is certainly time that the Recovery world took into consideration this population's needs. Beyond Belief addresses that need in a confident, non-aggressive way. I doubt that any believer will find anything objectionable in its pages. This believer, for one, finds much that is spiritually helpful.\"Nothing is sacred and nothing is forbidden; we draw from classic and contemporary 12-Step wisdom and we explore philosophy, psychology, entertainment, art, spiritual musings, skeptical inquiry and the uncanny wisdom in the rooms.Professional and 12&12 Member Melissa D., Clinical Psychologist, California says, “I have never seen a daily devotional book written for agnostics. I found the readings to be extremely thought provoking. I wonder sometimes since there is such talk about God at meetings, what kind of turn-off that must be for agnostics. I think this book will be very helpful to both the newcomer and the mature 12 Step member.”Bob K, author of Key Players in AA History, AAagnositca contributor says, “I expected his book to be good. It’s WAY, WAY better than good. The book is outstanding. Two decades of not being a ‘daily reflections’ kind of guy, are over. Now I have reflections worth reflecting over! Buy this book or you will suffer a horrible and painful death! Well, maybe not, but you’ll be missing out on something very good.”Denis K. says, “Many thanks for this great book; my Monday night group and I are having some great discussions related to the daily musings both at the group and often during the week over coffee. All of us were quickly losing interest in the local meetings; Beyond Agnostic Musings for 12 Step Life gave all of us a much needed spark that has renewed our interest in the fellowship.”Christopher Burn, writer, psychotherapist, blogger, remarks, \"Almost everything about the book looks ground breaking and thought provoking, from its interactive format (on the Kindle version you can browse through a hundred or so linked topics such as 'Brain Chemistry', 'Gratitude' or 'Zen'), to its edgy literary style.\"The book includes an index of over 120 topics, extensive notes and a bibliography.Available from Rebellion Dogs Publishing website and your favorite online or brick-and-mortar retailer in eBook or paperback, Beyond Belief is not anti-religious, but candidly secular (non-religious). In a new era of recovery, this book has becoming a \"go-to\" for online and in-person groups and for individual reflection.",
  "genres": [
    "Self Help",
    "Nonfiction"
  ],
  "author": "Joe C.",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/17384838-beyond-belief"
}