{
  "title": "Eleusis",
  "description": "2012 Amazon Breakthrough Novel Award Quarterfinalist! Macy needs a break. Her parents are dead and a moody trespasser has set up camp on the property she has inherited. When the stranger confesses himself to be an ageless sea-god and tells Macy she has been guarding a secret she never knew existed, her once simple life takes a drastic turn. Just when she thinks it can’t get any stranger, a back door to the Underworld opens up and it’s time to run like hell. Mythology and contemporary life collide as this fast-paced novel explodes and dark forces tracking Macy surface to capture her. In the transatlantic chase that follows, she learns of her forgotten past and a centuries-old connection to the sea-god who helps her escape. A tragic miscalculation derails Macy and in a moment of self-sacrifice she ends up where it all began, trapped in the Underworld. Has she learned enough about her past to forge a meaningful future? Utterly alone, she realizes that to gain real freedom, she must reject her assigned place in history and in doing so risk everything. Events challenge her whilst she comes to grips with her legacy and decides what she wants in life. Family betrayal, sinister plot twists, and unlikely friends fill this exhilarating story of one woman’s journey to shape her future as she learns her true identity and strives to become a force in her own right. Eleusis by Genevieve Fairbrother is one-of-a-kind contemporary paranormal adventure novel that narrates a unique perspective on women and relationships using the life of one immortal woman moving through time. If you love losing track of time inside a Contemporary Paranormal adventure romance then order this book today!",
  "genres": [
    "Paranormal",
    "Young Adult",
    "Mythology",
    "Fantasy",
    "Romance",
    "Greek Mythology",
    "Paranormal Romance"
  ],
  "author": "Genevieve Fairbrother",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/17385795-eleusis"
}