{
  "title": "The Gardener's Song",
  "description": "On the stroke of seven, death annexed Mr. Rao…. Building has four floors and four flatss on each floor, making sixteen homes in all. Fifteen of these would thrill at the thought of something happening to Mr.Rao. Mr. Rao made it his business to know everybody and very soon all made it their business not to know him. In curiosity, Mr. Rao was a very Elephant's Child. \"Let but a fly fart in Building.\" Patherphaker said coarsely. \"Mr. Rao knows about it even before the fly does.\" Mr. Rao believed in the citizen's right to information. From him came the news thatg Mrs. Kamath's gynaecologist had refused to oblige with a fifth abortion, from him why Ramachandran's daughter's wedding was precipitately called off, from him the story behind Patherphaker's premature retirement and from him too the truth about Kumudben's nervous breakdown. Then, just as Building decided something must be done about it. Mr. Rao died, upsetting them all. On the stroke of seven, death annexed Mr. Rao…. Building has four floors and four flatss on each floor, making sixteen homes in all. Fifteen of these would thrill at the thought of something happening to Mr.Rao. Mr. Rao made it his business to know everybody and very soon all made it their business not to know him. In curiosity, Mr. Rao was a very Elephant's Child. \"Let but a fly fart in Building.\" Patherphaker said coarsely. \"Mr. Rao knows about it even before the fly does.\" Mr. Rao believed in the citizen's right to information. From him came the news thatg Mrs. Kamath's gynaecologist had refused to oblige with a fifth abortion, from him why Ramachandran's daughter's wedding was precipitately called off, from him the story behind Patherphaker's premature retirement and from him too the truth about Kumudben's nervous breakdown. Then, just as Building decided something must be done about it. Mr. Rao died, upsetting them all.",
  "genres": [],
  "author": "Kalpana Swaminathan",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/1738717.The_Gardener_s_Song"
}