{
  "title": "A Diary of Greed and Lust",
  "description": "Book 1:One summer evening Juliane lands in the arms of her husband’s best friend. This relationship drives her to new heights of sensuality beyond her wildest imagination. Still, their affair remains a casual relation because she doesn’t want to abandon her husband. Ironically, Daniel moves to another city shortly thereafter to pursue his career ambitions. Their weekend-marriage life does not last long because Juliane’s husband follows his professional calling and leaves for the USA. Juliane is dumbfounded and lonesome. Nightmares torment her and demons from her childhood start taking control of her subconsciousness. Again, Juliane jumps into a relationship with a significantly older gentleman, a university professor, in the hope of satisfying her desires for closeness and comfort. However, their amorous encounter fell victim to the man’s need for exceptional and freaky desires. Still, the seed was sown for her to become easy prey for pimps who already wait in ambush. The Julie’s Passion TrilogyThis is a novel about the temptations of sensuality, but it also narrates the intimate feelings, the yearning and quest for love of a young woman. Some say it’s a romance, other say, it isn’t.Whoever enjoyed '50 Shades of Grey', 'Scandalous' or the 'This Man' trilogy might fall in love with the erotic tension in this book as well.Due to sexual content and the subject matter, this book is intended for ages 18+It is tale about a man and a woman who try to find their role in life – sharing some common denominators: sensuality paired with the desire to succeed. But they are only to learn, in the course of their marriage, that this volatility of excitement was and will not be sufficient. Daniel is a conventional fellow who focuses on his career in the world of technology. Juliane, on the other hand, sees her marriage slipping away – no longer can she cope with her husband’s demands for sexual promiscuity to further his chances in his career; nor is she willing to further succumb to those ideas.For many people, Juliane is considered a vixen – young, vibrant and blessed with her good looks. Only a few know that when men and women alike feel being physically attracted to her, it is recognition, self-affirmation and testimonial for her as a woman. Sex fulfills her needs and becomes her language of communication – perhaps a substitute for ‘normal’ communication that she has not mastered yet. Her desire for comfort and closeness remains often unanswered, thus she must pay a high price for the path she has chosen.Despite several relationships before her marriage, the young student Juliane is still a novice in matters of love. One day she stumbles into an affair with her husband’s best friend and this is the prelude to a rather erotic, but also crazy, story that will run her into great perils and wicked complications.Her husband abandons her temporarily for a trip overseas. In her longing for comfort and partnership, she enters into yet another affair with an older gentleman. Little did she know that she has fallen victim to the man’s egotistical intentions. He uses her for his purposes and personal advantages. Sooner than later, Juliane ends up in California. This is where her life turns out to be as risky as back home, as she becomes entangled in a real case of murder.Months later Juliane returns to her homeland – by herself – where she considered herself to be safe in the company of a former lover. But that turns out to be the wrong conclusion. Lo and behold, she needs to fight for her life and her freedom again.One summer evening Juliane lands in the arms of her husband’s best friend. This relationship drives her to new heights of sensuality beyond her wildest imagination. Still, their affair remains a casual relation because she doesn’t want to abandon her husband. Ironically, Daniel moves to another city shortly thereafter to pursue his career ambitions. Their weekend-marriage life does not last long because Juliane’s husband follows his professional calling and leaves for the USA. Juliane is dumbfounded and lonesome. Nightmares torment her and demons from her childhood start taking control of her subconsciousness. Again, Juliane jumps into a relationship with a significantly older gentleman, a university professor, in the hope of satisfying her desires for closeness and comfort. However, their amorous encounter fell victim to the man’s need for exceptional and freaky desires. Still, the seed was sown for her to become easy prey for pimps who already wait in ambush.",
  "genres": [
    "Erotica"
  ],
  "author": "Elia Mirca",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/17388122-a-diary-of-greed-and-lust"
}