{
  "title": "The Village Sang to the Sea:  A Memoir of Magic",
  "description": "During the Cold War a 15-year-old American boy, Brad Lattimer, moves with his family to a fishing village in Northern Italy. It's no ordinary village, but Brad is welcomed like a long-lost cousin. His teacher is a gentle hunchback with a lisp who is more than he seems. There are witches in the olive groves who will poison your cat, but not for the reasons you imagine. In those groves there is a village so small it shouldn't be a village, its red doorways too short for normal men and women to pass through easily. At night, on its single narrow cobble street, creatures that should not exist walk while a single baby cries forever. On the sands of the next cove sits a pale, pretty girl who somehow knows the poetry of the great Romantic poet Percy Bysshe Shelley and wants you to drown with her, just as Percy drowned near this village over a century ago. This is the village where Mary Shelley may have dreamed her dream that became Frankenstein. It is certainly the village where Brad, too, will start to dream strange dreams and write his own first stories; where he will fall sick because the village's magic has its hold on him, wanting him to become something other than a boy--something that can never leave it--something it can have as its own for eternity. What people are saying about this book:\"The Village Sang to the Sea is a uniquely haunting book. It's quite simply a beauty.”--Peter S. Beagle, World Fantasy Lifetime Achievement winner and author of The Last Unicorn \"The Village Sang to the Sea is that rarity: a book that delicately and perfectly captures the magic we all know underlies the world. You will not forget this book. Not ever.\" --Nancy Kress, Hugo and Nebula awards winner\"A magnificent reading experience, shimmering and vital, at once otherworldly and naturalistic, that recalls such fine ancestors as Ray Bradbury's Dandelion Wine and Jeffrey Ford's The Shadow Year.--Paul Di Filippo, Locus Online\"The Village Sang to the Sea: A Memoir of Magic is just what its sub-title promises: magic. --James P. Blaylock, World Fantasy Award winner \"Bruce McAllister's gorgeous new novel is magical realism at its very best. I loved it.”--Terri Windling, co-editor of the The Year's Best Fantasy and Horror series\"In our early years we all believe and trust in endless possibilities. Most of us soon leave this realm, though some of us return from time to time. If we call it merely 'imagination,' we don't reach the truly magical. The Village Sang to the Sea: A Memoir of Magic got me there. It's delightful.\"--Ron Arias, National Book Award nominee",
  "genres": [
    "Fantasy",
    "Witches",
    "Fiction",
    "Short Stories",
    "Science Fiction Fantasy",
    "Science Fiction",
    "Magic"
  ],
  "author": "Bruce McAllister",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/17395232-the-village-sang-to-the-sea"
}