{
  "title": "Truly, Madly, Deeply",
  "description": "Sparks fly when a lovelorn romance novelist and a divorce lawyer who has sworn off relationships agree to cohost a podcast series offering dating advice to viewers, in Truly, Madly, Deeply, the next steamy queer rom-com from Lambda Literary Award winner and national bestselling author Alexandria Bellefleur.As a bestselling romance novelist, everyone thinks Truly Livingston is an expert on happily-ever-afters. She’s even signed on to record a podcast sharing relationship advice. Little do they know she feels like an imposter—her parents just announced they’re separating, she caught her fiancé cheating, and her entire view on love has been shaken to the core. Truly hopes the podcast will distract her... until she meets her cohost.Her first impression of Colin McCory is...hot. But then he opens his extremely kissable mouth. Colin’s view on love just pisses Truly off, even if he does have an annoyingly attractive face. Bickering with a cynical divorce lawyer is the last thing she needs—so she walks out, with no plans to return.A few days later, Truly is surprised when Colin tracks her down, asking for a fresh start. Truly can’t deny the little thrill she gets from Colin begging, so she reluctantly agrees. As they go from enemies to friends to something else entirely, Truly discovers they have more in common than she ever imagined, including their shared queerness. He’s a genuinely good guy—charming, sweet, and equally as unlucky in love as herself—and there’s something about Colin that drives Truly a little wild. When their attraction reaches a fever pitch, Truly is happy for the first time in years. Yet she can’t help but wonder... is Colin truly, madly, deeply in love with her? Or is it all too good to be true?",
  "genres": [
    "Romance",
    "LGBT",
    "Contemporary",
    "Contemporary Romance",
    "Queer",
    "Audiobook",
    "Adult"
  ],
  "author": "Alexandria Bellefleur",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/173957959-truly-madly-deeply"
}