{
  "title": "The Homesick Texan Cookbook",
  "description": "When Lisa Fain, a seventh-generation Texan, moved to New York City, she missed the big sky, the bluebonnets in spring, Friday night football, and her family's farm. But most of all, she missed the foods she'd grown up with.After a fruitless search for tastes of Texas in New York City, Fain took matters into her own hands. She headed into the kitchen to cook for her friends the Tex-Mex, the chili, and the country comfort dishes that reminded her of home. From cheese enchiladas drowning in chili gravy to chicken-fried steak served with cream gravy on the side, from warm bowls of chile con queso to big pots of fiery chili made without beans, Fain re-created the wonderful tastes of Texas she'd always enjoyed at potlucks, church suppers, and backyard barbecues back home.In 2006, Fain started the blog Homesick Texan to share Texan food with fellow expatriates, and the site immediately connected with readers worldwide, Texan and non-Texan alike. Now, in her long-awaited first cookbook, Fain brings the comfort of Texan home cooking to you.Like Texas itself, the recipes in this book are varied and diverse, all filled with Fain's signature twists. There's Salpicón, a cool shredded beef salad found along the sunny border in El Paso; Soft Cheese Tacos, a creamy plate unique to Dallas; and Houston-Style Green Salsa, an avocado and tomatillo salsa that is smooth, refreshing, and bright. There are also nibbles, such as Chipotle Pimento Cheese and Tomatillo Jalapeno Jam; sweet endings, such as Coconut Tres Leches Cake and Mexican Chocolate Chewies; and fresh takes on Texan classics, such as Coffee-Chipotle Oven Brisket, Ancho Cream Corn, and Guajillo-Chile Fish Tacos.With more than 125 recipes, The Homesick Texan offers a true taste of the Lone Star State. So pull up a chair-everyone's welcome at the Texas table!",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction",
    "Reference",
    "Foodie",
    "Southern"
  ],
  "author": "Lisa Fain",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/10792142-the-homesick-texan-cookbook"
}