{
  "title": "Arbitrate",
  "description": "Available on Amazon now.It's one year later. Everything has changed.Remember The Second Chance Institute (SCI). Earth's benevolent non-profit by day, Thera's totalitarian regime by night. They’ve stepped up their game on Earth and on Thera—infiltrating political parties, preying on the downtrodden, and planning offensive maneuvers. And they’re handing out more “second chances” than ever before. The SCI’s abuse of their charter leads to Arbiter oversight and bitter consequences.Remember Kira Donovan. Broken, burdened, and evading those who wish her harm, Kira enlists the Arbiters’ help when forced to return to the clutches of the SCI and her angry, estranged love.Remember Blake Sundry. Exiled, determined, and packing an agenda, Blake seeks assistance on Earth and Thera to use his newfound knowledge to bring down the SCI.Remember Ethan Darcton. Overworked, emotional, and holding a grudge, Ethan hunts down his stolen property, but finds himself in awkward territory, stuck between the Arbiters and the SCI.Full of action, competing agendas, romantic entanglements, humor, twists and turns, arbitrate is book #2 in the award-winning, bestselling daynight series.Note that there is final resolution to Kira's romantic dilemma in arbitrate.Praise for daynight2012 Book of the Year Award Finalist-Young Adult Fiction, ForeWord Reviews\"Sure to win over YA readers looking for a dangerous, dystopian adventure story\" —Kirkus Reviews\"Gripping young adult dystopian novel; compelling conflicts; high stakes; powerful narrative; surprises keep coming; strong writing; page-turner; engaging characters; Readers will be hungry for the sequels.”—BlueInk Review (starred review)\"Thomason's description of Thera's totalitarianism will make fans of Brave New World shiver... SCI, her fantasy corporation, has disturbing parallels to actual companies and regimes that claim to do good while harming people... The author deftly appeals to both romance-loving teens as well as those intrigued by young adults fighting the establishment.”—ForeWord Clarion Review, 4 stars",
  "genres": [
    "Dystopia",
    "Young Adult",
    "Science Fiction",
    "Fiction",
    "Fantasy",
    "Suspense",
    "Romance"
  ],
  "author": "Megan Thomason",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/17401137-arbitrate"
}