{
  "title": "Jefferson's Isaac: From Monticello to Petersburg",
  "description": "Jefferson's From Monticello to Petersburg tells the comprehensive story of Isaac (Granger) Jefferson.It significantly expands upon where the Memoirs of a Monticello Slave as verbalized by Isaac to Charles Campbell, in the 1840's incomplete effort left off. The reader gains a new insight of the character of this gentleman some called Jefferson's Isaac all his life. Others just called him Isaac, a few called him, \"my husband,\" \"dad,\" or \"friend.\"Isaac was born a slave in 1775 at Thomas Jefferson's Monticello. Jefferson's Isaac permits the reader to trace his life from Monticello, to Philadelphia, and back to Monticello and Shadwell, to his marriage to Iris, their children, and their subsequent gift to Jefferson's daughter, Maria and her husband John Wayles Eppes, and their time at Eppington, in Chesterfield County, Virginia. Eppes was elected as a Democratic-Republican to the Eighth United States Congress from Virginia and the next three succeeding Congresses.Isaac Jefferson (Granger) died in Petersburg in the spring of 1846 a \"Free Person of Color.\" Isaac's story helps us unsheathe how an enslaved African-American lived in the midst of some of the greatest figures in American history. It's also a story of basic survival.Discover how Isaac came to Petersburg and who gave Isaac his manumission and freedom...-You'll learn some new insights into the character of this man.-As well as, why he brought a white Petersburg stonemason into court and how his case was finally resolved.-How he sustained a family, a business, in a very different world from that which he was born into; once upon a time, on that cold hilltop, called Monticello.Isaac leaves behind no marker or monument in the city where he worked, paid taxes, and perished.Foreword written by William C. McDonald, PhD, of Charlottesville, VirginiaMichael D'Antonio, author of the Wall Street's acclaimed A Full Sir Thomas Lipton's Extraordinary Life and His Quest for the America's Cup , A Ball a Dog and Monkey and Forever Blue , says \"Seagrave is truly a historian's historian.\"",
  "genres": [],
  "author": "Ronald Roy Seagrave",
  "average_rating": "4.86",
  "url": "https://www.goodreads.com/book/show/10792223-jefferson-s-isaac"
}