{
  "title": "Keeping My Hope",
  "description": "KEEPING MY HOPE, a historical fiction graphic novel written by 14 year old Christopher Huh, talks about the life of a young teenage boy named Ari Kolodiejski, who is caught in the horrors of the Final Solution. Now as a parent and grandparent, he tells his life story to his grandchildren. After surviving the world's most deadliest camp, he hopes to pass on his life legacy to his family.Ari is a strong and courageous teen who must battle for his life throughout the second world war. Ari is forever scarred from his deep past. Despite being kept prisoner at the Auschwitz Birkenau concentration camp, seeing the untimely death of hundreds, and forced to endure unbearable conditions in lice infested clothing, Ari keeps his friends close and struggles to live. Throughout his stay in the camp, he meets two inmates who both stand along with him, trying to help as often as they can. Friendship and belief is all they have left, in which the Nazis and the war strip away from the trio and ultimately brings the devastating disaster that awaits. When Ari and his two friends are slowing down in a death march during a blizzard and his friend has frostbite, Ari still helps his friend despite an SS guard approaching them with a pistol. He even claims that \"carrying Saul was a challenge\" (page 149), but does not want to leave him in the snow, knowing the fate his friend would face.He tries to help and aid his fellow camp inmates whenever possible. During at his stay at Auschwitz III, everyone fears one Kapo guard who is known for being a sadist on the prisoners with a rubber truncheon. Ari not only stands up against the Kapo, he even goes to the point of scaring him too. The guard showed \"in his eyes...he was confused, maybe even fearful. Almost as if he was the beaten victim\" (page 104). No matter what consequences are to come, he always gives his best effort in order to make a situation better. Throwing himself into the line of fire while no one else would is the shocking reality that made those like Ari from ordinary people to heroes.A true friend and strong Samaritan, Ari Kolodiejski is a person who is stuck with the ability to make anyone into being a friend with him. After his liberation of six years of terror, he tries to rebuild his life to replace the one he lost a lifetime ago. With his family's history stored safely in the minds of his grandchildren, he can now preserve his memories for his great-grandchildren and their children to remember. KEEPING MY HOPE is an excellent book, and an even better one with the character of Ari.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Young Adult",
    "Poland",
    "Graphic Novels",
    "World War II",
    "Holocaust"
  ],
  "author": "Christopher Huh",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/17401967-keeping-my-hope"
}