{
  "title": "Master Gardener - A novel about gardening, agribusiness, politics, love and Wylie Cypher",
  "description": "Please be aware, this is a novel - not a gardening book! However, there are some excellent gardening tips offered by one of the heroines, Bitsy Crangle, in her monthly gardening newsletter. Mainly, though, this is about what happens to our environment through the unregulated development and use of genetically engineered seeds and the chemicals involved in their use. But it is not a polemic; the story is told with humor and appreciation for volunteer groups everywhere.The following questions (and others) are answered in the novel.What happens when a Master Gardener innocently plants packets of magical seeds from the Peruvian Amazon in experimental plots operated by New Anglia’s agricultural college? Why does Bemis International Group, Agricultural Chemicals Division (BIG AG) feel so threatened by the plants those seeds produce? What is the mysterious eco-terrorism group doing to save the monarch butterfly?Best selling amazon.com author Rolf Margenau revisits the twenty-year-old hero of Public Information, Wylie Cypher, in his seventy-fifth year. He is a volunteer Master Gardener and is involved with four women plus Emma, his Weimaraner. One of those women is responsible for the plants that threaten to destabilize the comfortable world of seeds genetically engineered to withstand potent weed killers. Another is Wylie’s bitter ex-wife. The third is a granddaughter who lives with him as she completes law school and the fourth, Linda, is his former nurse who gives new meaning to septuagenarians living in sin.Wylie has had a career as an international attorney. He employs his negotiating and legal skills with varying degrees of success in resolving numerous challenges that arise during the fourteen-month period of the story. Mainly, he tries to save fellow Master Gardener Anne Proctor from ruin at the hands of BIG AG. In doing so, he leads an expedition to the jungles of the Peruvian Amazon to search for magic beans, corn and wheat. Elizabeth Pendleton Crangle (“Bitsy”) is an unlikely eco-terrorist whose monthly newspaper column offers timely gardening advice at the beginning of each chapter. Her guidance is spot on, but she does have a bit of an attitude. Gardeners will appreciate her suggestions that, as Bitsy says, will guarantee blissful gardening.Dick Geier, the ruthless and profane CEO of BIG AG, engages in corporate shenanigans that reflect current headlines. Among other things, he manages a program that infiltrates Master Gardener organizations throughout the country, and finds new and unethical ways to enrich himself and his cronies. The author tells the story with sharp insight and ribald humor. Gimlet prose enlivens the lawyers, tycoons, politicians, young and old lovers, windbags and adventurers who populate his story. The characters interact in Dickensian fashion, and most of them receive their just deserts. WARNING: This story may be unsuitable for politicians, corporate bigwigs, pundits and the like who might easily be offended by truth telling.",
  "genres": [
    "Gardening",
    "Fiction"
  ],
  "author": "Rolf Margenau",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/17402143-master-gardener---a-novel-about-gardening-agribusiness-politics-love"
}