{
  "title": "The tudor brief-part1: Henry VII and Henry VIII",
  "description": "Are you embarrassed by your lack of knowledge of history?Did you forget everything you learnt at school?Did you ever wish you knew a little more so you can join the conversations or help with the homework? If so, “The Brief” series are for you.“The Brief” books are short history books that give you all the facts, without the waffle and you can read them all within an hour.The Tudor Brief Part 1 – Henry VII and Henry VIIIThe Tudors are the most famous family ever to sit on the throne of England. This book tells the story of the first two Tudor monarchs, Henry VII and the infamous Henry VIII.Quite simply if the story of the Tudors was fiction you wouldn’t believe it. However it’s all true. Battle, love, anger, betrayal, death and sex fill the pages of history when the Tudors were on the throne.Henry Tudor grew up on the losing side in the Wars of the Roses. However, he had his own ambitions for the throne and at Bosworth Field he fulfilled his dream. He united the country by marrying the Princess of the House of York, shoring up his own weak claim to the throne in the process. He managed to build the financial strength of the country with a prudent system of taxation policies. He defeated rebellion and distrust. However he suffered personal tragedy as the sweating sickness swept throughout England killing thousands. There was even a hint scandal in the air as he seriously considered marrying his son’s teenage widow.His second son, Henry, succeeded him as Henry VIII. Henry VIII is probably the most famous of all English kings, due to his stature, ruthless nature and eye for the ladies. Henry VIII was constantly seeking a son to ensure the Tudor line and it was this that drove him to marry six times, behead two of his wives and divorce two more. If his wives couldn’t give him a son then maybe a mistress could; Henry went through his fair share.In his attempts to divorce his first wife Catherine of Aragon in order to marry Anne Boleyn, Henry VIII broke from Rome and made himself Supreme Head of the Church of England. The English Reformation had begun. In the years that followed, Henry systematically closed every single religious house in England, taking the wealth and land for the crown.After likening his fourth wife to a horse, Henry VIII began his seduction of a teenage temptress; Catherine Howard. Catherine didn’t stick to the rules of the game and started to play away from the king’s bedroom. A mistake that cost her and her lovers their heads.In his later years Henry VIII grew into the extreme monster we all remember and yet the most famous king in English history lay in an unmarked grave for more than 300 years.This “brief” book tells the first half of the Tudor tale, all within an hour.",
  "genres": [],
  "author": "Carol Derbyshire",
  "average_rating": "3.40",
  "url": "https://www.goodreads.com/book/show/17402824-the-tudor-brief-part1"
}