{
  "title": "The Five Orange Pips",
  "description": "Sherlock Holmes, the world's 'only unofficial consulting detective', was first introduced to readers in \"A Study in Scarlet\" introduced by Sir Arthur Conan Doyle in 1887. It was with the publication of \"The Adventures of Sherlock Holmes,\" however, that the master sleuth grew tremendously in popularity, later to become one of the most beloved literary characters of all time.In \"The Five Orange Pips,\" one of the short stories in \"Adventures ..,\" John Openshaw visits Baker Street to consult Sherlock Holmes as to the mysterious deaths of both his uncle and father upon the arrival of letters containing only five dried orange pips and an envelope mark 'K.K.K.'. The young gentleman further relates that he too has received a similar envelope with instructions to surrender some papers. Holmes quickly deduces that his client faces imminent danger from a secret society in America.The short stories comprising \"The Adventures of Sherlock Holmes\" have been amusingly illustrated using only Lego® brand minifigures and bricks. The illustrations recreate, through custom designed Lego models, the composition of the black and white drawings by Sidney Paget that accompanied the original publication of these adventures appearing in \"The Strand Magazine\" from July 1891 to June 1892. Paget's iconic illustrations are largely responsible for the popular image of Sherlock Holmes, including his deerstalker cap and Inverness cape, details never mentioned in the writings of Conan Doyle. This uniquely illustrated collection, which features some of the most famous and enjoyable cases investigated by Sherlock Holmes and his devoted friend and biographer Dr. John H. Watson, including \"A Scandal in Bohemia\" and \"The Red-Headed League,\" is sure to delight Lego enthusiasts, as well as fans of the Great Detective, both old and new.Librarian's note: this entry relates to the story, \"The Five Orange Pips.\" Collections of short stories, including the entry for \"The Adventures of Sherlock Holmes\" can be found elsewhere on Goodreads.",
  "genres": [
    "Mystery",
    "Classics",
    "Short Stories",
    "Fiction",
    "Crime",
    "Audiobook",
    "Detective"
  ],
  "author": "Arthur Conan Doyle",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/1740633.The_Five_Orange_Pips"
}