{
  "title": "How to Be Compassionate: a Handbook for Creating Inner Peace and a Happier World",
  "description": "Each one of us is responsible for all of humankind, and for the environment in which we live. . . . We must seek to lessen the suffering of others. Rather than working solely to acquire wealth, we need to do something meaningful, something seriously directed toward the welfare of humanity as a whole. To do this, you need to recognize that the whole world is part of you. —from How to Be Compassionate The surest path to true happiness lies in being intimately concerned with the welfare of others. Or, as His Holiness the Dalai Lama would say, in compassion. In How to Be Compassionate, His Holiness reveals basic mistakes of attitude that lead us to inner turmoil, and how we can correct them to achieve a better tomorrow. He demonstrates precisely how opening our hearts and minds to other people is the best way to overcome the misguided ideas that are at the root of all our problems. He shows us how compassion can be a continuous wellspring of happiness in our own lives and how our newfound happiness can extend outward from us in ever wider and wider circles. As we become more compassionate human beings, our friends, family, neighbors, loved ones—and even our enemies—will find themselves less frequently in the thrall of destructive emotions like anger, jealousy, and fear, prompting them to become more warmhearted, kind, and harmonious forces within their own circles. With simple language and startling clarity, His Holiness makes evident as never before that the path to global harmony begins in the hearts of individual women and men. Enlivened by personal anecdotes and intimate accounts of the Dalai Lama’s experiences as a student, thinker, political leader, and Nobel Peace Prize Laureate, How to Be Compassionate gives seekers of all faiths the keys to overcoming anger, hatred, and selfishness— the primary obstacles to happiness—and to becoming agents of positive transformation in our communities and the world at large.",
  "genres": [
    "Nonfiction",
    "Buddhism",
    "Spirituality",
    "Philosophy",
    "Religion",
    "Self Help",
    "Audiobook"
  ],
  "author": "Dalai Lama XIV",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/10793510-how-to-be-compassionate"
}