{
  "title": "Offside",
  "description": "A pace ahead of the play can send you back to the start. And put everything you’ve worked for at risk.Single mother and submissive Rebecca Bower abandoned her career as a sports reporter to become a media consultant with her brother’s hockey team. A failed marriage to a selfish man makes her wary of getting involved with another. Unfortunately, chemistry is hard to deny, and all her hormones are dancing when she gets close to the Cobra’s sniper, Scott Demyan. Zachary Pearce ‘came out’ to the world last season to shift attention away from a teammate. And his one night with Scott Demyan had been unsettling. There could be more there, if only Scott was a different person. Instead, a night of sensual BDSM play with Becky leaves him wanting more, but she thinks he’s gay and questions his interest. It’s been a long time since a woman has attracted him both as a man and a Dom, and he’ll do everything in his power to prove she’s the only one he needs. Or wants. His one time with Scott was a mistake.Scott might have forgotten what happened in his childhood, but the effects linger, and he specializes in drunken one-night stands…until he meets Zach and Becky and sees what he’s missing. But neither one believes Scott can be faithful. Although he’s trying hard to clean up his act to avoid getting kicked off the team, they want more from him. He’s willing to make changes, but the most important one—putting their happiness before his own—means he’ll probably end up alone.WarningThis e-book contains material not suitable for readers under 18. It also contains scenes that some may find objectionable, including BDSM, ménage sex, bondage, anal sex, sex toys, and one man erroneously labeled as vanilla. Author strongly advises care be taken when using ladders and gym equipment in ways other than originally intended. And sex on cruise ships whenever possible. The author advises that as well.",
  "genres": [
    "BDSM",
    "Erotica",
    "Sports",
    "Romance",
    "M M F",
    "Hockey",
    "Contemporary"
  ],
  "author": "Bianca Sommerland",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/17407756-offside"
}