{
  "title": "The Bear Comes Home",
  "description": "As Rafi Zabor's PEN-Faulkner Award-winning novel opens, the Bear shuffles and jigs with a chain through his nose, rolling in the gutter, letting his partner wrestle him to the ground for the crowd's enjoyment. But as soon becomes clear, this is no ordinary dancing bear. \"I mean, dance is all right, even street dance. It's the poetry of the body, flesh aspiring to grace or inviting the spirit in to visit,\" he muses, but before all else, the Bear's heart belongs to jazz. This is, in fact, one alto-sax-playing, Shakespeare-allusion-dropping, mystically inclined Bear, and he's finally fed up with passing the hat. One night he sneaks out to a jazz club and joins a jam session. On the strength of the next day's write-up in the Village Voice, the Bear begins to play around town and hobnob with some of jazz's real-life greats. A live album, a police raid, a jailbreak, a cross-country tour, and no small amount of fame later, Bear finds himself in love with a human woman -- and staring down the greatest improbability of all.Admittedly, a novel about a talking, sax-blowing bear may not initially seem everyone's cup of tea, but Zabor's Bear is no cuddly anthropomorph: \"I may be wearing a hat and a raincoat, thought the Bear, but no one's gonna mistake me for Paddington.\" He lives, he suffers, he loves--in fact, the love scenes come as something of a shock, and not just for the usual interspecies reasons. Who knew that the description of a bear's reproductive mechanisms could be so tender or so unabashedly erotic? Most of all, though, The Bear Comes Home evokes the world of improvisational jazz with consummate skill; Zabor, a longtime jazz journalist and drummer, writes about music with a passion and inspiration seldom found on the printed page. A wistful fable about an artist's coming of age, a brilliantly satiric send-up of the music business and jazz criticism, The Bear Comes Home is a debut much like that of the Bear himself: transcendent, unexpected, wise.",
  "genres": [
    "Fiction",
    "Music",
    "Fantasy",
    "Novels",
    "Humor",
    "Magical Realism",
    "Jazz"
  ],
  "author": "Rafi Zabor",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/174089.The_Bear_Comes_Home"
}