{
  "title": "Dragões de Éter",
  "description": "= Caçadores de Bruxas: Nova Ether é um mundo protegido por poderosos avatares em forma de fadas-amazonas. Um dia, porém, cansadas das falhas dos seres racionais, algumas delas se voltam contra as antigas raças. E assim nasce a Era Antiga. Essa influência e esse temor sobre a humanidade só têm fim quando Primo Branford, o filho de um moleiro, reúne o que são hoje os heróis mais conhecidos do mundo e lidera a histórica e violenta Caçada de Bruxas. Primo Branford é hoje o Rei de Arzallum, e por 20 anos saboreia, satisfeito, a Paz. Nos últimos anos, entretanto, coisas estranhas começam a acontecer... Uma menina vê a própria avó ser devorada por um lobo marcado com magia negra. Dois irmãos comem estilhaços de vidro como se fossem passas silvestres e bebem água barrenta como se fosse suco, envolvidos pela magia escura de uma antiga bruxa canibal. O navio do mercenário mais sanguinário do mundo, o mesmo que acreditavam já estar morto e esquecido, retorna dos mares com um obscuro e ainda pior sucessor. E duas sociedades criminosas entram em guerra, dando início a uma intriga que irá mexer em profundos e tristes mistérios da família real. = Corações de Neve: Nova Ether é um mundo protegido por poderosos avatares em forma de fadas-amazonas. Um dia, porém, cansadas das falhas dos seres racionais, algumas delas se voltaram contra as antigas raças. E assim nasceu a Era Antiga. Hoje, Arzallum, o Maior dos Reinos, tem um novo rei, e a esperada Era Nova se inicia. Entretanto, coisas estranhas continuam a acontecer... Uma adolescente desenvolve uma iniciação mística proibida, despertando dons extraordinários que tocam nos dois lados da vida. Dois irmãos descobrem uma ligação de família com antigos laços de magia negra, que lhes são cobrados. Duas antigas sociedades secretas que deveriam estar exterminadas renascem como uma única, extremamente furiosa. Após duas décadas preso e prestes a completar 40 anos, um ex-prisioneiro reconhecido mundialmente pelas ideias de rebeldia e divisão justa dos bens roubados de ricos entre pobres é libertado, desenterrando velhas feridas, ressentimentos entre monarcas e canções de guerra perigosas. O último príncipe de Arzallum resgata sombrios segredos familiares e enfrenta o torneio de pugilismo mais famoso do mundo, despertando na jornada poderosas forças malignas e benignas além de seu controle e compreensão. E a tecnologia do Oriente chega de maneira devastadora ao Grande Paço, dando início a um processo que irá unir magia e ciência, modificando todo o conhecimento científico que o Ocidente imaginava possuir. E o mundo mudará. Mais uma vez. = Círculos de Chuva: Nova Ether é um mundo protegido por poderosos avatares em forma de fadas-amazonas. Um dia, porém, cansadas das falhas dos seres racionais, algumas delas se voltam contra as antigas raças. E assim nasce a Era Antiga. Hoje, Arzallum, o Maior dos Reinos, tem um novo Rei e vive a esperada Era Nova. Coisas estranhas, entretanto, nunca param de acontecer... Dois irmãos sobreviventes a uma ligação com antigos laços de magia negra descobrem que laços dessa natureza não se rompem tão facilmente e cobram partes da alma como preço. Uma sociedade secreta renascida com um exército de órfãos resolve seguir em frente em um plano com tudo para dar errado em busca do maior tesouro já enterrado, sem saber o quanto isso pode mudar a humanidade. O último príncipe de Arzallum viaja para um casamento forçado em uma terra que ele nem mesmo sabe se é possível existir, disposto a realizar um feito que ele não sabe se é possível realizar. Uma adolescente desperta em iniciações espirituais descobre-se uma mediadora com forças além do imaginário...",
  "genres": [],
  "author": "Raphael Draccon",
  "average_rating": "4.62",
  "url": "https://www.goodreads.com/book/show/17408923-drag-es-de-ter"
}