{
  "title": "Ruling Planets: Your Astrological Guide to Life's Ups and Downs",
  "description": "Centuries ago, a king wouldn't think of going to war without first consulting the planets. A physician, upon hearing that a patient had fallen ill, would immediately check the placement of the planets to diagnose the disease and decide how best to treat it. Nowadays, people tend to identify with their zodiac sign rather than with their Planet. Each of us is born under a specific Ruling Planet. Your Ruling Planet is your celestial guide, helping you to navigate your way through life and relationships. Unlike zodiac signs, which are static, planets are in constant motion, changing as you change. Here is the first book to draw on this older and more illuminating tradition. In Ruling Planets Christopher Renstrom shows you how your Ruling Planet plays a collaborative role in nearly every decision you make. It's this active partnership between person and Planet that is missing from today's astrology books. The book is divided into four parts. Part I contains the tables you'll need to find your Ruling Planet. All you have to know is the day and year you were born. In Part II, you learn about your Planet's characteristics, temperament, and outlook and how you are, in effect, a \"Child\" of this Planet. Because not everyone was born at the same time, the zodiac sign that your Ruling Planet was in on your birthday will color certain traits. Part III presents a detailed and personalized view of you, along with favorable-and not so favorable -- times of year. Part IV examines how a Child of one Ruling Planet gets along with a Child of another. These entertaining and thought-provoking insights cover the relationship gamut, from love interests to parents to children to colleagues. Want to know if a relationship has romantic possibilities or if you should just be friends? Check and see which Ruling Planets are involved. What do you do if you got off on the wrong foot with your new boss? A quick glance at his or her Ruling Planet can show you how to finesse a setback into an advance. Ruling Planets will give you a fresh and relevant way of looking at the cosmos and your life. Lushly illustrated with full-color art and photos throughout, Ruling Planets also presents a visual tour that winds its way through myth, history, and popular culture. You'll see your Planet's influence in everything from church frescoes to ad campaigns. You'll also meet some famous (and even infamous) Children of your Planet who will make you question familiar assumptions while expanding your point of view. Whether you are a die-hard astrology fan or an inquisitive skeptic, Ruling Planets will tickle your curiosity and intrigue your imagination. You will return to it again and again, gleaning new information each time.",
  "genres": [
    "Astrology",
    "Reference",
    "New Age"
  ],
  "author": "Christopher Renstrom",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/1741121.Ruling_Planets"
}