{
  "title": "Lightning Rider",
  "description": "For Evy Rivera, thunderstorms have always caused her physical pain, but she's never known why. When a record-setting storm arrives on the same night her father finds ancient ancestral documents, Evy is set aglow with mysterious tiny lightnings she can command. Even worse, she alerts some people in the universe who've been looking for her family for a very long time. Thrown back into ancient Spain and tasked with killing a Spanish legend, she must train alongside Constantine, a sexy yet obstinate Roman warrior. He teaches her how to wield her lightning as a weapon, through more errors than trials. With a relationship as explosive as their late-night training sessions, Evy and Constantine battle their push-pull relationship while trying to ignore the two-thousand-year difference in their birthdates. Ilif Rotiart, her quasi-mentor, is appalled at Evy's skill. He would prefer to train her father and keep Evy on the sidelines—where women belong. Evy has a feeling Ilif is keeping something from them, but she must play nice until she uncovers the truth. And if he's lying, it will be the worst day of his four-hundred-year life. Penya Sepadas claims she's Evy's rightful trainer, and she has the prophecy to prove it. Penya doesn't share Ilif's misogynistic attitude, but she does have her own agenda...and her own secrets. Evy must sort through the lies and find the truth behind her family's time-traveling past before the wrong history obliterates the future. She’s spent her whole life fighting for her place. Now, as the first female lightning rider, she'll dedicate her existence to fighting to save the world. But will Evy learn to manage her lightning and find the truth before it's too late?",
  "genres": [
    "Fantasy",
    "Time Travel",
    "New Adult",
    "Urban Fantasy",
    "Paranormal",
    "Romance",
    "Science Fiction"
  ],
  "author": "Jen Greyson",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/17412638-lightning-rider"
}