{
  "title": "Falling for the Backup",
  "description": "Toni Aleo’s sexy new eBook original novella featuring the Nashville Assassins will have you believing in the power of love at first sight . . . and second sight . . . and third.  After serving as a dutiful bridesmaid in the wedding from hell, Aynslee Shaw just wants to slink home to Nashville and forget the whole trip. That is until the hottest guy she’s ever seen is seated next to her on the flight and charms her with his easy laugh and killer smile. But just when she thinks things are getting good, he vanishes, leaving Aynslee wondering, was that guy the one? And did she just let him slip through her fingers?   Former superstar goalie Jordan Ryan is back on the ice—finally. After a crippling knee injury that had him wondering if he’d ever play pro hockey again, he’s got his full attention on rebuilding his career. So a pretty—okay, beautiful—girl on a plane shouldn’t be a distraction. But Jordan is very, very distracted. And when Aynslee crosses his path again, he’s not sure any job in the world is worth missing his second chance with a woman like her.  Praise for Toni Aleo’s Nashville Assassins romances  “Aleo melts the ice and hits it into the net with her Assassins series.”—Award-winning author Jami Davenport   “Taking Shots is really the whole package. You get romance, humor, steamy sex, drama, and then it all wraps up with a great conclusion. I am amazed that this is Toni’s first book. She has come out in a huge way. I can’t wait to read more from her. Don’t hesitate for a moment to grab this book.”—Guilty Pleasures Book Reviews   “A little steamy, a little heartbreaking, and a whole lot of fanning yourself are in order this time around, readers. Are your cheeks feeling a little pink yet? Get used to the feeling.”—Dreaming in the Pages, on Trying to Score   “Empty Net is an honest, heartwarming, endearing story. . . . Toni Aleo doesn’t just write a story. She gives you the ability to experience the journey of her characters right along with them. Her stories are enveloped with passion, emotion, humor, love; and let me tell you, that girl knows how to write a sex scene that just makes you sweat!”—Guilty Pleasures Book Review   “Sexy and riveting . . . the perfect combination of love and lust.”—USA Today bestselling author Heidi McLaughlin, on Blue Lines  Includes a special message from the editor, as well as an excerpt from the Loveswept title Empty Net.",
  "genres": [
    "Sports",
    "Romance",
    "Sports Romance",
    "Hockey",
    "Contemporary Romance",
    "Contemporary",
    "Novella"
  ],
  "author": "Toni Aleo",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/17413096-falling-for-the-backup"
}