{
  "title": "بداية جديدة",
  "description": "هذا كتيب صغير تستطيع أن تقرأه في ساعة من الزمان، ولكن تحتاج أن تتفكر فيه العمر كله، القصد منه ساعة تفكر قد تغير حياتك، فلا تبخل على نفسك بساعة من الزمن في التفكر. كل إنسان يسير في هذه الحياة... البعض متيقظ ومنتبه للوقت، والآخر غافل ساهٍ عنه، البعض توقظه الصدمات والبعض تزيده بعدا عن الطريق القويم، شاب أو فتاة لا يهم، كبير أم صغير لا يهم، كل لحظة من حياة الإنسان تذهب ولا تعود وهي رأس ماله الحقيقي، هي رصيده الجاري النافذ أو رصيده المدخر لعطلته الأخيرة فماذا نحن فاعلون ونحن مقبلون على عطلة طويلة ونهائية؟! وهي ليست كأي عطلة فالرجوع منها مستحيل والإقامة إما سعادة أبدية أو شقاء أبدي.. هذه ليست موعظة ولكنه نظام إنذار مبكر، ليس الموضوع متعلقا بالآخرة بل هو متعلق بالدنيا، فالحياة الطيبة للمؤمن تبدأ من الدنيا (رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ) هل تريد الصحة النفسية والبدنية والرزق والذرية والنجاح العملي؟ كل ذلك ممكن لو بدأت من هنا، لو استخدمت ذكاءك وما أودعه الله فيك من قدرات وغيرت قناعاتك، فالوعي أولا بضرورة التغير، والمسارعة بالتنفيذ. جاهد نفسك يهديك ربك الطريق، واعلم أن فرحه بك أشد من فرح أم ضاع منها وليدها فوجدته.اقرأ بتدبر وأعد القراءة لعلها لحظة الخير كله!والكتاب يقدم لك خارطة طريق متكاملة البناء، ستمر عليها سريعا وهي تقول لك:غيّر سلوكك بتغيير قناعاتك، وأعد نظرتك لله وللوجود وقومها، واعرف نفسك وما منحك الله من قدرات، وقف وقفة صراحة مع ذاتك، وستتجاوز العقبات الثلاث الكبرى: \"لا أستطيع\" و\"ماذا أُقدِّم؟\" و\"ما الفائدة؟\". عندها تكون جاهزاً لرحلتك السباعية والتي سألخصها لك في العبارات التالية: تيقظ وأعرني انتباهك، وافهم فالموضوع متعلق بك أنت، وانتم لرؤية ومجموعة تعينك على تحقيق ذاتك، وتبنَّ فكرا نهضويا يرفعك ويرفع أمتك معك، وكن أنت مشروعا جديدا لحياة جديدة، وتواصل مع العاملين مثلك في طريق النهضة، وشارك في المناشط المختلفة ولا تتخلف، هذه خارطة الطريق لك فاقرأها.-----الكتاب يُعنى لمن يريد أن يجعل لحياته معنى وهدف يسعى لتحقيقه وهو يتطرق لمواضيع رئيسة مثل ممكنات الإنسان وإطلاقها، منطلقاً من مشروع النهضة الذي يشرف عليه الدكتور جاسم.يتناول الدكتور المبررات التي تتداول على ألسنة الناس ناقداً ومصححاً لها في سبيل الوصول لقناعات فكرية صحيحة إتجاه الحياة تتحول إلى سلوك وبسلوك الشخص نحو النجاح في الحياة وعمارة الأرض التي هي قاعدة كل مسلم للإنطلاق في الحياة.في نهاية الكتاب يعطي الدكتور سبع خطوات لطريق النجاح هي:1- تيقظ للحياة ولنفسك.2- أفهم واقعك.3- انتمي لجماعة يشاركونك أفكارك4- تبني فلسفة الفسيلة والثوب والتمرة. وتتمحور بـِ كن فاعلاً، وأعطِ للأبد، ولا تستهون صغار الأمور.5- كن مشروعاً أو كون مشروعاً أو أدعم مشروعاً.6- تواصل مع شباب يشابونك بالحلم والهدف وهو نهضة الأمة.7- شارك في النشاطات الشبابية لمشاركة الأخرين بتجربتك والاستقاء بتجارب الأخرينالكتاب متوفر الكترونياً بالمجان:",
  "genres": [
    "Self Help"
  ],
  "author": "جاسم محمد سلطان",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/10794981"
}