{
  "title": "Wandering Stars",
  "description": "The eagerly awaited follow-up to Pulitzer Prize-finalist Tommy Orange’s breakout best seller There There —winner of the PEN/Hemingway Award, the John Leonard Prize, the American Book Award, and one of the New York Times 10 Best Books of 2018— Wandering Stars traces the legacies of the Sand Creek Massacre of 1864 and the Carlisle Indian Industrial School through to the shattering aftermath of Orvil Red Feather’s shooting in There There.Colorado, 1864. Star, a young survivor of the Sand Creek Massacre, is brought to the Fort Marion Prison Castle, where he is forced to learn English and practice Christianity by Richard Henry Pratt, an evangelical prison guard who will go on to found the Carlisle Indian Industrial School, an institution dedicated to the eradication of Native history, culture, and identity. A generation later, Star’s son, Charles, is sent to the school, where he is brutalized by the man who was once his father’s jailer. Under Pratt’s harsh treatment, Charles clings to moments he shares with a young fellow student, Opal Viola, as the two envision a future away from the institutional violence that follows their bloodlines.Oakland, 2018. Opal Viola Victoria Bear Shield is barely holding her family together after the shooting that nearly took the life of her nephew Orvil. From the moment he awakens in his hospital bed, Orvil begins compulsively googling school shootings on YouTube. He also becomes emotionally reliant on the prescription medications meant to ease his physical trauma. His younger brother, Lony, suffering from PTSD, is struggling to make sense of the carnage he witnessed at the shooting by secretly cutting himself and enacting blood rituals that he hopes will connect him to his Cheyenne heritage. Opal is equally adrift, experimenting with Ceremony and peyote, searching for a way to heal her wounded family.Extending his constellation of narratives into the past and future, Tommy Orange once again delivers a story that is by turns shattering and wondrous, a book piercing in its poetry, sorrow, and rage—a masterful follow-up to his already-classic first novel, and a devastating indictment of America’s war on its own people.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Audiobook",
    "Indigenous",
    "Literary Fiction",
    "Native American",
    "Historical"
  ],
  "author": "Tommy Orange",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/174147294-wandering-stars"
}