{
  "title": "Chaser: Unlocking the Genius of the Dog Who Knows a Thousand Words",
  "description": "A New York Times BestsellerThe amazing story of a very smart Border collie who is redefining animal intelligence.Chaser has a way with words. She knows over a thousand of them—more than any other animal of any species except humans. In addition to common nouns like house, ball, and tree, she has memorized the names of more than one thousand toys and can retrieve any of them on command. Based on that learning, she and her owner and trainer, retired psychologist John Pilley, have moved on to further impressive feats, demonstrating her ability to understand sentences with multiple elements of grammar and to learn new behaviors by imitation.John’s ingenuity and tenacity as a researcher are as impressive as Chaser’s accomplishments. His groundbreaking approach has opened the door to a new understanding of animal intelligence, one that requires us to reconsider what actually goes on in a dog’s mind. Chaser’s achievements reveal her use of deductive reasoning and complex problem-solving skills to address novel challenges.Yet astonishingly, Chaser isn’t unique. John’s training methods can be adopted by any dog lover. Through the poignant story of how he trained Chaser, raised her as a member of the Pilley family, and proved her abilities to the scientific community, he reveals the positive impact of incorporating learning into play and more effectively channeling a dog’s natural drives.John’s work with Chaser offers a fresh perspective on what’s possible in the relationship between a dog and a human. His story points us toward a new way of relating to our canine companions that takes into account our evolving understanding of the way animals and humans learn.",
  "genres": [
    "Nonfiction",
    "Animals",
    "Dogs",
    "Science",
    "Psychology",
    "Memoir",
    "Audiobook"
  ],
  "author": "John W. Pilley",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/17415012-chaser"
}