{
  "title": "Halo of the Nephilim",
  "description": "Can a fallen angel, his band of broken souls, and his nephilim children change the world?Armaros the Cursed, Satan’s favorite of the Fallen, falls once again after breaking the rules. Fearing an eternity of punishment, he desperately attempts to save himself by sending a bird to his island. The SOS message is received by his beloved congregation. They prepare the great Armaros’ kingdom for his return. Can his loyal worshipers rescue him from the pit?Halo of the Nephilim is the sequel to Halo of the Damned. The story begins with Armaros’ arrest. Reporters are duped into believing he was gunned down while awaiting trial. Declared dead, his only known surviving daughter, Joanna Easterhouse, proves her relation and inherits everything. She catapults her career from an entry-level advertising assistant to the head of Armaros’ advertising empire. Life couldn’t be better: a windfall inheritance, real power within a major industry, a loving relationship with a former demon, and a baby on the way. She should be on top of the world, but knows everything good must come to an end.Joanna’s sister, Kim Easterhouse, becomes Kim Slattery after marrying Sean, her dead mother’s probate lawyer. Joanna generously includes them as key players in her advertising chain. They, too, have much to smile about, but a string of events leads them back to old family secrets.Wickedness looms over the Easterhouse family once more, forcing them into an unlikely showdown filled with page-turning excitement. Like Halo of the Damned, Halo of the Nephilim is filled with conspiracy and angel lore taken directly from scripture and other ancient writings. Nephilim meander the earth in confusion, constantly questioning who they are and where they stand in terms of good and evil. More mind control themes top off this tale of doom. Dina Rae delivers the darkness in the most entertaining light.",
  "genres": [
    "Paranormal"
  ],
  "author": "Dina Rae",
  "average_rating": "4.77",
  "url": "https://www.goodreads.com/book/show/17415708-halo-of-the-nephilim"
}