{
  "title": "The Achilles Trap: Saddam Hussein, the C.I.A., and the Origins of America's Invasion of Iraq",
  "description": "From bestselling and Pulitzer Prize-winning author Steve Coll, the definitive story of the decades-long relationship between the United States and Saddam Hussein, and a deeply researched and news breaking investigation into how human error, cultural miscommunication, and hubris led to one of the costliest geopolitical conflicts of our timeWhen the United States invaded Iraq in 2003, its message was Iraq, under the control of strongman Saddam Hussein, possessed weapons of mass destruction which, if left unchecked, posed grave danger to the world. But when no WMDs were found, the US and its allies were forced to examine the political and intelligence failures that had led to the invasion and the occupation, and the civil war that followed. One integral question has remained Why had Saddam seemingly sacrificed his long reign in power by giving the false impression that he possessed hidden stocks of dangerous weapons?The Achilles Trap masterfully untangles the people, ploys of power, and geopolitics that led to America’s disastrous war with Iraq, and, for the first time, details America’s fundamental miscalculations during its decades-long relationship with Saddam Hussein. Beginning with Saddam’s rise to power in 1979 and the birth of Iraq’s secret nuclear weapons program, Steve Coll traces Saddam’s motives by way of his inner circle. He brings to life the diplomats, scientists, family members, and generals who had no choice but to defer to their leader—a leader directly responsible for the deaths of hundreds of thousands of Iraqis, as well as the torture or imprisonment of hundreds of thousands more. This was a man whose reasoning was impossible to reduce to a simple explanation, and the CIA and successive presidential administrations failed to grasp critical nuances of his paranoia, resentments, and inconsistencies – even when the stakes were incredibly high.Calling on unpublished and under-reported sources, interviews with surviving participants, and Saddam’s own transcripts and audio files, Coll pulls together an incredibly comprehensive portrait of a man who was convinced the world was out to get him, and acted accordingly. A work of great historical significance, The Achilles Trap is the definitive account of how corruptions of power, lies of diplomacy, and vanity – on both sides – led to avoidable errors of statecraft, ones that would enact immeasurable human suffering and forever change the political landscape as we know it.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "War",
    "Audiobook",
    "Military Fiction",
    "American History"
  ],
  "author": "Steve Coll",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/174156150-the-achilles-trap"
}