{
  "title": "Paper Losses",
  "description": "Paper Losses is the story of the twenty-five-year struggle between the Detroit News and the Detroit Free Press, two proud, family-owned newspapers that became pawns in the hands of the largest newspaper chains of our time, Gannett and Knight-Ridder. It is a story of personal ambition and corporate greed, of Wall Street and the courts - but, above all, it is a compelling cautionary tale about American journalism over the last three decades. Between them, the News and the Free Press claimed more readers per capita than any newspaper in any other major American city, but by the late 1980s both were losing millions of dollars a year. With Wall Street looking over their shoulders, Gannett and knight-Ridder sought a peculiar form of government relief that would allow the papers to continue in artificial competition - while promising their parent companies tens of millions of dollars in profits. But the simple solution soon becomes a complicated test of wits and wills between two long-time rivals: Alvah Chapman, Jr., the steely, Bible-reading chairman of Knight-Ridder, and Al Neuharth, the flamboyant leader of Gannett and the founder of USA Today. A battle that begins in Detroit rages across the land, from union halls and corporate boardrooms to the offices of legal legend Clark Clifford and Attorney General Edwin Meese. In the end, what Neuharth and Chapman believed could be settled in a polite chat winds up on the docket of the United States Supreme Court. Bryan Gruley weaves this many-layered and complex story into a fast-paced narrative filled with unforgettable characters and bitter conflicts. As riveting as Barbarians at the Gate, as incisive in its insights into the media business as The Powers That Be, this consummately reported and passionately told tale is one that has repercussions for all of us.",
  "genres": [],
  "author": "Bryan Gruley",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/1742903.Paper_Losses"
}