{
  "title": "Wanderlost",
  "description": "WANDERLOST captures the essence of that strange period of life after college and before looming adulthood; when idealism is still a good thing, when one must choose to embrace the often mediocre task of mundane existence, or burn free and live according to the principles of our hearts. It is a coming-of-age tale, a humorous road narrative and an acerbically accurate portrayal of modern America Life in all its beauty and futility, written in a personal uninhibited style of journalistic prose. Ben Olson says, \"The book is a backlash to this dumb culture taken over by a crassness of people who are all passionately apathetic. This is a truthful account of a common man s struggle... and that is why it has merit. Sure it s fiction, but I only write fiction because I have to. I need the protection that it provides. Every writer knows that there is no real fiction, for what we put on the page stems from our experiences. I believe in something that will never die the notion that you can still live free in America.\" One desolate north Idaho winter, as Max s mailbox slowly fills with rejection slips and he nurses yet another hangover, he s overcome by a feeling of entrapment. Haunted by fears that his life is wasting away and lured by dreams of one day understanding, he decides to break with the comfort of his home and re-discover a sense of meaning. He escapes. With an Amtrak USA Rail Pass and a pack on his back, Max sets out to find America again, armed with the bitterness of his past and the yearning to find something pure again. He travels around the country, stopping and going from the train as he pleased, hitchhiking and sharing rides with drug runners, gigolos and other strangers of the American road. Wanderlost captures the essence of that strange period of life after college and before looming adulthood; when idealism is still a good thing, when one must choose to embrace the often mediocre task of mundane existence, or burn free and live according to the principles of our hearts. It is a coming-of-age tale, a humorous road narrative and an acerbically accurate portrayal of modern America Life in all its beauty and futility, written in a personal uninhibited style of journalistic prose.",
  "genres": [],
  "author": "Ben Olson",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/1743086.Wanderlost"
}