{
  "title": "The Plain of Jars",
  "description": "2014 Dayton Literary Peace Prize entry!What would you do if you found that the bones and ashes you were given by the Air Force were not the remains of your loved one? Dorothy Kozeny, a 64-year-old widow from a small town in Ohio, after getting no answers from the relevant authorities, decides the only thing to do is to go to Laos herself to search for the truth concerning her son's fate. In 1990, accompanied by a trusted Laotian called Kampeng, Dorothy travels deep into the mountains of rural Laos, attempting to trace her son's path through inhospitable terrain, an unforgettable trek that provides her with a rewarding, often humorous, and at times frustrating, cross-cultural experience. All clues lead her to a mysterious figure, an alleged CIA operative left over from the war, living in a remote and hostile area deep in the jungle. The second part of the book traces the life of this enigmatic character hiding in Laos, the two main characters linked through Dorothy's son.Reviewed By Michelle Stanley for Readers’ FavoriteDorothy Kozeny, grieving for her son who died in Vietnam, is shocked when she receives a mysterious letter stating the ashes the military sent her may not be Andrew’s. Her investigation confirms this, but the military bureaucrats are tight-lipped. Dorothy decides to go to Laos to unearth the truth. Kampeng, a guide, takes Dorothy on an unforgettable journey filled with trepidation as the country experiences political unrest, but also excitement at being exposed to a new culture. She finds items belonging to Andrew at a Buddhist shrine, and natives tell her a powerful man known as Chao Baa may have the information she needs. Dorothy learns that Chao Baa is the alias for an American, Richard Johnson. But Chao Baa has no interest in meeting anyone from the past, much to Dorothy’s disappointment. How can she release the grief when no one gives the answers to solve Andrew’s death? The Plain of Jars is written by N. Lombardi, Jr.The Plain of Jars is an engaging action adventure novel. N.Lombardi Jr. combined historical facts and fiction very nicely. It was a great way for me to learn more about the Vietnam war and how it affected both countries. The author expounded on this through the characters and intense writing. I thought he succeeded in displaying the actions and emotions of everyone, especially Dorothy. This enabled me to feel them too, and appreciate the intriguing twists and good ending. Although the story was lengthy, it was enjoyable and worth reading.",
  "genres": [
    "Fiction"
  ],
  "author": "N. Lombardi Jr.",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/17434365-the-plain-of-jars"
}