{
  "title": "Treason: A Catholic Novel of Elizabethan England",
  "description": "As Stephen Long steps ashore in England one gray dawn in May 1581, he wonders how many more Catholics will have to die to make Queen Elizabeth feel secure. Involuntarily, he trembles at the thought that soon he may be numbered among them. For in the days ahead, each time Stephen hears confession or celebrates Mass, he commits yet another act of high treason against the British Crown, for which Queen Elizabeth's swift penalty is gruesome torture and painful death. As Stephen hastens to find shelter away from that open beach, he struggles not only with fear but with doubt as \"Is my mission foolish? Am I nothing more than fresh meat for the queen's butchers?\" In the light of that same gray dawn, just a few miles north, a heartbroken Caroline Wingate lies awake in her unhappy marriage bed, wrestling with thoughts of a different -- perhaps crueler -- martyrdom. Although from her earliest years Caroline has known herself to be called to cloistered contemplative life as a nun, some years ago she was forced by her father into a politically \"safe\" marriage with an upright Protestant, from whom she must hide her Catholicism -- and her true -- vocation lest she, too, be executed for her faith. Hanging by the neck is swift martyrdom, but Caroline's doubts and guilt have pained her daily for years now. An exile in her own soul, in her lonely desolation she confesses, \"I don't love my husband as I should. For safety's sake, I cannot give myself wholly to him and must deceive him daily. Nor can I give myself to the One I truly love.\" In a few days, circumstances will force Caroline and the young priest together. With death hastening toward both of them, the beautiful fates of these two faithful Catholics confirm what we today too often our faith is the most powerful force in the world -- more powerful than politics, wars, or empires. More powerful even than the hard, cold will of Queen Elizabeth. In this gripping, heartrending tale, Caroline and Stephen show us that it's not power that writes the true history of the world; it's faith and the love that faith alone can awaken and sustain.",
  "genres": [
    "Historical Fiction",
    "Catholic",
    "Fiction",
    "Religion"
  ],
  "author": "Dena Hunt",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/17434933-treason"
}