{
  "title": "The Businessman's Tie",
  "description": "This is an alternate cover edition of ASIN:B00BG9Q0BWPart One of \"The Power to Please,\" a dark, sensual series about shattering loss, redemption through transformation, and the miracle of selfless love.Who knows where one night of passion might lead?Recently-divorced Nonnie Crawford craves a new beginning -- it arrives in the form of an enigmatic, dark-eyed stranger she dubs The Businessman. He seduces her with a sizzling introduction to the thrill of submission. As the days pass, she can't forget him or the way he made her feel, so she seeks him out and soon finds herself at a BDSM club. There, she meets Michael Weston, a handsome, charming playboy who's keen to seize the reins left dangling by the absent Businessman.Nonnie's ready to take chances ... perhaps too ready.*Warning: adult material. Only purchase if it is legal for you to do so. This book contains explicit language and scenes of a sexual nature, including exhibitionism, S&M by secondary characters, and consensual domination and submission, which some readers may find objectionable.*Approximately 42,000 words, 150 print pages~~~~~~~~~~~~\"The Power to Please,\" a four-part, BDSM erotic romance seriesNonnie Crawford journeys into the alluring but sometimes dangerous realm of BDSM. She yearns to submit herself to a powerful, dominant man and two Doms vie for that submission, the enigmatic Businessman and the charming Playboy.Knowing who to trust is always a challenge, and the odds of making a mistake are multiplied when gripped by new, intoxicating desires. Nonnie's choices prove the difference between perfect bliss and devastating ruin. Truth and trust. She'll need both as she struggles to move past her mistakes, earn indestructible love, and to claim the ultimate power to please.Warning: adult material. Contains explicit language and scenes of a sexual nature, including exhibitionism, multiple-partner scenes, S&M, bondage, consensual domination and submission, and other activities which some readers may find objectionable.Titles in the series should be read in order:1 - The Businessman's Tie2 - The Playboy's Proposition3 - His Name Is Sir4 - The Submissive's Last Word",
  "genres": [
    "BDSM",
    "Erotica",
    "Romance",
    "Contemporary",
    "Fiction",
    "Short Stories",
    "Adult"
  ],
  "author": "Deena Ward",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/17436654-the-businessman-s-tie"
}