{
  "title": "Keeping Never",
  "description": "Keeping Never, a New Adult Novel Recommended for Ages 18 and UpBook #3 in the series beginning with \"Tasting Never\"(Books 1-5 are available now - Reading list included below)“In your pain, I see my own, so I'm going to tell you and only you, okay?”Never's past might be under control, but Ty's is just starting to unravel. After receiving a phone call from his broken past, tensions run high between Never and Ty, especially with Never deciding to do something she's never done and keep her pregnancy a secret.While visiting the skeletons in his dark, dark closet, Ty is threatened by all that he once was and all that he thought he'd overcome. With his pain about to consume him, Never is the only one who stands between Ty and relapse, who can help him control his emotions and find peace, but is she up to it? After all, with two tortured souls desperate for a healing touch, are they more of a hindrance to one another than a help?Love, marriage, and a baby. Three things that Ty and Never didn't see coming. It's judgment time for both of them, time to see if the light really can overcome the dark. Here's to hoping.“I know you'll make the right decision, no matter how hard it is, no matter if it cuts you into pieces, because you have to believe that I'll be there for you in the end.”Reading List:#1: Tasting Never#2: Finding Never#3: Keeping NeverOR #1-#3: \"Tasting, Finding, Keeping: The Story of Never\"#4: Never Can Tell#5: Never Let Go#6: Never Did Say (Releases January 7th, 2015)KEEPING NEVER EXCERPT:Ty enters the bathroom, and I turn my head forward, back towards the large, gray seat in front of me, determined not to give myself away by acting too anxiously. After all, I've seen one too many horrible scenarios in movies regarding the infamous Mile High Club. I suppose now I'll get to find out if it's really a reality or if Ty's just sh*tting with me. I want to erase his pain, though, give him something else to occupy his mind for a little while. After all, he did the same for me on the bus, took something that used to be my weakness, twisted it around so that it was not only a distraction technique but a bonding exercise that drew the two of us together in ways that I can still barely understand. For so, so long, sex was just this thing, this dangerous activity with physical and emotional consequences that I ignored in desperation, wildly fighting to fill that emptiness inside of myself. Now, my feelings for Ty and my family sit there and make my heart tight with love, and sex has become … something else. It's just pleasure and not pain, another way for me to show Ty how I feel and vice versa, a stress reliever, exercise, relaxation … It's all of those things and more. It's something for him and me alone, just the two of us. Just us. Us, us, us.",
  "genres": [
    "New Adult",
    "Romance",
    "Contemporary Romance",
    "Dark",
    "Contemporary",
    "College",
    "Abuse"
  ],
  "author": "C.M. Stunich",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/17436480-keeping-never"
}