{
  "title": "Missing in Mexico",
  "description": "\"Missing in Mexico\" is Stuart Gustafson's debut mystery tourism novel. Private Investigator Stan W. is hired to find a college freshman who’s missing after a family vacation in Los Cabos, Mexico. Even with local help and some promising leads, he’s unable to find her and returns home to inform the hurting parents. Months later he receives a mysterious letter and jumps on the next plane to Los Cabos. Will this be the break that he needs to find her? Or will she remain missing – Missing in Mexico? As America’s International Travel Expert®, Stuart Gustafson has \"Million-Mile Flier\" status on a major airline, and flown over 1,200,000 miles to 39 different countries. Come travel with him and learn some of the language as he takes you to the most southern point on Mexico’s Baja California peninsula – Los Cabos. Be careful, though, as you might get hooked on the travel, the intriguing story, and the charm of the places where he takes you! And if you like it there, you might want to book your next vacation in Los Cabos – where he spends several weeks each year. ============== CHAPTER One/Uno Flight # 1476 from Los Cabos to Seattle Saturday, January 5th familia (fă•mĭl’•ē•ă) – family. Hay cuatro personas en mi familia. There are four persons in my family. The voice over the intercom system announced, “Ladies and gentlemen, we trust you had a good time in Los Cabos, but it’s now time for us to take you back to the States. The cabin doors have been closed, and Alaska Airlines flight 1476 with nonstop service to Seattle-Tacoma is ready for departure.” “Hey, wait. Sarah’s not here; we can’t leave without her,” the girl in seat 14A yelled in a frightened voice. Mary reached up and pushed the flight attendant call button even as the flight attendant was already headed toward her seat. “We can’t leave yet; Sarah’s still down there,” Mary continued, now reaching the point of hysteria. “Please calm down, miss. Everyone’s already onboard. You can look for yourself,” the flight attendant said in a calm voice as she pointed to the window. “What do you mean everyone’s onboard? Sarah’s not here; she should be sitting right here!” Mary pulled her tearing eyes away from the empty seat and looked out and saw that the boarding ramps had been pulled away from the airplane, but what she didn’t see scared her. How come Sarah’s not out there, running in a panic toward the plane? “Where’s Sarah? She was just there with me. Where is she? Don’t leave; Sarah’s missing!” Mary cried out as tears began flowing down her cheeks. The annoyed passengers felt a jolt as the plane was being pushed back. They were ready for their flight home from Los Cabos. But Sarah wasn’t on board; she’s missing – Missing in Mexico. ================= “The story’s so real I felt like I was right there!” Jess Todtfeld, Former Producer for ABC, NBC, and FOX “A fun read if you're going to Cabo!” Christopher Elliott, Syndicated Travel Columnist",
  "genres": [
    "Mystery"
  ],
  "author": "Stuart Gustafson",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/10796150-missing-in-mexico"
}