{
  "title": "Pledging My Time: Conversations with Bob Dylan Band Members",
  "description": "\"More fine stories than you can count\" — Greil MarcusCollecting over 40 original, in-depth interviews, Pledging My Conversations with Bob Dylan Band Members is the first look at Bob Dylan’s career entirely from the perspective of the musicians standing a few feet away from him on stage – from his earliest days in the ‘60s all the way through the 21st century Never Ending Tour. With a few exceptions, these artists are not household names, but they have in many cases spent years making music with one of the most revered and mysterious artists in the world.The world of Dylan’s bands and his road life has seemed fairly impenetrable for decades now. Many people in this book have never spoken before about their time with Dylan, or certainly not in as much depth. Interviewees span every era of Dylan’s career, from Ramblin’ Jack Elliott and Martin Carthy talking about the early folk scene up through Benmont Tench and Alan Pasqua talking about recording Rough and Rowdy Ways. This guest list guiding the backstage tour also includes one-off sit-ins, behind- the-scenes touring personnel, and even a notable Grammy Awards stage-crasher.If Dylan is, as he famously put it back in 1965, a “song and dance man,” these are the people who have sung and danced alongside him. Ray Padgett is the ideal interviewer—he really knows his stuff, so he can draw the best out of every musician he talks to. This is a tremendous collection of acute, revealing, often funny stories from those who’ve played on stage with Bob Dylan. — Michael Gray, author of Song and Dance The Art of Bob Dylan There already is an endless supply of books about Bob Dylan in the world. What could possibly be written now that seems fresh, much less indispensable? Enter Ray Padgett, one of the great modern Dylanologists, who has done the Lord’s work of tracking down Bob’s many collaborators over the years and getting the inside story. The result is insightful, fascinating, hilarious, illuminating, and, yes, indispensable. — Steven Hyden, author of six books including Long Road and Twilight Of The Gods, and the co-host of the Bob Dylan podcast Never Ending Stories These talks open up like running streams. There seems to be no guile, no self-promotion, no maybe because Ray Padgett doesn’t either. There’s less I Was There than ‘and then I wasn’t’—and more fine stories than you can count. I love Louis Kemp on negotiating with Walter Yetnikoff—even if he does have a 13-year-old Bob Dylan singing Jerry Lee Lewis and Chubby Checker in 1954. — Greil Marcus, author of Folk A Bob Dylan Biography in Seven Songs Ray Padgett's Dylan scholarship combines obvious enthusiasm, deep knowledge, broad understanding, and an abiding need to get things right. This is essential work both now and for the future. – Caryn Rose, author of Why Patti Smith Matters If you're like me, you've waited your entire adult life for this book. Padgett digs deep and shines a spotlight on the people standing (and sitting) behind the man behind the shades. — Jon Wurster, writer/performer/drummer (Mountain Goats, Bob Mould, Superchunk)",
  "genres": [
    "Music",
    "Biography"
  ],
  "author": "Ray  Padgett",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/174382871-pledging-my-time"
}