{
  "title": "The Bears",
  "description": "When a terrible oil spill occurs in British Columbia due to a ruptured pipeline, the ensuing environmental disaster provides an immediate crisis for activist Gilbert Crow, arctic researcher Anne McCraig, and a young idealist named Jonathan Fuhrenmann. When they converge on the embattled community at the heart of the crisis, their passionate attempts to save the bears that they love will forge their beliefs in lasting and profound ways. A race against time, this passionate and spiritual journey leads them on a path that forever cements in their hearts a new morality for an anthropocentric planet. The Bears takes readers on a spiritual and environmental journey through the parallel stories of the human protagonists and their bear counterparts. With each person having a totemic relationship with a specific bear and its plight, this dramatic new novel creates a unique mythological structure that asserts each animal has their own spiritual beliefs. The bears’ mythological stories, beliefs, and backgrounds are mixed in with the human plot and are integral to its growth and development. Taking a unique and spiritual route to addressing the morality and concerns in humanity’s multiple threats to nature The Bears is a dramatic and fulfilling story that keeps readers mentally and spiritually engaged until the very end.Written with a profound respect for nature and the spirituality that it possesses, The Bears offers a rare touch to readers’ souls as well as their hearts. Taking on tough environmental issues that face the world today and relating them to the noble and spiritual journeys of nature’s inhabitants, the novel creates a stunning adventure that will appeal to all readers who care about environmental issues and even those who have a passing interest in the natural world. Broaching themes of environmental morality, innovative spirituality, and forgiveness, this wonderful novel by Katie Welch possesses a message that is deeper and more fulfilling than most.",
  "genres": [],
  "author": "Katie  Welch",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/17443845-the-bears"
}