{
  "title": "Career Change: Stop hating your job, discover what you really want to do with your life, and start doing it!",
  "description": "Are you tired of asking \"What should I do with my life?\"  \n  Are you sick of your job? Don't worry, I know how you feel!\nI used to start every working week saying \"I hate my job\" and spend every Friday night drinking too much to drown my misery.I was a cubicle worker in large corporates, going to pointless meetings, writing endless documents no one would read, testing computer systems that would soon be obsolete. Every day, my soul and my creativity died a little.Maybe you feel the same?Well, life is too short to just exist on the edge of breakdown, and there is a better way of living. You need to discover what you love to do and then make that your job, your life's work.This book will take you through understanding the way you feel now as well as how to improve your current situation immediately so you can create enough space to work on breaking out and doing what you truly love. It also contains the career change process I used to go from management consultant to full-time author-entrepreneur.It's time to change your career and your life.  ˃˃˃ In this book, you will find:  ** Part 1: I hate my job1) Identifying the problem2) The results of an unhappy workplace- stress, depression and weight gain** Part 2: How to improve your current situation3) Develop yourself4) Coping with stress at work5) Being valued and appreciated6) Escaping the trap7) Making money and keeping hold of it8) Being creative9) Escape is sometimes necessary** Part 3: How to change your career10) What do you really want to do?11) Entrepreneurship or working for yourself12) The Career Change Process13) Setting and achieving your goals14) Your Challenge ” Your FutureBonus Articles:* Case Study Micro-Entrepreneur: How I run my business, The Creative Penn Limited* Interview with Joanna Penn on how to change careers* From affirmation to reality: the author’s story* The Smart Person’s Guide to Quitting the Day Job ˃˃˃ Life’s too short to continue feeling this way. It’s time to change your life. Packed with strategies, tips and personal stories that will help you find the work you love. \nIf you want to change your life and your career, download a sample or buy now",
  "genres": [
    "Nonfiction",
    "Writing",
    "Self Help"
  ],
  "author": "Joanna Penn",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/17444377-career-change"
}