{
  "title": "The Jean Simmons Handbook - Everything You Need to Know about Jean Simmons",
  "description": "Jean Merilyn Simmons, OBE (January 31, 1929 - January 22, 2010) was a British-American actress. She appeared predominantly in films, beginning with those films made in Great Britain during and after World War II - she was one of J. Arthur Rank's 'well-spoken young starlets' - followed mainly by Hollywood films from 1950. This book is your ultimate resource for Jean Simmons. Here you will find the most up-to-date information, photos, and much more.In easy to read chapters, with extensive references and links to get you to know all there is to know about Jean Simmons's Early life, Career and Personal life right away. A quick look inside: Jean Simmons, A Bullet Is Waiting, A Death in the Family, A Little Night Music, Academy Award for Best Actress, Academy Award for Best Supporting Actress, Adam and Evelyne, Affair with a Stranger, Aida Foster stage school, Androcles and the Lion (film), Cage of Gold, December Flower, Demetrius and the Gladiators, Divorce American Style, Dominique (film), Desiree (film), Footsteps in the Fog, Gene Simmons, Guys and Dolls (film), Hugh Grant, Hungry Hill (film), Mysteries of the Bible, National Board of Review Award for Best Actress, New Milford, Connecticut, North and South (TV miniseries), Ophelia, Primetime Emmy Award for Outstanding Supporting Actress in a Miniseries or a Movie, Stewart Granger, The Blue Lagoon (1949 film), The Clouded Yellow, The Dain Curse, The Dawning, The Drumhead, The Egyptian (film)...and more pages!Contains selected content from the highest rated entries, typeset, printed and shipped, combining the advantages of up-to-date and in-depth knowledge with the convenience of printed books. A portion of the proceeds of each book will be donated to the Wikimedia Foundation to support their mission.",
  "genres": [],
  "author": "Emily   Smith",
  "average_rating": "1.50",
  "url": "https://www.goodreads.com/book/show/17444841-the-jean-simmons-handbook---everything-you-need-to-know-about-jean-simmo"
}