{
  "title": "Saints Alive! New Stories of Old Saints: Saints of Empire",
  "description": "\"It has been said, with good justification, that hagiographers killed hagiography by their excesses of language and piety. Dr. Seddon seeks to undo that damage with his new work, which situates saints in an historical context (even if within a fanciful plot), allowing us to see them as real disciples of Christ, worthy of emulation and able to be emulated.\" Reverend Peter M. J. Stravinskas, Ph.D., S.T.D. Editor, The Catholic Response\"Andrew M. Seddon's briskly written, engaging accounts of the trials and triumphs of the early saints offer tremendous lessons in piety and perseverance for our age of comfort and laxity. His imaginative and lively accounts help draw the reader closer to an appreciation of the experience of the supernatural in everyday life - a vital element of religion that's sorely missing in the modern conception of our interaction with God.\" Pieter Vree, Editor, New Oxford Review \"Dr. Andrew Seddon writes like an accomplished novelist. His tales of ancient saints and martyrs are fascinating, and deeply moving. Reading them, I was close to tears more than once.\" Rev. John Jay Hughes, archdiocese of St. Louis, church historian, author of Pontiffs: Popes Who Changed History\"This collection of twelve tales by Andrew Seddon introduces us to a range of saints and martyrs, some well known but other like Saint Ariadne or Saint John the Dwarf, new to many readers. These stories are not mini-bios but meaty fictional tales based on the lives of these saints. The author may have taken a liberty or two in cases where details are scanty, but he has not only kept the real story but managed things in such a way that the reader is drawn right in. This isn't a book, it's an experience!\" Colleen Drippe,' author of Mystery at Miner's Creek\"Many readers might imagine that the stories of saints in the pages of Roman history are dusty and dry. But Andrew Seddon brings them to vivid life with his characteristic sensitive characterization, spiritual insight, and solid knowledge of the Roman world. These are well-crafted short stories of a quality that's all too rare nowadays!\" Werner Lind, Assistant Director, Easley Library, Bluefield College, Virginia, author of Lifeblood",
  "genres": [
    "Christian",
    "Short Stories",
    "Historical Fiction"
  ],
  "author": "Andrew M. Seddon",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/17445449-saints-alive-new-stories-of-old-saints"
}