{
  "title": "Pack Community",
  "description": "Hot Alpha males and feisty females set the pages on fire as they clash and struggle to belong and find that one special mate.Shape-shifters who cannot shift, attacks on packs, coming out to the world, The Were Chronicles will take you through the lives of Pack members who fight for who and what they want.Nothing is more sacred then the one person who completes them.Through betrayals and lies these strong willed females and fully dominant males must find a way to protect what’s really important. Love.Book five in the Were Chronicles SeriesIf you loved The A Novel by Stephenie Meyer and Fate and Fury (The Grey Wolves Series) by Quinn Loftis and Raye Harrington then you will not be able to put down this absolute treat!A wolf and bobcat come together and change one community, forever.Grayson Mason is worn out and run down from the long months on the road in search of the feline Prince. All he wants is to finish his mission and go back to his Pack. That is, until he meets the one woman who will turn his world upside down.Beth Williams is happy in Coyote Bluff. The community of shifters support one another and she has her brother and nephew. Sure, sometimes she might get lonely, but she’s never connected with anyone enough to consider mating. That is, until a new wolf hits town. With the arrival of Gray, she has to rethink her entire life.But there is more going on than just the attraction between the wolf and the bobcat. Gray’s search is bringing him closer to finding the Prince but at the same time leading him right into the middle of a feline conspiracy and a battle.Gray finds himself fighting not only for the Prince’s survival, but also to protect his future mate.Crissy SmithCrissy Smith lives in Texas with her husband, daughter, and three Labrador retrievers. The three dogs love to curl up under her computer desk and nap while she writes. It doesn't leave a lot of room for her but what's a woman to do?When not writing or reading, she enjoys hunting, camping and shooting. But she has a girly side too and is addicted to pedicures and coffee.",
  "genres": [
    "Paranormal",
    "Romance",
    "Shapeshifters",
    "Paranormal Romance",
    "Werewolves",
    "Fantasy",
    "Erotica"
  ],
  "author": "Crissy Smith",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/17446595-pack-community"
}