{
  "title": "In a Heartbeat",
  "description": "Librarian’s Note: Original cover edition for ASIN# B00C4XBS52Stella“I’ve been in and out of hospitals for the past ten months. I’ve had half my liver removed and even though this time the doctors are very optimistic that they’ve removed all of the tumours, they can’t be sure. In another three months they want me here again for a check up. Right now I feel better than I’ve ever felt. I know the damn thing is gone, at least for the moment. Despite that, I can’t make any plans for the future, not yet. I need to go somewhere where nobody knows me, where I can relax and maybe even forget about all this. Where I can meet people who don’t think of me as the girl who lost her father and her brother in a car accident, and who has cancer. I want to have fun, even if it’s for a couple of months.” When Stella decides to visit her estranged cousin Lisa in Genoa, she has no idea Italy will give her a new reason to live. Max“Her gaze locked on a scene so beautiful, the picturesque beach paled in comparison. A lifeguard emerged from the water, his orange trunks stuck to his legs and water dripping all over him. He shook his head to get rid of some of the water in his hair and Stella felt as if everything started developing in slow motion – tiny drops of water slid from his neck down his broad chest and muscular arms, along a weaving tattoo on his right shoulder, and continued downwards towards his chest and washboard stomach, finally getting lost in the waistband of his trunks. A part of another tattoo peeked over his trunks on his left hip, the other part hidden under them. It was a total Baywatch moment.”Their love is epic. But there are too many things keeping them apart.“How could you keep this from me, Lisa? If you had told me the first day I met him, I would have avoided him like the plague. Nothing would have happened between us.”“I kept your secrets, too, Stella.”Are Max and Stella strong enough to fight not only for their love, but for their lives?",
  "genres": [
    "New Adult",
    "Romance",
    "Young Adult",
    "Contemporary Romance",
    "Illness",
    "Realistic Fiction",
    "Friends To Lovers"
  ],
  "author": "Teodora Kostova",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/17447935-in-a-heartbeat"
}