{
  "title": "Breaking Away",
  "description": "BREAKING AWAY is a story of loss, healing, and love… where unexpected turns and heartache lead to passion.To Nashville Assassins’ leading scoring center Phillip Anderson, playing hockey has always been easy… as natural as breathing. His life is no different. That’s until his world is turned upside down by the death of his sister. While mourning his loss, Phillip has to find a way to make his very angry sixteen-year-old niece, Claire, happy. Now, as her guardian, he discovers the only thing that seems to heal her lonely heart is dance class. But what he didn’t count on was the attraction he’d feel towards her drop-dead sexy dance teacher.For Reese Allen, dancing has always been part of her soul. After having her heart broken in New York, she comes home with the determination to make her dance studio one of the best in Tennessee and succeeds. When she sees Claire dance for the first time, she knows the girl is bound for greatness and takes the troubled teen under her wing. Using dance as therapy, she suddenly finds herself bound to the young woman… and her hot-as-sin uncle.However, Phillip and Reese are happy in their single lives. It’s simple. They do what they want, who they want, and how they want, but from the moment they meet, the attraction is undeniable. Soon, they are more than willing to spend just one night tangled in the sheets. But, one night turns into two, and two turns into three, until they find themselves in a repeated dance of “One Last Time” that has the potential to be something more… if only Reese and Claire allow it.Can Phillip find a way to thaw the hearts of both the women in his life, or will he be forever trying to break them away from their pasts?",
  "genres": [
    "Sports",
    "Romance",
    "Sports Romance",
    "Hockey",
    "Contemporary Romance",
    "Contemporary",
    "New Adult"
  ],
  "author": "Toni Aleo",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/17448419-breaking-away"
}