{
  "title": "Boarded by Love",
  "description": "Jude Sinclair here, hockey player for the Bellevue Bullies and lover of all ladies. Hockey’s in my blood, and not to sound full of myself, but I’m good at it... really good. The draft is within my reach — it’s mine to take — but that’s not the only reason people know my name. They know me because of my way with women. They know the score, and I aim to please. I just tend to stay away from repeat performances. In other words, I don’t do relationships beyond my family and friends. I’m happy with life. However, I should warn you that my story and how I see it playing out is about to change due to a certain redhead on campus.She’s beautiful. Stunning. Breathtaking.She’s my game changer.***He’s trouble from the moment I see him. I don’t know what I’m thinking, but from the moment I meet his gaze, I’m his. It’s a scary feeling.I’ve never trusted anyone outside my aunt and uncle — and even that took months. I didn’t have it easy growing up. My mom was usually strung out, and she didn’t give me a second thought. Drugs and the men who paid her were more important to her. It was horrible, but I’m stronger today. Because of my past, security is what I need most. Money assures me that I can take care of myself today, tomorrow, and next month. I don’t want to ever be hungry or go without again, so I work hard for every penny.Oh, by the way, I’m Claire Anderson. I’m a hard-studying sophomore at the University of Bellevue, dancer for the school dance team, and a burlesque dancer at a club, but that’s my secret.You may think you know how our story ends, but you have no clue. It’s not easy falling in love… or living happily ever after. At first it may seem so, but when is anything worth having ever won without a fight?Especially when you’re boarded by love.",
  "genres": [
    "Sports",
    "Romance",
    "New Adult",
    "Sports Romance",
    "College",
    "Hockey",
    "Contemporary"
  ],
  "author": "Toni Aleo",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/17448422-boarded-by-love"
}