{
  "title": "الحراك الشيعي في السعودية: تسييس المذهب ومذهبة السياسة",
  "description": "هذا الكتاب للباحثين بدر الإبراهيم ومحمد الصادق، يتحدث بالتفصيل عن الحالة الشيعية في السعودية، منذ ما قبل الثورة الإيرانية، وحتى نهايات العام 2012م.. حيث يروي تفاصيل كثيرة في غاية الأهمية وتُنشر لأول مرة.. بدأً من انتفاضة القطيف بعد الثورة الإيرانية، والمواجهات مع الحرس الوطني، مروراً بخروج المعارضة الشيعية خارج السعودية، وبدأ تنظيمها في إيران، والعلاقة بالسلطة الإيرانية، والتدريب على السلاح، والاستعداد للثورة. وعن المشاركة في انقلاب البحرين، وحتى الخلاف مع الإيرانيين، وطرد المعارضة الشيعية السعودية من إيران، وتشتتها بين الهند وسوريا ولندن. ويذكر تفاصيل في غاية الأهمية عن الفضيحة الإيرانية الشهيرة \"إيران جيت\" حين قامت إيران بالسرّ بشراء أسلحة من إسرائيل زمن حربها مع العراق، وكيف أن سعودياً من المعارضة الشيعية هو من سرب خبر هذه الفضيحة للصحافة اللبنانية، فنشرتها مجلة الشراع، وضجت بعد ذلك في العالم.ويتحدث الكتاب عن شخصيات غامضة في المعارضة الشيعية، حسين أبوغريب، هاني الصايغ، وعن أحمد المغسّل زعيم حزب الله الحجاز وعلاقته بالحرس الثوري، عن المصالحة مع الدولة، والمفاوضات التي أدارها عثمان العمير، وعن الجدل والصراع الذي دب في جسد المعارضة بسبب الخلاف حول المصالحة. ثم يتحدث عن عودة المعارضة للداخل، وعن نشاطها وسط صراعات تياريه مختلفة في القطيف والأحساء، وعن الانقسامات التي حدثت في صفوفها.ويتطرق الكتاب لتفجير الخبر، ومظاهرات القطيف، وخطاب الانفصال، وأحداث البقيع، وظاهرة نمر النمر، وصراعات الداخل الشيعي في الانتخابات البلدية، وعن العلاقة مع الأوساط السنيّة، ولقاءات الحوار الوطني، والاجتماعات التي تمت في السرّ والعلن مع عدد من الرموز الدعوية المعروفة. ويشرح الكتاب خريطة المشهد الشيعي، الشيرازيين وانقساماتهم، والإخباريين، والأصوليين، وأتباع خط الإمام (الخميني)، وتنظيم حزب الله الحجاز.الكتاب باختصار يحوي شرحاً للخريطة الفكرية والسياسية الدقيقة لشيعة السعودية، ويتحدث عن كل خبايا الحالة الشيعية خلال أكثر من 30 سنة. وقد استطاع مؤلفا الكتاب (بدر الإبراهيم ومحمد الصادق) تقديم رصد وتحليل موضوعي ونقدي يستحق الإشادة لطبيعة هذا المشهد.",
  "genres": [
    "Politics",
    "History",
    "Nonfiction"
  ],
  "author": "بدر الإبراهيم",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/17448873"
}