{
  "title": "A Dark Dreambox of Another Kind: The Poems of Alfred Starr Hamilton",
  "description": "Edited by Ben Estes and Alan Felsenthal. Introduction by Geof Hewitt. Alfred Starr Hamilton (1914-2005) was an American poet from Montclair, New Jersey. Though Hamilton wrote thousands of poems during his lifetime, only a small percentage of them ever found their way into print. His poems appeared in small poetry journals during the '60s, '70s and '80s; two chapbooks, The Big Parade and Sphinx; and one full-length collection, The Poems of Alfred Starr Hamilton, published by The Jargon Society in 1970. In this new volume, Ben Estes and Alan Felsenthal present a collection of Hamilton's poems from these publications, along with many of Hamilton's poems that were previously considered lost and poems from posthumously found notebooks.\"Hamilton is the author of spare, wry, slightly surreal poems that have, so far as I can see, no real equivalent in American English.\"—Ron Silliman\"Alfred Starr Hamilton 'wrote to the governor of poetry / And simply signed [his] own name.' Consider this collection—assembled by two very dedicated allographers—an essential expansion on said letter. People who've encountered Hamilton's work previously will be glad for the chance to see familiar poems alongside many marvelous new ones. And how I envy first-time readers of this most generous and genuine American writer.\"—Graham Foust\"It is a hidden world, a hushabye place that Alfred Starr Hamilton occupies, a secluded place where he is free to summon daffodils and stars, chimes and angels, thread and old-fashioned spoons. There is Hungarian damage, blue revolutionary stars, a sedge hammer (which is not a typo). He is obsessively drawn to fine metals—bronze, silver and gold. He would be golden, but can never grasp the elusive sad: 'One cloud, one day / Came as a shadow in my life / And then left, and came back again; and stayed' like \"Anything Remembered\" which is the title of that poem. He is too removed to see things any other way but his own. It is a silver peepshow in the wonderbush, and there is always a moon to scrape from the bottom of his view.\"—C. D. Wright\"We are living in the Badlands. Dorothy's ruby-slippers would get you across the Deadly Desert. So will these poems.\"—Jonathan Williams",
  "genres": [
    "Poetry"
  ],
  "author": "Alfred Starr Hamilton",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/17449471-a-dark-dreambox-of-another-kind"
}