{
  "title": "An Unexpected Magick",
  "description": "Having lived his entire life under the veil of the high sorcerer’s repression, Wen Daneson grew up with a sword in his hand. Now, at twenty-eight, he’s already earned the rank of second lieutenant in the draegan lord’s guard and been granted the privilege of sitting on the lord’s council of advisors. In spite of his achievements, he’s made a point of keeping his distance from personal relationships. He’s seen too many people develop close bonds and share their hearts, only to have everything torn apart with one slash of a sword. Which is why his attraction to the human Wesley Brannock unsettles him so much. There’s something different about Wesley. Wen doesn’t want to care about the younger man, but when he’s tasked with training the inexperienced yet naturally talented Wesley for a position in the guard, being around him stirs powerful emotions he can’t understand.Wesley grew up living in secluded villages, learning at a young age to hide from prying eyes and keep to himself. Having spent most of his formative years with little company, when the settlement where he lives is attacked by the sorcerer’s soldiers, he’s frustrated that he doesn’t have the skills to fight back. The draegans who come to their aide encourage the residents to relocate to the draegan camp, and when they do, a new world opens to Wesley. He’s determined not only to learn how to protect himself but to join the draegan lord’s guard and be part of something that matters. But when he’s paired with the passionately intense Lieutenant Daneson, he begins to doubt whether he’s suited for the guard at all. Not only does the lieutenant push him hard while never letting him close, keeping Wesley constantly torn over his feelings for the man, being around so many people after years of isolation makes it hard to keep the secret he’s spent his whole life protecting.On the eve of war, the two young men have to decide if facing their secret fears will destroy them or give them unexpected strength to face the coming darkness. Gay / Fantasy / Shapeshifter / Witchcraft / Magic / Series",
  "genres": [
    "Fantasy",
    "M M Romance",
    "Dragons",
    "Paranormal",
    "Shapeshifters",
    "Romance",
    "Magic"
  ],
  "author": "M.L. Rhodes",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/17450112-an-unexpected-magick"
}