{
  "title": "The Savage Series 1-3: Pearl Blood Savage",
  "description": "★For fans of THE OUTLANDER and THE BLACK DAGGER BROTHERHOOD★From the NYT bestselling author of the dark romance, A TERRIBLE LOVE, comes a tale of criminal geneticists who interfere with predestined matches between the women and men of an unforgiving world.3 book boxed set.THE PEARL Clara Williamson is a princess living in a dark post-apocalyptic future of bio-spheres fashioned to protect 1890s America. A time when marriages are arranged for things other than love. When her sadistic mother betroths her to an abusive prince from a neighboring sphere to secure their future in illicit trade, Clara determines to escape.Leaving a life of familiar terror behind, she embraces the dangers of Outside that no one from the spheres has seen in nearly a century and a half.Clara escapes tyranny only to discover the sphere-dwellers are not the only people who survived the cataclysmic events of one hundred forty years prior. She finds herself trapped, unable to return to the abusive life of the sphere while facing certain danger Outside.Can Clara find love and freedom with the peril that threatens to consume her?THE SAVAGE Clara has become queen and yearns to unlock the puzzle of her lineage. Matthew and Bracus, survivors of the post-apocalyptic Outside and protectors of the Band, accompany Clara in her journey to the eastern seaboard to discover her true family.Trouble seeks them in the form of the Fragment, a maundering group of nomadic criminals, who thrive on exploitation and control. When the faction absorbs Prince Frederic into their ranks, they undertake a plan to involve Clara and her home sphere in a dangerous scheme of coercion for their own gain.It isn't long before Clara discovers a terrible secret about the very ones who saved the people of her kingdom from certain destruction. The Guardians are not who they seemed. Through terrible circumstances she must escape, can Clara protect herself from her own destiny and keep the integrity of her sphere intact?Will the needs of her people, war and tribulation overwhelm her need for a love all her own?THE SAVAGE King Raymond is betrothed to Princess Ada of a neighboring sphere in an arranged match not of his choosing. Travelers from a parallel world have bargained to save the future of his people and he cannot refuse their offer.Raymond does not believe that an alliance with the Savages would result in a life-altering experience. He soon finds himself overwhelmed when an entanglement of emotion and love conspire to undermine his vow in the most unlikely place.Rowenna, warrior female of the Band, is a much sought-after female select. When her kin agree to an offer that will unite the races of their future, they do not realize what the sacrifice will cost her.Can the two peoples of separate societies survive the prejudicial position that has been hoisted on them? Will their sacrifice afford a future of liberty, or will heartbreak be the only consequence of their love?Mega-length compilation.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Paranormal",
    "Paranormal Romance",
    "Dystopia",
    "Fiction",
    "Romance"
  ],
  "author": "Tamara Rose Blodgett",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/17450967-the-savage-series-1-3"
}