{
  "title": "Three Sumner Tales: TV Scripts Based on the Sting Endorsed Biography 'A Sting in the Tale'",
  "description": "Three Sumner Tales is a story of Sting the boy, the young man … it is an absolutely incredible piece of work. Adapted into 3 x 30 minute semi-biographical situation comedies (TV sitcom) from the book ‘A Sting in the Tale’, the only biography about, and approved of, by Sting.Each eye-wateringly funny script in this ebook is based on real life events featuring Sting, Jim Berryman and related characters. It is set in 60s and 70s Newcastle before Sting rose to fame as the frontman of the band The Police.Sting once said to Jim, “You’re Falstaff to my Prince Hal.” Just as that may be, then it is equally so of the Falstaff persona of Berryman in leading the apparently wayward Prince Hal persona of Sting into trouble. However, in stark contrast to how when Hal eventually becomes king and he disowns Falstaff, Sting’s investiture as king of rock did not change his friendship with Jim.Each of these real life scripts delivers some really slick comedy, and Jim Berryman’s writing talents bring to each one of them a kind of magic that is totally hilarious and in the tradition of TV’s ‘Only Fool’s and Horses’, ‘Dad’s Army’ and ‘Fawlty Towers’. The intricate storylines in ‘Three Sumner Tales’ are delivered with a sprinkling of slapstick that has been lovingly-crafted. Even though these relate to some years after their setting, Jim Berryman’s writing is evergreen. Revealed within are issues of Sting’s personality, tension and victory, all set against a background that will appeal to any age.Jim Berryman and Gordon Sumner, also known as Sting the rock star, is as highly an unlikely friendship as there could ever be. From when they were both first year pupils at a rather austere Catholic school for boys, they have remained friends for over 50 years!STING PROFILEResidence: 41 room Jacobean castle which he calls Lake House. Others in St James's, London, Porto Fino, Italy, New York and Los Angeles.Awards: 16 Grammy Awards, 3 Brit Awards, a Golden Globe an Emmy Award and several Oscar nominations for Best Original Song.Academic qualifications: Honorary doctorate degree in music from Northumbria University.Professional memberships: Member of both the Rock and Roll Hall of Fame and the Songwriters Hall of Fame.Social circles: Performs at places like the Meydan Racecourse launch in Dubai.Wealth: Estimated to be worth: over £200m.Backroom staff: Collaborated with a Pulitzer prize-winning writer for his play/musical ‘The Last Ship’.JIM BERRYMAN PROFILE - Slightly less impressive....Residence: Flat on a working class estate in Newcastle which he calls his spiritual home.Awards: \"Yard of ale drinking champion\" at Appleby Horse Fair.\"Impoverished Bookmaker of the year\" 1976-1981Academic qualifications: Several A and O-levels from St Cuthbert’s Grammar School and a swimming certificate for the 100 yard breaststroke. Institute of Cost and Works Accountancy Parts 1 & 2 (FAIL).Professional memberships: Former member Northern Bookmaker's Protection Association (asked to leave).Social circles: Often appears at Innisfree Social Club quiz night and some lavish Sting parties.Wealth: Estimated to be worth: a right few quid behind Sting.Backroom staff: Jim Berryman, his fingers and a keyboard to create his TV scripts of ‘Three Sumner Tales’.NOTE FOR ANYONE WISHING TO USE THE SCRIPTSAnyone wishing to create a TV sitcom or stage play based on these scripts is welcome to contact the publisher (web address at end of ebook) to discuss the matter further.",
  "genres": [],
  "author": "James Berryman",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/17451012-three-sumner-tales"
}