{
  "title": "Dominio della Morte",
  "description": "“Despite being a relative newcomer to the fray, there is a distinctly old-fashioned feel to Dylan J. Morgan’s stories. They call to mind the days of such beloved pulp fare as Tales from the Crypt and The Vault of Horror. Add in a distinctly British sensibility to the prose, and an awareness of how to employ the right cues to make a hair-raising scare, and you can be sure to have a hell of a good time with Morgan’s work.”– Kealan Patrick Burke, Bram Stoker Award-winning author of Kin, Nemesis, and The Turtle BoyDominio della Morte.Death’s domain.A place where the dead linger; where they suffer in silence, and decay in abject torment. A place where monsters dwell: werewolves, zombies, ghosts . . . vampires.In a diseased, broken world, man is no longer top of the food chain . . . Not even death can stop the work of a serial killer . . . In the depths of a lake a young girl waits for the return of her father . . . Returning from the dead will be nothing like you expect . . . An all-night train ride reveals the ghosts of mankind’s worst atrocity . . . A talented artist adds the final piece to his macabre exhibition.Dominio della Morte — A place where you will find your fear.Dominio della Morte is a collection of 19 short stories by one of the best kept secrets in the world of indie horror. Described as gory, dark, compelling, and frightening, Dylan J. Morgan’s writing has shocked, nauseated, and engaged the reader’s fortunate enough to have stumbled upon his work. So step inside, watch your back, and if you’re searching for that light at the end of the tunnel then stop looking — you won’t find it here.“Haunting and emotionally eerie, Dylan J. Morgan plunges readers into a sea of insanity.”– S.D. Hintz, author of When Slumber Falls\"Dylan J. Morgan is one of those names you'll be unfamiliar with, but by the time you read this collection you'll be searching out more of his work! Truly gifted writing and even more disturbing, each story is brimming with such rich background and characters you'll wish they were all novels! Remarkable!\" – Armand Rosamilia, author of the Dying Days zombie series “Dylan J. Morgan's writing will convince you from the opening paragraph that he is indeed, a gifted teller of tales.”– Carrie Clevenger, author of Crooked Fang",
  "genres": [
    "Horror"
  ],
  "author": "Dylan J. Morgan",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/17451753-dominio-della-morte"
}