{
  "title": "Michael Meyer's International Suspense Duo",
  "description": "Two international thrillers in one. COVERT DREAMSWhat if the government said that your missing wife never existed?A business trip to the Middle East for Stan and Valerie Halsey ends in chilling confusion and despair as Valerie seemingly falls off the face of the earth, leaving no trace of her existence behind.Back in the States, B.J. wakes up night after night in a cold sweat from the exact same torturous nightmare that takes place in a country he has never been to. Both B.J. and Stan suspect that they have been sucked into a conspiracy that threatens to consume them and everyone they love.With time running out fast before they can get answers, they have unwittingly entered into a very dangerous game...one that they may not survive.If you love fast-paced international thrillers, then take on COVERT DREAMS. It is like \"reading Robert Ludlum and the Bourne series\" - Dale Roberts, mystery writer.\"Don't start reading this book on an evening when you have to get up early the next morning, because you're going to find it hard to put down!\" - Nick Russell, NY Times bestselling author of BIG LAKEDEADLY EYESCould murder threaten a rocky romance?When Cuff and Rosie, laid-back lovers on their idyllic Caribbean paradise of St. Croix, are just beginning to move their relationship to the next level, they suddenly find themselves entangled in the crosshairs of an unknown stalker whose relentless pursuit knows no bounds. Now, with their lives on the line and time running short, they know they must act fast or they will die.If you enjoy mysteries set in exotic locales, then don't miss DEADLY EYES with its \"fast paced action coupled with the mesmerizing and intense suspense.\" (Marilou George - The Kindle Book Review)Semifinalist for the Best Indie Books of 2012 award. It's like having two books in one - with two alternative endings.",
  "genres": [],
  "author": "Mike  Meyer",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/17452618-michael-meyer-s-international-suspense-duo"
}