{
  "title": "Under Cover",
  "description": "Kali Styx was sent to a boarding school across the country where she knows absolutely no one, but goes because she is determined to be with her own kind. Things are going well at first. She has friends. Classes are fun until strange things start happening. They have always happened, her friends say. But she’s the first to say anything about it. Or so she thought. Her father is the dean. Her mother whom she never met...dead. She was told she was the product of half human/half angel with the strongest power to rule over her future if she gets control of her powers. But with so many lies starting to come alight at the Styx Gifted Institute where her father seemingly holds all the cards, she can’t help but ask why she was really brought here.Hayes Under, the darkly wicked level ten in her class has his say in her life on a daily basis whether it’s nice or not. He has the ability to block her famous spells and get under her skin at every turn. Webb Travis, who seems so angry all the time, has the same abilities and no one else seems to notice the way he hides it.They are both the same in some way, yet so different. Webb was sent to keep her safe. Hayes was brought up from birth with the sole purpose to cage her into her father’s web. She knows none of this. Yet.Her father is not a warlock like she thought for so many years. He is not an angel either. He is...the angel. He is one they call Lucifer. And he’s here on earth to watch over his own until she accepts her reign and takes her place with him. She’s not to come alone and daddy has the one he wants already picked out. Hayes is your all around boy next door, NOT! He is anything but...under the cover of night he is someone else altogether. Webb is determined to save her from something she does not know exists yet. He cares, that much is obvious. Kali is not going to let any of these guys see her sweat. They fool the rest, but not her. How will she elude Hayes? Capture Webb? And defy “daddy”?",
  "genres": [
    "Paranormal"
  ],
  "author": "Cyndi Goodgame",
  "average_rating": "4.92",
  "url": "https://www.goodreads.com/book/show/17453294-under-cover"
}