{
  "title": "A Bargain Bride",
  "description": "In a time when the west was wild...and the men were wilder... There came a challenge in the small town of Liberty, Texas. The objective in mind: Marriage.Bets are placed, and a race to the altar begins.Rough and tough rancher Gabriel O'Malley had never met a challenge he could not handle... until now.Fed up with his grandson's brooding ways, \"Pops\" O'Malley takes matters into his own hands, and orders a mail order bride for him. Besides wanting the best for Gabriel, there was a little matter of a bet going around that the old man was determined to win. The only problem was, his stubborn grandson was digging his heels \"spurs deep\" in and holding onto his bachelorhood ruining all of his grandfather's well laid plans.Gabriel, furious at his grandfather's conniving ways, was determined to rid himself of his unwanted \"bride\". He was going to live his life on his own terms come hell or high water, and settling down was not something he planned todo. Even if he did lust after the woman who shows up on his doorstep.After the death of her parents, Melody Williams was left with nothing but her baby sister to raise and an eviction notice on her door. She thought that finding the advertisment for a mail order bride was her lucky break. That is, until she meets her groom. Statues are friendlier than this hombre.But Melody is also stubborn. No one is going to stop her from making a home for her sister, least of all the sexy, grumbling rancher she has come to marry.Sparks will fly, tempers will flare, kisses will be had and shoes will be thrown...As the battle of the sexes begins. Can love blossom? With the help of a bunch of wily old men, the town of Liberty is counting on it.But not everyone is hoping for a happily- ever -after for the couple. From the shadows, evil lurks waiting to strike the ranch. Will it all be destroyed before their new life together can even begin?",
  "genres": [
    "Westerns",
    "Historical",
    "Historical Romance",
    "Romance",
    "Mail Order Brides",
    "Humor",
    "Western Historical Romance"
  ],
  "author": "Rebecca De Medeiros",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/17453487-a-bargain-bride"
}