{
  "title": "The Queen's Servants: Gentlewomen's Dress at the Accession of Henry VIII",
  "description": "The Queen’s Servants paints a vivid picture of the styles of dress worn at Henry VII’s and Henry VIII’s courts, using evidence from royal warrants and account books in The National Archive. Purchases by the Great Wardrobe for the ladies of gentle birth who attended the queens and their children are clues to the appropriate appearance of a woman in close contact with the royal family.Based on Caroline Johnson’s transcriptions and translations of more than 200 hand-written pages of the original Latin and English documents dating from 1485 to 1520, the book reveals a wealth of fascinating facts about expenditure on garments for gentlewomen serving at the Tudor court. The documents provide precise evidence of the fabrics and yardages, pinpointing features of cut and construction, such as the presence of padded pleats at the back of a gown in 1498 and the extravagant size of wide sleeves. The clothes demonstrate a transition in English style between the flowing lines of the late medieval period and those toward the end the reign of Henry VIII when French gowns and hoods became the characteristic wear of the elite. Typical furs, fabrics and colours are identified with their conventional uses for specific garments and indications as to how these changed over the 35 years of the survey period.Ninya Mikhaila’s patterns provide guidance on the reconstruction of a complete set of clothes for a gentlewoman at the turn of the century including several styles of smock, a typical kirtle and two styles of gown with a range of sleeve variations. Bonnets, pastes and frontlets are the usual items of headwear issued to gentlewomen during the era. Suggestions for recreating these are also provided. The patterns are based on the evidence from the royal accounts together with an extensive pictorial survey of portraits, brasses and stained glass and detailed examination of three-dimensional sources such as church effigies. The patterns are complemented by helpful diagrams dealing with practical techniques and useful tips for making the garments.",
  "genres": [
    "Fashion",
    "History",
    "Sewing",
    "Tudor Period",
    "Nonfiction",
    "Fashion History",
    "Historical Costume"
  ],
  "author": "Caroline  Johnson",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/17454175-the-queen-s-servants"
}