{
  "title": "Jo's Journey",
  "description": "Jo Strauss was committed to two things in her life – her family and her life as an acrobat/high-wire performer. She takes both very serious. Her life was orderly, in control, and she was finally settling down in one place so she could spend more time with her parents instead of moving all over the world every few weeks. To celebrate her and younger sister, Star’s, one year anniversary away from the circus they had grown up with, she and Star were meeting River Knight, their childhood friend and sister of the heart, for a vacation in the mountains in North Carolina. Everything goes as planned until she and her sisters are kidnapped. Now, she finds herself transported to another world. Aliens, warships, battles, and a certain male were not in the carefully detailed plans she had mapped out for her life.Manota Ja Kel Coradon is the second son of the ruling House of Kassis. He is known as the dark brother, a reputation that he lives up to. He has fought hard to protect his family and the people of Kassis, sometimes sacrificing parts of his soul to do so. His knowledge, skills, and development of weaponry are legendary. His skill as a warrior bring shivers of fear to his opponents who know he never gives mercy to any who stand in his way.Manota is in total control of his world until one slender, feisty alien female crashes through the shields he has placed around his heart. She is fearless, determined and stubborn. She absolutely refuses to cower before him, no matter how much he growls! He is determined to protect her and claim her as his own but there is one little problem – she will not agree to accept his claim unless he returns for her parents.Now, he has even bigger problems – that come in all different shapes, sizes, and species! The return trip is fraught with enough dangers but Jo and Star’s parents aren’t the only ones coming back to Kassis - so is the circus family who had gathered to help look for their missing family members.Traitors, pirates, and Mimes are just the tip of the iceberg of trouble gliding through warp speed to his home world. Manota is about to learn that the prophesy that was foretold centuries before is true. His mate is just as much of a warrior as he is and she comes with backup when an old enemy attacks!",
  "genres": [
    "Aliens",
    "Science Fiction",
    "Romance",
    "Science Fiction Romance",
    "Fantasy",
    "Paranormal",
    "Paranormal Romance"
  ],
  "author": "S.E. Smith",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/17454086-jo-s-journey"
}