{
  "title": "The Saga of I: The Complete Collection",
  "description": "\"It's always interesting to read early work by someone like Richard Laymon, John Little, or Gord Rollo, because you are looking at an established star's apprentice efforts. Sometimes the work is rough, the writer obviously learning by doing, but the writing and story-line is always compelling. And like those mentioned, Kenneth W. Cain achieves that with his writing. Grab the series and catch a rising star's early efforts. You won't be sorry. Recommended.\"--Gene O'Neill, THE CAL WILD CHRONICLES, and ENTANGLED SOUL with Chris MarrsThe Complete Saga of I Trilogy in ONE VOLUMEBook One: These TrespassesBook Two: Grave RevelationsBook Three: ReckoningWith a new Foreword from the authorNOW YOU CAN GET ALL THREE BOOKS IN ONE GIANT OMNIBUS.How far would you go for your brother? And when the Infinite returns for his lost children, how strong will the bond of brothers remain? Because that stranger will walk this land, unknown to even himself. He will be aware that he has not returned alone and it will take more than just luck to preserve the future of mankind.“Like the Walking Dead, but with aliens instead of zombies”“These Trespasses will have you reading until late in the night and hoping it really is just fiction.” ~ Book Reviews Weekly“Brought me back to Sci-Fi” ~ Amazon review“…through the last scene I found myself flipping pages faster and faster, eager to see how it was going to wrap up.” ~ The Daily Blam“An entertaining and exciting read, the author uses suspense masterfully making you want to turn the pages even faster. A definite must read for sci-fi/horror fans.” ~ Amazon review“These Trespasses is lean, mean, and hums along like a chainsaw revved up to full alien-shredding glory.” ~ Amazon review“Cain does a nice job of making each character unique, going so far as to alter the narrative when focusing on different people.” ~ Amazon review“As with Kenneth Cain’s first representation of The Saga of I, this was definitely worth the time to read. Sci-fi and horror fans will enjoy the story and underlying themes.” ~ Amazon review“The characters just come alive and you feel like you’re right there with them, experiencing what they’re experiencing!” ~ Amazon reviewAlien invasion, war and devastation; is Earth at its end?We hold precious our families. We work hard to provide for them. We struggle to put food on the table and to care for them when they are sick.What if all of that changed? What if those we cared for were inflicted with some horrible disease that we could not understand? What if that disease did not kill, but liberate, pitting you against your loved ones?In a small Midwestern town, the world as we know it is about to come to an abrupt end. Sheila has picked this moment in time to return to her hometown. Upon arriving, she finds the small community lying in ruins and she begins the struggle of discerning what has happened to her family, her friends, the people she grew up with. Her only clue is a single letter, left behind by a man named Marty.Soon, Sheila catches up to Marty. And with the world around them left in decimation, they band together with other survivors in search of escaping the destruction. But everything is not what it seems.The government has played a role in this destruction. What things did our government do in secret, nearly right under our noses, to bring an alien invasion to Earth?The answer to this question begins with Marty; the only survivor in their group who appears to have any knowledge of what has unfolded. Marty recalls his past, both distant and recent. He relays a story of great loss to his newfound confidants and in doing so, brings to mind many new questions.Marty is not the only one that knows of these horrors. Each of them must face the truth of the people they were before this destruction and the person they will need to become in order to confront this terror.What secrets lie among these friends? Has the government found a means of invading even this small group? And what of Marty’s brother? What is his role in the future of the Earth? What things will need to be done to ensure he doesn’t succeed?As their plight becomes hopeless, they are forced to take the battle to their enemy and strike at the heart of the matter. Here Marty must confront his brother. But will it come too late? And will Marty be able to drown out his memories and do what he must to save his friends?The story continues in book two…In the post-apocalyptic world, as mankind struggles to rebuild, a familiar face returns. As this man descends from the skies, unclothed and resembling a well-known historical figure, those who meet him have no choice but to confront their beliefs. Because of this, their morals, their souls, their very essence is tested.Marty is once more called to battle, as he sees a terrifying glimmer in Sheila’s eyes that he remembers all too well. This time, though, Marty is prepared. But can he count on everyone else to stand by his side and fight with him?But The Infinite, or I as he prefers to be known, has his own plans. Calculating in his approach, ever dominate, he has convinced many to follow in his footsteps, drink of his blood, and eat of his flesh. He has made food were there was none. He has performed miracles.Not everyone is so easily convinced. And when one stray servant discovers the truth, it will be chilling. It will change the way you think, the way you picture The Infinite. You will learn of his true self and as his plan unfolds, you will see just how menacing I can be.What will Marty face when he seeks the help of his friends? Who will stand by his side and fight this unimaginable creature? This is now personal, more than ever before. There are secrets, things that even Sheila has kept from Marty. But the all-powerful, all-knowing I sees everything. And I will use these secrets to weaken his brother, to bring him to the edge of corruption.Will Marty and his friends once more be able to save their planet from annihilation? The horrors they face this time will be more powerful, more terrifying, capable of buckling their will and breaking them down to the point of surrender. And behind it all will be the relentless I, with one sole purpose driving him, where the only acceptable outcome is to have his brother standing by his side.But do not count everyone out. There are not other forces at work here. Sometimes the unexpected is the very thing one needs to rely on.The story continues in book three…From out of the detritus and ruin of the Earth rises a familiar face. He knows not who he is, only what he will become should time expire. His journey in this post-apocalyptic world begins with questions, too many to list.In another part of what was once the Untied States, an old hero has been laid to rest. Those who loved him and knew him well revere and cherish their friend. Among those people is an ever grumpy, surly man. This man will need to motivate Marty’s son, Jacob. This is where Jacob’s journey begins.As Jacob travels across Pennsylvania, he is unaware of what dangers await him. Jacob has been trained by his father should the horrors of old ever return. But Jacob is not very confident in his ability to fight if he needs to. There are doubts, insecurities, and painful memories of lost loved ones.Visiting his Aunt Sandy to relay the bad news, Jacob is confronted by atrocities he had not imagined. These creatures, formed in part out of a being from their past, are vampiric in nature. They feed on the blood of humans and creatures alike, spreading their disease and increasing their numbers. But that is only the beginning of what Jacob must face.Somewhere among these mongrels are other creatures. One of these creatures, he knows well, having witnessed her this transformation. He fears having to face her wrath. The other is an unknown to Jacob. And although Jacob isn’t entirely positive, he does have his suspicions. Was his father right in preparing him? Is this who has returned, his father’s worst nightmare? These uncertainties are his alone to unravel.In their darkest hour, Jacob must trust his instincts and join forces with the one evil he has been instructed to kill. Should he ignore his father’s teachings in order to overcome the other terrors that await him? Will he have the courage to fight back? Will it be enough? Or will it simply be too late?Who of you will fight with Jacob as he protects everything we rebuilt? Prepare yourself. Only you can determine the future of the Earth.",
  "genres": [],
  "author": "Kenneth W. Cain",
  "average_rating": "3.14",
  "url": "https://www.goodreads.com/book/show/17454879-the-saga-of-i"
}