{
  "title": "Flesh Code: Vol. I",
  "description": "The education system in America is bad enough, but when the world's schools are brainwashing the future with New Order World rhetoric, well, the end result, is...zombies....This first novella in this Young Adult Series (Ages 14-and-up) explores the coming of the zombie horde (or scrats) who took the NWO'S compliance \"pill\" and are now ready to eat everyone in sight. Those that didn't turn were the small percentage of students who thought for themselves and now must use those smarts to survive the zombie apocalypse.Also, the adults who didn't take their own pills are left to fight the millions of zombies who felt the NWO was to be listened to and trusted.As two cousins trapped in their respective schools on two different sides of the United States try to keep in touch through this new war, kids all over the world move toward social media sites and text messaging to help each other survive the zombies' attack on those who were smarter than them to begin with.\"Flesh Code: Vol. I\" is written entirely in social media formats as the young turn toward what has become their primary way of communicating in the 21st century. As the New World Order moves in on shutting down all communication, kids rally to find the best way to stage their fight against the ghoulish flesh eaters they once called their friends.\"Flesh Code: Vol. I\" is the alternative, YA universe version, of Alan Dale's \"Dead Nations' Army\" trilogy which launched in July with \"Code Flesh.\" Four characters from \"DNA\" have crossed over into the \"DEA\" series while a number of characters in one book have an alternative personality in the other.A series that has caused plenty of controversy and brought in its share of enemies, both the \"DNA\" and \"DEA\" series hope to entertain as well as inform readers of the world we live and where we are headed...Join the Army...become fresh flesh...",
  "genres": [
    "Zombies",
    "Government"
  ],
  "author": "Alan  Dale",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/17455240-flesh-code"
}