{
  "title": "Judgement Of The Vampire",
  "description": "\"I had hoped, especially since the humans had sided with the Great Council during the vampire war, that the humans would make a much better job of running the world than had us vampires… …My hopes that the humans would do better than we vampires had were to be dashed.\"This is the follow up book to The Liverpool Vampire. As this book is a follow up story, readers should read The Liverpool Vampire first so that they may gain the fullest enjoyment from this story.Set in Britain in 1976, eleven years after the events in The Liverpool Vampire, Judgement Of The Vampire tells the separate stories of Stephen and Dafydd. Stephen is determined to heal the wounds of the past that were caused by the vampire people, and he has been working for over 1000 years to achieve his goal. Dafydd seeks to subjugate the human race, starting with Britain, and he is willing to push the rules of being a vampire as far as they will go.Judgement Of The Vampire charts the development of Dafydd's sociopathic personality and the damage that being a vampire has done to him, as well as the history and motivations of his creator, Stephen the vampire. Completely opposed in their aims, the vampires will eventually clash in the end.Judgement Of The Vampire is an adult book and is not suitable for children.Brief background: My vampire series is an examination of an awful kind of person – the sort of person who, in real life, really wouldn’t have any problems being a serial killer. In a sense, vampire stories are serial killer stories, but they’re not like any of the serial killers that you could Google or name off the top of your head; these are the sort of killers that many serial killers see themselves as – magical, able to act with impunity; special. If we can look at the vampire and, after seeing him in the worst possible light, still sympathise with him and still root for him on some level, what does that say about us as people? \"Humanity needs its vampires.\"",
  "genres": [],
  "author": "Michael Pugh",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/17455321-judgement-of-the-vampire"
}