{
  "title": "Sable Does It in the Kitchen. Cookbook: Volume 1",
  "description": "Sable Hunter does more than write racy romance novels, she can also cook! Many fans have asked for recipes that were mentioned in her books - so here are some of them, there are also recipes included that were given to her by author friends and fans. Sable's dishes are made with a southern flair that only those native to certain parts of the South can conjure, as Sable has spent her life in Texas and Louisiana, home of some of the greatest cuisines in the world! Inside you will find several of Sable's favorite dishes from Grilladas, Gumbo andEtoufee to a Pork Loin stuffed with Cajun Boudain. If you keep reading you'll find the secret McCoy Recipe for their fool-proof smoked brisket which is showcased in her Hell Yeah! Series. As you progress through the cookbook, you'll find various links provided that will take you to the places where you can buy things like Tony Chachere's Cajun Seasoning, as well as the smoker used to cook some of these dishes. You'll find the recipes are divided into Sections called 'Savory' for meat and vegetable dishes, and 'Sweeter' for desserts. These terms are a play on words about her books. Sable had become known for her steamy, savory romances, but the story-line has always been the most important element. So as to appeal to a wider audience, she will be releasing her Hell Yeah! books in a 'Sweeter' version in 2013 with the same emotional story and characters, but with a little less risqué material. Inside 'Sable Does It in the Kitchen' there is PG excerpts of her work, if you'd like to take a peek, as well as links to her website and other places you might find Sable on the web. Over 60 Recipes and excerpts are not the only things you'll find; at the back there are a couple of surprises - 'future glimpses' of her work, as well as printable Tags and Bookmarks. Welcome and join us as \"Sable Does It in the Kitchen\"",
  "genres": [
    "Cookbooks"
  ],
  "author": "Sable Hunter",
  "average_rating": "4.61",
  "url": "https://www.goodreads.com/book/show/17455420-sable-does-it-in-the-kitchen-cookbook"
}