{
  "title": "Walden, Civil Disobedience, and Other Writings",
  "description": "This revised and expanded Third Edition adds three important post-Walden essays, \"Slavery in Massachusetts,\" \"Walking,\" and \"Wild Apples,\" bringing the full scope of Thoreau's mature powers to twenty-first-century readers. The texts are accompanied by explanatory annotations, Thoreau's survey of Walden Pond, and the 1852 Walling map of Concord village and its environs. As a unique feature, the Third Edition includes generous excerpts from Thoreau's journal, reprinted by special arrangements with Princeton University Press from the definitive edition of his writings. Spanning the years 1845-54, these selections vividly display Thoreau's intensive exploration of his local landscape; the fusion of literary and natural history field work that informs Walden , \"Walking,\" and \"Wild Apples\"; and the growth of his environmental imagination.“Reviews and Posthumous Assessments” for this edition collects eight new reviews of Thoreau's antislavery and late environmental essays as well as of Walden . To the influential portraits of Thoreau by Ralph Waldo Emerson and James Russell Lowell, the Third Edition adds John Burroughs's \"Another Word on Thoreau,\" his response to them and to his great predecessor.”Recent Criticism” includes eighteen selections of the best historical, political, philosophical, poststructuralist, and environmental criticism of Thoreau's writing since the mid-twentieth century. To classic pieces by E. B. White, Leo Marx, Barbara Johnson, and Stanley Cavell, the Third Edition adds essays by nine new contributors, among them Laurence Buell, Laura Dassow Walls, Evan Carton, Robert A. Gross, Albert J. von Frank, Steven Fink, and William Rossi.A Chronology of Thoreau's life and work, new to the Third Edition, and an expanded and updated Selected Bibliography are also included. 1 map",
  "genres": [
    "Philosophy",
    "Classics",
    "Nonfiction",
    "Politics",
    "School",
    "Essays",
    "Literature"
  ],
  "author": "Henry David Thoreau",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/1079816.Walden_Civil_Disobedience_and_Other_Writings"
}