{
  "title": "Shadow of the Final Storm",
  "description": "5 STARS Book ReviewReviewed by Rabia Tanveer for Readers' FavoriteShadow of the Final Storm: A Haunting Novel of Death and Life by Carol McClain Craver is the story of a woman who goes back to her hometown and is surprised to find that the things in her past are still alive. Sirena Vestal had no idea that she would be able to meet her past when she moved back to her childhood home in Galveston. She meets a mystic who tells her that her old self is still here. Just because Sirena moved on does not mean that her past self has moved on too. She revisits her past in 1900 when she was a young girl and about to become a bride. That was also the time when a hurricane hit Galveston and devastated its land and people. Sirena will find the answers to all her family mysteries and she will find out things she had no idea she wanted to know.I have to say, author Carol McClain Craver brought the punch right from the beginning. The way she wrote made me feel like a friend to each and every character in the novel. I was immersed in the story right from the start, there was nothing that I did not like. Everything was perfect, from the setting to characterization to imagery to every single alliteration. Even the cover of the novel was perfect. I could hear every crash of the ocean waves, I could taste the salty spray, feel Herk’s contempt and feel Silas’ longing. A great romance novel that has a bit of everything, but it works somehow. It is, indeed, one of the best novels I have read this year!From the Author: Our souls are on a journey that our bodies can't complete. ~ from Sirena's journal ~ The past is dead and gone. Or is it? When an artist sets out to find forgotten memories of her childhood, she moves back into The Pink House, the only place she had ever been truly happy. As a flood of memories washes over her, she opens her eyes to a life she never knew.Set in Galveston during the 1900 hurricane, and in current day Galveston, SHADOW OF THE FINAL STORM steps readers through a Circle of Veils and plunges them into a river of time.  ~ I am from the future, the past and the present. I am a living soul within a dying body. ... This is not reincarnation. It is incarnation. This is the condition we call life. ~ from Sirena's journal",
  "genres": [],
  "author": "Carol McClain Craver",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/17455646-shadow-of-the-final-storm"
}