{
  "title": "Clean Slate Complex",
  "description": "(Note: this is a parallel story to daynight that can be read before or after daynight. Timing is after daynight occurs.)Meet The Second Chance Institute (SCI): Worldwide non-profit and do-gooder organization. Their motto: Because Everyone Deserves a Second Chance at Life(TM). Reality: hidden behind every kind act is a dark agenda designed to gain control and force societal and moral extremes. Currently, the SCI’s pushing Project Liberate, a program to woo the poor and downtrodden into their Clean Slate Complexes—where “everything is provided” from jobs to food, shelter, clothing, and education. Unfortunately, as with all things that sound too good to be true, there’s a catch…Meet Alexa Knight. Feisty, tough and currently homeless in Los Angeles, Alexa agrees to help the SCI in return for medical care for her sick mother. When she starts to suspect there’s more to the SCI than meets the eye will she believe Adam—the boy who saved her life and the SCI’s biggest champion, or Joshua—the attractive enigma who sings about conspiracy theories and pretends to be someone he’s not?Full of action, humor, romance, twists and turns, clean slate complex is a companion story to the highly-praised dystopian novel, 'daynight'. It can be enjoyed before or after reading 'daynight'.Praise for 'daynight':Book of the Year Award Finalist-Young Adult Fiction, ForeWord Reviews\"Sure to win over YA readers looking for a dangerous, dystopian adventure story\" --Kirkus Reviews\"Gripping young adult dystopian novel; compelling conflicts; high stakes; powerful narrative; surprises keep coming; strong writing; page-turner; engaging characters; Readers will be hungry for the sequels.\"--BlueInk Review (starred review)\"Thomason's description of Thera's totalitarianism will make fans of Brave New World shiver... SCI, her fantasy corporation, has disturbing parallels to actual companies and regimes that claim to do good while harming people... The author deftly appeals to both romance-loving teens as well as those intrigued by young adults fighting the establishment.\"--ForeWord Clarion Review, 4 stars",
  "genres": [
    "Dystopia",
    "Young Adult",
    "Science Fiction",
    "Romance",
    "Fiction",
    "Speculative Fiction",
    "Suspense"
  ],
  "author": "Megan Thomason",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/17456416-clean-slate-complex"
}