{
  "title": "Tudor: The Family Story",
  "description": "# For 'Best Books about the Tudors: facts behind the Wolf Hall trilogy' the Times of London recommends Tudor: The Family Story  Sunday Times top ten Bestseller; BBC History Book of the Year; a Daily Telegraph Book of the Year; a History Today Book of the YearThe Tudors are England’s most notorious royal family. But, as Leanda de Lisle’s gripping new history reveals, they are a family still more extraordinary than the one we thought we knew.The Tudor canon typically starts with the Battle of Bosworth in 1485, before speeding on to Henry VIII and the Reformation. But this leaves out the family’s obscure Welsh origins, the ordinary man known as Owen Tudor who would fall (literally) into a Queen’s lap—and later her bed. It passes by the courage of Margaret Beaufort, the pregnant thirteen-year-old girl who would help found the Tudor dynasty, and the childhood and painful exile of her son, the future Henry VII. It ignores the fact that the Tudors were shaped by their past—those parts they wished to remember and those they wished to forget.By creating a full family portrait set against the background of this past, de Lisle enables us to see the Tudor dynasty in its own terms, and presents new perspectives and revelations on key figures and events. De Lisle discovers a family dominated by remarkable women doing everything possible to secure its future; shows why the princes in the Tower had to vanish; and reexamines the bloodiness of Mary’s reign, Elizabeth’s fraught relationships with her cousins, and the true significance of previously overlooked figures. Throughout the Tudor story, Leanda de Lisle emphasizes the supreme importance of achieving peace and stability in a violent and uncertain world, and of protecting and securing the bloodline.Tudor is bristling with religious and political intrigue but at heart is a thrilling story of one family’s determined and flamboyant ambition.",
  "genres": [
    "History",
    "Nonfiction",
    "Tudor Period",
    "Biography",
    "British Literature",
    "Historical",
    "Audiobook"
  ],
  "author": "Leanda de Lisle",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/17456974-tudor"
}