{
  "title": "Our Picnics in the Sun",
  "description": "Award-winning author Morag Joss has penned a beautifully rendered, meticulously crafted, and terrifyingly gripping novel of suspense—ideal for the fans of Eowyn Ivey, Ruth Rendell, and Barbara Vine.One night, two strangers.A damage that cannot be undone.For thirty years, Howard and Deborah Morgan have poured all their energy and modest savings into Stoneyridge, a smallholding deep in the English moors. Howard putters with pottery, Deborah dabbles in weaving, and both struggle to tend sheep and chickens and live off the land. But what began with simple dreams of solitude and sunlit picnics in the hills has given way to a harsher reality. To help with finances, they decide to turn Stoneyridge into a bed-and-breakfast. But a sudden stroke leaves Howard incapacitated and Deborah overwhelmed. Howard’s world, once so limitless, has shrunk to the confines of their crumbling house; Deborah’s main joy now comes in the form of a brief weekly email from their successful son, who lives abroad.Then, late one evening, two men arrive needing a room for the night—and set off a chain of events that uncovers the relics of old tragedies. New wounds are cut deep, betrayals and cruelties intermix with tenderness and love. And through it all, Stoneyridge quietly hides the bitter and transformative truth.Evocative, intimately claustrophobic, and psychologically complex, 'Our Picnics in the Sun' is a novel of stunning prose and knife-sharp insight. Morag Joss crafts a modern masterpiece of rising tension that binds and releases like a beating heart, propelling readers to a final page that resonates and haunts.Praise for Morag Joss’s 'Among the Missing':“This remarkable novel has an abundance of suspense at its core, put forth in beautiful prose that all but glows on the page. . . . [Joss] keeps a jittery tension going as the novel spins toward its violent, grand-scaled finale.” - Booklist (starred review)“A haunting, harrowing punch to the heart, 'Among the Missing' is flat-out brilliant. About the secrets we keep, the lives we are desperate to live, and the chances we miss, it’s a psychological dazzler. Truly, one of my favorite books of this year—or any year.” — Caroline Leavitt, author of 'Is This Tomorrow'“Morag Joss is a writer who knows the old truth that genuine suspense comes not from car chases or gunplay but from the clash of conflicting hearts. 'Among the Missing' is evidence not of a rising talent but of one already fully formed.” — Thomas H. Cook, author of 'Sandrine’s Case'“A spectacular psychological thriller . . . Joss’s beautiful, evocative novel is filled with tension and suspense.” - RT Book Reviews",
  "genres": [
    "Mystery",
    "Fiction",
    "British Literature",
    "Thriller",
    "Contemporary",
    "Mystery Thriller",
    "Suspense"
  ],
  "author": "Morag Joss",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/17456963-our-picnics-in-the-sun"
}