{
  "title": "Paragon",
  "description": "In the middle of the Arizona desert, a hundred feet underground, the United States military is illegally developing the first emotionally sentient android. Classified top secret, the mission has failed to successfully awaken the first two androids created in the lab.When brilliant neuroscientist Chal Davidson is called in to assist, the third android is just hours from being awakened. By the time she realizes the vast implications of her work, it's too late to stop the prototype's development. Torn by her moral and scientific responsibilities, Chal is even more confused by the emotional connection she is starting to feel with the newly-created man. The only hope she has is escape--for her and the android--and time is running out... EXCERPT:He floated now in the tank, attached with an IV to the liquid that would wake him from his unconscious rest. It was remarkable how much he looked like a normal human. Chal knew that, physically at least, he was as human as she was. It was just a matter of making sure his mind could weather the transition into consciousness. His dark hair waved in slow motion in the water. She watched him, for the first time taking in his appearance.Alan.He was handsome, and this was something that she had not prepared herself for. His body was perfect, chiseled and lean, and his facial features were decidedly masculine, dark eyebrows slanting across his brow, an aquiline nose. His naked body bobbed slightly in the saltwater, and Chal adjusted the padding around the sides, not wanting him to bump his head on the tank walls. She moved slowly, carefully, but her hand accidentally touched the prototype's limb. She let her fingers move on his skin. He felt warm to the touch, and Chal let his wet skin glide under the pads of her fingers. Smooth. Like a baby. Yet full-grown, a man already on the outside. It was strange, and as Chal examined him she felt a mixture of emotions surge forward under her skin. Curiosity surpassed all of the rest, but it wasn't a clinical curiosity as it had been in the past. Every animal she had worked with had been on the very low end of the Freitas consciousness spectrum. The difference between a baby rat and a full-grown rat had more to do with size and mobility than with intelligence. They could both run mazes, after all. But a human man is so different from a human infant that Chal trembled at the thought of waking the prototype up.Her hand traced the line of his shoulder, his neck. She was curious who he would be once he woke up. Would he be a conscious person? Really? His mind would be an infant's, although not for long. She would have to remember that, to make a point of remembering.His face was calm as her hand made its way up to his cheek and rested there. Chal's fingers stroked the skin at his temple absentmindedly. What will you think when you wake up?",
  "genres": [
    "Science Fiction"
  ],
  "author": "Aubrey Watt",
  "average_rating": "3.06",
  "url": "https://www.goodreads.com/book/show/17458531-paragon"
}