{
  "title": "Dark Child (the Awakening): Episode 5",
  "description": "Perfect for fans of The Mortal Instruments series by Cassandra Clare, this intriguing urban fantasy follows the story of Kat Chanter, who discovers that the world she knows is controlled by ancient creatures who feed on blood. And she might just be one of them ...Then she heard it; faintly at first, but quickly becoming louder. Her faint prickle of unease became a crawling apprehension that made every hair on her body stand on end. Because there was no mistaking the sound that was drawing ever closer. The excited baying, the mournful howls of wild creatures as they grouped and closed in for the kill.Cold dread swept through her, chilling her to the bone. The pack was here.The future seems hopeless, and Kat's life is in the balance. Is it possible that she holds the key to their survival? Because if she can't find a way to unlock the knowledge within herself, it won't just be her life that's forfeit, but also the lives of the unalil, and of their captive sister . . .This is a novella length episode of Dark Child (The Awakening)*, first in the Dark Child series. All five episodes are also available bundled as Dark Child (The Awakening): Omnibus Edition. Look out for the next in this series, Dark Child (Covens Rising) available July 2014.*Dark Child (The Awakening) was originally published in 2013 as Dark Child Episodes 1-5 and Dark Child Omnibus Edition.Recommended Dark Child reading order Child (The Awakening) Episode 1Dark Child (The Awakening) Episode 2Dark Child (The Awakening) Episode 3Dark Child (The Awakening) Episode 4Dark Child (The Awakening) Episode 5followed byDark Child (Covens Rising) Episode 1Dark Child (Covens Rising) Episode 2Dark Child (Covens Rising) Episode 3Dark Child (Covens Rising) Episode 4Dark Child (Covens Rising) Episode 5OR Dark Child (The Awakening) Omnibus Editionfollowed byDark Child (Covens Rising) Omnibus Edition",
  "genres": [
    "Paranormal"
  ],
  "author": "Adina West",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/17458643-dark-child-the-awakening"
}