{
  "title": "Master Keys to Spiritual Freedom",
  "description": "It is an ancient axiom that the truth will set you free and the truth contained in this book will indeed give you the keys to spiritual freedom. There is probably no other spiritual book that gives you such a clear an accessible view of the basic dynamic of the universe. This is truly the big picture that will answer many of your questions about the spiritual side of life. The book is a direct revelation by Lord Maitreya, who was the master teacher in a mystery school known commonly as the Garden of Eden. Maitreya explains in great depth what caused the fall or man, which was truly a fall into a lower state of consciousness. In this state of mind, everything seems to be defined by its relationship to two opposite polarities, such as good and evil. Yet in reality both polarities are defined by the mind that is separated from the oneness of God. Maitreya explains how it was indeed necessary for students in the mystery school to experiment with this \"knowledge of good and evil.\" Thus, the fall was not caused by the students experimenting, but by their unwillingness to take responsibility for making their own decisions. The students then used the dualistic consciousness to \"justify\" separating from the teacher, and many people have upheld this decision to this day. Thus, the only way to make spiritual progress beyond a certain point is to once again make peace with your spiritual teacher. Maitreya also explains how outer religions have actually been created in order to justify not going back to the spiritual teacher. Religions make it seem like you can be saved without making peace with the teacher and thus with God. He then outlines a change to the religious debate that all spiritual seekers can help bring about. Maitreya also gives in-depth descriptions of how the entire universe works, including the origin of evil, the existence of spheres above and beyond our own, the age of the Earth and the many evolutions that have passed through earth's schoolroom since it was first inhabited by self-aware beings 2.5 billion years ago. Once again, these revelations will help you see the big picture and thus answer many of the questions left by other spiritual or religious teachings.",
  "genres": [],
  "author": "Kim Michaels",
  "average_rating": "4.80",
  "url": "https://www.goodreads.com/book/show/1746298.Master_Keys_to_Spiritual_Freedom"
}