{
  "title": "Empire of Secrets: British Intelligence, the Cold War, and the Twilight of Empire",
  "description": "Against the backdrop of the Cold War and the looming specter of Soviet dominance in Britain's dwindling colonial possessions, the imperial intelligence service MI5 played a crucial but virtually unseen role in tipping the scales in favor of America and her allies. Working clandestinely behind the scenes, MI5 operatives helped to prop up newly independent states across the globe against a ceaseless campaign of Communist subversion. Though the CIA are often assumed to be the principal actors in the prolonged struggle against the KGB and other Soviet agencies, the so-called \"special relationship\" between Britain and the United States became the driving force behind an enormous overhaul of Britain's colonial intelligence system, which would play a key role in destabilizing and defeating the Communist threat.In Empire of Secrets, pioneering intelligence historian Calder Walton reveals how Britain contributed largely silently yet stunningly effectively to the Cold War effort, their victories as invisible to the larger world as their defeats. Mining recently declassified intelligence records, Walton uncovers this missing link in Britain's post-war history. He sheds new light on everything from violent counterinsurgencies fought by British forces in the jungles of Malaya and Kenya, to urban warfare campaigns conducted in Palestine and the Arabian Peninsula. Drawing on a wealth of top-secret documents, as well as hitherto overlooked personal papers, this is the first book to utilize records from the Foreign Office's secret archive, which contains some of the darkest and most shameful secrets from the last days of Britain's empire.Packed with incidents straight out of a John le Carre novel, Empire of Secrets is an exhilarating read by an exciting new voice in intelligence history. The stories here have chilling contemporary resonance, dealing with the use and abuse of intelligence by governments -- state-sanctioned terrorism, wartime rendition, and \"enhanced\" interrogation. Britain's bloody imperial past can provide valuable lessons for our present and future.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "Espionage",
    "British Literature",
    "Historical",
    "European History"
  ],
  "author": "Calder Walton",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/17465523-empire-of-secrets"
}