{
  "title": "A Life In Books: The Rise and Fall of Bleu Mobley",
  "description": "A LIFE IN BOOKS: The Rise and Fall of Bleu Mobley is an illuminated novel containing 101 books within it, all written by Lehrer’s protagonist who finds himself in prison looking back on his life and career. Nearly a year after the controversial author is thrown into a federal prison for refusing to reveal the name of a confidential source, he decides to break his silence. But it’s not as simple as giving up a name to the grand jury. Over the course of one long night, in the darkness of his prison cell, he whispers his life story into a microcassette recorder, tracing his journey from the public housing project of his youth, to a career as a journalist, then experimental novelist, college professor, accidental bestselling author, pop-culture pundit, and unindicted prisoner.In A LIFE IN BOOKS, Mobley’s autobiography/apologia is paired with a review of all 101 of his books. Each book is represented by its first-edition cover design and catalogue copy, and more than a third of his books are excerpted. The resulting retrospective contrasts the published writings (which read like short stories) with the author’s confessional memoir, forming a most unusual portrait of a well-intentioned, obsessively inventive (but ethically challenged) visionary.Written and designed by award-winning author/artist Warren Lehrer, A LIFE IN BOOKS is an extraordinarily original, funny, heartwarming and heart-wrenching exploration of one man’s use of books as a means of understanding himself, the people around him, and a half-century of American/global events. Rich with stories that spring from other stories, this genre-defying novel orchestrates a multicultural symphony of characters from Bleu’s life and books: lovers, mothers, children, friends, enemies, teachers, students, runaways, rebels, thinkers, dreamers, believers, skeptics, the displaced and dispossessed. It celebrates the mysteries and contradictions of the creative process, and grapples with the future of the book as a medium, and the lines that separate truth, myth, and fiction. This four-color, full-length novel—containing over 101 hilarious and scrumptious book cover designs (and book-like objects)—fuses art and literature, and distinguishes itself as one of those books you’ll want to hold in your hands, feast your eyes on, read and re-read, share with friends, and treasure for years to come.",
  "genres": [
    "Fiction",
    "Books About Books",
    "Graphic Novels"
  ],
  "author": "Warren Lehrer",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/17465700-a-life-in-books"
}