{
  "title": "Killer's Art",
  "description": "\"One of the best writers of Scandinavian crime fiction.\"— Harlan Coben\"Jungstedt delivers an excellent clammy atmosphere and a constant premonition of weird deaths to come. She's becoming one of Scandinavia's best crime writers, no mean compliment in a crowded field.\"— The London Times\"This is one of the best in Jungstedt’s captivating crime series featuring Swedish policeman Anders Knutas and reporter Johan Berg and set on the island of Gotland. . . .[This] tightly written and twisty crime novel [leaves] series fans wanting more. It doesn’t matter if series newcomers haven’t read the previous titles; the book is so well crafted that novices can easily pick up speed. Fans of Helene Tursten or Håkan Nesser will enjoy Jungstedt!\"— Library Journal , starred reviewIt is a cold wintry morning in the picturesque port town of Visby when art dealer Egon Wallin's battered and naked body is found hanging from a gate in the town's old city walls. When the famous painting \"The Dying Dandy\" is stolen in Stockholm, disturbing links to Wallin's murder slowly start to surface, taking the reader into the glittering world of the Swedish art elite and shadowy underground of prostitution and drugs. In this spine-tingling novel, superintendent Anders Knutas is facing one of the toughest investigations in his career.After this weekend his well-ordered life would be turned upside-down, but he was the only one who knew what lay ahead. He had formulated the plans over the past six months, and now there was no going back. His twenty-year marriage would be over when Monday arrived.Mari Jungstedt is known for her intelligent plots and excruciating suspense. Her Anders Knutas series has made her the second best selling crime-in-translation author published by Random House World. Many of the titles have been turned into popular movies with European distribution. Previously Jungstedt worked as a reporter on Swedish national public radio and television.",
  "genres": [
    "Crime",
    "Mystery",
    "Thriller",
    "Fiction",
    "Sweden",
    "Scandinavian Literature",
    "Swedish Literature"
  ],
  "author": "Mari Jungstedt",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/17465662-killer-s-art"
}