{
  "title": "The Woman Who Lost Her Soul",
  "description": "Renowned through four award-winning books for his gritty and revelatory visions of the Caribbean, Bob Shacochis returns to occupied Haiti in The Woman Who Lost Her Soul before sweeping across time and continents to unravel tangled knots of romance, espionage, and vengeance. In riveting prose, Shacochis builds a complex and disturbing story about the coming of age of America in a pre-9/11 world.When humanitarian lawyer Tom Harrington travels to Haiti to investigate the murder of a beautiful and seductive photojournalist, he is confronted with a dangerous landscape riddled with poverty, corruption, and voodoo. It’s the late 1990s, a time of brutal guerrilla warfare and civilian kidnappings, and everyone has secrets. The journalist, whom he knew years before as Jackie Scott, had a bigger investment in Haiti than it seemed, and to make sense of her death, Tom must plunge back into a thorny past and his complicated ties to both Jackie and Eville Burnette, a member of Special Forces who has been assigned to protect her.From the violent, bandit-dominated terrain of World War II Dubrovnik to the exquisitely rendered Istanbul in the 1980s, Shacochis brandishes Jackie’s shadowy family history with daring agility. Caught between her first love and the unsavory attentions of her father—an elite spy and quintessential Cold War warrior pressuring his daughter to follow in his footsteps—seventeen-year-old Jackie hatches a desperate escape plan that puts her on course to becoming the soulless woman Tom equally feared and desired.Set over fifty years and in four countries backdropped by different wars, The Woman Who Lost Her Soul is a magnum opus that brings to life, through the mystique and allure of history, an intricate portrait of catastrophic events that led up to the war on terror and the America we are today.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Mystery",
    "Thriller",
    "Contemporary",
    "Literary Fiction",
    "Literature"
  ],
  "author": "Bob Shacochis",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/17465749-the-woman-who-lost-her-soul"
}