{
  "title": "Betty's Child",
  "description": "In the tradition of Frank McCourt and \"Angela's Ashes,\" Donald Dempsey chronicles one boy's ordeals with poverty, religion, and physical and mental abuse as he attempts to come of age with only his street smarts and sense of humor to guide him. Twelve-year-old Donny is a real-life cross between Huckleberry Finn and Holden Caulfield. Donny is doing his best to navigate the world he shares with his cruel and neglectful mother, his mother's abusive boyfriends, churchgoers who want to save Donny's soul, and a best friend who wants Donny to go to work for a dangerous local thug doing petty theft and dealing drugs. Donny does everything he can to take care of himself and his younger brothers, but with each new development, the present becomes more fraught with peril--and the future more uncertain. \"Heartrending and humorous. In scene after vivid scene, Dempsey presents his inspiring true story with accomplished style. Dempsey's discipline as a writer lends the real-life tale the feel of a fictional page-turner.\" Kirkus Reviews \"This memoir is for everyone who has ever known someone abandoned, someone unloved, someone with barriers that seem impenetrable. With wit and delicacy, Dempsey exposes wounds that we would prefer to ignore, without ever pushing the reader away with any sense of melodrama. A truly unforgettable memoir.\" San Francisco Book Review--An estimated 700,000 children are victims of child maltreatment in the United States each year: 78% suffer neglect, 18% are physically abuse, 9% are sexually abused, 8% are psychologically maltreated, and an astonishing 78% suffer neglect. (Source: National Child Abuse and Neglect Data System) Don Dempsey experienced childhood abuse and neglect first hand, but went on to find business success and a fulfilling family life as an adult. \"If you're lucky, you make it to adulthood in one piece,\" says Don. \"But there's no guarantee the rest of your life is going to be any better. Abused kids are often plagued by fear and insecurity. They battle depression and have trouble with relationships. In the worst cases, abused children perpetuate the cycle.\" But Don is living proof that you can overcome a childhood of abuse and neglect. \"You start by letting go of as much of the guilt (yes, abused kids feel guilty) and as many of the bad memories as possible. At the same time, you hold on to the things that helped you survive. For me, it was the belief that you can make life better by working at it and earning it. It helps to have a sense of humor, too.\" Some of Don's experiences will make you cringe, but you'll want to keep reading because of Don's natural storytelling ability and sense of humor. And in the end, you'll appreciate hearing Don's inspiring story.",
  "genres": [
    "Memoir",
    "Survival",
    "Nonfiction",
    "Family"
  ],
  "author": "Donald R. Dempsey",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/17466859-betty-s-child"
}