{
  "title": "Practice Makes Perfect:: How One Doctor Found the Meaning of Lives",
  "description": "Have you ever wondered what is going on inside your doctor’s head when you’re behind that closed examination room door? Practice Makes How One Doctor Found the Meaning of Lives helps us to understand the potential depth, sanctity, and humor within the doctor-patient relationship from both perspectives, as Dr. David Roberts makes rounds and cares for patients. Dr. Roberts has just completed his medical training and starts out in the private practice of Internal Medicine in a Midwestern college town. He is twenty-nine years old, but looks sixteen, inspiring most patients to comment, “You look too young to be a doctor!” On his first week of hospital rounds, an angry middle-aged man dies in such a dramatic, direct manner that our doctor, and the young nurse working with him, believe he has killed this patient. From this point onward, we listen and learn with Dr. Roberts and Dr. Mark Edwards, his senior partner, as they together navigate their first five years of private practice as primary care physicians. Written in the currently popular narrative non-fiction style, throughout Practice Makes Perfect the reader follows Dr. Roberts as he cares for twenty different and unique patients. As he encounters each new human being seeking help, we are invited inside the good physician’s head to see and better understand the complexity of both successful and strained patient-doctor relationships. The reader sees him quickly formulate his initial impressions, analyze the data, argue with himself and sometimes others, including his patients, and struggle with his own doubts and certainties in order to help his patients to heal. Through a series of fascinating, humorous, and poignant patient stories, this “professional coming of age” book chronicles Dr. Robert’s journey of finding the human dignity in each patient and learning something about himself, to a growing confidence in his abilities as a physician. Using a lively and entertaining style, the author takes us inside his own mind to help us understand what doctors think, say and do, (and what they don’t say or do), each time we walk into the examination room as patients seeking help for our maladies. We see Doctor Roberts honestly reflect upon his own failures, successes, doubts and certainties, to learn the truth that his patients have to teach him about life. In discovering each person’s innate dignity, he finds his own true calling as a physician and healer. Each chapter begins with an epigraph, setting the stage for the patient story. In addition to meeting and learning from each patient, the reader also follows the growth and development of the fledgling practice from the first two physicians, Drs. Edwards and Roberts, to the addition of new partners, until they at last outgrow their small office and move to a new professional office building adjacent to their hospital. Recognized as one of America’s Best Doctors for many years, the author’s broad experiences as a practicing physician, a hospital and medical group executive, and national speaker allow him to paint an exciting and heartrending portrait of our healthcare system, and help the reader to find his or her place within it. You simply cannot listen to the news these days without hearing about what is wrong with healthcare. In stark contrast, seeing patients with Dr. Roberts helps us understand both what is right, and what could be better, about ourselves and our relationships with physicians, as we seek and then discover with him the dignity of each human spirit.",
  "genres": [
    "Medical",
    "Nonfiction"
  ],
  "author": "David         Roberts",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/17469395-practice-makes-perfect"
}