{
  "title": "Bird: The Life and Music of Charlie Parker",
  "description": "Saxophone virtuoso Charlie \"Bird\" Parker began playing professionally in his early teens, became a heroin addict at 16, changed the course of music, and then died when only 34 years old. His friend Robert Reisner observed, \"Parker, in the brief span of his life, crowded more living into it than any other human being.\" Like Louis Armstrong, Duke Ellington, Miles Davis, and John Coltrane, he was a transitional composer and improviser who ushered in a new era of jazz by pioneering bebop and influenced subsequent generations of musicians. Meticulously researched and written, The Life and Music of Charlie Parker tells the story of his life, music, and career. This new biography artfully weaves together firsthand accounts from those who knew him with new information about his life and career to create a compelling narrative portrait of a tragic genius. While other books about Parker have focused primarily on his music and recordings, this portrait reveals the troubled man behind the music, illustrating how his addictions and struggles with mental health affected his life and career. He was alternatively generous and miserly; a loving husband and father at home but an incorrigible philanderer on the road; and a chronic addict who lectured younger musicians about the dangers of drugs. Above all he was a musician, who overcame humiliation, disappointment, and a life-threatening car wreck to take wing as Bird, a brilliant improviser and composer. With in-depth research into previously overlooked sources and illustrated with several never-before-seen images, The Life and Music of Charlie Parker corrects much of the misinformation and myth about one of the most influential musicians of the twentieth century.",
  "genres": [
    "Biography",
    "Music",
    "Nonfiction",
    "Jazz",
    "History"
  ],
  "author": "Chuck Haddix",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/17471023-bird"
}