{
  "title": "Demon Derby",
  "description": "She survived cancer, but can she fight demon derby girls? Set in the world of roller derby, the new novel from Carrie Harris, author of Bad Taste in Boys and Bad Hair Day, is perfect for Buffy the Vampire Slayer fans and for anyone facing their own demons, inside or out. \"A resolutely tough cancer survivor winds up battling more than just the opposing team when she goes out for roller derby and comes face to face with supernatural enemies in this fast-paced, often funny offering about demon hunters . . . a paranormal adventure with both style and heart (on wheels).\"-- Kirkus Reviews\"It reads almost like a lost episode of Buffy the Vampire Slayer at times, complete with character sass and kick-butt moves .  . .  a fun read with plenty of action and heart.\"-- VOYACasey kicked cancer’s ass. Now a demon wants to kick hers. . . .Casey hates being known as the girl who survived cancer. She wants people to treat her like her old self, fearless and strong. And after a creepy encounter with a crazy guy in an alley, Casey is all about reclaiming her power.So when she has a chance to try out for the Apocalypsies roller derby team, she jumps on it. Being a derby girl would prove that she doesn’t need anybody’s pity. It doesn’t hurt that Michael, the team manager, is almost unnaturally hot. Which makes sense when Casey finds out that he’s not human.Michael’s got a he trains demon hunters. That crazy guy in the alley? Demon. And the fact that Casey went head to head with evil and lived makes her a threat to demonkind. Casey thought she’d already fought and won the battle of her lifetime. But it’s only beginning. . . . “Part heartwarming, part tough-as-nails heroine, and part hilarity make Demon Derby all-around amazing.” —Elana Johnson, author of Possession, Surrender, and Abandon “ Demon Derby may just be the most fun you can have without roller skates.” —Stacey Jay, author of Juliet Immortal and Romeo Redeemed “With the strongest, snarkiest, kick-buttingest heroine I’ve ever met, Demon Derby is an original, fast-paced adventure ride that will make you laugh, cry, and beg for more.” —Gretchen McNeil, author of 3:59, Ten, and Possess",
  "genres": [
    "Young Adult",
    "Paranormal",
    "Fantasy",
    "Supernatural",
    "Demons",
    "Romance",
    "Humor"
  ],
  "author": "Carrie Harris",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/17471123-demon-derby"
}