{
  "title": "A Place Called Home",
  "description": "\"Touchingly sincere...Trent and Laura are both rendered as wounded, lovable people, and readers will cheer for each stumbling, shy step toward the couple's reunion. Scott's prose is witty and sharp, and her delightful cast of characters keeps this delectable page-turner vibrant throughout.\" --Publishers Weekly (starred review) on BACK TO YOU He trains men for war… The only thing Sergeant First Class Reza Iaconelli cares about is taking care of his men and making sure they’re ready for the next combat deployment to the Surge in Iraq. Nothing will stand in the way of him taking care of his soldiers — especially not some direct commission captain who doesn’t even know how to put on her body armor. He has no idea what she’s even doing in the Army, other than getting under his skin. She’ll fight for his men… Army Captain Emily Lindberg knows one thing about the Army and that is it is terrible about taking care of its Soldiers. She may not know much about the Army but when Sergeant Iaconelli attempts to tell her how to do her job, she’ll stand up to the big NCO and dare him to be better than he thinks he is. Behind the angry exterior, she sees a man who’s hiding — using war as a means to escape the demons from his past. He needs her more than he knows… When one of his soldiers commits suicide, Reza faces his toughest challenge yet. As his efforts to remain sober start to fail, he’ll need to find the strength to ask her for the one thing she alone can give him — and it may be more than he’s capable of. RAVES FOR JESSICA SCOTT and BACK TO YOU \"Jessica Scott's BACK TO YOU is a moving story with rich, layered characters and real, heart-felt emotion. Don't miss this fabulous read!\"~Brenda Novak, New York Times bestselling author\"Jessica Scott's novels are beautifully written, honestly authentic, and richly emotional.\"~JoAnn Ross, New York Times bestselling author\"Few writers can reach the psychological and emotional depths with their characters as Jessica Scott can. A gripping, deeply emotional story that will grab the reader and not let them go.\"~Lindsay McKenna, New York Times bestselling author of NEVER SURRENDER",
  "genres": [
    "Contemporary Romance",
    "Romance",
    "Military Fiction",
    "Military Romance",
    "Contemporary",
    "Fiction",
    "War"
  ],
  "author": "Jessica Scott",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/17482941-a-place-called-home"
}