{
  "title": "The Good of Being: God, life and the basis of ethics",
  "description": "The business of this book is to elucidate the connection between “goodness, value and worth” on the one hand and “life, being and existence” on the other. This may seem like an abstruse academic project, but I believe it to be of great practical importance. I think that a careful consideration of this topic results in a clear vision of what it means to be a living human being; how we ought to live our lives, and so be happy; and what fulfilment we can reasonably hope for.  In the first part of this book (Chapters One to Nine) I argue that mortal existence can only be rationally accounted for and made sense of on the prospect of union with God; as envisaged by Plato of Athens and promised by Jesus of Nazareth.  First I discuss rationality, truth, logic and reality; showing how these ideas are interconnected. I then move on to consider physical existence in general before reflecting on the kind of existence which we identify as life, and in particular the life of sentient and sapient beings.  Next, I discuss the ideas of beauty, justice, love and value. I argue that they are intimately connected, and ultimately united in the single idea of “the Good” or God.  I then consider the relationship between human beings and God: characterized on the one hand by sin, death and futility; and on the other by mercy, love and immortality.  Now, if God is no more than a figment of human imagination, my claim that sense can be made of our mortality by referring it to eternity would not amount to much. Hence, the second part of this book (Chapters Ten to Fourteen) deals with reasons for believing that God is real and that therefore the idea of human immortality is reasonable.  After identifying some wrong reasons for believing in God I address the issue of suffering which legitimately calls God’s reality into question. In doing so, I offer a view of the Fall and of Original Sin which casts light on the fundamental purpose of mortal existence and makes it possible to account for why God generally deals with us remotely and obscurely. I then present critical accounts of four potentially sound reasons for believing in the reality of God.  The third part of the book (Chapters Fifteen to Seventeen) addresses more carefully the relationship between mortal existence and Eternal Life.  I discuss the notion of freewill which underpins much of what has gone before and then turn to consider more strictly theological matters: the vocation to enlightenment communion and fellowship with God; the significance of the life and death of Jesus of Nazareth, and how this relates to the Eucharist; and the mission, purpose and business of the Church.",
  "genres": [],
  "author": "Stephen C. Lovatt",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/17486792-the-good-of-being"
}