{
  "title": "A White Room",
  "description": "At the close of the Victorian Era, society still expected middle-class women to be “the angels of the house,” even as a select few strived to become something more. In this time of change, Emeline Evans dreamed of becoming a nurse. But when her father dies unexpectedly, Emeline sacrifices her ambitions and rescues her family from destitution by marrying John Dorr, a reserved lawyer who can provide for her family. John moves Emeline to the remote Missouri town of Labellum and into an unusual house where her sorrow and uneasiness edge toward madness. Furniture twists and turns before her eyes, people stare out at her from empty rooms, and the house itself conspires against her. The doctor diagnoses hysteria, but the treatment merely reinforces the house’s grip on her mind. Emeline only finds solace after pursuing an opportunity to serve the poor as an unlicensed nurse. Yet in order to bring comfort to the needy she must secretly defy her husband, whose employer viciously hunts down and prosecutes unlicensed practitioners. Although women are no longer burned at the stake in 1900, disobedience is a symptom of psychological defect, and hysterical women must be controlled. A novel of madness and secrets, A White Room presents a fantastical glimpse into the forgotten cult of domesticity, where one’s own home could become a prison and a woman has to be willing to risk everything to be free.Based on historical trends of the era and inspired by the classic Victorian novels The Yellow Wallpaper, The Secret Garden, and Wuthering Heights, author Stephanie Carroll has taken women's empowerment in fiction to an all new level in this inspiring debut. -A White Room was featured as a Notable Page Turner in Shelf Unbound Magazine and named 2013's Best Cross-Genre Title by USA Book News.To read behind the scenes material about \"A White Room\" and learn about future books by Stephanie Carroll in addition to giveaways, freebees, and how to become a test reader, visit http://www.stephaniecarroll.net and sign up for the VIP Reader newsletter.",
  "genres": [
    "Historical Fiction",
    "Historical",
    "Fiction",
    "Victorian",
    "Mental Illness",
    "Romance",
    "Psychology"
  ],
  "author": "Stephanie  Carroll",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/17495984-a-white-room"
}