{
  "title": "A Creed for the Third Millennium",
  "description": "Set in a near-future USA, this novel traces the progress of a truly good man from obscurity to worldwide fame. Dr Joshua Christian's work as a clinical psychologist daily presents him with bitter tableaux of a people spiritually impoverished by too much change: political, climatic, ideological. Joshua's deep compassion & extraordinary personal magnetism have created a devout following among patients, but living & working in the relative backwater of a small Connecticut city, he yearns to reach out & help on a larger scale. Enter Dr Judith Carriol, a brilliant senior official from the powerful new Department of the Environment. Ambitious, career-oriented, as elegant as she's Machiavellian, Judith recognizes in Joshua the personificatiion of her desire for influence. Joshua presents an irresistible prospect to one of her makeup, obsessed with power but preferring to wield it anonymously. Judith & Joshua embark upon a crusade designed to regenerate the nation's morale by radically changing the outlook of its people. But always it is Judith who engineers, Joshua who executes. It's Judith who dreams up Joshua's tour across a country devastated by winter, Judith who uncannily provides the mystified Joshua with every resource to make his incredible journey a reality. But it's Joshua alone who transforms the tour into an epic pilgrimage that touches & renews millions. As he reaches out to the cold hands & despairing hearts of the people, his grateful followers come to see him as more than a man. With the skill that has made her one of the world's most popular storytellers, McCullough has written a novel of powerful emotional intensity.",
  "genres": [
    "Fiction",
    "Science Fiction",
    "Dystopia",
    "Romance",
    "Fantasy",
    "Science Fiction Fantasy",
    "Thriller"
  ],
  "author": "Colleen McCullough",
  "average_rating": "3.27",
  "url": "https://www.goodreads.com/book/show/1749930.A_Creed_for_the_Third_Millennium"
}