{
  "title": "Inferno: The Fiery Destruction of Hamburg, 1943",
  "description": "In the summer of 1943, British and American bombers launched an attack on the German city of Hamburg that was unlike anything the world had ever seen. For ten days they pounded the city with over 9,000 tons of bombs, with the intention of erasing it entirely from the map. The fires they created were so huge they burned for a month and were visible for 200 miles.The people of Hamburg had no time to understand what had hit them. As they emerged from their ruined cellars and air raid shelters, they were confronted with a unique vision of hell: a sea of flame that stretched to the horizon, the burned-out husks of fire engines that had tried to rescue them, roads that had become flaming rivers of melted tarmac. Even the canals were on fire.Worse still, they had to battle hurricane-force winds to escape the blaze. The only safe places were the city's parks, but to reach them survivors had to stumble through temperatures of up to 800C and a blizzard of sparks strong enough to lift grown men off their feet.\"Inferno\" is the culmination of several years of research and the first comprehensive account of the Hamburg firestorm to be published in almost thirty years. Keith Lowe has interviewed eyewitnesses in Britain, Germany, and America, and gathered together hundreds of letters, diaries, firsthand accounts, and documents. His book gives the human side of an inhuman story: the long, tense buildup to the Allied attack; the unparalleled horror of the firestorm itself; and the terrible aftermath. The result is an epic story of devastation and survival, and a much-needed reminder of the human face of war. Includes nineteen maps and thirty-one photographs, many never seen before.350 pages narrative, 489 pages in total",
  "genres": [
    "History",
    "World War II",
    "Germany",
    "Nonfiction",
    "War",
    "Military History",
    "Military Fiction"
  ],
  "author": "Keith Lowe",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/175237.Inferno"
}