{
  "title": "Masters of Death: The SS-Einsatzgruppen and the Invention of the Holocaust",
  "description": "A major contribution to the history of the Holocaust from the acclaimed author of the Pulitzer Prize–winning The Making of the Atomic Bomb .In Masters of Death , Richard Rhodes gives full weight, for the first time, to the part played by the Einsatzgruppen--the professional killing squads deployed in Poland and the Soviet Union, early in World War II, by Himmler's SS. And he shows how these squads were utilized as the Nazis made two separate plans for dealing with the civilian populations they wanted to destroy.The first plan, initiated in July 1941, condemned the Jews of eastern Europe to slaughter by the Einsatzgruppen, who went on to execute 1.5 million men, women and children between 1941 and 1943 by shooting them into killing pits, as at Babi Yar--massive crimes that have been underestimated or overlooked by Holocaust historians. Rhodes documents the organizing and carrying out of this program and introduces the professional men--economists, architects, lawyers--who were the program’s commanders and officers, as well as the \"ordinary men\" who did most of the actual killing.The second plan, initiated in December 1941, was directed at the Jews of western Europe. By then, Rhodes shows, the face-to-face killing of hundreds of thousands had so brutalized the SS that even Himmler was shocked into ordering the development of a less \"personal\" means of murder--the notorious gas chambers and crematoria of the Holocaust’s second wave. Rhodes shows, further, that Hitler and Himmler intended the Jews to be only their first victims; their plan was to open up Russia to German colonization by destroying more than 30 million Slavs and members of other ethnic groups.Drawing on Nuremberg Tribunal documents largely ignored until now, and on newly available material from eyewitnesses and survivors, Richard Rhodes has given us a book that is essential reading on the Holocaust and World War II.",
  "genres": [
    "History",
    "Nonfiction",
    "Holocaust",
    "World War II",
    "War",
    "Germany",
    "Military Fiction"
  ],
  "author": "Richard Rhodes",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/1753116.Masters_of_Death"
}