{
  "title": "Kosovo: A Short History",
  "description": "Kosovo, a 55-mile-long plateau south of Serbia bordering Albania & Macedonia, should by all rights be a historical & political backwater. A Bulgarian geographer who visited Kosovo during WWI remarked it was \"almost as unknown & inaccessible as a stretch of land in Central Africa.\" The observation would prove ironically fitting by the '90s, as Central Africa & Kosovo both became sites of widespread genocide, fueled by ethnic hatreds, of the deepest international significance. Noel Malcolm, British historian & journalist who's written extensively about the Balkans (including a companion volume of sorts on Bosnia), provides an overview of Kosovo's long-standing cultural divisions in his \"short history\" (altho, at more than 500 pages, a not so short book). Readers following the unfolding war in Kosovo thru newspaper & tv coverage may well ask why ethnic Albanians & Serbs are struggling so violently to command the small region. Kosovo, he explains, is the birthplace of Serbian nationalism; the defeat of Serbian forces there in 1389 by Turkish troops became emblematic of the fall of the Serbian empire, as it led to Turkish domination of the Balkans. Contemporary warriors of Serbia are evidently attempting to reverse the course of history by reclaiming the land from its Turkish conquerors--but in the absence of the Turks, they'll take it from the Albanians (the largest ethnic group among Kosovo's inhabitants) whose ancestors converted to Islam when Turks ruled the region. His lucid text shows again & again that the ethnic conflict in Kosovo is less a battle over bloodlines & religion than it's one over differing conceptions of national origins & history. \"When ordinary Serbs learn to think more rationally & humanely about Kosovo, & more critically about some of their national myths,\" he concludes, \"all the people of Kosovo & Serbia will benefit--not least the Serbs themselves.\"--Gregory McNamee (edited)",
  "genres": [
    "History",
    "Nonfiction",
    "European History"
  ],
  "author": "Noel Malcolm",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/1080150.Kosovo"
}