{
  "title": "Berries and Greed",
  "description": "GreidI may hate everyone, but you can only take being alone for so long. Sooner or later, you get desperate enough to visit a human cult that worships your species as greater beings in the hope of finding a new roommate to fill the lonely void. We’ve all been there… right?I swear I was only looking for a roommate. Just someone to watch TV and eat dinner with. Nothing… romantic. No way. But when I see all these humans gazing at me with open adoration and blatant lust and other things that make me wildly uncomfortable, I realise what a terrible mistake this is.Until I spot the one human woman in the group who is definitely not pleased to see me. In fact, she’s scowling at me. She looks really, really annoyed.I’m kind of into it.BerylI’m not a true follower of The Order of the Greater Beings. I don’t worship the demiurgus—the monstrous species that lives alongside humans. I definitely do not want to become a demiurgus mate.So when one shows up at the cult’s compound—the first in the entire twenty-five years I’ve been flying under the radar here—I want to make sure he knows that I think he’s a total creep for taking advantage of worryingly adoring humans this way.Until I realise… I don’t think that’s why he’s here. He’s kind of awkward. And anxious. And wildly out of his depth. And when he offers me the chance to finally escape the cult—to go out into the real world for the first time, to create a life for myself—all for the low, low cost of an easy, platonic friendship… I take it.Now I’m navigating the outside world, and I’m roommates with a big, awkward demiurgus called Greid who lives in his pyjamas, watches a ridiculous amount of TV and is high most of the time. He’s also the sweetest guy I’ve ever met, and he’s funny and generous and easy to talk to.But I’ve spent my entire life making sure I didn’t get sucked in to the cult’s fervent worship of the demiurgus—there’s no way I’m going to fall in love with him.Right?Berries and Greed is a MF monster/human romcom and is the first in the series Deep Earth Dating, which features a range of diverse pairings and is for an adult audience only. A full list of CWs can be found at the front of the book, but include explicit content, a non-human love interest (with non-human anatomy), an MC initially involved in a cult, recreational use of a fictional drug, and mentions of childhood neglect.",
  "genres": [
    "Romance",
    "Fantasy",
    "Monsters",
    "Paranormal",
    "Friends To Lovers",
    "BDSM",
    "Paranormal Romance"
  ],
  "author": "Lily Mayne",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/175404367-berries-and-greed"
}