{
  "title": "Moment of Grace: The American City in the 1950s",
  "description": "Moment of Grace tells the story of the American city in its remarkable heyday. Never before or after the 1950s were downtowns so exciting, neighborhoods so settled, or suburban dwellers so optimistic. Urban culture was at its it was vital, urbane, conformist, and generating rebellion all at once. Capturing the mood of the '50s in superb historical photographs and mining delightfully varied sources―including urban critics, interviews with city residents, novels, songs, magazines, and newspapers― Moment of Grace brings alive the downtowns, the neighborhoods, and the suburbs of the era. A rich historical reflection on a singular decade, the book also portrays the '50s as a critical turning point in American culture and economy. Michael Johns shows us exactly why city life never could or would be the same again.Giving a vivid sense of the lived experience of the day, Johns explores the '50s in cities such as New York, San Francisco, Philadelphia, Chicago, and Oakland, writing about fashion (which demanded the highest heels and pointiest breasts in history), nightlife, architecture, literature, business and economic trends, and teenage culture. He tells us what was for sale in the stores, who lived in the neighborhoods, what life was like for women in the brand-new suburbs, and much more. And he confronts difficult issues head-on. What did the loss of city jobs and the simultaneous success of the civil rights movement mean for black neighborhoods? What were the profound consequences of the rise of the suburbs for family life?In contrast to the vibrant cities of the '50s, the streets of today's downtowns are often empty if not suffused with melancholy. Johns uncovers the seeds of the transformation from the '50s to today, and at the same time, he paints a memorable picture of the American past.",
  "genres": [
    "Architecture",
    "History",
    "Nonfiction"
  ],
  "author": "Michael Johns",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/175495.Moment_of_Grace"
}