{
  "title": "Until I Say Goodbye: A Book about Living",
  "description": "In June 2011, Susan Spencer-Wendel learned she had amyotrophic lateral sclerosis (ALS)--Lou Gehrig's disease--an irreversible condition that systematically destroys the nerves that power the muscles. She was forty-four years old, with a devoted husband and three young children, and she had only one year of health remaining.Susan decided to live that year with joy.She quit her job as a journalist and spent time with her family. She built an outdoor meeting space for friends in her backyard. And she took seven trips with the seven most important people in her life. As her health declined, Susan journeyed to the Yukon, Hungary, the Bahamas, and Cyprus. She took her sons to swim with dolphins, and her teenage daughter, Marina, to Kleinfeld's bridal shop in New York City to see her for the first and last time in a wedding dress.She also wrote this book. No longer able to walk or even to lift her arms, she tapped it out letter by letter on her iPhone using only her right thumb, the last finger still working.However, Until I Say Good-Bye is not angry or bitter. It is sad in parts--how could it not be?--but it is filled with Susan's optimism, joie de vivre, and sense of humor. It is a book about life, not death. One that, like Susan, will make everyone smile.From the Burger King parking lot where she cried after her diagnosis to a snowy hot spring near the Arctic Circle, from a hilarious family Christmas disaster to the decrepit monastery in eastern Cyprus where she rediscovered her heritage, Until I Say Good-Bye is not only Susan Spencer-Wendel's unforgettable gift to her loved ones--a heartfelt record of their final experiences together--but an offering to all of us: a reminder that \"every day is better when it is lived with joy.\"",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "Book Club",
    "Biography Memoir",
    "Autobiography",
    "Medical"
  ],
  "author": "Susan Spencer-Wendel",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/17553448-until-i-say-goodbye"
}