{
  "title": "Only Hard Problems",
  "description": "New York Times best-selling author Jennifer Estep continues her Galactic Bonds series with a new, action-packed novella that blends science-fiction technology and magical fantasy elements with a touch of historical romance. This rollicking space opera focuses on a fan-favorite secondary character who’s part hero, part villain, and all arrogance. Perfect for fans of Star Wars, Bridgerton, and Pride and Prejudice.PROBLEMS, PROBLEMS EVERYWHERE . . .My name is Zane Zimmer. To most folks, I live a seemingly charmed life as a Regal lord and the heir apparent to the powerful, wealthy House Zimmer, and the gossipcasts breathlessly follow my every swaggering move across the Archipelago Galaxy. I’m also a powerful psion capable of telekinesis, telepathy, and telempathy, and my deadly skills and prowess with my stormsword have made me the golden boy of the Arrows, the Imperium’s elite fighting force.But even golden boys have bad days, and the truth is I have more hard problems than I can solve.The Techwave is building weapons to use against the Arrows in hopes of toppling the Imperium and taking over the galaxy. But even more worrisome is the fact that my old rival Kyrion Caldaren has a powerful new ally in Vesper Quill. Together, the two of them just might destroy everything I’ve sworn to protect.I’m supposed to be relaxing with the other Regals during the Summer Solstice celebration, but when an enemy threatens the festivities, I’m forced to leap into action. As an Arrow, I’ll do whatever it takes to protect my family and the other Regals, even though my actions will cause only more problems—and just might end up being the death of me . . .Note: Only Hard Problems is a 47,000-word book from the point of view of Zane Zimmer. It takes place after \nOnly Good Enemies\n, book 2 in the Galactic Bonds science-fiction fantasy series.",
  "genres": [
    "Science Fiction",
    "Fantasy",
    "Romance",
    "Space Opera",
    "Novella",
    "Magic",
    "Audiobook"
  ],
  "author": "Jennifer Estep",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/175552295-only-hard-problems"
}