{
  "title": "Reckoning",
  "description": "\"It's always interesting to read early work by someone like Richard Laymon, John Little, or Gord Rollo, because you are looking at an established star's apprentice efforts. Sometimes the work is rough, the writer obviously learning by doing, but the writing and story-line is always compelling. And like those mentioned, Kenneth W. Cain achieves that with his writing. Grab the series and catch a rising star's early efforts. You won't be sorry. Recommended.\"--Gene O'Neill, THE CAL WILD CHRONICLES, and ENTANGLED SOUL with Chris MarrsA stranger walks this land, unknown to even himself, but aware that he has not returned alone.“Like the Walking Dead, but with aliens instead of zombies”From out of the detritus and ruin of the Earth rises a familiar face. He knows not who he is, only what he will become should time expire. His journey in this post-apocalyptic world begins with questions, too many to list.In another part of what was once the Untied States, an old hero has been laid to rest. Those who loved him and knew him well revere and cherish their friend. Among those people is an ever grumpy, surly man. This man will need to motivate Marty’s son, Jacob. This is where Jacob’s journey begins.As Jacob travels across Pennsylvania, he is unaware of what dangers await him. Jacob has been trained by his father should the horrors of old ever return. But Jacob is not very confident in his ability to fight if he needs to. There are doubts, insecurities, and painful memories of lost loved ones.Visiting his Aunt Sandy to relay the bad news, Jacob is confronted by atrocities he had not imagined. These creatures, formed in part out of a being from their past, are vampiric in nature. They feed on the blood of humans and creatures alike, spreading their disease and increasing their numbers. But that is only the beginning of what Jacob must face.Somewhere among these mongrels are other creatures. One of these creatures, he knows well, having witnessed her this transformation. He fears having to face her wrath. The other is an unknown to Jacob. And although Jacob isn’t entirely positive, he does have his suspicions. Was his father right in preparing him? Is this who has returned, his father’s worst nightmare? These uncertainties are his alone to unravel.In their darkest hour, Jacob must trust his instincts and join forces with the one evil he has been instructed to kill. Should he ignore his father’s teachings in order to overcome the other terrors that await him? Will he have the courage to fight back? Will it be enough? Or will it simply be too late?Who of you will fight with Jacob as he protects everything we rebuilt? Prepare yourself. Only you can determine the future of the Earth.",
  "genres": [],
  "author": "Kenneth W. Cain",
  "average_rating": "3.25",
  "url": "https://www.goodreads.com/book/show/17556451-reckoning"
}