{
  "title": "Lavender's Blue",
  "description": "From the NY Times Bestselling duo that wrote Agnes and the Hitman, the first book in the Liz Danger series.Liz Danger has returned home after fifteen years to deliver a giant teddy bear for her mother’s birthday (Guilt Red) when a cop with a great ass picks her up for speeding, fixes the missing lug nuts on her back wheel, pulls her out of a ditch, doesn’t give her a ticket, and helps her avoid her family. This is a man with real potential. The rest of the day goes downhill, starting with her finding out that the only man she’s ever loved is getting married to Lavender Blue, the most beautiful woman in southern Ohio. Really, the best thing in her day is that cop with the lug nuts.Vince Cooper still isn't sure about being a cop in Burney, Ohio, a place he just moved to six months ago, since Burney is full of some fairly odd people spaced between long stretches of boredom. Still, considering the dangerous, difficult life he had before Burney as an Army Ranger and New York City cop, boredom is good. Then he picks up Liz Danger for speeding and life gets a lot more interesting. And when he picks her up again in the local bar the next night, he starts to realize that “interesting” doesn’t begin to describe what’s going to happen to him if he pulls Liz into his arms and his lifeAs Liz navigates her dysfunctional family, her flamboyant boss phoning in from Chicago, her still-interested ex, her bridesmaid dress from hell, a dachshund with issues, a disaster of a wedding, assault, murder, and three hundred and ninety-three teddy bears, Vince shows up to get her through, even though he knows that the real peril for him in Burney is the one who came with her own warning label, Liz Danger.",
  "genres": [
    "Romance",
    "Mystery",
    "Romantic Suspense",
    "Contemporary Romance",
    "Contemporary",
    "Humor",
    "Fiction"
  ],
  "author": "Jennifer Crusie",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/175578165-lavender-s-blue"
}