{
  "title": "Intoxicated",
  "description": "When everything she ever wanted turns out not to be enough…Lauren Jefferies is on the verge of having it all. Hard work and determination have culminated in a promotion that promises to put her on track with her upwardly mobile boyfriend Eric. High school sweethearts and together for ten years, they are young enough to have their whole lives ahead of them, but old enough to have established themselves as forces to be reckoned with.The news should be cause for celebration.But taking the job means moving two hours away.Instead of planning their reign as an up and coming power couple, they find their already tenuous relationship further damaged by their conflicting opinions. Eric doesn’t want her to leave. Lauren refuses to back down. In the end, she packs her things and heads up north to her new life, the abstract promise of figuring this all out later hanging between them.Lauren settles into her new routine quite easily, thanks largely in part to her fast friendship with her roommate Blake. Blake’s companionship comes in a package deal with that of her older brother Matthew. One night over dinner, an innocent conversation leads to the discovery that the three of them have more in common than they’d ever imagined.Ashamed of his role in the thread that ties them together, Matthew begins to withdraw. As Lauren devises a game plan to ease his torment, Eric inadvertently pushes them together with his selfish actions.Lauren’s relationship with Eric continues to flounder. The distance is an issue, but Eric’s indifference does nothing to help. Every bright spot in their courtship is countered by darkness and bitterness. More often than not, Matthew is there to pick up the pieces that Eric leaves behind.Prior to meeting Matthew, Lauren thought she knew what she wanted. Now that she’s just about to obtain everything on her list, she’s left to question if she ever really knew what that was.",
  "genres": [
    "New Adult"
  ],
  "author": "Alicia Renee Kline",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/17558927-intoxicated"
}