{
  "title": "Killing Kebble: An Underworld Exposed",
  "description": "In September 2005, Brett Kebble, a prominent South African mining magnate, was killed on a quiet suburban street in Johannesburg in an apparent “assisted suicide”. The top-level investigation that followed was a tipping-point for democratic South Africa. It exposed the corrupt relationship between South Africa’s chief of police and Interpol president Jackie Selebi and his friend Glenn Agliotti, and revealed a shadowy underworld dominated by drug lords, steroid-fuelled bouncers, hitmen for hire, an international smuggling syndicate, a dubious security unit moonlighting for the police and sinister, self-serving sleuths abusing state agencies. It even cost the country’s most senior prosecutor his job.Indemnified by an agreement struck with the state, Mikey Schulz, Nigel McGurk and Fiazal “Kappie” Smith come clean to Mandy Wiener in exclusive interviews about the chilling events leading up to the night Kebble was shot dead and the life paths of the “bungling assassins”. Glenn Agliotti, the man once accused of orchestrating the hit, has also provided Wiener with unlimited access to his story, as have other characters whose versions of the events are previously untold.This true-crime tale is set against the fascinating background of political interference at the highest level, a bitter feud between two arms of the country’s law-enforcement authorities, a festering police service tainted by dirty cops and the shady relationships between the magnate and aspirant young political turks who were ready recipients of his largesse.Killing Kebble is not the story of one murder. It’s a gritty, fast-paced chronicle of how one death blew the lid off Johannesburg’s underworld.",
  "genres": [
    "Nonfiction",
    "South Africa",
    "Crime",
    "True Crime",
    "Biography",
    "Africa"
  ],
  "author": "Mandy Wiener",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/10802666-killing-kebble"
}