{
  "title": "Valley Of Death, Zombie Trailer Park",
  "description": "Just a few miles outside of Albuquerque New Mexico in a remote valley something has gone horribly wrong. To their eternal regret some people have mistaken the screams echoing in the hills as coyotes singing to the moon. When Josey drives his truck down into the valley he quickly learns the disturbing truth. It's not coyotes howling. It's men or what used to be men. Josey discovers that the valley is home to the depraved, the noble, the damned, the innocent, the beautiful, and of course the walking dead. When the least dangerous thing you encounter is an angry rattlesnake you know you've made a wrong turn at Albuquerque. What kind of zombies are they? There has been an interesting but ultimately pointless debate going on for years about what constitutes a zombie. Is it a dead person who walks around causing mayhem? Or is it someone who is violently insane and seeks only to kill and destroy? Why not both? Nestled in a remote valley, the residents of The Albuquerque Springs Trailer Park have lived out there lives nearly forgotten by the rest of the world. The trailer park is home to dozens of illegal immigrants, a hermit who has turned his back on society, a veteran of World War 2, a grumpy old woman, a family of Meth cookers known to local police officials as the Redneck Gourmets, and a beautiful young woman, are just a few. Life was peaceful and quiet (actually quite boring) until a deadly industrial accident killed Juan, one of the illegal immigrants. His friends and neighbors promised to dispose of the victim's body. Unfortunately, he came back and disposed of them- one mouthwatering bite at a time. William Robert Who is he? Born in southern California in the 1960’s, William Bebb is a man of many talents. In the late 1980’s and early 1990’s, he earned scholarships for Forensic Speaking at two universities. William was also Editor of a University of Alabama at Birmingham's premier newspaper from 1989 to 1991.",
  "genres": [
    "Zombies",
    "Horror",
    "Fiction",
    "Humor",
    "Post Apocalyptic",
    "Action",
    "Amazon"
  ],
  "author": "William Bebb",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/10093711-valley-of-death-zombie-trailer-park"
}