{
  "title": "Iraq War 2003: What Really Happened Behind The Political Scenes",
  "description": "With more than 600 citations, ranging from insider memoirs to the accounts of journalists, former government officials, policy wonks, military leaders, and news broadcasters, the 'Iraq War 2003: What Really Happened Behind The Political Scenes' develops a thorough analysis of what led the Bush administration use the 'War on Terror' to attack Iraq. Both the Afghan and Iraq wars continue even now to haunt the economical undercurrents of American life like a hungry ghost contributing to our country's recession. What are the real costs of both wars and why were we led to believe otherwise? \"If we fail to learn from history we are doomed to repeat it\". Sun Tzu, the ancient philosopher of war, stressed the importance of \"Knowing Your Enemy\". This being critical to victory in the War on Terror, the book examines why al-Qaeda attacked the US on 9/11. Could those attacks have been prevented? What warnings from CIA and America's friends around the world preceded the terrorist attacks of 9/11 but ignored by the Bush administration, which then used them to support its agenda of taking out Osama bin Laden's natural enemy, Saddam Hussein, much to the chagrin of most of America's traditional allies around the world and to the benefit of both al-Qaeda and the government of Iran? Why were Mullah Omar,Osama bin Laden and Ayman al-Zawahiri allowed to escape? Most know Mark Owen's \"No Easy Day\" and how Osama bin Laden was killed in Pakistan in 2011, but only a few are familiar with the details of how the military bureaucracy under the Bush administration interfered with CIA doing its job. Why was al-Qaeda happy that the Bush Administration planned to invade Iraq? What was Osama bin Laden's strategic long-term plan for harming the USA and what role did George W. Bush play in helping it succeed? How did the Iraq war of 2003 unwound principally to the benefit of al-Qaeda and the Shia fundamentalists of Iran? How did the War in Afghanistan, so successful in its opening weeks, become 'The Long War'? What are the most effective methods for fighting terrorism? How did Saddam Hussein acquire his WMDs and how long, in the face of serious consequences for doing so, did he hold on to them? America was prosperous working toward paying off its debts during the 1990's. What exactly would take now to undo the initial mistakes on the \"War on Terror\"? Based on the theory of conservatism, were the neo-conservatives of the Bush administration real conservatives? This analysis alone is a must-read for those Republicans at-heart concerned over how their once party has strayed from its main-street principles with which it once resonated.Its first few chapters focus on the opening months of the Afghanistan War and Osama bin Laden's escape in Tora Bora, then segue into the invasion of Iraq, telling how the Iraq War of 2003 unwound largely to the benefit of al-Qaeda and the fundamentalist government of Iran. The compelling narrative of 'Iraq War 2003: What Really Happened Behind The Political Scenes' is written almost in the manner of a novel that unpacks in an engaging and logical sequence detailed and documented information about a difficult time in modern American history.The book ties together a considerable amount of information and provides a hopeful analysis by reminding us of where we have been. Patriotic concern - like the imprisoned lightning to which it subtly alludes - threads its way through the pages of this book, reminding its readers of the people, ideas, and inspirations that called for America to be its best.",
  "genres": [
    "History",
    "Politics"
  ],
  "author": "Charles Edmund Coyote",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/17559406-iraq-war-2003"
}