{
  "title": "Simple Dreams: A Musical Memoir",
  "description": "In this memoir, iconic singer Linda Ronstadt weaves together a captivating story of her origins in Tucson, Arizona, and her rise to stardom in the Southern California music scene of the 1960s and ’70s.Born into a musical family, Linda’s childhood was filled with everything from Hank Williams to Gilbert and Sullivan, Mexican folk music to jazz and opera. Her artistic curiosity blossomed early, and she and her siblings began performing their own music for anyone who would listen. Now, twelve Grammy Awards later, Ronstadt tells the story of her wide-ranging and utterly unique musical journey.Ronstadt arrived in Los Angeles just as the folk-rock movement was beginning to bloom, setting the stage for the development of country-rock. After the dissolution of her first band, the Stone Poneys, Linda went out on her own and quickly found success. As part of the coterie of like-minded artists who played at the Troubadour club in West Hollywood, she helped define the musical style that dominated American music in the 1970s. One of her early back-up bands went on to become the Eagles, and Linda would become the most successful female artist of the decade. She has sold more than 100 million records, won numerous awards, and toured all over the world. Linda has collaborated with legends such as Emmylou Harris, Dolly Parton, Aaron Neville, J.D. Souther, Randy Newman, Neil Young, Bette Midler, and Frank Sinatra, as well as Homer Simpson and Kermit the Frog. By the time she retired in 2009, Ronstadt had spent four decades as one of the most popular singers in the world, becoming the first female artist in popular music to release four consecutive platinum albums.In Simple Dreams, Ronstadt reveals the eclectic and fascinating journey that led to her long-lasting success. And she describes it all in a voice as beautiful as the one that sang “Heart Like a Wheel”—longing, graceful, and authentic.",
  "genres": [
    "Music",
    "Memoir",
    "Biography",
    "Nonfiction",
    "Autobiography",
    "Biography Memoir",
    "History"
  ],
  "author": "Linda Ronstadt",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/17559245-simple-dreams"
}