{
  "title": "Innocence Reclaimed",
  "description": "Innocence ReclaimedSiobhan, join us as we find her still in the clutches of Monique, trapped in her French Château while her sexuality is slowly and sensuously awakened by the acts she is drawn into doing. Jarryd, the vampire who Blake has sent in to protect her, is unwittingly falling in love with her. Fighting to raise her spirit and courage. Feeling emotions that he once thought were long dead inside of him rise to the surface and threaten to overwhelm him. All the passion and desire...his love for her...he knows it is a futile fight. He knows a happily ever after with her will be signing his own death sentence. He cannot allow his fantasy to be more than that... Monique, the wicked captor who ripped her from Blake’s warm embrace. Her plans for Siobhan are coming to fruition. The Elders' party. A gathering of all vampire Elders, which is held once a century. It has been whispered about the château, draws closer. Will hell on earth reign supreme? Find out in the continuing story.Blake, That one name is enough to send excited shivers of pleasure down anyone’s spine. As one of the world's most powerful and most charismatic Elders, he will be ordered to attend the Elders party. But even he, with all his years of training, worries that he won’t be able to hold his restraint until the perfect time arrives to rescue his love.Anthony, Blake’s brother, believed to be long dead. A sickness of his mind leads him to believe she is destined to be his and has been making plans for her. Quietly and patiently waiting in the background, his evil presence is tangible... Follow along as the journey continues for all of those that dwell within the walls of the Château.Innocence Reclaimed is a roller coaster ride of highs, lows, and thrilling excitement. It will make you believe that love can conquer all.Welcome back to Innocence Reclaimed",
  "genres": [
    "Vampires"
  ],
  "author": "Helen  Johnston",
  "average_rating": "4.69",
  "url": "https://www.goodreads.com/book/show/17560686-innocence-reclaimed"
}