{
  "title": "Alien Abduction",
  "description": "Reverse harem/multiple hero When Cara is taken by the shape-shifting beast men warriors of Ator, she gets hands on training in triad mating traditions. The Furians-Dagon, Gilen, and Joar had lost all hope of a future with the destruction of their home world until they stumble across an Earth woman they rescue from their enemy. Before she can be claimed by a rival beast clan, they decide to claim her for their own and set about initiating the triad mating ritual. 11/8/13 Long Category Word 53,492 Sci-Fi/Futuristic/Fantasy Romance Spicy/Erotic--Multiple heroes (three), captive situation/forced seduction, mild bondage/forced seduction; ménage; alien mating practices Author Kaitlyn O’Connor was first published by Harlequin Enterprises in 1994 under the pen name of Madris Dupree after nearly a decade of ‘apprenticeship’ --struggling to learn the business, the marketing, and the writing skills necessary for a career in commercial fiction. That ‘first’ published book, a historical, (which was actually her fourth attempt at a marketable piece of fiction) was successful, however, selling nearly 80,000 copies in the U.S., Switzerland, France, and the U.K. She writes various genres (or sub-genres since she always writes romance!) under different pen names. She has written science fiction/futuristic/fantasy under several—Kaitlyn O’Connor, in honor of her Scottish grandmother, Lyssa Hart, and Angelique Anjou (for the French ancestry), all combined here now under the single pen name Kaitlyn O’Connor. Other titles by this Alien Breeders Deep Penetration The Assassin's Blade Atalantium Bride of Atlantis Atalantium Neptune's Daughter (Coming Soon) Atalantium Maiden of Atlantis (Coming Soon) The Rebel's Woman The Barbarian Prince (Coming Soon) Beastmen of Alien Abduction Below Breeder Breeder Project Chaos Forged Children of Lords of the Sea Conquest Prince Galen Cyberevolution The Awakening Cyberevolution Recall Cyberevolution Abiogenesis Cyberevolution Cyborg Cyberevolution Illumination Cyberevolution Cyborg Nation Cyberevolution Rules of Engagement Dark Solstice The Forgotten Dragonlord Enslaved Genesis Enslaved The Spawning Enslaved The Gladiators Exiled Forest Whispers The Gate Adaptation Ja-Rael's Lioness Gabriel The Lion's Woman Lords of Mayhem Night Raven The Ninth Orb The Portal Return to Eden The Watchers (Coming Soon)",
  "genres": [
    "Science Fiction",
    "Aliens",
    "Romance",
    "Menage",
    "Shapeshifters",
    "Science Fiction Romance",
    "Paranormal"
  ],
  "author": "Kaitlyn O'Connor",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/17562977-alien-abduction"
}