{
  "title": "The Rose Red Reaper",
  "description": "The Rose Red Reaper is taking the romance out of roses, one victim at a time...Lt. Commander Mason Cole never intended to follow his brother into law enforcement, but the murder of a loved one gave him the motivation needed to take a position as the head of Chicago's Serial Crimes Unit. Along with his brother, Detective Devon Cole, former FBI Profiler and Technical Analyst Melinda Kade and Detective Piper Torello, Mason is tasked with finding some of the cities most prolific serial killers.As a former Navy SEAL, Mason has seen some of the worst the world has to offer, but nothing could have prepared him for his initiation into the world of a serial killer. Their first case came with a gruesome introduction from a man who has given himself his own press ready moniker. Known for his macabre signature and the white rose he leaves at the scene with a calling card signed in blood,THE ROSE RED REAPERMason and his team will pursue the killer through the vast streets of Chicago, across the affluent suburbs of the North Shore following cryptic clues left at each crime scene and pointing them to a web of violence dating back to The Reaper's own childhood.Complications begin to arise when The Reaper makes a connection to the woman that Mason loves. Dakota Rose Shelton. The stunning, raven-haired beauty that has carefully salvaged Mason's broken heart may also be the key to ending The Reaper's bloody reign. Left blind by a childhood illness, she must help them to assemble the pieces of the Reaper's past with no visual memories to aid her.Can Dakota help the team put the pieces together before The Reaper targets one of there own? And will she be able to fight off a killer that she cannot see?",
  "genres": [
    "Romantic Suspense",
    "Mystery",
    "Thriller",
    "Mystery Thriller",
    "Romance",
    "Suspense",
    "Adult"
  ],
  "author": "Kristi Loucks",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/17563791-the-rose-red-reaper"
}