{
  "title": "Broken",
  "description": "The Light’s Duty to Protect A war over the fate of mankind sparked the creation of the Ancients - Light and Dark - one divinely-created guardians, the other hell-spawned killers. The conflict raged within the Realm for millennia, neither faction triumphant in its purpose. In recent history the Darks have adopted a more surreptitious path - the boom of technology allowing the Dark One to insinuate himself into the midst of those he would most like to destroy. Tragic consequences result when the Ancients of Light pursue the Darkness into the Outer Realm. The Prophecy continues…Darkness Claimed Her SoulThe adversity of Kylie’s youth forged an indomitable spirit. A vibrant and strong woman determined to plot the course of her life with room for nothing beyond the next measure of success, Kylie believed in only herself, and most certainly neither destiny nor love. All those tenants were derailed with a single encounter, but the same man that tempted her to live again drew her into the middle of an aged war, the consequence being her own destruction, plummeting her into a hellish existence. A Warrior Haunted by His Failure Sayer’s mission was only to foil the latest plan of the Darks in the Outer Realm and return a few Vampire to Hell. Finding a perfect mortal that tempted him beyond all reason was unforeseen complication. Just when Sayer realizes that his eternity is meant for one alone, Kylie is destroyed by the Darks, and the loss drives him to the pits of despair, revealing events of the past that would best be long forgotten. Tragedy will Reveal Those of Divine PurposeSayer’s appearance in her life was the catalyst to fulfilling a destiny that has existed since Kylie’s creation. Their fate thwarted by Darkness, both shattered by tragedy, Kylie and Sayer must return to the love that once was while finding absolution and seeking forgiveness, or perish apart. Only once all that was broken is returned to unblemished will God’s own Warriors rise. The beginning of the beginning…About the Ancients of Light seriesChosen is the first in the thirteen books of the Ancients of Light series and is only the beginning of a young Witch’s journey toward developing both the strength of character and magic that will be required to fulfill her prophesied role as leader of the Light faction. Revelations of nuances in the Prophecy - facets that were never fully comprehended by the Ancients - will continue in successive stories. The culmination of its true meaning in the destiny of the supernatural world of the Realm will only be revealed when Kaitriana is adequately prepared to lead the Warriors now being called together to champion the Light’s purpose. Familiar characters return for each storyline as the focus turns to a new key couple in every book - a pair that significantly factors into the purpose of Light – however, the story of the Chosen does not end with Book #1. Kaitriana and Lorcan, their growth together as partners in leadership and in love as a couple, will thread through the series as Kaitriana assumes the role that was destined as hers since the beginning.",
  "genres": [
    "Witches",
    "Paranormal Romance",
    "Romance",
    "Vampires"
  ],
  "author": "Heather Fleener",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/17564545-broken"
}