{
  "title": "Original Souls",
  "description": "Alternate Cover Image of ASIN: B00BQ7WU54Tags: Magical Fantasy, Science Fiction, Modern-to-Futuristic setting, Gay Teens ... Hope you're intrigued. Thanks for reading.When the turquoise-eyed Corinth wakes from a two year stent in a hyperbolic coma, he and his family have some obstacles to overcome before he fatefully meets a boy. Anvard, the pink-eyed, heart-melting athlete attending Aurora Boreal mystique boarding school helps Corinth feel welcomed like he never has before. Though the peculiar entity speaking to the mind of young psychic, Corinth, knows these boys' futures are eternally linked--there seems to be something missing in their connection.But before Corinth can meet Anvard, and his destiny, he must be rescued. His father, Criston, a blue-eyed policing officer of the 8ights Council (the elected council that guides the eight Worlds) will stumble upon his son in a non-accidental fashion.While Corinth's torn, green-eyed mother, Julia, wrestles within and bickers with her husband over the available options to protect Corinth after his mysterious recovery...intricate plans are put to action. His abductors needed this distraction. Needed him to see his parents again. And what then comes of these three separating lives of the little mixed race family turns out to be a plot within a plot that the eight Worlds haven't encountered since they were once one people.But now, it seems the mythical enemies of the human race may leave no person behind to tell this grand tale of a haunted psychic boy's adventure through time and adolescent life.*An original monster trading/battling card game; skeleton keys that rotate, generating extra power for mystique wielders, rendering wands obsolete; a dangerous contact sport where wrecking the track is a necessary part of the game; dormitories; a boring library!; expansive grasslands and water bodies that are fortified by sparkling pixie dust; eight races of people defined by eye color; and access to an earth spanning bridge built in the sky to connect the eight Worlds that exist in separate dimensions...all help to make up the elaborate experience Corinth has at Aurora Boreal School.",
  "genres": [
    "Fantasy",
    "M M Romance",
    "Young Adult"
  ],
  "author": "Kyle Thomas Miller",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/17564882-original-souls"
}