{
  "title": "The Nanjing Massacre: A Japanese Journalist Confronts Japan's National Shame",
  "description": "This book is based on four visits to China between 1971 and 1989 by Honda Katsuichi, an investigative journalist for Asahi Shimbun. His aim is to show in pitiless detail the horrors of the Japanese Army's seizure and capture of Nanjing in December 1937. Unvarnished accounts of the testimony - Chinese victims and Japanese perpetrators - to the rape and slaughter are juxtaposed with public relations announcements of the Japanese Army as printed in various Japanese newspapers of the time. The bland announcements of triumphant victories stand in bitter contrast to the atrocities that actually took place on the scene. The story unfolds with horrible detail as we watch the triumphant progress of the Japanese army whose troops were bent on rape and killing in the so-called \"heat of battle.\" Yet by recalling the testimony of Japanese soldiers and reporters who were on the scene, as well as reproducing dispatches by Japanese Army authorities at the time, Honda makes it clear that the atrocities were part of a studied effort directed by the Japanese high command to impress the Chinese people with the power of its army and the folly of resistance to it - the estimate of 300,000 killed in these \"military operations\" is no exaggeratoin. Honda has worked with other Japanese journalists and scholars who have attempted to reveal the truth of the Nanjing massacre, provoked by the efforts of right-wing Japanese, including, sadly, many government officials, to whitewash the whole incident, even to the point of contending that a \"massacre\" never happened. This gripping account of the atrocities and cover-up joins other exposes - Chinese and now German - in keeping alive the memory of this shameful event.",
  "genres": [
    "Nonfiction",
    "History",
    "China",
    "Japan",
    "World War II",
    "Japanese Literature",
    "Historical"
  ],
  "author": "Katsuichi Honda",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/175653.The_Nanjing_Massacre"
}