{
  "title": "Every Cloud",
  "description": "Jem at 26 thought she had it all, loving devoted husband and three children; she felt blessed and was blissfully happy, until a tragic accident takes the life she knew away. It’s a mother worst nightmare one that many of her friends would have dearly died instead of going through the pain she felt. Nevertheless, Jem had a choice, fight, or die. Deciding she would rather fight for a new life than die in her old one, she flees to America to start again. She encounters that for a large country here, problems never go away, but with the help of her colourful friends she has met, she surely could find a way through the dark. Therefore, with the help of Betty, an elderly lady but compassionate and loyal, and Justin a lively but fiery gay from Las Vegas she begins to think her life was complete. What she hadn’t bargained for was Ryan, An overly attractive and sexy as hell actor she had always loved and admired. Her life is suddenly swept from underneath her in a fairy tale romance. However, at what cost will that fairytale ending be? Her job, her friends, or maybe even her family? However, not all is happy in what should be her happily ever after. Ryan’s ex-girlfriend, Krista (or as Jem calls her, the pedicure princess) is out to make trouble at every chance she gets. After being dumped in an ungracious manner, Krista feels resentment towards Ryan- who has finally found happiness, and anything Ryan loves must be destroyed at all cost. However, will she win or will Krista’s mind games cost her everything? A family accident puts into perspective that life is too short and she finally begins to understand herself and her feelings, and goes after Ryan to devote her life to him. However, what will Ryan do when he discovers Jem’s deep dark past, and will Jem find her happily ever after? On the other hand, will the biggest skeleton in Jem’s past come back to haunt her causing her to lose everything she has wanted and worked to achieve.",
  "genres": [],
  "author": "Gemma Robson",
  "average_rating": "3.41",
  "url": "https://www.goodreads.com/book/show/17565389-every-cloud"
}