{
  "title": "Guardian's Grace",
  "description": "Librarian's Note: this is an alternate cover edition - ASIN B0082ZE27M Grace Masters always wanted a family she could call her own. Of course, in her imagination it didn’t include a pair of rambunctious and affectionate twins who can turn into killers within the blink of an eye or an aging vampire who has trouble controlling his thirst. She never expected to find a friend and mentor in a three hundred year old witch who looks like Sophia Loren. And she certainly never dreamed – okay, she dreamed but never thought it would come true – of a tall, handsome hero who would sweep her off her feet. Yet here she is, in an old Victorian home, living and loving under the cover of night. Who knew that the source of her lifelong torment was really her gift as a Daughter of Man or that this gift could be controlled and used for something good? Who knew there was another race called the Paenitentia who live side by side with humans? Who knew that demons were real? Grace certainly didn’t until one fateful night when her world falls apart and comes together again in a place where she finally feels she belongs. Sometimes a person just knows when something is right and destined to be. Sometimes convincing someone else of that fact is a little more difficult. Canaan ad Simeon is that someone else. Canaan is Liege Lord to a House of Guardians whose job is to protect the Race from a demon threat many no longer believe in. Already breaking away from the outdated traditions that are depleting their numbers and threatened by a hierarchy resistant to change, the last thing Canaan needs is to fall for this innocently sexy Daughter of Man. But fall he does, with a mixture of comedy, drama and sexy fun that will touch your heart.",
  "genres": [
    "Paranormal Romance",
    "Paranormal",
    "Vampires",
    "Romance",
    "Demons",
    "Fantasy",
    "Urban Fantasy"
  ],
  "author": "Jacqueline Rhoades",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/17567995-guardian-s-grace"
}