{
  "title": "Rhythm Science",
  "description": "The art of the mix creates a new language of creativity. \"Once you get into the flow of things, you're always haunted by the way that things could have turned out. This outcome, that conclusion. You get my drift. The uncertainty is what holds the story together, and that's what I'm going to talk about.\"— Rhythm Science The conceptual artist Paul Miller, also known as Dj Spooky that Subliminal Kid, delivers a manifesto for rhythm science—the creation of art from the flow of patterns in sound and culture, \"the changing same.\" Taking the Dj's mix as template, he describes how the artist, navigating the innumerable ways to arrange the mix of cultural ideas and objects that bombard us, uses technology and art to create something new and expressive and endlessly variable. Technology provides the method and model; information on the web, like the elements of a mix, doesn't stay in one place. And technology is the medium, bridging the artist's consciousness and the outside world. Miller constructed his Dj Spooky persona (\"spooky\" from the eerie sounds of hip-hop, techno, ambient, and the other music that he plays) as a conceptual art project, but then came to see it as the opportunity for \"coding a generative syntax for new languages of creativity.\" For \"Start with the inspiration of George Herriman's Krazy Kat comic strip. Make a track invoking his absurd landscapes...What do tons and tons of air pressure moving in the atmosphere sound like? Make music that acts a metaphor for that kind of immersion or density.\" Or, for an online \"remix\" of two works by Marcel \"I took a lot of his material written on music and flipped it into a DJ mix of his visual material—with him rhyming!\" Tracing the genealogy of rhythm science, Miller cites sources and influences as varied as Ralph Waldo Emerson (\"all minds quote\"), Grandmaster Flash, W. E. B Dubois, James Joyce, and Eminem. \"The story unfolds while the fragments coalesce,\" he writes. Miller's textual provocations are designed for maximum visual and tactile seduction by the international studio COMA (Cornelia Blatter and Marcel Hermans). They sustain the book's motifs of recontextualizing and relayering, texts and images bleed through from page to page, creating what amount to 2.5 dimensional vectors. From its remarkable velvet flesh cover, to the die cut hole through the center of the book, which reveals the colored nub holding in place the included audio CD, Rhythm Excerpts and Allegories from the Sub Rosa Archives , this pamphlet truly lives up to Editorial Director Peter Lunenfeld's claim that the Mediawork Pamphlets are \"theoretical fetish objects...'zines for grown-ups.\"",
  "genres": [
    "Music",
    "Nonfiction",
    "Art",
    "Research",
    "Essays",
    "Philosophy"
  ],
  "author": "Paul D. Miller",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/175687.Rhythm_Science"
}