{
  "title": "Relatos reunidos",
  "description": "Un genio de la botella de leche mágica que te ofrece elegir entre ser Picasso o tener un Picasso; un perro rabioso que le ladra a un colectivo en marcha y un pasajero que recuerda algo que había creído olvidado; una inmutable tradición del universo que reúne a Dios y a sus únicos invitados, los monos, a tomar el té una vez al año; un grupo de veinteañeros entusiastas que se entregan a la búsqueda de la simetría... Relatos reunidos recoge una selección de cuentos escritos entre 1996 y 2011: diecisiete relatos a medio camino entre el cuento y la crónica imaginada, que dan cuenta del genio inclasificable de César Aira, uno de los autores más valorados del panorama literario en lengua castellana. «Uno de los tres o cuatro mejores escritores que escriben en español actualmente.» Roberto Bolaño «César Aira es uno de los novelistas más provocativos e idiosincrásicos de la literatura en castellano. No hay que perdérselo.» Natasha Wimmer, The New York Times Biografía del autorCésar Aira nació en Coronel Pringles, Argentina, en 1949. Desde 1967 vive en Buenos Aires, dedicado a la escritura de novelas, ensayos -y muchos textos que oscilan entre ambos géneros-, y a la traducción. Aira es uno de los narradores más radicalmente originales, imaginativos, inteligentes y delirantes. Su obra ha sido publicada profusamente en Argentina, Chile, México y España, y varias novelas suyas han sido traducidas al alemán, al inglés, al francés y a otras lenguas. Colaborador habitual de diversos periódicos y medios de comunicación, también ha ejercido la docencia en las universidades de Buenos Aires y Rosario. En Literatura Mondadori se han publicado hasta el momento: Emma, la cautiva (1997), Cómo me hice monja (1998), La mendiga (1999), Cumpleaños (2001), El mago (2002), Canto castrato (2003), Las noches de flores (2004), Un episodio en la vida del pintor viajero (2005), Parménides (2006), Las curas milagrosas del doctor Aira (2007), Las aventuras de Barbaverde (2009), El error (2010), El congreso de literatura (2012), y Los fantasmas (2013).",
  "genres": [],
  "author": "César Aira",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/17569591-relatos-reunidos"
}