{
  "title": "To Love and Heal",
  "description": "When Anna Knight hires Caleb Brown to remodel her recently purchased fixer-upper home, little does she know that he will soon be building his way into her heart as well. But with Caleb residing in the guesthouse on her property for the duration of the project, Anna finds herself increasingly drawn to a man who she undoubtedly finds attractive, but admittedly knows little about. Yet she soon realizes that his strong, silent demeanor masks a torrent of inner turmoil. Caleb’s reluctance to reveal much about his three tours of duty as a CASEVAC helicopter pilot in the Afghanistan War prompts Anna to dig up what she can on her own – and what she discovers only makes her more determined to help him heal from his post-war emotional scars.Caleb is grateful for his new remodeling gig, hoping that the intensive, hands-on work will be just the tool he needs to close the door for good on the disturbing images of war that haunt him day and night. And though his attraction to Anna is immediate, it’s one more thing he tries to push from his mind. After all, what could he possibly have to offer an attractive, successful and compassionate woman like Anna, who at the very least deserves someone who is not inwardly tortured with pain and regret? Flying directly into the line of fire to rescue wounded soldiers meant putting his life on the line every day during his time in Afghanistan. But despite all the lives he helped save, it’s the one soldier who died while trying to save him that refuses to leave his thoughts.Anna makes it her mission to convince Caleb that he is suffering from post-traumatic stress disorder and needs to confront his inner demons – but this is one assignment that Caleb refuses to heed. Can the strength of her growing love help Caleb finally heal, or will he pull away for good to spare them both more pain?289 KB",
  "genres": [],
  "author": "Tamra Rose",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/17569491-to-love-and-heal"
}