{
  "title": "The Staff of Uthire",
  "description": "The Staff of Uthire is the first book of my Resurgence trilogy. It is set in a fictional land, the Kingdom of Glazorath, based on Medieval England. It has a gay priest, Pharsea, as one of its central characters and a strong-willed wizardess, Bronwyn, as another. A group of outlawed courtiers set out to oppose the political aspirations of a Duke Regent intent on usurping the Throne. They travel throughout the Kingdom, recovering the lost Coronation Regalia, gathering political and military support and starting to discover something of what lies behind the Regent's unlooked for treason. I write as a Platonist Catholic and the text is influenced and supported by this outlook. The text deals with issues such as the relationship between love and friendship; the connectedness of magic, sex and religion; temptation and what makes a person do evil; what constitutes political legitimacy; and the conflict between law and justice. Jalgrod the druid was anxious. He took no comfort from the peaceful whisper of the breeze in the tall cedars. The stars of Cygnus, the great swan beckoned him on, but he had no knowledge of where the path he had set out on would lead, and this lay heavy on his heart. Ahead, he half saw the cloaked figure of Sir Ambrose mounted on the great Roan that was his pride and joy. The jingling of harness and the sound of muttered prayers confirmed that Dom Pharsea was close behind. “How much further now, Ambrose?” the druid called out in his strong bass voice. “I should know these woods, but they seem strange tonight – as if I’d never been here!”“We’re almost there, My Lord Jalgrod,” the knight replied.“The crescent moon gives little light and I thought to take best advantage of the darkness by avoiding the main path. This way will lead just as surely to the gnome, and we’ll not be seen by inquisitive eyes.” Ambrose’s confident words did little to lift Jalgrod’s mood. He hunched his shoulders within the ivy-green and aquamarine robes and fur-lined dark brown leather cloak he wore. He couldn’t dismiss the conviction that their enterprise was forlorn. They had so little to go on, and so few resources. During his years at court, he had come to rely heavily on the network of informants and agents which he had carefully built up. Those times were no more, hence the need for the gnome – but why should he help? Jalgrod asked himself. What would he demand in return? The rascal owes me a few favours, it’s true, but did the debt amount to him risking his life? Ah well, if he – the sometime Chancellor of Glazorath – had been driven to opposing Grymwold, perhaps the gnome would find his own reasons. Finishing his Saturday evening litany, Pharsea Ap Tolan looked up at the Constellation of the Swan. He felt the great bird to be watching him with its starry eye... but that was ridiculous! Tolan’s beard! My imagination is running wild tonight, he scolded himself. He shook his head and fumbled under his grey hooded mantle for the prayer beads which he hoped would help steady his nerves. He mustn’t get carried away. The Heavens knew there was every reason not to be calm, but calm he must be. Bold plans would be laid this night, and there would be no room for error, but if the gnome refuses to help us – what then? Disquiet welled up inside him and he shivered in spite of the warm brown habit he was wearing. The gnome simply has to agree to help. Bronwyn will have prepared the ground. Bringing up the rear, the burly Earl Keith Barnard was already having second thoughts. Just how did I allow myself to be talked into this mad errand? he berated himself. Granted, I’d already made myself unpopular at Court, and my involvement with the druid might be thought to amount to treason… yet the alternative of accepting enforced retirement at the hands of the Regent was less honourable still!",
  "genres": [],
  "author": "Stephen C. Lovatt",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/17570341-the-staff-of-uthire"
}