{
  "title": "The Dark One: Dark Knight",
  "description": "1486 A.D.\nFresh from his treacherous turning of the tides against Richard III in the Battle of Bosworth, Sir Gaston de Russe’s reputation is dark and dirty. Those loyal to Richard hate him and those loyal to Henry Tudor fear him. He is, after all, The Dark One.\nIn order to gain a strong foothold in Yorkshire, Henry sends Gaston to one of the largest fortresses in the north, a massive bastion called Mt. Holyoak Castle. Having formerly belonged to Sir Guy Stoneley, who is now a prisoner in the White Tower after his capture at Bosworth, the castle is still the home to Guy’s wife, Remington, her three sisters, and her son. Gaston takes possession of Mt. Holyoak, pleased with his acquisition and intrigued with Lady Stoneley. Beautiful, somewhat shy and demure, Gaston soon comes to find out that Mt. Holyoak harbors a horrible secret of rape and abuse. Guy Stoneley abused his wife and sisters, so much so that the women look to Gaston as their saviour for taking Mt. Holyoak from Guy. As Gaston struggles to administer the North and form alliances with those still loyal to Richard, something more is taking place that threatens to distract him from his task. The lure, the power, is more than he can resist.A strong bond is forming between the knight believed to be the ultimate traitor and the lady who has known nothing but sorrow and horror. And with that realization, a delicate love story begins as two lonely people find solace and comfort with each other. Gaston soon realizes he loves Remington more than anything, which sets the stage for the biggest battle of his life: the fight against the Catholic Church in his quest for an annulment so he can marry her.Join Gaston and Remington as they embark on an epic adventure of discovery, love, anguish and sorrow, defeat and victory. From the hills of Yorkshire to the halls of London, share their story of a lifetime where dreams become reality and true love really does conquer all.",
  "genres": [
    "Historical Romance",
    "Medieval",
    "Historical",
    "Romance",
    "Medieval Romance",
    "Audiobook",
    "Historical Fiction"
  ],
  "author": "Kathryn Le Veque",
  "average_rating": "4.51",
  "url": "https://www.goodreads.com/book/show/17570536-the-dark-one"
}