{
  "title": "Revolutionary",
  "description": "“A remarkable novel” (The New York Times) about America’s first female soldier, Deborah Sampson Gannett, who ran away from home in 1782, successfully disguised herself as a man, and fought valiantly in the Revolutionary War.At a time when rigid societal norms seemed absolute, Deborah Sampson risked everything in search of something better. Revolutionary, Alex Myers’s richly imagined and carefully researched debut novel, tells the story of a fierce-tempered young woman turned celebrated solider and the remarkable courage, hope, fear, and heartbreak that shaped her odyssey during the birth of a nation.  After years of indentured servitude in a sleepy Massachusetts town, Deborah chafes under the oppression of colonial society and cannot always hide her discontent. When a sudden crisis forces her hand, she decides to escape the only way she can, rejecting her place in the community in favor of the perilous unknown. Cutting her hair, binding her chest, and donning men’s clothes stolen from a neighbor, Deborah sheds her name and her home, beginning her identity-shaking transformation into the imaginary “Robert Shurtliff”—a desperate and dangerous masquerade that grows more serious when “Robert” joins the Continental Army.  What follows is a journey through America’s War of Independence like no other—an unlikely march through cold winters across bloody battlefields, the nightmare of combat and the cruelty of betrayal, the elation of true love and the tragedy of heartbreak. As The Boston Globe raves, “Revolutionary succeeds on a number of levels, as a great historical-military adventure story, as an exploration of gender identity, and as a page-turning description of the fascinating life of the revolutionary Deborah Sampson.”",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "LGBT",
    "American Revolution",
    "Transgender",
    "Queer"
  ],
  "author": "Alex    Myers",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/17571171-revolutionary"
}