{
  "title": "How to Discipline Your Vampire",
  "description": "In this exciting paranormal erotic romance, a dominant schoolteacher with a serious role-play fetish finds the perfect submissive in an infamous vampire lover.Cerise Norrell, Type A substitute teacher by day, is ready to quit being a domme. Despite her best intentions, none of her partners can keep up with her scene fetish and attention to detail—let alone her demand that they have a costume and set waiting every afternoon by the time she’s home from school.Over a dozen potential subs have left her in the past year, but just when Cerise thinks it’s impossible—that she’ll have to go back to vanilla relationships, or be alone forever—she meets William, who wants to make all her fantasies come true. He turns her home into a geisha’s dream apartment, a concert hall with a grand piano (which he uses to play an original composition while wearing a tuxedo), and even rents an abandoned loft for a zombie apocalypse scene—complete with canned goods.But there’s something strange about William. Well, a lot of strange things. He must be absurdly rich, since he can afford to provide extravagant costumes and props on a daily basis without having to leave work early. He must be insane, since he puts up with Cerise’s over-the-top demands. And most importantly, he doesn’t redden when he’s spanked, and his skin is as cool as satin sheets. When Cerise discovers she’s become dome to the infamous “Chilly Willy,” as he’s known throughout the BDSM urban lore, she begins to find out there’s a whole lot more to her handsome submissive than a creative mind and a hard body.And when it’s William, ironically, who starts pressing Cerise to give him the kind of commitment she’s never given anyone, it’ll take everything she has to work through her issues, confront her past, and learn to be vulnerable.",
  "genres": [
    "Vampires",
    "Romance",
    "BDSM",
    "Erotica",
    "Paranormal Romance",
    "Paranormal",
    "Adult"
  ],
  "author": "Mina Vaughn",
  "average_rating": "3.39",
  "url": "https://www.goodreads.com/book/show/17571282-how-to-discipline-your-vampire"
}