{
  "title": "10 Nights Past",
  "description": "Per author's blog post on May 19, 2013, not to be released.I'm still getting emails, facebook messages, and twitter DM's about the ending for the 10 Nights Saga. I would like to bring an end to this and hopefully all readers of the series (which I thank from the bottom of my heart) understand that I can't release this book. I won't rehash the drama that stole this book from my hands, but I will say that Karma has a way of getting revenge. So while I can't sell the book, I can give you the overview of how it was supposed to end. Rhett, Leah, and Alex and their sexy story will live on forever in my heart and I think we all know who the real author of this book was by now. So without any further drama, let's discuss the ending of 10 Nights. 10 Nights Past begins with Alex taking Leah, Janie and David to the pony ranch. Leah has visited before, but never as an active participant. She's agreed to give Alex a weekend to see if this lifestyle is something she could be a part of. She discovers during the course of that weekend that the life of a pony slave is more in-depth than anything she's ever experienced with Rhett before, and it terrifies her. While at the Ranch, Leah is exposed to the 24/7 lifestyle of a pony girl. Meaning that she isn't allowed to speak, all her physical needs are taken care of, and she is basically a glorified pet to be used how Alex chooses. At the end of the weekend she is beyond overwhelmed at the situations he's exposed her to. She discovered that while he could be a very loving dominant, his need to control goes far above what even Rhett had asked from her as a submissive. She asks for some time away from him to try and come to grips with the new knowledge. While she's taking her Alex hiatus, Rhett calls and they begin talking about what went wrong in their relationship. Leah finally understands that everything has been happening in her life too quickly. She continues to work for Alex but their relationship continues on the platonic level. Rhett continues to update her on his therapy situation, and they really begin communicating long distance. Leah is climbing the corporate ladder at work and focuses all her attention there leaving all elements of the BDSM lifestyle on hold for six months. When Rhett returns he asks her to have dinner with him as a friend. She notices huge changes in his personality, and he discerns that she's growing as a woman as well. She admits that she never stopped loving him but also lets him know that they moved to fast before. They agree to remain friends, and eventually they become lovers again. Rhett knows he made mistakes with Leah in the past. The six months of counseling have taught him much about the inner demons that drove him to react the way he did. they begin to rebuild their relationship the way they should have started in the beginning. Alex and Rhett are able to put their differences aside after many long talks, and thanks to Leah they can all communicate again. Janie even begins to accept the relationship between Leah and Rhett. So Rhett and Leah get their HEA, with a little Alex thrown in. Yes Alex did enjoy times with both Leah and Rhett together. I know this isn't as good as the book would have been, but I hope it at least gives closure to those people who were upset about not being able to read the last book. I will do a lot for my friends and readers, but selling out on what I believe is right is something I couldn't do. I hate that I couldn't bring you the last book, but allowing someone to bully by attempting to discredit your name was something I couldn't condone. So the book series dies, but I can sleep at night knowing who wrote those stories and feeling in my heart I did the right thing.",
  "genres": [
    "Erotica",
    "BDSM"
  ],
  "author": "Michelle Hughes",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/17571520-10-nights-past"
}