{
  "title": "Song of Spider-Man: The Inside Story of the Most Controversial Musical in Broadway History",
  "description": "As one can imagine, writing a Broadway musical has its challenges. But it turns out there are challenges one can't imagine when collaborating with two rock legends and a superstar director to stage the biggest, most expensive production in theater history. Song of Spider-Man is playwright Glen Berger's story of a theatrical dream - or nightmare - come true. Renowned director Julie Taymor picked Berger to cowrite the book for a $25 million Spider-Man musical. Together - along with U2's Bono and Edge - they would shape a work that was technically daring and emotionally profound, with a story fueled by the hero's quest for love - and the villains' quest for revenge. Or at least, that's what they'd hoped for. But when charismatic producer Tony Adams died suddenly, the show began to lose its footing. Soon the budget was ballooning, financing was evaporating, and producers were jumping ship or getting demoted. And then came the injuries. And then came word-of- mouth about the show itself. What followed was a pageant of foul-ups, falling-outs, ever-more-harrowing mishaps, and a whole lot of malfunctioning spider legs. This \"circus-rock-and-roll-drama,\" with its $65 million price tag, had become more of a spectacle than its creators ever wished for. During the show's unprecedented seven months of previews, the company's struggles to reach opening night inspired breathless tabloid coverage and garnered international notoriety. Through it all, Berger observed the chaos with his signature mix of big ambition and self-deprecating humor. Song of Spider-Man records the journey of this cast and crew as a hilarious memoir about friendship, collaboration, the foibles of hubris, and the power of art to remind us that we're alive.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Theatre",
    "Music",
    "History",
    "Pop Culture",
    "Audiobook"
  ],
  "author": "Glen Berger",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/17571716-song-of-spider-man"
}