{
  "title": "Quiet Dell",
  "description": "From one of America’s most accomplished and acclaimed fiction writers, a chilling, spectacularly riveting novel based on a real life multiple murder by a con man who preyed on widows—a story that has haunted Jayne Anne Phillips for more than four decades.Jayne Anne Phillips’s debut collection, Black Tickets, galvanized critics and readers when it was published in 1979 and announced her as one of the great new voices of her generation. Her four novels, prizewinners and reader favorites, have secured her place as one of America’s most celebrated storytellers. In Quiet Dell, Phillips re-imagines a gruesome crime in a tiny West Virginia community not far from where she grew up. In Chicago in 1931, Asta Eicher, mother of three, is lonely and despairing, pressed for money after the sudden death of her husband. She begins to receive seductive letters from a chivalrous, elegant man named Harry Powers, who promises to cherish and protect her, ultimately to marry her and to care for her and her children. Weeks later, the family are dead.Emily Thornhill, one of the few women in the Chicago press, covers the case and becomes deeply invested in understanding what happened to this beautiful family, particularly to the youngest child, Annabel, an enchanting girl with a precocious imagination and sense of magic. Bold and intrepid, Emily allies herself with the Chicago banker who funds the investigation and who is wracked by guilt for not saving Asta. Driven by secrets of their own, the heroic characters in this magnificent tale will stop at nothing to ensure that Powers is convicted. A mesmerizing retelling of a harrowing crime, Quiet Dell is a tour de force of obsession and imagination.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Mystery",
    "True Crime",
    "Historical",
    "Book Club",
    "Crime"
  ],
  "author": "Jayne Anne Phillips",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/17571727-quiet-dell"
}