{
  "title": "What's So Funny?: My Hilarious Life",
  "description": "Six-time Emmy award-winning funny man Tim Conway, best known for his characters on The Carol Burnett Show , offers a straight-shooting and hilarious memoir about his life on stage and off as an actor and comedian.Six-time Emmy Award–winning funnyman Tim Conway, best known for his characters on The Carol Burnett Show , offers a straight-shooting and hilarious memoir about his life on stage and off as an actor and comedian.In television history, few entertainers have captured as many hearts and made as many people laugh as Tim Conway. There’s nothing in the world that Tim Conway would rather do than entertain—and in his first-ever memoir, What’s So Funny? , that’s exactly what he does. From his pranks in small Ohio classrooms to his perfor­mances on national television and movies, Tim has been cracking people up for more than seventy years. Long regarded as one of the funniest come­dians around, Tim also boasts an inspiring rags-to-riches story.What’s So Funny? captures Tim’s journey from life as an only child raised by loving but outra­geous parents in small-town Ohio during the Great Depression, to his tour of duty in the Army—which would become training for his later role in McHale’s Navy —to his ascent as a national star and household name. By tracing his early path, this book reveals the origins of many of Tim’s unforgettable characters—from Mr. Tudball and the Oldest Man to Mickey Hart to everyone’s favorite, Dorf.What’s So Funny? shares the hilarious accounts of the glory days of The Carol Burnett Show and his famous partnerships with entertainment greats like Harvey Korman, Don Knotts, Dick Van Dyke, Betty White, Vicki Lawrence, Bob Newhart, and of course, Carol Burnett. As a bonus, readers will enjoy never-before-shared stories of hilarious behind-the-scenes antics on McHale’s Navy and The Carol Burnett Show .",
  "genres": [
    "Biography",
    "Nonfiction",
    "Humor",
    "Memoir",
    "Audiobook",
    "Autobiography",
    "Biography Memoir"
  ],
  "author": "Tim Conway",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/17571674-what-s-so-funny"
}