{
  "title": "Journey Into the Flame",
  "description": "In the tradition of The Celestine Prophecy comes the first book in a gripping post-apocalyptic trilogy involving the search for ancient books whose secrets hold the key to humanitys survival.In 2027, a cataclysmic event known as the Great Disruption shook the world. An unexplained solar storm struck the earth, shifting it four degrees south on its axis. Everything went dark. Humanity was on the verge of despair. Then a man named Camden Ford, fleeing a band of marauders, went into the Ozark Forests where he discovered a set of ancient books called the Chronicles of Satraya.Thirty years later, the world is a different place. Thanks to the teachings of the Chronicles, hope has been restored, cities rebuilt, technology advanced. The books have also found a different owner: Logan Cutler, a young painter who mysteriously inherited them when Camden disappeared. But when Logan auctions off the books to pay his debts, they fall into the wrong hands. The Reges Hominum, a clandestine group that once ruled history from the shadows, is now launching a worldwide conspiracy to regain control. And the books are at the center of its plans.When another original set of the books is stolen and several members of the council tasked with disseminating their philosophy are murdered, Logan realizes hes made a terrible mistake. With the help of Special Agent Valerie Perrot and the wisdom of the Chronicles as his guide, he embarks on an epic quest to find the last set before its too late.Combining new age philosophical allegories, the fast pace of race-against-time thrillers, and a historical mystery worthy of Dan Brown, Journey into the Flame will not only take you into the future, it will also take you deep into the greater mysteries of the self.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Urban Fantasy",
    "Science Fiction",
    "Post Apocalyptic",
    "Dystopia",
    "Science Fiction Fantasy"
  ],
  "author": "T.R. Williams",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/17571793-journey-into-the-flame"
}