{
  "title": "What the Dog Knows: The Science and Wonder of Working Dogs",
  "description": "A firsthand exploration of the fascinating world of “working dogs”—who seek out missing persons, sniff for explosives in war zones, and locate long-dead remains—through the experiences of a journalist and her canine companion, an incorrigible pup named Solo.Cat Warren is a university professor and former journalist with an admittedly odd She and her German shepherd have spent the last seven years searching for the dead. Solo is a cadaver dog. What started as a way to harness Solo’s unruly energy and enthusiasm soon became a calling that introduced Warren to the hidden and fascinating universe of working dogs, their handlers, and their trainers.Solo has a fine nose and knows how to use it, but he’s only one of many thousands of working dogs all over the United States and beyond. In What the Dog Knows , Warren uses her ongoing work with Solo as a way to explore a captivating field that includes cadaver dogs, drug- and bomb-detecting K9s, tracking and apprehension dogs—even dogs who can locate unmarked graves of Civil War soldiers and help find drowning victims more than two hundred feet below the surface of a lake. Working dogs’ abilities may seem magical or mysterious, but Warren shows the multifaceted science, the rigorous training, and the skilled handling that underlie the amazing abilities of dogs who work with their noses.Warren interviews cognitive psychologists, historians, medical examiners, epidemiologists, and forensic anthropologists, as well as the breeders, trainers, and handlers who work with and rely on these remarkable and adaptable animals daily. Along the way, she discovers story after story that proves the impressive capabilities—as well as the very real limits—of working dogs and their human partners. Clear-eyed and unsentimental, Warren explains why our partnership with dogs is woven into the fabric of society and why we keep finding new uses for their wonderful noses.",
  "genres": [
    "Nonfiction",
    "Dogs",
    "Animals",
    "Science",
    "Memoir",
    "Book Club",
    "Nature"
  ],
  "author": "Cat Warren",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/17571809-what-the-dog-knows"
}