{
  "title": "Still Life in Brunswick Stew",
  "description": "Delightfully Southern, Surprisingly Edgy, and Deliciously Unpredictable.\n\n\"Reinhart's country-fried mystery is as much fun as a ride on the Tilt-a-Whirl at a state fair. Her sleuth wields a paintbrush and unravels clues with equal skill and flair. Readers who like a little small-town charm with their mysteries will enjoy Reinhart's series.” — Denise Swanson, New York Times Bestselling author of the Scumble River and Devereaux's Dime Store mysteries  Cherry Tucker’s in a stew. Art commissions dried up after her nemesis became president of the County Arts Council. Desperate and broke, Cherry and her friend, Eloise, spend a sultry summer weekend hawking their art at the Sidewinder Annual Brunswick Stew Cook-Off. When a bad case of food poisoning breaks out and Eloise dies, the police brush off her death as accidental. However, Cherry suspects someone spiked the stew and killed her friend.   Caught between helping Eloise’s family and an ongoing investigation, Cherry finds herself in hot water with her deputy boyfriend, who doesn’t appreciate her style of sleuthing. As Cherry calls on cook-off competitors, bitter rivals, and crooked judges, her love life steams. Meanwhile, the killer prepares to cook Cherry’s goose.  A Night Owl Reviews Top Pick and part of the Cherry Tucker Mystery series. Get Cherry Tucker's second caper today!  \"The hilariously droll Larissa Reinhart cooks up a quirky and entertaining page-turner! This charming mystery is delightfully Southern, surprisingly edgy, and deliciously unpredictable.” — Hank Phillippi Ryan, Mary Higgins Clark, Agatha, Anthony and Macavity winning author  “Cherry Tucker finds trouble without even looking for it, and plenty of it finds her in Still Life in Brunswick Stew. From investigating the death of her close friend, digging up dirt on the locally transplanted Russian gangster, and trying to figure out what’s going on in her relationship with her hot boyfriend Luke—a sheriff’s deputy—this mystery keeps you laughing and guessing from the first page to the last. A whole-hearted five stars.” — Denise Grover Swank, New York Times and USA Today bestselling author  “Still Life in Brunswick Stew proves beyond doubt that Larissa Reinhart and her delightful amateur sleuth Cherry Tucker will be around to entertain us for many books to come.” -- Lois Winston, author of the critically acclaimed Anastasia Pollack Crafting Mystery series  “Food poisoning has never been so fun! Still Life In Brunswick Stew is a cleverly plotted, suspenseful mystery featuring a very sassy southern sleuth. The author perfectly captures the quirks of the small town setting and the story is stocked with unique and amusing characters. I can’t wait to read the next one.” -– Patricia Mason, award-winning author of In Deep Shitake  Related subjects include: cozy mysteries, amateur sleuth, women sleuths, murder mystery series, whodunit mysteries (whodunnit), humorous murder mysteries, book club recommendations, amateur sleuth books, small-town humor, Southern humor, comic (humorous) crime and mystery, small town and rural.  Books in the Cherry Tucker Mystery Series: QUICK SKETCH (novella in HEARTACHE MOTEL)  PORTRAIT OF A DEAD GUY (#1) STILL LIFE IN BRUNSWICK STEW (#2) HIJACK IN ABSTRACT (#3)",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "Whodunit",
    "Southern",
    "Murder Mystery",
    "Amateur Sleuth",
    "Cozy"
  ],
  "author": "Larissa Reinhart",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/17572295-still-life-in-brunswick-stew"
}