{
  "title": "Faithless",
  "description": "Warning: Erica Chilson is revising/rewriting/restructuring/editing/formatting the Mistress & Master of Restraint Series in its entirety for release into Print. A few titles will receive updated covers, as well as a more descriptive synopsis. The FINAL editions will vary from those currently in release. If you are a new reader, and not one who enjoys rereading, then I suggest you ‘wishlist’ or ‘TBR’ the following book & subscribe to Erica Chilson’s website: ericachilson.wordpress.comHowever, if you would like to read this title in its current form, and then experience its final edition, or if you have previously purchased this title, an ebook update will become available. You will NOT have to repurchase another ebook copy. Instruction on how to update, and whether or not you need to update to the most current edition, can be found on Erica Chilson’s website under the tab ‘Updated Editions’. Erica Chilson apologizes for the inconvenience, and hopes that the readers understand her decision to create and publish a professional book worthy of its story and its readers. *warning will be removed when the Final editions go live, and a new warning will published. If reading this statement, then the Final Editions are not available as of yet* Faithless: M&M of Restraint, #9As a child, I was Faith. As a youth, I was Faithless. Before I reached adulthood, I was pure Syn. When I was a girl of fifteen, my daddy was incarcerated, my momma was worthless, and my sister was clueless. I did everything I could to survive, to keep my loved ones alive. I began playing the game, living the game, and hungering to change and rule the game. I’ve lived a hard life- a life that has even harder decisions and the hardest of consequences. My life has given me the clarity to see what I am and accept it. Experience Faith Simpson’s life as she goes from being an innocent, impressionable girl to Restraint’s hardhearted petite sadist. The 335,000 word epic journey spans nearly 17 years and the entirety of the Mistress and Master of Restraint Series. Your thirst for answers is quenched, leaving you satisfied but eager for more.",
  "genres": [
    "BDSM",
    "Menage",
    "Romance",
    "M M F",
    "Erotica"
  ],
  "author": "Erica Chilson",
  "average_rating": "4.74",
  "url": "https://www.goodreads.com/book/show/17572477-faithless"
}