{
  "title": "The Heart of Leadership: Becoming a Leader People Want to Follow",
  "description": "Are you the type of leader people want to follow? You can be—but first, you’ve got to understand what sets great leaders apart from all the rest.Certainly, leaders need people skills, execution skills, a deep knowledge of industry trends, the ability to articulate a vision, and more—they must be competent—but that’s just the tip of the iceberg. What’s below the waterline? What’s deep inside the best leaders that makes them different?Mark Miller contends it is their leadership character. In his latest enlightening and entertaining business fable, he describes the five unique character traits exhibited by exceptional leaders and how to cultivate them.The Heart of Leadership begins with young and ambitious Blake Brown being passed over for a desperately wanted promotion, despite an outstanding individual performance. Confused and frustrated, he turns to his former mentor, Debbie Brewster. Rather than attempting to solve Blake’s problem for him, she sends him on a quest to meet with five of his late father’s colleagues, each of whom holds a piece of the puzzle he’s trying to solve.As Blake puts the pieces together, he discovers that in the final analysis, a lack of skills isn’t what holds most leaders back; skills are too easy to learn. Without demonstrated leadership character, however, a skill set will never be enough. Most often, when leaders fail to reach their full potential, it is an issue of the heart. This is Blake’s ultimate revelation.This book shows us that leadership needn’t be the purview of the few—it is within reach for millions around the world. The Heart of Leadership is a road map for every person who desires to make a difference in the lives of others and become a leader people want to follow.",
  "genres": [
    "Leadership",
    "Business",
    "Nonfiction",
    "Audiobook",
    "Personal Development",
    "Self Help",
    "Management"
  ],
  "author": "Mark      Miller",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/17572633-the-heart-of-leadership"
}