{
  "title": "Emma Goldman: Revolution as a Way of Life",
  "description": "From the prizewinning Jewish Lives series, a vibrant, deeply human portrait of a woman dedicated to fierce protest against the tyranny of institutions over individuals, by the celebrated authorEmma Goldman is the story of a modern radical who took seriously the idea that inner liberation is the first business of social revolution. Her politics, from beginning to end, was based on resistance to that which thwarted the free development of the inner self. The right to stay alive in one’s senses, to enjoy freedom of thought and speech, to reject the arbitrary use of power—these were key demands in the many public protest movements she helped mount.Anarchist par excellence, Goldman is one of the memorable political figures of our time, not because of her gift for theory or analysis or even strategy, but because some extraordinary force of life in her burned, without rest or respite, on behalf of human integrity—and she was able to make the thousands of people who, for decades on end, flocked to her lectures, feel intimately connected to the pain inherent in the abuse of that integrity. To hear Emma describe, in language as magnetic as it was illuminating, what the boot felt like on the neck, was to experience the mythic quality of organized oppression. As the women and men in her audience listened to her, the homeliness of their own small lives became invested with a sense of drama that acted as a catalyst for the wild, vagrant hope that things need not always be as they were. All you had to do, she promised, was resist. In time, she herself would become a world-famous symbol for the spirit of resistance to the power of institutional authority over the lone individual.In Emma Goldman, Vivian Gornick draws a surpassingly intimate and insightful portrait of a woman of heroic proportions whose performance on the stage of history did what Tolstoy said a work of art should do: it made people love life more.",
  "genres": [
    "Biography",
    "History",
    "Nonfiction",
    "Politics",
    "Feminism",
    "Jewish",
    "Biography Memoir"
  ],
  "author": "Vivian Gornick",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/17573038-emma-goldman"
}