{
  "title": "Essays of the 1960s & 70s: Against Interpretation / Styles of Radical Will / On Photography / Illness as Metaphor / Uncollected Essays",
  "description": "Susan Sontag was an incandescent presence in American culture, whether as essayist, fiction writer, filmmaker, or political activist. As a critic, she became the most provocative and influential voice of her time. More than a commentator on her era, she helped shape it. This volume brings together four essential works of the 1960s and 70s, books whose intelligence and brilliant style confirm her credo that “the highest duty of a writer is to write well—to leave the language in better rather than worse shape after one’s passage…Language is the body, and also the soul, of consciousness.”With the publication of her first collection of critical essays, Against Interpretation (1966), Sontag took her place at the forefront of a period of cultural and political transformation. “What is important now,” she wrote, “is to recover our senses…In place of a hermeneutics we need an erotics of art.” Against Interpretation’s treatment of an astonishing range of subjects—camp sensibility, the films of Robert Bresson and Alain Resnais, the aesthetics of science-fiction and “happenings,” the work of such modern thinkers as Simone Weil and Antonin Artaud, Michel Leiris and Claude Lévi-Strauss—reveals Sontag as a catalyzing figure who opened provocative perspectives on every subject she addressed.In Styles of Radical Will (1969), Sontag collected two of her longest and most ambitious essays, “The Aesthetics of Silence” and “The Pornographic Imagination,” along with penetrating studies of Ingmar Bergman, Jean-Luc Godard, and the Romanian philosopher E. M. Cioran (one of many important modern writers Sontag introduced to American readers), and “Trip to Hanoi,” the record of a journey made at the height of the Vietnam War, reflecting both her deepening political involvement and the relentless analysis of her own motives that accompanied it.On Photography (1977) began as a review of an exhibit of Diane Arbus photographs and quickly evolved into an extended meditation on the premises and implications of photography as an art. Dazzlingly suggestive on every page, restlessly refusing to fall back on easy resolutions, it shows Sontag at the peak of her ability to connect disparate fields of thought and action, bringing aesthetics, history, politics, and philosophy into a common vision.Sontag’s own medical crisis led her to write Illness as Metaphor (1978), undoubtedly the most influential of her writings. Her precise delineation of the stereotypes and fantasies attached to illnesses—here, tuberculosis and cancer—played a major part in realizing her stated goal: “an elucidation of those metaphors, and a liberation from them.” The courage and clarity of her writing, her impatience with lazy assumptions and inherited biases, are evident on every page.This volume also includes six previously uncollected essays—studies of William S. Burroughs and the painter Francis Bacon, and a series of reflections on beauty, aging, and the emerging feminist movement—along with a chronology of Sontag’s life and explanatory notes.",
  "genres": [
    "Essays",
    "Nonfiction",
    "Philosophy",
    "Art",
    "Feminism",
    "Literature",
    "Classics"
  ],
  "author": "Susan Sontag",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/17572918-essays-of-the-1960s-70s"
}