{
  "title": "Leon Trotsky: A Revolutionary's Life",
  "description": "From the prizewinning Jewish Lives series, a clear-eyed exploration of the career of Leon Trotsky, the tragic hero who “dreamed of justice and then wreaked havoc,” by a leading expert on human rights and the former Soviet UnionBorn Lev Davidovich Bronstein in southern Ukraine, Trotsky was both a world-class intellectual and a man capable of the most narrow-minded ideological dogmatism. He was an effective military strategist and an adept diplomat, who staked the fate of the Bolshevik revolution on the meager foundation of a Europe-wide Communist upheaval. He was a master politician who played his cards badly in the momentous struggle for power against Stalin in the 1920s. And he was an assimilated, indifferent Jew who was among the first to foresee that Hitler’s triumph would mean disaster for his fellow European Jews, and that Stalin would attempt to forge an alliance with Hitler if Soviet overtures to the Western democracies failed.Here, Trotsky emerges as a brilliant and brilliantly flawed man. Rubenstein offers us a Trotsky who is mentally acute and impatient with others, one of the finest students of contemporary politics who refused to engage in the nitty-gritty of party organization in the 1920s, when Stalin was maneuvering, inexorably, toward Trotsky’s own political oblivion.As Joshua Rubenstein writes in his preface, “Leon Trotsky haunts our historical memory. A preeminent revolutionary figure and a masterful writer, Trotsky led an upheaval that helped to define the contours of twentieth-century politics.” In this lucid and judicious evocation of Trotsky’s life, Joshua Rubenstein gives us an interpretation for the twenty-first century.",
  "genres": [
    "Biography",
    "History",
    "Nonfiction",
    "Russia",
    "Politics",
    "Judaica",
    "Judaism"
  ],
  "author": "Joshua Rubenstein",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/17573046-leon-trotsky"
}