{
  "title": "The Great Railway Revolution",
  "description": "Since its birth in the mid-1800s, the railroad has been essential to the economic, political and cultural development of the United States. Since 1840, the United States has lead the world in railway mileage. The American railroads were bigger in every sense than those in Europe: they covered longer distances, used larger locomotives and hauled longer trains. The trains facilitated everything on a larger scale, from wealth and prosperity to bloody conflict. During the Civil War, the industrial efficiency of the railroad made possible an industrial level of carnage: 400 battles were fought - one every four days - and 600,000 died. Its length and geographical spread owed much to the railroads.After the war, there was no brake on the growth of the railroads. The completion of the Transcontinental line in 1869 turned America into a united, industrial powerhouse and from 1865 to 1900, the total extent of the US railroads increased from 35,000 miles to 200,000 miles of track. To be connected to a railroad became the aspiration of every town--great or small--in America. By the turn of the century, almost every American lived within access of a railroad station.But in the 1950s, the US railroad’s golden age came to an end. The automobile and the airplane became the dominant mode of long-distance travel, and wrote historical importance of the railroads out of the nation’s consciousness. In one hundred and eighty years, the American railroad went from being feted to forgotten. Despite this, America’s railroad network remains the world’s largest, and is still a vital artery for the transportation of domestic freight. The railroad built America. From the bloody battlefields of the civil war, to the frontiers of the American West, to small-town America where families would wait on platforms for their loved ones to return home from war, the railroad occupies an emblematic space in American folklore.The birth and growth of the US railroad network reflects the ascent of modern America—economically, politically and culturally—and the strengths and complexities of the American psyche. In this book, Christian Wolmar tells the extraordinary one-hundred-and-eighty-year story of the US railroad.",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Transport",
    "Trains",
    "Railways",
    "Historical"
  ],
  "author": "Christian Wolmar",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/17575089-the-great-railway-revolution"
}