{
  "title": "Lasting City: The Anatomy of Nostalgia",
  "description": "A Kirkus Reviews Best Book of 2013A profoundly American work with distinct echoes of Samuel Beckett, Lasting City hypnotizes with its symphonic lyricism. Enjoined by his dying mother to \"tell everything,\" James McCourt was liberated by this deathbed wish to do just that. The result is Lasting City , a gripping, uniquely McCourt an operatic recollection that braids a nostalgic portrait of old-Irish New York with a boy’s funny, gutter-snipe precocity and hardly innocent coming-of-age in the 1940s and '50s. A literary outlaw in the poetic tradition of Verlaine and Baudelaire, McCourt tells his own story, his mother's, his family's, and that of a lost New York, the lasting city. While ostensibly an account of the author's first seven years, Lasting City expands into a philosophical exploration of memory, perhaps as daring a statement on perception as anything since Faulkner―a kaleidoscopic unraveling of time. Mating fact with fantasy, or fantasy with fact, McCourt takes us from his deeply moving bedside account of his mother Catherine’s death to its traumatic aftermaths both real and imagined, which are―as McCourt tells it―equally real. He revisits the fantasy city of his youth, sometimes in soliloquy, as well as in the plaintive threnody of an older man who recounts his tales of woe to a Hindu cabdriver named Pramit Banarjee on Broadway, only hours after leaving his mother’s bedside. By celebrating our powerlessness over memory, he explores the darkly intense Irish-American family romance and the love-hate relationship between an unusually bright boy and his eternally wise mother, who harbored an excruciating guilty secret. With Joycean panache, McCourt then takes us to the wake, where his aunts recall their sister as if they are the Fates; he has a late-night dialogue with a former showgirl turned hash-slinging waitress; and he then anticipates his own death with the some of the most lyrical cadences in recent literature, wondering whether his ashes will be scattered on the waters of that little rivulet emerging from Central Park's Ramble, where in his grandfather’s day, real Venetian gondoliers, imported from Venice, plied their trade. Reflecting McCourt's belief that \"the perfectly diagrammed sentence has become the secret weapon of nice people,\" Lasting City , written as much for the ear as the reading eye, unfolds in multiple voices that are at times like theater and at times the reverie of a mind lost in memory. It is a heartfelt aria to a lost time and to an eternal city.",
  "genres": [],
  "author": "James McCourt",
  "average_rating": "3.15",
  "url": "https://www.goodreads.com/book/show/17575114-lasting-city"
}