{
  "title": "Finding the Next Steve Jobs: How to Find, Hire, Keep and Nurture Creative Talent",
  "description": "In Silicon Valley legend Nolan Bushnell's first book, he explains how to find and hire employees who have the potential to be the next Steve Jobs. Nolan Bushnell founded the groundbreaking gaming company Atari in 1972, and two years later employed Steve Jobs, as well as many other creatives over the course of his five decades in business. Here Bushnell explains how to find, hire, and nurture the people who could turn your company into the next Atari or the next Apple. Bushnell's advice is constantly counter-intuitive, surprising, and atypical. When looking for employees, ignore credentials. Hire the obnoxious (in limited numbers). Demand a list of favorite books. Ask unanswerable questions. Comb through tweets. Just because you've hired creatives doesn't mean you'll keep them. Once you have them, isolate them. Celebrate their failures. Encourage ADHD. Ply them with toys. Encourage them to make decisions by throwing dice. Invent haphazard holidays. Let them sleep. The business world is changing faster than ever, and every day your company faces new complications and difficulties. The only way to resolve these issues is to have a staff of wildly creative people who live as much in the future as the present, who thrive on being different, and whose ideas will guarantee that your company will prosper when other companies fail. About the AuthorsNolan Bushnell is the founder of video game company Atari, Chuck E. Cheese-the first restaurant to integrate gaming into its entertainment model-as well as twenty-five other companies. Bushnell has been inducted into the Video Game Hall of Fame and the Consumer Electronics Association Hall of Fame, received the BAFTA Fellowship, and was named one of Newsweek's \"50 Men Who Changed America.\" He's a frequent subject of media coverage and was prominently featured in Walter Isaacson's best selling book, Steve Jobs. Gene Stone, a former book, magazine, and newspaper editor for such companies as the Los Angeles Times, Esquire, Harcourt Brace, and Simon & Schuster, has ghostwritten thirty books (many of which were New York Times bestsellers) for a wide range of people in many different fields. Stone has also written numerous titles under his own name, including The Secrets of People Who Never Get Sick, which has been translated into more than twenty languages; the New York Times bestseller Forks Over Knives; and The Watch, the definitive book on the wristwatch. Editorial\"The man who helped give a generation the game of Pong now gives a new generation a series of pongs for their careers. Nolan Bushnell's book is a spirited and insightful road map for anyone trying to navigate the new world of work.\"-- Daniel H. Pink, author of To Sell Is Human and Drive \"Nolan is a genius, and a generous one, too. Like most geniuses who share their secrets, his secrets are simple, and available to anyone with the guts to listen.\"-- Seth Godin, Author, The Icarus Deception",
  "genres": [
    "Business",
    "Nonfiction",
    "Leadership",
    "Entrepreneurship",
    "Biography"
  ],
  "author": "Nolan Bushnell",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/17575428-finding-the-next-steve-jobs"
}