{
  "title": "Psychiatry, Psychoanalysis, and the New Biology of Mind",
  "description": "Brought together for the first time in a single volume, these eight important and fascinating essays by Nobel Prize-winning psychiatrist Eric Kandel provide a breakthrough perspective on how biology has influenced modern psychiatric thought. Complete with commentaries by experts in the field, Psychiatry, Psychoanalysis, and the New Biology of Mind reflects the author's evolving view of how biology has revolutionized psychiatry and psychology and how potentially could alter modern psychoanalytic thought.The author's unique perspective on both psychoanalysis and biological research has led to breakthroughs in our thinking about neurobiology, psychiatry, and psychoanalysis -- all driven by the central idea that a fuller understanding of the biological processes of learning and memory can illuminate our understanding of behavior and its disorders. These wonderful essays cover - the mechanisms of psychotherapy and medications, showing that both work at the same level of neural circuits and synapses, and the implications of neurobiological research for psychotherapy;- the ability to detect functional changes in the brain after psychotherapy, which enables us, for the first time, to objectively evaluate the effects of psychotherapy on individual patients;- the need for animal models of mental disorders; for example, learned fear, to show how molecules and cellular mechanisms for learning and memory can be combined in various ways to produce a range of adaptive and maladaptive behaviors;- the unification of behavioral psychology, cognitive psychology, neuroscience, and molecular biology into the new science of the mind, charted in two seminal reports on neurobiology and molecular biology given in 1983 and 2000;- the critical role of synapses and synaptic strength in both short- and long-term learning;- the biological and social implications of the mapping of the human genome for medicine in general and for psychiatry and mental health in particular;The author concludes by calling for a revolution in psychiatry, one that can use the power of biology and cognitive psychology to treat the many mentally ill persons who do not benefit from drug therapy.Fascinating reading for psychiatrists, psychoanalysts, social workers, residents in psychiatry, and trainees in psychoanalysis, Psychiatry, Psychoanalysis, and the New Biology of Mind records with elegant precision the monumental changes taking place in psychiatric thinking. It is an invaluable reference work and a treasured resource for thinking about the future.",
  "genres": [
    "Psychology",
    "Psychiatry",
    "Science",
    "Neuroscience",
    "Nonfiction",
    "Psychoanalysis",
    "Mental Health"
  ],
  "author": "Eric R. Kandel",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/175802.Psychiatry_Psychoanalysis_and_the_New_Biology_of_Mind"
}