{
  "title": "Heaven Lake",
  "description": "Winner of the 2004 Barnes and Noble Discover Award. Heaven Lake is about many things: China, God, passion, friendship, travel, even the reckless smuggling of hashish. But above all, this extraordinary debut is about the mysteries of love. Vincent Saunders has graduated from college, left his small hometown in Illinois, and arrived in Taiwan as a Christian volunteer. After opening a ministry house, he meets a wealthy Taiwanese businessman, Mr. Gwa, who tells Vincent that on his far travels to western China he has discovered a beautiful young woman living near the famous landmark Heaven Lake. Elegant, regal, clever, she works as a lowly clerk in the local railway station. Gwa wishes to marry her, but is thwarted by the political conflict between China and Taiwan. In exchange for a sum of money, will Vincent travel to China on Gwa's behalf, take part in a counterfeit marriage, and bring her back to Taiwan for Gwa to marry legitimately? Vincent, largely innocent about the ways of the world, and believing that marriage is a sacrament, says no. Gwa is furious.\tSoon though, everything Vincent understands about himself and his vocation in Taiwan changes. Supplementing his income from his sparsely attended Bible study classes, he teaches English to a group of enthusiastic schoolgirls—and it is his tender, complicated friendship with a student that forces him to abandon the ministry house and sends Vincent on a path toward spiritual reckoning. It also causes him to reconsider Gwa’s extraordinary proposition.What follows is not just an exhilarating –sometimes harrowing-- journey to a remote city in China, but an exploration of love, passion, loneliness, and the nature of faith. John Dalton’s exquisite narrative arcs across China as gracefully as it plumbs the human heart, announcing a major new talent.",
  "genres": [
    "Fiction",
    "China",
    "Adventure",
    "Asia",
    "Literary Fiction",
    "Contemporary",
    "Travel"
  ],
  "author": "John  Dalton",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/175826.Heaven_Lake"
}