{
  "title": "The Living Great Lakes: Searching for the Heart of the Inland Seas",
  "description": "Award-winning nature author Jerry Dennis reveals the splendor and beauty of North America’s Great Lakes in this “masterwork”* history and memoir of the essential environmental and economical region shared by the United States and Canada.No bodies of water compare to the Great Lakes. Superior is the largest lake on earth, and together all five contain a fifth of the world’s supply of standing fresh water. Their ten thousand miles of shoreline border eight states and a Canadian province and are longer than the entire Atlantic and Pacific coasts of the United States. Their surface area of 95,000 square miles is greater than New York, New Jersey, Connecticut, Massachusetts, Vermont, New Hampshire, and Rhode Island combined. People who have never visited them―who have never seen a squall roar across Superior or the horizon stretch unbroken across Michigan or Huron―have no idea how big they are. They are so vast that they dominate much of the geography, climate, and history of North America, affecting the lives of tens of millions of people.The Living Great Searching for the Heart of the Inland Seas is the definitive book about the history, nature, and science of these remarkable lakes at the heart of North America. From the geological forces that formed them and the industrial atrocities that nearly destroyed them, to the greatest environmental success stories of our time, Superior, Michigan, Huron, Erie, and Ontario are portrayed in all their complexity.A Michigan native, Jerry Dennis also shares his memories of a lifetime on or near the lakes, including a six-week voyage as a crewmember on a tallmasted schooner. On his travels, he collected more stories of the lakes through the eyes of biologists, fishermen, sailors, and others he befriended while hiking the area’s beaches and islands.Through storms and fog, on remote shores and city waterfronts, Dennis explores the five Great Lakes in all seasons and moods and discovers that they and their connecting waters―including the Erie Canal, the Hudson River, and the East Coast from New York to Maine―offer a surprising and bountiful view of America. The result is a meditation on nature and our place in the world, a discussion and cautionary tale about the future of water resources, and a celebration of a place that is both fragile and robust, diverse, rich in history and wildlife, often misunderstood, and worthy of our attention.“This is history at its best and adventure richly described.”―*Doug Stanton, author of In Harm’s The Sinking of the U.S.S. Indianapolis and the Extraordinary Story of Its Survivors and 12 The Declassified True Story of the Horse SoldiersSigurd Olson Nature Writing Award WinnerWinner of Best Book of 2003 by the Outdoor Writers Association of America",
  "genres": [
    "Nonfiction",
    "Nature",
    "History",
    "Travel",
    "Science",
    "Environment",
    "Memoir"
  ],
  "author": "Jerry Dennis",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/175829.The_Living_Great_Lakes"
}