{
  "title": "Rock My Soul: Black People and Self-Esteem",
  "description": "From the late feminist icon and New York Times bestselling author of All About Love, an in-depth look at one of the most critical issues facing African a collective wounded self-esteem that has prevailed from slavery to the present day.“Each offering from bell hooks is a major event, as she has so much to give us.” —Maya AngelouWhy do so many African-Americans—whether privileged or poor, urban or suburban, young or old—live in a state of chronic anxiety, fear, and shame? Rock My Black People and Self-Esteem breaks through collective denial and dares to tell this truth—that crippling low self-esteem has reached epidemic proportions in our lives and in our diverse communities. With visionary insight, hooks exposes the underlying reality that it has been difficult—if not impossible—for our nation to create a culture that promotes and sustains healthy self-esteem. Without self-esteem people begin to lose their sense of agency. They feel powerless. They feel they can only be victims. The need for self-esteem never goes away. But it is never too late for any of us to acquire the healthy self-esteem that is needed for a fulfilling life.hooks gets to the heart and soul of the African-American identity crisis, offering critical insight and hard-won wisdom about what it takes to heal the scars of the past, promote and maintain self-esteem, and lay down the roots for a grounded community with a prosperous future. She examines the way historical movements for racial uplift fail to sustain our quest for self-esteem.Moving beyond a discussion of race, she identifies diverse barriers keeping us from the trauma of abandonment, constant shaming, and the loss of personal integrity. In highlighting the role of desegregation, education, the absence of progressive parenting, spiritual crisis, or fundamental breakdowns in communication between black women and men, bell hooks identifies mental health as the new revolutionary frontier—and provides guidance for healing within the black community.",
  "genres": [
    "Nonfiction",
    "Race",
    "Social Justice",
    "Sociology",
    "Self Help",
    "African American",
    "Feminism"
  ],
  "author": "bell hooks",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/17587.Rock_My_Soul"
}