{
  "title": "Thought & Love in Bipolar Oneness: Discover Your True Self & the Secret Laws",
  "description": "Balancing spirit and matter, thought and love in harmony with the pulse of cosmic life and divine law requires a new awakened state of mind and heart, in the Now.The fact that you are holding this book in your hands, right now, may be the first balancing act in your quest for spiritual enlightenment, success and fulfillment. It will help you uncover the truth, wisdom and secret knowledge of who you really are, and what your true purpose in life is. Excerpt from Chapter 1:........After all, we are here only for the purpose of self-improvement. Many will think that it means working hard and steadfastly for one’s own spiritual bettering and salvation. It is true that we must always maintain an ideal of perfection. However, you should not let such noble motive be exclusively for your own evolution but, more importantly, you should at the same time consider that it must also be beneficial for all humanity. Focus all your efforts so that all future progress you achieve is un-selfish to the extent it benefits the whole world. This is the new way of thinking in accord with the New Age philosophy. Up until now, all spiritual teachings have to some extent, led people along the path of individual salvation, where all spiritual achievements – knowledge, powers, and revelations – were for themselves. And so they remained isolated, hidden away in some cave or monastery so as not to be disturbed by the hustle and bustle of the outside world. Well, such a philosophy is to be discarded. The new one teaches that we must improve ourselves, but without ever cutting off from others. On the contrary, we should accept inconveniences, make sacrifices, suffer even, but be useful. True self-improvement means being of use to the collectivity.......",
  "genres": [],
  "author": "Dr. Yves S Eveillard M.D",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/17590886-thought-love-in-bipolar-oneness"
}