{
  "title": "Every Hill and Mountain",
  "description": "Every Hill and Mountainbook 3An old house + A new computer program = The travel opportunity of a lifetime…to another century.The PeopleSince Beautiful Houses worked so well for the Old Dears’ family tree project, Abby’s college roommate Kate hopes the computer program will help her find out more about her ancestor Ned Greenfield. Abby and John reluctantly agree to help Kate, but only on the condition that she and her fiancé Ryan promise to keep the program a secret, because if the government ever discovered they possessed a computer program that allows you to rewind and fast forward the lives of people it would surely want to get its hands on it.The two couples take a trip to the tiny town of Equality, set in the hills of southern Illinois and the breath-taking Shawnee National Forest. According to Kate’s research, Ned Greenfield was born there at a place called Hickory Hill.The mayor, police chief, and townspeople are hospitable and helpful—until the topic of Hickory Hill comes up. Then they are determined to keep them away. Eventually they find Hickory Hill on their own—both the mansion and the lonely hill it sits upon.The HouseBuilt in 1834, Hickory Hill stands sentinel over Half Moon Salt Mine where the original owner John Granger accumulated his blood-tainted fortune with the use of slave labor. In the free state of Illinois—the Land of Lincoln.Abby and her friends meet Miss Granger, Hickory Hill’s current eccentric owner, and they eventually get the chance to run Beautiful Houses there. Their shocking discovery on the third floor concerning Kate’s ancestor Ned Greenfield is almost too much to bear. What they learn sends them racing to the opposite end of the state to find the missing link in Kate’s family tree. And there they are reminded that God is in the business of redemption—that one day he’ll make all things new.",
  "genres": [
    "Historical Fiction",
    "Christian Fiction",
    "Fantasy",
    "Time Travel",
    "Fiction",
    "Christian",
    "Mystery"
  ],
  "author": "Deborah Heal",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/17591017-every-hill-and-mountain"
}