{
  "title": "Legitimate Leadership",
  "description": "Legitimate Leadership, written by Wendy Lambourne, essentially looks at what every employer strives for but often gives up attaining the willingness of employees at work. Lambourne is a partner at Schuitema Human Excellence Group, which works extensively among South African blue-chip companies and throughout the world. It has major clients in the UK, USA and Asia. The conclusion of the book is somewhat employees’ willingness at work is not a direct “deliverable” of, for instance, improving work conditions or remuneration. Rather it is a byproduct of the personal relationship which those in command positions at work have with those who report to them. Specifically, willingness at work arises only when those in charge strive for the very best in their people, care for them sincerely and help them to grow, with no payback agenda in mind. The seminal research supporting the above contention comes from the South African gold mining industry in the 1980s. The initial insights from this research have been validated, by the work done by Wendy Lambourne and her colleagues, in diverse contexts all over the world in the past 20 years. These insights have, moreover, gained special validity in post-Marikana South Africa. This is because, while remuneration and physical conditions on mines have improved in recent decades, the personal relationship between managers and those who report to them at all levels have remained poor or deteriorated. But Legitimate Leadership is not a theoretical discourse on management-employee relations. It is rather a practical guide on implementing legitimate leadership using the Care and Growth criteria drawing on examples from an impressive range of organizational contexts. No similar principle–based but usable advice to leaders currently exists. The book is aimed at business owners and managers who are concerned with successfully leading others and transforming both others and themselves in the process.",
  "genres": [],
  "author": "Wendy Lambourne",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/17590970-legitimate-leadership"
}