{
  "title": "Hip Hop Family Tree, Vol. 1: 1970s-1981",
  "description": "The lore of the early days of hip hop has become the stuff of myth, so what better way to document this fascinating, epic true story than in another great American mythological medium -- the comic book? From exciting young talent and self-proclaimed hip hop nerd Ed Piskor, acclaimed for his hacker graphic novel Wizzywig, comes this explosively entertaining, encyclopedic history of the formative years of the music genre that changed global culture. Originally serialized on the hugely popular website Boing Boing, The Hip Hop Family Tree is now collected in a single volume cleverly presented and packaged in a style mimicking the Marvel comics of the same era. Piskor's exuberant yet controlled cartooning takes you from the parks and rec rooms of the South Bronx to the night clubs, recording studios, and radio stations where the scene started to boom, capturing the flavor of late-1970s New York City in panels bursting with obsessively authentic detail. With a painstaking, vigorous and engaging Ken Burns meets- Stan Lee approach, the battles and rivalries, the technical innovations, the triumphs and failures are all thoroughly researched and lovingly depicted. plus the charismatic players behind the scenes like Russell Simmons, Sylvia Robinson and then-punker Rick Rubin. Piskor also traces graffiti master Fab 5 Freddy's rise in the art world, and Debbie Harry, Keith Haring, The Clash, and other luminaries make cameos as the music and culture begin to penetrate downtown Manhattan and the mainstream at large. Like the acclaimed hip hop documentaries Style Wars and Scratch, The Hip Hop Family Tree is an exciting and essential cultural chronicle and a must for hip hop fans, pop-culture addicts, and anyone who wants to know how it went down back in the day.",
  "genres": [
    "Comics",
    "Graphic Novels",
    "Music",
    "Nonfiction",
    "History",
    "Hip Hop",
    "Graphic Novels Comics"
  ],
  "author": "Ed Piskor",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/17591945-hip-hop-family-tree-vol-1"
}