{
  "title": "Sleepwalker",
  "description": "It’s not that Micayla Lange is afraid of the clinking she hears coming from the first floor of the empty McMansion she’s housesitting for her uncle Nicco. She’s a cop, after all. It’s just that finding out her boyfriend was cheating on her was enough drama for one night. Now she’s alone on New Year’s Eve, wearing flannel pajamas and wielding a Glock 22 as she zeroes in on the unmistakable source of the sound: Uncle Nicco’s private office.Jason Davis steals things for a living, so unexpected developments are a natural part of the job. Getting caught red-handed by a hot, pigtail-sporting police officer in what is supposed to be a gangster’s deserted house is just one more twist in the game. Kind of like finding incriminating photos in Nicco Marino’s safe, only to discover the cop—and the security cameras—have gotten a real good look at his face.Unfortunately for Mick, she also got a good look at the damned pictures. Her “uncle” might love her like family, but if he knows she’s seen evidence that implicates him in the murder of a city councilman, she doesn’t like her chances. Which is why she’s having a hard time reconciling her professional instincts with what she is rapidly concluding is an inescapable fact: She’s about to help a criminal get away with a suitcase full of stolen money. And she’s going with him.Mick and Jason’s race for their lives hurtles them through the dangerous Michigan wilderness on speedboat and snowmobile. As their adventure heats up and their enemies close in, Mick is torn between her duty to the force and the combustible passion engulfing her and her unlikely partner in crime. She’ll have to turn Jason in sooner or later…if they survive. But will they ever get a second chance at love?",
  "genres": [
    "Romantic Suspense",
    "Romance",
    "Suspense",
    "Mystery",
    "Fiction",
    "Thriller",
    "Contemporary"
  ],
  "author": "Karen Robards",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/10807108-sleepwalker"
}