{
  "title": "Fugitive Colors",
  "description": "Stolen art, love, lust, deception, and revenge paint the pages of veteran journalist Lisa Barr’s debut novel, Fugitive Colors, an un-put-down-able page-turner. Booklist calls the WWII era novel, \"Masterfully conceived and crafted, Barr’s dazzling debut novel has it all: passion and jealousy, intrigue and danger.\" Fugitive Colors asks the reader: How far would you go for your passion? Would you kill for it? Steal for it? Or go to any length to protect it?Hitler’s War begins with the ruthless destruction of the avant-garde, but there is one young painter who refuses to let this happen. An accidental spy, Julian Klein, an idealistic American artist, leaves his religious upbringing for the artistic freedom of Paris in the early 1930s. Once he arrives in the “City of Light,” he meets a young German artist, Felix von Bredow, whose larger-than-life personality overshadows his inferior artistic ability, and the handsome and gifted artist Rene Levi, whose colossal talent will later serve to destroy him. The trio quickly becomes best friends, inseparable, until two women get in the way—the immensely talented artist Adrienne, Rene’s girlfriend with whom Julian secretly falls in love, and the stunning artist’s model Charlotte, a prostitute-cum-muse, who manages to bring great men to their knees.Artistic and romantic jealousies abound, as the characters play out their passions against the backdrop of the Nazis' rise to power. Felix returns to Berlin, where his father, a blue-blooded Nazi, is instrumental in creating the master plan to destroy Germany’s modern artists, and seeks his son’s help. Bolstered by vengeance, Felix will lure his friends to Germany, an ill-fated move, which will forever change their lives. Twists and turns, destruction and obsession, loss and hope will keep you up at night, as you journey from Chicago to Paris, Berlin to New York. With passionate strokes of captivating prose, Barr proves that while paintings have a canvas, passion has a face—that once exposed, the haunting images will linger . . . long after you have closed the book.The Hollywood Film Festival awarded Fugitive Colors first prize for “Best Unpublished Manuscript” (Opus Magnum Discovery Award). The novel has been optioned for movie development by Hollywood producer Arthur Sarkissian (Rush Hour trilogy, While You Were Sleeping).",
  "genres": [
    "Historical Fiction",
    "Art",
    "Fiction",
    "World War II",
    "Historical",
    "Holocaust",
    "Jewish"
  ],
  "author": "Lisa Barr",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/17592146-fugitive-colors"
}