{
  "title": "Call Me Smitty- The Beginning",
  "description": "From the mind of B.R. Stateham, author of Death of Young Lieutenant, comes Call Me Smitty. This is a three part digital short story series that is dark, violent, emotional and heart wrenching. As our story starts Smitty gets a severe dose of reality, decides to take matters into his own hands and becomes a different person. He says goodbye to one life, and begins another. The name is B.R. Stateham. Yes, I have a face only a mother could love. And I have been accused of having a distinct familial resemblence to a certain man-made Frankenstein critter from Olden Days. Be that as it may, I am a sixty year old kid who has been married happily to the same wife for almost a quarter-century (bless her tormented soul!). We have three grown kids, five grand kids, two dogs, and a Dodge pickup truck I call 'Baby.'I like to consider myself a writer. A writer of speculative fiction. My reading tastes run toward Fantasies, Histories, Mysteries, and Science-Fiction. But really, it doesn't matter.  I'll read just about anything. Writing, however, revolves around the four genres mentioned. I don't know about you, but to me, today's writing seems so blasé. Like tasting vanilla pudding without much vanilla. Clones of clones. Gone, it seems, are the writing styles found in writers like Raymond Chandler or Dashiell Hammett. The two literately created the modern-day hard-boiled detective/cop. Every writer since who has played in this genre has copied, in one way or another, their styles. They brought a life to their words, animating their characters with a living, breathing presence. Today's writers of this genre go for fast paced action, unbelievable plots, and damn little description.So my goal is to blend the modern with the old; bring more 'color' back into the art of writing--to stimulate the imagination, yet leave free enough room for each reader to paint that verbal portrait all their own.Join me in this endeavor. Let us be stalwart heroes and walk the dark alleys and back streets of murder and mayhem together. Or soar into galaxies unknown in search of adventures unparalleled.",
  "genres": [
    "Short Stories"
  ],
  "author": "B.R. Stateham",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/10807291-call-me-smitty--the-beginning"
}