{
  "title": "Inshallah",
  "description": "Nel 1990 Oriana Fallaci torna al grande romanzo con Insciallah, un’opera corale che prende spunto dalla missione occidentale di pace a Beirut dopo i sanguinosi eventi del 1982. Una “piccola Iliade” che la stessa Fallaci racconta dando voce a uno dei protagonisti, il Professore, un militare appassionato di letteratura: “Posso anticiparti che la storia si svolge nell’arco di tre mesi, novanta giorni che vanno da una domenica di fine ottobre a una domenica di fine gennaio, che s’apre coi cani di Beirut, allegoria ai bordi della cronaca, che prende l’avvio dalla duplice strage, che segue il filo conduttore d’una equazione matematica, cioè dell’S=K ln W di Boltzmann, e che per svilupparne la trama mi servo dell’amletico scudiero di Ulisse. Quello che cerca la formula della Vita.“…Uno spicchio del campionario umano che il libro offrirà:ilcalabresepoveroebrutto, ilsardotaciturno e orgoglioso, il siciliano invadente e vivace, il veneziano ricco e deluso, il toscano becero e arguto, il romagnolo ingenuo e impaurito, il torinese educato e ottimista… Ci ho messo anche la splendida e misteriosa libanese che chiamo Ninette, anzi le ho attribuito un ruolo decisivo, e i simboli della triste città. Ci ho messo i bambini che la guerra uccide, i lenoni che la guerra favorisce, i banditi che la guerra protegge, molte donne tra cui un surrogato di donna detto lady Godiva, nonché cinque monache che mi seducono e che intendo coinvolgere nella tragedia. Fra protagonisti e comparse una sessantina di personaggi. Ma di giorno in giorno il cast si arricchisce, il palcoscenico si affolla, e presto ne arriveranno di nuovi…”. Insciallah, come Dio vuole, è “un atto d’amore per la Vita” che rifiuta la ferocia di qualsiasi guerra e mette l’Uomo al centro del proprio destino.Un opus formidabile, che intravede le battaglie del futuro mentre analizza e descrive lo spirito degli italiani, con una saggezza, un’ironia e un distacco che saprei trovare solo ne La tregua di Levi, ne Il partigiano Johnny di Fenoglio e in Tomasi di Lampedusa.— Dalla Prefazione di Gianni Riotta",
  "genres": [
    "Fiction",
    "Roman",
    "Italian Literature",
    "Historical Fiction",
    "Lebanon",
    "Italy",
    "Novels"
  ],
  "author": "Oriana Fallaci",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/176009.Inshallah"
}