{
  "title": "Ella in Europe: An American Dog's International Adventures",
  "description": "Part travelogue, part valentine to a beloved pet, Ella in Europe chronicles writer Michael Konik’s magical six-week journey through Europe with his dog, Ella. An homage to the friend who has “licked away my tears when I’m sad, hopped on her hind legs when I’m happy, and snuggled me when I’m lonely,” here is the story of a bond unlike any other–and an extraordinary dog who stole her way into one man’s heart. Los Angeles writer Michael Konik had always shared his life with dogs. But Ella, a gentle Lab mix, was something special. From the moment Konik laid eyes on Ella, he knew: This dog was meant to be his. An enchantress who charmed all who met her, Ella Guinevere Konik had a truly unique gift–and soon Konik found a way for Ella to share that gift, signing her up for a program that brings dogs into hospitals, nursing homes, and children’s shelters. When Ella turned ten, Konik wanted to thank the “best friend” whose unconditional love had transformed his life–and given comfort and joy to others in need. So a trip to Europe was planned–and for Konik and Ella a once-in-a-lifetime adventure began, one that would strengthen the already-powerful bond between them. As they explore Europe’s most beautiful–and surprisingly dog-friendly–cities, Konik is amazed at the experiences he and Ella can share . . . Arriving in Vienna on July Fourth with Ella wrapped in her American flag scarf . . . Dining at four-star restaurants in Paris . . . Ella swimming in the Danube . . . Taking a gondola ride in Venice . . . Sunbathing in St. Tropez . . . Searching for a canine toilet in Monte Carlo. But soon this journey of friendship, love, and discovery must come to a close. And as Konik heads home, accompanied by the canine friend who “helped teach me what love means,” one thing is certain: Both dog and owner have been changed forever. At once a testament to the power of unconditional love and a celebration of devotion, Ella in Europe is a book for anyone who has ever felt a special connection to a dog they’ve loved.",
  "genres": [
    "Travel",
    "Dogs",
    "Nonfiction",
    "Memoir",
    "Animals"
  ],
  "author": "Michael Konik",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/1760363.Ella_in_Europe"
}