{
  "title": "The Complete Jessica Darling Series: Sloppy Firsts, Second Helpings, Charmed Thirds, Fourth Comings, Perfect Fifths",
  "description": "Growing Up Can Be Perfect in Its Imperfection  The Jessica Darling series chronicles one young woman’s coming-of-age in the first decade of the 21st century. Over five books and ten years, Jessica Darling fumbles her way into adulthood. She evolves from a sixteen-year-old cynic, snarking in her diary about catty cliques, unrequited crushes, and other high school indignities, into a jet-setting twenty-six-year-old urbanite searching for more meaning in her life. Through all her misadventures in high school, college, and beyond, Jessica gets long-distance support from her best friend, Hope. But it's her on-again/off-again love of her life, Marcus Flutie, who can always be counted on to complicate her life in ways that are infuriating, intoxicating, and ultimately irresistible. SLOPPY  Meet Jessica Darling—and fall for Marcus Flutie—in this high school comedy of many, many errors.  A fresh, funny, utterly compelling fiction debut, Sloppy Firsts is an insightful true-to-life look at sixteen-year-old Jessica's predicament as she embarks on another year of teenage torment—from the dark days after her best friend, Hope, moves away through her months as a type-A personality turned insomniac to her completely mixed up feelings about Marcus Flutie, the intelligent and mysterious \"Dreg\" who works his way into her heart. SECOND  Can Jessica survive senior year without losing her mind . . . or her heart?This time, Jess is going through the social and emotional ordeal of her last year at Pineville High.  Not only does the mysterious Marcus Flutie continue to distract her, but Hope still lives in another state, and she can't seem to escape the clutches of the Clueless Crew, her annoying so-called friends.  To top it off, Jessica's parents won't get off her butt about choosing a college. Will Jess crack under the pressure of senioritis? CHARMED  Jessica is in college . . . and smart girls have more fun!Jessica has finally left her hometown/hellhole for Columbia University; she's into Marcus more than ever (so what if he's at a Buddhist college in California), and she's making new friends. But Jess soon realizes that her bliss might not last. As she and Marcus hit the rocks, will she fall for her GOPunk, neoconservative RA . . . or for the hot grad student she's assisting on a summer project . . . or for the oh-so-sensitive emo boy down the hall? Will she even make it now that her parents have cut her off financially? And what do the cryptic one-word postcards from Marcus really mean? FOURTH   Is the real world ready for Jessica Darling?At first it seems like she's living the New York City dream. She's subletting an apartment with her best friend, working for a magazine that actually cares about her psychology degree, and is still deeply in love with Marcus. But when Marcus proposes—giving her only one week to answer—Jessica must decide if she's ready to give up a world of late-night literary soirees, art openings, and downtown drunken karaoke to move back to New Jersey and be with the one man who's gripped her heart for years. PERFECT Does Jessica and Marcus's journey end here? Or is it just the beginning? . . . Now a young professional in her mid-twenties, Jess is off to a Caribbean wedding.  As she rushes to her gate at the airport, she literally runs into her former boyfriend, Marcus Flutie. It's the first time she's seen him since she reluctantly turned down his marriage proposal three years earlier—and emotions run high.",
  "genres": [
    "Young Adult",
    "Fiction",
    "New Adult",
    "Chick Lit",
    "Teen",
    "Romance",
    "Contemporary"
  ],
  "author": "Megan McCafferty",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/10094959-the-complete-jessica-darling-series"
}