{
  "title": "Mảnh đất lắm người nhiều ma",
  "description": "Mảnh đất lắm người nhiều ma của Nguyễn Khắc Trường đặt ra và gây được ấn tượng ở các vấn đề chìm và nổi, ở bề mặt và bề sâu trong sự đan xen giữa nền nếp ý thức và sinh hoạt tinh thần ở nông thôn nói chung, trong những người nông dân nói riêng; các vấn đề gia tộc và dòng họ; hôn nhân và gia đình; các quan hệ làng xã và lề thói nông xã...Không chỉ là chất thơ mà còn là bi kịch, và là những bi kịch gọi nhau. Không chỉ những con người nhân danh đủ dạng trong thế bài trừ tiêu diệt lẫn nhau mà còn là đủ những người dị dạng bị đẩy ra hoặc hút vào những giao tranh quyết liệt đó.Tóm lại đó là nông thôn trong một tổng chân dung những con người vừa là tội nhân vừa là nạn nhân, mà lịch sử đang giao cho họ một trách nhiệm có lẽ là quá lớn, quá tầm của họ; nhưng lại không thể chuyển cho ai khác, vì nói như Ăng-ghen, vẫn phải rđặt lên vai những con người do lịch sử để lại...Tuy vậy, truyện không làm cho người đọc bi quan. Có thể do giọng điệu hài hước của tác phẩm. Có thể do kết thúc sáng sủa của câu chuyện tình, sự thức tỉnh của chiến thắng của cá nhân và hạnh phúc cá nhân trước uy quyền dòng họ. Nhưng chủ yếu có lẽ là ở chỗ tác phẩm cho người ta nghe thấy tiếng dội của một thời đại mới đang vang động từ trong hậu trường: nhân dân đang thực hiện quyền dân chủ của mình. Âm khí còn nặng nề nhưng dương khí đã bắt đầu phát triển. Thế giới ma quỷ đã rơi vào khủng hoảng dữ dội để tự huỷ diệt do những xung đột của chính bản thân nó.Cuốn sách không chỉ dừng lại ở việc miêu tả mối quan hệ dòng họ, nhưng những trang tâm đắc nhất hình như không ngoài việc miêu tả ấy. Một văn phong mang dáng dấp của Tắt đèn, từ cách lựa chọn thời gian để biểu đạt (thời kỳ giáp hạt ở nông thôn luôn mang ý nghĩa điển hình), đến số phận của bà Son, cô Đào, lão Quềnh... Nhưng nét hiện đại đã chen vào trong câu văn của Mảnh đất lắm người nhiều ma. Từ sử dụng độc đáo và đích đáng các khẩu ngữ, thành ngữ, đến việc ẩn giấu, lẩn quẩn một giọng điệu bi hài để soi xét và nghiền ngẫm tận tâm can con người.Trang viết của Nguyễn Khắc Trường, vì vậy quánh đặc hệt như một thứ nước cốt mà ai đó, những nhà văn ít tài năng có thể pha loãng ra làm văn của mình...",
  "genres": [],
  "author": "Nguyễn Khắc Trường",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/17605168-m-nh-t-l-m-ng-i-nhi-u-ma"
}