{
  "title": "Manage Your Day-to-Day: Build Your Routine, Find Your Focus, and Sharpen Your Creative Mind",
  "description": "Stop doing busywork. Start doing your best work.Are you over-extended, over-distracted, and overwhelmed? Do you work at a breakneck pace all day, only to find that you haven't accomplished the most important things on your agenda when you leave the office?The world has changed and the way we work has to change, too. With wisdom from 20 leading creative minds, Manage Your Day-to-Day will give you a toolkit for tackling the new challenges of a 24/7, always-on workplace.We seem to have a strange but all too human cultural fixation on the daily routines and daily rituals of famous creators, from Vonnegut to Burroughs to Darwin — as if a glimpse of their day-to-day would somehow magically infuse ours with equal potency, or replicating it would allow us to replicate their genius in turn. And though much of this is mere cultural voyeurism, there is something to be said for the value of a well-engineered daily routine to anchor the creative process. Manage Your Day-to-Day: Build Your Routine, Find Your Focus, and Sharpen Your Creative Mind (public library), edited by Behance’s 99U editor-in-chief Jocelyn Glei and featuring contributions from a twenty of today’s most celebrated thinkers and doers, delves into the secrets of this holy grail of creativity.Featuring contributions from: Dan Ariely, Leo Babauta, Scott Belsky, Lori Deschene, Aaron Dignan, Erin Rooney Doland, Seth Godin,Todd Henry, Christian Jarrett, Scott McDowell, Mark McGuinness, Cal Newport, Steven Pressfield, Gretchen Rubin, Stefan Sagmeister, Elizabeth G. Saunders, Tony Schwartz, Tiffany Shlain, Linda Stone, and James Victore. Plus, a foreword from Behance founder & CEO Scott Belsky.",
  "genres": [
    "Nonfiction",
    "Business",
    "Self Help",
    "Productivity",
    "Personal Development",
    "Design",
    "Psychology"
  ],
  "author": "Jocelyn K. Glei",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/17606014-manage-your-day-to-day"
}