{
  "title": "المحافظون والإصلاحيون : في الحالة الإسلامية السعودية",
  "description": "مع تدني حالة التدوين والرصد للمشهد الفكري المحلي، تُصبح أي مُحاولة لتوثيق أجزاء من هذا المشهد بخطاباته وأفكاره وقضاياه وسجالاته، فِعلاً مُهماً ومفيداً للمستقبل... وإذا كان الأمر يخص تحديداً (الحالة الإسلامية السعودية) فحينها يُصبح الأمر أكثر أهمية... لأن هذه الحالة هي، من جهة، الأكثر حراكاً وتأثيراً وإنتشاراً في السعودية.وفي المُقابل هي الأقل إشتغالاً بالرصد والتوثيق، والأكثر غموضاً لدى المُتابع العربي، وربما السعودي أيضاً... حتى إن بعض المُتخصصين العرب في الحركات الإسلامية لا يُدركون أبسط التمايُزات والفروقات الفكرية والمنهجية في الوسط الإسلامي السعودي، ولا طبيعة التحولات التي بدأ يشهدها.ولهذا السبب... حرص المؤلف على نشر هذا الكتاب على أن تبقى فصوله كما هي لحظة تدوينها، دون تدخُّل لإعادة صياغة بعض الفقرات كي تكون أكثر مواءمة لإصدارها بين دفتي الكتاب.ويحوي هذا الكتاب على ثلاثة فصول... الأول يتضمن سلسلة مقالات طويلة قام بنشرها في موقع الإسلام اليوم في شهر أكتوبر 2010م (ذو القعدة 1431هـ) قدم شيئاً من الرصد والتحليل لبعض مواطن التباين في الأفكار والرؤى والمناهج بين المُحافظين والإصلاحيين في الحالة الإسلامية السعوديّة.أما الفصل الثاني فيتضمن مجموعة مقالات طويلة، أو دراسات قصيرة نشرها في موقع الإسلام اليوم بين شهري مايو ويوليو 2010م (جمادي الآخرة وشعبان 1431هـ)، وتتحدث عن بعض المفاهيم والأفكار والتجارب التي تُمثل برأيه بعض ملامح الحالة الإصلاحية... كالحديث عن (الحضارة) بإعتبارها قيمة مركزية في التصور الشرعي... وعن الديمقراطية كآلية للنظام السياسي، ونقاشٍ لثُنائية (حكم الشريعة وحكم الشعب)... ثم حديثٌ عن حزب العدالة والتنمية التركي كنموذج ناجح في التجربة الحركيّة الإسلاميّة يُمكن أن نستلهم منه كيف ينجح (العقل السياسي) عند بعض الإسلاميين في التعامل مع الأزمات والضغوطات... وأخيراً حديثٌ فيه مِسْحَة شخصية عن شيء من تجربة النشأة في محاضن الصحوة ومساحات التباين والإختلاف المُبكّر معها.أما الفصل الثالث والأخير فيحوي حواراً طويلاً أجري معه في مجلة رؤية الإلكترونية ومجلة العصر الإلكترونية في شهر اكتوبر 2009م (ذو القعدة 1430هـ)... وتناول بالنقاش والتحليل كثيراً من تفاصيل الشأن الإسلامي السعودي وقضاياه وسجالاته، إضافة إلى موضوعات فكرية أخرى، وبعض الشؤون الشخصيّة.سيكون القارئ العربي، وربما المحليّ، لهذا الكتاب، أكثر إقتراباً وفهماً للوسط الإسلامي السعودي... وسيعيشُ شيئاً من همومه وقضاياه... وسيُفتِّش عن إجابة لبعضِ التساؤلات وتفسيرٍ لبعضِ المُفارقات... وسُيدرك شيئاً من مَوَاطن التباين والإختلاف، ومساحات الإحتكاك والسجال داخل الحالة الإسلامية السعودية، التي كانت وما زالت غابة بحثيّة غامضة، لا يعرف كثير من الباحثين حتى معالمها الكبرى وخطوطها العريضة.",
  "genres": [
    "Politics",
    "Nonfiction"
  ],
  "author": "نواف القديمي",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/10807689"
}