{
  "title": "Thy KINGDOM Come: The Promise of the King",
  "description": "BACK COVER DESCRIPTION:“The place whereon thou standest is holy ground.”The same war waged against God from its first celestial battleground continues through time to follow a peculiar group to the land of Canaan, perhaps the bloodiest soil known to man.The trembling and stalwart hearts of God’s men upon the mountains of Ararat, Moriah, and Sinai long for the realization of the Garden Promise, as the adversary does all to prevent its fulfillment.Flawed individuals will be asked to do the unthinkable. Supernatural events will shatter the laws of nature. As God’s people embark upon a journey through a barren wasteland, oaths that warp the natural flow of history will both serve to protect and destroy them. Welcome to the story of the kingdom of Heaven.\"EXCERPTS: Lucifer took a bite of the fruit and looked squarely and intently at the angel. “I suppose . . .” Lucifer’s voice trailed off for a moment. “I suppose I look like God?”- One sprung, like a lion from the tall grass, towards the archangel. Michael slapped it down with the blade of his shovel and placed his foot on the back of the demon, effectively pinning it to the ground. While he pulled his sword from its scabbard he muttered something about the tediousness of having to deal with this and be a grave robber at the same time. - They both sat down and the stranger pulled back his hood. “I am Melchizedek, a prophet, priest and king of the most high God.”“You look familiar,” Abram said and took a bite of the bread.“We may have met before,” the king of Salem said with a smile as he reached for a piece.- The next day twelve thousand screaming Jews poured into the plains of Moab by the Jordan River. This was a whole other breed of Israelite; these young men had been raised in the desert. They had pillowed their heads on rocks at night and chased scorpions and lizards all their lives. They knew nothing of the luxuries of Egypt. They were bred warriors, perfect soldiers, having suffered persecution and endured hardness for as far back as they could remember, and they were ready for this day. - That night the angel of the LORD appeared and with a swift kick knocked the sleeping prophet off his bed and onto the floor.“Fasting and praying all night, are we Balaam?”- “This land wherein we dwell,” Bazor replied, “has no sense of neutrality. Any friend of Joshua is an enemy of everyone else.”“So it seems,” Rabanac answered, “Now we’ll see if Joshua is a friend to us. We may live among the Canaanites, but tomorrow will show very clearly that we are not of them. Take courage my son and play the man for the cities of Gibeon.”- Time slowed as blood, sweat, and dirt hung in the air. The monstrosities backhanded whoever happened to cross their path, sending them flying. The commander drowned his terror by shouting the order again: “Hold!” Sounds of the battlefield muddled and shook in their heads: the pounding of the giant’s feet, horsemen crying out in the distance, the buzzing of hornets near Gibeon. But now they heard something different; it came towards them, screaming through the sky behind them.- “One other thing, Moses,” the LORD said.“Yes, LORD?”“Don’t forget your rod.”-",
  "genres": [
    "Christian",
    "Fantasy",
    "Christian Fiction"
  ],
  "author": "Rick Schworer",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/17606752-thy-kingdom-come"
}