{
  "title": "The Valley of Amazement",
  "description": "New York Times bestselling author of The Joy Luck Club Amy Tan brings us her latest a sweeping, evocative epic of two women's intertwined fates and their search for identity—from the lavish parlors of Shanghai courtesans to the fog- shrouded mountains of a remote Chinese villageShanghai, 1912. Violet Minturn is the privileged daughter of the American madam of the city's most exclusive courtesan house. But when the Ching dynasty is overturned, Violet is separated from her mother in a cruel act of chicanery and forced to become a \"virgin courtesan.\" Half-Chinese and half-American, Violet grapples with her place in the worlds of East and West—until she is able to merge her two halves, empowering her to become a shrewd courtesan who excels in the business of seduction and illusion, though she still struggles to understand who she is.Back in 1897 San Francisco, Violet's mother, Lucia, chooses a disastrous course as a sixteen-year-old, when her infatuation with a Chinese painter compels her to leave her home for Shanghai. Shocked by her lover's adherence to Chinese traditions, she is unable to change him, despite her unending American ingenuity.Fueled by betrayals, both women refuse to submit to fate and societal expectations, persisting in their quests to recover what was taken from respect; a secure future; and, most poignantly, love from their parents, lovers, and children. To reclaim their lives, they take separate journeys—to a backwater hamlet in China, the wealthy environs of the Hudson River Valley, and, ultimately, the unknown areas of their hearts, where they discover what remains after their many failings to love and be loved.Spanning more than forty years and two continents, The Valley of Amazement transports readers from the collapse of China's last imperial dynasty to the beginning of the Republic and recaptures the lost world of old Shanghai through the inner workings of courtesan houses and the lives of the foreigners living in the International Settlement, both erased by World War II. A deeply evocative narrative of the profound connections between mothers and daughters, imbued with Tan's characteristic insight and humor, The Valley of Amazement conjures a story of inherited trauma, desire and deception, and the power and obstinacy of love.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "China",
    "Historical",
    "Book Club",
    "Asian Literature",
    "Audiobook"
  ],
  "author": "Amy Tan",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/17608417-the-valley-of-amazement"
}