{
  "title": "Just Like Heaven",
  "description": "Because love can happen anywhere . . .Even in New Jersey!A beautiful morning in early spring. What could possibly go wrong?Just returned from a buying trip in England, Kate French was jet-lagged and exhausted and running on fumes. She was already running late for an appointment but a wave of dizziness forced her to pull into the shopping mall parking lot in search of a quick fix of caffeine and protein.When the pain first hit, she ignored it and continued racing across the parking lot toward the food court. But within moments she realized something was terribly wrong as her wobbly legs gave out and she dropped to the ground. The last thing she remembered as she started to fade away was the guy in the Grateful Dead T-shirt who held her in his arms and promised he'd never let her go.Mark Kerry didn't think of himself as a hero but the story of a Good Samaritan who had saved a woman's life in the parking lot of the Princeton Promenade was attaining the status of suburban legend. Determined to return a stack of documents that had been left behind when the ambulance swept her away, he called in some favors and tracked her down at home one week later.The moment Kate saw him, the world and everyone in it disappeared. She knew his voice, the smell of his skin, the way his hands felt against her skin, the taste of his mouth, everything that mattered. All the things she would ever need to know about him.And then she took another look . . . PRAISE FOR JUST LIKE HEAVEN*TOP PICK!* Bretton's lyrical writing enthralls from the first page as she immerses readers in a tale of romance and new beginnings.--Romantic TimesBretton has few peers among contemporary romance novelists when it comes to combining escapist romance with everyday, messy reality. She’ll make you believe that love can happen anywhere – or make you grateful that you’ve been fortunate enough to find it. --Susan Scribner, The Romance ReaderThis one will keep you reading past your bedtime.--Elizabeth Darrach, BellaOnline*STARRED REVIEW* Very few romance writers create characters as well developed and realistic as Bretton's. Her books pull you in and don't let you leave until the last word is read. --Shelley Mosley, Booklist",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Fiction",
    "Chick Lit",
    "Amazon"
  ],
  "author": "Barbara Bretton",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/17608534-just-like-heaven"
}