{
  "title": "Harlot's Ghost",
  "description": "With unprecedented scope and consummate skill, Norman Mailer unfolds a rich and riveting epic of an American spy. Harry Hubbard is the son and godson of CIA legends. His journey to learn the secrets of his society—and his own past—takes him through the Bay of Pigs, the Cuban Missile Crisis, and the “momentous catastrophe” of the Kennedy assassination. All the while, Hubbard is haunted by women who were loved by both his godfather and President Kennedy. Featuring a tapestry of unforgettable characters both real and imagined, Harlot’s Ghost is a panoramic achievement in the tradition of Tolstoy, Melville, and Balzac, a triumph of Mailer’s literary prowess.  Praise for Harlot’s Ghost  “[Norman Mailer is] the right man to exalt the history of the CIA into something better than history.”—Anthony Burgess, The Washington Post Book World   “Elegantly written and filled with almost electric tension . . . When I returned from the world of Harlot’s Ghost to the present I wished to be enveloped again by Mailer’s imagination.”—Robert Wilson, USA Today  “Immense, fascinating, and in large part brilliant.”—Salman Rushdie, The Independent on Sunday   “A towering creation . . . a fiction as real and as possible as actual history.”—The New York Times\n \nPraise for Norman Mailer  “[Norman Mailer] loomed over American letters longer and larger than any other writer of his generation.”—The New York Times   “A writer of the greatest and most reckless talent.”—The New Yorker   “Mailer is indispensable, an American treasure.”—The Washington Post   “A devastatingly alive and original creative mind.”—Life   “Mailer is fierce, courageous, and reckless and nearly everything he writes has sections of headlong brilliance.”—The New York Review of Books   “The largest mind and imagination [in modern] American literature . . . Unlike just about every American writer since Henry James, Mailer has managed to grow and become richer in wisdom with each new book.”—Chicago Tribune   “Mailer is a master of his craft. His language carries you through the story like a leaf on a stream.”—The Cincinnati Post",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Espionage",
    "Literature",
    "American",
    "Novels",
    "Thriller"
  ],
  "author": "Norman Mailer",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/1080788.Harlot_s_Ghost"
}