{
  "title": "Falling For You",
  "description": "Deployed Army Staff Sergeant Justin Hauten is having a somewhat interesting day.His company commander goes crazy and shoots him. Two \"alleged\" CIA agents ambush him and his buddy, Specialist Sean \"Nebraska\" Walker, and derail a sensitive mission. And then there's the love letters he's been getting from another male in his company. Secret love letters that make Justin imagine the possibilities.Can Justin fall in love as the most insane things happen to him, from kidnappings, a fearless sidekick that tells the most outrages tall-tales, to secret camera images, to a hyper, yet dimwitted, crazy ex-girlfriend?Find out in this Episodic Love Story set in the backdrop of Afghanistan and Fort Hood, Texas...______________________________Need some fine print?* This is an updated and new-and-improved version of a previous book called DESIRE. Same story, new cover, but edited. If you have already read DESIRE, first--Thank you, and second, the story is not different.* This is a love story with steamy love scenes between two men. But it's also a love story and one that I would not classify as \"Erotica\" -- though it has one erotic scene near the end. On a scale of 1-5, 1 being \"vanilla\" and 5 being \"this is so hot, I'm dying\"; I would rate this a 3.* This series has been published in \"Episodic Form\" aka, Installments. This means Novella #1 isn't the complete story. It stops at a good spot (cliffhanger), but not at the final conclusion. I know this bothers some folks, so I feel it is best to be upfront about it. This particular novella is about 50 pages long.***Other books in the FALLING FOR HIM Series:Hungry For You, Book 2Ready For You, Book 3 (the final book)",
  "genres": [
    "Military Fiction",
    "M M Romance",
    "Romance",
    "Contemporary",
    "Mystery",
    "Gay",
    "Short Stories"
  ],
  "author": "Kelly Washington",
  "average_rating": "3.16",
  "url": "https://www.goodreads.com/book/show/17609144-falling-for-you"
}