{
  "title": "Ready For You",
  "description": "The intensity escalates for Justin, Aaron, and Nebraska in the conclusion of the Falling For Him Series. Here they will face bomb threats, an overly kind hunchback in a seedy bar, kick-ass mothers, and a steamy bedroom when Justin and Aaron finally get it on.Allegiances will be tested, rules will be broken, hearts will be won, and the truth will finally be revealed. Ready For You is the final novella in the Falling For Him Series and is intended for mature +18 audiences.** Staff Sergeant Justin “Hotten” Hauten……Isn’t the smartest guy in the room. He just wants to be a regular soldier but finds himself mixed up kidnappings, government secrets, and the desire to figure out his feelings for Aaron.** First Lieutenant Aaron “Texas” Parris……Has had feelings for Justin for quite some time and he isn’t going to hold them in anymore, even if that means getting involved in whatever mess Justin is in -- which is some pretty messed up crap!** Specialist Sean “Nebraska” Walker……Is a tall, lumberjack-ish redhead, loyal to the end, and happily enters into scuffles just for the hell of it. Being a former semi-pro boxer does have its perks.______________________________Need some fine print?* This is an updated and new-and-improved version of a previous book called INTENSE. Same story, new cover, but edited. If you have already read INTENSE, first--Thank you, and second, the story is not different.* This is a love story between two men. On a scale of 1-5, 1 being \"vanilla\" and 5 being \"this is so hot, I'm dying\"; I would rate this one a 4.* This series has been published in \"Episodic Form\" aka, Installments. This means Novella #3 isn't the complete story. You'll need to pick up novellas 1 & 2 before reading this one. I know this bothers some folks, so I feel it is best to be upfront about it.***Other books in the FALLING FOR HIM Series:Falling For You, Book 1Hungry For You, Book 2",
  "genres": [
    "M M Romance",
    "Military Fiction",
    "Romance",
    "Mystery"
  ],
  "author": "Kelly Washington",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/17609158-ready-for-you"
}