{
  "title": "An Invisible Hand",
  "description": "An Invisible Hand is a new Christian novella by Kathy Golden. The story revolves primarily around the healing miracles that begin to occur in Belinda's life. While the Scriptures in the book are taken from the King James Version of the Bible, the story is neither preachy nor judgmental. Anyone who enjoys experiencing the power of miracles will want to read this story. Thirty-two-year-old Belinda Johnson is sitting in her car when a young girl in a wheel chair captures her attention. Seconds later, energy rushes from Belinda into the teenager’s body, and the girl is instantly healed. Belinda awakes later, awed by the possibility that she had participated in a real-live-like-in-the-Bible miracle. Yet, as time passes, there are things about this miracle-working phenomenon with which she’s not content, and she struggles to understand God. By her own admission, she prefers an uncomplicated life, but her life is further complicated by a new relationship that brings its own surprising problem. While the Scriptures in this book are taken from the King James Version of the Christian Bible, this story is neither preachy nor judgmental. Anyone who enjoys experiencing the power of miracles can enjoy it. An Invisible Hand is a Christian novella with beautiful demonstrations of healings and praise and gratitude to God. It is rich with the wonderful interactions and camaraderie of family and friends, with just the right touch of romance, and with a cast of characters so real, you’ll feel certain you know people just like them. It is also a story that invites you to put yourself in Belinda’s place. How would you feel? How would you react? How would it affect you to suddenly become God’s servant of healing? This novella is scheduled for release in May 2014. Read an excerpt and subscribe to updates at www.aninvisiblehandbykathygolden.com.Thanks for reading this.",
  "genres": [],
  "author": "Kathy Golden",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/17609286-an-invisible-hand"
}