{
  "title": "Lunch with Buddha",
  "description": "Heartbreaking in places, hilarious in others, Lunch with Buddha takes its readers on a quintessentially American road trip across the Northwest. That outer journey, complete with good and bad meals, various outdoor adventures, and an amusing cast of quirky characters, mirrors a more interior journey--a quest for meaning in the hectic routine of modern life. Otto Ringling, who's just turned 50, is an editor of food books at a prestigious New York publishing house, a middle-of-the-road father with a nice home in the suburbs, children he adores, and a sense of himself as being a mainstream,middle-class American. His sister, Cecelia, is the last thing from mainstream.For two decades she's made a living reading palms and performing past-life regressions.She believes firmly in our ability to communicate with those who have passed on. In Lunch with Buddha, when Otto faces what might be the greatest of life's emotional challenges, it is Cecelia who knows how to help him.As she did years earlier-- in this book's best-selling predecessor, Breakfast with Buddha--she arranges for her brother to travel with Volya Rinpoche, a famous spiritual teacher--who now also happens to be her husband. After early chapters in which the family gathers for an important event, the novel portrays the road trip made by Otto and Rinpoche, in a rattling pickup, from Seattle, across the Idaho panhandle and the vast Montana prairie, to the family farm in North Dakota. Along the way, the brothers-in-law have a series of experiences--some hilarious, some poignant--all aimed at bringing Otto a deeper peace of mind. During visits to American landmarks, they meet a cast of minor characters, each of whom enables Rinpoche to impart some new spiritual lesson.Their conversations range from questions about life and death to talk of history, marijuana, marriage and child-rearing, sexuality, Native Americans, and outdoor swimming. In the end, with the help of their miraculous daughter, Shelsa, and the prodding of Otto's own almost-adult children, Rinpoche and Cecelia push this decent, middle-of-the-road American into a more profound understanding of the purpose of his life.His sense of the line between possible and impossible is altered, and the story's ending points him toward a very different way of being in this world.Show more Show less",
  "genres": [
    "Fiction",
    "Spirituality",
    "Philosophy",
    "Buddhism",
    "Audiobook",
    "Inspirational",
    "Book Club"
  ],
  "author": "Roland Merullo",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/17609258-lunch-with-buddha"
}