{
  "title": "Captivated",
  "description": "Erotic Romance – intended for mature audiencesCaptivated is a glimpse into the lives of Lucie Werner and Kane Steele after Temptation (Club Destiny, #2)Lucie Werner’s life has never followed the path she envisioned for herself and five years ago, it veered off course yet again. This time after one erotic night of passion with the man she’d been captivated by since the first day she met him. Only Kane doesn’t remember that night, and until recently, he didn’t know that what they shared resulted in pregnancy and the birth of a beautiful little girl. Now that he knows, Lucie fears he’ll never want anything to do with her again because she kept his daughter a secret from him for so long. The sad truth is, she doesn’t blame him.Kane Steele had never known the type of rage he was consumed by when Lucie told him he was a father – and that she had kept his daughter a secret from him for nearly five years. Although he can’t remember the events of that one fateful night, Kane can’t ignore the feelings he’s had for Lucie all this time. Now, with the secret out, and his relationship with his daughter on the mend, he finds he still can’t fight what he feels for her. Since his memories of that one night are out of reach, Kane’s ready to make some new memories.Can the two of them overcome Lucie’s deceit and give in to the maelstrom of heat that’s generated when the two of them are close together? Will Lucie be able to overcome the guilt she feels for holding onto this monumental secret for so long? And will Kane be able to forgive her?**This book contains a sneak peek at the Prologue from Zane (Alluring Indulgence, #2)Erotic RomanceMature Audiences This book contains sexual encounters and graphic language that some readers may find objectionable, including, but not limited to graphic sexual encounters, exhibitionism, and voyeurism. Consider yourself warned – some of these encounters are hot enough to melt your e-reader. Contains graphic material that is not suitable for anyone under the age of 18.",
  "genres": [
    "Erotica",
    "Romance",
    "BDSM",
    "Contemporary",
    "Menage",
    "Erotic Romance",
    "Contemporary Romance"
  ],
  "author": "Nicole Edwards",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/17609268-captivated"
}