{
  "title": "حالة حصار",
  "description": "كُتب هذا النص في يناير 2002 في رام الله\"هنا، عند منحدرات التلال، أمام الغروب وفوهة الوقت، قرب بساتين مقطوعة الظلِّ، تفعل ما يفعل العاطلون عن العمل: نربي الأمل. بلادٌ على أهبة الفجر، صرنا أقلّ ذكاءً، لأنّا نحملق في ساعة النصر: لا ليل في ليلنا المتلألئ بالمدفعية أعداؤنا يسهرون، وأعداؤنا يشعلون لنا النور في حلكة الأقبية. هنا، بعد شعار \"أيوب\" لم ننتظر أحداً.. هنا، \"لا أنا\" هنا يتذكر \"آدم\" صلصاله. سيمتد الحصار إلى أن نعلّم أعداءنا نماذج من شعرنا الجاهلي. السماء رصاصية في الضحى، برتقالية في الليالي. وأما القلوب فظلت حياديَّة مثل ورد السياج. في الحصار تكون الحياة هي بين تذكر أوّلها ونسيان آخرها.. يقول على حافّة الموت: لم يبق لي موطئ للخسارة، حرٌّ أنا قرب حريتي، وغدي في يدي.. سوف أدخل، عما قليل، حياتي وأولد حُرّاً بلا أبوين، وأختار لاسمي حروفاً من اللازَوَرْد.. هنا، عند مرتفعات الدخان، على درج البيت لا وقت للوقت، نفعل ما يفعل الصاعدون إلى الله: نفس الألم، الألم هو أن لا تعلق سيّدة البيت حبل الغسيل صباحاً، وأن تكتفي بنظافة هذا العَلَم. لا صدى هوميريّ لشيء هنا. فالأساطير تطرق أبوابنا حين نحتاجها. لا صدى هوميريّ لشيء... هنا جنرال ينقب عن دولة نائمة تحت طروادة القادمة. يقيس الجنود المسافة بين الوجود وبين العدم بمنظار دبابة.. نقيس المسافة ما بين أجسادنا والقذيفة... بالحاسة السادسة. كلما جاء الأمس، قلت له: ليس موعدنا اليوم، فلنبتعد وتعال غدا.. كلُّ موتٍ، وإن كان منتظراً هو أول موت، فكيف أرى قمراً نائماً تحت حجر.. وحيدون، نحن وحيدون حتى الثمالة، لولا زياراتُ قوس قزح. هل نسيء إلى أحدْ؟ هل نسيء إلى بلدٍ لو أصبنا، ولو من بعيد برذاذ الفرح؟ الحصار هو الانتظار.. هو الانتظار على سلّم مائل وسط العاصفة. سأصرخ في عزلتي، لا لكي أوقظ النائمين. ولكن لتوقظني صرختي من خيال السجين!. سيمتد الحصار إلى أن يحس المُحاصِرُ، مثل المحاضر، أن الضجر صفة من صفات البشر\".من أيّ أرضٍ تتفجر كلماتك محمود درويش معلنة ثورة الغضب، من أي منهل تأتي معانيك تقارب في تجلياتها قمم الألم؟!! وفي أي سماء تحلق خيالاتك ململمة صوراً تحاكي الحقيقة، فتغدو سطورك أناشيد توقظ الإنسانية من غفوتها، وتثير أشجاناً وعذابات تسير في مواكب الزمن الفلسطيني العربي مع حشود بشرية مشت في هذا الزمن السياسي اليهودي العاثر، مشت تلك الحشود في كل صقع ومن كل لون، وهدرت ثائرة صارخة في وجه التخاذل والعنف والوحشية وزاحفة نحو أمل في كرامة، في حقٍّ، في عدالة، في أرض، في يوم مشرق صنعه ولد بيده حجر.",
  "genres": [
    "Poetry",
    "Literature",
    "Nonfiction",
    "Politics"
  ],
  "author": "Mahmoud Darwish",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/1760997._"
}