{
  "title": "Eternal",
  "description": "A complicated love triangle that covers both heaven and earth.\"MICAH sat alone in the darkened emptiness of space. He felt racked with guilt. What was he doing? This wasn't right and he knew it. He had gone too far in his quest to keep a promise. Everything had gotten out of control somehow. Emma had become too important to him. And it was more than that; he longed to be around her, to talk with her, to touch her again and again. These feelings were strange to him. He’d never experienced anything like this. It was almost as if someone were inside his head, whispering to him, making him want things he could never have. A heavenly being wasn't supposed to feel this way. But he did, and it was breaking him. He knew what he needed to do to fix it, but he wasn't ready to let go. He didn't want to leave. He wanted to stay right where he was. He deserved happiness too. Maybe there was a way. Maybe he could have her for himself. Would that really be so wrong? The answer to that question screamed back at him from inside his head. Yes, yes it would be.\"\"From the very first moment, EMMA had wanted him to want her, but never really thought it was possible. Now he was saying little cryptic things that made her think maybe there was a chance for them.But now Emma felt feelings that she had never expected to feel for a sweet blue eyed boy, that she was going to have to turn her back on. Could she really do that? She wasn’t sure she could.\"\"DESTRY was at war with himself. He couldn't figure out what it was about the girl Emma that had him feeling upside down and inside out. Every time he saw her, he got that burning feeling that nearly choked him. He wanted to be near her. She was like oxygen to him, she made everything feel better. She eased the burning in his chest and calmed the fluttering of his mind. But did she feel the same when she was around him? He seemed to make her uncomfortable and sometimes angry. He didn't want to chase after someone that didn't want to be chased. He hoped that after tonight, the burning would leave him alone and he could move on with life. A life that didn't involve seeing Emma's face every time he closed his eyes.\"",
  "genres": [
    "Paranormal",
    "Angels",
    "Paranormal Romance",
    "Fantasy",
    "Young Adult",
    "Romance",
    "Fiction"
  ],
  "author": "Chantelle Nay",
  "average_rating": "3.40",
  "url": "https://www.goodreads.com/book/show/17610697-eternal"
}