{
  "title": "London Lace: Complete Series",
  "description": "London Lace, featuring hat designer, Eliza Keating and the sexy Sir Todd Montgomery, is now available as a digital boxed set.*EROTIC AND ROMANTIC*Sir Todd Montgomery appears to be a proper English gentleman, but appearances can be deceiving. He has a passion for raising racehorses and his desires come first in his life. He has little time or patience for women, especially those as independent as hat designer Eliza Keating. And Eliza is totally committed to her career. Yet neither can deny the sparks that fly between them, and as they pursue a lust-driven affair, an unexpected love begins to ignite. But when scandal, social pressure, and wounds from the past threaten to douse the flames of passion, both Todd and Eliza must decide if it’s worth betting everything on love.LONDON LACE #1London hat designer Eliza Keating is sent on a date by her friend Lady Victoria Manning. Sir Todd Montgomery appears to be a proper English gentleman, but appearances can be deceiving. He has a passion for raising racehorses, and his desires come first in his life. He has little time or patience for women, especially those as independent as Eliza. The date goes awry, and it will take a lot more than an apology to get back on Eliza’s good side.LONDON LACE #2Sir Todd Montgomery invites Eliza to the races. Her heart races as he seduces her in the hay-filled stables. Things are going perfectly, and then the nosy photographers and gossip magazine reporters spot the new couple and begin making trouble.LONDON LACE #3Eliza accepts an invitation to visit Sir Todd Montgomery at his estate in Devonshire. It is sprawling and beautiful, yet houses even more of Todd's secrets. When he avoidsanswering her questions about his past, Eliza is pushed to her breaking point.Their chemistry is still sizzling, but each sexual encounter leaves them both grasping for something more. Do they have the strength to become vulnerable to each other? Sir Todd has awoken something inside Eliza, and she's fearful of losing control.LONDON LACE #4Touched by Todd's honesty, Eliza stays on at Evergreen Downs to comfort him after the loss of his mare. Their relationship deepens when Todd takes Eliza on a morning ride along a beautiful private beach. Eliza's feelings for Todd are getting stronger now, and by the way he's behaving, he's feeling something more as well. Eliza finds herself on the dangerous edge of letting go and giving him her heart.LONDON LACE #5The Royal Ascot is only the most exclusive event of London’s society calendar. Eliza is contracted to design hats for the royals. During the most terrifying challenge of her career, she also faces challenges of the heart. Forced to sneak around with Sir Todd for their secret affair makes stolen moments in his strong arms all the sweeter for their danger. But as the ravenous press closes in and scandal threatens to destroy their connection, everything Todd and Eliza have built begins to crumble. The pair must decide if they're willing to bet everything on love.* * Contains erotic sex scenes with two hot characters (M/F); 18+ Adult eyes only* *Complete set is 84,000 words or 336 book pages.",
  "genres": [
    "Romance",
    "Erotica",
    "Contemporary Romance",
    "Contemporary"
  ],
  "author": "Catou Martine",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/17611548-london-lace"
}