{
  "title": "Persia: The Final Jihad",
  "description": "Persia. The very word evokes images of kings and princes and tales of Arabian nights, of Scheherazade, the teller of 1001stories of cunning and derring-do.However, Persia was not solely acclaimed for the tales of 1001 Arabian Nights, but for algebra, Backgammon, a postal service, military conscription, and advances in human rights.The kingdoms of Persia and Babylonia inhabited the region that played host to the world's earliest civilizations. They are thought by most archaeological scholars to contain the site named in the Old Testament book of Genesis as the Garden of Eden.Ur of the Chaldeans, the home of Abraham, was also a part of the region that was once Babylonia-later controlled by the Persians.The Persian population would eventually learn that it had exchanged one tyrannical ruler for another. Under Islamic rule the people would be forced to forsake the Persian language in favor of Arabic, which would become the sanctioned language of the Muslim world.In 1935, Reza Shah Pahlavi the Great, asked the world to stop referring to his nation as Persia and instead call it Iran, \"land of the Aryans.\" Today, Iran can best be described as a rogue nation with a tyrannical leader at its helm; one who is pursuing nuclear weapons with reckless abandon as part of his mission to annihilate the Jewish people and bring the United States to her knees. Its people will, unfortunately, be forced to reap the whirlwind sewn by Mr. Ahmadinejad and his ruthless followers.Persia - The Final Jihad by Mike Evans, outlines the history of Persia long before Daniel or Esther. It sets the historical stage for modern-day Iran, and peels the layers from deceptions and lies of Iranian leaders.Iran is pursuing nuclear weapons with reckless abandon as part of its mission to annihilate the Jewish people and bring the United States to its knees. President Mahmoud Ahmadinejad's unequivocally terroristic threats may be taken by world leaders as boasting and bullying; that could be a costly mistake.The brightest minds globally are charged with finding a solution especially now that Iran is but the turn of a screwdriver away from an atomic bomb. The holy grail of understanding is that this is truly a battle between two books, two kingdoms, and two peoples. The good news is that a biblical solution is not only available, but accessible.",
  "genres": [],
  "author": "Mike    Evans",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/17612513-persia"
}