{
  "title": "The Mystery of Princess Louise: Queen Victoria's Rebellious Daughter",
  "description": "The secrets of Queen Victoria's sixth child, Princess Louise, may be destined to remain hidden forever. What was so dangerous about this artistic, tempestuous royal that her life has been documented more by rumour and gossip than hard facts? When Lucinda Hawksley started to investigate, often thwarted by inexplicable secrecy, she discovered a fascinating woman, modern before her time, whose story has been shielded for years from public view.Louise was a sculptor and painter, friend to the Pre-Raphaelites and a keen member of the Aesthetic movement. The most feisty of the Victorian princesses, she kicked against her mother's controlling nature and remained fiercely loyal to her brothers - especially the sickly Leopold and the much-maligned Bertie. She sought out other unconventional women, including Josephine Butler and George Eliot, and campaigned for education and health reform and for the rights of women. She battled with her indomitable mother for permission to practice the 'masculine' art of sculpture and go to art college - and in doing so became the first British princess to attend a public school.The rumours of Louise's colourful love life persist even today, with hints of love affairs dating as far back as her teenage years, and notable scandals included entanglements with her sculpting tutor Joseph Edgar Boehm and possibly even her sister Princess Beatrice's handsome husband, Liko. True to rebellious form, she refused all royal suitors and became the first member of the royal family to marry a commoner since the sixteenth century.Spirited and lively, The Mystery of Princess Louise is richly packed with arguments, intrigues, scandals and secrets, and is a vivid portrait of a princess desperate to escape her inheritance.",
  "genres": [
    "Biography",
    "History",
    "Nonfiction",
    "British Literature",
    "Historical",
    "Victorian",
    "19th Century"
  ],
  "author": "Lucinda Hawksley",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/17612540-the-mystery-of-princess-louise"
}