{
  "title": "Hitler's Furies: German Women in the Nazi Killing Fields",
  "description": "History has it that the role of women in Nazi Germany was to be the perfect Hausfrau, produce the next Aryan generation and be a loyal cheerleader for the Führer. Then they became the Trümmerfrauen, or Rubble Women, as they cleared and tidied their ruined country to get it back on its feet. They were Germany's heroines. The few women tried and convicted after the war were simply the evil aberrations - the camp guards, the female Nazi elite - that proved this rule.However, Wendy Lower's research into the very ordinary women who went out to the Nazi Eastern Front reveals an altogether different story. For ambitious young women, the emerging Nazi empire represented a kind of Wild East of career and matrimonial opportunity. Over half a million of them set off for these new lands, where most of the worst crimes of the Reich would occur.Through the interwoven biographies of thirteen women, the reader follows the transformation of young nurses, teachers, secretaries and wives who start out in Weimar and Nazi Germany as ambitious idealists and end up as witnesses, accomplices and perpetrators of the genocide in Ukraine, Poland and Belarus. Hitler's Furies presents overwhelming evidence that the women in these territories actively participated in the mass murder - and some became killers. In the case of women like Erna Petri, who brought her family to her husband's impressive Polish SS estate, we find brutality as chilling as any in history.Hitler's Furies is indelible proof that we have not known what we need to know about the role of women in the Nazi killing fields - or about how it could have been hidden for seventy years. It shows that genocide is women's business as well as men's and that, in ignoring women's culpability, we have ignored the reality of the Holocaust.",
  "genres": [
    "History",
    "Nonfiction",
    "Holocaust",
    "World War II",
    "War",
    "Germany",
    "Historical"
  ],
  "author": "Wendy Lower",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/17612712-hitler-s-furies"
}