{
  "title": "Indiana Wild",
  "description": "Indiana Wild is as wild as the Montana ranch she was raised on. The youngest of four children, she was a delightful surprise for her older parents. She spends her time training horses and cow dogs and loving the freedom of the wide open spaces. When her grandfather dies, she finds her much older brothers have different plans for the ranch she calls home and for Indiana.Indiana’s oldest brother is determined to tame Indiana and bring her to live with him in Los Angeles where he can keep an eye on her and the money she is inheriting. He believes with a little taming, he can control the wild spirit of his little sister and find her a good husband who can manage her.Furious with the court order giving her older brother guardianship over her, Indiana turns to the only place she feels at home… the wide-open spaces of Montana. She is determined to avoid her controlling brothers and their greed, even if it means hiding from them until they give up. An unexpected trip through Spirit Pass takes Indiana further than she ever expected… by almost a hundred and fifty years.Jonathan Tucker is as tough as they come. He and his twin brother have cut a successful horse and cattle ranch in the harsh Montana territory. When cattle rustlers try to steal his cattle and shoot one of his men, he is grateful to the young boy named Indy who comes to the rescue, even if the boy does have an attitude. The last thing he expects is to find the ‘boy’ is in fact an independent, freethinking, stubborn female who is not afraid to voice her opinions. She is as wild as the untamed land around them and he is determined she is the wife for him.When Indiana is taken from him, Jonathan finds he will do whatever it takes to bring his Indiana Wild home for good, even if it means following her to the future.",
  "genres": [
    "Time Travel",
    "Romance",
    "Westerns",
    "Historical",
    "Historical Romance",
    "Paranormal Romance",
    "Paranormal"
  ],
  "author": "S.E. Smith",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/17614091-indiana-wild"
}