{
  "title": "It Felt Like a Kiss",
  "description": "'We were superglued to the pages of this book, and you'll be hooked too' heatThe heart-warming, hilarious and utterly addictive romance from Sarra Manning, author of London, With Love. --------------------------------Ellie Cohen is living her dream. A great job at an exclusive Mayfair art gallery, loyal mates, loving family, and really, really good hair. Well, there's the famous rock-star father who refuses to acknowledge her and a succession of 'challenging' boyfriends, but nobody's perfect. But when a vengeful ex sells Ellie out to the press, she suddenly finds herself fighting to keep her job, her reputation and her sanity. Then David Gold - handsome, charming but ruthlessly ambitious - is sent in to manage the media crisis . . . and Ellie.David thinks she's a gold-digger and Ellie thinks he's a shark in a Savile Row suit, so it's just as well that falling in love is the last thing on their minds . . .'Sarra Manning pulls you straight in with another fantastically addictive, beautifully written read' Paige Toon, author of Someone I Used to Know'Bright, funny, romantic - a total joy to read!' Mhairi McFarlane, author of Last Night'A deliciously addictive tale of romance and reinvention' \nMarie Claire\n--------------------------------\nReaders love It Felt Like a Kiss:\n***** 'The book was VERY enjoyable, funny and had a brilliant plot that hooked you... But be warned: once you start reading you won't be able to put it down!'***** 'Another amazing Sarra Manning book... Could not put the book down until I'd consumed every word on every page'***** 'Beautiful and worth a read. You will not regret it!!!!'***** 'Loved this book from start to end'***** 'Surprising and intriguing throughout the whole thing. A real page turner'",
  "genres": [
    "Romance",
    "Chick Lit",
    "Contemporary",
    "Contemporary Romance",
    "Adult",
    "Fiction",
    "New Adult"
  ],
  "author": "Sarra Manning",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/17615086-it-felt-like-a-kiss"
}