{
  "title": "Bound",
  "description": "A single woman with a sexual longing and two homecoming marines.The 4th of July and a long due homecoming sees Brad Cooper and his Marine buddy Kenny Curtis return. Millie Newton has always loved Brad, but was crushed when he enlisted. Now he’s back and she has no intention of letting him go without showing her true feelings. The block party provides the opportunity as this surprise threesome find themselves providing the fireworks in this hot BDSM story.A hot nurse, a handsome fireman.Halloween is here and it’s a stressful weekend for Fireman Tom Newton. With the promise of a Halloween Play Party things seem to be picking up. Lucy, an overworked nurse is ready for some time off. She steps into a mess when her best friend, Millie gets them invites to Robert’s Halloween Play Party. Tom and Lucy both have desires on each other but neither are aware. Can Robert and Millie bring this destined couple together and will it run smoothly. Will true love blossom, will the Master get his slave?”A lost memory and a harbored secret; can bondage find true love.Wounded and depressed, lying in a hospital, Kenny Curtis has given up on ever finding happiness. Sacrificing a threesome lifestyle with his best friend Brad and Millie so they can be together, Kenny is now alone at Christmas. Lindsey has needs of her own, a sub, a slave, she wants what Kenny has to offer. However an incident in their past threatens to spoil everything. Can the spirit of Christmas pull them together long enough for them to see that they belong as one? Or will Lindsey desert and ruin her best chance?**Note: This title contains adult content and should not be read by readers under the age of 18. The titles in his bundle have been previously released as Bondage on the 4th of July, Halloween Submission, and A Slave for Christmas. The entire series has been reedited for rerelease. You can still purchase these titles individually.**",
  "genres": [
    "BDSM"
  ],
  "author": "Bonnie Bliss",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/17615855-bound"
}