{
  "title": "blue light",
  "description": "With the novelette \"Blue Light,\" the classic work of erotic author Aaron Travis at last arrives in ebook editions.When Bill Gray moves into a big Victorian house in Houston, he finds himself fascinated by his muscular, long-haired landlord, Michael. Something mysterious is going on in Michael's room on the top floor. Bill, a sexual dominant, looks forward to stripping Michael of all his secrets. But when the two of them finally connect, it's Michael who takes charge, subjecting Bill to an experience unlike anything he could have imagined. Susie Bright: \"Perhaps the most fantastic supernatural erotic thriller ever written!\"Marcy Sheiner, San Francisco Bay Guardian: “ ‘Blue Light’ is a story I will remember for the rest of my life: it glues the impossible and the plausible together through the invocation of intense sexual energy.”Michael Bronski, The Guide (Boston): “In ‘Blue Light’— a story which has become a classic—Travis creates a contemporary supernatural masterpiece as frightening as anything H.P. Lovecraft or Stephen King ever wrote. The underlying horror of the story is not what happens to the narrator...but our own fears of losing control of our sexuality.”Curious Affairs of Athelton Bartelby: “A paranormal, nearly epic erotic tale of submission, domination, and sexual witchcraft. I was breathless nearly the entire way through it, as the story built, as the psychologies of its main characters became more clearly defined and pulled me into them, and, of course, as the epic evening of sex unfolded in a Texas attic between two muscular doms, as one forces the other to submit to him with a variety of...arguably quite disturbing tricks. It was, and is, precisely what I think good erotica is, i.e., a story that not only makes its readers turned on...but, through its evocative use of language and seductive creation of fantasy, of pushing that fantasy to its very limits, that's what good erotica is.”",
  "genres": [
    "M M Romance",
    "BDSM",
    "LGBT"
  ],
  "author": "Aaron Travis",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/17616585-blue-light"
}