{
  "title": "Hell House: Volume One",
  "description": "The three first Hell House stories in one volume!Holiday Hell House:There’s no place like Hell House for the holidays…At least that’s what Danielle Stewart hopes for as the director of Hellsner Halfway House for Troubled Paranormal Teens. But all her plans come to an abrupt halt with the help of bickering teens, unannounced zombies, and a portal to hell, among other things. When the arguing leads to things quite literally going up in smoke, will Danielle find that her true calling lies elsewhere, or will the help of an unexpected angel show her the family she has longed for is right before her eyes?Fairy Fury:Sora Starwind just wants to have a normal life. Well, as normal as a banished teenage fairy living in a halfway house for paranormals canhave. Squashing her magic mishaps is just part of the equation. Catching the eye of a certain hottie named Liam Crawford would be a plus, if she could only figure out how to not act like a complete dork around him. Then a surprise visit from her estranged mother brings an ultimatum that threatens to turn Sora’s world upside down. Unexpectedly faced with her past, Sora has to find the inner strength to deal with her banishment, but there’s more to her story than even she knows…Vampires Don't Dance:Teenage fairy, Sora Starwind, is finally making her way in the mortal world. The guy of her dreams, Liam Crawford, has asked her to his school’s Spring dance, and she finally feels, well, normal. Trouble is, Liam has a secret of his own that brings with it a whole new set of complications. Not only does Sora have to worry about Liam’s friends liking her, she also has to guard his secret, and deal with the school harlot that wants Liam for her own. Add a pair of obsessed paranormals that intend to unleash more chaos than just ruining her evening and Sora finds her newfound control stretched to the brink. Can she find more answers than questions this time, so that this first dance won’t also be her last?",
  "genres": [],
  "author": "Christle Gray",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/17617668-hell-house"
}