{
  "title": "Bound in Death",
  "description": "Cynthia Eden continues her USA Today best-selling \"Bound\" series with...BOUND IN DEATH.She can’t remember him…He can never forget her.For over two hundred years, alpha werewolf Alerac O’Neill has been searching for his mate, Keira McDonough, a woman who was taken from him and imprisoned by a dark vampire master. He’s hunted for her, endlessly, using vampire blood to extend his life. He has become a vicious predator, feared by all the supernaturals. His hold on reality seems to slip more each day because he is consumed by her.Only…the woman he discovers in a small Miami bar isn’t the Keira that he remembers. In fact, this woman doesn’t remember anything. She calls herself Jane Smith, and she has no memory at all of Alerac—or of her own past.Now that she’s been found, Alerac knows that his enemies are going to start closing in on her. Jane may try to act human, but she’s not. She’s a pureblood vampire princess, incredibly powerful and incredibly valuable. His enemies want to use her, her enemies want to destroy her, and Alerac—he just wants her.If he can’t make her remember him, then Alerac has to seduce Jane into loving him once again. Because now that he’s found her, he’ll fight hell—and every sadistic vampire that stalks the night—in order to keep her safe at his side.Some bonds go deeper than the flesh. Some go beyond life. Beyond death.Jane will soon learn that a werewolf’s claiming…is forever.Author's BOUND IN DEATH is a dark and sensual paranormal romance. It contains a hot alpha wolf, a vampire heroine with no memory, and some dangerous killers. Adult language and sexy situations are included. Total word count for BOUND IN DEATH is 60,000.",
  "genres": [
    "Paranormal",
    "Paranormal Romance",
    "Vampires",
    "Romance",
    "Shapeshifters",
    "Werewolves",
    "Witches"
  ],
  "author": "Cynthia Eden",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/17619159-bound-in-death"
}