{
  "title": "Stealing Night",
  "description": "Peter Giglio returns to the fictional town of Sunfall, Nebraska, this time with a rural crime thriller.Jack has nothing to live for, nothing worth dying for, no one to love, nothing to lose; but that all changes when his sister’s life unravels and he takes guardianship of Nora, his eleven-year-old niece. Looking out for her fast becomes the only thing he has ever done right. Driven to move his family from the bleak flatlands, to give his niece a chance at a better life, Jack takes the only job he can find, washing cars for minimum wage, saving every penny.When an old friend steps back into Jack’s life, a joyride leads to an explosive night of terror and betrayal.Now Jack must stand firm for those he loves as he struggles between the promising new life in bloom and the dark secret of a dead girl from California.Stealing Night is a riveting exploration of our best and worst angels, the familial ties that bend but never break, the decisions we make, and the high cost of hesitation in the face of evil.“With razor-sharp characterization and hard-as-nails prose, Peter Giglio’s Stealing Night is a literary punch in the gut—brutal, stunning, and not to be missed.” —Tim Waggoner, author of Like Death and The Harmony Society“An agonizingly deep look into loss and rebuilding, bad decisions and their immutable consequences, Peter Giglio’s Stealing Night is an indispensable piece of painfully human crime fiction. It will tear your heart out and you’ll thank him for it.”–Ed Kurtz, author of A Wind of Knives and Dead Trash“This is the kind of story relevant to today's America; its pulse beats strong, the blood inside derived from its heirs, but unmistakably young, fresh, and vital. Giglio leads a new pack of modern noir voices, and this is not a story I'll forget.” —John Palisano, author of Nerves and Bipolar Express“Stealing Night masterfully weaves themes of humanity and sacrifice into a story of love, life, and redemption. Peter Giglio’s compelling thriller will keep you captivated until the very end!”—Rena Mason, author of The Evolutionist“Mr. Giglio’s ear for dialogue might very well have been scalped cleanly off Elmore Leonard’s head. Someone should check. Yes, the players here are that good! Stealing Night is smart, effectively rural in its sensibilities, and most certainly a winner!”—Jon Michael Kelley, author of Seraphim“Layered, haunting and elegantly written, Peter Giglio’s rural crime thriller Stealing Night rushes at you like a pair of headlights on a dark and lonely road, leaving you shaken and awed by the story’s raw power of love & redemption.”—Jan Kozlowski, author of Die, You Bastard! Die!",
  "genres": [],
  "author": "Peter Giglio",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/17619735-stealing-night"
}