{
  "title": "Burn Out",
  "description": "A futuristic blend of Beth Revis's Across the Universe and Lenore Appelhans's Level 2, Burn Out will satisfy the growing desire for science fiction with a thrilling story of survival, intrigue, and adventure. Most people want to save the world; seventeen-year-old Tora Reynolds just wants to get the hell off of it. One of the last survivors in Earth's final years, Tora yearns to escape the wasteland her planet has become after the sun turns \"red giant,\" but discovers her fellow survivors are even more deadly than the hostile environment.Holed up in an underground shelter, Tora is alone--her brilliant scientist father murdered, her mother and sister burned to death. She dreams of living on a planet with oceans, plants, and animals. Unfortunately, the oceans dried out ages ago, the only plants are giant cacti with deadly spines, and her pet, Trigger, is a gun--one of the bio-energetic weapons her father created for the government before his conscience kicked in. When family friend, Markus, arrives with mercenaries to take the weapons by force, Tora's fury turns to fear when government ships descend in an attempt to kill them all. She forges an unlikely alliance with Markus and his rag-tag group of raiders, including a smart but quiet soldier named James. She is shocked when James accidentally fires one of her father's bio-weapons--weapons designed to work only for her. She'd felt a strange pull to James from the start, but the odds of someone sharing her energy vibration are statistically miniscule. Tora must quickly figure out who she can trust, as she must choose between saving herself by giving up the guns or honoring her father's request to save humanity from the most lethal weapons in existence.",
  "genres": [
    "Young Adult",
    "Science Fiction",
    "Dystopia",
    "Post Apocalyptic",
    "Fantasy",
    "Fiction",
    "Space"
  ],
  "author": "Kristi Helvig",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/17621102-burn-out"
}