{
  "title": "Lie Still",
  "description": "In the tradition of Lisa Unger’s Beautiful Lies and Nancy Pickard’s The Scent of Rain and Lightning comes a twisting, riveting novel of shifting trust and shattered lives. Lie Still delves deep into the heart of an opulent Southern town, where gossip is currency and secrets kill.   When Emily Page and her husband move from Manhattan to the wealthy enclave of Clairmont, Texas, she hopes she can finally escape her haunted past—and outrun the nameless stalker who has been taunting her for years. Pregnant with her first child, Emily just wants to start over. But as she is drawn into a nest of secretive Texas women—and into the unnerving company of their queen, Caroline Warwick—Emily finds that acceptance is a very dangerous game.   It isn’t long before Caroline mysteriously disappears and Emily is facing a rash of anonymous threats. Are they linked to the missing Caroline? Or to Emily’s terrifying encounter in college, years earlier? As the dark truth about Caroline emerges, Emily realizes that some secrets are impossible to hide—and that whoever came for Caroline is now coming for her.Praise for Lie Still\n \n “In this engrossing novel of suspense . . . [Heaberlin] expertly spins out a tale of lies and deceit that will keep the reader guessing.”—Publishers Weekly\n \n “Heaberlin’s depiction of one tight-knit Texas community is both culturally savvy and politically astute. . . . A carefully wrapped package of Texas soap opera, social and political exposé, and well-paced thriller.”—Booklist\n \n “Heaberlin combines a culturally pertinent suspense story (the plot revolves around the main character’s struggles with the repercussions of an unreported date rape) with satirical observations about Texas’ moneyed suburban elite.”—The New York Times\n \n “Lie Still mixes serious discussion about ‘the last frontier in crime’ with a twisty-turny mystery plot and a cast of eccentric characters.”—Fort Worth Star-Telegram\n \n “Reading a book by Julia Heaberlin is like hearing your best friend tell you a particularly thorny story, filled with secrets and intrigue and human hopes and failures. Lie Still is a book you want to curl up with for a good long while but, more important, Julia Heaberlin is an author you want to get to know.”—Jenny Milchman   “Julia Heaberlin weaves an intricate tapestry of secrets and suspense, lies and betrayals that kept me reading late into the night. Lie Still is a thriller par excellence and a page-turner, true—but it’s also a moving story of one woman’s unlikely path toward healing, and another’s lifelong search for redemption. I challenge you to visit Claremont, Texas—where nothing is quite as it seems and no one is quite who they claim—and leave unchanged.”—Emily Colin  “Julia Heaberlin deceives the reader in the most deliciously chilling way in Lie Still: With gorgeous prose and sterling character work, she takes us on a deeply felt and wonderfully composed thrill ride. Layer after layer of secrets, longing, and deception is peeled away and we begin to dread the twisted kernel at the heart, never guessing what Heaberlin has in store for us.”—Sophie Littlefield, bestselling author of Garden of Stones",
  "genres": [
    "Mystery",
    "Thriller",
    "Fiction",
    "Suspense",
    "Mystery Thriller",
    "Contemporary",
    "Audiobook"
  ],
  "author": "Julia Heaberlin",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/17621780-lie-still"
}