{
  "title": "Flawed",
  "description": "From New York Times bestselling author Kim Karr comes a brand new standalone in the Connections Series.We each had a plan.We knew what we were doing.Until love got in our way.\nHim:\nThe first time I laid eyes on Gemma Hart, she belonged to another man. He literally owned her. I hated the very thought.I wanted her to be mine.Even though I knew I shouldn't, I couldn't help but watch the way she swayed her hips when she walked in my direction, raise a brow when she pretended not to notice me, get excited over the way her skin prickled whenever she got close.I turned her on.Thinking about her like that wasn't part of the plan. Getting addicted to the way she arched beneath me wasn't part of the plan. Caring about what happens to her was definitely not part of the plan.Yet I do.Now my plan has to be altered. I can't allow her to get caught in the crossfire. She has to leave, but she insists on staying. She has a secret. A reason she allows herself to belong to that obnoxious prick. She won't tell me what she's hiding unless I tell her why I need to know.I can't do that.There's another way to get what I want--a little game of cat and mouse. And I'm an excellent hunter. Her gone is for the best.Or that's what I keep telling myself.\nHer:\nThe first time Caleb Holt strode into the room I was certain I knew his type. A man too gorgeous for his own good, he was sexy, brooding, and so full of himself, I thought he could easily be fooled.I was wrong.Those brilliant green eyes followed me everywhere. I swore he could see into my soul, read my determination, uncover my secrets with just one glance.It worries me.I should have stayed away from him, but I couldn't fight the searing desire that flowed through my veins and the burning passion that coated my skin.I'll try harder.Before him, I had a plan to get back what was taken from me. The cost was irrelevant. Now I'm not sure I can sell my soul to the devil because I fear it belongs to him. The problem is he has a plan of his own, and I can't risk his plan taking priority over mine.So game on.",
  "genres": [
    "Romance",
    "New Adult",
    "Contemporary Romance",
    "Adult"
  ],
  "author": "Kim Karr",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/17622490-flawed"
}