{
  "title": "The Wild Girl",
  "description": "One of the great untold love stories - how the Grimm brothers discovered their famous fairy tales - filled with drama and passion, and taking place during the Napoleonic Wars.The Wild Girl tells the story of Dortchen Wild. Growing up next door to the Grimm brothers in Hesse-Cassel, a small German kingdom, Dortchen told Wilhelm some of the most powerful and compelling stories in the famous fairytale collection. Dortchen first met the Grimm brothers in 1805, when she was twelve. One of six sisters, Dortchen lived in the medieval quarter of Cassel, a town famous for its grand royal palace, its colossal statue of Herkules, and a fairytale castle of turrets and spires built as a love nest for the Prince-Elector’s mistress. Dortchen was the same age as Lotte Grimm, the only girl in the Grimm family, and the two became best friends.In 1806, Hesse-Cassel was invaded by the French. Napoleon created a new Kingdom of Westphalia, under the rule of his dissolute young brother Jérôme. The Grimm brothers began collecting fairytales that year, wanting to save the old stories told in spinning-circles and by the fire from the domination of French culture. Dortchen was the source of many of the tales in the Grimm brother’s first collection of fairy tales, which was published in 1812, the year of Napoleon’s disastrous march on Russia. Dortchen’s own father was cruel and autocratic, and he beat and abused her. He frowned on the friendship between his daughters and the poverty-stricken Grimm Brothers. Dortchen had to meet Wilhelm in secret to tell him her stories. All the other sisters married and moved away, but Dortchen had to stay home and care for her sick parents. Even after the death of her father, Dortchen and Wilhelm could not marry – the Grimm brothers were so poor they were surviving on a single meal a day. After the overthrow of Napoleon and the eventual success of the fairytale collection, Dortchen and Wilhelm were at last able to marry. They lived happily ever after with Wilhelm’s elder brother Jakob for the rest of their lives.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Fantasy",
    "Historical",
    "Romance",
    "Fairy Tales",
    "Retellings"
  ],
  "author": "Kate Forsyth",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/17622479-the-wild-girl"
}