{
  "title": "Cailín",
  "description": "A Love which Transcends Existence...It is the year 1702. Aislinn, the daughter of a sheep farmer in western Ireland, is a tenacious redheaded lass who has NO intention of ever settling into the dutiful roles of marriage and motherhood demanded of her by her father. The only thing she has ever wanted is to pursue her dreams of being a professional fiddler, and that is fully what she intends to do— with or without the blessing of her family.Nevertheless, all that, and so much more, is about to change when she is unwilling persuaded into participating in her older cousin’s girlish, traditional Celtic love spell to see the face of the lad she will be destined to marry. Aislinn doesn’t take it at all seriously, until that night when she dreams of a handsome dark-haired lad— just as she was told would happen. Falling for some charming lad was never part of her plans. Only now, Aislinn cannot seem to shake her obsession with him— nor does she want to! And though she never looks back after he comes into her life, things seem to do anything but fall beautifully into place.The vision of Donovan was not the only vision that Aislinn had ever experienced. She had always felt out of the ordinary somehow. She just didn’t know why— yet.Her father never misses an opportunity to rebuke Aislinn for her peculiarities. He accuses her of being a changeling of the sidhe, the dreaded faerie folk of Ireland that delight in causing mischief for decent folk like him. Perhaps she is.Fact is, for most of her life, Aislinn has been tormented by strange visions. And now, every one of them is about to manifest themselves to her.Just when all Aislinn believes she wanted is right within her grasp, she awakes in a strange bed in a castle surrounded by Vampires and the commanding presence of a striking man with an otherworldly attraction. She has no idea of his intentions, but from the shivers surging down her spine she is certain she’s about to find out. Everything is about to change . . .She finds herself heaved into a world of secrets, violence and lust so powerful— it will either consume her or destroy her.The thing is, Aislinn has no earthly idea of who or what she actually is. To discover the secret for herself, she will embark on a quest which will test her strength and devotion more than she could ever have imagined. But first, she’ll have to lose everything!Warning: Contains steamy Sensuality & Explicit Sexuality. Not intended for Readers below the age of Eighteen!",
  "genres": [
    "Romance",
    "Historical Romance",
    "Paranormal",
    "Vampires",
    "Historical Fiction",
    "Historical",
    "Paranormal Romance"
  ],
  "author": "Rosalind Scarlett",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/17622856-cail-n"
}