{
  "title": "Patriot Hearts: A Novel of the Founding Mothers",
  "description": "When Martha Dandridge Custis marries her second husband, George, she never suspects that the soft-spoken Virginia planter is destined to command the founding of a nation—or that she is to be “Lady Washington,” the woman at the first President’s side. Only a select inner circle of women will know the cost of sharing a beloved man with history . . . and each will draw strength from the unique treasure given to them by a doomed queen.Seeing farm and family through each harsh New England season, Abigail Adams is sustained only by the fervent reunions stolen between John’s journeys abroad. She will face the terror of an ocean crossing to join her husband in France—and write her own page in history. And there she will cross paths with kings, commoners—and young Sally Hemings.Just as Sally had grown from a clever child to a beautiful woman, so had her relationship with Thomas Jefferson grown from a friendship between slave and master to one entangled in the complexities of black and white, decorum and desire. It is a relationship that will leave Sally to face an agonizingly wrenching choice.Dolley Madison, too, must live with the repercussions of a forbidden love affair—although she will confront even greater trials as a President’s wife. But Dolley will become one of the best-loved ladies of the White House—and leave an extraordinary legacy of her own.A lushly written novel that traces the marriages tested by the demands of love and loyalty, Patriot Hearts offers readers a dazzling glimpse behind the scenes of a revolution, from adversity and treachery to teatime strategies, as four magnificent women shape a nation’s future.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "American History",
    "Romance",
    "American Revolutionary War",
    "18th Century"
  ],
  "author": "Barbara Hambly",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/176260.Patriot_Hearts"
}