{
  "title": "The Emancipator's Wife: A Novel of Mary Todd Lincoln",
  "description": "As a girl growing up in Kentucky, she lived a sheltered, privileged life filled with picnics and plantation balls. Vivacious, impulsive, and intoxicated by politics, she is a Todd of Lexington, an aristocratic family whose ancestors defeated the British. But no one knows her secret fears and anxieties. Although she is courted by the most eligible suitors in the land, including future senator Stephen Douglas, it is a gangly lawyer from Illinois who captures her heart. After a stormy courtship and a broken engagement, Abraham Lincoln will marry twenty-four-year-old Mary Todd and give her a ring inscribed with the words “Love Is Eternal.”But their happiness won’t last nearly so long. Their first child will be born under the gathering clouds of a civil war, and three more follow. As Lincoln’s star rises, the pleasure-loving Mary learns, often the hard way, the rules of being a politician’s wife. But by the time the fiery storm of war passes, tragedy will have claimed two sons, scandal will shadow her days as First Lady, and an assassin’s bullet will take Lincoln himself, leaving Mary alone and all but forgotten by the nation that owed her husband its survival.Yet it is in the years to come that Mary Todd Lincoln will truly come into her own. In public, she will fight to preserve Lincoln’s memory even as she battles a bitterly contested insanity trial. In private, she will struggle with depression and addiction as she endures the betrayals–both real and imagined–of family and friends.With a gifted novelist’s imagination and a historian’s eye for detail, Barbara Hambly tells a story of astonishing scope, richly peopled with real-life characters and their fictional counterparts, a tour-de-force tale of power, politics, and the role of women in nineteenth- century America. The result is a Mary Todd Lincoln few have seen and none will forget–the fascinating, controversial woman of whom her husband could say: “My wife is as handsome as when she was a girl and I fell in love with her; and what is more, I have never fallen out”–Mary Todd, the woman who loved Abraham Lincoln.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Civil War",
    "Historical",
    "American History",
    "Book Club",
    "19th Century"
  ],
  "author": "Barbara Hambly",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/176265.The_Emancipator_s_Wife"
}