{
  "title": "Historical Whodunits",
  "description": "In the spirit of Umberto Eco’s The Name of the Rose and Ellis Peters’ acclaimed Brother Cadfael mysteries, here is a collection of historical detective stories, written by contemporary authors and featuring a gallery of offbeat sleuths from the past. In a wry send-up of the classic “locked room” puzzle, an Egyptian sage ponders the mystery of a locked tomb. In another tale, a Roman slave’s investigation of a theft leads him to people in very high places. Edgar Allan Poe’s Auguste Dupin has been resurrected for a new adventure, as have historical figures, from William Shakespeare—hot on the trail of Christopher Marlowe's murderer—to Samuel Johnson, with Boswell playing his Dr. Watson! (And speaking of Watson… the wizard of Baker Street, Sherlock Holmes himself, appears in an original story written by the son of Arthur Conan Doyle!) These 23 tales comprise a mixed bag of delicious crime capers designed to tickle the fancy of any dedicated mystery buff.Contents: The locked tomb mystery / Elizabeth Peters — The thief versus King Rhampsinitus / Herodotus — Socrates solves a murder / Brèni James — Mightier than the sword / John Maddox Roberts — The treasury thefts / Wallace Nichols — A Byzantine mystery / Mary Reed and Eric Mayer — He came with the rain / Robert van Gulik — The High King’s sword / Peter Tremayne — The price of light / Ellis Peters — The confession of Brother Athelstan / Paul Harding — The witch’s tale / Margaret Frazer — Father Hugh and the deadly scythe / Mary Monica Pulver — Leonardo da Vinci, detective / Theodore Mathieson — A sad and bloody hour / Joe Gores — The Christmas Masque / S. S. Rafferty — Murder lock’d in / Lillian de la Torre — Captain Nash and the Wroth inheritance / Raymond Butler — The Doomdorf mystery / Melville Davisson Post — Murder in the Rue Royale / Michael Harrison — The gentleman from Paris / John Dickson Carr — The Golden Nugget poker game / Edward D. Hoch — The case of the Deptford horror / Adrian Conan Doyle — Five rings in Reno / R. L. Stevens — Afterword : Old-time detection / Arthur Griffiths",
  "genres": [
    "Mystery",
    "Short Stories",
    "Historical Fiction",
    "Historical",
    "Anthologies",
    "Fiction",
    "Historical Mystery"
  ],
  "author": "Decius Metellus",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/1762754.Historical_Whodunits"
}