{
  "title": "The Unabridged William Shakespeare",
  "description": "The World of Shakespeare: The Complete Plays and Sonnets of William Shakespeare (38 Volume Library) By William Shakespeare Stephen Orgel and A. R. Braunmiller, General Editors Amazon.com Exclusive The Pelican Shakespeare is available in hardcover for the first time in one complete collection only at Amazon.com. For anyone with an abiding love of the Bard and his to all of Shakepeares singular contributiOn to English literature, this complete library combines enduring beauty with the scholarship and authority demanded by modern readers. Easier to read and enjoy than massive, single-volume editions, these individual volumes feature authori tative text, essays on how the plays would have been performed in Shakespeare's day, and notes valuable for general readers, teachers, students, and theater professionals. Here, in 38 truly stunning heirloom volumes, are William Shakespeare's classic plays and sonnets in the only complete, individually-bound set of Shakespeare's works currently available. The tragedies, comedies, histories, and poetry, so beloved by millions of readers and theater-goers, are reproduced here in luxurious, linen-bound hardcovers, enhanced by silver stamping on the covers and spines, and sewn-in, satin ribbon markers. The distinguished Pelican Shakespeare editions have sold five million copies. Since the series debuted more than forty years ago, developments in scholarship have revolutionized our understanding of William Shakespeare, his time, and his works. The general editors of the Pelican Shakespeare, Stephen Orgel of Stanford University and A. R. Braunmiller of UCLA, have assembled a team of six eminent scholars who, along with the general editors themselves, have prepared new introductions and note * Authoritative and meticulously researched texts * Illuminating new introductions and notes by distinguished authors * Essays on Shakespeare's life, the theatrical world of his time, and the selection of texts * A handsome new design inside and out * Deluxe packaging, including a full-linen case with silver stamping, ribbon marker, printed endpapers, and acid-free paper * Line numbers marking every tenth line and footnote references * Both glossorial and explanatory notes appearing conveniently at the foot of the page Included are: Tragedies Antony and Cleopatra Coriolanus Hamlet Julius Caesar King Lear Macbeth Othello Romeo and Juliet Timon of Athens Titus Andronicus Histories Henry IV, Part I Henry IV, Part II Henry V Henry VI, Part I Henry VI, Part II Henry VI, Part III Henry VIII King John Richard II Richard III Comedies All's Well That Ends Well As You Like It The Comedy of Errors Cymbeline Love's Labor's Lost Measure for Measure The Merry Wives of Windsor The Merchant of Venice A Midsummer Night's Dream Much Ado About Nothing Pericles The Taming of the Shrew The Tempest Troilus and Cressida Twelfth Night Two Gentlemen of Verona The Winter's Tale Poetry The Sonnets",
  "genres": [
    "Classics",
    "Poetry",
    "Fiction",
    "Literature",
    "Plays",
    "Drama",
    "Collections"
  ],
  "author": "William Shakespeare",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/1762878.The_Unabridged_William_Shakespeare"
}