{
  "title": "Wet Grave",
  "description": "In such stunning novels of crime and character as Die Upon a Kiss, Sold Down the River, and A Free Man of Color , Benjamin January tracked down killers through the sensuous, atmospheric, dangerously beautiful world of Old New Orleans. Now, in this new novel by bestselling author Barbara Hambly, he follows a trail of murder from illicit back alleys to glittering mansions to a dark place where the oldest and deadliest secrets lie buried . . .Wet GraveIt’s 1835 and the relentless glare of the late July sun has slowed New Orleans to a standstill. When Hesione LeGros--once a corsair’s jeweled mistress, now a raddled hag--is found slashed to death in a shanty on the fringe of New Orleans’s most lawless quarter, there are few to care. But one of them is Benjamin January, musician and teacher. He well recalls her blazing ebony beauty when she appeared, exquisitely gowned and handy with a stiletto, at a demimonde banquet years ago.Who would want to kill this woman now--Hessy, they said, would turn a trick for a bottle of rum--had some quarrelsome “customer” decided to do away with her? Or could it be one of the sexual predators who roamed the dark and seedy streets? Or--as Benjamin comes to suspect--was her killer someone she knew, someone whose careful search of her shack suggests a cold-blooded crime? Someone whose boot left a chillingly distinctive print . . .His inquiries at taverns, markets, and slave dances reveal little about “Hellfire Hessy” since her glory days in Barataria Bay, once the lair of gentlemen pirates. Then the murder is swept from his mind by the delivery of a crate filled with contraband rifles--and yet another telltale boot print left by its claimant. When a murder swiftly follows, Ben and Rose Vitrac, the woman he loves, fear the workings of a serpentine mind and a treacherous one only they can hope to thwart in time.All too soon they are fugitives of color in the stormy bayous and marshes of slave-stealer country, headed for smugglers’ haunts and sinister plantations, where one false step could be their last toward a... Wet Grave .",
  "genres": [
    "Mystery",
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Historical Mystery",
    "19th Century",
    "Mystery Thriller"
  ],
  "author": "Barbara Hambly",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/176309.Wet_Grave"
}