{
  "title": "She Landed By Moonlight: The Story of Secret Agent Pearl Witherington: the 'real Charlotte Gray'",
  "description": "On the night of the 22 September 1943 Pearl Witherington, a twenty-nine-year-old British secretary and agent of the Special Operations Executive (SOE), was parachuted from a Halifax bomber into Occupied France. Like Sebastian Faulks' heroine, Charlotte Gray, Pearl had a dual mission: to fight for her beloved, broken France and to find her lost love. Pearl's lover was a Parisian parfumier turned soldier, Henri Cornioley, who had been taken prisoner while serving in the French Logistics Corps and subsequently escaped from his German POW camp. Agent Pearl Witherington's wartime record is unique and heroic. As the only woman agent in the history of SOEs in France to have run a network, she became a fearless and legendary guerrilla leader organising, arming and training 3,800 Resistance fighters. Probably the greatest female organiser of armed maquisards in France, the woman whom her young troops called 'Ma Mère', Pearl lit the fires of Resistance in Central France so that Churchill's famous order to 'set Europe ablaze', which had brought SOE into being, finally came to pass. Pearl's story takes us from her harsh, impoverished childhood in Paris, to the lonely forests and farmhouses of the Loir-et-Cher where she would become a true 'warrior queen'. Shortly before Pearl's death in 2008, the Queen presented her with a CBE in Paris. While male agents and Special Force Jedburghs received the DSO or Military Cross, an ungrateful country had forgotten Pearl. She had been offered a civilian decoration in 1945 which she refused, saying 'There was nothing civil about what I did.' But what pleased her most was to receive her Parachute Wings, for which she had waited over 60 years. Two RAF officers travelled to her old people's home and she was finally able to pin the coveted wings on her lapel. Pearl died in February 2008 aged 93.",
  "genres": [
    "Nonfiction",
    "History",
    "War",
    "Espionage",
    "World War II",
    "Historical",
    "Biography"
  ],
  "author": "Carole Seymour-Jones",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/17638338-she-landed-by-moonlight"
}