{
  "title": "Page Turner",
  "description": "Being cheated on months before her big wedding left Tessa Noonan in a definite slump. Books are the only things she seems to care about anymore, naughty little tomes that allow her to escape from the cold, hard reality of her humdrum life. So when the devastatingly handsome Cage Markum waltzes in to sweep her off her feet, she’s more than ready for his special brand of attention, and more than willing to let him help her make all her wildest fantasies come true.But when her father suddenly becomes ill, all the heartache comes thundering back in an instant, and with it comes a hidden truth about Cage that Tessa had been working very hard to ignore. All too soon the time has come for Tessa to decide where the future will take her; if she will allow the disappointment of her past to control and define her, or if she can let go of the hurt and learn to trust the magical healing power of love again.More stories in the Incubus Rising Series include:Monogamy is Dead (Book One) - The inception of the Incubus Rising Series introduces us to Gabriel Falcone and Bianca Lightenger's torrid, tumultuous love affair, in a tale that proves that loving someone is often complicated, no matter how perfect it may seem on the surface, and that happy endings aren't always the ones that we necessarily expect. Warning: Not for the romantic faint of heart!The Only Exception (Book Three) - Olivia and Dante's epic love story, that's all about hope and second chances. Invisible (Book Four) - A sexy Cinderella story about unassuming, good girl Cassadee who gets much more excitement than she bargained for as a bridesmaid at a certain Incubus Rising couple's private island wedding. Wild Thing (Book Five) a new Miami based off-shoot of the Incubus Rising Series, where we meet Willa Thorne, a brassy, ballsy, wild child who falls down the rabbit hole of the magical Hotel Danu and finds herself in the crosshairs of one very sexy Silverfox with some serious magical mojo.Also by Jennifer Mancini - Devil May Care, a full length novel about a badass, female assassin named Raine who inadvertently inspires the wrath of the surprisingly gorgeous God of the Dead.",
  "genres": [],
  "author": "Jennifer Mancini",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/17638960-page-turner"
}