{
  "title": "Look Again: The Power of Noticing What Was Always There",
  "description": "For fans of Thinking Fast and Slow and The Power of Habit , a groundbreaking new study of how disrupting our well-worn routines, both good and bad, can rejuvenate our days and reset our brains to allow us to live happier and more fulfilling lives.Have you ever noticed that what is thrilling on Monday tends to become boring on Friday? Even exciting relationships, stimulating jobs, and breathtaking works of art lose their sparkle after a while. People stop noticing what is most wonderful in their own lives. They also stop noticing what is terrible. They get used to dirty air. They stay in abusive relationships. People grow to accept authoritarianism and take foolish risks. They become unconcerned by their own misconduct, blind to inequality, and are more liable to believe misinformation than ever before.But what if we could find a way to see everything anew? What if you could regain sensitivity, not only to the great things in your life, but also to the terrible things you stopped noticing and so don’t try to change?Now, neuroscience professor Tali Sharot and Harvard law professor (and presidential advisor) Cass R. Sunstein investigate why we stop noticing both the great and not-so-great things around us and how to “dishabituate” at the office, in the bedroom, at the store, on social media, and in the voting booth. This groundbreaking work, based on decades of research in the psychological and biological sciences, illuminates how we can reignite the sparks of joy, innovate, and recognize where improvements urgently need to be made. The key to this disruption—to seeing, feeling, and noticing again—is change. By temporarily changing your environment, changing the rules, changing the people you interact with—or even just stepping back and imagining change—you regain sensitivity, allowing you to more clearly identify the bad and more deeply appreciate the good.",
  "genres": [
    "Nonfiction",
    "Psychology",
    "Self Help",
    "Audiobook",
    "Personal Development",
    "Sociology",
    "Science"
  ],
  "author": "Tali Sharot",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/176442617-look-again"
}