{
  "title": "The Age of Grievance",
  "description": "From bestselling author and longtime New York Times columnist Frank Bruni comes a lucid, powerful examination of the ways in which grievance has come to define our current culture and politics, on both the right and left.The twists and turns of American politics today have become nearly impossible to predict, but the tone is a troubling given. It’s one of grievance. A perilous share of Americans across the full breadth of the political spectrum respond to every big disappointment, every little frustration, every way in which the world doesn’t hew precisely to their liking by deciding that they’ve been wronged, identifying the people responsible for that and raging at the injustice of it all. The blame game is the country’s most popular sport and victimhood its most fashionable garb.Grievance isn’t always and necessarily bad. It has often done enormous good. The United States is a nation born of grievance, in the revolt of royal subjects unwilling to accept a bad deal, and across the nearly 250 years of our existence as a country, grievance has been the engine of morally urgent change. But what happens when all sorts of grievances—the greater ones, the lesser ones, the authentic, the invented—are jumbled together? When grievances become all-encompassing lenses, all-purpose reflexes, default settings? When people take their grievances to extreme and even violent lengths that they didn’t before?A violent mob storms the US Capitol, rejecting the results of a presidential election and embracing the fiction that it was rigged. Conspiracy theories flourish. Politicians appeal not to our better angels but to our worst impulses, encouraging selfishness instead of selflessness, trading inspiration for retribution. Fox News, the country’s most watched cable news network, and Tucker Carlson, its sneering star, knowingly peddle lies in the service of profit. The Supreme Court loses touch with the country, overturning Roe v. Wade and shrugging off Clarence Thomas’s transgressions. College students chase away speakers and college administrators dismiss instructors for dissenting from progressive orthodoxy. Will Smith slaps Chris Rock. And there’s a potentially devastating erosion of the civility, common ground and compromise necessary for our democracy to survive.How did we get here? What does it say about us, and where does it leave us? Timely, important, and enlightening, The Age of Grievance examines these critical questions and charts a path forward for a nation that may be growing tired of outrage.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Sociology",
    "Audiobook",
    "Cultural",
    "History",
    "Psychology"
  ],
  "author": "Frank Bruni",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/176443156-the-age-of-grievance"
}