{
  "title": "The Age of Magical Overthinking: Notes on Modern Irrationality",
  "description": "From the bestselling author of Cultish and host of the podcast Sounds Like a Cult, a delicious blend of cultural criticism and personal narrative that explores our cognitive biases and the power, disadvantages, and highlights of magical thinking.Utilizing the linguistic insights of her “witty and brilliant” first book Wordslut and the sociological explorations of her breakout hit Cultish, Amanda Montell now turns her erudite eye to the inner workings of the human mind and its biases in her most personal and electrifying work yet.“Magical thinking” can be broadly defined as the belief that one’s internal thoughts can affect unrelated events in the external Think of the conviction that one can manifest their way out of poverty, stave off cancer with positive vibes, thwart the apocalypse by learning to can their own peaches, or transform an unhealthy relationship to a glorious one with loyalty alone. In all its forms, magical thinking works in service of restoring agency amid chaos, but in The Age of Magical Overthinking, Montell argues that in the modern information age, our brain’s coping mechanisms have been overloaded, and our irrationality turned up to an eleven.In a series of razor sharp, deeply funny chapters, Montell delves into a cornucopia of the cognitive biases that run rampant in our brains, from how the “Halo effect” cultivates worship (and hatred) of larger than life celebrities, to how the “Sunk Cost Fallacy” can keep us in detrimental relationships long after we’ve realized they’re not serving us. As she illuminates these concepts with her signature brilliance and wit, Montell’s prevailing message is one of hope, empathy, and ultimately forgiveness for our anxiety-addled human selves. If you have all but lost faith in our ability to reason, Montell aims to make some sense of the senseless. To crack open a window in our minds, and let a warm breeze in. To help quiet the cacophony for a while, or even hear a melody in it.",
  "genres": [
    "Nonfiction",
    "Audiobook",
    "Psychology",
    "Self Help",
    "Essays",
    "Mental Health",
    "Memoir"
  ],
  "author": "Amanda Montell",
  "average_rating": "3.46",
  "url": "https://www.goodreads.com/book/show/176443264-the-age-of-magical-overthinking"
}