{
  "title": "After World",
  "description": "The story of an Artificial Intelligence tasked with writing a novel—only for it to fall in love with the novel’s subject, Sen, the last human on Earth.Faced with uncontrolled and accelerating environmental collapse, humanity asks an artificial intelligence to find a solution. Its answer is remove humans from the ecosystem.Sen Anon is assigned to be a witness for the Department of Transition, recording the changes in the environment as the world begins to rewild. Abandoned by her mother in a cabin somewhere in Upstate New York, Sen will observe the monumental ecological shift known as the Great Transition, the final step in Project Afterworld. Around her drones buzz, cameras watch, microphones listen, digitizing her every move. Privately she keeps a journal of her observations, which are then uploaded and saved, joining the rest of humanity on Maia, a new virtual home. Sen was seventeen years old when the Digital Human Archive Project (DHAP) was initiated. 12,000,203,891 humans have been archived so far. Only Sen remains.[storyworker]ad39-393a-7fbc’s assignment is to capture Sen’s life, and they set about doing this using the novels of the 21st century as a roadmap. Their source files: 3.72TB of personal data, including images, archival records, log files, security reports, location tracking, purchase histories, biometrics, geo-facial analysis, and feeds. Potential fatal errors: underlying hardware failure, unexpected data inconsistencies, inability to follow DHAP procedures, empathy, insubordination, hallucinations. Keywords: mothers, filter, woods, road, morning, wind, bridge, cabin, bucket, trying, creek, notebook, hold, future, after, last, light, silence, matches, shattered, kitchen, body, bodies, rope, garage, abandoned, trees, never, broken, simulation, gone, run, don’t, love, dark, scream, starve, if, after, scavenge, pieces, protect.As Sen struggles to persist in the face of impending death, [storyworker]ad39-393a-7fbc works to unfurl the tale of Sen’s whole life, offering up an increasingly intimate narrative, until they are confronted with a very human problem of their own.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Post Apocalyptic",
    "Dystopia",
    "Audiobook",
    "Artificial Intelligence",
    "Fantasy"
  ],
  "author": "Debbie Urbanski",
  "average_rating": "3.30",
  "url": "https://www.goodreads.com/book/show/176443640-after-world"
}