{
  "title": "The Painter's Daughters",
  "description": "A story of love, madness, sisterly devotion, and control, about the two beloved daughters of renowned 1700s English painter Thomas Gainsborough, who struggle to live up to the perfect image the world so admired in their portraits.Peggy and Molly Gainsborough—the daughters of one of England’s most famous portrait artists of the 1700s and the frequent subject of his work—are best friends. They spy on their father as he paints, rankle their mother as she manages the household, and run barefoot through the muddy fields that surround their home. But there is another reason they are from a young age, Molly periodically experiences bouts of mental confusion, even forgetting who she is, and Peggy instinctively knows she must help cover up her sister’s condition.When the family moves to Bath, it’s not so easy to hide Molly’s slip-ups. There, the sisters are thrown into the whirlwind of polite society, where the codes of behavior are crystal clear. Molly dreams of a normal life but slides deeper and more publicly into her delusions. By now, Peggy knows the shadow of an asylum looms for women like Molly, and she goes to greater lengths to protect her sister’s secret.But when Peggy unexpectedly falls in love with her father’s friend, the charming composer Johann Fischer, the sisters’ precarious situation is thrown catastrophically off course. Her burgeoning love for Johann sparks the bitterest of betrayals, forcing Peggy to question all she has done for Molly, and whether any one person can truly change the fate of another.A tense and tender examination of the blurred lines between protection and control, The Painter’s Daughters is a searing portrait of the real girls behind the canvas. Emily Howes’s debut is a stunning exploration of devotion, control, and individuality; it is a love song to sisterhood, to the many hues of life, and to being looked at but never really seen.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Art",
    "Romance",
    "Adult",
    "British Literature"
  ],
  "author": "Emily Howes",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/176451799-the-painter-s-daughters"
}