{
  "title": "اشتراكية الإسلام",
  "description": "بين الطبعة الأولى 1959م والثانية 1960م لكتابه \"اشتراكية الإسلام\"، ذكر السباعي أن في الطبعة الثانية زيادات. يقول : \" امتازت الطبعة الثانية بتحقيقات مهمة، وزيادات كثيرة، وأمثلة عديدة من الواقع التاريخي \".\" كنت أود أن أتوسع في بحث الواقع التاريخي في الدولة والمجتمع والفرد المسلم، لولا ضيق المجال، كما أنني لم أتحدث عن حركة أبي ذر التي قام بها في عهد عثمان، رضي الله عنهما، لأني لم أستكمل بعد دراسة أسبابها وحقيقتها، وتمحيص النصوص التاريخية الواردة بشأنها، بالشكل الذي أطمئن إليه وأقتنع به. وأيضًا لم أتعرض لبعض الحركات السياسية التي قامت في العصر العباسي، واتخذت شكلاً فوضويًا شيوعيًا، كحركة القرامطة. أرجو أن أضيف هذه الأبحاث كلها، مع التوسع في كثير مما أجملته في هذه الطبعة، إلى الطبعة القادمة بإذن الله \".\" كنت أرغب ألا يعاد طبع هذا الكتاب للمرة الثانية إلا بعد أن أكون قد انتهيت من كل الأبحاث التي وعدت بتحقيقها في الطبعة الأولى، ولكن الكتاب ما كاد يخرج إلى الأيدي حتى نفدت نسخه بعد أشهر قلائل، ثم ازداد الطلب على ناشريه ازديادًا كبيرًا، مما اضطرني إلى تقديمه للطبعة الثانية دون أن أتمكن من تحقيق كل ما وعدت به قراء الطبعة الأولى \".\" سنتحدث بالتفصيل عن مدى تطبيق مبادئ اشتراكية الإسلام في عصر الرسول وصحابته، وبالإجمال عن تطبيقها في العصور التي تليها، واعدين أن نتابع البحث والدأب حتى نظفر بالضالة المنشودة \".\" سنبحث في كل عنصر من العناصر الأربعة ( التي يتألف منها الكتاب : الحقوق الطبيعية، القوانين التي تضمنها، القوانين التي تضمن التكافل الاجتماعي، المؤيدات التي تدعم هذه الحقوق والقوانين ) بقدر ما يعطي فكرة واضحة عنها، تاركين شرح هذه النظرية شرحًا وافيًا إلى كتابنا الكبير الذي نضعه لذلك، ونرجو أن يتم إنجازه قريبًا بإذن الله \".\" ذكرنا شيئًا من هذه المقارنات في كتابنا ( شرح قانون الأحوال الشخصية )، الجزء الأول، ولنا في ذلك كتاب ضاف لم يطبع بعد \".\" بدأنا بوضع كتاب باسم ( حقوق الحيوان في الإسلام )، ونسأل الله العون على إنجازه \". كتابه \" اشتراكية الإسلام \"، الناشرون العرب، القاهرة، الطبعة الثانية 1960م، وكانت الطبعة الأولى 1959م ( مطبعة جامعة دمشق ). وتقع الطبعة الثانية في 400 صفحة من القطع الصغير. وتتألف من الفصول التالية :موقف الأديان من الفقر : اليهودية، المسيحية، الإسلام.الحقوق الطبيعية الخمسة : حق الحياة، حق الحرية، حق العلم، حق الكرامة، حق التملك.مبادئ التملك : الكون كله لله، المال وسيلة للخير، الفقر مرض اجتماعي، العمل أهم وسائل التملك، تأميم الموارد الطبيعية، طرائق التملك، الحجر على السفهاء، التملك وظيفة اجتماعية، كراهية تكديس الثروات.بحوث حول حق التملك : إحياء الموات، الإقطاع، حقوق العمال، التأميم، تحديد الملكية.قوانين التكافل : التكافل المعاشي، التكافل الاجتماعي، التكافل الأدبي، التكافل العلمي، التكافل السياسي، التكافل الدفاعي، التكافل الجنائي، التكافل الأخلاقي، التكافل الاقتصادي، التكافل العبادي، التكافل الحضاري.قوانين التكافل الاجتماعي : الفئات التي تستحق التكافل، موارد نفقات التكافل، المؤيدات ( الحوافز الإيجابية والسلبية ) : الاعتقادية، الأخلاقية، المادية، التشريعية.المقارنات : مع الرأسمالية، مع الشيوعية.شخصية الرسول وأثره ( ملخص للسيرة رائع ومؤثر أنصح بقراءته، وهو درّة الكتاب ودليل على حسن الاختيار ).الدولة الإسلامية في عهد الرسول.الدولة الإسلامية في عهد الخلفاء الراشدين.الدولة الإسلامية في العهد الأموي.الدولة الإسلامية في العهود الأخرى.الآثار الباقية في المجتمع من اشتراكية الإسلام : الزكاة، التكافل العائلي، الوصايا، النذور، الأوقاف.الملحق : ردوده على منتقديه في موقفه من التأميم وتحديد الملكية الفردية. مقارنة الكتاب العدالة الاجتماعية لسيد قطب ( 1906-1966م : 60 سنة ) عام 1954م، 300 صفحة قطع متوسط.اشتراكية الإسلام لمصطفى السباعي ( 1915-1964م : 49 سنة )، الطبعة الأولى 1959م، والثانية 1960م، 400 صفحة قطع صغير.مشكلة الفقر ليوسف القرضاوي ( + 1926م : 84 سنة حتى الآن ) عام 1966م، 160 صفحة قطع متوسط. أصل الكتاب يقول السباعي : \" إن هذا البحث الذي أقدمه في هذا الكتاب هو نص المحاضرة التي ألقيتها على مدرج جامعة دمشق بتاريخ 21 رمضان 1378هـ = 30 آذار ( مارس ) 1959م، في سلسلة المحاضرات الجامعية العامة لعام 1959م \".لغة الكتاب يتمتع السباعي بمقدرة كبيرة في الفكر واللغة والحيوية والتشويق، انعكست على كتابه وميّزته عن غيره من الباحثين.عنوان الكتاب أثار جدلاً كبيرًا بين العلماء، وهاجمه عدد منهم، لعل أعدلهم ما كان من طرف الشيخ محمد الحامد رحمه الله. يقول سيد قطب في كتاب \" العدالة الاجتماعية \"، معترضًا على الشكل دون المضمون : \" لم أستسغ حديث من يتحدثون عن اشتراكية الإسلام وديمقراطية الإسلام (...)، فهذا إحساس خفي بالهزيمة، ولو لم يعترفوا صراحة بالهزيمة \". وقد يبدو لأول وهلة أن من الممكن تغيير عنوان الكتاب، وحذف لفظ \" الاشتراكية \" حيثما ورد في الكتاب. يقول الكاتب مثلاً : \" اشتراكية الإسلام تقرر حق الحرية الدينية \". فهاهنا يمكن أن تعاد صياغة الجملة على الشكل التالي : ( الإسلام يقرر حق الحرية الدينية )، وهكذا الشأن في أكثر المواضع.غير أن هذا غير ممكن التحقيق في مبحثين من مباحث الكتاب : الأول بعنوان : \" التأميم \"، والآخر بعنوان \" تحديد الملكية \"، حيث يظهر تأثر الشيخ ببلده وبيئته وما كان سائدًا في عصره. يقول : \" لقد سميت القوانين والأحكام التي جاءت في الإسلام لتنظيم التملك وتحقيق التكافل الاجتماعي باشتراكية الإسلام، وأنا أعلم أن بعض الغيورين على الإسلام يكرهون هذه التسمية، لأن الاشتراكية في رأيهم هي موضة هذا العصر، فلا يصح أن نبادر إلى القول بالاشتراكية الإسلامية تمشيًا مع هذه الموضة، ولأنه قد يأتي زمن تبطل فيه هذه الموضة، ويسود القول بمذهب اقتصادي آخر، فنضطر حينئذ إلى العدول عن القول باشتراكية الإسلام. وهناك من يحاذر القول بالاشتراكية الإسلامية، خوفًا من أن تستغل المذاهب الاشتراكية، وخاصة الشيوعية منها، هذه التسمية لتستخدمها في الدعوة إلى مذاهبها. وأيضًا فالإسلام نظام مستقل قائم بذاته، وقد سماه الله إسلامًا فلا يجوز لنا أن نسميه باسم جديد. ومن الناس من ينكر أن تكون في الإسلام أي نزعة اشتراكية. يقول بعضهم هذا تشويهًا لسمعة الإسلام وصدًا عنه، كالشيوعيين. فإن مصلحتهم الحزبية تحتم عليهم أن يؤكدوا في الأذهان أن الشيوعية وحدها هي الاشتراكية العلمية الصحيحة، وما عداها فزيف وباطل. ويقوله بعضهم ظنًا منهم أن الإسلام دين رأسمالي. وهؤلاء هم الجاهلون بالإسلام مع حبهم له. ويقوله آخرون خدمة للغربيين، ومن يدور في فلكهم من الأغنياء وذوي الثروات والملكيات الكبيرة. وهؤلاء هم المتاجرون بالدين، الذين يضعون أنفسهم في خدمة من يستأجرهم. لقد اخترت القول باشتراكية الإسلام مع العلم بكل ما يقوله هؤلاء، لأني لا أعتقد أن الاشتراكية موضة ستزول، بل هي نزعة إنسانية تتجلى في تعاليم الأنبياء ومحاولات المصلحين منذ أقدم العصور، وتسعى شعوب العالم الحاضر، وخاصة الشعوب المتخلفة، إلى تحقيقها، لتتخلص من فواجع الظلم الاجتماعي والتفاوت الطبقي الفاحش المزري بكرامة الإنسان.  وليست حقيقة الاشتراكية هي التأميم ولا انتزاع رأس المال ولا تحديد الملكية ولا الضرائب التصاعدية، بل هذه كلها وسائل يراها دعاتها الطريق الصحيح لتحقيق هدف الاشتراكية. إن هدف الاشتراكية على اختلاف مذاهبها هو منع الفرد من استغلال رأس المال للإثراء على حساب الجماهير وبؤسهم وشقائهم، وإشراف الدولة على فعالية الفرد الاقتصادية ومراقبتها له، وتحقيق التكافل الاجتماعي بين المواطنين، بحيث تمحى مظاهر الفاقة والحرمان وتفاوت الثروات تفاوتًا فاحشًا، يقترن فيه الجوع والفقر والمرض والمهانة، بجانب الترف والرفاهية والقسوة والانحلال الخلقي. وهذا الهدف لا أعتقد أن واحدًا ممن يعرف الإسلام، ويفهم روحه على وجهها الصحيح، ينكر أن الإسلام قد وضعه نصب عينيه في كل تشريعه، ووضع له من التشريع ما يكفل تحقيقه على أحسن حال. فإذا كان الأمر كذلك، وكان هذا الهدف هو مما لا سبيل إلى رجوع الإنسانية عنه، وستظل تكافح في سبيله حتى تصل إليه، وكان من الصدّ عن دين الله، والظلم لشريعة الإسلام وللحق، أن ننكر القول باشتراكية الإسلام، أو نتجنب هذه التسمية. وما دام الناس في مختلف الشعوب يتوقون إلى تحقيق ذلك الهدف، ويتهافتون على المذاهب الاشتراكية المعروفة، اعتقادًا منهم بأنها هي الطريق الوحيد لتحقيقه، أفلا يجب علينا أن ندلّهم على طريق آخر لا يعرفونه، لتحقيق هذا الهدف العظيم، وهو طريق أكمل منهجًا، وأكثر استقامة، وأبعد عن مساوئ تلك المذاهب الاشتراكية وعيوبها ؟ وماذا يفعل الذين يعتقدون بالحق حين يجدون الناس يبحثون عنه ؟ ألا يسلكون كل سبيل مشروع للدعاية له ولفت الأنظار إليه ؟ فلماذا نحجم عن لفت أنظار الناس إلى طريق الإسلام في تحقيق هدفهم، الذي هو هدف الإنسانية الكريمة في كل عصورها \" ؟!بناءً على هذا فإن تغيير عنوان الكتاب، كما فعل بعض الناشرين مؤخرًا، وهم من أقاربه وورثته، وما عمدوا إليه من تغيير بعض ألفاظه، وحذف بعض عباراته، أمر لا يجوز، لأن هذا تشويه للسباعي ولكتابه، ولأن الشيخ السباعي هو شيخ الاشتراكية الإسلامية، عن اعتقاد جازم، وليس عن خطة لمجرد لفت الأنظار وتحويلها عن الاشتراكية إلى الإسلام. أن تؤمن بما يقوله أو لا تؤمن : تلك مسألة أخرى.مقصود الكتاب يتمثل مقصود الكتاب في أمرين :الأمر الأول : يريد أن يتوجه الكاتب إلى الذين فتنوا بالاشتراكية، أو وقعوا تحتها نتيجة الفكر السائد في المنطقة وقتئذ، قائلاً لهم : إذا كنتم مبهورين بالاشتراكية فالإسلام فيه الاشتراكية وزيادة!الأمر الثاني : ميل الكاتب إلى الموافقة على الاشتراكية وقوانين الإصلاح الزراعي وتحديد الملكيات الكبيرة. ويستطيع القارئ أن يقف على هذا من خلال المبحثين المشار إليهما بشكل خاص. قال السباعي : \" لسنا نقول هذا القول ( تحديد الملكية الزراعية ) الآن في عام 1959م فحسب، بل قلناه من قبل، منذ عام 1949م، حين كنا في الجمعية التأسيسية ( في سوريا ) أثناء وضع الدستور، وقد كان الصراع عنيفًا بيننا وبين المالكين الكبار \"، إلى أن صدر الدستور عام 1950م لكي يطبق على الملكيات الزراعية التي ستنشأ في المستقبل، دون أن يكون له مفعول رجعي يمس الملكيات القائمة.أثر الكتاب لهذا الكتاب أثر كبير على من كتب بعده في الاقتصاد الإسلامي وفي العدالة والفقر والتكافل والزكاة والأوقاف والملكية والتوظيف ( الضرائب ) والحسبة وإحياء الموات، سواء من حيث خطته أو من حيث نقوله وشواهده أو من حيث وضوحه. فقد ذكر عددًا من النقول عن الغزالي والشاطبي في مقاصد الشريعة وفي التوظيف المالي. وكذلك عن ابن حزم وابن تيمية. ونقل حديث الأشعريين. وقال : \" كان من المناسب أن أعرض في هذا البحث قوانين التملك، إلا أن عرض هذه القوانين يحتاج إلى مجلدات ضخمة، لأنها تشمل كل أحكام المعاملات في الفقه الإسلامي، وهذه الأحكام تكاد تبلغ تسعة أعشار الفقه. ولعل بعض فقهاء الشريعة، ممن تمكنهم حالتهم الصحية، ويمدّ الله في حياتهم، أن ينهضوا بعبء إخراج هذه القوانين بأسلوب سهل، يفهمه جمهور المثقفين، لتتم بها سلسلة قوانين الاشتراكية الإسلامية \". وقال : \" نريد أن نلفت النظر هنا إلى هذه الرسالة القيمة ووجوب الاطلاع عليها \". يريد بذلك : رسالة الحسبة لابن تيمية، ونقل عنها حوالي 4 صفحات.كتابه أفضل من بعض الكتب التي كتبت بعده.خصائص الاشتراكية الإسلامية عند السباعي اشتراكية الإسلام ليست اشتراكية الدراويش والزهاد، كبعض الصوفية وفقراء الهنود، الذين ينفرون من المال والتملك، جبنًا منهم عن تحمل أعباء الحياة ومسؤولياتها، وإنما هي اشتراكية حضارية إيجابية بناءة، تقيم أكمل مجتمع حضاري متمدن.اشتراكية الإسلام تحارب الفقر والجهل والمرض والخوف والمهانة.مستوى المعيشة في اشتراكية الإسلام مستوى مرتفع.اشتراكية الإسلام تشرك الشعب مع الدولة في تحقيق التكافل الاجتماعي، كما في نظام نفقات الأقارب.اشتراكية الإسلام تحارب الترف والبذخ واللهو الماجن في السلم والحرب.اشتراكية الإسلام تُخضع الحكومة لإرادة الشعب، لا العكس.اشتراكية الإسلام توسّع دائرة التكافل الاجتماعي، ومن ثم فهي أكثر ضمانًا لكرامة الإنسان وسعادته.اشتراكية الإسلام ليست نظرية ولا عاطفية، بل هي عملية.الفرق بين اشتراكية الإسلام وبين الرأسمالية يتفقان في إعطاء الفرد حق التملك، والتنافس في الإنتاج.يختلفان في أن حق التملك في اشتراكية الإسلام يخضع لمصلحة الجماعة، وفي الرأسمالية تخضع الجماعة لمصلحة رأس المال.كما يختلفان في أن التنافس في الاشتراكية الإسلامية يشيع الحب والتعاون في المجتمع، وفي الرأسمالية يشيع العداء والخلاف والاضطراب.الرأسمالية ملطخة بدماء الشعوب، والاستعمار، والاستعباد، واللصوصية، والاستغلال. ولاشيء من هذا في اشتراكية الإسلام.الفرق بين اشتراكية الإسلام وبين الشيوعية اشتراكية الإسلام تنسجم مع الفطرة الإنسانية في إباحة الملكية الشخصية.اشتراكية الإسلام تبيح التنافس، أما الشيوعية فترى أنه يجرّ البلاء على المجتمع.اشتراكية الإسلام تقوم على التعاون، والشيوعية تقوم على الصراع وحرب الطبقات، مما يؤدي إلى الحقد.اشتراكية الإسلام تقوم على الأخلاق، بخلاف الماركسية.اشتراكية الإسلام تقوم على الشورى، والشيوعية تقوم على الاستبداد والدكتاتورية والإرهاب. القواعد الكلية القواعد الكلية استمدها العلماء من الحديث الشريف، أو من أقوال الأئمة الكبار. وأضاف السباعي بعض القواعد المستمدة من القرآن :ولقد كرمنا بني آدم ( الإسراء 70 )وأن ليس للإنسان إلا ما سعى ( النجم 39 )إن الله يأمر بالعدل والإحسان وإيتاء ذي القربى ( النحل 90 )وينهى عن الفحشاء والمنكر والبغي ( تتمة النحل 90 )لا يكلف الله نفسًا إلا وسعها ( البقرة 286 )لا تبخسوا الناس أشياءهم ( الأعراف 85، هود 85، الشعراء 183 ).ومن القواعد التي أضافها وهي مستمدة من الحديث :إن لجسمك عليك حقًا.إن لزوجك عليك حقًا.الخلاصة كتاب السباعي لولا ما كتبه في المبحثين المشار إليهما ما خالفه أحد. ومن أراد الوقوف على مناقشة هذين المبحثين، يمكنه مراجعة كتاب \" الملكية في الشريعة الإسلامية \" لعبد السلام العبادي. وبهذا فإن كتاب السباعي مفيد كلّه لمن يذهب مذهبه، ومفيد جلّه للجميع، ولا ينكر أثره على من كتبوا بعده في هذا الباب، مؤيدين أو معارضين، والحمد لله رب العالمين.",
  "genres": [],
  "author": "مصطفى السباعي",
  "average_rating": "3.36",
  "url": "https://www.goodreads.com/book/show/10812135"
}