{
  "title": "Finding Darwin's God: A Scientist's Search for Common Ground Between God and Evolution",
  "description": "Question: Who made us?Answer #1: God made us. Answer #2: Evolution made us. Which is it? What is the true answer to the age-old question of where we came from? Is it even possible to know for sure?In \"Finding Darwin's God,\" Kenneth R. Miller offers a surprising resolution to the evolutionism vs. creationism debate. A distinguished professor of biology at Brown University, Miller argues that the genuine world of science is far more interesting than either the scientific mainstream or its creationist critics have assumed. He begins by systematically demolishing the claims of evolution's most vocal critics, showing that Darwin's great insights continue to be valid, even in the rarefied worlds of biochemistry and molecular biology. As he puts it, evolution \"is the real thing, and so are we.\"Does this mean that evolution invalidates all worldviews that depend upon the spiritual? Does it demand logical agnosticism as the price of scientific consistency? And does it rigorously exclude belief in God?His answer, in each and every case, is a resounding No. Not, as he argues, because evolution is \"wrong.\" Far from it. The reason, as Miller shows, is that evolution is \"right.\"In this lively, fast-paced book, Miller offers a thoughtful, cutting-edge analysis of the key issues that seem to divide science and religion. As his narrative shows, the difficulties that evolution presents for Western religions are more apparent than real. Properly understood, evolution adds depth and meaning not only to a strictly scientific view of the world, but also to a spiritual one. Miller's resolution of the issues that seem to divide God from evolution will serve as a guide to anyone interested in the classic questions of ultimate meaning and human origins.",
  "genres": [
    "Science",
    "Religion",
    "Nonfiction",
    "Evolution",
    "Philosophy",
    "Biology",
    "Theology"
  ],
  "author": "Kenneth R. Miller",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/1081229.Finding_Darwin_s_God"
}