{
  "title": "The Winged Serpent",
  "description": "The Order A secret society of courageous women from across the vast Roman Empire, they are slaves and gladiators, noblewomen and priestesses, known to each other as the Keepers of the Oath. Trained in the arts of seduction and battle, deception and espionage, they are as deadly as they are beautiful, as dangerous as they are alluring. Their oath is to The Order, their duty is to The Empire.  The Winged Serpent  Aurora rose to fame and gained her freedom as a gladiatrix in the arena and is now a prominent member of The Order of Hesperia—a secret alliance of female spies and assassins. When she is given a very dangerous mission she believes it will be as easy as all her other assignments, but she is wrong.  Cyrus is one of the most legendary gladiators within The Empire, yet he remains a slave. When rumors spread of a plot to assassinate his master, Claudius Norbanus, Cyrus is enlisted by him as both his master’s spy and personal guard. If he succeeds in catching the assassin, Cyrus will gain his freedom.  When Aurora joins Claudius’ household as a gladiatorial slave, Cyrus is less than thrilled. The last thing he needs is a woman who matches his skills and stirs his passions. When Aurora enters Claudius’ household, the last thing she expects is to be drawn to Cyrus, a man who barely treats her with polite disdain. With every measure of her will, she denies the passion growing between them, masking it with animosity; because the last thing she needs is to desire a man such as Cyrus, who is honorable and loyal to his master.  Long days and nights spent in a ludus battling their attraction come to wear upon them until their resentment gives way to something more. Yet their affair is destined to meet a bitter end, for unbeknownst to them they are also enemies with cross purposes…",
  "genres": [
    "Historical Romance",
    "Historical",
    "Romance",
    "Interracial Romance",
    "Historical Fiction"
  ],
  "author": "Nadia Aidan",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/17654744-the-winged-serpent"
}