{
  "title": "Murderous Minds: Exploring the Criminal Psychopathic Brain: Neurological Imaging and the Manifestation of Evil",
  "description": "\"An informed, masterful account of the theory, research, controversies, and issues surrounding the construct of psychopathy . . . His balanced and scientifically sound coverage of the literature and issues are admirable and refreshing. Readers not familiar with the technology and procedures of neuroscience will appreciate the way in which Haycock makes the science understandable, interesting, and relevant. Highly recommended.\" ―Robert D. Hare, Ph.D., author of Without The Disturbing World of the Psychopaths Among Us and developer of the the Psychopathy Checklist-Revised. Is there a biological basis for evil? From neurological imaging to behavioral studies, Dean Haycock's account of the groundbreaking research reveals what scientists are learning about the psychopaths living among us.  How many times have you seen a murder on the news or on a TV show like Crime Scene Investigation, and said to yourself, \"How could someone do something like that?\" Today, neuroscientists are imaging, mapping, testing and dissecting the source of the worst behavior imaginable in the brains of the people who lack a psychopaths. Neuroscientist Dean Haycock examines the behavior of real life psychopaths and discusses how their actions can be explained in scientific terms, from research that literally looks inside their brains to understanding how psychopaths, without empathy but very goal-oriented, think and act the way they do. Some don’t commit crimes at all, but rather make use of their skills in the boardroom. But what does this mean for lawyers, judges, psychiatrists, victims and readers--for anyone who has ever wondered how some people can be so bad. Could your nine-year-old be a psychopath? What about your co-worker? The ability to recognize psychopaths using the scientific method has vast implications for society, and yet is still loaded with consequences. 8 page color insert",
  "genres": [
    "Psychology",
    "Nonfiction",
    "True Crime",
    "Science",
    "Crime",
    "Neuroscience",
    "Education"
  ],
  "author": "Dean Allen Haycock",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/17654700-murderous-minds"
}