{
  "title": "The Warrior State: Pakistan in the Contemporary World",
  "description": "Seemingly from its birth, Pakistan has teetered on the brink of becoming a failed state. Today, it ranks 133rd out of 148 countries in global competitiveness. Its economy is as dysfunctional as its political system is corrupt; both rely heavily on international aid for their existence. Taliban forces occupy 30 percent of the country. It possesses over a hundred nuclear weapons that could easily fall into terrorists' hands. Why, in an era when countries across the developing world are experiencing impressive economic growth and building democratic institutions, has Pakistan been such a conspicuous failure?In The Warrior State , noted international relations and South Asia scholar T.V. Paul untangles this fascinating riddle. Paul argues that the \"geostrategic curse\"--akin to the \"resource curse\" that plagues oil-rich autocracies--is at the root of Pakistan's unique inability to progress. Since its founding in 1947, Pakistan has been at the center of major geopolitical the US-Soviet rivalry, the conflict with India, and most recently the post 9/11 wars. No matter how ineffective the regime is, massive foreign aid keeps pouring in from major powers and their allies with a stake in the region. The reliability of such aid defuses any pressure on political elites to launch the far-reaching domestic reforms necessary to promote sustained growth, higher standards of living, and more stable democratic institutions. Paul shows that excessive war-making efforts have drained Pakistan's limited economic resources without making the country safer or more stable. Indeed, despite the regime'semphasis on security, the country continues to be beset by widespread violence and terrorism.In an age of transnational terrorism and nuclear proliferation, understanding Pakistan's development, particularly the negative effects of foreign aid and geopolitical centrality, is more important than ever. Painstakingly researched and brilliantly argued, The Warrior State tackles what may be the world's most dangerous powder keg and uncovers the true causes of Pakistan's enormously consequential failure.",
  "genres": [
    "Politics",
    "Pakistan",
    "Nonfiction",
    "Asia"
  ],
  "author": "T.V. Paul",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/17656534-the-warrior-state"
}