{
  "title": "Tibetan Buddhism: A Very Short Introduction",
  "description": "The Tibetan Buddhist tradition has known over thirteen centuries of continuous development. During that time, it has spread among the neighboring peoples - the Mongol, Himalayan, and Siberian peoples, Manchus and Chinese. At its height is has been practiced in regions as far west as the Volga river and to the east in Beijing. Its capacity for creative adaptation is demonstrated by its recent growth in Europe and America. At the same time, it is at the center of political contestation in ethnically Tibetan regions of China, while its best known exponent, the Dalai Lama, has become one of the most admired religious leaders in the world today. But what does this religion teach? Just what is the position of the Dalai Lama, and how will his succession be assured? Is it true that Tibetan Buddhism in entirely suppressed in China? Scholar Matthew Kapstein offers a brief account responding to these questions and more in this Very Short Introduction, in terms that are accessible to students, general readers, journalists, and others who are curious to learn the most essential features of Tibetan Buddhist history, teachings, and practice. About the Series: Oxford's Very Short Introductions series offers concise and original introductions to a wide range of subjects--from Islam to Sociology, Politics to Classics, Literary Theory to History, and Archaeology to the Bible. Not simply a textbook of definitions, each volume in this series provides trenchant and provocative--yet always balanced and complete--discussions of the central issues in a given discipline or field. Every Very Short Introduction gives a readable evolution of the subject in question, demonstrating how the subject has developed and how it has influenced society. Eventually, the series will encompass every major academic discipline, offering all students an accessible and abundant reference library. Whatever the area of study that one deems important or appealing, whatever the topic that fascinates the general reader, the Very Short Introductions series has a handy and affordable guide that will likely prove indispensable.",
  "genres": [
    "Religion",
    "Buddhism",
    "Nonfiction",
    "History",
    "Philosophy",
    "Spirituality",
    "Audiobook"
  ],
  "author": "Matthew T. Kapstein",
  "average_rating": "3.45",
  "url": "https://www.goodreads.com/book/show/17656561-tibetan-buddhism"
}