{
  "title": "Earth's Survivors Rising from The Ashes",
  "description": "What if the world ended tomorrow? What would you do? Would you be able to survive? The Earth's Survivors books follow a small group of men and women as they struggle to survive on a vastly changed earth, where the dead sometimes do not remain dead. Follow along as they rebuild their own lives as they rebuild their world. A great change was coming to the Earth. Catastrophe was about to change everything her people took for granted. It made some wish for death, but death was no longer a guarantee. For some death had become some other sort of life. A life they could not easily leave.Watertown, New York a night in March...Mike Collins kicked back for a night of Television. Life had begun to be the same for him every day. He had money. He had success, but something was still missing.Candace Loi was thinking about her new job as a dancer. It had taken so long to get to that point. How would it be? Would it solve all of her problems?Patty Johnson was wondering when her husband might come home and whether she even cared any longer. Ron Vincent was wondering where exactly life was taking him. Robert Dove had a dream about his people, Native Americans going back to the land. Living the way his ancestors had. Tom Evans Drove truck and tried not to think too much about where his life was taking him. Marcia Lydia George kept her thoughts on school. The world was endless. At seventeen how could it not be?The only thing these people had in common is that they all lived in the same small city in upstate New York. Before the week was out they would be thrust together in a struggle for survival. Before the month was out those that survived would begin to seek others who had lived through the catastrophe that had blighted the Earth. Looking for ways to stay alive... they would become Earth's Survivors...",
  "genres": [
    "Zombies"
  ],
  "author": "Wendell G. Sweet",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/17659040-earth-s-survivors-rising-from-the-ashes"
}