{
  "title": "La noche de Valia",
  "description": "http://www.monikazgustova.com/Tras largos años en el gulag, tratando de encontrar fuerzas en la solidaridad entre las presas, en la amistad, en el arte, en el trabajo, en la esperanza, cuando queda poco, poquísimo en lo que sustentarse.Valia retoma su vida, a su hija a la que tuvo que abandonar con dos años y reemprende la búsqueda de un amor truncado con un hombre que nunca entendió por qué Valia dejó de contestar a sus cartas. Valia había sido acusada injustamente de espionaje debido a su relación con Bill Rowgrave, un marine norteamericano. Con el fin de la guerra, la esperanza del reencuentro con Bill se ve trágicamente truncada por la acusación y arresto que la llevará a vivir el horror del confinamiento en el gulag.Tras un accidentado viaje en metro y ferrocarril, Zgustova localizó en el pueblo Shcherbinka a Valentina Grigórievna Íeleva: “Prácticamente impedida por la malnutrición y el frío intenso de los años de prisión, ni el dolor físico ni al edad conseguían apagar la enorme seducción y fuerza de su relato” recuerda. Después de preparar un te, Valentina le mostró fotos del amor de su vida, un soldado americano llamado Bill con el que tuvo una hija. “Llámeme Valia y escriba sobre mi vida, reina. Y sobre mi amor. Nos vimos poco y sin embargo pasamos medio siglo locamente enamorados…”.En ese medio siglo de penalidades transcurre “La noche de Valia”, testimonio novelado de esa mujer que en 1945 fue detenida por la NKVD y deportada al gulag acusada espionaje a favor de los americanos. Una noche, aclara Zgustova, “que concentra las vivencias de Valia y de las otras expresas con las que hablé”.Destinada a Salejard, ciudad del norte donde iban a parar los convictos en la época zarista y que Dostoievski describió en “Recuerdos de la casa de los muertos”, Valia constató que los campos estalinistas eran infinitamente peores que los del Zar: “Se sabe mucho de los lagers nazis\", corrobora Zgustova, “pero no se quiere recordar el gulag”Dramática y esperanzadora a la vez, una novela que es un testimonio emocionante acerca de la supervivencia del amor y la lucha por la vida.///////////// JRC BALCÁCER",
  "genres": [],
  "author": "Monika Zgustová",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/17662328-la-noche-de-valia"
}