{
  "title": "In Blue Poppy Fields",
  "description": "[image]In Blue Poppy Fields is a finalist in the Rainbow Awards Contest 2013 (LGBT Erotica category)This mesmerizing gay erotic paranormal fantasy belongs to Guardian Demon Series that will hold you prisoner to unforgettable stories of life, love and lust set amid an intriguing fantasy world. Dwynvil's unique storytelling will captivate you by vivid imagery, narratives told from multiple points of view and explorations of the darker side of D/s theme where safe words aren't used.A victim to another man's cruelty, talented and beautiful theater actor Adhemar Lebeau learned not to trust and not to love anybody but himself. Falsely accused of his master's murder, he has to accept assistance of mysterious Count Sanyi Arany to later discover his savior is a vampire. Forced both by a fatal illness and aftershocks of torture experienced during his unjust imprisonment, Adhemar agrees to the only possible cure. Rebirth. Healed in body but not in mind, he guards his independence, free will and heart. He is not able to give love, only the fulfillment of lust. Yet, satiation of sensuous longing is not enough for his Sire and he knows it. When an eerie malady strikes and seems to deplete Sanyi's life energy for unknown reasons, Adhemar understands his fears and agrees to keep a street boy, Reyach, as a pet for both of them in hope it will soothe the unspoken worries. Out of necessity he finds himself in the role of the only hunter in their company, and out of attachment he accepts the responsibility readily. Indulgence in blood and carnal pleasures fill his nights and vampiric powers give him the feeling of safety. Until the evening when he carelessly falls prey to High Demon Belial's plays that quickly turn into more than either of them has bargained for.In spite of a hard start, Adhemar feels burning urge deep in his heart and no matter how much he denies it, the cause of the strange sensation is a budding seed of affection brought to life by the insufferable demon. But letting Adhemar learn to love somebody other than him is not what seemingly innocent Reyach plans.",
  "genres": [
    "Fantasy",
    "BDSM",
    "M M Romance",
    "Paranormal Romance",
    "Vampires"
  ],
  "author": "Ciaran O. Dwynvil",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/17663606-in-blue-poppy-fields"
}