{
  "title": "This Is Between Us",
  "description": "Chronicling five years of a troubled romance, This Is Between Us offers an intimate view of one couple’s struggle—from the illicit beginnings of sexual obsession to the fragile architecture of a pieced-together family. Full of sweet moments, emotional time bombs, unexpected humor, and blunt sexuality, the daily life of this man and woman, both recently divorced, with children and baggage in tow, emerges in all of its complexity. In this utterly engrossing debut novel, Kevin Sampsell delivers a confessional tale of love between two resilient people who have staked their hearts on each other.\"This Is Between Us is an imperturbable, strange, melancholy (but never maudlin) piece of work. Kevin Sampsell straddles the line between candor and oversharing with an artful grace I found infectious.\"—Patrick deWitt, author of Ablutions and The Sisters Brothers\"This Is Between Us is an utterly unsentimental and deeply nuanced portrait of a relationship. With great delicacy and compassion, Kevin Sampsell unflinchingly examines love from every angle-- sacred and profane, transcendent and mundane. This is Between Us asserts that messy, terrifying, imperfect love is worth it, after all. After reading it, you'll be a believer. —Jillian Lauren, author of NY Times bestselling memoir Some Girls and Pretty\"Here is the quiet, funny, heartbreak truth of Real Love. Read it and weep.\"—Amelia Gray, author of THREATS\"In This Is Between Us Kevin Sampsell writes with grace and intimacy about the toughest subject of all—love—and manages to capture a relationship in its natural state: wry and wistful, strange and sexy, humming with desire, quaking with vulnerability.\"—Jess Walter, Beautiful Ruins \"This Is Between Us lets the reader under the covers of what it means to be in human relationships—not the lame-o story everyone so desperately wants to smoothly fit within, but the crumpled and stained and yet still beautiful version we actually live. Kevin Sampsell has written the pieces of our glorious failures and fleeting victories with such poignancy my head and my heart are laughing, bleeding, and above all, dreaming onward. You want this book more than facebook and chocolate. I love it with my whole body.\"—Lidia Yuknavitch, The Chronology of Water",
  "genres": [
    "Fiction",
    "Contemporary",
    "Romance",
    "Literature",
    "Adult Fiction",
    "Realistic Fiction",
    "Literary Fiction"
  ],
  "author": "Kevin Sampsell",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/17664801-this-is-between-us"
}