{
  "title": "The Devil of Whiskey Row",
  "description": "Forced by miserable circumstance to work in a gold rush brothel, Cora Underhill hates what her life has become. When a fire sweeps through her workplace, she welcomes death as an end to it all. But then Jake Diggory crashes through her window for an unwelcome rescue, offering her shelter and a paid position at his establishment. She accepts, in spite of Jake's fearsome reputation as 'The Devil Diggory', and soon sees another side to Jake--the firm but caring side of him which led his girls to name him 'Daddy Diggs'.Life at Daddy Diggs' is an entirely new experience for Cora. Jake has strict rules which he backs up with over the knee discipline, but he will not tolerate any mistreatment of his girls and he can go from playing beautiful music on a piano to defending them with his bare fists. The strangest thing of all, however, is the fact that every girl at Daddy Diggs' swears that Jake has never slept with her, or with any other woman for that matter, since his fiancée's death back in Ireland fifteen years ago. Cora attempts to emulate the other prostitutes at Daddy Diggs', who enjoy making money, holding power over men and even the act of sex, but she still finds no pleasure in the company of men--until the day she inadvertently arouses the passion of The Devil Diggory. His fierce lovemaking thaws some frozen part of her, but it seems Jake is only attracted to her because she resembles his dead fiancée. Confused by his new feelings for Cora and guilt over his broken vow of celibacy, Jake pushes Cora away. Can he come to terms with his past and claim Cora for his own, or will his grief keep them apart forever?Publisher's Note: The Devil of Whiskey Row is an erotic romance novel that includes both consensual and non-consensual spankings, anal play, exhibitionism, graphic sexual scenes, and more. If such material offends you, please don't buy this book.",
  "genres": [
    "Erotica",
    "Historical Romance",
    "Westerns",
    "BDSM",
    "Historical",
    "Romance",
    "Erotic Romance"
  ],
  "author": "Renee Rose",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/17665477-the-devil-of-whiskey-row"
}