{
  "title": "A Riveting Affair",
  "description": "Beauty and the Clockwork BeastRose Verney wants to fulfill her father’s dying request: to complete construction of the teleportation device he designed. Knowing just who can help her succeed, she seeks out Sebastian Cavendish, her father’s brilliant former student.Sebastian hasn’t left his home since he returned from the Civil War. He's a broken man, his prosthetics a reminder of the terrible destruction his inventions brought to the battlefield. He wants nothing to do with Rose and her father's masterpiece, but when she barges into his abandoned lab and begins construction, it’s everything he can do to resist getting involved. Especially when she charms her way into his monstrous heart.Demon ExpressProfessor Maisy Clark, professional demon hunter, is on the trail of an evil scientist responsible for the deaths of hundreds. Julian is worse than the monsters he creates, but he's also obsessed with Maisy and willing to kill anyone who gets too close to her. Just when she thinks she has Julian cornered, the sexy marshall Jake Calloway insists the investigation is his, and everything goes to hell. Maisy came to Texas to corner the scientist whose macabre experiments have taken so many lives, and Calloway is just another distraction she doesn’t need. Julian is her responsibility, one she’s not about to share. Even if Calloway can help, Julian will know Maisy is falling for the marshall, and she's not willing to risk his life.The Clockwork BrideWhen engineer Aida Mulvaney attends a masquerade ball at the home of a staunch Luddite earl with a personal vendetta against her father’s company, she doesn’t expect to end the night married to the earl’s son Julian Capshaw, a brilliant engineer in his own right. The marriage will allow both of them to pursue their love of science, without interfering parents and ridiculous social stigmas. Though they escape to the Continent to start new lives, Julian’s father will have none of his heir’s disobedience. Before long, a marriage begun for the sake of convenience becomes a union of passion, but will it survive the machinations of an earl determined to destroy everything they love?",
  "genres": [
    "Steampunk",
    "Romance",
    "Novella",
    "Historical",
    "Adventure"
  ],
  "author": "Candace Havens",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/17665677-a-riveting-affair"
}