{
  "title": "X MARKS THE DRESS: A Registry",
  "description": "X Marks the Dress takes marriage as its most explicit subject, one that is both public and private, volatile and validating, a concept and its corollary institution that signify liberation for some and oppression for others. However, instead of offering us two separate voices on the subject, Darling and Guess provide a potpourri of perspectives concerning what marriage has meant and might mean in the early 21st century. What they avoid, adroitly, is any proselytizing as to what marriage should mean. --Lambda Literary ReviewIn X Marks the Dress, Darling & Guess weave a narrative of love and identity that unpacks itself again and again. Like beautifully wrought Matryoshka dolls, these poems explore the depth and wonder of language as well as its inability to truly define any one thing. Lines and images reappear in new and surprising ways—footnotes, appendices, definitions—that stunningly illustrate exactly how slippery love can be.Erin Elizabeth Smith, author of The Naming of StraysX Marks the Dress: A Registry by Kristina Marie Darling & Carol Guess presents the scintillating variables of time and its complex philosophical relationship with experiential space. These poems spark an incandescent fire of imagination in an enormous tonal range. Positioned on both sides of the mirror at once, watching reflections of ever-changing backgrounds of relationships and marriage. Like dreaming about having a dream this book cajole, beckon and posit in transcendent, expressive, and provocative words. Ultimately, the words never fill the void. Instead, they take us deeper and deeper down to a dark and disorienting place that continually excites the reader with its possibilities. This is an excellent work from two wonderful poets. Geoffrey Gatza, author of House of Forgetting & Secrets of My Prison HouseIn Kristina Marie Darling and Carol Guess's collaborative book, X Marks the Dress: A Registry, the reader receives a delicious catalog of wants. The cohabitation of idealized domestic bliss and the wild and unwilling spirit of individuality split the difference. The newlyweds divide the baby in half. The unspoken gets footnoted. The remnants get erased and placed in the appendices. In glorious sequences of riffs, flirtations, recombinations, and dances, Darling and Guess's collaboration intoxicates. Though the wedding china may get smashed against the trees, and though the stiletto heels may get broken, the moments in these lyrical vignettes will be long enshrined \"on a red satin pillow.\" Oliver de la Paz, Author of Requiem for the OrchardThese poems are arch, eyeing the cake. They undo us as we enter their rooms, our lace caught on the door knob, our mouths dripping generations of nameless desire. Each poem is a strand that keeps us tied to the marriage ritual, yet the reader is left diced up and served, simmered in pink, skeptical of the heart yet wanting to eat another's. \"I love you more because I love you both\" is the song we dance to, the cadence that questions what a bond is, and between whom, and whether it is possible to love at all (when love is a mirror in a room of mirrors). Emily Kendal Frey, Author of The Grief Performance",
  "genres": [
    "Poetry"
  ],
  "author": "Kristina Marie Darling",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/17665744-x-marks-the-dress"
}