{
  "title": "Drunk on Sports",
  "description": "Tim Cowlishaw never considered himself an alcoholic. By the time he reached his 50th birthday his career was everything he'd ever hoped it would be. With a sports column in a major paper, winning APSE's Best Sports Columnist in Texas four times, and a daily spot on ESPN's highly successful show, \"Around the Horn,\" Cowlishaw had pursued and conquered nearly everything he ever desired professionally. However, the pursuit of that success nearly cost him his life.DRUNK ON SPORTS is more than simply a memoir by one of America's most well-known sportswriters. Behind his happy-go-lucky public persona was a man with a considerable (but well-disguised) drinking problem. For years, Cowlishaw believed that his ability to drink with the best of them helped in his development of sources and pursuit of stories and, unfortunately, he was right. Among others, the relationship he built while sitting on a barstool next to Cowboys Coach Jimmy Johnson allowed him to get where other reporters couldn't. As all hell broke loose between Johnson and Cowboys owner Jerry Jones in 1994, Cowlishaw was right next to Coach Johnson every step (and beer) along the way. In DRUNK ON SPORTS, Cowlishaw recounts first-hand stories never told and quotes never shared from the bizarre breakup of one of the NFL's most successful dynasties.As he points out in the introduction, this is not an anti-drinking book. Cowlishaw loved alcohol for 35 years. If anything, this is a how-not-to book more than a how-to book. Along the way, Cowlishaw takes readers inside some of the biggest stories in sports. He joined ESPN in 2002 as a regular on Around the Horn and discusses life behind the scenes at the Worldwide Leader candidly and at length. Cowlishaw writes and talks and, at times, drinks his way into the sports world's fast lane - what else would you call getting hammered on vodka with Denny Hamlin at the Daytona 500 - before realizing the only way to continue was to call a halt to the partying.The story of his rise and fall is more insightful and humorous than it is preachy as Cowlishaw examines some of the flawed decisions he made throughout his lifetime in sports. DRUNK ON SPORTS is a cautionary yet entertaining tale of never before told stories featuring some of the most recognizable personalities in sports, and if it causes some readers to reexamine their own lives, then it will have gone above and beyond its intended purpose.",
  "genres": [
    "Sports",
    "Nonfiction",
    "Autobiography"
  ],
  "author": "Tim Cowlishaw",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/17666501-drunk-on-sports"
}