{
  "title": "Picture Perfect",
  "description": "Fashion design major Cat Mitchell has a closet full of gorgeous clothes - and not a single thing fits. After two years of runway modeling for easy cash, an accident shattered her lower leg bone and her self-esteem in just one swift fall. Ten months of no exercise, prescription steroids, comfort eating and yoga pants meant returning to campus as a size twelve instead of her former size two. When her gorgeous long-time friend with benefits sees her for the first time after her accident and snubs her in front of all her friends, Cat’s self-image hits rock bottom. Her sorority sisters all insist that she looks gorgeous, but all Cat sees is the roll of her stomach when she sits down, or the dimpling at the back of her thighs that wasn't there last year. Cat’s therapist prescribes something radical to stop the downward spiral - nude modeling for a nearby college's human form drawing classes. When Cat faces her fears and bares it all for the class, she realizes that she's posing naked in front the most gorgeous, buffest guy she's ever seen in her life. He asks her out after the class, and after one steamy night together, Cat's absolutely smitten.Nate’s pretty close to perfect – he takes Cat rock climbing when he discovers that it makes her feel strong and becomes a great chef after he learns that the perfect pesto sauce makes her swoon. Cat starts to feel like her old self again - confident and beautiful - as long as Nate's around. Even when he discourages her from entering the Real Woman Project, a design competition for plus-sized apparel, she reasons that he's just trying to prevent old body image wounds from splitting wide open again.But when Cat goes home with Nate for Thanksgiving, she discovers something shocking from his recent past that proves that he hasn’t always been so encouraging of women of all shapes and sizes. Cat has no idea what to think, but she does know one thing - this might destroy their relationship before it's even had a chance to get off the ground. Before Cat can figure out whether the real Nate is the sensitive, adoring guy she fell in love with, or an undercover asshole, she'll have to finally feel comfortable in her own skin - even if it means leaving him forever.(This book contains sex and adult language.)",
  "genres": [
    "New Adult",
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "College",
    "Erotica",
    "Young Adult"
  ],
  "author": "Alessandra Thomas",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/17667605-picture-perfect"
}