{
  "title": "Wayward Angels",
  "description": "Wayward Angels, (where legend meets reality.)Delve into the story of a little girl who lived in a dark eerie house in the neighborhood with a wicked man and ferocious dog named Buster. Now, ten years later, having lived through the revolving door of the foster care system, the little girl, Rebecca, has come to accept Tikkun Olam, a state facility for emotionally challenged adolescents also known as the crazy kids, her home. With daily doses of medication, weekly therapy sessions, and constant teenage bickering, Rebecca finds solitude in her room away from the drama, especially on Tuesdays and Thursdays. That's when the therapy dogs visit the kids, better known as dog days. Institutional living is predictable until 11-year old Tanisha is admitted to Tikkun and is assigned as Rebecca's new roommate. Not only is the new girl overly chatty, believes in fairytales, and has the most massive collection of stuffed animal toys Rebecca has ever seen, but Tanisha treats them as if they were alive and she talks to someone named, Victor—an invisible, 6-foot tall, blue-eyed, angel. And if that's not weird enough, Tanisha is assigned the newest member of the therapy dog team, a rescued dog named Peanut, who for some unknown reason is infatuated with Rebecca. Oh, and Tanisha thinks he's an angel too—a fur angel. Living on the edge where fairytale legends meet reality, the two girls discover a magical token from the past that takes them on a fantastical healing journey where Rebecca must face her childhood fears. With the help of an eccentric little girl and a scruffy, wire-haired mutt, Rebecca’s protective wall that she’d built since that harrowing day when she was five years old starts to crumble and a new life begins to emerge. Sometimes fairytale endings aren't all that impossible.",
  "genres": [],
  "author": "Cynthia L. Enuton",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/17667450-wayward-angels"
}