{
  "title": "Summon Dorn",
  "description": "12 Warrior Archangels are to be sent to Earth to stop their Fallen Brethren from setting off Armageddon prematurely.Dorn, the Aquamarine Warrior, is the second archangel in line to come to Earth. Thanks to Kassern's lack of self-control, Dorn is forced to marry. Selecting a nun as his wife will guarantee maturity and humility, thereby ensuring quick success. With his infallible research and persuasive aquamarine qualities, Dorn will find his ideal couple in record time and become the unique warrior needed to fight Satan's abominations. But pairing a naïve and klutzy nurse with a handsome librarian with a dark past is more complex than Dorn expects. And worse, his nun is hardly the paragon of virtue he expected. Having Kassern witness his miscalculations is bad enough, but requiring his aid to finish what should be a quick and simple task is a humiliation Dorn will not soon forget. About Archangels Creed:Twelve Archangels. Twelve couples. Twelve months. Can they create the Holy Warriors needed to prevent the demon-spawned abominations from destroying the world? Let the Summoning Begin. Satan has found a loophole in the rules that govern his battle against Good. The Archangel Uriel sends twelve elite Warrior Archangels to Earth on a mission to even the odds against the demon-spawned abominations being produced. Each Archangel has one month to find two people, unite them in love, and use their union's power to create the Holy Warriors needed to defend the world against Satan's unholy creations. And they have to do it while staying out of the demons' clutches. But the mission isn't so simple when inheriting Humanity comes with challenges beyond the Archangels' training, and every milestone in the relationships affect the team's strength. Who knew headaches and PMS could be such a pain in the ass?",
  "genres": [
    "Paranormal",
    "Romance",
    "Erotica",
    "Science Fiction",
    "Fantasy",
    "Erotic Romance",
    "Angels"
  ],
  "author": "Kenra Daniels",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/17667945-summon-dorn"
}