{
  "title": "The Moses Conspiracy",
  "description": "A trip to post-terrorized Washington, D.C. in 2025 and a buggy accident in Bird-in-Hand, PA set in motion events that expose a diabolical plan to destroy the Christian community. Ellie and John Zimmerman find themselves embroiled in a life-threatening investigation, fighting a shadowy enemy.Convinced it's now safe to visit D.C., Ellie and her firstborn, 8-year-old Peter, travel to the nation's capital. Both mother and child make an effort to enjoy the sights, but they're unprepared for the challenges they face. Her nightmares come true when she and Peter are separated.Back home, John witnesses a neighbor's buggy accident. The suspicious circumstances and law enforcement's refusal to take them seriously prompt him to take on the role of detective. He and a tenacious reporter band together to find out what's happening in Bird-in-Hand.Extended family squabbles erupt when John's sister, Annaliese, faces off with Ellie for blowing her D.C. experiences out of proportion. She'd rather ignore the warnings than deal with the growing danger.John and Ellie can't decide whether her trip and his involvement with the accident were such a good idea. People are getting hurt, and their own family receives ominous warnings. Turning back the clock is not an option, but going forward could initiate more violence.The small community is shattered when the unthinkable occurs. Will family, friends, and neighbors band together or allow fear to prevent them from taking action?Caught between strained family relationships and a faceless enemy, the couple rely on God for wisdom and protection. Little do they know that He's working on their behalf each step of the way.The scabs of a past tragedy get ripped open, and the truth of their second child's death is revealed. While they may expose the culprits, will they survive the heartache it brings?",
  "genres": [
    "Christian",
    "Christian Fiction"
  ],
  "author": "Susan J. Reinhardt",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/17668114-the-moses-conspiracy"
}