{
  "title": "Heart of the Billionaire ~ Sam",
  "description": "Heart Of The Billionaire (The Billionaire’s Obsession ~ Sam)GENRE: Adult Contemporary Erotic RomanceAuthor Note: This novel is the complete story of Sam and Maddie, but reading The Billionaire’s Obsession – The Complete Collection (Simon and Kara’s story) first is highly recommended to enhance your reading pleasure.Sam and Maddie are here!Billionaire Sam Hudson has pretty much lived his life with no apologies because he tries never to do anything that he’s sorry about…except for what he had done in the past to Dr. Madeline Reynolds. Many years and regrets later, Sam meets up with Maddie again by chance; his brother Simon is marrying Maddie’s best friend and the two of them are forced to be civil. But Sam wants to be more than polite, and he wants another chance to make things right, so he offers Maddie a bold proposition, an offer he knows she’ll have a very hard time declining even though she hates him.Dr. Madeline Reynolds adores her best friend Kara and her fiancé Simon, but being forced into the company of Sam Hudson, because they are both in Simon and Kara’s wedding, is pure torture. She’s hated Sam for years, but when he offers her a bargain, something near and dear to her heart, she’s torn between her dislike for the man and the offer of something she’s always desperately wanted. Once, Sam Hudson nearly destroyed her, but Maddie discovers that sometimes things aren’t always what they appear to be. Is Sam really a devious heart-breaker, or is there something more to him beneath the surface?Can two people with so many years of hurt between them learn to trust each other again?Please note: This is an erotic romance and not appropriate for YA readers. The book contains graphic sex, language and situations not appropriate for YA readers.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Erotica",
    "Erotic Romance",
    "Adult",
    "Audiobook"
  ],
  "author": "J.S. Scott",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/17668947-heart-of-the-billionaire-sam"
}