{
  "title": "Stormy Weather",
  "description": "When a ferocious hurricane rips through southern Florida, the con artists and carpetbaggers waste no time in swarming over the disaster area.Among the predators are Edie Marsh, an entrepreneurial young woman whose scheme to sleep with a Palm Beach Kennedy has fizzled, freezing her to concoct a colossal insurance rip-off; Lester Maddox Parsons, a murderous ex-con whose violent encounter with a game warden has left him with the fitting name of “Snapper”; and Avila, a crooked building inspector-turned-roofer who dabbles somewhat unsuccessfully in the occult. Caught in the middle are Max and Bonnie Lamb, newlyweds torn in wildly different directions by the storm. It is Max’s fateful decision to abort their Disney World honeymoon and race to Dade County to see the terrible devastation. Armed with a video camera, the ambitious young advertising executive can’t wait to show his hurricane tapes to his buddies back in New York. Over Bonnie’s objections, Max eagerly sets out through the rubble, debris and mayhem—and promptly vanishes. The only clue to his whereabouts: a runaway monkey. The only person who can help Bonnie’s search: a mysterious young man with a tranquilizer gun and a roomful of human skulls. But there’s also a man called Skink who has devoted his very strange existence to saving Florida from the kinds of people blown in by the hurricane. It is he, crazed and determined, who prowls the swath of the storm and forever changes the lives of Max, Bonnie, Edie and the others.Their paths—tangled before they even know it—come together in a novel that continues the hilarious and scathing muckraking tradition that Carl Hiaasen has so mercilessly made his own. In Stormy Weather, there is no calm eye.",
  "genres": [
    "Fiction",
    "Humor",
    "Mystery",
    "Crime",
    "Thriller",
    "Audiobook",
    "Comedy"
  ],
  "author": "Carl Hiaasen",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/1081532.Stormy_Weather"
}