{
  "title": "Сибирский редактор",
  "description": "Небольшая повесть о российском литературном закулисье, о проблемах провинции (автор ни много ни мало предлагает «отредактировать» Россию, удалив из нее всю восточную часть), об известных людях (в персонажах «маленького романа» легко угадываются писатели Виктор Астафьев, Валентин Распутин, Роман Солнцев, физик-сиделец Валентин Данилов), выставленная в свое время на ресурсе со свободной публикацией, неожиданно обрела известность в сети, получила тысячи откликов, стала предметом заинтересованных обсуждений. Редчайший случай — на формально неизданную вещь выходит рецензия в официальном издании:«Помогает ли эта книга? Как-то раз, совсем по другому случаю, калининградский поэт и переводчик Игорь Белов написал мне: «Кто сказал, что книга должна делать человека лучше? Лучше кого? И что такое хороший человек, уж не оксюморон ли? Мы не в тёмном царстве живём, но в сонном, и не лучи света тут нужны, а прожектора, пусть их ослепительный свет и гарантирует неминуемую пальбу». Действительно. Главная задача искусства, в нашем случае мы говорим о литературе, сдвинуть что-то внутри у читателя, чтобы раздался щелчок внутри, заставить его чувствовать, думать. Это у автора отлично получилось.» (Игорь Кузнецов, «Цинизм и романтика Антона Нечаева», «Литературная Россия» № 34-35 20.08.2010)Маленький роман «Сибирский редактор» сравнивают и с «99 франков» Фредерика Бегбедера, и с книгой памяти «Алмазный мой венец» Валентина Катаева; фрагмент в переводе на румынский язык печатается в журнале «La plic»; однако большинство отзывов все же негативные: Антона Нечаева называют «говнюком», «одержимым бесами», а роман «ужасной гадостью». В 2011 году поэт и художник из Улан-Удэ Аркадий Перенов создает серию иллюстраций к «Сибирскому редактору», вошедших в электронное издание. В 2013 году автор дополняет и исправляет произведение, вводя в него ряд новых деталей. Издательство Animedia публикуют последнюю версию текста.",
  "genres": [
    "Russia"
  ],
  "author": "Антон Нечаев",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/17669324"
}