{
  "title": "Getting Over Your Ovaries: How to Make 'The Change of Life' Your Bitch",
  "description": "Long before Angelina Jolie made headlines with news of her double mastectomy and other surgeries related to her genetic mutation for Breast & Ovarian Cancer, Lisa Jey Davis was heralding the cry for at-risk women everywhere to be screened for the BRCA genes. She'd undergone similar procedures just two years prior and had appeared on The Doctors television show talking about it. She'd been interviewed by KTLA in Los Angeles, and by major newspapers and radio shows across the country to spread the word. But when Lisa Jey Davis went “sans ovaries” for medical reasons at the young age of 46, she was shocked (to say the least) to learn of the changes her body would undergo as a result. The fact she would need to replenish her body’s hormones was the extent of the information dolled out by her docs. She had no idea her decision meant menopause or that her body would think she was entering old age! She certainly didn't imagine what her surgeries could mean for her lifestyle or her emotions (and the well being of anyone around her). The idea she could be in danger of becoming a card-carrying member of the Red Hat Society or worse yet, the Pill Box Clan was truly the furthest thing from her mind. She found herself asking “Why didn’t anyone ever tell me about this?”Though she was too young to undergo this “Change of Life” and it occurred as a result of surgery… and though the sex education in parochial school, from her parents and others in her life hadn’t warned her of the coming bodily changes that could (and do) make grown men cry, she wasn’t about to let anything slow her down.After looking in the mirror one too many times and seeing more fine lines than usual, changes to her hair and a ‘monthly bloat’ that wouldn’t go away, it was time to make this thing otherwise known as menopause her BITCH and live to tell (and write) about it.What she ended up with was a highly entertaining and inspiring journey of discovery, some hilarious observations and a gaggle of tips to share with every woman in every city. Whether entering menopause, or simply trying to survive someone who is, “Orchdis: The New Black” will serve up the laughs as well as a good basic education about the cycles of life… how to LIVE despite them all.",
  "genres": [],
  "author": "Lisa Jey Davis",
  "average_rating": "4.85",
  "url": "https://www.goodreads.com/book/show/17670014-getting-over-your-ovaries"
}