{
  "title": "The Playboy's Proposition",
  "description": "Note: Original cover edition for ASIN# B00BZWLARYWho says a girl can’t have it all?Nonnie Crawford agrees to spend five nights with Michael Weston, five nights exploring her newly-discovered fascination with BDSM and her craving to submit herself, sexually, to a powerful, dominant man.She wants to please the charming playboy, but Michael soon proves himself to be a stern taskmaster, pushing her further, faster than she prepared herself to go.Even while she is drawn more tightly into Michael’s sexual hold, she cannot forget Gibson Reeves, the man who initially set her on this sensual journey. He invades her dreams, as inscrutable and commanding in her fantasies as ever he was in real life.Soon enough, Nonnie will learn secrets about both men, realize that what seemed a simple decision, was not so simple after all.And she will have to discover the answer to a difficult question before it’s too late. How far is too far?*Warning: adult material. Only purchase if it is legal for you to do so. This book contains explicit language and scenes of a sexual nature, including exhibitionism, M/f/M, bondage and consensual domination and submission, which some readers may find objectionable.*~~~~~~~~~~~~~~~~~~~~“The Power to Please,” is a planned four-part series of novels chronicling Nonnie Crawford’s journey into the alluring but sometimes dangerous realm of BDSM.After ending her disastrous ten-year marriage, Nonnie finds herself irresistibly drawn by the pull of passion. She yearns to submit herself, sexually, to a powerful and dominant male.Two masterful Doms vie for Nonnie’s submission, the enigmatic Businessman and the charming Playboy. Both men want to guide her sensual journey and lead her to places she never imagined she might go.Knowing who to trust is always a challenge, and adding in the heady seduction of novel desires only escalates the odds of making a mistake. Nonnie’s choices prove the difference between perfect bliss and utter ruin.In the end, she must answer the most critical question of all -- in a relationship that’s all about the exchange of power, who holds the ultimate power to please?",
  "genres": [
    "BDSM",
    "Erotica",
    "Romance",
    "Erotic Romance",
    "M F Romance",
    "Fiction"
  ],
  "author": "Deena Ward",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/17670680-the-playboy-s-proposition"
}