{
  "title": "Counter Assault",
  "description": "Readers call the D-BOYS “ a high-octane adrenaline-fueled action thrill-ride ” … “ pure action ” … “ one of the best action thrillers of this year (or any year for that matter) ” … “ a riveting, fast paced classic!! ” … “ The Best Techno Military Thriller I have read! ” … “ Up there with Clancy and W.E.B. Griffin ” … “ Awesome! ” … “ Gripping ” … “ Edge of your seat action ” … “ What a wild ride!!! I simply could not put this book down ” … “ has a real humanity and philosophical side as well ” … “ spectacular in so many ways ” … “ hi-tech and action in one well-rounded explosive thriller… ”They are the most capable, committed, and indispensable counter-terrorist operators in the worldThey have no rivals anywhere for skill, speed, ferocity, intelligence, flexibility, and sheer resolveNOW ONE OF THEM IS THE ENEMYAlpha team leader Sergeant Major Eric Rheinhardt is retiring from the Unit – hanging up his guns and jockeying a desk at the Pentagon. But just when he thought he was out, a ghost has emerged from his past (along with a lost love), dredging up a secret shame and past-due debt. Much worse, his old mentor and now nemesis Rod “the God” Tucker has turned up on the payroll of the messianic Iranian mullahs – training their proxy fighters in Hamas and Hizbullah, purchasing cyberwar talent and fissile material from the Chinese… and laying the groundwork for the fall of the Third Temple, the modern state of Israel.The explosive collision of these two legendary operators will ultimately embroil Israeli special forces, Chinese hackers, squadrons of D-boys, Tier-1 SEAL teams, CIA paras, Kurdish Peshmerga fighters, hyper-skilled jihadis, and Iranian Revolutionary Guards – all in a no-holds-barred street fight for survival. Before it's over, the battlespace will be littered with armed robots, stealth drones, a nuclear-cruise-missile-armed submarine, a hijacked Soviet warship, shrieking helicopter crashes, radiological rocket attacks, hacker duels to the death (literally), vendettas, betrayals, reversals, feints, diversions, double crosses, disasters, assassination attempts, one-in-a-million shots at victory, and unstoppable kill-crazy rampages.Get ready for COUNTER-ASSAULT – where the action, tactics, high stakes, and blasts of sheer adrenaline assault off the page, and do not relent.[The D-Boys will return in 2021 in CLOSE QUARTERS BATTLE – the third salvo in MSF's series of high-concept, high-tech special operations military adventure novels.]",
  "genres": [],
  "author": "Michael Stephen Fuchs",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/17671247-counter-assault"
}