{
  "title": "On His Terms",
  "description": "Book two in the Mastered Series.It was business only… Chelsea Barton is terrible at the whole submission thing, and she wants to snare the Dom of her dreams. She seeks out the renowned trainer Master Alexander. Alex has his hands full with Chelsea, especially when he realises he doesn’t want to turn her over to another man…Damn, damn, and double damn. This was so not supposed to happen.Chelsea Barton always gets what she wants, and she wants the up and coming rocker Evan C to accept her as his sub. But her performance always disappoints him.Determined to have her way, she begs Master Alexander Monahan to train her.Alex has given up training submissives, and no matter what, he would not work with someone as bold, headstrong, and stubborn as Chelsea.But there’s something about her that intrigues and impresses him, an enthusiasm that is missing from his too-dull life. Under very strict guidelines he agrees. She has to try her best. She has to submit uncomplainingly to his punishments. And there’s a two week obligation, after which they will part ways. Being a trainer is a very different relationship than a D/s, and despite his intentions to remain aloof, he starts to care deeply for the headstrong Chelsea.Chelsea unhesitatingly agrees to Master Alexander’s rules, after all, he’s going to give her the skills she needs to get what she wants. But, damn it, the longer she trains with him, the more she is attracted to his rugged good look as well as to his firm, but relentless ways. She reminds herself of her goals, but that becomes more difficult every day.For Alex, falling for a sub who will belong to another man was never part of the deal.Reader Advisory: This book contains scenes of anal sex.Reader Advisory: This book can be read as a standalone, but is also part of the Mastered series.",
  "genres": [
    "BDSM",
    "Erotica",
    "Romance",
    "Contemporary",
    "Erotic Romance",
    "Contemporary Romance",
    "M F Romance"
  ],
  "author": "Sierra Cartwright",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/17671482-on-his-terms"
}