{
  "title": "Letters from Wishing Rock: A novel with recipes",
  "description": "Letters from Wishing Rock (a novel with recipes) is the first book in the Wishing Rock series.Letters from Wishing Rock is a 2013 B.R.A.G. Medallion Honoree. This signifies that this book is well worth a reader's time and money!Awarded the Awesome Indies Seal of ApprovalLetters from Wishing Rock is the first novel in the Wishing Rock series, followed by The Wishing Rock Theory of Life and The Tides of Wishing Rock.What would happen if everyone in town lived in the same building? Ruby Parker is about to find out. Her fiancé has left her and she needs a fresh start, so she moves to Wishing Rock, Washington, a small town on Dogwinkle Island in the waters near Seattle, where she meets a quirky cast of characters who quickly become family. Letters between the neighbors and their friends chronicle the twists and turns of the characters' daily lives. There's Jake, a handsome and charming first-year medical student who catches Ruby's eye from the start, despite his being over a decade younger. Millie, a Wishing Rock resident for forty years, runs the town's library, post office, newsletter and grocery store, knows everyone and everything, and shares the history of the area with her playful wit. World traveler and psychic Alexandra bestows insight and wisdom with humor and compassion, and Ruby's Gran heads to the United Kingdom, heeding her own advice to seize the day. And then there's Ed; if something fun is going on, the grandson of the town's founding father is likely at the center of it. Amidst all this action, Ruby manages to find passion and companionship, but will she be able to open her heart to love?Online dating, a group trip to Scotland, a discussion about dogwinkles, a fateful hoedown, and friendships old and new, all interspersed with recipes from some of the town's best cooks, make Wishing Rock come alive in this delightful and insightful look at life, love, relationships, and community.",
  "genres": [
    "Fiction",
    "Humor",
    "Chick Lit",
    "Contemporary"
  ],
  "author": "Pam Stucky",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/10816171-letters-from-wishing-rock"
}