{
  "title": "Waking",
  "description": "Twist has never left London, until today. Now he's traveling on an airship--with a crew that insists they're not pirates--on his way to find the clockwork princess because he's the only one who can fix her.In true Neo-Victorian style, Clockwork Twist is set in a lush and vibrant world where things are as you might expect in 1878. That is, of course, if fantastic creatures like djinn, faeries, kitsunes and vampires were commonplace. An increasing number of people are being born with supernatural senses, called Sights. While airship tourism is sweeping the globe, air-piracy is also on the rise. Twist is among the Sighted, but his Sight is unusual. While others might be able to see and hear over great distances, find anything they can imagine anywhere in the world, or even recognize every type of flower by scent alone, Twist's Sight shows him only damage. Whenever he touches a broken clock or machine, he can instantly understand the damage and can fix it easily. If he touches a person, even for a moment, his mind fills with a terrible vision of whatever trauma or pain once broke them. Naturally, he's chosen a solitary existence and shuns all human contact. Unfortunately, thanks to his seclusion, Twist is also unfamiliar with everything beyond his own clock shop, hidden away on a quiet and ever-drizzly London street. When a treasure hunter arrives at his door with proof that they have found the fabled clockwork princess--Twist's favorite old fairy tale--it's up to Twist alone to bring her back to life. The continuing series of Clockwork Twist begins with book one: Waking. Join Twist as he embarks on his first adventure, and find out first hand if he can actually survive it.",
  "genres": [
    "Steampunk",
    "Fantasy",
    "Science Fiction",
    "Amazon",
    "Adventure",
    "Action",
    "Science Fiction Fantasy"
  ],
  "author": "Emily  Thompson",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/17673180-waking"
}