{
  "title": "Fields of Grace: Faith, Friendship, and the Day I Nearly Lost Everything",
  "description": "A remarkable true story of hope, survival, and faith lost and found . . .On May 11, 2012, a small plane carrying five young adults en route to a Christian youth rally plummeted into a Kansas field. Only two survived the crash: twenty-seven-year-old ex-marine Austin Anderson, who would die the next morning from extensive burns, and his friend Hannah Luce, the twenty-two-year-old daughter of the renowned youth evangelist Ron Luce, cofounder and CEO of Teen Mania Ministries. In the moments after the crash, Hannah was injured and frightened, but together, she and Austin, who appeared miraculously out of the rubble, managed to reach a deserted road, where a passing driver found them and called for help.For the first time, Hannah tells her story, not just of what happened in the plane that day and of her long road to recovery, but of how the crash changed everything she thought she knew about friendship, family, and faith.On the surface, Hannah was the dutiful daughter of Evangelical royalty, with a degree from Oral Roberts University and a staff position in her father's ministry. Yet, in the years leading up to the crash, she had begun to investigate and question her early religious convictions. How much of what she'd been taught was really true? Did she still believe any of it? But as Hannah recounts the transformative aftermath of the crash, Austin's strength as he took care of her even as his own body failed, the miracle of the stranger who rescued them, and memories of her beloved friend Garrett, who died in the crash, she sees reasons to hope in the most unlikely places. On that day marked by fire and pain and tragedy, Hannah was shaken to her core and soon realized she had to find a way to deal with her scars, inside and out. From out of the darkness, she discovered a new kind of faith, one that allowed her to embrace a life of purpose and possibility while honoring the memory of those she loved most.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Memoir",
    "Christian",
    "Faith",
    "Autobiography",
    "Religion"
  ],
  "author": "Hannah Luce",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/17673268-fields-of-grace"
}