{
  "title": "The Loneliest Alpha",
  "description": "One look will change their lives forever.Lingerie designer Alicia Clarkson just had to open her stupid mouth. Now thanks to trying to defend a fellow pack mate, Alicia’s been blindfolded, tied up, and carted off to the new alpha of the Oregon pack—Gavin MacKellen. However, the blindfold doesn’t come off so soon as Gavin reveals he’s searching for a mate. But Alicia’s curiosity gets fired up when Gavin refuses to reveal his face to her. Just what happened to him? He talks to her from shadowy corners and behind closed doors. The man is as illusive as a squirrely fox. But Alicia doesn’t play games and the quiet spoken, hoarse voiced alpha doesn’t stand a chance against her. They settle on an agreement, thirty days for them to get to know each other because that’s the only way this cowboy alpha will have it.Gavin MacKellen needs a mate. But he knows no good woman would ever want to look at his face after the incident he suffered. After one look at Alicia Clarkson all his plans fly out the window. The woman’s beauty has stunned him damn near speechless. She torments his thoughts and Gavin finds himself yearning to know everything about her. He admires her creativity and intelligence, the cool way she handles herself in stressful situations. Most of all, he aches deep in his chest to taste her lips. Those beautiful sweet lips, but in order to kiss her without showing her what a monster he was, he has to get creative. A relationship forms and as love threatens to grow between them Gavin struggles to cope with his physical appearance in the face of the beautiful Alicia. Will she be the one to stand in the face of a monster and accept or will she turn her back on him as everyone else has?",
  "genres": [
    "Paranormal",
    "Romance",
    "Paranormal Romance",
    "Shapeshifters",
    "Werewolves",
    "Fantasy",
    "Erotica"
  ],
  "author": "T.A. Grey",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/17673399-the-loneliest-alpha"
}