{
  "title": "Grains of Gold: Tales of a Cosmopolitan Traveler",
  "description": "In 1941, philosopher and poet Gendun Chopel (1903–51) sent a large manuscript by ship, train, and yak across mountains and deserts to his homeland in the northeastern corner of Tibet. He would follow it five years later, returning to his native land after twelve years in India and Sri Lanka. But he did not receive the welcome he he was arrested by the government of the regent of the young Dalai Lama on trumped-up charges of treason. He emerged from prison three years later a broken man and died soon after. Gendun Chopel was a prolific writer during his short life. Yet he considered that manuscript, which he titled Grains of Gold , to be his life’s work, one to delight his compatriots with tales of an ancient Indian and Tibetan past, while alerting them to the wonders and dangers of the strikingly modern land abutting Tibet’s southern border, the British colony of India. Now available for the first time in English, Grains of Gold is a unique compendium of South Asian and Tibetan culture that combines travelogue, drawings, history, and ethnography. Gendun Chopel describes the world he discovered in South Asia, from the ruins of the sacred sites of Buddhism to the Sanskrit classics he learned to read in the original. He is also sharply, often humorously critical of the Tibetan love of the fantastic, bursting one myth after another and finding fault with the accounts of earlier Tibetan pilgrims. Exploring a wide range of cultures and religions central to the history of the region, Gendun Chopel is eager to describe all the new knowledge he gathered in his travels to his Buddhist audience in Tibet. At once the account of the experiences of a tragic figure in Tibetan history and the work of an extraordinary scholar, Grains of Gold is an accessible, compelling work animated by a sense of discovery of both a distant past and a strange present.",
  "genres": [
    "Nonfiction",
    "Travel",
    "History",
    "Buddhism",
    "Asia",
    "India"
  ],
  "author": "Gendün Chöphel",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/17674345-grains-of-gold"
}