{
  "title": "The Rise & Fall of the Scandamerican Domestic: Stories",
  "description": "Christopher Merkner is a Shirley Jackson for the contemporary Midwest, where the ties of family and community intersect darkly with suburban American life. In these stories, an enraged village gaslights unsuspecting vacationers and a young man delays a impending confession, fondling the nostrils of his mother's pet pig. Sharp and uneasy, for these inheritors of tradition, that which binds them most closely—offering stability and identity and comfort—are precisely the qualities that set them back, pull them down, burden, limit, and ruin them.\"Merkner’s first short story collection provides a voyeuristic vantage point on fractured lives. He has the striking ability to turn the familiar into the uncanny and morph the comfortable into the weird, and, clearly,he’s at home in that strange realm. In most of the stories, we witness lives at the moment an individual’s identity begins to fray, sometimes slowly and sometimes swiftly. These changes are both painful and thought provoking to witness through the book’s unrelenting first-person perspective. At times Merkner’s prose evokes unease, but more often it encourages a chuckle, and his plot twists will leave even the most seasoned reader surprised. In each story, even those that only run for three pages, the tension mounts deliciously, many times with no foreseeable relief. The true beauty of these tales lies in their delicate endings, which manage to both tie up loose ends and leave everything hanging, so that they are simultaneously satisfying and mysterious. Such complexity makes great reading for lovers of short fiction, and for all who wish to witness a new master at work.\"—\nBooklist\nChristopher Merkner teaches creative writing at West Chester University. His work has appeared in Black Warrior Review, Cincinnati Review, Fairy Tale Review, Gettysburg Review, New Orleans Review, and Best American Mystery Stories. He and his wife and kids live in West Chester, Pennsylvania.",
  "genres": [
    "Short Stories",
    "Short Story Collection",
    "Contemporary"
  ],
  "author": "Christopher Merkner",
  "average_rating": "3.54",
  "url": "https://www.goodreads.com/book/show/17675203-the-rise-fall-of-the-scandamerican-domestic"
}