{
  "title": "My So-Called Ruined Life",
  "description": "\"The first book in Bishop's Tate McCoy series will have readers eager to hear more from her pragmatic, sarcastic, yet sweet 16-year-old heroine. Tate's ability to compartmentalize her fears and emotions, her attempts to preserve her optimism through small gestures, and the tension and mystery surrounding the crime make Bishop's debut an introspective page-turner.\"—\nPublishers Weekly\n\"Yet another tale of a plucky girl who overcomes the obstacles—but this one floats.\"—\nKirkus Reviews\n\"What a fine book! My So-Called Ruined Life takes you on a hard walk through a difficult subject, yet is full of sweetness and humor. Tate McCoy is a keeper, and so is her best friend, Kale. I felt like I was right there during their conversations and excursions, and found Tate’s reflections on her life and painful situation deeply meaningful. Tate is a kid who prevails, her humanity fully intact.\" —Kathleen Jeffrie Johnson, author of Target, and The Parallel Universe of Liars\"Readers will fall in love with brave and funny Tate McCoy in this powerful and heartfelt debut about human fallibility. One of the truest characters I've had the good luck to discover in YA recently.\"—Beth Ann Bauman, author of Jersey Angel and Rosie and Skate“Melanie Bishop is not afraid to address tough issues—from unspeakable violence to dysfunctional family relationships—with realistic details and hit-you-in-the-gut emotion. The plot gracefully unfolds to a stunning climax that forces the characters—and readers—to reconsider the nature of love, justice, and forgiveness.”—Christine Seifert, author of The PredictedsTate McCoy has not spoken to her alcoholic mother in two years when her mom is murdered. If this were not enough to endure at age sixteen, Tate has to face the fact that her father is the prime suspect. Convinced of his innocence, and of her own resilience, she sets out to prove her life is not ruined. Amid this life-shattering tragedy, Tate takes up swimming and finds solace in her best friend Kale, volunteer work, the great outdoors, and a new crush. But after discovering a horrible secret, Tate questions everything she thought she knew about her parents. This is the first book in the Tate McCoy series.Melanie Bishop writes fiction, nonfiction, and screenplays, and has taught all of these subjects for the past twenty-one years at Prescott College in Arizona where she is founding editor of Alligator Juniper, Prescott's award-winning national literary magazine. Bishop divides her time between Prescott, Arizona, and Carmel, California.",
  "genres": [
    "Young Adult",
    "Contemporary"
  ],
  "author": "Melanie Bishop",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/17675281-my-so-called-ruined-life"
}