{
  "title": "Extra Credit Epidemic",
  "description": "Taffy Snackerge is a high school senior who likes doing things her way. Gifted in science, she'd rather analyze infectious diseases and pick up a girl for the occasional fling than deal with her boring schoolwork or the high school social scene.When she notices a surprising number of cases of food poisoning in the area, she's eager to dig in and find the cause. To help with the investigation, Taffy approaches the only teacher she's ever liked and respected, Van Brenner. As a former state epidemiologist, Van is uniquely qualified to help Taffy get the data and insights that she needs.However, Van has one Taffy needs to work with two other students on the case, and she doesn't get to pick them. As the cases start to multiply and the underfunded state health department continues to drag their feet, Taffy knows that it's up to her to find out what's making so many people sick.But can she learn to work with her two teammates - including a beautiful, hyper-organized girl who's president of the Young Attachés Club and an emotional overeater who can't go out in public without his lucha libre mask - while still retaining her autonomy? Can the team fend off a snooping assistant principal and step up when the adults let them down? And can they locate the source of the outbreak before it reaches epidemic proportions?If you enjoyed Extra Credit Epidemic, be sure to search for these other titles by Nina - One Ghost Per Serving - Eric Snackerge, and the ghost that he's possessed by, must get to the bottom of a supernatural infestation.- Last Condo Board of the Apocalypse - the debut novel that started it all, with talking ferrets, fallen angels, and the high stakes world of post-apocalyptic snack foods.- Last Donut Shop of the Apocalypse - the madness takes a more fatty, sugary turn as Kelly Driscoll must prevent the apocalypse... AGAIN.- Danger in Cat World - a homicide detective must solve the murder of an heiress while dealing with the dozens of cats mysteriously materializing in his house.",
  "genres": [
    "LGBT",
    "Young Adult",
    "Lesbian",
    "Mystery",
    "Contemporary"
  ],
  "author": "Nina Post",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/17675503-extra-credit-epidemic"
}