{
  "title": "La famiglia Karnowski",
  "description": "Bastano a volte poche pagine per accorgersi di avere fra le mani un grande romanzo, e per cogliere quel timbro puro che ne fa un classico. È ciò che accade con La famiglia Karnowski di Israel J. Singer, maestro dimenticato, rimasto per troppo tempo nel cono d'ombra del più celebre fratello minore Isaac B., Premio Nobel per la letteratura. La pubblicazione di questo libro, fra i memorabili del secolo scorso, ha quindi il sapore di un evento, e di un risarcimento: finalmente, il lettore potrà immergersi nel grandioso affresco familiare in cui si snoda, attraverso tre generazioni e tre paesi – Polonia, Germania e America –, la saga dei Karnowski. Che comincia con David, il capostipite, il quale all'alba del Novecento lascia lo shtetl polacco in cui è nato, ai suoi occhi emblema dell'oscurantismo, per dirigersi alla volta di Berlino, forte del suo tedesco impeccabile e ispirato dal principio secondo il quale bisogna «essere ebrei in casa e uomini in strada». Il figlio Georg, divenuto un apprezzato medico e sposato a una gentile, incarnerà il vertice del percorso di integrazione e ascesa sociale dei Karnowski – percorso che imboccherà però la fatale parabola discendente con il nipote: lacerato dal disprezzo di sé, Jegor, capovolgendo il razzismo nazista in cui è cresciuto, porterà alle estreme conseguenze, in una New York straniante e nemica, la contraddizione che innerva l'intera storia familiare. Con una sapiente orchestrazione che è insieme un crescendo e un inabissarsi, Singer non solo ci regala pagine d'inconsueta bellezza ma getta anche uno sguardo chiaroveggente sulla situazione degli ebrei nel­l'Europa dei suoi anni, rivelando quelle virtù profetiche che, quasi loro malgrado, solo i veri scrittori possiedono.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Classics",
    "Jewish",
    "Historical",
    "Poland",
    "The United States Of America"
  ],
  "author": "Israel J. Singer",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/17676033-la-famiglia-karnowski"
}