{
  "title": "Four Spirits",
  "description": "From the acclaimed author of the national bestseller Ahab's Wife comes an inspiring, brilliantly rendered new novel of the awakening conscience of the South and of an entire nation.Written with the same scope and emotional depth as her previous award-winning novel, Four Spirits is set in Sena Jeter Naslund's home city of Birmingham, Alabama, a city that in the 1960s was known as Bombingham. Naslund brings to life this tumultuous time, weaving together the lives of blacks and whites, civil rights advocates and racists, and the events of peaceful protest and violent repression, to create a tapestry of American social transformation.Stella Silver is an idealistic, young white college student brought up by her genteel, mannered aunts. She first witnesses the events of the freedom movement from a safe distance but, along with her friend Cat Cartwright, is soon drawn into the mounting conflagration. Stella's and Cat's lives are forever altered by their new friendships with other committed freedom fighters.A student at a black college, Christine Taylor is inspired to action by the examples of Rosa Parks, Martin Luther King Jr., and the Reverend Fred Shuttlesworth. She courageously struggles to balance her family responsibilities, education, and work with the passions and dangers of the demonstrations. Her friend Gloria Callahan, a gifted young cellist and descendant of a runaway slave, tries to move beyond her personal shyness and family coziness to enter a wider circle, including blacks and whites, men and women, all involved with the protests. Lionel Parrish, teacher, preacher, and peddler of funeral insurance, battles his own demons of lust and self-preservation, while New York activist Jonathan Green gives up a promising career as a pianist to work for racial justice in the South.These characters all add their voices to the chorus that makes up this symphony of innocent children and the mythic elderly, the devoutly religious and the skeptical humanist, the wealthy and the poor, the city and the country. Poignant and evocative, rich in historical detail, and filled with the humanity that is the hallmark of Naslund's fiction, Four Spirits is a compelling tale that transcends tragedy and evokes redemptive triumph.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Book Club",
    "Historical",
    "Race",
    "Southern",
    "Literary Fiction"
  ],
  "author": "Sena Jeter Naslund",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/100965.Four_Spirits"
}