{
  "title": "A Cairo Anthology: Two Hundred Years of Travel Writing",
  "description": "Cairo has for centuries been recognized as one of the great cities of the world, and this anthology brings together travelers' descriptions of it over the centuries-from the comments of Herodotus to those of Julian Huxley. Perhaps more than anything else in the city, the wonderful mosques with their tall minarets have been admired and written about over the centuries by such travelers as the Frenchman Pierre Loti, the economist Harriet Martineau, and the travel writer Michael Haag. This anthology gathers together the excitement of arriving in the great city either up the Nile or across the desert, the experience of the crowded-but courteous-streets and colorful bazaars with their passing processions. With the travelers we enter the hotels, climb to the historic Citadel, and look out towards-and then visit-the Pyramids and Sphinx on the other side the Nile.Cairo, like all cities, has changed. One is now more likely to be pushed aside by a motorbike or taxi than by a donkey or camel, but the beauty of history is still there. One can visit a hammam, buy crafts in the bazaars, and, with this book in hand, more fully appreciate the experience.The travelers went beyond the city too, to Heliopolis, and the Pyramids and Sphinx-those vast monuments that are in reality always larger and more extraordinary than one can believe. We can no longer clamber up the Pyramids, so the descriptions of Edward Lane and other travelers doing just that in a bygone age are even more precious. About the series: The elegant, pocket-sized volumes in the AUC Press Anthology series feature the writings and observations of travel writers and diarists through the centuries. Vivid and evocative travelers' accounts of some of the world's great cities and regions are enhanced by the exquisite vintage design in small hardback format that make the books ideal gift books as well as perfect travel companions. Designed on cream paper stock and beautifully illustrated with line drawings and archival photographs.",
  "genres": [
    "History"
  ],
  "author": "Deborah Manley",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/17678415-a-cairo-anthology"
}