{
  "title": "The Butterfly & the Snail",
  "description": "A tenor's voice, passionate and pure, draws shy Rebecca Butler into the Studentenheim's crowded social room. Finished singing, Khalil Khoury notices her sitting alone, joins her, then notices no one else. Georgetown University's 1964 summer program opens; Salzburg's magic begins.\"The Butterfly & The Snail\" interweaves several heartfelt encounters, creating a fabric of love and intimacy that transforms their lives forever. On one outing, Rebecca loses her footing and tumbles down Untersberg Mountain. Khalil risks his life-and almost loses it-to save Rebecca from falling off the peak. Two days later, Rebecca discovers a newborn butterfly and then spies a snail picking its way up the path. These creatures come to symbolize this couple's extraordinary relationship. Relaxing on Gaisberg's hillside, Rebecca reveals the turmoil she's had to overcome to gain inner peace. Yet, she confesses, her heart's desire-love-has eluded her. When Khalil reacts with sympathy and compassion, she desires that powerful, mystical love radiating from within him. She asks, \"How can I love like you?\" His answer binds them together forever.Six weeks later, the program ends. As Rebecca says good-bye, Khalil hands her an envelope: \"Not to be opened until out of Salzburg.\" Is this his auf Wiedersehen or the beginning of a deeper relationship? Discover if their magic continues beyond Salzburg.\"I personally wanted to congratulate you for submitting one of the top proposals in the contest ... this is no small feat given more than 300 proposals were received and yours rose to the top.\"  Christine Kloser, 2012 Transformational Author Writing Contest Sponsor\"I am reading your book and I love it. I really cried on the chapter about your father. My mother died from cervical cancer and had a lot of agony and pain also. So, I really connected with you and your family. It was beautifully written. You are really good!\" Marilyn Hughes Gaston, M.D., Co-founder, Prime Time Sister Circles(r); Former US Assistant Surgeon General",
  "genres": [
    "Contemporary"
  ],
  "author": "Mary Sullivan Esseff",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/17685692-the-butterfly-the-snail"
}