{
  "title": "The Slaves Shall Serve: Meditations on Liberty",
  "description": "A battle is now raging for the soul of America, and it is of critical interest to the survival of true freedom worldwide. Conceived in liberty and watered by the blood of patriots, this nation of still-free men and women totters on the brink of surrenduring its fundamental values of individual responsibility and self determination.On the domestic side we exchange our privacy and personal autonomy for the chimerical security of a cradle-to-grave society; internationally we abdicate our ability to act autonomously in our national interest, and in accordance with our most cherished principles.Why are we squandering the precious jewels of the greatest political experiment in human history? How, and by whom, are we being seduced into ceding that which we should treasure above all else—our most fundamental liberties? Finally: what actions can thoughtful citizens take to protect and regain their personal freedoms?In his newest book, James Wasserman examines these urgent questions, presenting a cogent, intelligent, and often-alarming picture of our nation's situation both nationally and globally. This revealing collection of essays, the product of ten years of study and contemplation, is supplemented with lengthy appendices of the primary reference materials that underlie the author's bold assertion.Readers will fearlessly explore the modern plague of collectivism, especially as embodied by the United Nations; learn that true political, historical, and spiritual roots of the September 11th attacks; revisit the Waco massacre without averting their glance; witness the cynical manipulations of the civilian disarmament movement; and be invited to contemplate the role of transcendent values in the battle to preserve and maintain personal freedoms. In terms that are lucid, passionate, balanced, scholarly, and often witty, the author shared his idealism, his outrage and his hope.",
  "genres": [
    "Thelema",
    "Politics",
    "Philosophy"
  ],
  "author": "James Wasserman",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/1081786.The_Slaves_Shall_Serve"
}