{
  "title": "Embrace of the Daimon: Healing through the Subtle Energy Body/ Jungian Psychology & the Dark Feminine",
  "description": "This is a nonfiction book. Highly recommended for those attracted to Jungian & archetypal depth psychology, mind/body healing, shadow work, and women's issues. Also for students of waking dreams, the imaginal and subtle body realms, and for therapists and healers. Although the book has attracted a dedicated following, be prepared: some of the material, as one reviewer put it is \"not for the faint of heart!\" * * * * *Have you wrestled with uncanny, nightmarish imagery in dreams or waking? Life crises, trauma, deep meditation, prayer or inquiry can unleash surprisingly compelling yet scary, even revolting, imagery and related feelings. With few maps to help navigate this terrain, we are tempted to deny or repress our experience. Precipitated by a descent into the dark recesses of her own psyche, Sandra Dennis explores the eruption of strange, wild, compelling characters from the unconscious that she calls 'daimons.' The Greeks understood the daimon as the intermediary between gods and humans, the guardian spirit assigned at birth that connects heaven and earth. These messengers come as agents of inner transformation. When we welcome them with understanding and compassion, they expand our consciousness and connect us with healing qualities of strength, compassion and vision. This book leads us to this growing edge of the psyche and invites our curiosity and caring. It charts a course of radical acceptance of experience - no matter how painful or difficult - as absolutely necessary for our well-being and the well-being of the planet. Sandra Dennis brings a spiritual context to what most disturbs us. She offers a simple method to navigate these alarming images and anxieties. Instead of treating them as perversions to banish, we are encouraged to embrace their primal power becoming more intelligent, loving and whole in the process. \"Embrace of the Daimon\" can help: Calm your concerns by understanding the role of these daimonic images in the larger context of growth to wholeness, or individuation. Find the courage to explore these states of mind with more intimate, compassionate interest. Learn to navigate your way through the unusual sensations that often accompany breakthroughs of the daimonic. Expand your understanding of Jungian theory, with regard to the little explored mind/body connection role in personal development. \"Embrace of the Daimon\" offers a rare look at this inner landscape and will help make your own trip, or that of those you are helping, less harrowing. Reviewers have called 'Embrace of the Daimon' -- \"a pioneering work, a courageous and important book,\" \"a significant contribution to the study of altered states of consciousness,\" \"original and profound,\" \"a rare documentation of unconscious processes,\"\"a work that advances our understanding of a descending spirituality tremendously,\" \"eloquently descriptive,\" \"deeply moving,\" re-imagines the work of integrating shadow to find beauty and dignity,\" \"bridges the worlds of the scholar and the visionary\" and \"takes us to the radical edge of Jungian psychology today.\" One reader commented, \"It is the only contemporary firsthand account of the day-to-day practice of mystical depth psychology that I have come across. I find it a very practical guide to my own inner and psychic realm journeys.\" Another called it \"the most honest work on the psychoid/imaginal realms since Corbin...the engagement with the archetypal invasions, more like Jung in the Red Book than the scholarly Corbin.\"",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Spirituality"
  ],
  "author": "Sandra Lee Dennis",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/17691687-embrace-of-the-daimon"
}