{
  "title": "The Bread We Eat in Dreams",
  "description": "Subterranean Press proudly presents a major new collection by one of the brightest stars in the literary firmament. Catherynne M. Valente, the New York Times bestselling author of The Girl Who Circumnavigated Fairyland in a Ship of Her Own Making and other acclaimed novels, now brings readers a treasure trove of stories and poems in The Bread We Eat in Dreams.In the Locus Award-winning novelette “White Lines on a Green Field,” an old story plays out against a high school backdrop as Coyote is quarterback and king for a season. A girl named Mallow embarks on an adventure of memorable and magical politicks in “The Girl Who Ruled Fairyland—For a Little While.” The award-winning, tour de force novella “Silently and Very Fast” is an ancient epic set in a far-flung future, the intimate autobiography of an evolving A.I. And in the title story, the history of a New England town and that of an outcast demon are irrevocably linked.The thirty-five pieces collected here explore an extraordinary breadth of styles and genres, as Valente presents readers with something fresh and evocative on every page. From noir to Native American myth, from folklore to the final frontier, each tale showcases Valente’s eloquence and originality.Table of Contents:The ConsultantWhite Lines on a Green FieldThe Bread We Eat in DreamsThe Melancholy of MechagirlA Voice Like a HoleThe Girl Who Ruled Fairyland—For a Little WhileHow to Raise a MinotaurThe Shoot-out at Burnt Corn Ranch Over the Bride of the WorldMouse KoanThe Blueberry Queen of Wiscasset In the Future When All’s WellFade to WhiteAeromausRed EnginesThe Wolves of BrooklynOne Breath, One StrokeKallistiThe WeddingThe Secret of Being a CowboyTwenty-Five Facts About Santa ClausWe Without Us Were ShadowsThe Red GirlAquaman and the Duality of Self/Other, America, 1985The RoomSilently and Very FastWhat the Dragon Said: A Love Story",
  "genres": [
    "Fantasy",
    "Short Stories",
    "Poetry",
    "Fiction",
    "Science Fiction",
    "Anthologies",
    "Magical Realism"
  ],
  "author": "Catherynne M. Valente",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/17694319-the-bread-we-eat-in-dreams"
}