{
  "title": "Play by Play: Baseball, Radio and Life in the Last Chance League",
  "description": "Following nearly twenty-five years as a prominent voice at National Public Radio, after being shelled, rocketed, bombed and held captive in the desert as one of their top foreign correspondents, Neal Conan decided to pursue a lifelong dream—to become, of all things, a baseball announcer. And that’s what he did, specifically with the Aberdeen Arsenal, a franchise of the independent Atlantic League. Not the majors, alas, but it afforded him a true opportunity to use the surge of conflicting emotions that we refer to as midlife crisis to rethink what he’d done and what he was doing. It also allowed Neal to marry his two lifelong passions—radio and baseball—and gave him the chance to return to the grassroots of each. He decided to put the fun and challenge back into things he had become bored with.Play by Play is Conan’s diary of the 2000 season—Aberdeen’s and his. From his position in the announcer’s booth, on the team bus and in hotels and motels along the way, we meet the coaches, fans and, of course, the players. And in this league, most of the players are on the way out rather than up but are happy to still be getting paid to play ball. It is indeed a league of last chances, but for most everyone involved, it’s better to be spending time playing ball than not. Some are resigned to the fact that they’ll never make the majors—or, in a few cases, get back there—while others hang on to a dream that everybody but them sees as foolhardy. Either way, they play for the love of the game, and very little else.Through the lens of the minor leagues, Conan captures the soul of a great sport and reveals the ways men face age, come to terms with their limitations and ambitions and look for new challenges when they’re no longer young phenoms. In the end, Conan’s experiences, the things he’s learned, help him refocus his own life and reappreciate the things he has, giving him direction of where he needs to go. (But that’s not to say he wouldn’t take a call from George Steinbrenner to be the voice of the Yankees.)",
  "genres": [
    "Baseball",
    "Sports",
    "Memoir",
    "Biography",
    "Nonfiction"
  ],
  "author": "Neal Conan",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/1081827.Play_by_Play"
}