{
  "title": "Ryland",
  "description": "A wet washcloth was handed to Alistair and he slapped it none too gently on the back of her neck. She tried to lift her head and he pushed her back down and glared at his brother. He had to take his anger out on someone, and he was the perfect target for it. “You had to scare her off on the first day, didn’t you? You just couldn’t stand the fact that you didn’t know that Colette wouldn’t work for you and that I’d found you suitable help in the meantime.” His brother started to speak, but Bronwyn lifted her head again and he shoved her back down. “You should be horse whipped.”The shrill whistle made him leap from Bronwyn. He’d heard men whistle like that, but never a woman. He smiled at her when she stood. Damn, but this girl had spirit.“You will not shove me around like an old, unwanted piece of furniture.”Ryland told her to sit down and shut up and she stepped close enough to him to touch.“And I am not a dog to be ordered about like one either.” She stomped to the elevator again.Bronwyn didn’t need this crap and she certainly didn’t need it from a bunch of rich pricks that seemed to be out to make her life worst than it already was. She stepped off the elevator and headed for the door. No way was she working for these idiots.Ryland tried his best to tell the woman what she was going to do but she thwarted him at every turn. When he found her living in one of his abandoned warehouse set for demolition he nearly went through the roof. Until he saw her in action, using powers that he’d never seen before. Then nothing could keep him from her.She was his mate, someone he was sworn to protect. But it didn’t work out that way. She was the protector and he was man enough to realize it, and none too soon because the men after her were playing for keeps and Ryland was afraid his streak, his family of weretigers were going to need all the help they could get from her.",
  "genres": [
    "Shapeshifters",
    "Paranormal Romance",
    "Paranormal",
    "Romance",
    "Fantasy",
    "Audiobook"
  ],
  "author": "Kathi S. Barton",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/17699171-ryland"
}