{
  "title": "A Warm Place to Call Home",
  "description": "As far as he call tell, Frederick is a demon. \"Born\" in Virginia in the early 1980s, he hasn't a clue where he came from or why, but his irresistible desire to occupy a human body seems pretty demony to him. Plus, a number of a-hole priests have tried to exorcise him from some of his favorite bodies. Yeah, it works, but not for the reasons they think. It's just super annoying being yelled at in Latin, and sometimes the priests are way into it, and their mouths get all frothy and spittle droplets shoot out and land on your cheek or in your eye. It's gross. So f--k it. He leaves. \"Enjoy the drooly meat sack.\" What those morons don't realize is that once Frederick takes over a body, the previous occupant's consciousness and memories are forever erased. It's an inevitable side effect that gives Frederick pause when switching bodies, but not so much as to actually halt his ongoing enjoyment of human lives. Departures are not so much \"Good lord, what have I done?\" moments, but more like \"Aww. How sad.\" Frowny face emoji, not crying face emoji. You get the point. In various bodies, he explores the world for decades, aimless, sampling cultures and experiencing life through the perspectives of males and females, young and old, rich and poor. Prostitution proves especially enjoyable for a while, but he eventually finds thievery and pickpocketing also offer a delightful rush. Of course, it's crucial for one to be able to jump ship when caught stealing or when things start getting itchy down there, so he wouldn't recommend said lifestyles to the average fellow or … gal. Is it gal? Seems like gal goes with guy.Burnt out on the wild life, Frederick decides he'll return to America, explore the mystery of his origin, and maybe even find someone tolerable enough to love for more than a month. In his \"hometown\" of Leesburg, Virginia, his mission bears fruit much faster than expected. He meets an enchanting creature named Melanie, and her boyfriend Joseph looks like a perfect fit. Frederick isn't a fan of maintaining a bodies' prior relationships (it requires lengthy, boring pre-research to avoid detection) but, as you know, he's loose with the phrase \"f--k it.\" Frederick takes Joseph's body and everything works out perfectly! Except for Joseph's job as a US Postal Inspector. And Joseph's relationship with his brother and family. And, well, a few little problems with Melanie … and OKAY FINE, everything goes to utter shit! But you're going to want to read how all this goes down. I mean, look at all those awards and reviews down there! Unless you're deeply offended by naughty words and a couple brief, awkward descriptions of semi-hot demon-possessed-human–on–human sex, you're pretty much guaranteed to fall in love with Frederick. So says Frederick. } ; )",
  "genres": [
    "Fantasy",
    "Paranormal",
    "Fiction",
    "Urban Fantasy",
    "Horror",
    "Science Fiction Fantasy",
    "Audiobook"
  ],
  "author": "Michael Siemsen",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/17699127-a-warm-place-to-call-home"
}