{
  "title": "Divine Towels",
  "description": "Reading the Gospels and the Acts of the Apostles is electrifying for they remind people what God can do when people trust Jesus completely. The word YES is a simple three-letter word, but it can unleash power and change the dynamics of the world. Divine Towels shows that when we trust God entirely, the seed of faith will germinate and extraordinary wonders beyond anything imaginable are possible.Divine Towels is ultimately the answer to Beau’s prayer. Beau grew up and did everything that society said would make him a happy man. He went to college, earned his MBA, and took a job in corporate America.Beau should be living the life, but he is miserable. He has always wanted to serve others and perform merciful acts. Sitting behind a computer eight hours a day is not for him, and he is frustrated!One day, Beau has had enough and tells the Lord exactly how he feels. Much to his surprise, he hears, “My son, I call you to be a towel boy.” Beau knows God speaks to people and reveals His plan in these revelations. Never having experienced anything like this before, Beau wonders if he is hallucinating. The idea of being a towel boy seems absurd; nevertheless, he plans to find about what this riddle means. Eventually, because Beau cannot figure it out, he asks the Lord for clarification.Jesus soon explains He wants Beau and his mother, Jessica, to carry out a very special mission for Him: open a nonprofit store called Divine Towels and spend their days washing people’s feet. At Divine Towels, people who have faith are healed of their ailments, become empowered by the Holy Spirit to perform mighty works, and often walk away feeling an overwhelming peace.Not only do “the healed” think differently, but they also have the uncanny ability to find unique solutions to complex problems. Every facet of their lives is transformed! Nothing bothers them and they are always ready to take on a new challenge.Everything goes smoothly until the doctors as well as the hospitals in the area realize that Divine Towels has all but ruined their businesses and livelihoods. Because of Divine Towels, they are not earning enough money to live life the way they have become accustomed. They have to do something. Initially, a group of doctors try to reason with Beau and Jessica, imploring them to stop. They even try unsuccessfully to buy them off. Ultimately, they devise and execute a plan to obliterate Divine Towels. Just as the Pharisees’ plan to crucify Jesus backfired, doctors’ plan ends up having an unintended consequence. When people find out the doctors tried to obliterate Divine Towels, they devise their own plan not only to rebuild Divine Towels but also to start franchises throughout the nation.",
  "genres": [],
  "author": "Beau Jason McGlynn",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/17699480-divine-towels"
}