{
  "title": "Jax Marlin: Triple the Action",
  "description": "NOVELLA COLLECTION. Collecting parts 2, 3, and 4 of the TO CATCH A MARLIN saga by T.K. Toppin. This collection includes: PURGED IN FIRE, THE MARLIN STRIKES AGAIN, and THE NECROMANCER OF THE AVON. Follow the futuristic exploits of beautiful but deadly vigilante Jax Marlin and her dogged pursuer, Special Inspector Michael Pedroni.PURGED IN FIRE (#2): *Be careful what you wish for...*When every wish you desire is granted by the benevolent AI, be careful to ask for only what you can handle. The vigilante, Jax Marlin, find herself back in the abysmal depths of space on a pleasure dome sinfully named the Ring of Fire. Hot on her heels, the copper, the dogged Special Inspector Michael Pedroni.Jax’s desire is to stop a cold sadist in his tracks, doling out the kind of punishment he gives his victims. And Pedroni’s wish? To be able to capture the elusive Marlin—but he would settle for a kiss.THE MARLIN STRIKES AGAIN (#3): *You get what you deserve...*Beneath the shiny exterior of a quaint university town, danger and sordid deeds lurk. The vigilante, Jax Marlin, sets her sights on a pedophile and gives him all that he deserves. His deeds so filthy, for once, Jax is glad her Special Inspector is not around to lay witness. Some things are better handled privately.THE NECROMANCER OF THE AVON (#4): *Can you kill a ghost?*On board the Avon, a derelict battlecruiser, lurks a hideous danger—a phantom menace that revels in the gore of death. Special Inspector Michael Pedroni is once again taken into the depth of space to solve the mystery of a gruesome massacre. The vigilante, Jax Marlin, is also on board—to capture her prey, the Necromancer Killer.Vigilante and Inspector lay differences aside to aid each other, but while death for punishment is on Jax’s mind, Pedroni has other ideas. Can Pedroni allow her to kill the killer? Will Jax show mercy and stay her hand? And can they both come to terms with that stolen kiss in the darkened shadows of a crawlspace?",
  "genres": [],
  "author": "T.K. Toppin",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/17700818-jax-marlin"
}