{
  "title": "A Perfect Mess",
  "description": "I know what you did last summer.Aubree Walker, the perfect girl most likely to succeed, is sure there’s only one person who knows what she did.Booker Outlaw, one of the three Outlaw brothers—all identical, all gorgeous, all from the wrong side of the tracks, and all pure bad boys. He was always the unpredictable one, the one who would be brash enough to make it big self-publishing horror novels on the internet. He promised never to tell, but everyone knows you can never trust an Outlaw.Then a year later, in the middle of the night, she receives a phone call at Tulane. Her aunt, who took her in after her mother’s death, is in a coma under suspicious circumstances. Now she has to face that one person who knows all about what she did that summer—sexy Booker.Returning to Hope Parish to be with her aunt, stirs up all those ugly memories. When Aubree starts getting threats, she can’t help but wonder if what she did last summer was tied to her aunt’s “accident.” Afraid, she turns to the only person who knows the truth and Booker doesn’t hesitate to offer his broad shoulder for her to lean on. But Booker has a secret of his own that could crush their fledgling relationship.As the hot, sultry summer days on the bayou move on, she finds that even a perfectly smart girl can lose her heart to a perfectly bad boy. What is she going to do when someone starts asking questions Aubree doesn’t want to answer? She’s knee deep into a terribly dangerous, wholly life changing, who-can-she-really-depend-on perfect mess. This book is for mature audiences only!New Adult Contemporary Romance.A Perfect Mess is part of the Perfect Secret series and is a Hope Parish novel. It can be read as a stand-alone novel or in any order with the series.The publishing order of the series is as A Perfect MessA Perfect Mistake (coming soon)A Perfect Dilemma (coming soon)Other books by this Author-Going to the Dogs seriesLeashedGroomed for MurderHoundedCollared (coming soon)",
  "genres": [
    "New Adult",
    "Romance",
    "Contemporary Romance",
    "Mystery",
    "Contemporary",
    "Amazon",
    "Fiction"
  ],
  "author": "Zoe Dawson",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/17700828-a-perfect-mess"
}