{
  "title": "Eichmann in Jerusalem: A Report on the Banality of Evil",
  "description": "When Adolf Eichmann was brought to trial in Jerusalem, the eyes of the world were on the courtroom. The drama of his kidnapping, the bitter controversies over jurisdiction, the scope and solemnity of the trial, its passionate undercurrents, racial and political - all these caught the imagination of mankind. But as week succeeded week and the courtroom drama ebbed and flowed, excitement was replaced by bewilderment. What were the issues? For what was Eichmann being tried? Under what law? By what precedent? The world was puzzled, and yet the world's first intuition had been right: an event of unique importance was taking place.For Dr. Arendt, the theatrical courtroom and the performance staged there, with its unexpected villains and buffoons, were only a beginning. With a directness and power of analysis that will inevitably remind the reader of Rebecca West's The Meaning of Treason, she goes straight to the issues at stake, ruthlessly dismissing the rhetoric and the bluster. To this task she brings unmatched qualifications. Her knowledge of Germany and the Germans enables her to penetrate beneath the surface to the subterranean forces that shaped the trial. Her command of politics and philosophy, her study of the Nuremberg trials and the Successor trials make it possible for her to isolate the points of international law and human justice raised in Jerusalem and valid throughout the world. The New Yorker, which sent her to the trial, has serialized this report - a report that not only expounds brilliantly the actual work carried out by Eichmann and the context in which he did it, but by its deeper analysis marks a step forward in the exploration of the human condition.",
  "genres": [
    "History",
    "Nonfiction",
    "Philosophy",
    "Politics",
    "Holocaust",
    "Psychology",
    "Classics"
  ],
  "author": "Hannah Arendt",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/1770107.Eichmann_in_Jerusalem"
}