{
  "title": "Yossarian Slept Here: When Joseph Heller Was Dad, the Apthorp Was Home, and Life Was a Catch-22",
  "description": "THROUGHOUT ERICA HELLER’S LIFE, when people learned that Joseph Heller was her father, they often remarked, “How terrific!” But was there a catch? Like his most famous work, her father was a study in eccentric, brilliant, and voracious, but also mercurial, competitive, and stubborn, with a love of mischief that sometimes cut too close to the bone. Being raised by such a larger than- life personality could be claustrophobic, even at the sprawling Upper West Side apartments of the Apthorp, which the Hellers called home—in one way or another—for forty-five years.Yossarian Slept Here is Erica Heller’s wickedly funny but also poignant and incisive memoir about growing up in a family—her iconic father; her wry, beautiful mother, Shirley; her younger brother, Ted; her relentlessly inventive grandmother Dottie—that could be by turns caring, infuriating, and exasperating, though anything but dull. From the forbidden pleasures of ordering shrimp cocktail when it was beyond the family’s budget to spending a summer, as her father’s fame grew, at the Beverly Hills Hotel, Erica details the Hellers’ charmed—and charmingly turbulent— trajectory. She offers a rare glimpse of meetings with the Gourmet Club, where her father would dine weekly with Mel Brooks, Zero Mostel, and Mario Puzo, among others (and from which all wives and children were strictly verboten). She introduces us to many extraordinary residents of the Apthorp, some famous—George Balanchine, Sidney Poitier, and Lena Horne, to name a few—and some not famous, but all quite memorable. Yet she also manages to limn the complex bonds of loyalty and guilt, hurt and healing, that define every family. Erica was among those present at her father’s bedside as he struggled to recover from Guillain-Barré syndrome and then cared for her mother when Shirley was diagnosed with terminal cancer after the thirty-eight-year marriage and intensely passionate partnership with Joe had ended.Witty and perceptive, and displaying the descriptive gifts of a born storyteller, this authentic and colorful portrait of life in the Heller household unfolds alongside the saga of the family’s moves into four distinctive apartments within the Apthorp, each representing a different phase of their lives together—and apart. It is a story about achieving a dream; about fame and its aftermath; about lasting love, squandered opportunities, and how to have the best meal in Chinatown.",
  "genres": [
    "Memoir",
    "Biography",
    "Nonfiction",
    "Biography Memoir"
  ],
  "author": "Erica Heller",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/10096930-yossarian-slept-here"
}