{
  "title": "Under Fire: The Untold Story of the Attack in Benghazi",
  "description": "The New York Times bestselling inside account of the attack against the U.S. diplomatic and intelligence outposts in Benghazi, Libya On the night of September 11, 2012, the American diplomatic mission at Benghazi, Libya, came under ferocious attack by a heavily armed group of Islamic terrorists. The prolonged firefight, and the attack hours later on a nearby CIA outpost, resulted in the deaths of four Americans, including the American ambassador to Libya, Christopher Stevens, the Information Officer, Sean Smith, and two former Navy SEALs, Tyrone Woods and Glen Doherty, working for the Central Intelligence Agency.After the fall of Qaddafi, Benghazi was transformed into a hotbed of fundamentalist fervor and a den of spies for the northern half of the African continent. Moreover, it became the center of gravity for terrorist groups strategically situated in the violent whirlwinds of the Arab Spring. On the eleventh anniversary of the 9/11 attacks against the United States, a group of heavily armed Islamic terrorists had their sights set on the U.S. diplomatic and intelligence presence in the city.Based on the exclusive cooperation of eyewitnesses and confidential sources within the intelligence, diplomatic, and military communities, Fred Burton and Samuel M. Katz reveal for the first time the terrifying twelve-hour ordeal confronted by Ambassador Christopher Stevens, Sean Smith, his Diplomatic Security (DS) contingent, and the CIA security specialists who raced to rescue them.More than just the minute-by-minute narrative of a desperate last stand in the midst of an anarchic rebellion, Under Fire is an inspiring testament to the bravery and selflessness of the men and women who put their country first while serving in one of the most dangerous regions in the world.",
  "genres": [
    "History",
    "Nonfiction",
    "Military Fiction",
    "Politics",
    "War",
    "Military History",
    "Audiobook"
  ],
  "author": "Fred    Burton",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/17702287-under-fire"
}