{
  "title": "Ring the Alarm",
  "description": "Happye Naughton had a safe life. She had a sister she loves, a job she was good at, but she wasn't truly living. She wasn't happy but she was content. Comfortable. That is until a tragedy rocks her world and turns her into the most hated person in the city. When she is assaulted by a beloved local hero, people are quick to take sides. The press paints her as a golddigging liar. She receives death threats and loses her job. Just when she wants to give up, billionaire Drake Powell swoops in to pick up the pieces, refusing to let her go down without a fight. With his love, his stubborn commands that she rejoin the land of the living and the sensual, amazing things he does to her body daily, she finds the will to stop being a victim and become a survivor.Soon, Happye is caught up in a much bigger conspiracy than she thought. With the help of five other women whose lives were also touched by the same corrupted hand, she learns she is much more of a fighter than she thought she was. The women risk their lives to find justice not only for themselves but other women in the same situations.Drake Powell has wanted Happye since the first time he laid eyes on her. He has loved her from the moment she first smiled at him. When she becomes broken, he knows he has it in him to fix her. But does he have the strength to keep her alive when she, and her new crazy friends, go up against a killer?Clique of Misfits is a new series about six women who forge an unbreakable friendship out of tragedy. Their new bond gives them the strength to find justice for themselves and the courage to fight for others. Maybe, just maybe, they can also open their hearts to love and embrace the comforting arms of the men that want to protect them.This book contains explicit sex scenes, strong language, domestic abuse and rape. Suitable for mature audiences only.",
  "genres": [
    "Contemporary Romance"
  ],
  "author": "Tara Ann Bradley",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/17702939-ring-the-alarm"
}