{
  "title": "Parallel Stories",
  "description": "In 1989, the year the Wall came down, a university student in Berlin on his morning run finds a corpse on a park bench and alerts the authorities. This scene opens a novel of extraordinary scope and depth, a masterwork that traces the fate of myriad Europeans―Hungarians, Jews, Germans, Gypsies―across the treacherous years of the mid-twentieth century.Three unusual men are at the heart of Parallel Stories: Hans von Wolkenstein, whose German mother is linked to secrets of fascist-Nazi collaboration during the 1940s; Ágost Lippay Lehr, whose influential father has served Hungary's different political regimes for decades; and András Rott, who has his own dark record of mysterious activities abroad. The web of extended and interconnected dramas reaches from 1989 back to the spring of 1939, when Europe trembled on the edge of war, and extends to the bestial times of 1944–45, when Budapest was besieged, the Final Solution devastated Hungary's Jews, and the war came to an end, and on to the cataclysmic Hungarian Revolution of October 1956.We follow these men from Berlin and Moscow to Switzerland and Holland, from the Mediterranean to the North Sea, and of course, from village to city in Hungary. The social and political circumstances of their lives may vary greatly, their sexual and spiritual longings may seem to each of them entirely unique, yet Péter Nádas's magnificent tapestry unveils uncanny reverberating parallels that link them across time and space.This is Péter Nádas's masterpiece―eighteen years in the writing, a sensation in Hungary even before it was published, and almost four years in the translating. Parallel Stories is the first foreign translation of this daring, demanding, and momentous novel, and it confirms for an even larger audience what Hungary already knows: that it is the author's greatest work.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Hungary",
    "Hungarian Literature",
    "Literary Fiction",
    "Literature",
    "Novels"
  ],
  "author": "Péter Nádas",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/10821772-parallel-stories"
}