{
  "title": "Men Without Women",
  "description": "This influential 14-story collection includes some of the Nobel laureate’s most notable short fiction, including “Hills Like White Elephants” and “Fifty Grand,” which a Cosmopolitan editor praised as “one of the best short stories that ever came to my hands.” Read by an Earphones Award–winning narrator.Originally published in October 1927, the second short-story collection published by Pulitzer Prize winner and Nobel Laureate Ernest Hemingway contains the following fourteen stories: The Undefeated, In Another Country, Hills Like White Elephants, The Killers, Che Ti Dice La Patria?, Fifty Grand, A Simple Enquiry, Ten Indians, A Canary for One, An Alpine Idyll, A Pursuit Race, Today is Friday, Banal Story, Now I Lay Me. Themes and subject matter range from bullfighting, boxing, and prizefighting to divorce, infidelity, and death. Critics at the time praised Hemingway’s concise language and powerful prose. Content Warning: As a part of the public domain, Men Without Women is a literary work that reflects the time in which it was published—both its good and its ill. The original text of Men Without Women contains slurs and depictions that represent prejudiced and harmful beliefs regarding race, ethnicity, and religion. To erase or bury this representation of inequity and prejudice would be akin to pretending it never existed, a denial that only perpetuates and extends the original harm done. Thus, in the interest of preserving and documenting both the faults and highlights of literary history—an instrumental, crucial function of works entering the public domain—this text is unedited and uncensored in this audiobook recording. Please proceed with discretion.",
  "genres": [
    "Fiction",
    "Short Stories",
    "Classics",
    "Literature",
    "American",
    "20th Century",
    "Novels"
  ],
  "author": "Ernest Hemingway",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/108218.Men_Without_Women"
}