{
  "title": "Journeys with the caterpillar: Travelling through the islands of Flores and Sumba, Indonesia",
  "description": "A humorous travelogue on Indonesia\"The crowd lined the street, shoulder to shoulder. Fathers held young boys high, the older children climbing trees for better views. The pressure of the crowd built behind me. About fifteen men assembled around a tied the sacrifices were about to begin.\"What comes to your mind when you think of Indonesia?Do you think of volcanoes rising hurriedly from the seas to the skies?Do you imagine whimsical color-changing lakes sheltering tales of dead ancestors, wandering spirits, and local lore?Do you think of baby Komodo Dragons scurrying for cover from their hungry mothers?Do you imagine ever-blossoming smiles in this country often considered the happiest in the world?Maybe you’ve never visited these islands, but you’ll feel like you have when you’ve read JOURNEYS WITH THE CATERPILLAR.Embark on this journey today.Know about ancient animist cultures still thriving in these islandsExplore stunning yet remote landscapesEnjoy hilarious moments as you join the author and his fiancé interacting with the localsSee the amazing photographs from this trip that were selected for solo exhibition at the National Library and the Arts House, SingaporeHelp contribute to allay poverty in these islands; all royalties from this book are donated to Ayo Indonesia and Yayasan Harapan Sumba (YHS), two not-for-profits organizations in Flores and Sumba respectively.Ayo Indonesia focuses on various rural development activities, such as sustainable farming, drinking water supply construction, access roads through community self-help works, promoting Credit Unions, empowering people with disabilities, etc.YHS works with very poor farming communities on the island of Sumba; addressing their needs for water, education, better health, and sustainable livelihoods, and also help disabled children. YHS helps the communities understand and resolve their own problems through discussions, training and working together, with a minimum of ‘handouts’.",
  "genres": [
    "Travel",
    "Nonfiction"
  ],
  "author": "Shivaji Das",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/17704888-journeys-with-the-caterpillar"
}