{
  "title": "My Daring Highlander",
  "description": "Beautiful and fiercely protective of those she loves, Lady Seona Murray captured Keegan MacKay’s attention when she first set foot in Dunnakeil Castle. Though she is a chief’s daughter and forbidden, Keegan has fallen in love with her from afar and burns to possess her. But so does the clan traitor, Haldane, an obsessive outlaw bent on murder and kidnapping. Sinfully handsome, Keegan MacKay is a fearsome guard as well as the chief’s cousin, but Seona’s father would never consider him a worthy husband for her because he is not a titled laird. Seona has secretly watched the sensual, tawny-haired warrior from across the crowded great hall for months, but when he is tasked with escorting her across Scotland, back to her home, their simmering attraction flames into sizzling passion with just one kiss. Though she fears she is endangering Keegan’s life, Seona cannot resist his seductive charm or his spellbinding kisses. Keegan sets fire to the memories of her sad past and shows her what it means to truly live. But her father has other plans. He’s arranged for her to marry a wealthy Lowland laird. Is Keegan daring enough to steal her away? Or will the vindictive Haldane snatch her first?  \"My Daring Highlander is historical romance at its best. Ms. Sinclair gives us another magical story in her Highland Adventure series. My Daring Highlander brings Scotland to life and sweeps you into a world where love isn't always enough but maybe hope is. The author weaves a spell-binding tale of love, honor, family and friendship.\" Night Owl Reviews, 4.5 stars Top Pick \"Breathtaking and sensual adventure, 7 stars. My DARING HIGHLANDER is my favorite of her Highlander Adventures. It's amazing! Sensual! It took my breath away!\" Nicole Laverdure, Kindle Reader \"Vonda Sinclair is one of my new go-to authors for Highlander romance!\" Eliza Knight, USA Today Bestselling Author  Excerpt  She knew he needed to concentrate on listening for enemies, but the time they had alone was rare and precious. After several minutes of peaceful silence, she felt it safe to whisper, “Earlier, you were going to tell me what you wished for.” She but wanted to know more about him, to learn who he was on the deepest level. He turned to face her, his breathing close. She perceived his outline in the dim moonlight, but not his features or expression. “I shouldn’t tell you,” he finally said. “Why not?” Now, her curiosity was piqued. She wished to know all Keegan’s secrets. “I’m not sure you would like it,” he murmured in a warning tone. “Why? Do you wish to be an outlaw?” Could he have such shocking aspirations? He gave a brief, low chuckle. “Nay.” “What, then?” After a long, tense moment of silence, he stepped closer and placed a hand on her shoulder, then ran it into her unbound hair. He drew nearer still, his breath teasing the skin of her face. “Seona,” he whispered against her forehead, then kissed her there. “This.” Slowly, he kissed her temple, her cheek. “This is what I wish for.” All the breath left her and she could not draw more in. The kisses on her face created tingles that spread quickly throughout her entire body. Lightly, he brushed his warm, tempting lips over hers. Her eyes slid closed for surely she had drifted into a dream world. With his thumb, he gently stroked her face and jaw line. His lips were firm, but at the same time, soft and smooth. The short, rough whiskers on his chin scratched against her tender skin, but it wasn’t painful; it excited her and made her realize how very masculine he was. His insistent lips compelled her to return his kiss, though she knew not how. She had never been kissed before, but she followed her instincts, pressing her lips against his and mimicking his movements.",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Historical Fiction"
  ],
  "author": "Vonda Sinclair",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/17705052-my-daring-highlander"
}