{
  "title": "Conditions are Favorable",
  "description": "\"Welcome to our world...I know it, I sense it, you aren't here to simply fly. You are searching. You are here to find yourself, fill some kind of hole in your heart...there's no other reason why such fine men would be here but to find--or maybe lose--yourselves. Which is it?\"Fall into the year 1900 at Kitty Hawk, NC, when life consists of shipwrecks, shoot-outs…and flying machines. When Orville and Wilbur Wright arrive to conduct flight experiments, their posh dignity stands in stark contrast to a community of rough old salts who believe in a “good God, a bad devil, a hot hell, and more than anything else, that the same good God did not intend for man to ever fly.”The Wright brothers may be able to defy divine edicts, theorize about relative velocities and engineer the world’s first flying machine. But when it comes to women, they are terribly love-shy.That doesn't deter Kitty Hawker Madeleine Tate. When she meets these two odd bicycle mechanics from Ohio, she is immediately struck by the brothers’ intellect, dandy appearance—and their grip on bachelorhood. Their shyness and fixation on flight puzzles her, too, but she finds her growing fondness for Orville hard to resist. He represents a splendid taste of the Outside World, the place where she can escape the poverty and fear that define life on a stormy sandbar.And Orville is flattered by her affections, but he has long-accepted the fact that he and Wilbur are social misfits who let one bad experience with courtship harden their hearts forever. He finds his shyness, obsessions and memories tough obstacles to overcome. But Madeleine is determined to break through his shell to find out who he really is--a brilliant inventor? A lunatic risking his life for the sake of something the world deems impossible? Or is he someone just like her, with real hurts, dreams and desires?With stunning detail that rings true of early twentieth century life, author Tara Staley artfully depicts the story of two individuals who both, in their own unique ways, learn to spread their wings and fly.\"Gorgeously written, with the time, the place and the people evoked so dazzlingly, you can hear the wings of the Wright's flying machine, wafting in the air.\" Caroline Leavitt, NYT bestselling author, PICTURES OF YOU",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Romance",
    "Amazon"
  ],
  "author": "Tara Staley",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/17705785-conditions-are-favorable"
}