{
  "title": "The Return of the Omniscient Narrator:  Authorship and Authority in Twenty-First Century Fiction",
  "description": "The Return of the Omniscient Narrator: Authorship and Authority in Twenty-First Century Fiction by Paul Dawson argues that the omniscient narrator, long considered a relic of the eighteenth- and nineteenth-century novel, has reemerged as an important feature of contemporary British and American literary fiction. It further argues that the development of contemporary omniscience can be situated in relation to ongoing anxieties about the novel’s decline of cultural authority in the age of digital media. In this context the book identifies and classifies new modes of omniscient narration that are neither nostalgic revivals nor parodic critiques of classic omniscience, but the result of experimentations with narrative voice in the wake of postmodern fiction.   To address this phenomenon, the book reformulates existing definitions of literary omniscience, shifting attention away from questions of narratorial knowledge and toward omniscient narration as a rhetorical performance of narrative authority that invokes and projects a historically specific figure of authorship. Through a study of fiction by authors such as Zadie Smith, Jonathan Franzen, Richard Powers, Martin Amis, Rick Moody, Edward P. Jones, and Nicola Barker, the book analyzes how the conventional narrative authority of omniscient narrators is parlayed into claims for the cultural authority of authors and of the novel itself.   In the course of its investigation, The Return of the Omniscient Narrator engages with major movements in narrative theory—rhetorical, cognitive, and feminist—to challenge and reconsider many key narratological categories, including Free Indirect Discourse, the relation between voice and focalization, and the narrative communication model. This challenge is framed by an argument for a discursive approach to narrative fiction that addresses the neglect of authorship in narrative theory.",
  "genres": [
    "Literary Criticism"
  ],
  "author": "Paul Dawson",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/17706813-the-return-of-the-omniscient-narrator"
}