{
  "title": "The Frackers: The Outrageous Inside Story of the New Billionaire Wildcatters",
  "description": "Everyone knew it was crazy to try to extract oil and natural gas buried in shale rock deep below the ground. Everyone, that is, except a few reckless wildcatters - who risked their careers to prove the world wrong.  Things looked grim for American energy in 2006. Oil production was in steep decline and natural gas was hard to find. The Iraq War threatened the nation’s already tenuous relations with the Middle East. China was rapidly industrializing and competing for resources. Major oil companies had just about given up on new discoveries on U.S. soil, and a new energy crisis seemed likely.But a handful of men believed everything was about to change. Far from the limelight, Aubrey McClendon, Harold Hamm, Mark Papa, and other wildcatters were determined to tap massive deposits of oil and gas that Exxon, Chevron, and other giants had dismissed as a waste of time. By experimenting with hydraulic fracturing through extremely dense shale—a process now known as fracking—the wildcatters started a revolution. In just a few years, they solved America’s dependence on imported energy, triggered a global environmental controversy—and made and lost astonishing fortunes.No one understands these men—their ambitions, personalities, methods, and foibles—better than the award-winning Wall Street Journal reporter Gregory Zuckerman. His exclusive access enabled him to get close to the frackers and chronicle the untold story of how they transformed the nation and the world. The result is a dramatic narrative tracking a brutal competition among headstrong drillers. It stretches from the barren fields of North Dakota and the rolling hills of northeastern Pennsylvania to cluttered pickup trucks in Texas and tense Wall Street boardrooms.Activists argue that the same methods that are creating so much new energy are also harming our water supply and threatening environmental chaos.  The Frackers tells the story of the angry opposition unleashed by this revolution and explores just how dangerous fracking really is.The frackers have already transformed the economic, environmental, and geopolitical course of history. Now, like the Rockefellers and the Gettys before them, they’re using their wealth and power to influence politics, education, entertainment, sports, and many other fields. Their story is one of the most important of our time.MEET THE FRACKERSGEORGE MITCHELL, the son of a Greek goatherd, who tried to tap rock that experts deemed worthless but faced an unexpected obstacle in his quest to change history.AUBREY McCLENDON, the charismatic scion of an Oklahoma energy family, who scored billions leading a historic land grab. He wasn’t prepared for the shocking fallout of his discoveries.TOM WARD, who overcame a troubled childhood to become one of the nation’s wealthiest men. He could handle natural-gas fields but had more trouble with a Wall Street power broker.HAROLD HAMM, the son of poor sharecroppers, who believed America had more oil than anyone imagined. Hamm was determined to find the crude before others caught on.CHARIF SOUKI, the dashing Lebanese immigrant who saw his career crumble and his fortune disintegrate, leaving one last, unlikely chance for success.MARK PAPA, the Enron castoff who panicked when he realized a resurgence of American natural gas was at hand, one that his company wasn’t prepared for.",
  "genres": [
    "Business",
    "Nonfiction",
    "History",
    "Economics",
    "Environment",
    "Finance",
    "Biography"
  ],
  "author": "Gregory Zuckerman",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/17707481-the-frackers"
}