{
  "title": "Masks",
  "description": "Masks, the first novel in a mesmerizing new fantasy series, draws readers into a world in which cataclysmic events have left the Autarchy of Aygrima—the one land blessed with magical resources—cut off from its former trading partners across the waters, not knowing if any of those distant peoples still live. Yet under the rule of the Autarch, Aygrima survives. And thanks to the creation of the Masks and the vigilance of the Autarch’s Watchers, no one can threaten the security of the empire. In Aygrima, magic is a Gift possessed from birth by a very small percentage of the population, with the Autarch himself the most powerful magic worker of all. Only the long-vanquished Lady of Pain and Fire had been able to challenge his rule. At the age of fifteen, citizens are recognized as adults and must don the spell-infused Masks—which denote both status and profession—whenever they are in public. To maintain the secure rule of the kingdom, the Masks are magically crafted to reveal any treasonous thoughts or actions. And once such betrayals are exposed, the Watchers are there to enforce the law. Mara Holdfast, daughter of the Autarch’s Master Maskmaker, is fast approaching her fifteenth birthday and her all-important Masking ceremony. Her father himself has been working behind closed doors to create Mara’s Mask. Once the ceremony is done, she will take her place as an adult, and Gifted with the same magical abilities as her father, she will also claim her rightful place as his apprentice. But on the day of her Masking something goes horribly wrong, and instead of celebrating, Mara is torn away from her parents, imprisoned, and consigned to a wagon bound for the mines. Is it because she didn’t turn the unMasked boy she discovered over to the Night Watchers? Or is it because she’s lied about her Gift, claiming she can only see one color of magic, when in truth she can see them all, just as she could when she was a young child? Whatever the reason, her Mask has labeled her a traitor and now she has lost everything, doomed to slavery in the mines until she dies. And not even her Gift can show Mara the future that awaits her—a future that may see her freed to aid a rebel cause, forced to become a puppet of the Autarch, or transformed into a force as dangerous to her world as the legendary Lady of Pain and Fire.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Magic",
    "Fiction",
    "Dystopia",
    "Romance",
    "Young Adult Fantasy"
  ],
  "author": "E.C. Blake",
  "average_rating": "3.41",
  "url": "https://www.goodreads.com/book/show/17707611-masks"
}