{
  "title": "Five Billion Years of Solitude: The Search for Life Among the Stars",
  "description": "An intimate history of Earth and the quest for life beyond the solar systemFor 4.6 billion years our living planet has been alone in a vast and silent universe. But soon, Earth's isolation could come to an end. Over the past two decades, astronomers have discovered thousands of planets orbiting other stars. Some of these exoplanets may be mirror images of our own world. And more are being found all the time.Yet as the pace of discovery quickens, an answer to the universe's greatest riddle still remains just out of Is the great silence and emptiness of the cosmos a sign that we and our world are somehow singular, special, and profoundly alone, or does it just mean that we’re looking for life in all the wrong places? As star-gazing scientists come closer to learning the truth, their insights are proving ever more crucial to understanding life’s intricate mysteries and possibilities right here on Earth.Science journalist Lee Billings explores the past and future of the \"exoplanet boom\" through in-depth reporting and interviews with the astronomers andplanetary scientists at its forefront. He recounts the stories behind their world-changing discoveries and captures the pivotal moments that drove them forward in their historic search for the first habitable planets beyond our solar system. Billings brings readers close to a wide range of fascinating characters, such FRANK DRAKE , a pioneer who has used the world’s greatest radio telescopes to conduct the first searches for extraterrestrial intelligence and to transmit a message to the stars so powerful that it briefly outshone our Sun.JIM KASTING , a mild-mannered former NASA scientist whose research into the Earth’s atmosphere and climate reveals the deepest foundations of life on our planet, foretells the end of life on Earth in the distant future, and guides the planet hunters in their search for alien life.SARA SEAGER , a visionary and iron-willed MIT professor who dreams of escaping the solar system and building the giant space telescopes required to discover and study life-bearing planets around hundreds of the Sun’s neighboring stars.Through these and other captivating tales, Billings traces the triumphs, tragedies, and betrayals of the extraordinary men and women seeking life among the stars. In spite of insufficient funding, clashing opinions, and the failings of some of our world’s most prominent and powerful scientific organizations, these planet hunters will not rest until they find the meaning of life in the infinite depths of space. Billings emphasizes that the heroic quest for other Earth-like planets is not only a scientific pursuit, but also a reflection of our own culture’s timeless hopes and fears.",
  "genres": [
    "Science",
    "Nonfiction",
    "Astronomy",
    "Space",
    "Physics",
    "History",
    "Popular Science"
  ],
  "author": "Lee Billings",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/17707637-five-billion-years-of-solitude"
}