{
  "title": "Act of War: Lyndon Johnson, North Korea, and the Capture of the Spy Ship Pueblo",
  "description": "In 1968, a small, dilapidated American spy ship set out on a dangerous mission: to pinpoint military radar stations along the coast of North Korea. Packed with advanced electronic-surveillance equipment and classified intelligence documents, the USS Pueblo was poorly armed and lacked backup by air or sea. Its crew, led by a charismatic, hard-drinking ex-submarine officer named Pete Bucher, was made up mostly of untested sailors in their teens and twenties.On a frigid January morning while eavesdropping near the port of Wonsan, the Pueblo was challenged by a North Korean gunboat. When Bucher tried to escape, his ship was quickly surrounded by more patrol boats, shelled and machine-gunned, and forced to surrender. One American was killed and ten wounded, and Bucher and his young crew were taken prisoner by one of the world’s most aggressive and erratic totalitarian regimes.Less than forty-eight hours before the Pueblo’s capture, North Korean commandos had nearly succeeded in assassinating South Korea’s president in downtown Seoul. Together, the two explosive incidents pushed Cold War tensions toward a flashpoint as both North and South Korea girded for war—with fifty thousand American soldiers caught between them. President Lyndon Johnson rushed U.S. combat ships and aircraft to reinforce South Korea, while secretly trying to negotiate a peaceful solution to the crisis.Act of War tells the riveting saga of Bucher and his men as they struggled to survive merciless torture and horrendous living conditions in North Korean prisons. Based on extensive interviews and numerous government documents released through the Freedom of Information Act, this book also reveals new details of Johnson’s high-risk gambit to prevent war from erupting on the Korean peninsula while his negotiators desperately tried to save the sailors from possible execution. A dramatic tale of human endurance against the backdrop of an international diplomatic poker game, Act of War offers lessons on the perils of covert intelligence operations as America finds itself confronting a host of twenty-first-century enemies.",
  "genres": [
    "History",
    "Nonfiction",
    "Military Fiction",
    "Military History",
    "War",
    "Audiobook",
    "American History"
  ],
  "author": "Jack Cheevers",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/17707683-act-of-war"
}