{
  "title": "Double Down: Game Change 2012",
  "description": "\"Those hungry for political news will read  Double Down  for the scooplets and insidery glimpses it serves up about the two campaigns, and the clues it offers about the positioning already going on among Republicans and Democrats for 2016 ... The book testifies to its authors’ energetic legwork and insider access... creating a novelistic narrative that provides a you-are-there immediacy... They succeed in taking readers interested in the backstabbing and backstage maneuvering of the 2012 campaign behind the curtains, providing a tactile... sense of what it looked like from the inside.\" Michiko Kakutani, The New York TimesIn their runaway bestseller Game Change, Mark Halperin and John Heilemann captured the full drama of Barack Obama’s improbable, dazzling victory over the Clintons, John McCain, and Sarah Palin. With the same masterly reporting, unparalleled access, and narrative skill, Double Down picks up the story in the Oval Office, where the president is beset by crises both inherited and unforeseen—facing defiance from his political foes, disenchantment from the voters, disdain from the nation’s powerful money machers, and dysfunction within the West Wing. As 2012 looms, leaders of the Republican Party, salivating over Obama’s political fragility, see a chance to wrest back control of the White House—and the country. So how did the Republicans screw it up? How did Obama survive the onslaught of super PACs and defy the predictions of a one-term presidency? Double Down follows the gaudy carnival of GOP contenders—ambitious and flawed, famous and infamous, charismatic and cartoonish—as Mitt Romney, the straitlaced, can-do, gaffe-prone multimillionaire from Massachusetts, scraped and scratched his way to the nomination.Double Down exposes blunders, scuffles, and machinations far beyond the klieg lights of the campaign trail: Obama storming out of a White House meeting with his high command after accusing them of betrayal. Romney’s mind-set as he made his controversial “47 percent” comments. The real reasons New Jersey governor Chris Christie was never going to be Mitt’s running mate. The intervention held by the president’s staff to rescue their boss from political self-destruction. The way the tense détente between Obama and Bill Clinton morphed into political gold. And the answer to one of the campaign’s great mysteries—how did Clint Eastwood end up performing Dada dinner theater at the Republican convention?In Double Down, Mark Halperin and John Heilemann take the reader into back rooms and closed-door meetings, laying bare the secret history of the 2012 campaign for a panoramic account of an election that was as hard fought as it was lastingly consequential.",
  "genres": [
    "Politics",
    "Nonfiction",
    "History",
    "Presidents",
    "American History",
    "Journalism",
    "Political Science"
  ],
  "author": "Mark Halperin",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/17707705-double-down"
}