{
  "title": "Floating City: A Rogue Sociologist Lost and Found in New York's Underground Economy",
  "description": "\"[A] fascinating X-ray of the city...Venkatesh's engrossing narrative dissects the intricacies of illegal commerce.\" --Publishers Weekly (STARRED review) New York is a city of highs and lows, where wealthy elites share the streets with desperate immigrants and destitute locals. Bridging this economic divide is New York’s underground economy, the invisible network of illicit transactions between rich and poor that secretly weaves together the whole city. Sudhir Venkatesh, acclaimed sociologist at Columbia University and author of Gang Leader for a Day, returns to the streets to connect the dots of New York’s divergent economic worlds and crack the code of the city’s underground economy. Based on Venkatesh’s interviews with prostitutes and socialites, immigrants and academics, high end drug bosses and street-level dealers, Floating City exposes the underground as the city’s true engine of social transformation and economic prosperity—revealing a wholly unprecedented vision of New York. A memoir of sociological investigation, Floating City draws from Venkatesh’s decade of research within the affluent communities of Upper East Side socialites and Midtown businessmen, the drug gangs of Harlem and the sex workers of Brooklyn, the artists of Tribeca and the escort services of Hell’s Kitchen. Venkatesh arrived in the city after his groundbreaking research in Chicago, where crime remained stubbornly local: gangs stuck to their housing projects and criminals stayed on their corners. But in Floating City, Venkatesh discovers that New York’s underground economy unites instead of divides inhabitants: a vast network of “off the books” transactions linking the high and low worlds of the city. Venkatesh shows how dealing in drugs and sex and undocumented labor bridges the conventional divides between rich and poor, unmasking a city knit together by the invisible threads of the underground economy. Planting himself squarely within this unexplored world, Venkatesh closely follows a dozen New Yorkers locked in the underground economy. Bangledeshi shop clerks like Manjun and Santosh navigate immense networks of illegal goods and services, connecting inquisitive tourists with sex workers and drug dealers. Hispanic prostitutes like Angela and Carla feel secure enough in the new city to leave their old neighborhoods behind in pursuit of bigger money, yet abandon all the safety they had when their clients were known locals. Rich uptown women like Analise and Brittany have the changing city at their beck and call, but both turn to sex work as an easy way to make ends meet without relying on their family fortunes. Venkatesh’s greatest guide is Shine, an African American drug boss based in Harlem who hopes to break into the elusive, upscale cocaine market. Without connections among wealthy whites, Shine undertakes an audacious campaign of self-reinvention, leaving behind the certainties of race and class with all the drive of the greatest entrepreneurs. As Shine explains to Venkatesh, “This is New York! We’re like hummingbirds, man. We go flower to flower. . . . Here, you need to float.”Floating City: A Rogue Sociologist Lost and Found in New York’s Underground Economy chronicles Venkatesh’s decade of discovery and loss in the shifting terrain of New York, where research subjects might disappear suddenly and new allies emerge by chance, where close friends might reveal themselves to be criminals of the lowest order. Propelled by Venkatesh’s numerous interviews and firsthand research, Floating City at its heart is a story of one man struggling to understand a complex global city constantly in the throes of becoming.Booklist \"Venkatesh brings to life the underground economy of New York, where rich and poor and varying ethnicities and backgrounds meet and function while they “float.” An enlightening book.\"Kirkus \"Displays a piercing sense of empathy and ability to translate dry sociological principles into an understanding of the difficult lives of the urban poor... Venkatesh has established a singular voice in urban sociology, and his immersive research and insights remain penetrating and unique.\n\"",
  "genres": [
    "Nonfiction",
    "Sociology",
    "Economics",
    "New York",
    "Anthropology",
    "Urban Studies",
    "Social Science"
  ],
  "author": "Sudhir Venkatesh",
  "average_rating": "3.46",
  "url": "https://www.goodreads.com/book/show/17707757-floating-city"
}