{
  "title": "The Novel Cure: From Abandonment to Zestlessness: 751 Books to Cure What Ails You",
  "description": "The Guardian (UK)\"An exuberant pageant of literary fiction and a celebration of the possibilities of the novel.\"A novel is a story transmitted from the novelist to the reader. It offers distraction, entertainment, and an opportunity to unwind or focus. But it can also be something more powerful—a way to learn about how to live. Read at the right moment in your life, a novel can—quite literally—change it. The Novel Cure is a reminder of that power. To create this apothecary, the authors have trawled two thousand years of literature for novels that effectively promote happiness, health, and sanity, written by brilliant minds who knew what it meant to be human and wrote their life lessons into their fiction. Structured like a reference book, readers simply look up their ailment, be it agoraphobia, boredom, or a midlife crisis, and are given a novel to read as the antidote. Bibliotherapy does not discriminate between pains of the body and pains of the head (or heart). Aware that you’ve been cowardly? Pick up To Kill a Mockingbird for an injection of courage. Experiencing a sudden, acute fear of death? Read One Hundred Years of Solitude for some perspective on the larger cycle of life. Nervous about throwing a dinner party? Ali Smith’s There but for The will convince you that yours could never go that wrong. Whatever your condition, the prescription is a novel (or two), to be read at regular intervals and in nice long chunks until you finish. Some treatments will lead to a complete cure. Others will offer solace, showing that you’re not the first to experience these emotions. The Novel Cure is also peppered with useful lists and sidebars recommending the best novels to read when you’re stuck in traffic or can’t fall asleep, the most important novels to read during every decade of life, and many more. Brilliant in concept and deeply satisfying in execution, The Novel Cure belongs on everyone’s bookshelf and in every medicine cabinet. It will make even the most well-read fiction aficionado pick up a novel he’s never heard of, and see familiar ones with new eyes. Mostly, it will reaffirm literature’s ability to distract and transport, to resonate and reassure, to change the way we see the world and our place in it.The Economist\"Astute and often amusing . . . a charming addition to any library. Time spent leafing through its pages is inspiring - even therapeutic.\"",
  "genres": [
    "Nonfiction",
    "Books About Books",
    "Reference",
    "Self Help",
    "Psychology",
    "Literature",
    "Essays"
  ],
  "author": "Ella Berthoud",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/17707738-the-novel-cure"
}