{
  "title": "The Greater Journey: Americans in Paris",
  "description": "The #1 bestseller that tells the remarkable story of the generations of American artists, writers, and doctors who traveled to Paris, fell in love with the city and its people, and changed America through what they learned, told by America’s master historian, David McCullough.Not all pioneers went west.In The Greater Journey , David McCullough tells the enthralling, inspiring—and until now, untold—story of the adventurous American artists, writers, doctors, politicians, and others who set off for Paris in the years between 1830 and 1900, hungry to learn and to excel in their work. What they achieved would profoundly alter American history.Elizabeth Blackwell, the first female doctor in America, was one of this intrepid band. Another was Charles Sumner, whose encounters with black students at the Sorbonne inspired him to become the most powerful voice for abolition in the US Senate. Friends James Fenimore Cooper and Samuel F. B. Morse worked unrelentingly every day in Paris, Morse not only painting what would be his masterpiece, but also bringing home his momentous idea for the telegraph. Harriet Beecher Stowe traveled to Paris to escape the controversy generated by her book, Uncle Tom’s Cabin . Three of the greatest American artists ever—sculptor Augustus Saint-Gaudens, painters Mary Cassatt and John Singer Sargent—flourished in Paris, inspired by French masters.Almost forgotten today, the heroic American ambassador Elihu Washburne bravely remained at his post through the Franco-Prussian War, the long Siege of Paris, and the nightmare of the Commune. His vivid diary account of the starvation and suffering endured by the people of Paris is published here for the first time.Telling their stories with power and intimacy, McCullough brings us into the lives of remarkable men and women who, in Saint-Gaudens’ phrase, longed “to soar into the blue.”",
  "genres": [
    "History",
    "Nonfiction",
    "France",
    "American History",
    "Biography",
    "Travel",
    "Art"
  ],
  "author": "David McCullough",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/10822660-the-greater-journey"
}