{
  "title": "Little Bets: How Breakthrough Ideas Emerge from Small Discoveries",
  "description": "What do Apple CEO Steve Jobs, comedian Chris Rock, prize-winning architect Frank Gehry, the story developers at Pixar films, and the Army Chief of Strategic Plans all have in common? Bestselling author Peter Sims found that all of them have achieved breakthrough results by methodically taking small, experimental steps in order to discover and develop new ideas. Rather than believing they have to start with a big idea or plan a whole project out in advance, trying to foresee the final outcome, they make a series of little bets about what might be a good direction, learning from lots of little failures and from small but highly significant wins that allow them to happen upon unexpected avenues and arrive at extraordinary outcomes.Based on deep and extensive research, including more than 200 interviews with leading innovators, Sims discovered that productive, creative thinkers and doers—from Ludwig van Beethoven to Thomas Edison and Amazon’s Jeff Bezos—practice a key set of simple but ingenious experimental methods—such as failing quickly to learn fast, tapping into the genius of play, and engaging in highly immersed observation—that free their minds, opening them up to making unexpected connections and perceiving invaluable insights. These methods also unshackle them from the constraints of overly analytical thinking and linear problem solving that our education places so much emphasis on, as well as from the fear of failure, all of which thwart so many of us in trying to be more innovative.Reporting on a fascinating range of research, from the psychology of creative blocks to the influential Silicon Valley–based field of design thinking, Sims offers engaging and wonderfully illuminating accounts of breakthrough innovators at work, including how Hewlett-Packard stumbled onto the breakaway success of the first hand-held calculator; the remarkable storyboarding process at Pixar films that has been the key to their unbroken streak of box office successes; the playful discovery process by which Frank Gehry arrived at his critically acclaimed design for Disney Hall; the aha revelation that led Amazon to pursue its wildly successful affiliates program; and the U.S. Army’s ingenious approach to counterinsurgency operations that led to the dramatic turnaround in Iraq.Fast paced and as entertaining as it is illuminating, Little Bets offers a whole new way of thinking about how to break away from the narrow strictures of the methods of analyzing and problem solving we were all taught in school and unleash our untapped creative powers.",
  "genres": [
    "Business",
    "Nonfiction",
    "Psychology",
    "Self Help",
    "Entrepreneurship",
    "Leadership",
    "Management"
  ],
  "author": "Peter Sims",
  "average_rating": "3.78",
  "url": "https://www.goodreads.com/book/show/10822774-little-bets"
}