{
  "title": "Tug O' War and Other Drinking Games",
  "description": "Out of a blackout, Nathan and his best friend, Riley, find themselves on a road trip down the west coast with two complete strangers. Continuing to party, she and Nathan tug back and forth with the other's emotions on a journey to figure out their feelings for each other amidst alcohol and other confusion.Preview Of The First It may be the burn of the vodka traveling down my insides, but a flutter of excitement spreads across my chest and out to the rest of my body as she smiles. “How ridiculous are we?” she asks, her smile still painted across her voluminous lips. She puts down her shot glass and proceeds to pour another shot. I place my shot glass on the rickety table next to hers, so she can refill mine as well. Riley grabs the full shot glasses from the table and hands one to me. “It’s your turn. What’s this to?” The spark in her eye spreads across her face in a glimmer. I can’t get over how beautiful she looks. Time doesn’t seem to exist in this dimension, our dimension. A tickling sensation proliferates across my back, reminding me not to get lost in my emotions. I knock my shot glass against hers and lean in towards her glowing auburn eyes and her tiny wave of a nose. “To prefunking dinner!” I throw back the vodka and let the liquid cool my insides a couple degrees. “I’m pretty sure we’ve said that one four times already. Come on, Nathan...” Riley’s knees press into my thighs. She turns toward me and leans her smirking lips closer, whether to kiss me or to bite me is unclear. She hovers at this distance with her sandy hair falling on her cheeks. “You’re more creative than that. Come up with a better one.” I pour more poison into our glasses, spilling some of the cherished liquor onto the floor while I maintain her eye contact. I wish her eyes would stop their dazzling. “To the most attractive person ever.” I watch as she bites her bottom lip in an effort not to grin. Her eyes flutter between mine. I can’t let her have the satisfaction of knowing she has me. That will end our game of tug o’ war and neither of us wants that. “Me,” I say. I let the alcohol flow down into my stomach and eye Riley as she does the same. . . .",
  "genres": [],
  "author": "Solomon Robert",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/17713597-tug-o-war-and-other-drinking-games"
}