{
  "title": "How to discover your life purpose in 21 days",
  "description": "Many of us are tired of our life. We’re tired of waking up early to work in a job we hate, of drifting aimlessly day to day, sustained only by paychecks and television. We’re tired of our only direction in life being the cliché “Work till you can retire”, which is an answer that has long since lost its appeal. But what if you were told that, in only 21 days, you could discover your true purpose in life? A purpose that would give you a reason to truly enjoy your life, enjoy it in a way that is much more fulfilling than channel surfing or browsing the internet. In three weeks you can remain sitting on the couch, flipping aimlessly through the channels, or living a life on your own terms. This isn’t an ebook about striking out own your own as an entrepreneur (although that could certainly be your calling), nor is it about living a life of fast cars and death defying thrills. It’s a program on how to discover just exactly what your purpose on this planet is. It’s about learning to stop ‘surviving’ day to day, struggling to gather the willpower to get out of bed, and instead to find a reason to jump out of bed, dance into the shower and proper clothing, go out, and live the life you want. It’s time to stop living a life you don’t truly want. You need to take a little time to review your life and your consciousness, a little time to assess everything affecting you and ask yourself why you’re not happy with your life at this moment. You can learn, and take action to fix that, so you can achieve happiness. And while all of life is a learning process, finding what you want shouldn't take a lifetime. That’s why this program takes less than a month to work through, and put you on your way to discovering the drive to live your life in the way you want it.Visit my website: http://www.thealxslife.com/",
  "genres": [],
  "author": "Omar Al-Attas",
  "average_rating": "2.55",
  "url": "https://www.goodreads.com/book/show/17713674-how-to-discover-your-life-purpose-in-21-days"
}