{
  "title": "Discovered - The Cross of Lorraine",
  "description": "While vacationing in Jamaica with her mother, seventeen year-old Tawny is forcefully abducted by the wealthy son of a notorious leader of the Russian mafia. Convinced that Tawny holds the key to enormous treasure hidden centuries earlier, the Russian and his terrifying conspirators force her to lead them to a secret cave on a remote island in the Great Lakes region. As this captivating and romantic tale unfolds, so does the intense and stirring love story of Tawny and her heroic Native American friend, Takoda. The timeless magnetism and unique atmosphere of Mackinac Island serve as a breathtaking backdrop to this suspenseful tale of ancient legends, hidden treasure, tender romance and one girl’s daring bravery. Think of a modern day “Nancy Drew” type of heroine, add the excitement and suspense of hidden treasure, such as in the movie, “National Treasure,” set the novel in Michigan’s Upper Peninsula with many scenes taking place on Mackinac Island, incorporate Native American heroes, and unite these elements in one intense love story, and you begin to sense the nature of this novel. Fast Moving. Inspiring. A Great Read. Unique elements that add to the novel’s depth include: A love story between a Northern Michigan girl and Takoda, a 19-year old Native American, skilled in boat restoration and trained in England. A kidnapping at historic Rose Hall in Jamaica by a team of foreign high-rollers intent on finding Jesuit treasure in the northern straits area. A Tribal Chief of Police who doggedly pursues the investigation and spearheads the rescue. Extensive historical research behind key elements of the story. Thrilling, action scenes including an escape attempt, the killing of a park ranger, a search for treasure, a rescue and a possible \"discovery.\" Unique, memorable characters such as “Chief,” “Bossman,” “Ice Blue,” Boniface, “Steel Rim,” Gabriel, Tawny’s mother and teenage friends (including Todd, who figures more strongly in Books Two and Three), and Tawny and Takoda. Set in unique and breathtaking Mackinac Island and Northern Michigan, it visually includes the Caribbean, Jamaica, Haiti, Ontario Canada’s Cloche Mountain chain, and the North Channel, as well as a Benetti mega-yacht, a Falcon jet, an Azimut yacht, several Coast Guard and Homeland Security boats, a helicopter and various antique sailboats. “Discovered, The Cross of Lorraine” is the first book of the “Mackinac Trilogy.” Book Two, “Witnessed, Measures of Love,” will be published in the fall and Book Three, “Promised, Impossible Odds,” will be available in 2014.",
  "genres": [],
  "author": "Charlene Kull",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/17714195-discovered---the-cross-of-lorraine"
}