{
  "title": "The Fog of Paranoia: A Sister's Journey through Her Brother's Schizophrenia",
  "description": "Pat and Sarah had long been friends, not just brother and sister. They supported each other, shared music and movies, and confided in each other as they went through the many challenging stages of adolescence. But something began to change in Pat. He was convinced people were watching him, spying on him. Once outgoing and sociable, he began to withdraw into a world of his own, on the inside, where social engagement was not necessary nor desired. He stopped taking care of his personal hygiene. Conversation became increasingly difficult. After a series of visits with psychologists, he was diagnosed at first with bi-polar disorder, and then, more accurately with schizophrenia with paranoid delusions. His world, and that of his sister’s, changed forever.This is the story of one sister’s fight to convince her family that her brother needed help, that initial efforts to curtail his symptoms were inadequate, that he needed additional intervention. At the same time, it is the story of her own struggles with anxiety and depression, and coping with the changes in her life as her brother suffered at home. And finally, it is the story of one family’s acceptance of a difficult diagnosis and their embracing of the child and brother they have always known and loved. Schizophrenia, indeed mental illness in general, is often misunderstood and therefore feared by society at large. Here, the author helps to dislodge some long-held assumptions about mental illness and encourages readers to ask questions, to offer help and support, and to advocate for assistance for anyone suffering mental illness before it’s too late. She offers a voice to all the sisters and brothers of the mentally ill, so that they may find comfort in her words and hope for their siblings.",
  "genres": [
    "Mental Health",
    "Memoir",
    "Psychology"
  ],
  "author": "Sarah Rae",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/17714411-the-fog-of-paranoia"
}