{
  "title": "The Marathon Monks of Mount Hiei",
  "description": "The greatest athletes in the world today are not the Olympic champions or the stars of professional sports, but the \"marathon monks\" of Japan's sacred Mount Hiei. Over a seven-year training period, these \"running buddhas\" figuratively circle the globe on foot. During one incredible 100-day stretch, they cover 52.5 miles daily—twice the length of an Olympic marathon. And the prize they seek to capture is the greatest thing a human being can achieve: enlightenment in the here and now. This book is about these amazing men, the magic mountain on which they train, and the philosophy of Tendai Buddhism, which inspires them in their quest for the supreme. The reader will learn about the monks' death-defying fasts, their vegetarian training diet, their handmade straw running shoes, and feats of endurance such as their ceremonial leap into a waterfall. Illustrated with superb photographs, the book also contains the first full-length study in English of Mount Hiei and Tendai Buddhism. John Stevens lived in Japan for thirty-five years, where he was a professor of Buddhist studies at Tohoku Fukushi University in Sendai. Stevens is a widely respected translator, an ordained Buddhist priest, a curator of several major exhibitions of Zen art, and an aikido instructor. He has authored more than thirty books and is one of the foremost Western experts on aikido, holding a ranking of 7th dan Aikikai. Stevens has also studied calligraphy for decades, authoring the classic Sacred Calligraphy of the East. Other John Stevens titles that are likely to be of interest include Extraordinary Zen Masters and The Philosophy of Aikido. Readers interested in related titles from John Stevens will also want to see: Abundant Peace (ISBN: 1626543232), Aikido: The Way of Harmony (ISBN: 1626543275), Sacred Calligraphy of the East (ISBN: 162654994X), Secrets of Aikido (ISBN: 1626543259), The Philosophy of Aikido (ISBN: 1626549931), Extraordinary Zen Masters (ISBN: 1626549923).",
  "genres": [
    "Japan",
    "Sports",
    "Buddhism",
    "Nonfiction",
    "Spirituality",
    "History",
    "Health"
  ],
  "author": "John Stevens MD",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/17716033-the-marathon-monks-of-mount-hiei"
}