{
  "title": "The Story of Princess Olivia",
  "description": "Princess Olivia - How it came to be. A few years ago, my wife, Carol, was a vendor at a Vermont Farmers' Market. A farmer, Mimi, sold goat cheese in the stand next to her. Her daughter, Olivia was a shy, blonde, girl who raced around the market playing games with a friend. Every Saturday I helped Carol set-up her paintings and then enjoyed the market. When it was time to pack up, I helped Carol and Olivia helped Mimi. We all became friends. One day Olivia bragged that she had kept a hula-hoop spinning for fourteen minutes. \"Is that all?\" I said. \"I wonder if you can do better than that. I'll time you.\" After twenty minutes she was still spinning the hoop and hardly out of breath. \"I've set a new record, I should call my dad.\" Carol gave her a cell-phone, she dialed the phone without missing a turn. Who says you can't do two things at once? Her new record was thirty-three minutes. Olivia often shared her imaginative stories with me. Her skill at spinning the hula-hoop inspired me to write a story for her. It was very short story, just three pages long, about a girl, her namesake, Princess Olivia, who twirled a hula-hoop so fast that it picked her up and took her flying. That story became a play that included adventures we shared. With the addition of a splendid score, with music composed by a friend, Don Velsey, and lyrics we collaborated on, \"Princess Olivia\" became a musical for children and the adults they brought with them. Princess Olivia, the novel, evolved from the play. I added more people, a few dilemmas, a stinky villain, and a magical minion to make it melodramatic. Then, I poured it all into a big bowl, mixed it up and rolled the words into chapters. Not an easy thing to do! Now grown-ups can read Princess Olivia to children and, if they like, children can read Princess Olivia to grown-ups. \"A long, long time ago, in the Green Mountain Kingdom that is now called Vermont, there was a princess named Olivia. She had dark brown eyes, long brown hair with bangs in the front and a ponytail in the back. She was a serious person. She lived with her father, King Horace, and her mother, Queen Cora. Their castle was set high in the green hills and deep in the dark forests near the tiny town of Ipswich that clung to the side of a hill across Beaver Creek. They had a marvelous view of Mount Ascutney. The castle had once been grand. The beautiful gardens surrounding the castle had gone to weed and seed. Brambles and wild grape vines grew over the marble statues that lined the spacious terraces, and volunteer asparagus, violets, and dandelions grew where there should have been grass. Even worse than the condition of the castle, was the condition of the Royal Bank Account.\" So begins Charles Egbert's beautifully written and delightful comic fable. Princess Olivia has all the qualities of Lewis Carroll's Alice in Wonderland mixed with the rumbustious humor of William Steig's Shrek! Written for children of all ages, for adepts of irony and slapstick, for aficionados of black humor, for sticklers for good form, for those who like magic and want all wishes to come true and for lovers of good prose, Princess Olivia is a tale of terrible things that happen as things go from bad to worse and well, just get better and end happily ever after. Exquisitely illustrated by Kathie Kelleher with drawings that match the humor and delight of the story this book will enchant everyone from excited young readers to grumpy old story tellers.",
  "genres": [
    "Fantasy"
  ],
  "author": "Charles Egbert",
  "average_rating": "3.36",
  "url": "https://www.goodreads.com/book/show/17715762-the-story-of-princess-olivia"
}