{
  "title": "Shorter's Way",
  "description": "Shorter's Way took the silver medal in the South East Best Regional Fiction category of the 2014 Independent Publisher Book Awards. Be careful what you wish for. Attorney Willie Shorter wishes he could be Georgia's youngest governor. Laine Becker wishes she could escape a life of drudgery working at Claxton Mill. The Over-the-Hill Boys Club wishes they were back in the game. As a teenager Willie learns to read people selling Bibles and patent medicine on the road. After law school, he meets The Boys: Pappy Hinshaw, former newspaper man; Chauncey Kennon, retired jackleg attorney; Philemon Van Norman (PV) Ledbetter, Southern aristocrat and bank president; Sol Goldman, owner of Gold's Mercantile, and Joe Laundry, land owner and gentleman farmer. A tragic mill accident brings Willie and Laine together when he challenges Claxton Mill. The publicity jump starts his political future and he lures The Boys into helping him. When the characters come together, they get the chance to fulfill their wishes. But there's always a price to pay...one that may be higher than any of them expected. Men may rule politics in public, but behind the scenes the power lies with women. Laine has a figure that turns heads, and a head for figures that is invaluable to Willie. Mrs. Amanda Swatham, the arbiter of good taste and decorum in Atlanta, takes Laine under her wing and introduces Willie to Atlanta's old money and power. Mother Ledbetter knows where all the bodies are buried...and who did the burying. Southern politics in the 1920s is all about money, secrets and power and Shorter's Way is all about how to use them to the best advantage. To fund pet projects and bypass official channels, Willie creates a secret war chest. Although Laine and The Boys try to guard the information, rumors abound. As Willie uses the funds to accomplish his grand plan to bring prosperity to south Georgia, he begins to attract national attention. Rural voters see him as a savior, but men accustomed to ruling party politics see an interloper who needs to be taught a lesson. Shorter's Way is, of course, Willie's story, but it is also the story of Atlanta and a forgotten way of life in the rural south.",
  "genres": [],
  "author": "Grace  Hawthorne",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/17716301-shorter-s-way"
}