{
  "title": "Iksia ali Slovo živostrojnega človeka",
  "description": "Roman je nadaljevanje Iksiona ali bega iz prikazovalnice, v katerem Eva in Uri pristaneta na Zemlji podobnem planetu in zaplodita nov človeški rod. Z enako nalogo se po nekaj tisoč letih spustita na ta planet obojnica Iksia in žiovostrojni človek Angel in bralec je priča nenavadni, neuresničljivi in nedosežni ljubezenski zvezi, ki se tke med njima.\"Remec žensko naravnost občuduje, žensko, ki jo v določenem kontekstu - kako tipično, preroško, mar tudi drzno? - vzpostavi kot samozadostno v tej drži, tej pozi tudi in celo kot univerzalno bitje…Obojnica Iksia mu tako predstavlja razvojni vrh dosedanjega ukvarjanja z erotiko, točneje, z žensko kot subjektom in objektom te erotike. Remec je, lahko rečemo, občudovalec ženske. To je opazno vsepovsod: opisuje in analizira jo v občutkih in občutenju popolnega zdovoljstva in sreče, predajanja in prejemanja, a tudi trpljenja in mučenja, z njenim bitjem in njeno bitjo spoznava in dojema, medij mu je in gonilo, ki se skozi njegove romane od fenomenalne Votline do osupljive Iksie, vzpenja, zori in izpopolnjuje. Njena metamorfoza v obojnico je rezultat silne potrebe po ohranitvi vrste, po obstoju človeškega rodu - čeprav s tem, vsaj posredno, odriva svoj prirodni antipod, moškega - verjetno že kot nekaj odvečnega, nepotrebnega, motečega in mučečega jo, morebiti ravno zato, ker kot tak z njo manipulira. A skoraj že začaran deveti romaneskni krog se razplete kar presenetljivo, čeprav pa povsem človeško - obojnica Iksia se dokončno in zavestno znebi obojništva in p-ostane samo zgolj in zgolj ženska (ali ni to mar zdosti, ali ni to vse?), polna, celovita in univerzalna. Saj zato pa ima Angela, živostrojnega človeka, ki vse bolj postaja samo človek, moški, ki si želi ženske, te ženske, Iksie.Krog je sklenjen, čeravno pa ne tudi poln: živostrojni človek lahko postane človek in moški le tako, da se samouniči. Doživljamo torej transformacijo, metamorfozo obeh temeljnih protagonistov. Obojnice, ki je že človek, v njo, žensko, živostrojnika pa v človeka, in sicer moškega - oba hote skrčita svojo dotedanjo univerzalnost in na ta način s sinergijo zbližanja dosežeta in presežeta prejšnjo univerzalnost zgolj dveh posameznikov. Zato bi lahko ugotovili, da ima najnovejši, deveti Remčev roman dve rdeči niti, njuna nosilca pa sta dva skrajna človeška antipoda, in sicer samoplodna obojnica in živostrojnik. Skozi njuno naraščajočo ljubezen in skozi sanjske svetove, ki Dromidom in Iksii zagotavljajo neizmerne možnosti prehajanja med časom in prostorom, se vzpostavlja prostorsko časovni kontinuum Remčevega univerzuma…",
  "genres": [],
  "author": "Miha Remec",
  "average_rating": "3.29",
  "url": "https://www.goodreads.com/book/show/10823305-iksia-ali-slovo-ivostrojnega-loveka"
}