{
  "title": "The Glass Slipper: Women and Love Stories",
  "description": "Why is the story of romance in books, magazines, and films still aimed at women rather than at men? Even after decades of feminism, traditional ideas and messages about romantic love still hold sway and, in our “postfeminist” age, are more popular than ever. Increasingly, we have become a culture of stories of all kinds shape the terms of love. Women, in particular, love a love story. The Glass Slipper is about the persistence of a familiar Anglo-American love story into the digital age. Comparing influential classics to their current counterparts, Susan Ostrov Weisser relates in highly amusing prose how these stories are shaped and defined by and for women, the main consumers of romantic texts. Following a trajectory that begins with Jane Austen and concludes with Internet dating sites, Weisser shows the many ways in which nineteenth-century views of women’s nature and the Victorian idea of romance have survived the feminist critique of the 1970s and continue in new and more ambiguous forms in today’s media, with profound implications for women. More than a book about romance in fiction and media, The Glass Slipper illustrates how traditional stories about women’s sexuality, femininity, and romantic love have survived as seemingly protective elements in a more modern, feminist, sexually open society, confusing the picture for women themselves. Weisser compares diverse narratives—historical and contemporary from high literature and “low” genres—discussing novels by Jane Austen and Charlotte Brontë, Victorian women’s magazines, and D. H. Lawrence’s Lady Chatterley’s Lover ; Disney movies; popular Harlequin romance novels; masochistic love in films; pornography and its relationship to romance; and reality TV and Internet ads as romantic stories. Ultimately, Weisser shows that the narrative versions of the Glass Slipper should be taken as seriously as the Glass Ceiling as we see how these representations of romantic love are meant to inform women’s beliefs and goals. In this book, Weisser’s goal is not to shatter the Glass Slipper, but to see through it.",
  "genres": [
    "Nonfiction",
    "Feminism",
    "Academic",
    "Romance",
    "Womens Studies",
    "Womens"
  ],
  "author": "Susan Ostrov Weisser",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/17719924-the-glass-slipper"
}