{
  "title": "A Father First",
  "description": "This is the story of a dedicated father. Thomas Stevens grew up as a farmer's son in rural Nebraska. He, his three brothers, and three sisters helped their parents around the farm as much as they could. He loved the business aspect of farming more than the sweat and hard work and told of his desires at an early age to the displeasure of his father. An understanding and loving man, Thomas' father would not insist that his children remain on the farm and assisted young Thomas in his pursuits. Christmas was a special time for the Stevens household, and the family made it a weeklong celebration within the old farmhouse. Thomas became quite wealthy. Through quirks of fate, he met a woman in trouble named Emily. Given Thomas's upbringing, he quickly came to her aid and soon fell in love with her. Thomas's selflessness and kindness toward others impressed Emily, and she learned quickly that Thomas was the man she had always hoped to meet. Together they had a child named Sarah. Sarah provided much love and laughter in their happy household, and Thomas could see that Sarah possessed a level of kindness and caring that angels might envy. All seemed perfect until one day a simple trip to the grocery store and an out of control car hit Emily's car head on and took her life. Thomas was devastated, but he had Sarah and his family to help him pull through the terrible trauma and devastating grief. Years went by until another accident sent Thomas again into a depression that lasted much of the remainder of his life. Thomas, young Sarah, and two of Sarah's cousins got into Thomas's car. He inadvertently neglected to lock Sarah securely into her seat belt, and a head-on accident sent his beautiful twelve-year-old daughter through the windshield, paralyzing her for life. Thomas vowed to make things right, but Sarah harbored a lifetime of resentment and bitter hatred toward her father and eliminated him from her life. Thomas tried everything to regain her love, but nothing he did would restore her trust or rekindle their loving relationship. He set out on an incredible journey that reaped him astonishing successes in his business world but one fraught with heart-wrenching depths into dementia, loss, prison, and despair, all for the sole purpose of restoring his and Sarah's relationship and life together as a family. He was a father first and that was the only success he sought. He did not care how long it took or the depths to which he had to sink to get there. He was determined to restore his daughter's affections even though she was oblivious to her father's good deeds. They lived a lifetime apart with Sarah not knowing or caring how much she meant to Thomas and how much her absence from his life had devastated him.",
  "genres": [],
  "author": "Gary D. Henry",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/17722017-a-father-first"
}