{
  "title": "The Scales of Balance",
  "description": "“It is difficult to overstate the storytelling prowess of author Tim Facciola.” — Independent Book Review Peace bought by blood seldom lasts, for vengeance knows no end. The same is true for mortals and Gods alike. Decades, centuries, eras may pass, but the cycle remains. As war and revolution rise again, Zephyrus finds himself at the center of it all. Chosen by the Gods, hailed as a prophet of liberation, and forged as a weapon to break the kingdom and restore balance to the realm, hope rests squarely on his shoulders.If only he could remember…Enslaved as a gladiator and thrust into a prince’s game of espionage, Zephyrus has only two clues to help unlock his shattered past: a prophecy foretelling destruction, and a letter to the enemy king, promising peace. Now Zephyrus must survive the dangers of the gladiatorial arena, the cunning fury of the Prince’s enemies, and the Gods’ torment if he is to find the truth of his identity and fulfill his fate. But to have any hope of breaking the cycle, first he must secure his freedom—and not just from his slavers.Within this vengeful realm, a queen protecting her kingdom, a prince defending his father, and a gladiator slave haunted by a prophecy each contend for their own brand of freedom. But the Gods have an agenda of their own, and they'll use any vessel—patrician, plebeian, or slave—to see it done.The scales must be balanced. By peace. Or by blood.“Arena-set action sequences shine … but even more impressive is the constant political maneuvering, as characters mingle with enemies while plotting against them. There is, of course, plenty of mystery, and Facciola amps up excitement with signs of magic, appearances from gods, and betrayals.” — Kirkus Reviews “A sprawling cast of vivid characters and a meticulously crafted realm, with exposition and world-building unraveling seamlessly alongside the plot…an original work of fantasy that doesn't trod familiar ground” — Self-Publishing Review",
  "genres": [
    "Fantasy",
    "Fiction",
    "Magic",
    "Historical Fiction",
    "Epic Fantasy",
    "Audiobook"
  ],
  "author": "Tim Facciola",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/177235826-the-scales-of-balance"
}