{
  "title": "The Rebel Within",
  "description": "FEDERAL UNION HUNTS BOYS … REBELLIOUS GIRL FOLLOWS CONSCIENCE … SHE’S DRAFTED TO OBEY ORDERS.“A stimulating, worthwhile story of a dystopian future.” – Kirkus Reviews Annabelle Scott tries to keep her rebellious thoughts to herself, avoid the draft, and protect her younger sister. The Federal Union forces her to be a police intern. She gets into trouble and is offered an impossible choice.Perfect for fans of the Hunger Games, Divergent, and Maze Runner. The Rebel Within is the first book in a science fiction thriller series in which a young woman is drafted into the police and then into the elite military to enforce laws she believes are wrong.A second American Civil War ended in a shaky stalemate dividing the country into the “civilized” Federal Union and the warlord-controlled mountainous Outland. Annabelle lost her biological parents to the conflict when she was little and was adopted by a member of the Union’s political opposition. The loss of her parents and her adoptive mother’s opposition lead Annabelle to be rebellious in a society that promotes conformity and punishes disobedience.Annabelle has never met a boy. The only time she sees them is at a prison across from her school while she’s in detention or when she escapes to the roof. A redhead has caught her attention, but boys are forbidden.When the redheaded Morgan escapes prison, Annabelle feels compelled to help him and almost gets caught. Frustrated, she fights an amazon bully to protect her sister and is arrested. To avoid prison, which would take her from her family, Annabelle joins the dreaded Mechanized Warriors, tasked with capturing escaped boys.If she fails the arduous military requirements, Annabelle risks death, imprisonment or being sent to the Outland as a slave. She also endangers her beloved sister and adoptive mom. Can Annabelle survive rigorous training under a tough commander, stay true to her conscience, and help Morgan without destroying herself and her family?",
  "genres": [
    "Dystopia",
    "Young Adult"
  ],
  "author": "Lance Erlick",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/17724228-the-rebel-within"
}