{
  "title": "The Pakistani Bride: A Novel",
  "description": "A Pakistani teenager is trapped by tradition in this tale by “Pakistan’s finest English-language novelist” ( New York Times ). Wild, austere, and magnificently beautiful, the territories of northern Pakistan are a forbidding place, particularly for women. Traveling alone from the isolated mountain village where he was born, Qasim, a tribal man, takes Zaitoon, an orphaned girl, for his daughter and brings her to the glittering city of Lahore. Amid the pungent bazaars and crowded streets, he makes his fortune and a home for the two of them. Yet as the years pass, Qasim grows nostalgic for his life in the mountains, and fifteen-year-old Zaitoon envisions a romantic landscape, filled with tall men who roam the mountains like gods. Impulsively, Qasim promises Zaitoon in marriage to a man of his tribe. But once she arrives in the mountains, the ancient customs of unquestioning obedience and backbreaking work make accepting her fate as the bride of an inscrutable husband impossible. Unfortunately, the only escape is one from which there is no return. Prescient and provocative in its assessment of the plight of women in a tribal society in Pakistan, the first of Bapsi Sidhwa’s novels is a story of marriage and commitment, of the conflict between adherence to tradition and indomitable force of a woman’s spirit. Praise for The Pakistani Bride “At a breathless pace [Sidhwa] weaves her exotic cliffhanger from passion, power, lust, sensuality, cruelty and murder.” — Financial Times (UK) “Bapsi Sidhwa is a powerful and dramatic novelist who knows how to flesh out a story.” — London Times (UK) “Sidhwa writes with the same vivacity that made the author’s first novel, The Crow Eaters so memorable.” — Telegraph (UK)",
  "genres": [
    "Pakistan",
    "Fiction",
    "Historical Fiction",
    "India",
    "Historical",
    "Asia",
    "Contemporary"
  ],
  "author": "Bapsi Sidhwa",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/1772459.The_Pakistani_Bride"
}