{
  "title": "The Northern Correspondent",
  "description": "Ambrose Longe, editor and owner of The Clarion, has always dreamt of reviving his mother’s newspaper, The Northern Correspondent. However, with The Clarion not making the kind of profits he expected, Ambrose feels the dream that will remain just a dream. As an independent newspaper, William Howarth offers to subsidise The Clarion in return for political favouritism. Longe refuses … The Clarion had always fought for social and political reform. Upset by the refusal, Howarth decides to found his own newspaper with his own editor, Sam Pickering, who is a party man just like Howarth. The Lancashire Herald is set up to be in direct opposition of The Clarion. When rich, sophisticated and exotic Naomi Blüm, moves into Millbridge she does her best to befriend the families in the town. She’d always lived in hotels and travelled vastly with her father. Upon her father’s death, a home is what she wants … without the complications of a husband! Business minded Naomi decides to invest in The Clarion. Longe accepts her proposal of investment. As financier, Naomi is prepared to give Longe the freedom to manage his paper his own way. The Northern Correspondent is born … Meanwhile, the cholera epidemic is spreading … Millbridge is affected badly and Dr Jamie Standish makes it his mission to ensure the disease is better understood and preventative methods put in place in Millbridge. The politial implications of this epidemic are considerable … Soon The Northern Correspondent flourishes. With the help of Longe’s cousin Mary Vivian and Naomi, The Correspondent successfully increases circulation by creating a section aimed at women. Naomi and Ambrose flourish as business partners … neither contemplating their relationship would go any further, but their lives change in a way they never expected.",
  "genres": [],
  "author": "Jean Stubbs",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/1772493.The_Northern_Correspondent"
}