{
  "title": "Addicted to the Dead",
  "description": "What if eating the walking dead was the only way to ensure you don’t become one?Shortly after you die, you wake up. Lost, confused, and scared. It happens to everyone. But if you ingest the meat of the dead, you can avoid this fate. You can rest in peace. People fear death, fear the unknown, so they eat their portion of dead meat every day, even though the meat itself takes away their ability to have children. But if you consume too much of it, or the meat is properly aged, it becomes a highly addictive drug, transforming those who are addicted—the meatheads—into emaciated husks of their former selves, only able to focus on getting their next fix.Paco’s family is dead, and he is alone…until his dead little sister Sophia speaks. But the dead can’t talk, can’t think. Sophia is special, maybe the link between the living and the dead, and Paco takes her to the city to find a doctor that can help her, figure out what’s making her so…alive. But Paco and Sophia quickly find out that the city isn’t safe, that the streets are infested with meatheads. And that they are the only children there.Calico, the city’s most feared killer, works for Ted Fleet, the man behind Ted Fleet’s Dead Meats, the leading dead meat company in the country—but Ted Fleet is also in charge of the city’s illegal meat distribution and Corpse Snuff business. Ted Fleet is holding Calico’s dead daughter Beauty hostage while he forces the killer to go out on jobs for him. Then Calico is sent to pick up a little dead girl, one that can talk, can think like she’s alive. Calico hopes maybe this girl can help Beauty, that maybe she is the key to changing everything. But when he finds out Ted Fleet’s plans for her, he knows he has to stop him.From the disturbed mind of Shane McKenzie comes this extreme tale of the undead.",
  "genres": [
    "Horror",
    "Zombies",
    "Bizarro Fiction"
  ],
  "author": "Shane McKenzie",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/17725097-addicted-to-the-dead"
}