{
  "title": "The Human Script",
  "description": "'A captivating, intelligent and deeply affecting exploration of science, literature and ideas'  Tom McCarthy, Man Booker shortlisted author of  C, Remainder and Satin IslandLondon in the spring of 2000: Chris Putnam, a young scientist working on the Human Genome Project, is grieving for the end of his first relationship and for the loss of his deeply religious and estranged father. Then Chris falls in love and his twin brother goes missing. Events take Chris on a journey from the hallowed halls of scientific research via decadent art-scene parties and London’s Theatreland to the cold loneliness of a psychiatric hospital and ultimately to a desperate decision. What Chris discovers about himself and his world forces him to address his own nature, his own beliefs and his own reality.The Human Script is a cryptic parable, in which popular science, philosophy, literary theory and religion intertwine in a poignant and tragic love story that asks the question: what is it to be human?As well as Tom McCarthy's praise, extracts have been widely lauded by such writers as Ian McEwan, Andrew Motion, W G Sebald and Lorna Sage and compared to David Mitchell (Cloud Atlas), Dave Eggers (A Heartbreaking Work of Staggering Genius) and Bernard Schlink (The Reader).An Amazon Kindle top 100 literary fiction title.\"The Booksmoke team reads a lot of books but so far nothing has beaten Johnny Rich's The Human Script. Hands down my book of the year. Brave, intelligent and gloriously unsettling. Tackling the big, beautiful, murky questions of science and genetics, 'nature/nurture', love, life, death. There are few books I finish and have to start at the beginning again but this was one of them.”Alex Masters, BookSmoke“The Human Script is an engaging novel brimming with ideas, so much so I feel it would stand up to multiple re readings within a short space of time. To say I enjoyed The Human Script would be an understatement. It provided me with the long forgotten thrill of not knowing how a novel will conclude, and for that I am grateful. I would recommend it to anyone who enjoys clever, well written fiction.”BookemStevo\"Incredibly clever and smart, and really made me think, while keeping me entertained to the end. The characters were engaging, and the plot was gripping. If you want to try something truly different and unique, I would highly recommend this book.\"Stephanie Cox, Words are my Craft\"Johnny Rich is a lover of literature and this is clear in his clever use of motifs and themes within The Human Script. His writing is reminiscent of Tom McCarthy and David Mitchell; readers may find that upon reading the last page they will want to start all over again. Intelligent, thought-provoking and profoundly moving, The Human Script is a book that will start conversations and will linger in your mind for a long time.\"Justine Solomons, Byte the Book\"The Human Script is an ambitious and intriguing novel. Johnny Rich’s voice is one I hope we will all become more familiar with.\"Rebekah Lattin-Rawstrone, author of Home\"The cutting edge of literature... I was pulled in for the ride until the very last page. The Human Script is almost pulsating with ideas and more than that with questions it’s impossible not to ask yourself after reading.Unique.\"Plastic Rosaries'A fascinating book' 'A real thought provoker' 'Intelligent, complex and surprising'Amazon reviews",
  "genres": [
    "Fiction"
  ],
  "author": "Johnny Rich",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/17725671-the-human-script"
}