{
  "title": "Fragments",
  "description": "Survival is all that matters in here.Still, it gets tricky when evil lurks around every corner, wanting to play.To the arsonist, everything is a game.Warren Xavier is Alabaster Pen’s resident manipulative liar. The former pretty boy prince of Manhattan’s elite is now locked away with the rest of us. Nothing but time to sit and stew… Scheme and obsess. And I’m the unlucky soul he’s made the object of his cunning affections.On the outside, I would never entertain the kinds of things Ren wants from me… Unfortunately, being trapped for so long in such a hellish place can wear down even the strongest of minds.I’d be a fool to fall into his mess of lustful deviance again. After all, I’ve been burned before.But that silver tongue is wrapped right around my heart. The next time his flames engulf me… I might let them.Prison life can be fun when you hold the handcuff keys in your sullied hands.My skills give me power over guards, prisoners… Pretty much everyone. I control these men without lifting a finger. Maybe bending at the waist...But not him. Not the one I truly want .Lex “Luthor” Deon is too perfect to be rotting in this dungeon. He’s a hacker, a genius ; a shimmering diamond lodged in a dreary black pit of decay. Sweet, loyal… inexperienced.In short, he’s way too good for me.But I’m too stubborn and volatile to ever let him go.I won’t allow fragments of the past ruin us. When it all comes crumbling down, Lex will have to make a choice… Risk everything, or play it safe.Whether he likes it or not, he wants to believe me…But sometimes even I can’t tell when I’m lying.** Fragments is a dark MM romance set in the world of Alabaster Penitentiary. While it follows a new couple with their own HEA, it is recommended to read the rest of the series first to avoid spoilers and get the full effect of the Isle. May contain sensitive subject matter. Heed foreword and proceed with caution. **",
  "genres": [
    "M M Romance",
    "Dark Romance",
    "Dark",
    "Romance",
    "Friends To Lovers",
    "Second Chance",
    "Forced Proximity"
  ],
  "author": "Nyla K.",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/177259830-fragments"
}