{
  "title": "Wolfgram et l'etrange vieillard",
  "description": "Nous sommes en 413. Les Romains ont colonisé au nom de leur civilisation, imposé leur religion avec ce dieu unique qu’on ne peut voir, certains peuples ne se sont jamais soumis. Des familles, des clans, des populations se déplacent sans cesse d’Est en Ouest. Beaucoup de guerriers se vendent comme mercenaires, d’autres, par les conquêtes et les pillages, ont acquis de belles richesses, et forment une aristocratie respectée.Rome a proposé aux individus soumis de devenir citoyens de Rome, a négocié l’installation de Germains partout sur ce grand territoire, a dû se plier aux exigences de chefs de guerre très puissants. A partir de l’empereur Constantin (305), les Germains tiennent la cour impériale et les hauts grades. L’armée de Julien (363) est germanique. Elle attaque en « tête de sanglier » et pousse l’immense mugissement qu’on appelle barritus. L’empereur s’habille de fourrure et se fait élever sur un pavois, ses officiers portent des peaux de bêtes et des fibules. Leur longue épée s’impose dans Rome, et l’on mêle le latin à des dialectes barbares. Ces Germains pourraient aisément devenir empereurs, d’autres citoyens romains \"étrangers\" l’ont fait, mais ils restent fidèles à leurs principes et gouvernent en coulisse. On pourrait maintenant parler d’Empire Germain.Roman d'André Gobry   Loin de tout cela, Wolfram se bat contre les arbres avec l'épée très courte qu'il a trouvée dans un fatras de prises de guerres. Le terrain de jeu de ce garçon de dix ans est dans l’Heiligtum, territoire interdit de forêt dense et de grottes vertigineuses dans la Gaule insoumise. Son père, le seigneur Gottfried, a menacé de mort quiconque y pénètrerait. Mais ce n’est pas son inutile décret qui fait fuir ou se détourner les passants. Car même les étrangers savent que vivent là des Elfes et le dieu Freyr, leur seigneur et maître, que des arbres peuvent vous attraper par les pieds et vous engloutir dans la profondeur de leurs racines. Toutes sortes de nains et de lutins, de fées abominables ou resplendissantes sont prêtes à vous transformer en crapaud ou en hamster, pour un oui ou pour un non, pour un regard indiscret. On dit qu’il existe dans cette forêt et dans ces gorges insondables une myriade d’êtres surnaturels, du géant au plus minuscule, la rumeur raconte qu’ils sont tous d’une méchanceté sauvage et qu’on ne peut mettre un pied sur leurs terres sans être au moins damné. Surgit un jour un étrange vieillard, qui révèle à Wolfram les secrets de sa naissance et ses pouvoirs magiques. Il vient aussi l’avertir du danger qu’il court, car de puissants seigneurs et des forces maléfiques veulent le faire disparaître. C’est le début d’aventures extraordinaires et périlleuses, des personnages merveilleux l’accompagnant dans sa quête.",
  "genres": [],
  "author": "Andre Gorby",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/17726480-wolfgram-et-l-etrange-vieillard"
}