{
  "title": "The Portal's Choice",
  "description": "The Portal’s ChoiceJournal entry, just in case . . .I didn’t ask to meet ghosts. Shoot, I was fine without them in my life. Uncle Craig and Hannah were nasty to me, but at least I knew how to handle living pains in the butt. Now I have to figure out how to open and close a portal between the human and spirit worlds. And, I have to find and return a bunch of angry ghosts through the gateway and lock them on their side. I don’t know why the portal chose me to do this, a fifteen-year-old kid with no ghost-busting experience. But it did. And if I want a ghost-free night’s sleep anytime soon, I’d better figure out how to get the job done. Because I’ve about had it with murderous ghouls and their unpleasant agendas. - Tallis ChallinorAfter the death of her parents, Tallis Challinor and her brother Wyatt must move to the Midwest to live with their mother’s sister and her family. When Aunt Sandra dies three-and-a-half years later, Tallis and Wyatt find themselves moving yet again, this time to New Hampshire to live with their father’s sister, Aunt Gabbie, and her husband Noreis. Gabbie is young, pretty and fun. Tallis remembers being a little girl and playing with her aunt at the family home in California, before her parents died. So Tallis is excited to re-locate and reconnect with Gabbie. But what should have been a happy reunion, is plagued with problems when Noreis opens a basement portal between the spirit and human worlds. Tallis is a practical kid. She doesn’t believe that ghosts exist. But, she can’t deny what she sees with her own eyes, and the two ghosts she meets at Thanksgiving in the basement of her aunt’s house are definitely not figments of her imagination, although she wishes they were. Tallis is unwittingly drawn to the portal’s energy when one of the ghosts fixates on her and forces her to assist in the release of three particularly nasty spirits. As a final blow, the portal chooses Tallis as a temporary gatekeeper and she finds herself charged with the duty of returning the very ghouls she’s set free, plus a few of their buddies, back to the spirit realm. As Tallis learns the secrets of the portal and begins to understand her newly acquired power, she formulates a plan to return the ghosts. Along the way, she receives help from many new friends who fill in the details about the identities of the escaped spirits, providing a possible motive for their outrageous actions. Tallis must learn to trust herself and others as she taps into her inner courage to get the job done and save her town from the angry and restless dead set.",
  "genres": [],
  "author": "K.D. Pryor",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/17726369-the-portal-s-choice"
}