{
  "title": "Admin Is Hell",
  "description": "\"Lawyers. You see, in days gone by, it was enough for a soul to be licentious and covetous and mean-spirited, and down here they’d end up. But now, we’ve got souls hiring lawyers to get them off, or get them a reduced sentence to Purgatory or maybe a lesser ring of Hell.\"When a sneaky, festive, extra-marital tryst ends in a double murder and suicidal bloodbath, you can be certain that there will hell to pay.Charles, for his sins, finds that he's been accepted for an eternal stay in the luxurious office buildings of Hell. The only people in all of Hell who seem to care at all are Charles' co-worker, Jocelyn, and a demon taxi driver called Pudenda. Nothing about the place is fair or reasonable and there is nothing that anybody can do about it. From the Vengeance Is Mine versus An Eye For An Eye court case, through murderous team building with Viking raiders and a special Hellympic Games, Hell seems to have gotten itself lost in a mire of rules and compliance. Can Charles make sense of it all before Hell grinds him down to a terrified, quivering mess, or will he just keep his head down and do as he is told?Admin Is Hell is a short novel about life, sin, the afterlife, belief and doing the right thing. The story follows the journey of possibly the most unremarkable and insignificant sinner in all of Hell as he struggles to understand his job, his surroundings and the meaning of everything that is. It is clear from the very outset that if Hell is looking for a hero, Charles is not the man for the job.Admin Is Hell is an adult book and is not suitable for children.Brief background: Admin Is Hell and its upcoming sequel are about certainty – the comfort of certainty. By ‘certainty’ here I mean, mostly religious certainty, but also political certainty. Make a statement that seeks to say something about your values and what you hold to be self-evident and try to live by that. Over time, however, it becomes apparent that ‘evidence’ is rather more definite than is opinion, which is all that religious (and political) certainty really boils down to. Are we willing to shape the world based on nothing better than an unassailable idea, with no room for debate, dissent or alternatives? Treading that path sees us kill each other in huge numbers because, give it long enough, and people eventually forget that these ideas they’re living by are only ideas, and nothing more. The book is also about the perils of being a ‘yes man’, going along with things because it seems like the less perilous thing personally to do. You can do horrific things with the justification that others told you to do it, or ‘made’ you do it, but where does it stop? This ties in with the religious certainty and is one of the themes of the first book in this universe particularly (book two is in the planning stages).",
  "genres": [
    "Fantasy"
  ],
  "author": "Michael Pugh",
  "average_rating": "3.47",
  "url": "https://www.goodreads.com/book/show/17727089-admin-is-hell"
}