{
  "title": "This Love of Mine",
  "description": "I needed an escape. An escape from my momma, a woman who cared more about herself than her own daughter. A woman who couldn't stand the sight of me since my father left. A boyfriend who was nothing but trouble. Trouble that I couldn't say no to.Unfortunately, leaving them both would prove to be either the best decision I could ever make, or the biggest mistake of my life.My plan was to escape to the one place I always felt safe. A place where life is simple and quiet, and a place where I could finish my senior year of high school unscathed. Abernathy, Texas was my second home, and my grandparents were the parents I aways wanted. There was no one around this one horse town to complicate my life any further, or at least that's what I thought. That was, until I met Madison Raine.He held the power to turn my peaceful escape upside down and inside out with just one look. He was beautiful, in every sense of the word and with that beauty, came trouble. There were a million reasons why I should stay away from him, but none of them seemed to matter when I caught sight of those emerald green eyes. It was becoming clear that staying away from Madison would be harder than I had anticipated.A past like mine never fully disappears, until you find yourself faced with the irreparable truth that sometimes you have to take matters into your own hands, consequences be damned.Kayla James (KJ) was everything I never knew I wanted. This was the last summer I would be on the farm before I headed off to college, and meeting her was the last thing I expected. I didn't know what had brought her here, and I honestly didn't care. I had my own things to deal with and a relationship wasn't one of them. Little did I know that this girl, would wind up being exactly what I needed in every way possible.Life hasn't always been easy, and telling my grandparents that I was going to college in another state was going to be the death of me, but it was something I needed to do. I needed a life outside of Texas, one where no one knew who I was or what I had lost. Between baseball and my band, I thought I had it made. All it took was one look into those baby blues and I was a goner. I ended up needing her like I needed air to breathe, and everything inside of me wanted to be with her regardless of the outcome. How do you choose between love and life, and convince the one person who trusts no one, to take a chance on you?(This is book #1 of three in The Raine Series. It contains mature language and situations)",
  "genres": [
    "Romance",
    "New Adult",
    "Contemporary",
    "Young Adult",
    "College",
    "High School",
    "Contemporary Romance"
  ],
  "author": "Amanda  Bennett",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/17726922-this-love-of-mine"
}