{
  "title": "A Broken Forever",
  "description": "What do you do when life as you know it is shattered beyond repair?Lilly had a perfect a mother she adored, a home she loved and Shep. Shep shared her birthday, her love of nature, and he held her heart. On their eighteenth birthday Shep proposes and Lilly tearfully accepts. However, their special day quickly becomes a nightmare when Lilly's mother vanishes leaving only a note. The search for Lilly's mother leads them to Neveah, a magnificent parallel world, unknown to the Ordinaries of Earth. Neveah is a magical land where creatures and Specials live amongst each other in Peace, until Jax Bane is born. Jax's evil heart, lust for power and obsession over Annika Levannah threatens life as every Neveahian knows it. Once in Neveah, Lilly and Shep must learn to believe the unbelievable as they travel the lands of Neveah, collecting followers. Lilly has to accept the fate handed to her and believe that she can save her mother from Jax. Dark secrets are exposed, hard truths are faced, and faith is tested as Lilly and Shep race to find her mother and stop the man that tore her family apart. Neveah, A Broken Forever, is a tragic love story set in a picturesque land that is full of creatures both beautiful and terrifying. A modern telling of a fantasy story written for adults.Reviews for Neveah A Broken Forever\"In a climate of war, revenge and fear, you can read, at the same time, about beautiful creatures, amazing abilities, beautiful love. Some scenes make you smile, other scenes are infuriating, other scenes are sad. This book has the light and the darkness.\" Amazon Review\"A perfect mix of romance and fantasy. A tale of true love and heroism. Neveah (A Broken Forever) will lead you on a journey that will send your imagination wanting more.\" Amazon Review",
  "genres": [
    "Fantasy",
    "Paranormal",
    "Fiction"
  ],
  "author": "Angie Merriam",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/10824641-a-broken-forever"
}