{
  "title": "Continental Life",
  "description": "Warning: Written for mature and open-minded individuals. Contains detailed graphic sexual encounters, including oral & anal sex, bondage and discipline. Passion, promises, desire, discipline... Having been only lovers, Bella and Xander must now become friends if their relationship is to endure the hardships of longevity. Before they can begin their new life together, they must also learn to accept each other for who they really are - in and out of the office and bedroom. For Bella, being the fiancé of a busy CEO is difficult enough, but being a full-time medical student as well, is even more challenging as she tries to find the time for her man and her education. For Xander, living the life of a worldly CEO and being the fiancé of a hard-working medical student has its up and downs, too. But he's no common CEO - he's also a dominant and an instructor at a prestigious domestic discipline training center, something he's finally forced to share with Bella, as well as all the feelings he had suppressed for so long.Realizing that being a submissive to Mr. Pettifor 9-5 doesn't compare to being his obedient partner 24/7, Bella thinks she has the perfect plan to strengthen their bond and to spend more time with her alpha male - to attend the school which Xander teaches at so that she learn exactly what he needs in a partner.Submerged in the domestic discipline lifestyle, she's forced to see the man she loves educating other women, something she wasn't prepared for. Headstrong and tenacious, Bella refuses to quit even when she realizes she must be willing to be instructed by other men in order to achieve her goal of finishing the DD Program. But is she really ready for that? Xander doesn't think so and he worries the training may harm rather than help their relationship.As Bella and Xander struggle to find their way and make their unconventional relationship work, it seems everyone and everything is trying to come between them. And so their dance of push and pull begins as they both fight their way through their emotions and fear of the unknown.",
  "genres": [
    "BDSM",
    "Romance",
    "Erotica",
    "Erotic Romance",
    "Contemporary Romance",
    "Adult",
    "Contemporary"
  ],
  "author": "Ella Dominguez",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/17727835-continental-life"
}