{
  "title": "Τα χαϊμαλιά του έρωτα και των αρμάτων: Αργώ ή πλους αεροστάτου, Ζεμφύρα ή το μυστικόν της Πασιφάης, Βεατρίκη ή ο έρωτας του Buffalo Bill",
  "description": "Ο τόμος \"Τα χαϊμαλιά του έρωτα και των αρμάτων\" του Ανδρέα Εμπειρίκου ανασυστήνεται μετά 50 χρόνια από την πρώτη ανακοίνωσή της και 67 χρόνια μετά τη συγγραφή της, η σπουδαία ερωτική τριλογία του ποιητή:1) \"Αργώ ή Πλους αεροστάτου\" - α΄ έκδοση με περικοπές στο περιοδικό Πάλι, 1964-65, α΄ έκδοση σε βιβλίο 1980.2) \"Ζεμφύρα ή Το μυστικόν της Πασιφάης\" - α΄ έκδοση 1998.3) \"Βεατρίκη ή Ο έρωτας του Buffalo Bill\" - ανέκδοτο μέχρι σήμερα.Η έκδοση συνοδεύεται από αναλυτική εισαγωγή του επιμελητή των κειμένων Γιώργη Γιατρομανωλάκη.Η περίφημη \"Αργώ\" είναι γραμμένη στο ζοφερό κλίμα της εμφύλιας διαμάχης του Δεκεμβρίου 1944. Λίγο μετά επιφυλάσσεται στον συγγραφέα μια τραυματική εμπειρία: συλλαμβάνεται, χωρίς καμία συγκεκριμένη κατηγορία (αρκούσε προφανώς το επίθετό του), από την Πολιτοφυλακή του ΕΛΑΣ, την ΟΠΛΑ, και οδηγείται όμηρος, μαζί με πολλούς άλλους, στα Κρώρα της Βοιωτίας. Αντιμετωπίζει θανάσιμους κινδύνους και μεγάλες κακουχίες, έως ότου καταφέρνει να δραπετεύσει και επιστρέφει σε κακή κατάσταση στην Αθήνα. Στο \"Αργώ ή Πλους αεροστάτου\" πλέκονται δύο παράλληλες ιστορίες: αφενός η εορταστική ανύψωση, η απογείωση του αεροστάτου \"Αργώ\" στην πρωτεύουσα της Κολομβίας Σάντα Φε ντε Μπογκοτά το 1906, με τους τρεις φλογερούς αεροναύτες -τον Άγγλο Λόρδο Ώλμπερνον, τον Γάλλο εξερευνητή Ερνέστο Λαρύ Νανσύ και τον Ρώσο ναύαρχο Βλαδίμηρο Βιερχόυ (με τον οποίο ταυτίζεται ο ποιητής)-, και αφετέρου η δραματική ιστορία του ζηλότυπου καθηγητή ντον Πέντρο Ραμίρεθ, της κόρης του Καρλόττας και του ινδομιγή εραστή της. Στο \"Ζεμφύρα ή Το μυστικόν της Πασιφάης\", που διαδραματίζεται στο Παρίσι το 1902, έχουμε τον έρωτα ενός λιονταριού (που ονομάζεται Ζαμβέζης) και της ομώνυμης θηριοδαμάστριας σ' ένα τσίρκο. Το παιχνίδι του έρωτα ανθρώπου/ζώου διεξάγεται, όχι μόνο ενώπιον των θεατών του τσίρκου, αλλά με την απειλή του θανάτου. Ωστόσο η φυσική αντιπαλότητα θηρίου-ανθρώπου καταλύεται για να κατισχύσει και για να δοξολογηθεί ο νικητής έρωτας.Η ανέκδοτη \"Βεατρίκη ή Ο έρωτας του Buffalo Bill\" αποτελεί, ίσως, το πιο παράδοξο κείμενο του Εμπειρίκου όσον αφορά την κατασκευή του και κατά συνέπεια τον τρόπο με τον οποίο αναπτύσσεται και περατώνεται η αφήγηση. Η Βεατρίκη συνίσταται από δύο ιστορίες, όμως εδώ τόσο ο τόπος όσο και ο χρόνος της μιας ιστορίας διαφέρει εντελώς από τον χρόνο και τον τόπο μέσα στον οποίο διαδραματίζεται η άλλη. Πρόκειται, θα λέγαμε, για μια διπλή \"δίπτυχη\" ερωτική και \"πολεμική\" ιστορία, όπου η μία περιέχεται μέσα στην άλλη έτσι ώστε ο μυθικός χρόνος της Βεατρίκης να είναι διπλός. Η πρώτη, η \"εξωτερική\" ιστορία με την οποία ανοίγει το κείμενο, αναφέρεται σε μια από τις πολλές περιπέτειες του γνωστού ήρωα της αμερικανικής δύσης Buffalo Bill ή κατά κόσμον William Cody και τοποθετείται \"ολίγα χρόνια\" μετά τον αμερικανικό Εμφύλιο. Ο μυθικός χρόνος της \"εσωτερικής\" ενδιάθετης ιστορίας συμπίπτει σε μεγάλο βαθμό με τον χρόνο της γραφής του ίδιου του κειμένου - Ιούλιος-Αύγουστος 1945. Η ένθετη ερωτική ιστορία του συγγραφέα με την μετέπειτα σύζυγό του Βιβίκα Ζήση έχει επιστολική μορφή καθώς περιέχει έξι επιστολές που ανταλλάσσουν η Βιβίκα/Βεατρίκη με τον Εμπειρίκο/ Buffalo Bill.Απόσπασμα: \"Έτσι εδιάβαινε ο Buffalo Bill μια νύχτα του Ιούλη - ο Buffalo Bill o μέγας ποιητής του Νέου Κόσμου, ο αετός του Κολοράντο, Δάντης μαζί και ανιχνευτής με την εξαίσια Βεατρίκη, το πιο απαλό, το πιο εύοσμον και το πιο ωραίον άνθος της πραιρίας\".Σ' όλα τα κείμενα της τριλογίας του Εμπειρίκου υπόκεινται κοινές βασικές ιδέες που υποστηρίζουν τις ίδιες κατά βάσιν αρχές, την ίδια ιδεολογία: ο μοναδικός τρόπος για να αρθούν οι πολλές και ποικίλες αντινομίες του πολιτισμού, η μόνη οδός και η μόνη δύναμη που μπορεί να απελευθερώσει τον κόσμο (κοινωνικά, οικονομικά, πολιτικά) είναι ο έρωτας, ο \"άνευ ορίων και άνευ όρων\" έρωτας. Υπό την έννοια αυτή και τα τρία κείμενα της τριλογίας αφηγούνται, το καθένα με τον τρόπο του, μια ερωτική ιστορία, όμως τελικά συστήνουν και μια ιστορία απελευθέρωσης ατομικής και δίνουν μια εικόνα μελλοντικής οικουμενικής ανάτασης και ελευθερίας. Και οι τρεις ιστορίες έχουν και πολιτικό χαρακτήρα. Και στις τρεις ιστορίες (ειδικά στην Αργώ και στην Βεατρίκη) ακούγονται (υπόκωφα και από μεγάλο βάθος, είναι αλήθεια) τα φρικτά πολιτικά και κοινωνικά γεγονότα που βιώνει ο συγγραφέας την εποχή της συγγραφής τους. Η βία του ντον Πέντρο συνδέεται με την βία της γαλλικής επανάστασης που αναθυμάται ο Γάλλος αεροναύτης και, προφανώς, δεν είναι άσχετη από όσα συμβαίνουν στην αιματοκυλισμένη Αθήνα του 1944-1945. Το ίδιο παρακολουθούμε και στην ιστορία του Buffalo Bill. Ο σφαγιασμός των μεταναστών μέσα στο άγριο τοπίο του Grand Canyon παραπέμπει, δίχως αμφιβολία, στη φρικτή δοκιμασία του ομήρου Εμπειρίκου και άλλων αθώων μέσα στον άγριο Δεκέμβριο του 1944. Η βία στην Ζεμφύρα δεν είναι μόνο ερωτική, ή βία των άγριων ζώων - το κατηγορώ του πλανόδιου ποιητή δείχνει πως στην φαινομενικά απλή ερωτική ιστορία αναμοχλεύονται πολλές μορφές βίας του ανθρώπινου πολιτισμού.Όλες αυτές οι, φαινομενικά εκτός τόπου και χρόνου, ερωτικές/ρομαντικές ιστορίες που αναπτύσσονται και εξελίσσονται μέσα σε ένα αρχικό περιβάλλον φόβου, βίας και θανάτου, για να κατισχύσει τελικά ακατανίκητος ο έρωτας και η ζωή, αφορούν, όπως έχουμε υπαινιχθεί, το πρόσωπο του ίδιου του αφηγητή, του συγγραφέα Εμπειρίκου.Στη Ζεμφύρα ο πλανόδιος ποιητής του Παρισιού, που προβάλλει ως προσωπείο και αντανάκλαση του Ανδρέα Εμπειρίκου, απευθύνει κατηγορίες στους κυνικούς, πτωχοπροδρόμους, \"παρακοιμωμένους κάθε ανθρώπινης ανεπάρκειας, τους υπερμάχους της κάθε ηττοπάθειας, τους ευνουχισμένους χριστιανούς [...] τους κιβδηλοποιούς του έρωτα και των αρμάτων, τους πάσης φύσεως προαγωγούς της τέχνης [...] τους ηθικολόγους και ανηθικολόγους, τους πάσης φύσεως βρωμερούς και σκατολόγους\".",
  "genres": [],
  "author": "Andreas Embirikos",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/17728473"
}