{
  "title": "Bathing Beauties, Booze And Bullets",
  "description": "\"Boardwalk Empire\" meets \"Miss Universe\" in 1927 Galveston, Texas-the \"Sin City of the Southwest.\" Jasmine (\"Jazz\") Cross is an ambitious 21-year-old society reporter for the Galveston Gazette who wants to be taken seriously by the good-old-boy staff, but the editors only assign her fluffy puff pieces, like writing profiles of bathing beauties. The last thing Jazz wants to do is compare make-up tips with ditzy dames competing in the Miss Universe contest, known as the \"International Pageant of Pulchritude and Bathing Girl Revue.\" She'd rather help solve the murders of young prostitutes who turn up all over town, but city officials insist on burying the stories during Splash Day festivities. After Jazz gets to know the bathing beauties, she realizes there's a lot more to them than just pretty faces and figures. Jazz becomes suspicious when she finds out the contest is also sponsored by the Maceos, aspiring Beach Gang leaders and co-owners of the Hollywood Dinner Club, where the girls will perform before the parade and pageant. Worse, her half-brother Sammy Cook, owner of the Oasis, a speakeasy on a rival gang's turf, asks her to call in a favor from handsome Prohibition Agent James Burton: He wants Agent Burton to raid the Hollywood Club during the bathing beauties dance routine--or risk revenge from the Downtown Gang leader. Her loyalties torn, Jazz is faced with an impossible task that could compromise both of their jobs and budding romance. Meanwhile, Jazz fends off advances from Colin Ferris, an attractive but dangerous gangster who threatens Sammy as well as Burton. In the end, she must risk it all to save her friends from a violent killer hell-bent on revenge. Inspired by actual events. (Sequel to FLAPPERS, FLASKS AND FOUL PLAY, the first \"Jazz Age Mystery\" in the series.)",
  "genres": [
    "Historical Fiction",
    "Mystery",
    "Cozy Mystery"
  ],
  "author": "Ellen Mansoor Collier",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/17729623-bathing-beauties-booze-and-bullets"
}