{
  "title": "Voices of Haiti",
  "description": "Voices of Haiti combines the poetry of Kwame Dawes, the prose of Lisa Armstrong, the photography of Andre Lambertson and the music of Kevin Simmonds to weave a story of Haitian resilience amid poverty, displacement, HIV/AIDS, and violence. The e-book was designed in-house by Jake Naughton with Apple’s free iBooks Author platform.“It was beautiful to see this book in a form of this kind,” photographer Andre Lambertson said of Voices of Haiti’s special jury recognition in POYi’s “Best e-books” category. “I felt it wonderfully combined the work of three different journalists in a unique platform, offering a compassionate window into a difficult world that is often sensationalized.”Voices of Haiti editor Kem Knapp Sawyer said: “It was thrilling to see how all the pieces fit together. I enjoyed working with a poet, a photographer, a reporter, a composer and a soprano with a beautiful voice. Each had different talents and they all came together to make the voices of Haiti heard.”Voices of Haiti is available for purchase in iTunes, along with the Pulitzer Center’s e-book on the global statelessness crisis, In Search of Home, which features the photography of Greg Constantine and the writing of Stephanie Hanes—and was also designed in-house using Apple's iBooks Author platform.“This iBook is the culmination of a multi-year project,” said Pulitzer Center Executive Director Jon Sawyer. “The work has been featured in The New York Times, PBS NewsHour, USA Today and other media outlets—and in live performances at the National Black Theatre Festival and in Port au Prince, Miami, and Washington, DC. Voices of Haiti brings all of that together, with indelible portraits of remarkable individuals.”Sawyer noted that the Pulitzer Center’s e-book initiative is aimed at reaching new audiences, creating new sources of income for journalists, and ensuring sustained engagement with important global issues.“The goal is to make these e-books the capstone for many of our projects,” Sawyer said, “to give readers an immersive, visually compelling, and narrative-driven experience. We’re honored by the POYi award—and we hope the recognition will bring even more readers to this extraordinary work.”For 70 years, the Missouri School of Journalism has administered the Pictures of the Year international (POYi) Awards. POYi aims to extend the reach of photojournalists, bringing documentary photography to the general public while highlighting the role of the visual journalists in civic engagement. Each year, nearly 50,000 works are submitted to the POYi awards by photojournalists representing over 70 countries. 240 winners are selected in over 50 categories by a panel of renowned journalists.The Pulitzer Center on Crisis Reporting supports in-depth coverage of international affairs, focusing on topics that have been under-reported or not reported at all. Its honors include an Emmy for new approaches to news and documentaries and awards from the National Press Foundation, the National Press Club, and the Society of Professional Journalists. The Center’s Global Gateway program engages directly with high school and university students, building a constituency among younger audiences for quality global news coverage. To learn more, please visit http://pulitzercenter.org.",
  "genres": [],
  "author": "Kem Knapp Sawyer",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/17729912-voices-of-haiti"
}