{
  "title": "Woud van de dood",
  "description": "Atlanta's hottest assistant district attorney, Mary Crow (she's half Cherokee), has just made it six-for-six in murder convictions with her defeat of Calhoun \"Handsome Cal\" Whitman, and is heading home to Little Jump Off, North Carolina, for a hiking vacation with pals Alexandra McCrimmon and Joan Marchetti. It's been 12 years since the unresolved rape and murder of Mary's mother, and she's looking forward to making her first trip back home in the company of friends. But though it begins well, it soon turns very, very bad: Joan felt the shadow first. A small interstice of darkness fell across the bright sunlight that bathed her face. A cloud, she thought. But the chill did not move. Reluctantly she opened her eyes to see what was obstructing the light that had just a moment ago warmed her so deliciously. A colossus stood above her. Its face blocked the sun, and she could see nothing but a black shape haloed with a corona of blinding light. What fills the remaining pages is nothing short of harrowing: stalking, chasing, raping, kidnapping, and murder at the hands of not one, but two very different but equally dangerous madmen. One is a deranged mountain man who's been haunting the hills for years, and another's motivation is darker and more personal. What Sallie Bissell has done so well with in In the Forest of Harm might have easily turned into a Deliverance-meets-\"Charlie's Angels\" farce in the hands of a lesser writer. Indeed, while there are echoes of Dickey's Deliverance and strains of Sharyn McCrumb's She Walks These Hills --near poetic phrasing, ringing depictions of a majestic Southern wilderness, crisp characterizations, bow-taut suspense--Bissell's words are surely her own. All suspense novels should be this good; that this one is a debut novel is a little scary. --Michael Hudson",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Mystery Thriller",
    "Suspense",
    "Native Americans",
    "Native American"
  ],
  "author": "Sallie Bissell",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/10825296-woud-van-de-dood"
}