{
  "title": "Savage Life and Scenes in Australia and New Zealand: Being an Artist's Impressions of Countries and People at the Antipodes, Volume 1",
  "description": "This historic book may have numerous typos and missing text. Purchasers can download a free scanned copy of the original book (without typos) from the publisher. Not indexed. Not illustrated. 1847. Excerpt: ... CHAPTER IV. NOTES OF AN EXPLORING JOURNEY ALONG THE SOUTHEAST COAST OF SOUTH AUSTRALIA, IN COMPANY WITH HIS EXCELLENCY, CAPTAIN GREY. The Coorong--Lacepede Bay--The Desert--Riroli Bay--The New Country--Mount Shanck and Mount Gambier, with their Volcanic Lakes. April 10th, 1844.--His Excellency's party consisted of Mr. Burr, the deputy surveyor-general, Mr. Bonney, the overland traveller, Mr. Gisborne, and myself; five of the mounted police force, two men belonging to the detachment of sappers and miners, with servants and bullock-drivers, made us about eighteen in number. A couple of drays and a light two-horse cart conveyed provisions for two months, with tents, bedding, instruments, and other articles necessary for a journey through the wilds. The drays proceeded in advance of us to the Bremer, where our place of rendezvous was appointed, and whence we were to start together for the Murray. 118 A CLEARING. The 10th of April was a sultry day; the ranges to the eastward of Adelaide were to he crossed; and it was not till late in the afternoon that we mounted our horses, at Mr. Burr's residence at Greenhill Creek, and proceeded on our way up those steep and romantic hills that I have described in a former chapter. Burr, Bonney, Gisborne, and myself, all in \" bush\" costume, with tether-ropes and pannikins slung to our saddles, jogged on through the winding paths and beneath the rich shadows of the stringy-bark forests, till long after the last rays of the setting sun had flashed up from beyond the blue waters of the gulf, that lay bathed in red and purple glory to the westward. From these mountains, it is a sight inconceivably grand to watch the day and the sunshine ebbing away over that gulf. The cicada had ceased to chirp, and the merry voices and ringing...",
  "genres": [],
  "author": "George French Angas",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/10825443-savage-life-and-scenes-in-australia-and-new-zealand"
}