{
  "title": "White Space Van Man",
  "description": "From their very beginnings man has gazed up to the stars in wonderment to their purpose and then strive to one day reach them. They applied themselves to create machines that gave a small glimpse into the magical opportunities that lie in the skies above. With their dreams and aspirations of knowledge and exploration man’s technology progressed to the point in a not so far off future where the fantasy became a reality. The only problem with reality is that it often acts like a pin and bursts said dream bubbles. It certainly felt this way for Barry, for travelling open space and journeying across the solar system was far from exhilarating and stimulating; it was just another droll and mundane day in his underpaid and unappreciated employment. For Barry is just one of millions of delivery pilots of a white space-van, distributing medical supplies to far off planetary colonies that thoroughly despises his job, and carries it out with absolutely no motivation or enthusiasm; it is the English way. It is a mind-numbingly lonely job with only an on-board computer for company, and he, to be honest, is a bit of a dweeb. Supplied with a personality chip programed by a weirdo with no personality the computer doesn’t serve its purpose very well and therefore Barry longs for even the simplest change to his dull life of flying around open space, getting aggravation from his boss and eating pasties.Little did he know that the change would indeed come and sooner than he thought. Thanks to an unknown delivery package Barry engages on an unbelievable adventure where he rumbles with a hostile alien race, survives on a desolate planet and befriends a gorgeous female warrior from a future world. All of his skills as a space van driver are well and truly put the test when he finds himself on a mission to save the universe (just as many white van drivers think they are doing when they speed and drive erratically.)So journey with us, gain some guaranteed giggles and find out if this dribbling buffoon, this pasty-addicted and prematurely aging doughnut of a man can indeed be the new sci-fi hero of the hour (or am I just building the hype up too much?)",
  "genres": [],
  "author": "Darren Worrow",
  "average_rating": "4.85",
  "url": "https://www.goodreads.com/book/show/17731290-white-space-van-man"
}