{
  "title": "Midnight Train to Paris",
  "description": "Dive into the pages of the bestselling third novel in Juliette Sobanet’s City of Light series for a thrilling ride to Paris that you'll never forget…When hard-hitting DC reporter Jillian Chambord learns that her twin sister, Isla, has been abducted from a luxury train traveling through the Alps, not even the threat of losing her coveted position at The Washington Daily can stop her from hopping on the next flight to France. Never mind the fact that Samuel Kelly—the sexy former CIA agent who Jillian has sworn off forever—has been assigned as the lead investigator in the case.When Jillian and Samuel arrive in the Alps, they soon learn that their midnight train isn’t leading them to Isla, but has taken them back in time to 1937, to a night when another young woman was abducted from the same Orient Express train. Given a chance to save both women, Jillian and Samuel are unprepared for what they discover on the train that night, for the sparks that fly between them…and for what they’ll have to do to keep each other alive.Midnight Train to Paris is a magical and suspenseful exploration of just how far we will go to save the ones we love.What Reviewers are saying about Midnight Train to Paris:“This was the most exciting book I've read in a long time.”“A fabulous modern fairy tale.”“If there is a sequel, I WILL be reading it.”“Loved every minute of the story.”“Exciting, romantic, and full of twists and turns.” “It's fun, imaginative, well written and really does remind me of film noir.”“Great writer, great story. I couldn't put it down.” “Jill and Samuel were THE BEST!”“Wow, Juliette has done it again.” City of Love series:Sleeping with ParisKissed in ParisHoneymoon in ParisA Paris DreamCity of Light Series:One Night in ParisDancing with ParisMidnight Train to ParisCity of Darkness Series:All the Beautiful BodiesTrue Stories in the City of Love:Meet Me in ParisI Loved You in ParisJuliette Sobanet’s captivating Paris novels have reached over 500,000 readers worldwide, hitting the top 100 Bestseller Lists on Amazon US, UK, France, and Germany, becoming bestsellers in Italy and Turkey as well. Time for that magical journey to Paris? All you have to do is grab your copy of Midnight Train to Paris and you’ll be swept away…",
  "genres": [
    "Romance",
    "Time Travel",
    "Mystery",
    "Fiction",
    "Chick Lit",
    "Historical Fiction",
    "Fantasy"
  ],
  "author": "Juliette Sobanet",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/17731033-midnight-train-to-paris"
}