{
  "title": "Mountain Charm",
  "description": "“True love and sweet whispers, till death do us part;Send someone to love my Appalachian heart.”At the age of thirteen, Angelina Clark followed in the footsteps of her ancestors by casting an Appalachian love spell, which promised she would blossom into a beautiful and gifted woman who would find her true love. A young Angelina had been thrilled to participate in the sacred ritual, but through the years, her father’s untimely death and her mother’s failing health have shaken Angelina’s magical faith to its core. As her twenty-first birthday approaches, she refuses to practice her supernatural gifts and no longer believes in the love charm.That is, until Dylan Thomas arrives on her front porch.Dylan, a Nashville writer, travels to the mountain town of Maple Ridge to unearth the family’s supernatural secrets. While her clairvoyant mother is convinced that Dylan is her daughter’s soul mate, Angelina refuses to see the nosy reporter as anything more than a nuisance.Despite their constant bickering, sparks fly.Dylan admits he feels strangely drawn to Angelina and is in no hurry to leave Maple Ridge or publish his magazine article. Fearful that his emotions are being influenced by the spell, a stubborn Angelina struggles to fight her own budding attraction to the reporter. The two inevitably grow closer just as her mother’s health begins to deteriorate, and Angelina is faced with the possibility of selling the family’s music shop to pay the mounting medical expenses. Desperate to help the woman he loves, Dylan explores his own family tree and finds support from an unlikely source. Can he finally prove his love is real—spell or no spell?A story filled with love, friendship, family, and just a hint of Appalachian magic, Mountain Charm will leave you spellbound.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Fantasy",
    "New Adult",
    "Contemporary",
    "Paranormal Romance",
    "Magic"
  ],
  "author": "Sydney Logan",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/17731644-mountain-charm"
}