{
  "title": "Bitter Memories: A Memoir of Heartache & Survival",
  "description": "When Sue Julsen was two, her father attempted to run away with her but was stopped before he reached the city limits. A year later Sue was not so lucky. Her father had spent that intervening year biding his time, lulling the family into a false sense of security, so that when he abducted Sue again he would get clean away. And he did.It turned out to be, for Sue, the start of a six year road trip from hell during which she was subjected to unremitting exploitation, starvation and abuse so severe that she constantly had to disassociate herself mentally from it to survive.And beyond the overwhelming heartbreak and terror, there was a nagging question. Sue’s father would regularly hook up with waitresses in diners and they would stay a few days with them. But why then, each time, did he end up trashing the place and refusing to let Sue say goodbye to them. Were these waitresses really sleeping, as he would insist, or was something more sinister happening?Disclaimer:The names in this account have been changed to protect the innocent and the guilty, as has the locale, but the events described in ‘Bitter Memories’ did indeed take place as best Sue Julsen can remember them as a very small child hurled into a maelstrom no child should ever have to face.NOTE: ADULT LANGUAGE, GRAPHIC CONTENTThis is not a cozy, feel-good read. It is a true story of extreme child abuse and the will to survive. Language and content is not suitable for anyone under 18 years of age.This is the first in the series. Although I'm using my real name in the above description, my name in the book is Sarah.Cover design by Gary McCluskeyPlease visit my website to learn about all my books: memoir series, true crime, crime fiction series, and the first in a fantasy series.http://sj2448.wix.com/suejulsen",
  "genres": [
    "True Crime"
  ],
  "author": "Sue Julsen",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/17732064-bitter-memories"
}