{
  "title": "Edge of Desire (The Edge Series, A Middleton Family Billionaire Novel), Book 3",
  "description": "**This book was formerly published under the title Kissing Fire. It has undergone comprehensive edits, but the characters, plot, and story line remain the same.Avery MiddletonBeware of swoony strangers. You never know what lurks beneath their surface.My life was utter chaos. On the surface, it appeared I had it all -- wealth, a prominent family, influential connections, and a fabulous job.Except appearances were deceiving. My selfish mother was driving me bonkers, my kooky neighbor had plans for me to become a sumo wrestler, and my social life was in the tank.When an enticing job opportunity arose, I seized the chance for a fresh start, packed my bags, and ventured across the country, ready to begin a brand-new life.To my surprise, fate intervened, and I was flung into the path of the captivating Miles Patterson. Tall, dark, and desirable described him to a tee. Only Miles wasn’t who he appeared to be.Unbeknown to me, he was an undercover DEA agent, harboring a multitude of secrets, including his real identity.That fresh start of mine? It landed me in mayhem, entangling me in one of said DEA agent’s missions with a target on my back, and running for my life.To top that off, I discovered who Miles really was.His determination to protect me at all costs was commendable and I found myself undeniably drawn to him.Except his past had left him with enough emotional baggage to fill an ocean.The barrier surrounding him was so high and thick, it would take a bulldozer to tear it down.Undeterred, my resolve grew to breach his defenses. When I finally broke through, an extraordinary connection began to blossom. Amidst a backdrop of danger, intrigue, and deception, could our burgeoning love endure the innumerable challenges that threatened to tear us apart?This is a spicy, billionaire, curvy girl, enemies to lovers, forced proximity novel, sprinkled with lots of humor and emotion. If you enjoy a guy saves girl with a happy ever after, then grab this book today!",
  "genres": [
    "Romance",
    "Contemporary",
    "New Adult",
    "Suspense",
    "Humor",
    "Erotica",
    "Drama"
  ],
  "author": "A.M. Hargrove",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/17733433-edge-of-desire-the-edge-series-a-middleton-family-billionaire-novel"
}