{
  "title": "Standing Next to History: An Agent's Life Inside the Secret Service",
  "description": "Joseph Petro served for 23 years as a special agent in the United States Secret Service; eleven of them with presidents and vice presidents. For four of those years he stood by the side of Ronald Reagan.Following his career as a Navy Lieutenant, during which he patrolled the rivers and canals along the Vietnamese-Cambodian border, he worked his way up through the Secret Service to become one of the key men in charge of protecting the President. That journey through the Secret Service provides an individual look inside the most discreet law enforcement agency in the world, and a uniquely intimate account of the Reagan presidency.Engagingly, Joseph Petro tells \"first hand\" stories riding horses with the Reagans; eluding the press and sneaking the President and Mrs. Reagan out of the White House; rehearsing assassination attempts and working, then re-working every detail of the president's trips around the world; negotiating the president's protection with the KGB; diverting a 26 car presidential motorcade in downtown Tokyo; protecting Vice-President Dan Quayle at Rajiv Gandhi's funeral where he was surrounded by Yassir Arafat's heavily armed bodyguards; taking charge of the single largest protective effort in the history of the Secret Service-Pope John Paul II's 1987 visit to the United States; and being only one of three witnesses at the private meeting between President Reagan and Mikhail Gorbachev that ushered in the end of the Cold War.Joseph Petro provides an original and fascinating perspective of the Secret Service, the inner workings of the White House and a little seen view of world leaders, as a man who stood next to history.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Politics",
    "Memoir",
    "Biography Memoir",
    "Autobiography"
  ],
  "author": "Joseph Petro",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/1773355.Standing_Next_to_History"
}