{
  "title": "The Crypt of Dracula",
  "description": "For too long, evil has slumbered. But now, the prince of darkness has arisen…and he thirsts.THE CRYPT OF DRACULAIn 1899, master stone craftsman Andreas Wagner takes a job restoring an old castle in the rural mountains of Hungary. He and his mute young wife are hoping to find a new life, after the traumatic death of their infant daughter from a strange wasting disease in Munich. The eccentric Count who owns the castle, a suave but distant man, keeps strange hours. Still, Wagner settles in to the work nicely. But then strange things start to happen in the remote castle on the cliff. The Count’s manservant is alternately elusive or confrontational. The locals are secretive and suspicious. Wagner is nearly killed by inexplicable falling masonry. A giant bat attacks his companions. Ghostly apparitions of women with claws and fangs prowl the halls of the gloomy castle late at night. When his friend falls ill from the same disease his daughter died of, Wagner decides it’s time to leave and look for a doctor, even if it means abandoning gainful employment. But Count Dracula and his minions have other plans. For Wagner, what began as a simple job, soon becomes a frantic battle for survival and a race against the setting sun to rescue his wife and stop the spread of an ancient evil.“All the hallmarks of a great 1970s classic creature flick are here: spooky castle, the gentleman creature of the night, and harried villagers poised to grab pitchforks and torches. Gilmour brings Dracula back, with a dash of 21st century adventure and a twist you won’t see coming.” —Jeremy Bishop, #1 bestselling horror author of Torment and The Sentinel“THE CRYPT OF DRACULA is how a vampire novel should be written. It’s suspenseful, frightening, dark, and realistic. It harkens back to the day when ‘monster’ movies played at Saturday matinees and at midnight showings. Somewhere, Bram Stoker is smiling. He’s beaming from ear to ear because someone finally got it right, and that someone is Kane Gilmour.” —Mark Adduci, Suspense Magazine“If you are a fan of the old-style Dracula stories, you will definitely enjoy reading THE CRYPT OF DRACULA by Kane Gilmour. Kane did an amazing job recreating the feel of Stoker while adding his own style. Travel to a magnificent castle perched dangerously on a cliff in Romania, with a very dark and dangerous secret. Within the walls hide your worst nightmares, blood-thirsty and evil. Finally, a vampire that makes you weak in the knees and afraid of the dark. There are definitely no emo, glittering vampires in this book! Be prepared to sleep with the lights on.” —Carol ‘Pixie’ Brearley, author of RISE OF THE DARK ANGEL“Experience the Count again...for the first time! Gilmour’s version of Dracula is both homage to the classic Hammer films and a re-imagining that will have you peeking out your covers at night, while at the same time giggling like Renfield with each turn of the page. Don’t let the sun go down before getting this awesome book!” —J. Kent Holloway, author of DEVIL’S CHILD and THE CURSE OF ONE-EYED JACK",
  "genres": [
    "Horror",
    "Vampires"
  ],
  "author": "Kane Gilmour",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/17733945-the-crypt-of-dracula"
}