{
  "title": "Kingdom Coming : The Rise of Christian Nationalism",
  "description": "Michelle Goldberg, a senior political reporter for Salon.com, has been covering the intersection of politics and ideology for years. Before the 2004 election, and during the ensuing months when many Americans were trying to understand how an administration marked by cronyism, disregard for the national budget, and poorly disguised self-interest had been reinstated, Goldberg traveled through the heartland of a country in the grips of a fevered religious radicalism: the America of our time. From the classroom to the mega-church to the federal court, she saw how the growing influence of dominionism—the doctrine that Christians have the right to rule nonbelievers—is threatening the foundations of democracy.In Kingdom Coming, Goldberg demonstrates how an increasingly bellicose fundamentalism is gaining traction throughout our national life, taking us on a tour of the parallel right-wing evangelical culture that is buoyed by Republican political patronage. Deep within the red zones of a divided America, we meet military retirees pledging to seize the nation in Christ's name, perfidious congressmen courting the confidence of neo-confederates and proponents of theocracy, and leaders of federally funded programs offering Jesus as the solution to the country's social problems.With her trenchant interviews and the telling testimonies of the people behind this movement, Goldberg gains access into the hearts and minds of citizens who are striving to remake the secular Republic bequeathed by our founders into a Christian nation run according to their interpretation of scripture. In her examination of the ever-widening divide between believers and nonbelievers, Goldberg illustrates the subversive effect of this conservative stranglehold nationwide. In an age when faith rather than reason is heralded and the values of the Enlightenment are threatened by a mystical nationalism claiming divine sanction, Kingdom Coming brings us face to face with the irrational forces that are remaking much of America.",
  "genres": [
    "Religion",
    "Politics",
    "Nonfiction",
    "History",
    "Christianity",
    "Sociology",
    "Atheism"
  ],
  "author": "Michelle Goldberg",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/1082714.Kingdom_Coming_"
}