{
  "title": "Feather Light",
  "description": "Parker Davis has conquered three major American cities and is the new ‘it’ man in massage. He earned the nickname ‘Feather Light’ for his sensual touches, tender caresses, and soft voice eliciting an almost orgasmic release. Clients from all over clamor for his services and his clientele are growing by the minute. Business is at its peak, which makes Parker a busy man who has no time to deal with problems, let alone dwell on his blindness. With his declining vision, Parker has to accept his limitations and the changes brought forth by this disease, but he is not ready to relinquish the last control he has left. He is still the master in his bedroom. Kelly Storm, a Hollywood actress, will do whatever it takes to get some much-deserved peace. Being famous has its perks, except the little privacy her popularity afforded her is slowly eating at her. With the paparazzi hounding her every minute of the day, and her personal life under constant scrutiny, Kelly wants a semblance of normalcy wherever she can get it. Under the urging of a close friend, she agrees give Parker a try.  Their first meeting is nothing she expected. Kelly finds comfort in his gentle probing and the spellbinding experience guaranteed to keep her coming back for more. Parker knows the woman on his table is special. He feels her vulnerability with his fingertips and her smooth curves leave a burning ache inside him.One night of steamy passion is all it takes to know that they wanted each other in more ways than one. Kelly hides in heavy disguises, making it impossible for Parker to know her true identity. What secret is Kelly keeping and will she trust Parker enough to tell him the truth? Will Parker see beyond Kelly’s lies to show her what a future with him holds?",
  "genres": [
    "Erotica",
    "Contemporary",
    "Fiction",
    "Romance"
  ],
  "author": "Lorenz Font",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/17735308-feather-light"
}