{
  "title": "The Queen of the Big Time",
  "description": "Known and loved around the world for her sweeping Big Stone Gap trilogy and the instant New York Times bestseller Lucia, Lucia, Adriana Trigiani returns to the charm and drama of small-town life with Queens of the Big Time. This heartfelt story of the limits and power of love chronicles the remarkable lives of the Castellucas, an Italian-American family, over the course of three generations.In the late 1800s, the residents of a small village in the Bari region of Italy, on the shores of the Adriatic Sea, made a mass migration to the promised land of America. They settled in Roseto, Pennsylvania, and re-created their former lives in their new home–down to the very last detail of who lived next door to whom. The village’s annual celebration of Our Lady of Mount Carmel–or “the Big Time,” as the occasion is called by the young women who compete to be the pageant’s Queen–is the centerpiece of Roseto’s colorful old-world tradition.The industrious Castellucas farm the land outside Roseto. Nella, the middle daughter of five, aspires to a genteel life “in town,” far from the rigors of farm life, which have taken a toll on her mother and forced her father to take extra work in the slate quarries to make ends meet. But Nella’s dreams of making her own fortune shift when she meets Renato Lanzara, the son of a prominent Roseto family. Renato is a worldly, handsome, devil-may-care poet who has a way with words that makes him irresistible. Their friendship ignites into a fiery romance that Nella is certain will lead to marriage. But Nella is not alone in her pursuit: every girl in town seems to want Renato. When he disappears without explanation, Nella is left with a shattered heart. Four years later, Renato’s sudden return to Roseto the night before Nella’s wedding to the steadfast Franco Zollerano leaves her and the Castelluca family shaken. For although Renato has chosen a path very different from Nella’s, they are fated to live and work in Roseto, where the past hangs over them like a brewing storm.An epic of small-town life, etched in glorious detail in the trademark Trigiani style, The Queen of the Big Time is the story of a determined, passionate woman who can never forget her first love.From the Hardcover edition.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Chick Lit",
    "Romance",
    "Book Club",
    "Italy",
    "Audiobook"
  ],
  "author": "Adriana Trigiani",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/108289.The_Queen_of_the_Big_Time"
}