{
  "title": "The Tiger in the Attic: Memories of the Kindertransport and Growing Up English",
  "description": "In 1939, on the eve of Hitler's invasion of Poland, seven-year-old Edith Milton (then Edith Cohn) and her sister Ruth left Germany by way of the Kindertransport, the program which gave some 10,000 Jewish children refuge in England. The two were given shelter by a jovial, upper-class British foster family with whom they lived for the next seven years. Edith chronicles these transformative experiences of exile and good fortune in The Tiger in the Attic , a touching memoir of growing up as an outsider in a strange land.In this illuminating chronicle, Edith describes how she struggled to fit in and to conquer self-doubts about her German identity. Her realistic portrayal of the seemingly mundane yet historically momentous details of daily life during World War II slowly reveals istelf as a hopeful story about the kindness and generosity of strangers. She paints an account rich with colorful characters and intense relationships, uncanny close calls and unnerving bouts of luck that led to survival. Edith's journey between cultures continues with her final passage to America—yet another chapter in her life that required adjustment to a new world—allowing her, as she narrates it here, to visit her past as an exile all over again.The Tiger in the Attic is a literary gem from a skilled fiction writer, the story of a thoughtful and observant child growing up against the backdrop of the most dangerous and decisive moment in modern European history. Offering a unique perspective on Holocaust studies, this book is both an exceptional and universal story of a young German-Jewish girl caught between worlds.“Adjectives like ‘audacious’ and ‘eloquent,’ ‘enchanting’ and ‘exceptional’ require rationing. . . . But what if the book demands these terms and more? Such is the case with The Tiger in the Attic , Edith Milton’s marvelous memoir of her childhood.”—Kerry Fried, Newsday“Milton is brilliant at the small stroke . . . as well as broader ones.”—Alana Newhouse, New York Times Book Review",
  "genres": [
    "Memoir",
    "History",
    "Holocaust",
    "Nonfiction",
    "World War II",
    "Biography Memoir"
  ],
  "author": "Edith Milton",
  "average_rating": "3.55",
  "url": "https://www.goodreads.com/book/show/1082929.The_Tiger_in_the_Attic"
}