{
  "title": "A Knight in Central Park",
  "description": "The year is 1499. As Alexandra Dunn’s farmhouse is set ablaze, her grandfather places precious stones in her palm, telling her she has until the next full moon to return with a hero...a brave, chivalrous knight to help save her family. Familiar objects become a blur as she is swallowed in darkness. Suddenly Alexandra is standing in the middle of Central Park, but she has no time to ponder on the wondrous powers of the stones or the amazing sights before her...she must find a hero before all is lost. Joe McFarland would be the first to admit that he’s far from hero material…definitely not the man she’s looking for. A firm believer of quietude and non-violence, he avoids conflict at all costs. At thirty-four, he is one of the younger Professors at NYU where he lectures and teaches The High Middle Ages. Joe’s main goal in life is to gain membership into the Medieval Academy, a highly distinguished group of archaeologists and historians. He believes membership will bring him respect and recognition…but what he really wants is to be reunited with his father; a man who has spent his entire life searching for the Black Knight, the last of the medieval knights. Joe’s organized, well-structured life begins to unravel the moment he meets Alexandra Dunn. He figures she majored in medieval history before going off the deep end…until days later when he is miraculously transported through time, to 1499 England. Dressed in Dockers and a button down shirt, Joe thought he was ready for anything...anything but this! An armored man with a very authentic looking broadsword is about to strike him down. With only nail clippers and a Bic to defend himself, Joe has no time to think about such an implausible phenomenon as traveling through time…not if he wants to live to see another day. 390 pages ABOUT THE AUTHOR Theresa Ragan is a member of The Golden Network and the Sacramento Chapter of RWA. Theresa has garnered six Golden Heart nominations in Romance Writers of America's prestigious Golden Heart Competition for her work. AUTHOR REVIEWS Theresa Ragan does it again! A KNIGHT IN CENTRAL PARK is a delightful roller coaster ride through medieval time, which kept me laughing while wondering how in the world it was going to end. Sir Joe is every woman’s dream. He’ll win your heart with his modern day antics, as well as overcoming every obstacle as he rescues the heroine’s sister. If you enjoy being swept away by characters that will stay with you for days, I highly recommend this read. --Caroline Fyffe, award winning author of WHERE THE WIND BLOWS and MONTANA DAWN Book trailer for A Knight in Central",
  "genres": [
    "Time Travel",
    "Romance",
    "Fantasy",
    "Historical Fiction",
    "Historical Romance",
    "Paranormal",
    "Historical"
  ],
  "author": "Theresa Ragan",
  "average_rating": "3.39",
  "url": "https://www.goodreads.com/book/show/10829928-a-knight-in-central-park"
}