{
  "title": "آلام الحلاج",
  "description": "لويس ماسينيون، في آلام الحلاَّج، المجلد الأول، بترجمة الحسين مصطفى حلاَّج، يروي لنا في 750 صفحة قطعًا كبيرًا قصةَ شهيد يحوطه الناس بهالة القديسين: فهو النموذج العاشق الكامل لله بعدما حُكِمَ عليه بالصَّلْب لسَكْرته في صيحة الحال: \"أنا الحق!\" فالحلاَّج في تاريخ الخلافة العباسية في بغداد ضحية قضية سياسية كبيرة أثارتْها دعوتُه العامة؛ إذ استفزَّتْ هذه القضية القوى الإسلامية في زمانه كلَّها: الإمامية والسنيَّة والفقهاء والمتصوِّفة، فيما تزامن صراعُها المأسوي مع انحلال الخلافة وانفراط سُبْحَة العرب.في مقدِّمته (1914)، أشار ماسينيون إلى أن العنوان آلام الحلاَّج يعبِّر عما هو أكثر من مادة أدبية؛ إذ يبين عن فحصٍ لمصادر هذه المادة التاريخية، أي شخصيته، فيما تسمح ترجمةُ مؤلَّفاته بإعادة بناء مذهبه في العشق الصوفي و\"وحدة الشهود\".يتضمن القسم الأول من هذا الكتاب مراحلَ حياة الحلاَّج وانعكاساتِها الاجتماعية على شكل سلسلة لوحات، بدءًا من محاولاته الأولى في الزهد الفردي، ثم الروايات الرسمية لمحاكمته، وصولاً إلى \"المشهد الجليِّ\" لاستشهاده. يكشف هذا القسم عن أصالة هذا الصوفي الذي رفض \"نظام السرِّية\" (التقيَّة) الفَطِن الذي خضع له أتباعُ الصوفية الآخرون، كما يكشف عن أصالة هذا \"المبشِّر الجوَّال\" الذي يعظ، مذكِّرًا بساعة الندم وبالحلول الصوفي لسلطان الله في القلوب، لا بالثورة الاجتماعية، مثلما كان يفعل الدعاةُ الآخرون في عصره.ويتضمن القسم الثاني العرضَ المنهجيَّ لمذهبه ضمن إطار علم الكلام في زمانه. وقد أعاد ماسينيون بناءَه من مؤلَّفاته الشخصية المترجَمة حرفيًّا، في محاولة لتبيان كيف حدَّد أداءُ الشعائر عند الحلاَّج، حتى في ممارسته للصلاة والتأمل والتبشير، معالِم \"أزمة الذات\" الهائلة التي أوصلتْه إلى محاكمته ومقتله؛ وما هو دور مبادئ عقيدة الإسلام والكشوف القرآنية، مثل \"غواية الشيطان\" و\"معراج النبي\"، في بناء المذهب الديني الذي أوْجَدَه وعاشَه. وقد أثبت الحلاَّج طروحَه بمحاكمات متماسكة ومُعَدَّة في صبر وتأنٍّ، مع كونه متصوِّفًا. أما مؤلَّفاته الرئيسية، مثل الطواسين وبستان المعرفة، فتجمع بين عنفوان الشوق المقتضب والبراعة الجدلية الحادة.عاش الحلاَّج في حقبة ازدهار الإسلام الفريدة، حين كانت بغداد تنهل من ثقافتين: الآرامية واليونانية؛ وفي القرن العاشر، أضحت هذه المدينةُ حاضرةَ العالم الثقافية. وكان للفكر العربي أساتذتُه الكلاسيكيون، من النظَّام وابن الراوندي إلى الباقلاني في علم الكلام، ومن الجاحظ إلى التوحيدي وابن سينا في الفلسفة، ومن أبي النواس وابن الرومي إلى المتنبي والمعرِّي في الشعر، ومن الخليل بن أحمد إلى ابن جنِّي في اللغة، فيما كان الرازي بين الأطباء والبتَّاني بين الرياضيين. وقد وقف الحلاَّج بين هؤلاء عَلَمًا بين أوائل علماء الكلام الصوفية، أعمق من الأنطاكي والمحاسبي، وأصْلَب وأحْزَم من الغزالي، فلم يعتمد نهجُه على فهم قواعد العربية فحسب، بل على استخدام المنطق، بحسب ما صنَّفه ونسَّقه اليونانيون.ويشير ماسينيون إلى أن تدريس دورة اللغة العربية في الجامعة المصرية في القاهرة بين عامي 1912 و1913 حول \"التكوين التاريخي للاصطلاحات الفلسفية\" ساهم في ذهابه بعيدًا في دراسة مصادر قاموس الحلاَّج التقني.",
  "genres": [
    "Islam",
    "History",
    "Religion",
    "Theology",
    "Biography",
    "Spirituality"
  ],
  "author": "Louis Massignon",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/17739409"
}