{
  "title": "Honor's Paradox",
  "description": "The sequel to Bound in Blood and exciting sixth entry in the Godstalker Chronicles by epic fantasy world-builder extraordinaire, P.C. Hodgell. A droll heroine born to one day battle a world-destroying god fights her way through deadly plots and challenges at a warrior’s academy to graduate and move forward to her destiny.The sequel to Bound in Blood and exciting sixth entry in the Godstalker Chronicles by epic fantasy world-builder extraordinaire, P.C. Hodgell.Jame is one of the last of the Kencyrath line, born to battle a world-destroying Lord of Darkness and resuscitate her ancestral heritage. Jame’s youth was spent hard and low in a desert wasteland. Now she has discovered her past and her heritage as Highborn—and, with it, the power to call souls out of their bodies and slay the occasional god or two (as well as to resurrect them).First, though, Jame must survive the politics and dangers of haunted Tentir College, a school for warriors where she’s a student. At Tentir, Jame saves a young protégé from possession by a powerful, evil soul in search of a body, while combating jealous students who see her as a danger to their ambition for power and want her expelled—and blinded and dead, in the bargain! Then, just as graduation approaches, Jame’s exemption from the sacred laws of the tribe of her youth expires and she is expected to wed immediately , plus take on a family. To make matters worse, she’s challenged to a mounted combat duel to decide who is Tentir “top gun”—a competition she must win to graduation. It’s trial by fire, as Jame moves closer to a magnificent destiny she both fears—and knows she must face.About P.C. Hodgell’s Kyncyrath \"P.C. Hodgell writes the most strikingly weird and wonderful stories in epic fantasy today.\"—Charles Stross\"Hodgell has crafted an…intricate fantasy with humor, tragedy, and a capable and charming female hero.”— Library Journal",
  "genres": [
    "Fantasy",
    "Fiction",
    "High Fantasy",
    "Science Fiction Fantasy",
    "Epic Fantasy",
    "Science Fiction",
    "Magic"
  ],
  "author": "P.C. Hodgell",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/10830207-honor-s-paradox"
}