{
  "title": "Master of Illusion, Book One",
  "description": "Introducing Master of Illusion, the first novel in the Historical Romance series set in the operatic era of 19th century Paris. This romantic suspense series follows the lives of two children, Angel and Elise, as they run hand in hand from a history of treachery, heartache and crippling abuse. Under the mask of exceptional talent and in the name of justice, they each grapple with their own damaged version of love and loyalty, while fiercely protecting their terrible secrets. **2014 Nominee in the Global Ebook Awards for best Fiction - Historical Literature (Modern)** **Averaging of over 4.5 star ratings across Amazon and Goodreads since its release in April 2013** What are the reviewers saying? \"A dark romance filled with passion and yearning, I was intrigued by this Phantom of the Opera-esqe story of love and fulfillment. The characters really make the story shine. And the author has done a beautiful job of making this historical romance come to life.\" ~ Judge, Writer's Digest Self-Published Ebook Awards \"Master of Illusion is a book I recommend to those who love historical fiction ... Anne Rouen has penned a historical novel that lovers of the genre will enjoy.\" ~ Warren Thurston, Playwright, Aussie Authors \"If you are a Phan I think you are going to love this new telling of The Phantom of the Opera – it’s one of the best ones I’ve read!\" Amazon Reviewer Detailed Murder, Magic, Music and Set in the operatic era of 19th century France, talented dancer, Elise, is discovered by the eminent Opéra Français and is whisked away from a simple life to fulfil her dreams of becoming prima ballerina. Her path is forever changed the day she rescues the disfigured, amnesic, genius Angel from a life of abandonment and mistreatment. Angel's obsessions define his emulation of the Phantom of the Opera coupled with a latent dark side, develop into a fervent passion for a young soprano. Cast under Angel's charming spell, Elise assumes the role of his protector and nurturer—only to discover that she, too, wields powers of her persuasion and contrivance. In trying to reach the pinnacle of operatic success, Angel and Elise are faced with the challenge of defining justice, love and self acceptance. Through abandonment, Angel knows only one form of love—obsession; and Elise, whose purity lies in ruins at the hands of evil, is raped of her capacity for romantic love. Can they fulfil their childhood dreams without blood on their hands? ...",
  "genres": [
    "Historical Fiction",
    "Romance",
    "Historical Romance",
    "Historical Mystery",
    "Romantic Suspense"
  ],
  "author": "Anne Rouen",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/17739687-master-of-illusion-book-one"
}