{
  "title": "Smokin' Hot",
  "description": "SingeAfter breaking up with her longtime boyfriend, Julia Woods is ready to start fresh in a new town, a new state. She doesn't want to get involved with another man, and especially not with an adrenalin junkie.The instant attraction she feels when she meets Stephen McGettis frightens her. She's never experienced something so strong, yet she worries about starting a relationship with him. With his motorcycle racing, whitewater rafting, and skydiving, he's as much of an adrenalin junkie as her former lover.Stephen loves Julia and doesn't want to lose her because of her concern over what she considers his dangerous pastimes. He has to prove to her he's not a daredevil, and that love is the greatest adventure of all.SmolderIn town to visit her grandmother in the hospital, Rayna Holt never expected to run into her ex-husband, Marcus. Seeing him reminds her of all the pain and loss she'd experienced five years ago that led to their divorce.Marcus is still angry and hurt over Rayna destroying their marriage. They're forced to spend time together while the construction company he works for repairs her grandmother's house due to a fire. Old desires smolder beneath the surface, but Marcus is leery of giving in to them. Rayna broke his heart when she left him. He can't live through that kind of pain again.Both Rayna and Marcus have to let go of the past before they can forgive each other and fall in love again.SparkTalia King has loved Dylan Westfield ever since the day she met him two years ago, but he treats her as nothing but a friend. Every attempt she's made to date him or spend more time with him has been shot down by Dylan.Dylan loves Talia as much as she loves him, but his painful past won't let him surrender to that love. Fear of physically hurting her keeps him alone and aching for a life with her…a life he knows he cannot have.A night of passion convinces Talia that she and Dylan are perfect together. Dylan admits his love to Talia, but tells her it doesn't matter since they can never be together.Talia hatches a plan to convince Dylan that she knows he would never hurt her. It might backfire, but she believes it's worth the risk to be with the man she loves.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Erotica",
    "Anthologies",
    "Firefighters",
    "Erotic Romance"
  ],
  "author": "Lynn LaFleur",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/17739459-smokin-hot"
}