{
  "title": "Dating After Trauma: How to find the love of your life after experiencing an abusive relationship, rape, or sexual abuse",
  "description": "Dating After Trauma teaches readers how to date again after being raped or experiencing an abusive relationship. Dating after rape, date rape, or an abusive relationship presents unique challenges as most survivors experience Post Traumatic Stress Disorder (PTSD) which alters their perception of the world and makes it more difficult to develop relationships, build trust and experience intimacy. It takes tremendous courage to date after suffering an abusive relationship or sexual trauma. It can be even more difficult to be open to love from a good person without experiencing fear. However, once you know what to look for in terms of roadblocks, the path to love becomes much easier. In \"Dating after Trauma\" Emily Avagliano discusses the common obstacles abuse victims have when trying to find love. Her story is based on her own personal struggle to overcome past trauma and find her soulmate. Through this insight, she provides a methodology for dating that builds trust and intimacy in a safe and healthy way. She can help you let go of your fear and date in a manner that love becomes possible. For rape victims, if you have experienced date rape or sexual abuse, and want to reclaim your sexuality, find your soul mate, or just start feeling again, this book guides you through that process of healing. If someone you love has been raped, you see them suffering, and don't know how to help them move on from the past, this book will help. If you are a mother, father, friend, boyfriend or dating partner, this book explains what rape victims feel and why it is so hard for them to trust and love someone new. This book also tackles the pain of abusive relationships. If you have experienced the roller coaster of an abusive partner where some days he is the best person in the world and other days you can’t understand his anger, this book will help you heal. If you have altered your behavior to try to control your partner’s anger, jealousy, or even violent physical outburst, this book is for you. If your partner used name calling, controlling behavior, restricted your clothing choices, verbally intimidated you, or made you feel less than, read this book. If you are a parent, partner, or want to help someone in an abusive relationship but don’t know how, this book provides insight into ending the cycle of dating abusive partners. Thank you for your feedback. I greatly appreciate a book review on amazon below.",
  "genres": [],
  "author": "Emily Avagliano",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/17739844-dating-after-trauma"
}