{
  "title": "A Cruel and Shocking Act: The Secret History of the Kennedy Assassination",
  "description": "The questions have haunted our nation for half a century: Was the President killed by a single gunman? Was Lee Harvey Oswald part of a conspiracy? Did the Warren Commission discover the whole truth of what happened on November 22, 1963?Philip Shenon, a veteran investigative journalist who spent most of his career at The New York Times, finally provides many of the answers. Though A Cruel and Shocking Act began as Shenon's attempt to write the first insider's history of the Warren Commission, it quickly became something much larger and more important when he discovered startling information that was withheld from the Warren Commission by the CIA, FBI and others in power in Washington. Shenon shows how the commission's ten-month investigation was doomed to fail because the man leading it – Chief Justice Earl Warren – was more committed to protecting the Kennedy family than getting to the full truth about what happened on that tragic day. A taut, page-turning narrative, Shenon's book features some of the most compelling figures of the twentieth century—Bobby Kennedy, Jackie Kennedy, Lyndon Johnson, J. Edgar Hoover, Chief Justice Warren, CIA spymasters Allen Dulles and Richard Helms, as well as the CIA's treacherous \"molehunter,\" James Jesus Angleton.Based on hundreds of interviews and unprecedented access to the surviving commission staffers and many other key players, Philip Shenon's authoritative, scrupulously researched book will forever change the way we think about the Kennedy assassination and about the deeply flawed investigation that followed. A groundbreaking, explosive account of the Kennedy assassination that will rewrite the history of the 20th century's most controversial murder investigation.A Washington Post Notable Nonfiction Book of 2013",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "American History",
    "Crime",
    "True Crime",
    "Biography"
  ],
  "author": "Philip Shenon",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/17740743-a-cruel-and-shocking-act"
}