{
  "title": "Triangle: The Fire That Changed America",
  "description": "“Outstanding… social history at its best.” –The New York Times Book Review“An amazing, long-forgotten tale. A riveting history written with flair and precision.”—Bob WoodwardIn one of the most honored books of the year, David Von Drehle transports us to a beautiful spring day in March 1911 when 146 workers—most of them young immigrant women—lost their lives. Employees had just begun preparing to leave the Triangle shirtwaist factory in New York’s Greenwich Village when a fire broke out and within minutes consumed the building’s upper three stories. It was the worst workplace disaster in New York City history until 9/11. “Animated by vigorous, descriptive prose, Triangle carries the reader deep into a portrait of early-twentieth-century New York . . . when colorful machine politicians battled socialists, suffragists and upright progressive reformers for the soul of an increasingly immigrant city.” —Chicago Tribune “Von Drehle’s spellbinding and detailed reconstruction of the disaster is complemented by an equally gripping account of the factory owners’ subsequent manslaughter trial (they got off scot-free), drawing on court records he helped unearth.” —The New York Times“Behind the fire lay the extraordinary history of sweatshop labor and the fledgling beginnings of union organizing. The heart of Von Drehle’s book is its detailed, nuanced, mesmerizing description of the fire. The descriptions . . .leave a reader staring into space.” —Los Angeles Times Book Review Praise for David Von Drehle's Triangle: New York Times Extended List Best Seller • New York Times Book Review Notable Book •Washington Post Book World Rave of the Year • New York Public Library Book of the Year • New York Society Library Book of the Year • Fresh Air Critic’s Top Book of 2003 • Hadassah Top Ten Jewish Best Seller • ALA Notable Book of the Year • Winner of the 2004 Christopher Award • Winner of the 2004 Sidney Hillman Foundation Award •Amazon Top 50 Books of the Year • San Jose Mercury News Best Book • Rocky Mountain News Best Book • Providence Journal Critic’s ChoiceCover design by Marcia Salo and Charles Rue WoodsCover photograph courtesy of Culver PicturesPhoto imaging by Michael TedescoGrove Press books are distributed by Publishers Group West",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "New York",
    "Historical",
    "Politics",
    "Labor"
  ],
  "author": "David von Drehle",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/108305.Triangle"
}