{
  "title": "The Reluctant Detective",
  "description": "Faith was a cop, and a good one. She and her boss (and boyfriend) Detective Inspector Ben Shorter tackled criminals and solved crimes across south-east England. They were a good team. But Faith grew disillusioned with Britain's tough police culture. . As her disquiet grows, she starts to ask bigger questions - and ends up as a priest in the Church of England, a job from which she considers she can do more good than any police investigation. In the process she and Ben part company: he can't stand God-botherers, and she finds his convictions-at-any-cost attitude treads on too many vulnerable people. Faith may have quit the world of crime, but crime has not let her go. Newly ordained, she arrives in the village of Little Worthy, near Winchester, to look around the parish. Within an hour of her arrival she witnesses the sudden shocking death of a fellow priest. To her distress, the DI assigned to the case is Ben. At the Bishop's urging, Faith stays on to look after the improbably named parish of Little Worthy. As she meets her parishioners she learns some surprising details about her apparently well-loved predecessor, and starts to suspect a motive for his death. The cop may have donned a clerical collar, but the questions keep coming. How will she reconcile her present calling with her past instincts? Is she in danger herself? What should she do about Ben? Faith's adventures continue in The Advent of Murder. Watch out for further installments! Martha Ockley lives in the North-East of England and has close links with the church, having grown up as the daughter of a minister. She is a full-time author, writing both fiction and non-fiction.",
  "genres": [
    "Mystery",
    "Fiction",
    "Christian Fiction",
    "Crime",
    "Cozy Mystery",
    "Cozy",
    "British Literature"
  ],
  "author": "Charles Nettleton",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/17742272-the-reluctant-detective"
}