{
  "title": "Gemini",
  "description": "A stranger's life hangs in the balance. What if you had the power to decide if she lives or dies? Dr. Charlotte Reese works in the intensive care unit of Seattle's Beacon Hospital, tending to patients with the most life-threatening illnesses and injuries. Her job is to battle death - to monitor erratic heartbeats, worry over low oxygen levels, defend against infection and demise. One night a Jane Doe is transferred to her care from a rural hospital on the Olympic Peninsula. This unidentified patient remains unconscious, the victim of a hit and run. As Charlotte and her team struggle to stabilize her, the police search for the driver who fled the scene. Days pass, Jane's condition worsens, and her identity remains a mystery. As Charlotte finds herself making increasingly complicated medical decisions that will tie her forever to Jane's fate, her usual professional distance evaporates. She's plagued by questions: Who is Jane Doe? Why will no one claim her? Who should decide her fate if she doesn't regain consciousness - and when? Perhaps most troubling, Charlotte wonders if a life locked in a coma is a life worth living. Enlisting the help of her boyfriend, Eric, a science journalist, Charlotte impulsively sets out to uncover Jane Doe's past. But the closer they get to the truth, the more their relationship is put to the test. It is only when they open their hearts to their own feelings toward each other—and toward life itself—that Charlotte and Eric will unlock Jane Doe's shocking secret, and prepare themselves for a miracle. Filled with intricate medical detail and set in the breathtaking Pacific Northwest, Gemini is a riveting and heartbreaking novel of moral com­plexity and emotional depth.",
  "genres": [
    "Fiction",
    "Mystery",
    "Contemporary",
    "Medical",
    "Book Club",
    "Adult Fiction",
    "Romance"
  ],
  "author": "Carol Cassella",
  "average_rating": "3.66",
  "url": "https://www.goodreads.com/book/show/17742914-gemini"
}