{
  "title": "Susan Sontag: The Complete Rolling Stone Interview",
  "description": "Published in its entirety for the first time, a candid conversation with Susan Sontag at the height of her brilliant career“One of my oldest crusades is against the distinction between thought and feeling, which is really the basis of all anti-intellectual views: the heart and the head, thinking and feeling, fantasy and judgment . . . and I don’t believe it’s true. . . . I have the impression that thinking is a form of feeling and that feeling is a form of thinking.”Susan Sontag, one of the most internationally renowned and controversial intellectuals of the latter half of the twentieth century, still provokes. In 1978 Jonathan Cott, a founding contributing editor of Rolling Stone magazine, interviewed Sontag first in Paris and later in New York. Only a third of their twelve hours of discussion ever made it to print. Now, more than three decades later, Yale University Press is proud to publish the entire transcript of Sontag’s remarkable conversation, accompanied by Cott’s preface and recollections. Sontag’s musings and observations reveal the passionate engagement and breadth of her critical intelligence and curiosities at a moment when she was at the peak of her powers. Nearly a decade after her death, these hours of conversation offer a revelatory and indispensable look at the self-described \"besotted aesthete\" and \"obsessed moralist.\"“I really believe in history, and that’s something people don’t believe in anymore. I know that what we do and think is a historical creation. . . .We were given a vocabulary that came into existence at a particular moment. So when I go to a Patti Smith concert, I enjoy, participate, appreciate, and am tuned in better because I’ve read Nietzsche.”“There’s no incompatibility between observing the world and being tuned into this electronic, multimedia, multi-tracked, McLuhanite world and enjoying what can be enjoyed. I love rock and roll. Rock and roll changed my life. . . .You know, to tell you the truth, I think rock and roll is the reason I got divorced. I think it was Bill Haley and the Comets and Chuck Berry that made me decide that I had to get a divorce and leave the academic world and start a new life.”",
  "genres": [
    "Nonfiction",
    "Biography",
    "Philosophy",
    "Essays",
    "Memoir",
    "Art",
    "Journalism"
  ],
  "author": "Jonathan Cott",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/17756349-susan-sontag"
}