{
  "title": "Extinct Doesn't Mean Forever",
  "description": "Echoes of yesterday touch the lives of ordinary people in extraordinary ways in 18 provocative stories by some of the best up-and-coming authors of mainstream and speculative fiction around the world.1. Jase was her ghost in the machine, a shaded memory captured in synthesized pixels. Near enough to see, too distant to touch. Could they still connect? - LAST SEEN by Amanda le Bas de Plumetot2. She didn't realize how deep her loss ran, until a saber-tooth cat helped heal the past and point her toward a future she didn't know she needed - PAST SURVIVORS by Sarah Adams3. Vesna discovers from an unexpected source just how old the dance of love truly is - FOOTPRINTS ON THE BEACH by Aleksandar Ziljak4. John doted on the French touring car he'd lovingly restored. Can his dead wife teach him other things are worthy of his love too? - THE RESTORATION MAN by Simon John Cox5. When a single mum returns home to Tasmania with her young son, her efforts to settle back in take a strange twist - A DARK FOREST by Jen White6. Keeping a baby dinosaur secret from prying TV people and scientists is no easy task, except when your family have been keeping sacred traditions secret for generations - MY OWN SECRET DINOSAUR by Jo Antareau7. When a Neanderthal skeleton arrives at her museum, Cassie learns a woman dead for thousands of years still has something to teach the living - THE LANGUAGE OF ICE by David North-Martino8. With human hunters closing in, Kerg concocts a desperate plan for survival. Just one problem: he isn't the only one looking out for family - TWILIGHT OF THE CLAW by Adam Dunsby9. Lucia doesn't believe in angels -- but she might believe in a little boy cloned from a forgotten race - THE ANGEL GENOME by Chrystalla Thoma10. Geri's father finds the remains of an alien culture, proof we're not alone. But he leaves Geri feeling more alone than ever - IN RING by Scott Thomas Smith11. Had it been left to protocols rather than human ingenuity, Commander West's expedition might have overlooked one of Mars' greatest treasures - BONES OF MARS by D. Jason Cooper12. Endless Power, Inc prepared Angel for the physical dangers of harnessing a new energy source. But no one prepared him for how to cope afterward - HUNTING THE MANTIS by Adam Knight13. Bridges of meaning built through symbols alienate as much as connect. But the Virtual Bridge Sri plans could reconnect the lost hopes of a dying civilization - CONNECT by Kenneth Burstall14. Fleeing with the last remnants of the Oshen race, Indigo has only one chance to ensure his people are never forgotten - INDIGO'S GAMBIT by Adam Israel15. When his pampered world loses the technology it depends on, extinction looms faster than lonely survivor Levo could ever expect - BLOOD FRUIT by Shona Snowden16. When a new bio-weapon in the wars on drugs and terror gets out of control, can the supplier really be held responsible? - A THORNY DILEMMA by Rory Steves17. Capturing mammoths was all in a day's work for Deke. The saber-tooth cat, though, was going to require something bigger than an elephant gun - INVOICE H10901: 3 WOOLY MAMMOTHS by Robert J. Sullivan18. After George makes a momentous discovery, the distractions start piling up. His wife cooks up a surprise to remind him love is always worth sacrificing for - DISTRACTIONS by Peter Dudley",
  "genres": [
    "Short Stories",
    "Fantasy",
    "Science Fiction"
  ],
  "author": "Phoenix Sullivan",
  "average_rating": "3.18",
  "url": "https://www.goodreads.com/book/show/10830847-extinct-doesn-t-mean-forever"
}