{
  "title": "Come On Shore and We Will Kill and Eat You All: A New Zealand Story",
  "description": "An extraordinary love story between a Maori man and an American woman, that inspires a graceful, revelatory search for understanding about the centuries-old collision of two wildly different cultures.Come on Shore and We Will Kill and Eat You All is the story of the cultural collision between Westerners and the Maoris of New Zealand, told partly as a history of the complex and bloody period of contact between Europeans and the Maoris in the late eighteenth and early nineteenth centuries, and partly as the story of Christina Thompson's marriage to a Maori man. As an American graduate student studying literature in Australia, Thompson traveled on vacation to New Zealand, where she met a Maori known as \"Seven.\" Their relationship was one of opposites: he was a tradesman, she an intellectual; he came from a background of rural poverty, she from one of middle-class privilege; he was a \"native,\" she descended directly from \"colonizers.\" Nevertheless, they shared a similar sense of adventure and a willingness to depart from the customs of their families and forge a life together on their own.In this extraordinary book, which grows out of decades of research, Thompson explores the meaning of cross-cultural contact and the fascinating history of Europeans in the South Pacific, beginning with Abel Tasman's discovery of New Zealand in 1642 and James Cook's famous circumnavigations of 1769-79. Transporting us back and forth in time and around the world, from Australia to Hawaii to tribal New Zealand and finally to a house in New England that has ghosts of its own, Come on Shore and We Will Kill and Eat You All brings to life a lush variety of characters and settings. Yet at its core, it is the story of twopeople who, in making a life and a family together, bridge the gap between two worlds.",
  "genres": [
    "Nonfiction",
    "History",
    "Memoir",
    "Travel",
    "Biography",
    "Anthropology",
    "Audiobook"
  ],
  "author": "Christina Thompson",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/1776437.Come_On_Shore_and_We_Will_Kill_and_Eat_You_All"
}