{
  "title": "Sexual Healing",
  "description": "Jill Nelson, bestselling author of Volunteer Slavery and Straight, No Chaser , has written a steamy and uproarious debut novel that tells the story of Lydia and Acey, two childhood friends who've grown up to become successful midcareer professionals. But their career success is matched by their romantic and sexual frustrations. One night, dissecting their dissatisfactions over a bottle of wine, they concoct a why not develop a business that discreetly supplies handsome black men willing and able to serve the sexual needs of black women? Thus is born the idea for Sexual Healing-a \"full--service\" spa aimed at meeting all of black women's intimate desires. Launching the enterprise is a struggle, but the conflict is just even as their delighted customer base grows, they face a firestorm of attacks from hostile media, grandstanding church leaders and other outraged parties. From the most dignified black church in Oakland to sex-positive small-town Nevada, from the racks of Loehmann's to the skyscraping executive suites of San -Francisco, Sexual Healing is a page-turning comedy of outraged manners, a blistering satire on American gender and race relations, and a sexually frank exploration of what women really want. Jill Nelson unleashes the storytelling abandon that captivated readers of Volunteer Slavery and gives it full rein in what's sure to be one of the hottest books of 2003. Praise for Jill \"Nelson's voice is boisterous, honest and hilarious.\"-Terry McMillan \"Scalding, candid, mordantly funny.\"- Boston Globe \"Tumultuous, funny and ultimately wrenching. . . . And no target is off limits.\"- Detroit Free Press Jill Nelson is the author of the bestselling Volunteer Slavery (Noble, 1993), which won an American Book Award, and Straight, No Chaser (Putnam, 1997), and the editor of the anthology Police Brutality (Norton, 1999). She is a regular contributor to the Village Voice and MSNBC.com, among other publications. She teaches at the City College of New York and lives in Manhattan.",
  "genres": [
    "Fiction",
    "Novels"
  ],
  "author": "Jill Nelson",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/1777138.Sexual_Healing"
}