{
  "title": "Twelve Years a Slave",
  "description": "In this riveting landmark autobiography that reads like a novel, Academy Award and Emmy winner Louis Gossett, Jr., masterfully transports us to 1840s New York, Louisiana, and Washington, DC, to experience the kidnapping and twelve-year bondage of Solomon Northup, a free man of color. Twelve Years a Slave, published in 1853, was an immediate bombshell in the national debate over slavery leading up to the Civil War. It validated Harriett Beecher Stowe's fictional account of Southern slavery in Uncle Tom's Cabin, which had become the best-selling American book in history a few years earlier, and significantly changed public opinion in favor of abolition. A major motion picture based on the book and starring Brad Pitt, Paul Giamatti, and Michael Fassbender released in 2013.Hard working Solomon Northup, an educated free man of color in 1841, enjoys family life with his wife and three children in Saratoga, New York. He delights his community with his fiddle playing and antic spirit and has positive expectations of everyone he meets. When he is deceived by \"circus promoters\" who ask him to accompany them to a musical gig in Washington, DC, his joyful life takes an unimaginable turn. He awakes in shackles to find he has been drugged, kidnapped, and bound for the slave block in the nation's capital.After Solomon is shipped a thousand miles to New Orleans, he is assigned his slave name and quickly learns that the mere utterance of his true origin or rights as a freeman are certain to bring severe punishment, maybe even death. While he endures the brutal life of a slave in Louisiana's isolated Bayou Boeuf plantation country, he must learn how to play the system and plot his escape home.For twelve years, his fine mind captures the reality of slavery in stunning detail, and listeners learn about the characters that populated plantation society and the intrigues of the bayou--from the collapse of a slave rebellion resulting in mass hangings due to traitorous slave Lew Cheney to the tragic abuse of his friend Patsey, brought about by Mrs. Epps' jealousy of her husband's sexual exploitation of the pretty young slave.When Solomon finally finds a sympathizing friend who risks his life to secret a letter to the North, a courageous rescue attempt ensues that could either compound Solomon's suffering or get him back to the arms of his family.\"[Screenwriter John] Ridley said he decided simply to stick with the facts in adapting Northup's book for the film...[and] he was helped by voluminous footnotes and documentation that were included with Dr. Eakin's edition of the book.\"--New York Times (September 22, 2013) on the making of the film 12 Years a Slave",
  "genres": [
    "Nonfiction",
    "History",
    "Classics",
    "Biography",
    "Memoir",
    "Historical",
    "Audiobook"
  ],
  "author": "Solomon Northup",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/17780252-twelve-years-a-slave"
}