{
  "title": "The Complete Alfred Bester's Stars My Destination",
  "description": "Special hardcover limited edition of the graphic novel adaptation of Alfred Bester's The Stars My Destination. This production is one of the first sophisticated \"full color\" American graphic novels first published in 1979. #5 in the Millennium SF Masterworks series, a library of the finest science fiction ever written. \"Science fiction has only produced a few works of actual genius, and this is one of them\"-Joe Haldeman \"Bester at the peak of his powers is, quite simply, unbeatable\" -James Lovegrove Marooned in outer space after an attack on his ship, Nomad, Gulliver Foyle lives to obsessively pursue the crew of a rescue vessel that had intended to leave him to die. When it comes to pop culture, Alfred Bester (1913-1987) is something of an unsung hero. He wrote radio scripts, screenplays, and comic books (in which capacity he created the original Green Lantern Oath). But Bester is best known for his science-fiction novels, and The Stars My Destination may be his finest creation. With its sly potshotting at corporate skullduggery, The Stars My Destination seems utterly contemporary, and has maintained its status as an underground classic for fifty years. (Bester fans should also note that iPicturebooks has reprinted The Demolished Man, which won the very first Hugo Award in 1953.) Alfred Bester was among the first important authors of contemporary science fiction. His passionate novels of worldly adventure, high intellect, and tremendous verve, The Stars My Destination and the Hugo Award winning The Demolished Man, established Bester as a s.f. grandmaster, a reputation that was ratified by the Science Fiction Writers of America shortly before his death. Bester also was an acclaimed journalist for Holiday magazine, a reviewer for the Magazine of Fantasy and Science Fiction and even a writer for Superman.",
  "genres": [
    "Comics",
    "Science Fiction",
    "Graphic Novels",
    "Fiction",
    "Graphic Novels Comics"
  ],
  "author": "Byron Preiss",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/17782648-the-complete-alfred-bester-s-stars-my-destination"
}