{
  "title": "Hunted Warrior",
  "description": "Demonic gladiators, ruthless mafia villains, and a race on the brink of distinction: What will become of them? One proud leader wields his power to unlock dark mysteries in the third in this fierce, sensual new paranormal romance series.When the head of the Five Clans of the Dragon Kings wants something, he gets it. Raised among the most privileged of his dying race, Malnefoley conceals a devastating tragedy from his youth. Now, many call him the Usurper because of his unconventional rise to power. His influence is waning while the Dragon Kings must solve the puzzle of their slow extinction. So when a particularly important captive escapes his compound in the Greek mountains, Malnefoley leaves nothing to chance. She is his prisoner to retrieve.The woman is known as the Pet, a former associate of a sadistic doctor from the Asters, a human crime cartel. Her loyalties cannot be trusted, even when she claims to hold the secret to conception—an invaluable secret for a race unable to procreate. Neither can her unique gift from the Great Dragon be believed. She’s a soothsayer, able to see glimpses of the future. Her quest is to find and save a Cage warrior on the verge of her first match—a young woman whose destiny is bound to a timeless prophecy.Malnefoley has no respect for the ancient superstitions that brought about his childhood trauma. His only goal is to return the Pet to his compound and use her knowledge for the betterment of their people. Yet her restless energy and raw sensuality are as intriguing as her predictions about the rise of the Great Dragon. He dares not trust the crafty fugitive’s loyalties, but as their treacherous chase turns passionate, can he even trust himself?",
  "genres": [
    "Paranormal",
    "Romance",
    "Dragons",
    "Paranormal Romance",
    "Fantasy",
    "Urban Fantasy",
    "Adult"
  ],
  "author": "Lindsey Piper",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/17786105-hunted-warrior"
}