{
  "title": "The Chameleon Society",
  "description": "(Note: This edition contains ONLY the original novella \"The Chameleon Society\")The Chameleon Society:Thirty people, the crew of an interstellar science research vessel on a routine mission in the year 2337, have survived a deep-space accident in their ship the Racine. In the aftermath they find they have unwittingly become time travelers, marooned on Earth in the year 1946. Hoping for but uncertain of rescue, they realize that their survival until rescue comes requires living for possibly several years in the mid-21st century while doing nothing that may change the future timeline, resulting in a paradox that may erase their mission—or even their existence. The crew of the Racine enters a pact to do just that. For the next sixteen years they live a spartan existence, cloaked in secrecy, severely limiting all personal, professional and other interactions and involvement in the society surrounding them, trying desperately to avoid taking that one action, making that one statement, or preventing that one event that might somehow change their future timeline—all in the hopes of preserving their slim chance of rescue and their return to their world, their time. The agreed consequence of violating their plan is simple and severe—death. Together, they have managed for several years to live this numbingly inhuman existence—until now. In the year 1962, Captain Peter Heller has for the first time had to enforce their pact, and carry out this awful penalty against a member of the crew. Emotions flare and bitter doubts surface as his actions aren't supported by everyone. Some oppose him—violently. Mutinous crewmen are plotting, ready to kill to have their way. Their already volatile situation becomes critical as a local discovers their true identity as time travelers—and the unthinkable happens as he becomes romantically involved with one of them.Discipline is giving way. Revenge will be had. The future of the entire crew hangs in the balance. Can they hold on long enough to find redemption?___________________________In the sequel Novel “The Chameleon Society: Extraction”:Captain Peter Heller has finally received a long-awaited message from the future of an impending rescue attempt.Or has he? Is the message from friend or foe? Who is behind the rash of attacks on the time travelers? The mutinous faction is scheming to take advantage of the situation, and will stop at nothing, including murder, to defeat Captain Heller and prevent extraction of the crew. It’s no longer just a question of revenge. Now individual survival is at stake, as well as the direction of mankind’s future.Only one timeline can proceed. Neither faction can afford to yield. The day of reckoning has arrived.This absorbing and fast-paced chronicle of the impossible choices and psychological struggles faced by the crew and command of the Racine takes you on a fascinating journey of what the realistic human costs of time-travel would be. Experience every minute of their devotion to duty and their naked treachery, unbearable loneliness and soaring love, triumph and tragic loss. “The Chameleon Society” and “The Chameleon Society: Extraction” is an epic story you won’t want to put down.",
  "genres": [],
  "author": "William    Sharp",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/17787364-the-chameleon-society"
}