{
  "title": "Blood and Lipstick",
  "description": "Since \"Carmilla\" in 1872 (25 years before Stoker's \"Dracula\"!), lesbian vampires have been a literary staple. The twining of female sexual desire with danger and deviance has been a common theme for a century or more. We're continuing that tradition with this anthology featuring those other ladies of the night. Sensuous but deadly, like velvet draped over razor wire, these literal femme fatales will draw you in, have their way with you, and leave you gasping for more.First, in \"27 Days\", when Sarah meets Mary at an otherwise boring dinner party, she's determined to have her for more than a one-drink-stand. Too bad Sarah's maker is the jealous type and wants to have Sarah to herself for eternity! Then, in \"Bloody Flowers\", vampire lovers Merigold and Helene share their bed—and their bodies—with the lovely Diana after picking her up at a club. But Diana knows more than she lets on, and the pair are very quickly drawn into a power struggle that, for Helene at least, stretches back centuries.\"You and the Moon\" brings us Julie, a scientist working on the secrets of longevity who is desperate to contact the reclusive Cassandra, a pioneer in the field and Julie's idol. When she discovers the true secret behind Cassandra's success, Julie offers to assist in working out a way to reduce the side effects, but Cassandra has a different goal—she wants to find a way to die. In \"Love's Horizon\", yacht captain Jayne moonlights as a paranormal researcher, so she isn't surprised when her newest client, Eleni, turns out to be a vampire. What does surprise her is that after making Eleni promise that she was permanently off the menu, she becomes increasingly frustrated when Eleni keeps it. Finally, \"Business Makes Strange Bedfellows\" steps into the past and introduces us to Gertrude, a Victorian woman wealthy enough to never need a husband, headstrong enough to make a career among men as a university researcher, and intelligent enough to prove to even the most stalwart critic that she deserves it. An unexplainable incident in her lab one night, though, leads Gertrude to purchase the services of a special detective named Vi, but the price Vi names is Gertrude's blood—and her body!",
  "genres": [
    "Paranormal",
    "Lesbian",
    "Vampires"
  ],
  "author": "Roger Armstrong",
  "average_rating": "2.92",
  "url": "https://www.goodreads.com/book/show/17789602-blood-and-lipstick"
}