{
  "title": "The Valentine's Day Anthology: poetry . . . prose & stories of Love",
  "description": "Foreword The love of poetry and expressing love through the written word has been handed down throughout the ages. In this Valentine's Day Anthology you will find love reflected on every page, by very talented and loving people. This is a very special book for me not only because it celebrates and spot-lights love, but it is also my birthday. One of my personal favorite love pieces is from The Song of Solomon. A beautifully crafted and though it is archetypal, I find that reading through that particular book of wisdom produces a mirroring action of masculinity and femininity within the soul and deeply stirring in many ways. The imagery in the song literally takes us, the reader to that place that resides in each of us, love and the need to express, value and be not just in it but to BE Love itself. This Valentine's Day Anthology has the same effect on me and I am honored to be a part of it. What is love? Love is universal, yet many people are confused about it. You can invite love, but you cannot dictate how, when, and where love expresses itself. It's simple though man has complicated the issue. Love is more than a feeling of overwhelming emotion, lust, butterflies in the tummy, though nice, it cannot be quantified or tied up in a heart shaped box. I have heard it said that love is a choice. I tend to agree with this statement. I choose to love my partner and humanity. Love simply is, it is easy to “Be” love when you throw outrageous demands out the window and allow the person to be themselves. Didn't you fall in love with him / her because they were a bright and shiny light? Why do some of us feel compelled to dim the very thing that drew us to this person? With a bit of patience, acceptance, grace and maturity we move beyond these childish expectations and enjoy love and all of the glorious fruit it bears. Between the covers of this book from front to back, you will find poetry, prose and stories of love. The poets / writers have out-done themselves and I celebrate and appreciate each and every one of you. Please pick up more than one copy of this book. It is a beautiful gift for everyone, and who says no to the gift of love? Now, get in a relaxed position and pick up your favorite beverage and enjoy the fruit of this Valentine's offering, from the Poets / Writers of the Globe . . . to you. I am. Happy Valentine Day, Happy Reading! Janet P. Caldwell COO Inner Child\"... Red intertwined amongst the yellow and green, fabric woven with love, a gift from a friend ...\" —Kimberly Burnham, pg 8 Red Juxtaposed in Valentine's Day Anthology, Poetry ... Prose & Stories of Love, The Love Writers with Inner Child Press (2013)",
  "genres": [],
  "author": "The Love Writers",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/17790528-the-valentine-s-day-anthology"
}