{
  "title": "Hidden Truths",
  "description": "Set against the back drop of the cities of Monte Carlo, London and the beautiful snow covered mountains of Switzerland meet three men who are fighting their way through the hidden truths of their complicated pasts. Their lives are intertwined in more ways than they can see and only working through the truths hidden deep within each of them can they free themselves and find the love that they are searching for. Each of them need the other in a way not even themselves can understand. This is the first of three books following the complicated lives of Jamie Burton a three time Winter Olympic gold medallist, Valerio Capelli an Italian bike racing protégé and Scot a billionaire business genius. All three are stunning and sexy in different ways. All three desire the same thing, sex, love and freedom from their pasts.Jamie Burton is an enigmatic, beautiful, intoxicating person who entices those around him without him even trying. He's someone who appears to have it all. Good looks, good nature, wealth. How appearances can be deceiving. He has a crippling emotional fear of love and relationships stemming from his painful childhood. Mix that with his obsessive compulsion to remain clean and controlled and Jamie has no chance at falling in love. That may change when he meets Valerio Capelli. An innocent curly haired eighteen year old Italian bike racing protégé who lives life to the fullest and races at two hundred miles an hour on the world’s fastest racetracks. He’s warm and relaxed and undecided about his sexuality. Everything Jamie is afraid off but he can't stop the pull this enigmatic creature has over him.Just like Jamie Valerio is hiding the truth about his past, only by overcoming his fears and his hidden pain can he truly move on.Valerio may be Jamie's future but his past is constantly around him. Meet Scot the intense but stunning business man who appears to have nothing with Jamie apart from their passionate sex life. He’s a billionaire playboy who is controlled arrogant and powerful but weak around Jamie. When they meet both are lost and not just in their lust for each other but from the hidden secrets in their past.He sees things in Jamie that even he can't see, the truth shines from his black eyes tempting Jamie back into his arms I a way he doesn’t understand.All three have hidden the truth for so long about so many things. All have dark issues which can't be spoken about.What’s hidden in the fog of Jamie’s mind? What’s missing?Can these two men in his life help free him from his pain? Or will they push him the edge of his sanity in their attempts to make him love?",
  "genres": [
    "M M Romance",
    "Contemporary",
    "Romance",
    "Amazon",
    "Abuse",
    "Sports",
    "LGBT"
  ],
  "author": "Nicole Colville",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/17791095-hidden-truths"
}