{
  "title": "Days like This",
  "description": "Alternative Cover Edition for ASIN B00BCSTV6SA relationship in transition. A husband with old insecurities. A wife with new uncertainties.A teenage daughter who crashes into their lives with no warning.The love story that began in Coming Home continues!For two decades, their friendship survived the roller coaster ride to fame and the tumult of her first marriage to his best friend. Now that they've finally found their way home to each other, songwriters Casey Fiore and Rob MacKenzie are about to face another challenge, one that neither of them could have anticipated: Rob's teenage daughter, Paige.Still haunted by the ghost of Casey's first husband, charismatic rock icon Danny Fiore, they've been tiptoeing around the elephant in the living room. While Rob struggles with long-held insecurities, Casey is gradually blossoming into the woman she was always meant to be. But with change comes uncertainty, and even as she finds herself overwhelmed by the ferocity of her feelings for her new husband, Casey wrestles with divided loyalties and the unexpected changes this marriage has wrought in her.When the fifteen-year-old daughter Rob never knew comes to live with them, the quiet life they've carved out for themselves in Casey's rural Maine hometown is turned upside down. Paige MacKenzie is prickly as a porcupine, hurt and angry and resentful toward the father she's convinced deliberately deserted her.As Casey and Rob face the challenges of parenting a rebellious teenager while trying to become a family, they unravel secrets and discover truths about themselves and their relationship, truths that, if not dealt with, could threaten the future of their marriage.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Fiction",
    "Music",
    "Chick Lit",
    "Amazon"
  ],
  "author": "Laurie Breton",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/17791473-days-like-this"
}