{
  "title": "Seattle in Black and White: The Congress of Racial Equality and the Fight for Equal Opportunity",
  "description": "Seattle was a very different city in 1960 than it is today. There were no black bus drivers, sales clerks, or bank tellers. Black children rarely attended the same schools as white children. And few black people lived outside of the Central District. In 1960, Seattle was effectively a segregated town.Energized by the national civil rights movement, an interracial group of Seattle residents joined together to form the Seattle chapter of the Congress of Racial Equality (CORE). Operational from 1961 through 1968, CORE had a brief but powerful effect on Seattle. The chapter began by challenging one of the more blatant forms of discrimination in the city, local supermarkets. Located within the black community and dependent on black customers, these supermarkets refused to hire black employees. CORE took the supermarkets to task by organizing hundreds of volunteers into shifts of continuous picketers until stores desegregated their staffs. From this initial effort CORE, in partnership with the NAACP and other groups, launched campaigns to increase employment and housing opportunities for black Seattleites, and to address racial inequalities in Seattle public schools. The members of Seattle CORE were committed to transforming Seattle into a more integrated and just society.Seattle was one of more than one hundred cities to support an active CORE chapter. Seattle in Black and White tells the local, Seattle story about this national movement. Authored by four active members of Seattle CORE, this book not only recounts the actions of Seattle CORE but, through their memories, also captures the emotion and intensity of this pivotal and highly charged time in America’s history.For more information",
  "genres": [
    "Nonfiction",
    "Book Club",
    "History"
  ],
  "author": "Joan Singler",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/10098549-seattle-in-black-and-white"
}