{
  "title": "The Day I Washed My Face in the Toilet",
  "description": "Wish you could find giggle-inducing tween books for girls?  Tired of young teen fiction that drags you down? Then try...  THE DAY I WASHED MY FACE IN THE TOILET  A laugh-out-loud ebook that’s perfect for girls and young teens! All 14-year-old Monica Bloomfield wants is to spend August at a science camp far away from her idiot sister and weird little brother. Trouble is, Monica’s being dragged into the wedding party of her crabby old great aunt who lives in England—and if she wants to earn that science camp, she has to keep her siblings in line for the entire trip, plus convince her crazy Grandma to move into a nursing home pronto. Monica’s determined to succeed, but things start out badly—and go downhill fast.  First, her hyperactive brother overdoses on caffeine right before their eight-hour flight to England. Then a botched wine-tasting party ends so badly that even a policeman is left speechless (and in need of a new uniform). Getting into science camp isn’t going to be easy—specially with a rampaging bull, drunk parrot and the most gorgeous guy in the universe standing in her way.  The Day I Washed My Face In The Toilet is a fast-paced tale about a girl trying to have a positive impact on her world and see social injustices corrected—with hilarious results, and one badly-mangled bridesmaid’s dress.  A Personal Note From The  Unfortunately, I came up with the title of this book—and a pretty big chunk of the plot-line—the day I washed my face in a toilet. In my defense, we were living in the middle of nowhere, and a brutal storm had left us with no hydro, no heat, no lights and no running water for almost a week. I was cold and grimy, and by the fifth day I snapped. I pulled the top off the toilet tank and peered in. The water had been sitting there for days, so it smelled really funky. Also, every chain and bobbly thing in there was covered with a thick layer of (and here, I’m using the scientific term) bleck. Still, I was desperate. So I used the slimy toilet tank water and had what was probably the fastest sponge bath on record.  Sadly, the curry incident happened to me, too. Shortly before I boarded an eight-hour flight from England to Canada, a friend took me out for a huge curry feast. I’d never had curry, and my intestines weren’t sure what to do with the stuff, so they promptly rejected it. I developed a massive case of explosive curry farts. I kept my coat zipped up for the entire flight home, hoping that would hide the smell. It didn’t. Toxic gasses trickled out through the neck of the coat, assaulting me and all of the passengers who were stuck sitting around me. Ironically, the coat made the problem worse, because it made me sweat—I was leaking curry vapors out of every pore of my body. This book is a labor of love, but it’s laced with some of my most cringe-worthy experiences, too!  If you’re on the look-out for great books for girls or young teens—and you don’t need vampires or zombies to make you happy—then this one’s for you!",
  "genres": [],
  "author": "Brenda Kearns",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/17792466-the-day-i-washed-my-face-in-the-toilet"
}