{
  "title": "Historical Research Companion to Everything of Interest to a Romance Writer",
  "description": "Welcome to the completely revised 2nd edition of the Historical Research Companion. This e-guide started out as a companion to the historical content on the blog/website Everything of Interest to a Romance Writer. With this edition, this book is now independent from the website. All of the archived content and links formerly found on the blog have been revised and included in this book. Images have also been added to this edition, with many more visual resources provided through links. Also new to this edition is an additional topic exploring the popularity of each category as a romance setting. Here, we take a step back to remind ourselves of the big picture appeal of each time period. I hope you will find it fun to look deeper into the themes we are drawn to read and write about.So let’s dive into that expanded content! What is your favorite historical time period? Where in time do your characters reside? The main categories of the companion are still divided as so: Dark Ages, Medieval Times, Renaissance & Reformation, Revolutionary Times & Regency and Victorian/American Old West. New to this edition, an additional category of the Gilded Age/Edwardian Era is beginning to break out. Like the Regency, it is a relatively short time span that reaches beyond its historical boundaries in influence. Is an Edwardian setting in your future?Each category still has an extensive Chronology to help you get a sense of your time and place. For this edition I have moved all of the chronologies to the end of the book to give a better flow to the topics within the sub-categories, which are: Political Climate, Fashion, Food & Drink, Society & Entertainment, Crime & Punishment, Religion, Health & Medicine, Travel & Transportation, and Homes & Architecture. Some time periods still have more sub-categories than others. The Regency, my favorite time period, still gets the lion’s share of attention, but additional topics have been added to all of the main categories. This companion is about getting a head start on your research and getting on with the business of writing. I hope you enjoy the added content of this 2nd edition! With all of history to explore, I anticipate there will be further updates down the road.Happy writing and time traveling!",
  "genres": [
    "Writing",
    "Nonfiction",
    "Reference"
  ],
  "author": "Melissa   Johnson",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/17793185-historical-research-companion-to-everything-of-interest-to-a-romance-wri"
}