{
  "title": "Walking by Myself",
  "description": "Noelle Moore knows that she must first learn to love herself before she can even think of loving somebody else.\tWhat would you do if you were stuck in an abusive relationship? And getting out isn't an easy thing to do. Sometimes you’re torn between thoughts of loneliness and blame. It’s not as easy to leave as one might think. They say that when a person has an addiction they have to hit rock bottom before they themselves can realize that they have a problem. Well the same goes for anyone stuck in an abusive relationship. You have to hit rock bottom before you make the conscious decision to leave and sometimes that’s not enough, it’s too late. Getting out of an abusive relationship is hard, but it’s even harder when the abuser comes back.30 year old Noelle Moore is very unhappy with herself. With the exception of work, she spends most of her time alone and she likes it like that; because when she does venture out, she feels as if everyone is scrutinizing and staring at her. Besides having a rocky relationship with her mother, Noelle also has an incredibly deep seeded fear of the full length mirror that stands in her bedroom. She hides from it, averts her eyes away from it, for she cannot look at it and face the ugliness that she thinks she will find.\tThen Noelle meets Chris. He is an attractive man who seems genuinely interested in her. Noelle doesn’t want this one to slip away, not even when he starts calling her names, degrading, and hitting her. She thinks she can stop it by being better. But when the abuse gets to be too much for even her, she finds the strength to end it. Thanks to one police officer in particular, Noelle gets her chance to escape her abuser, rediscover herself, and work on her relationship with her mother; if that’s even possible. She knows that she’ll have to make some hard choices. But Officer Ian Soleri makes it all seem so easy.Officer Ian Soleri has been on the force for almost ten years. He's seen his share of violence, especially domestic violence. Once he encounters Noelle Moore’s domestic situation, it leaves an everlasting mark on him. He's the one who responded to the 911 call the night of the brutal beating. The moment he walked into the room and saw what Noelle had just endured, he felt sorry for her. If it wasn't for he and his partner, Ian was sure Noelle would be dead. While waiting for the paramedics to arrive, Ian tries to comfort Noelle, and in doing so he begins to feel something more than just sympathy.",
  "genres": [],
  "author": "Ursula Dukes",
  "average_rating": "4.79",
  "url": "https://www.goodreads.com/book/show/17794392-walking-by-myself"
}