{
  "title": "Them: A Memoir of Parents",
  "description": "Tatiana du Plessix, the wife of a French diplomat, was a beautiful, sophisticated white Russian who had been the muse of the famous Russian poet Vladimir Mayakovsky. Alexander Liberman, the ambitious son of a prominent Russian Jew, was a gifted magazine editor and aspiring artist. As part of the progressive artistic Russian emigré community living in Paris in the 1930s, the two were destined to meet. They began a passionate affair, and the year after Paris was occupied in World War II they fled to New York with Tatiana's young daughter, Francine.There they determinedly rose to the top of high society, holding court to a Who's Who list of the midcentury's intellectuals and entertainers. Flamboyant and outrageous, bold and brilliant, they were irresistible to friends like Marlene Dietrich, Salvador Dalí, and the publishing tycoon Condé Nast. But to those who knew them well they were also highly neurotic, narcissistic, and glacially self-promoting, prone to cut out of their lives, with surgical precision, close friends who were no longer of use to them.Tatiana became an icon of New York fashion, and the hats she designed for Saks Fifth Avenue were de rigueur for stylish women everywhere. Alexander Liberman, who devotedly raised Francine as his own child from the time she was nine, eventually came to preside over the entire Condé Nast empire. The glamorous life they shared was both creative and destructive and was marked by an exceptional bond forged out of their highly charged love and raging self-centeredness. Their obsessive adulation of success and elegance was elevated to a kind of worship, and the high drama that characterized their lives followed them to their deaths. Tatiana, increasingly consumed with nostalgia for a long-lost Russia, spent her last years addicted to painkillers. Shortly after her death, Alexander, then age eighty, shocked all who knew him by marrying her nurse.Them: A Portrait of Parents is a beautifully written homage to the extraordinary lives of two fascinating, irrepressible people who were larger than life emblems of a bygone age. Written with honesty and grace by the person who knew them best, this generational saga is a survivor's story. Tatiana and Alexander survived the Russian Revolution, the fall of France, and New York's factory of fame. Their daughter, Francine, survived them.",
  "genres": [
    "Memoir",
    "Biography",
    "Nonfiction",
    "History",
    "Biography Memoir",
    "Russia",
    "France"
  ],
  "author": "Francine du Plessix Gray",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/108342.Them"
}