{
  "title": "Wolves Eat Dogs",
  "description": "\"Why would anyone jump out a window with a saltshaker?\" A good question, especially when the suicide victim is Pasha Ivanov, a Moscow physicist-turned-billionaire businessman--a \"New Russian\" poster boy, if ever there was one--with several homes, a leggy 20-year-old girlfriend (\"the kind [of blonde] who could summon the attention of a breeze\"), and every reason to be contented in his middle age. So, wonders Senior Investigator Arkady Renko, in Martin Cruz Smith's Wolves Eat Dogs, what provoked Ivanov to take a header from his stylish 10th-floor apartment? And how does it relate to the shaker clutched in his dead hand or the hillock of table salt found on his closet floor?Renko, introduced in Smith's 1981 bestseller, Gorky Park, is a cop well out of sync with rapidly changing Russian society, \"a difficult investigator, a holdover from the Soviet era, a man on the skids\" whose determination to do more than go through the motions of criminal inquiries inevitably exasperates his superiors. Thus, when this saturnine detective declines to accept the verdict that Ivanov did himself in--who peppered that salt around the capitalist's premises, Renko still wants to know, and what about rumors of a security breach at Ivanov's apartment building?--he is exiled to the Ukrainian Zone of Exclusion, the \"radioactive wasteland\" surrounding Chernobyl, site of a notorious 1986 nuclear disaster and the place where, only a week after Ivanov's demise, his company's senior vice-president is found with his throat slit. There, among cynical scientists, entrepreneurial scavengers, and predators both two- and four-legged--an exclusive coterie of the rejected--Renko chews over the crimes on his plate. Unfortunately, the dosimeter that warns him of radiation exposure at Chernobyl does not also protect him from a pair of malevolent brothers, or a \"damaged\" woman doctor offering him mutually assured disappointment.Smith has a keen eye for the comical quirks of modern-day Russia--its chaotic roadways, voracious appetite for post-communist luxuries, and evolving ethics (\"Russians used to kill for women or power, real reasons. Now they kill for money\"). And this story's bleakly beautiful Ukrainian backdrop nicely complements the desperate hope of Renko's task. Still, the greatest strength of Wolves Eat Dogs (Smith's fifth series installment, after Havana Bay) is its characters, especially Arkady Renko, who despite his lugubrious nature continues to show a heart as expansive and unfathomable as the Siberia steppe. --J. Kingston Pierce",
  "genres": [
    "Fiction",
    "Mystery",
    "Thriller",
    "Russia",
    "Crime",
    "Mystery Thriller",
    "Detective"
  ],
  "author": "Martin Cruz Smith",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/1779459.Wolves_Eat_Dogs"
}