{
  "title": "Powers That Be",
  "description": "Major Yanaba Maddock wasn't much good to the company anymore. With lungs practicaly destroyed by poison gas in a military debacle, she could barely breathe without coughing, much less do anything the least bit strenuous. But it wasn't the company's way to discard those they might still find some use for... and so they retired Yana to the icy planet Petaybee to do their spying.Strange things were happening on Petaybee. Unauthorized genetically engineered species had been spotted. Geologicic survey teams sent to locate newly detected mineral deposits were either coming up empty--or disappearing altogether. And the locals weren't talking. In fact, the company had reason to believe that the locals were deliberately hiding something--and perhaps even plotting rebellion. As a combat veteran and a medical retiree due to spend the rest of her days on this arctic world, Yana was the ideal person to get close to the natives.Having already lost her lungs in service to the company, Yana wasn't much of a mind to freeze to death for it, as well. But she quickly learned that the people of Petaybee were more than willing to adopt a sickly newcomer: they were eager to show her the ropes, introduce her around, teach her how to cook and how to keep warm, and even dose her up on a home remedy that calmed her cough and soothed her ragged lungs like nothing in the company's state-of-the-art medical kits.As Yana's strength and health returned, she became more and more determined to protect her new home and her new people from the depredations of a greedy and increasingly desperate company. For something strange and wonderful truly was happening on Petaybee. Something worth fighting for, or even dying for--but, especially, something worth liviing for...",
  "genres": [
    "Science Fiction",
    "Fantasy",
    "Fiction",
    "Science Fiction Fantasy",
    "Romance",
    "Space",
    "Audiobook"
  ],
  "author": "Anne McCaffrey",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/177947.Powers_That_Be"
}