{
  "title": "Coming Home",
  "description": "Librarian's note: This is an alternative cover version of ASIN B008KJAIDC.From the USA Today bestselling author of FINAL EXIT comes a breathtaking novel about love, friendship, and the fine line between the two.Songwriter Casey Bradley is just eighteen years old on the day that handsome, charismatic singer Danny Fiore blows into her life and sets her heart on fire. Good girl Casey has never done anything her dad would disapprove of, but the first time she looks into those turbulent blue eyes, the first time she hears that golden voice, she's ready to give up everything -- home, family, fiancé -- to follow Danny wherever his dreams lead them.Together with guitar wizard Rob MacKenzie, Casey writes the songs that catapult Danny to a fame beyond their wildest imaginings. Through the lean years, when there isn't enough to eat, and the fat years, when life comes at them so quickly there's no time to breathe, they're an unstoppable hit-making machine, the holy trinity of rock and roll. But the road to success is littered with land mines. Rivers of darkness flow through her troubled marriage, and every time Danny breaks her heart, it's Rob who picks her up, dusts her off, and glues the pieces back together.It isn't until an unimaginable tragedy rocks their solid foundation that Casey is forced to question who she is and what she really wants from life. As she searches for herself amid the wreckage, she discovers the bittersweet truth that the choices a woman makes at thirty may differ vastly from those she made at eighteen.COMING HOME is a poignant story about the seasons of a woman's heart, and the roundabout route we sometimes have to take to get to where we're meant to be.Don't miss the love story that readers have called \"epic,\" \"compelling,\" \"captivating,\" and \"beautifully written.\"",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Chick Lit",
    "Music",
    "Fiction",
    "New Adult"
  ],
  "author": "Laurie Breton",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/17795042-coming-home"
}