{
  "title": "Across Many Mountains: A Tibetan Family's Epic Journey from Oppression to Freedom",
  "description": "A powerful, emotional memoir and an extraordinary portrait of three generations of Tibetan women whose lives are forever changed when Chairman Mao’s Red Army crushes Tibetan independence, sending a young mother and her six-year-old daughter on a treacherous journey across the snowy Himalayas toward freedom.Kunsang thought she would never leave Tibet. One of the country's youngest Buddhist nuns, she grew up in a remote mountain village where, as a teenager, she entered the local nunnery. Though simple, Kunsang's life gave her all she needed: a oneness with nature and a sense of the spiritual in all things. She married a monk, had two children, and lived in peace and prayer. But not for long. There was a saying in Tibet: \"When the iron bird flies and horses run on wheels, the Tibetan people will be scattered like ants across the face of the earth.\" The Chinese invasion of Tibet in 1950 changed everything. When soldiers arrived at her mountain monastery, destroying everything in their path, Kunsang and her family fled across the Himalayas only to spend years in Indian refugee camps. She lost both her husband and her youngest child on that journey, but the future held an extraordinary turn of events that would forever change her life--the arrival in the refugee camps of a cultured young Swiss man long fascinated with Tibet. Martin Brauen will fall instantly in love with Kunsang's young daughter, Sonam, eventually winning her heart and hand, and taking mother and daughter with him to Switzerland, where Yangzom will be born. Many stories lie hidden until the right person arrives to tell them. In rescuing the story of her now 90-year-old inspirational grandmother and her mother, Yangzom Brauen has given us a book full of love, courage, and triumph,as well as allowing us a rare and vivid glimpse of life in rural Tibet before the arrival of the Chinese. Most importantly, though, ACROSS MANY MOUNTAINS is a testament to three strong, determined women who are linked by an unbreakable family bond.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "Asia",
    "History",
    "Book Club",
    "Buddhism"
  ],
  "author": "Yangzom Brauen",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/10834480-across-many-mountains"
}