{
  "title": "Generation XX",
  "description": "She was born to kill, and he was born to die.Imagine a world where man no longer rules. Imagine a world torn apart by the hands of those who are designed to create life, but instead reap death. This is not a Fairy Tale with a happily ever after, this is a story of the women who became fed up with the atrocities carried out by the sons they bore, the sons that later became, husbands, and fathers, and Sinners. No longer will women live as second class citizens, no longer will women yield, and kneel before man. It is time that we annihilate the disease, it is time to destroy the XY chromosome altogether. This is a story of how women fought back, and men are now at the mercy of women.Tristan, and Kiara are two strong willed individuals who have been torn apart by the system that rules them, and the circumstances they live in. Whilst she seeks change, he seeks revenge. The world around Kiara is being destroyed, as piece by piece it all crumbles, and slips through her delicate little fingers. As she looks around she sees all of the destruction, and heartache that her own mother has contrived. Soon the destruction will all be left in her tiny hands so that she may continue the legacy her mother fought so hard to engineer. Will Kiara become the killer she was born to be, or will she rise above, as her conscious, and her heart slowly guide her into a different path, a path to restore mankind, and the world around her. Will Tristan be able to to forgive, will he be the change Kiara so desperately seeks, or will he walk a different path entirely, and prove that men will never be worth dying for.A dark and tender love story set in the aftermath of a post-apocalyptic world.***Warning***Contains disturbing situations, graphic violence, sex, rape, strong language, and various types of abuse.“Friends forever” I tell him. His smile is boundless, free, and as bright as the burning sun. “Friends forever” he repeats, and so we spit on it binding our pact of friendship for an eternity. But that promise was long ago made, and has since been broken, a friendship tossed to the wind, and reclaimed by the breeze that has taken it far, far, far away to another place, another universe, perhaps a different time indeed. And so now the story goes ‘There once was little boy, who stole a little girls heart, and he kept it all to himself. Now she walks around with a void in her chest, wishing hoping that one day she could reclaim her precious heart again.'",
  "genres": [],
  "author": "KMV",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/17796427-generation-xx"
}