{
  "title": "The Price of Fear: The Film Career of Vincent Price, In His Own Words",
  "description": "Prior to his death in 1993, Vincent Price was collaborating with Mr. Joel Eisner (author of the over 100,000 copy bestselling Official Batman Batbook concerning the 60's Adam West Batman television series) to construct a definitive, official biography of his life and career in films. This is that book. Sanctioned by the Vincent Price Estate and daughter Victoria, THE PRICE OF FEAR is not only told through journalist Eisner's personal interviews with Price himself but with the cooperation, direct interviews and quotes from many of those with whom Price worked with throughout his illustrious career. Before he passed away, all Vincent saw of this book was his fellow actor Peter Cushing's heartfelt foreward. Introducing the true story of a man born within a moderately wealthy family of candy manufacturers in 1911 St. Louis, Missouri, whose interest in theatre during the Great Depression led him into eventually becoming, arguably, the most universally iconic personification of the horror genre in the entire encompassment of the 20st Century. That man was Vincent Leonard Price, Jr. This is the only authorized, official biography about Vincent Price's entire life in films ever published in history with his direct participation and approval, in his own words. Never before has the story of Vincent's life been told, how he rose from dramatic theatre and stage to joining the ranks of the early cultured Hollywood elite fresh from where motion pictures were first spawned to eventually spend his life behind horrifying makeup and horror genre movie roles at the sacrifice of a greater passion for fine art and comedy. This book features contributions from Christopher Lee, Charlton Heston, Peter Lorre, Roger Corman, Jane Russell, Bette Davis, Art Linkletter, Red Buttons, John Carradine, Richard Matheson, Sam Arkoff, and more, describing their own memories of the legend as well! For nearly a century, we've known the name. We've heard the voice. We've seen the many faces. At last, with The Price of Fear: The Film Career of Vincent Price, in His Own Words, we can know the man, directly from the legend himself, in this never-before-published highly entertaining and inspirational masterpiece.",
  "genres": [
    "Biography",
    "Nonfiction",
    "Horror",
    "Film",
    "Media Tie In"
  ],
  "author": "Joel Eisner",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/17796341-the-price-of-fear"
}