{
  "title": "Write, Edit, Revise: Learn Writing Skills, Editing Skills and Revising Skills",
  "description": "Write, Edit, Revise I divided writing an eBook into three phases. The first is writing a draft in simple sentences while organizing the facts correctly. The second is editing the book to ensure the formatting is correct, and all the information is in the proper place. The third is revising sentences and paragraphs to improve the eBook. Revising includes formatting the eBook for Kindle and proofreading the book. What’s in it for You? At first, this will seem difficult. If you work through the process once, you will find it is easier to write books when you can see the end from the beginning. How to Write an eBook Sentence Writing: You will learn an easy process for writing sentences that sound natural. You will do writing exercises and find you can easily combine these sentences into paragraphs. Paragraph Writing: You will learn how to structure a paragraph into three main parts for non-fiction writing. There is a special section for fiction writing. Section writing: You will learn how to organize the paragraphs within a section with one easy step. Even fiction writers can use this method.Chapter and Book Organization: You will learn how to work from the bottom up, so the book is organized when the first draft is complete.  How to Edit an eBook Part 1: Use my unique checklist to ensure you formatted the book correctlyPart 2: Use my checklist to drill down into the chapters, sections, paragraphs, and sentences to ensure all the information is organized correctly.Note: You will not rewrite during the editing phase.  How to Revise an eBook You will only need to rewrite sentences and paragraphs in this phase because everything is organized correctly. The next step is a comprehensive spelling and grammar check. Finally, you will upload and proofread your eBook for Amazon. Why you should Buy This Book You will improve all your writing. It will be simple to publish an eBook on Amazon.",
  "genres": [
    "Writing"
  ],
  "author": "Gary Thaller",
  "average_rating": "2.00",
  "url": "https://www.goodreads.com/book/show/17796840-write-edit-revise"
}