{
  "title": "Under the Wide and Starry Sky",
  "description": "NEW YORK TIMES BESTSELLER • TODAY SHOW BOOK CLUB PICKFrom Nancy Horan, New York Times bestselling author of Loving Frank, comes her much-anticipated second novel, which tells the improbable love story of Scottish writer Robert Louis Stevenson and his tempestuous American wife, Fanny.   At the age of thirty-five, Fanny Van de Grift Osbourne has left her philandering husband in San Francisco to set sail for Belgium—with her three children and nanny in tow—to study art. It is a chance for this adventurous woman to start over, to make a better life for all of them, and to pursue her own desires.  Not long after her arrival, however, tragedy strikes, and Fanny and her children repair to a quiet artists’ colony in France where she can recuperate. Emerging from a deep sorrow, she meets a lively Scot, Robert Louis Stevenson, ten years her junior, who falls instantly in love with the earthy, independent, and opinionated “belle Americaine.”              Fanny does not immediately take to the slender young lawyer who longs to devote his life to writing—and who would eventually pen such classics as Treasure Island and The Strange Case of Dr. Jekyll and Mr. Hyde. In time, though, she succumbs to Stevenson’s charms, and the two begin a fierce love affair—marked by intense joy and harrowing darkness—that spans the decades and the globe. The shared life of these two strong-willed individuals unfolds into an adventure as impassioned and unpredictable as any of Stevenson’s own unforgettable tales.Praise for Under the Wide and Starry Sky  “A richly imagined [novel] of love, laughter, pain and sacrifice . . . [Fanny Osbourne] kidnapped Robert Louis Stevenson’s heart.”—USA Today   “Powerful . . . flawless . . . a perfect example of what a man and a woman will do for love, and what they can accomplish when it’s meant to be.”—Fort Worth Star-Telegram   “Spectacular . . . an exhilarating epic about a free-spirited couple who traveled the world yet found home only in one another.”—Booklist (starred review)   “Horan’s prose is gorgeous enough to keep a reader transfixed, even if the story itself weren’t so compelling. I kept re-reading passages just to savor the exquisite wordplay. . . . Few writers are as masterful as she is at blending carefully researched history with the novelist’s art.”—The Dallas Morning News   “A classic artistic bildungsroman and a retort to the genre, a novel that shows how love and marriage can simultaneously offer inspiration and encumbrance.”\n—The New York Times Book Review\n   “Nancy Horan has done it again, capturing the entwined lives of Fanny Osbourne and Robert Louis Stevenson so uncannily, it reads like truth.”—Sarah Blake, author of The Postmistress   “Horan has a distinct knack for evoking the rich, complicated lives of long-gone artists and the women who inspired them.”—Entertainment Weekly  “Fanny and Louis are wild-hearted seekers, and Nancy Horan traces their incredible journey fearlessly, plunging us through decades, far-flung continents, and chilling brushes with death. Ambitious and often breathtaking, this sweeping story spills over with spirited, uncompromising life.”—Paula McLain, author of The Paris WifeFrom the Hardcover edition.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Book Club",
    "Historical",
    "Romance",
    "Audiobook",
    "Adult"
  ],
  "author": "Nancy Horan",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/17797252-under-the-wide-and-starry-sky"
}