{
  "title": "The Almost Girl",
  "description": "Seventeen-year-old Riven is as tough as they come. But coming from a world ravaged by a devastating android war, she has to be. There’s no room for softness, no room for emotion, no room for mistakes. A Legion General, she is the right hand of the young Prince of Neospes, a parallel universe to Earth. In Neospes, she has rank, responsibility and respect. But when Prince Cale sends her away to find his long-lost brother, Caden, who has been spirited back to modern day Earth, Riven finds herself in uncharted territory. Thrown out of her comfort zone but with the mindset of a soldier, Riven has to learn how to be a girl in a realm that is the opposite of what she knows.  Riven isn’t prepared for the beauty of a world that is unlike her own in so many ways. Nor is she prepared to feel something more than indifference for the very target she seeks. Caden is nothing like Cale, but he makes something in her come alive, igniting a spark deep down that goes against every cell in her body. For the first time in her life, Riven isn’t sure about her purpose, about her calling. Torn between duty and desire, she must decide whether Caden is simply a target or whether he is something more. Faced with hideous reanimated Vector soldiers from her own world with agendas of their own, as well as an unexpected reunion with a sister who despises her, it is a race against time to bring Caden back to Neospes. But things aren’t always as they seem, and Riven will have to search for truth. Family betrayals and royal coups are only the tip of the iceberg. Will Riven be able to find the strength to defy her very nature? Or will she become the monstrous soldier she was designed to be?",
  "genres": [
    "Young Adult",
    "Science Fiction",
    "Fantasy",
    "Dystopia",
    "Romance",
    "Fiction",
    "Zombies"
  ],
  "author": "Amalie Howard",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/17797457-the-almost-girl"
}