{
  "title": "Sex Workers Unite: A History of the Movement from Stonewall to SlutWalk",
  "description": "A provocative history that reveals how sex workers have been at the vanguard of social justice movements for the past fifty years while building a movement of their own that challenges our ideas about labor, sexuality, feminism, and freedom Documenting five decades of sex-worker activism, Sex Workers Unite is a fresh history that places prostitutes, hustlers, escorts, call girls, strippers, and porn stars in the center of America’s major civil rights struggles. Although their presence has largely been ignored and obscured, in this provocative history Melinda Chateauvert recasts sex workers as savvy political organizers—not as helpless victims in need of rescue. Even before transgender sex worker Sylvia Rivera threw a brick and sparked the Stonewall Riot in 1969, these trailblazing activists and allies challenged criminal sex laws and “whorephobia,” and were active in struggles for gay liberation, women’s rights, reproductive justice, union organizing, and prison abolition. Although the multibillion-dollar international sex industry thrives, the United States remains one of the few industrialized nations that continues to criminalize prostitution, and these discriminatory laws put workers at risk. In response, sex workers have organized to improve their working conditions and to challenge police and structural violence. Through individual confrontations and collective campaigns, they have pushed the boundaries of conventional organizing, called for decriminalization, and have reframed sex workers’ rights as human rights. Telling stories of sex workers, from the frontlines of the 1970s sex wars to the modern-day streets of SlutWalk, Chateauvert illuminates an underrepresented movement, introducing skilled activists who have organized a global campaign for self-determination and sexual freedom that is as multifaceted as the sex industry and as diverse as human sexuality.",
  "genres": [
    "Feminism",
    "Nonfiction",
    "History",
    "Sex Work",
    "Politics",
    "Activism",
    "Gender"
  ],
  "author": "Melinda Chateauvert",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/17797399-sex-workers-unite"
}