{
  "title": "Highlander's Hope",
  "description": "Update cover: B0714H2ZL3She's a strong-willed heiress. He's a powerful lord with a secret. Tempers and passion collide.Yvette Stapleton has no need for a husband. Ever. Possessed of a fortune, she's determined to forge her own future without matrimony's confining bonds. Besides, she's yet to meet a man who doesn't find her wealth more alluring than her. Until she meets Ewan, the Viscount Sethwick, that is.Ewan, also Laird McTavish of Craiglocky Keep, has one last mission before resigning his position as a covert agent: to oust a War Office traitor. He'll stop at nothing to succeed. Except exploit Yvette, the vixen who captured his interest months ago.As peril mounts, they flee to Scotland, the only place Ewan is confident he can keep Yvette safe. However, on the journey, dangerous circumstances force them into assuming the role of a married couple. Incensed upon discovering the marriage is legal under Scottish law, Yvette is determined to have the union annulled. But Ewan's just as resolute she'll remain his wife...This sigh-worthy Scottish Regency historical by a USA Today bestselling author will have you sitting on the edge of your seat! You won't be able to turn the pages fast enough to find out what happens to Ewan and Yvette next as their romance blossoms.If you enjoy reading enemies to lovers and marriage of convenience love stories brimming with mystery and suspense, a dash of humor, and gripping emotion then you'll adore Collette Cameron's mesmerizing CASTLE BRIDES SERIES. Buy HIGHLANDER'S HOPE and settle into your favorite reading nook with your beverage of choice for a rousing romantic adventure you can't put down.Though this book can easily be read as a stand-alone, most readers prefer to read the series in order.",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Historical Fiction",
    "Scotland",
    "Regency Romance",
    "Regency"
  ],
  "author": "Collette Cameron",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/17798578-highlander-s-hope"
}