{
  "title": "Dating Dr. Notorious",
  "description": "Being the best in her field doesn't seem to help famously successful sex therapist, Dr. Regina Logan, who manages to fix everyone’s love life but her own. Men won't date her. Her brutal honesty about physical matters intimidates most males. It also doesn’t help her love life that the press publishes every dating move she makes. Though she knows her negative publicity is the biggest problem, Regina thinks it's still ironic for a 47 yr old woman to be so knowledgeable about pleasing a man when there’s no lover in her life to benefit. Since most men have a tendency to run away before making it as far as her bed, it is definitely no surprise to Regina when \"nice guy\" Ben Kaiser rejects her after discovering her identity. But it still hurts. Ben’s kisses promise fulfillment of every fantasy she’s ever had, but no matter how great he is, Regina would be the first to admit there’s no room in her crazy public life for someone as nice as Ben.After losing his wife to a two-year battle with cancer, 50 yr old widower, successful CEO, and all around nice guy, Ben Kaiser, is ready to start dating again. At a charity fundraiser, he takes a risk and asks a beautiful woman to dance. Ben’s attraction to the woman is so compelling he ends up dragging her outside to a secluded garden for a make-out session worthy of his teenage years. Thrilled to find such attraction at his age, Ben is later shocked to discover the woman he’s been kissing so passionately is the notorious Dr. Regina Logan. Her full-out responses to his lovemaking have Ben putting his hands on her every chance he gets, and when Ben tries to run away, he doesn't get very far before deciding he's probably spent too much time in his life being nice. Still, the negative publicity generated by her notorious career requires them to keep their relationship hidden to protect Ben's reputation and business. After deciding he wants to marry Regina, keeping the way they feel about each other a secret ends up being something Ben just can't be nice about.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Chick Lit",
    "Fiction",
    "Adult"
  ],
  "author": "Donna McDonald",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/10835683-dating-dr-notorious"
}