{
  "title": "Skull in the Ashes: Murder, a Gold Rush Manhunt, and the Birth of Circumstantial Evidence in America",
  "description": "On a February night in 1897, the general store in Walford, Iowa, burned down. The next morning, townspeople discovered a charred corpse in the ashes. Everyone knew that the store’s owner, Frank Novak, had been sleeping in the store as a safeguard against burglars. Now all that remained were a few of his personal items scattered under the body.At first, it seemed to be a tragic accident mitigated just a bit by Novak’s foresight in buying generous life insurance policies to provide for his family. But soon an investigation by the ambitious new county attorney, M. J. Tobin, turned up evidence suggesting that the dead man might actually be Edward Murray, a hard-drinking local laborer. Relying upon newly developed forensic techniques, Tobin gradually built a case implicating Novak in Murray’s murder. But all he had was circumstantial evidence, and up to that time few murder convictions had been won on that basis in the United States.Others besides Tobin were interested in the case, including several companies that had sold Novak life insurance policies. One agency hired detectives to track down every clue regarding the suspect’s whereabouts. Newspapers across the country ran sensational headlines with melodramatic coverage of the manhunt. Veteran detective Red Perrin’s determined trek over icy mountain paths and dangerous river rapids to the raw Yukon Territory town of Dawson City, which was booming with prospectors as the Klondike gold rush began, made for especially good copy.Skull in the Ashes traces the actions of Novak, Tobin, and Perrin, showing how the Walford fire played a pivotal role in each man’s life. Along the way, author Peter Kaufman gives readers a fascinating glimpse into forensics, detective work, trial strategies, and prison life at the close of the nineteenth century. As much as it is a chilling tale of a cold-blooded murder and its aftermath, this is also the story of three ambitious young men and their struggle to succeed in a rapidly modernizing world.",
  "genres": [
    "True Crime",
    "Nonfiction",
    "History",
    "Mystery"
  ],
  "author": "Peter Kaufman",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/17802120-skull-in-the-ashes"
}