{
  "title": "Prismatic Ecology: Ecotheory beyond Green",
  "description": "Emphasizing sustainability, balance, and the natural, green dominates our thinking about ecology like no other color. What about the catastrophic, the disruptive, the inaccessible, and the excessive? What of the ocean’s turbulence, the fecundity of excrement, the solitude of an iceberg, multihued contaminations? Prismatic Ecology moves beyond the accustomed green readings of ecotheory and maps a colorful world of ecological possibility. In a series of linked essays that span place, time, and discipline, Jeffrey Jerome Cohen brings together writers who illustrate the vibrant worlds formed by colors. Organized by the structure of a prism, each chapter explores the coming into existence of nonanthropocentric ecologies. “Red” engages sites of animal violence, apocalyptic emergence, and activism; “Maroon” follows the aurora borealis to the far North and beholds in its shimmering alternative modes of world composition; “Chartreuse” is a meditation on postsustainability and possibility within sublime excess; “Grey” is the color of the undead; “Ultraviolet” is a potentially lethal force that opens vistas beyond humanly known nature. Featuring established and emerging scholars from varying disciplines, this volume presents a collaborative imagining of what a more-than-green ecology offers. While highlighting critical approaches not yet common within ecotheory, the contributions remain diverse and cover a range of topics including materiality, the inhuman, and the agency of objects. By way of color, Cohen guides readers through a reflection of an essentially complex and disordered universe and demonstrates the spectrum as an unfinishable totality, always in excess of what a human perceives. Contributors: Stacy Alaimo, U of Texas at Arlington; Levi R. Bryant, Collin College; Lowell Duckert, West Virginia U; Graham Harman, American U in Cairo; Bernd Herzogenrath, Goethe U of Frankfurt; Serenella Iovino, U of Turin, Italy; Eileen A. Joy; Robert McRuer, George Washington U; Tobias Menely, Miami U; Steve Mentz, St. John’s U, New York City; Timothy Morton, Rice U; Vin Nardizzi, U of British Columbia; Serpil Oppermann, Hacettepe U, Ankara; Margaret Ronda, Rutgers U; Will Stockton, Clemson U; Allan Stoekl, Penn State U; Ben Woodard; Julian Yates, U of Delaware.",
  "genres": [
    "Environment",
    "Nonfiction",
    "Research",
    "Criticism",
    "Essays"
  ],
  "author": "Jeffrey Jerome Cohen",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/17802098-prismatic-ecology"
}