{
  "title": "The Very Best of Tad Williams",
  "description": "This career retrospective from one of the most-beloved authors in the fantasy genre is essential for fans of his internationally best-selling series novels (Otherland; Memory, Sorrow, and Thorn).Tad Williams has achieved success in multiple genres and forms, whether in epic fantasy, urban fantasy, science fiction, or young adult fiction. Readers only familiar with such masterpieces as The Dragonbone Chair and Talchaser’s Song will be delighted to discover that in his short fiction, Williams has been able to explore myriad new possibilities and adventures.Previously collected in multiauthor anthologies and limited hardcover editions, these superlative talks of dragons, super-soldiers, wizards, cyberpunks, heroes, and fools are now available together for the first time in an affordable trade paperback edition. These stories showcase the exhilarating breadth of Williams’ imagination, in stories hearkening to the tales of such classic fantasists as J. R. R. Tolkien, Robert Jordan, Ray Bradbury, and Peter S. Beagle. Included is an original tale written specifically for this volume.The Very Best of Tad Williams is a true delight to those who have imagined themselves in fantastic worlds beyond the everyday and mundane.TABLE OF CONTENTSThe Old Scale GameThe Storm DoorThe Stranger’s HandsChild of an AncientCityThe Boy Detective of Oz: An Otherland StoryThree Duets for Virgin and NosehornDiary of a DragonNot with a Whimper, EitherSome Thoughts Re: Dark DestroyerZ is for...Monsieur Vergalant’s CanardThe Stuff that Dreams are Made OfFish Between FriendsEvery Fuzzy Beast of the Earth, Every Pink Fowl of the AirA Stark and Wormy KnightBlack SunshineAnd Ministers of Grace",
  "genres": [
    "Short Stories",
    "Fantasy",
    "Science Fiction",
    "Horror",
    "Anthologies",
    "Short Story Collection",
    "Fiction"
  ],
  "author": "Tad Williams",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/17802438-the-very-best-of-tad-williams"
}