{
  "title": "Lovecraft's Monsters",
  "description": "This deliciously creepy and loving tribute to the master of modern horror features riveting illustrated stories of his wicked progeny.In the century since the master of horror, H. P. Lovecraft, published his first story, the monstrosities that crawled out of his brain have become legend: the massive, tentacled Cthulhu, who lurks beneath the sea waiting for his moment to rise; the demon Sultan Azathoth, who lies babbling at the center of the universe, mad beyond imagining; the Deep Ones, who come to shore to breed with mortal men; and the unspeakably-evil Hastur, whose very name brings death. These creatures have been the nightmarish fuel for generations of horror writers, and the inspiration for some of their greatest works.This impressive anthology celebrates Lovecraft's most famous beasts in all their grotesque glory, with each story a gripping new take on a classic mythos creature and affectionately accompanied by an illuminating illustration. Within these accursed pages something unnatural slouches from the sea into an all-night diner to meet the foolish young woman waiting for him, while the Hounds of Tindalos struggle to survive trapped in human bodies, haunting pool halls for men they can lure into the dark. Strange, haunting, and undeniably monstrous, this is Lovecraft as you have never seen him before.Table of Contents“Only the End of the World Again” by Neil Gaiman“The Bleeding Shadow” by Joe R. Lansdale“Love is Forbidden, We Croak & Howl” by Caitlín R. Kiernan“Bulldozer” by Laird Barron“A Quarter to Three” by Kim Newman“Inelastic Collisions” by Elizabeth Bear“That of Which We Speak When We Speak of the Unspeakable” by Nick Mamatas“Red Goat Black Goat” by Nadia Bulkin“Jar of Salts” and “Haruspicy” by Gemma Files“Black is the Pit From Pole to Pole” by Howard Waldrop and Steven Utley“I've Come to Speak with You Again” by Karl Edward Wagner“The Sect of the Idiot” by Thomas Ligotti“The Dappled Things” by William Browning Spencer“The Same Deep Waters as You” by Brian Hodge“Remnants” by Fred Chappell“Waiting at the Cross Roads” by Steve Rasnic Tem“Children of the Fang” by John Langan",
  "genres": [
    "Horror",
    "Short Stories",
    "Fantasy",
    "Fiction",
    "Anthologies",
    "Lovecraftian",
    "Audiobook"
  ],
  "author": "Ellen Datlow",
  "average_rating": "3.69",
  "url": "https://www.goodreads.com/book/show/17802439-lovecraft-s-monsters"
}