{
  "title": "What She Left Behind",
  "description": "The breakout novel from the New York Times bestselling author of The Orphan Collector, What She Left Behind weaves together riveting stories of past and present, exploring the strength of women in two different times as they face adversity in two very different ways. Go inside the horrifying walls of a 1920s New York asylum as a wrongly imprisoned woman fights for what is most important to her—and meet the young woman confronting the pain and mystery of her own family’s mental illness two generations later.Ten years ago, Izzy Stone’s mother fatally shot her father while he slept. Devastated by her mother’s apparent insanity, Izzy, now seventeen, refuses to visit her in prison. But her new foster parents, employees at the local museum, have enlisted Izzy’s help in cataloging items at a long-shuttered state asylum. There, amid piles of abandoned belongings, Izzy discovers a stack of unopened letters, a decades-old journal, and a window into her own past.Young flapper and suffragette Clara Cartwright is caught between her overbearing parents and her desire to be a modern woman. Furious when she rejects an arranged marriage, instead finding love with an Italian Immigrant, Clara’s father sends her to a genteel home for nervous invalids. But when his fortune is lost in the stock market crash of 1929, he can no longer afford her care—and Clara is committed to the public asylum.Even as Izzy deals with the challenges of yet another new beginning, Clara’s story keeps drawing her into the past. If Clara was never really mentally ill, could something else explain her own mother’s violent act? Piecing together Clara’s fate compels Izzy to re-examine her own choices—with shocking and unexpected results.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Book Club",
    "Mystery",
    "Historical",
    "Audiobook",
    "Mental Illness"
  ],
  "author": "Ellen Marie Wiseman",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/17802747-what-she-left-behind"
}