{
  "title": "African Religions: A Very Short Introduction",
  "description": "What are African religions? African Religions: A Very Short Introduction answers this question by examining primarily indigenous religious traditions on the African continent, as well as exploring Christianity and Islam. It focuses on the diversity of ethnic groups, languages, cultures, and worldviews, emphasizing the continent's regional diversity. Olupona examines a wide range of African religious traditions on their own terms and in their social, cultural, and political contexts. For example, the book moves beyond ethnographic descriptions and interpretations of core beliefs and practices to look at how African religion has engaged issues of socioeconomic development and power relations. Olupona examines the myths and sacred stories about the origins of the universe that define ethnic groups and national identities throughout Africa. He also discusses spiritual agents in the African cosmos such as God, spirits, and ancestors. In addition to myths and deities, Olupona focuses on the people central to African religions, including medicine men and women, rainmakers, witches, magicians, and divine kings, and how they serve as authority figures and intermediaries between the social world and the cosmic realm. African Religions: A Very Short Introduction discusses a wide variety of religious practices, including music and dance, calendrical rituals and festivals, celebrations for the gods' birthdays, and rituals accompanying stages of life such as birth, puberty, marriage, elderhood, and death. In addition to exploring indigenous religions, Olupona examines the ways Islam and Christianity as outside traditions encountered indigenous African religion. He shows how these incoming faith traditions altered the face and the future of indigenous African religions as well as how indigenous religions shaped two world religions in Africa and the diaspora. Olupona draws on archaeological and historical sources, as well as ethnographic materials based on fieldwork. He shows that African religions are not static traditions, but have responded to changes within their local communities and to fluxes caused by outside influences, and spread with diaspora and migration.",
  "genres": [
    "Religion",
    "Nonfiction",
    "Africa",
    "Spirituality",
    "History",
    "Sociology",
    "Theology"
  ],
  "author": "Jacob K. Olupona",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/17803175-african-religions"
}