{
  "title": "Censorship and Cultural Sensibility: The Regulation of Language in Tudor-Stuart England",
  "description": "In this study of the reciprocities binding religion, politics, law, and literature, Debora Shuger offers a profoundly new history of early modern English censorship, one that bears centrally on issues still the rhetoric of ideological extremism, the use of defamation to ruin political opponents, the grounding of law in theological ethics, and the terrible fragility of public spheres. Starting from the question of why no one prior to the mid-1640s argued for free speech or a free press per se, Censorship and Cultural Sensibility surveys the texts against which Tudor-Stuart censorship aimed its biggest guns, which turned out not to be principled dissent but libels, conspiracy fantasies, and hate speech. The book explores the laws that attempted to suppress such material, the cultural values that underwrote this regulation, and, finally, the very different framework of assumptions whose gradual adoption rendered censorship illegitimate.Virtually all substantive law on language concerned defamation, regulating what one could say about other people. Hence Tudor-Stuart laws extended protection only to the person hurt by another's words, never to their speaker. In treating transgressive language as akin to battery, English law differed fundamentally from papal censorship, which construed its target as heresy. There were thus two models of censorship operative in the early modern period, both premised on religious norms, but one concerned primarily with false accusation and libel, the other with false belief and immorality. Shuger investigates the first of these models—the dominant English one—tracing its complex origins in the Roman law of iniuria through medieval theological ethics and Continental jurisprudence to its continuities and discontinuities with current U.S. law. In so doing, she enables her reader to grasp how in certain contexts censorship could be understood as safeguarding both charitable community and personal dignitary rights.",
  "genres": [],
  "author": "Debora Shuger",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/1781220.Censorship_and_Cultural_Sensibility"
}