{
  "title": "Eclipse of Dust",
  "description": "In an ordinary town, in an ordinary high school, extraordinary things begin to occur ... Last year just after Thanksgiving, our school was plagued by a series of strange, destructive incidents. In the first instance, the walls of the main corridor were scorched to a black chalky sort of substance and were cracked vertically from floor to ceiling in several areas. Many of the tiles were ripped off the walls and some of the doors leading to the various offices and classrooms had been \"violently removed\" from their frames. The town, a quite central New York village, is one of those \"nothing ever happens here\" places and, for the most part, that was true. But one day events quite out of the ordinary began to occur-violent and puzzling occurrences that no one was able to explain. Ultimately, it is an unsuspecting student whose fate it becomes to immerse himself into a world of encroaching terror and confront an undreamt of source of evil that few survive. ABOUT THE AUTHOR J. Ocher lives on the outskirts of Syracuse with his wife and three kids and has worked for many years as an HVAC mechanic. This is his first book and is currently chugging through its follow-up in the cracks between work, home, family, and nap times. Mr. Ocher's winters consist of snowshoeing to such exotic locales as the mailbox, and health-orientated activities including early-morning exercise rituals involving long-handled equipment known by locals as \"shovels.\" He summers amid fields of alfalfa, recently converted into clouds of wind-blown chaff that skillfully manages to maneuver itself into every possible crevice, and continues his exercise routine utilizing items called \"hay bales,\" which appear to require continuous relocation-consistently on days when heat and humidity conspire at their wickedest. The legendary conflict with flying pests, always at the forefront of his activities, illustrate that this champion of handymanhood can make even simple tasks a fruitless labor of intense frustration, usually accompanied by drama of Oscar-worthy consideration. Sometimes he plays guitar, too.",
  "genres": [],
  "author": "J. Ocher",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/17818387-eclipse-of-dust"
}