{
  "title": "Valley of Bones",
  "description": "The startling reviews of Tropic of Night announced Michael Gruber as one of the most talented thriller writers to debut in many years. Now, with the much-anticipated publication of Valley of Bones , Gruber fulfills that genre-bending promise as perhaps no writer since Graham Greene, with a genuinely exhilarating thriller that simultaneously offers a profound, deeply provocative exploration of the nature of faith itself. The setting is Miami. Rookie cop Tito Morales arrives at the Trianon Hotel to investigate a routine disturbance call -- and, to his shock and horror, watches as a wealthy oilman plunges ten stories and impales himself on a nearby fence. Soon Morales is joined by detective Jimmy Paz, famous throughout the city for solving -- or at least providing a plausible solution to -- the so-called Voodoo Murders that left Miami burning months earlier. Together Paz and Morales enter the hotel and discover, in the dead man's room, a most unusual suspect, an otherworldly woman by the name of Emmylou Dideroff. She emerges from a rapturous, prayerlike state and admits that she had a motive for killing the oilman. Ultimately, she says she wants to confess, and asks for a pen and several notebooks in which to convey the details of her confession. What Emmylou writes is nothing like what Paz expects; he enlists psychologist Lorna Wise in an effort to make sense of things that go beyond Emmylou's explanation of the details of childhood abuse, of other crimes committed, of regular communion with saints -- and with the devil. Is she mentally disturbed or playacting in hopes of getting declared unfit for trial? Or does she really believe herself to be an instrument of God? And why is it that so many people -- including Paz's biological father -- are suddenly interested in the contents of these notebooks and in preventing them from becoming public? As Valley of Bones moves toward its startling and dramatic finale, Emmylou's \"confessions\" lead Jimmy Paz, Lorna Wise, and Tito Morales down a series of unexpected and dangerous turns that puts them in the path of perhaps the most terrifying evil imaginable and forces each of them to confront questions about faith, love, and the possibility of the miraculous.",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Crime",
    "Suspense",
    "Mystery Thriller",
    "Horror"
  ],
  "author": "Michael Gruber",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/178187.Valley_of_Bones"
}