{
  "title": "The Smoke Room",
  "description": "From the terror of a lightless, smoke-clogged building to the secrets kept by the men and women who trust their partners with their lives, Earl Emerson knows the world of firefighting like no other author–and writes about it with passion and piercing honesty. In his remarkable new thriller, Emerson fuses together a gripping drama with unforgettable scenes of peril that, in this realm, can explode at any second.Jason Gun, a risk-taking rookie firefighter who grew up on the wrong side of the tracks, has found in his firehouse the family he never had as a child. Then, in one ill-fated turn of events, it all begins to go wrong.A bizarre accident brings a thrill-seeking woman into Engine Company 29–and into Jason’s life. Suddenly, his future on the job is at risk. Two fellow firefighters know that he missed a call because of some sexual heroics at the wrong time and place. Now, deeply in their debt, he will find out what kind of men his partners really are.When these two firefighters come upon a fortune in missing bearer bonds–money found in a dead man’s house–Jason is forced to become an accessory to their crime. And when evidence of their greed, foolishness, and thievery begins to emerge, Jason is witness to an even darker deed.Suddenly, the twenty-four-year-old, who only wanted to do the right thing, is trapped behind a wall of silence. Trying to undo his mistake, Jason moves further into the darkness, where a beautiful young woman might just be his emotional rescue–or yet one more very wrong move. Unfortunately for Jason, the worst isn’t behind him. Like a fire hit by wind, the killing has raged out of control.Capturing the thin line that separates a hero from a criminal, and an enemy from a friend, Earl Emerson’s new novel is a gripping tale of a man’s dangerous fall from grace–and of his fierce battle for redemption.",
  "genres": [
    "Mystery",
    "Fiction",
    "Thriller",
    "Suspense"
  ],
  "author": "Earl Emerson",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/1781872.The_Smoke_Room"
}