{
  "title": "The Other Man: 21 Writers Speak Candidly About Sex, Love, Infidelity, & Moving On",
  "description": "Who is the other man?He’s an accident waiting to happen: the skateboarder round the bend, the smiling barista with the extra hot mocha, the computer geek eager to retool your mate’s hard drive. He’s a relationship gatecrasher bound by no rules and with no sense of fair play. Like Caesar, he comes, he sees, he conquers. On the flip side, you or I can be the other man, charging in and breaking the bonds of a committed relationship without a thought to the pain and misery inflicted upon the injured parties. Face it: We’re not all innocent bystanders in other-man scenarios.The Other Man is an artistic collaboration by and about gay men and their relationships. If you’ve ever been the other man, had him invade your life, or are just plain curious about this beguiling, unpredictable and dangerous creature, then this anthology of personal essays is for you. Twenty-one of our most acclaimed authors, many Lambda Award winners and finalists, write candidly about either being the other man, suffering the other man or having their relationships tested by infidelity. What they tell us is we must take heart, it does get better and one day our luck is bound to change. We’ll survive the bumps and detours in our relationships and weather the storms, or resolve to move on. Along the way, we’ll hope to meet someone new and simpatico, maybe even our long-awaited soul mate. Life will be good again. Or will it?Contributors include: Perry Brass, Austin Bunn, Rob Byrnes, Mark Canavera, R.W. Clinger, Lewis DeSimone, Paul Alan Fahey, Wes Hartley, William Henderson, Allen Mack, Jeff Mann, Tom Mendicino, Erik Orrantia, Felice Picano, David Pratt, Glen Retief, Jeffrey Ricker, Rodney Ross, Jason Schneiderman, Philip Dean Walker, and Chuck Willman. Edited by: Paul Alan Fahey.A portion of the proceeds from the sale of this anthology will go to the It Gets Better Project.",
  "genres": [
    "Nonfiction",
    "Gay",
    "M M Romance",
    "Memoir",
    "Anthologies",
    "Humor"
  ],
  "author": "Paul Alan Fahey",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/17823716-the-other-man"
}