{
  "title": "Witchwoods",
  "description": "Witches, most maligned as evil emissaries of the devil himself, have mystified us for centuries. The devil placed women, perceived to have sold their souls, into communities to wreak havoc on society. The Puritan leaders, during the birth of the country, believed this when they systematically tried to rid the world of witches during the Salem witch trials in 1692. To the religious zealots of the time, the trials rectified the perceived departure of the accused from the group's strict puritanical beliefs and rid their community of the impurities that the so-called witches represented. One of those convicted witches escaped the tyranny of the times and cast her revenge deep within the woods of Tennessee. Three couples, all young and excessively rich, decided to spend their twenties exploring the world and then embarking on starting families and living the American dream. The friends were inseparable, all with a love for travel and genuine care for each other. Josh and Sydney Fenton began to grow their wealth directly out of college. Hank and Nancy Peterson inherited his family's business valued at one and a half billion dollars. Ethan, Josh's brother, and Doug, Nancy's brother, met a year after Hank met Nancy. Ethan and Doug each owned a large, profitable design firm. The couple married in California, a state that allowed the legal union of same-sex partners. They then merged their enterprises to form the largest design firm in the world. The group of close friends traveled extensively throughout the world for eight years, visiting such renowned and reportedly haunted sites as The Tower of London in England, Edinburgh Castle in Scotland, and the Hollywood-Roosevelt Hotel in California. The friends soon unanimously agreed that, above all others, the scary places in the world most thrilled and captivated their imaginations. When two of the couples were having problems in their relationships, Sydney attempted to bring about reconciliations by planning another scary trip. They arrived at their destination in Tennessee, a 500-acre tract of land reportedly haunted by the infamous Bell Witch. Sydney and the group loved being among the beauty of nature. Spending time in the notorious woods would, she hoped, rekindle the love that the two couples had once shared for each other. Sydney convinced her husband, Josh, to buy the land, and together the three couples set out to spend a few weeks searching for the Bell Witch. Together with Sydney's sister, Bonnie, a modern-day witch, and a well-seasoned mountain-man guide named DR, the group set out on an adventure that they would come to regret. What they did not realize at the time was that the Bell Witch was not the only witch they would encounter. They entered the woods and into the witches' domain, with innocent hopes of a fun and conciliatory outing for the two struggling couples amid the tall pines. What awaited them, instead, were violent, murderous entities that forced them through a death-dodging experience that changed their lives forever. The witches held them captive within their lair, forced them to fight for their freedom, and indeed for their lives before the witches and their claimed woods pushed the friends deeper into the witches' psychotic realm.",
  "genres": [],
  "author": "Gary D. Henry",
  "average_rating": "4.80",
  "url": "https://www.goodreads.com/book/show/17823395-witchwoods"
}