{
  "title": "Believers",
  "description": "\"Believers\" is the story of how a gangland dispute erupts over a student union election, where the stakes become ludicrously high ... Small time Edinburgh gangsters Martin Bannister and Kevin Grant have problems. Not only are they marooned in the small northern Scottish town of Oakshield, where they are part time students at the local university, but the licensing board has just closed the bar they were using to run their growing drug operation .... There are big profits at stake, and with them status as serious players, under the wing of gangland rising star Brian Bedford. When Bedford visits Oakshield and gives them a week to come up with a plan, Bannister and Grant are feeling the heat ... Bannister proposes a solution; they will take over the Oakshield University Union in the coming elections, and run everything from there. Two things stand in their way ... their inexperience, and the other candidates .... To help with the first they enlist a student union radical who is looking to settle old scores ... and they unleash a campaign of violence and intimidation against their rivals .... But not everyone goes as quietly, or as easily, as they'd hoped ... and when the front runner, Glasgow boy John Gillan, proves to have more in his locker than just political know-how, and when his own friends in low places begin to push back, what was an ordinary student election race becomes something much more ....On one side is a ruthless gangland enforcer, who will stop at nothing to set up his independent operation, and on the other is an equally ruthless young political comer who will go to even greater lengths to win ....And in between, on the battlefield, are those who've chosen a side ... those who've decided to fight ... some because they have a stake in the outcome ... the others because they are believers.Believers is a ruthless examination of our political system, the low nature of campaigns and a look at the lies the candidates tell each other and the electorate ... and the ones they tell themselves. It's a study of violence as a political weapon, the media that shapes our opinions ... and an examination of the processes which led us to the greatest political miscalculation in our recent history ... the invasion of Iraq.",
  "genres": [],
  "author": "James  Forrest",
  "average_rating": "2.43",
  "url": "https://www.goodreads.com/book/show/17827458-believers"
}