{
  "title": "Il complesso di Telemaco. Genitori e figli dopo il tramonto del padre",
  "description": "Edipo e Narciso sono due personaggi centrali del teatro freudiano. Il figlio-Edipo è quello che conosce il conflitto con il padre e l’impatto beneficamente traumatico della Legge sulla vita umana. Il figlio-Narciso resta invece fissato sterilmente alla sua immagine, in un mondo che sembra non ospitare più la differenza tra le generazioni. Abbiamo visto cosa significa l’egemonia del figlio-Narciso: dopo il tramonto dell’autorità simbolica del Nome del Padre, il mito dell’espansione fine a se stessa ha prodotto la tremenda crisi economica ed etica che attraversa l’Occidente. Le nuove generazioni appaiono sperdute tanto quanto i loro genitori. Questi non vogliono smettere di essere giovani, mentre i loro figli annaspano in un tempo senza orizzonte, soli, privi di adulti credibili. Esiste un al di là del figlio-Edipo e del figlio-Narciso?Esiste un al di là della guerra tra le generazioni e dell’individualismo senza speranza? Telemaco, il figlio di Ulisse, attende il ritorno del padre; prega affinché sia ristabilita nella sua casa invasa dai Proci la Legge della parola. In primo piano non è qui il conflitto tra le generazioni (Edipo), né l’affermazione edonista e sterile di sé (Narciso), ma una domanda inedita di padre, una invocazione, una richiesta di testimonianza che mostri come si possa vivere con slancio e vitalità su questa terra.Nel nostro tempo nessuno sembra più tornare dal mare per riportare la Legge sull’isola devastata dal godimento mortale dei Proci. Il processo dell’ereditare, della filiazione simbolica, sembra venire meno e senza di esso non si dà possibilità di trasmissione del desiderio da una generazione all’altra e la vita umana appare priva di senso. Eppure è ancora possibile, nell’epoca della evaporazione del padre, un’eredità autenticamente generativa: Telemaco ci indica la nuova direzione verso cui guardare, perché Telemaco è la figura del giusto erede. Il suo è il compito che attende anche i nostri figli: come si diventa eredi giusti? E cosa davvero si eredita se un’eredità non è fatta nè di geni nè di beni, se non si eredita un regno?",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Psychoanalysis"
  ],
  "author": "Massimo Recalcati",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/17827783-il-complesso-di-telemaco-genitori-e-figli-dopo-il-tramonto-del-padre"
}