{
  "title": "Otherworld Nights",
  "description": "This short story collection includes one brand-new tale, one story previously available only at Kelley Armstrong's website, and re-prints some hard-to-find stories from various anthologies as well as the entire novella Hidden.\"Demonology\" - Adam's mother discovers what he is\"Twilight\" - a Cassandra & Aaron story from \nMany Bloody Returns\n\"Stalked\" - Clay & Elena's honeymoon story from \nMy Big Fat Supernatural Honeymoon\n\"Chivalrous\" - Reese's backstory from SubPress's long sold-out \nTales of Dark Fantasy 2\n\"Lucifer's Daughter\" - Hope & Karl story from \nBlood Lite II: Overbite\n\nHidden\n -- reprinted from SubPress chapbook\"From Russia with Love\" - The Pack bonus story included with hardcover of \nThirteen\n\"Vanishing Act\" - brand-new Savannah & Adam novella set after \nThirteen\nFor every fan of the women of the Otherworld who is longing for more, a suspenseful and sexy new collection of stories and novellas by Kelley Armstrong.In Otherworld Nights, Armstrong brings together some of her favourite love matches, taking us on honeymoon with her werewolves, Elena and Clay; showing us how her vampires, Cassandra and Aaron, express their unique bond; revealing how Karl proposed to Hope; and illustrating how the young Australian werewolf, Reese, learned the dangers of infatuation, among other stories. By popular demand, shes also included her fan-favourite novella, Hidden.As an exciting conclusion, Armstrong has written a brand-new novella that takes us beyond the end of 13 to show us what happens after Savannah and Adam save the Otherworld--and realize they do love each other. The trouble is whether they know what love really means--coupled with the little wrinkle of having to figure that out while they battle demons. The kind from hell.",
  "genres": [
    "Urban Fantasy",
    "Fantasy",
    "Paranormal",
    "Romance",
    "Short Stories",
    "Vampires",
    "Anthologies"
  ],
  "author": "Kelley Armstrong",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/17827953-otherworld-nights"
}