{
  "title": "مسؤولية الأب المسلم في تربية الولد في مرحلة الطفولة",
  "description": "هذ الكتاب هو بحث قدم من قبل الكاتب كبحث تكميلي لنيل درجة الماجستير في التربية الاسلامية بجامعة أم القرى بمكة المكرمة بتاريخ 1989 م الموافق 1409 هـمن خلال فصول وفقرات البحث تتعرف على نتائج هامة تهم الأب المسلم في تربية أولاده، وقد انبثقت عن هذه النتائج توصيات تُبَصِّرُ الأب بأولويات المهام والمسؤوليات التي لا بد من أخذها في الاعتبار عند ممارسته لواجباته التربوية تجاه أولاده.وفيما يلي نستعرض أهم هذه النتائج والتوصيات:1ـ يوجب الإسلام على الأب تعليم ولده وتأديبه، وتعريفه أحكام الحلال والحرام مما يتطلب علم الأب بهذه الأحكام ومعرفته بها، لهذا يُوصى الأب بأن يطلع على التشريعات الإسلامية، خاصة الأساسية منها، ليتمكن من تعليم أولاده ـ منذ حداثتهم ـ أحكام الحلال والحرام في صورة مبسطة سهلة يمكنهم إدراكها واستيعابها. ومن ثم متابعتهم في العمل بها وتطبيقها في واقع الحياة.2ـ يُعتبر التلقين لأساسيات الدين ومفاهيمه الكبرى في مرحلة الطفولة وسيلة هامة من وسائل التربية الفكرية، فكل ما يتلقاه الولد الصغير من معلومات ومفاهيم تُسجل في حافظته، وتُنقش في قلبه، فإذا كبر عقلها بصورة أفضل، وطبقها بصورة أحسن، كما أن اقتناعة وقبوله لهذه المعلومات والمفاهيم سهل ميسر في هذه المرحلة، وبناء على ذلك يُوصى الأب بوضع هذه المفاهيم موضع الاعتبار عند ممارسته للتربية.3ـ تؤثر اللغة المستخدمة مع الطفل على فكره وخلقه ونموه العقلي، فهي الأوعية والقوالب التي تنقل الاعتقادات والرموز والأفكار والتصورات من جيل إلى جيل، لهذا يُوصى الأب بحسن استخدامها، واختيار أفضل الألفاظ، وأثرى العبارات المهذبة، مع التركيز على طول الجمل الكلامية عند مخاطبة الولد، وتنويع الكلمات والعبارات، وذلك ليتزود الولد بالمعلومات الجديدة حول طريقة اللفظ، والتعرف على مفردات جديدة تثري مخزونه من الكلمات وتعرفه أساليب عرض المعلومات.4ـ يعد التقليد الأعمى، واتباع الهوى، وانحراف المدرسة الحديثة من معوقات التربية الفكرية للولد، مما يتطلب توصية الأب بتنمية شخصية الولد، ورفع معنوياته، وبذر روح الطموح والمثابرة وعلو الهمة في نفسه وعقله، ليواجه بقوة هذا الانحراف، مع حفظه وحمايته من انحرافات المدرسة، بحسن اختيارها، ومتابعة مناهجها، وتزويد الولد بالقدرات والمهارات الفكرية اللازمة، ليتمكن من التمييز بين الحق والباطل من المعلومات والأفكار والتصورات التي يتلقاها من أساتذته.5ـ أثبتت بعض البحوث الميدانية أن الفراغ من أهم أسباب الوقوع في المعاصي والمنكرات، والانحرافات الخلقية والسلوكية، ويرجع سبب وجود هذا الفراغ إلى عدم معرفة الهدف الصحيح والغاية من الحياة، وعدم وجود التصور الواضح المتكامل لهذه الحياة، والجهل بمهام الإنسان ومسؤولياته في هذا الكون، فأدى الجهل بهذه المفاهيم إلى أن تصل ساعات الفراغ عند بعض فئات الشباب إلى أربع ساعات يومياً، وسبع ساعات في أيام الإجازات، مما ينذر بخطورة سوء استغلال هذه الأوقات الطويلة فيما لا يعود بالخير على النفوس والأوطان. وليس ثمة حل لهذه المشكلة سوى أن يوصى الأباء بإشغال هذا الوقت الطويل لدى أولادهم من خلال إقامة النشاطات والبرامج الثقافية والرياضية المختلفة، ووضع هذه النشاطات في جداول زمنية منظمة تكفل شغل كامل يوم الولد دون ثغرات.6ـ تشكل ظاهرة انتشار الخادمات الأجنبيات خطراً فادحاً على عقيدة الولد وخلقه وثقافته خاصة اللاتي لا يجدن اللغة العربية منهن، وقد دلت البحوث الميدانية بمنطقة الخليج على أن أكثرهن غير مسلمات، ولديهن اهتمام بعقائدهن وشعائرهن التعبدية، إلى جانب ثبوت انحرافات خلقية وسلوكية عند كثير منهن، مما يشير إلى مدى الخطورة المتوقعة من أمثالهن على الأولاد. ولا شك أن الأب هو المسؤول الأول عن تربية أولاده، ورعايتهم وحفظهم من الانحرافات، لهذا يوصى الأب بأن يحرص غاية الحرص على حسن انتقاء الخادمة المسلمة العربية ـ إذا دعت الحاجةـ الملتزمة شرع الله، والكبيرة السن والعارفة بشؤون تدبير المنزل، والمتزوجة مع مراعاة عدم تكليفها شيئاً من شؤون تدبير الأولاد المباشرة.",
  "genres": [],
  "author": "عدنان حسن باحارث",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/17828158"
}