{
  "title": "A Rogue's Rescue",
  "description": "From the author of The Viscount's Valentine comes a Classic Regency Romance novella celebrating the world made popular by Georgette Heyer.Despite her vast wealth, Miss Ariadne Lambert, at the ripe old age of thirty-three, is a plain and aging spinster with little but a fading hope that a knight in shining armor will come to sweep her off her feet. Which makes her the perfect prey for the unscrupulous “Dapper” Dorsey, who would stop at nothing to seduce a needy and wealthy woman and then coldly fritter away her funds in the gaming halls of London. As Ariadne succumbs first to his wily charms and then to his kisses, will her need for affection rob her of her dignity—and her fortune? Viscount Ingram, whose soiled reputation from one especially salacious incident has left him exiled to the sidelines of society, marks his time as a dark and brooding man, tolerated more for his title than his merit. But even he has his standards, and when he learns of a rival’s plot to seduce and then steal from a helpless spinster, he vows to stop him. Ingram’s noble sentiments and uncharacteristic sincerity are in for a shock, however, as he discovers that the hopelessly gullible Ariadne is in fact a clever and shrewd woman who’s got more than a silly giggle up her sleeve. As the two team up in a devilish scheme to bring about the final undoing of Dorsey, cooperation turns to admiration and then attraction, and they discover that their last chance to repair their reputations may also be their first chance at finding true love.About the Lea Simpson is a nationally bestselling romance and mystery novelist with over twenty titles published in the last eleven years. Besides writing romance and mystery novels and reading the same, Donna has a long list of cats and tea, cooking and vintage cookware, cross-stitching and watercolor painting among them. She lives in Canada.",
  "genres": [
    "Historical Romance",
    "Romance",
    "Regency",
    "Regency Romance",
    "Novella"
  ],
  "author": "Donna Lea Simpson",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/17828325-a-rogue-s-rescue"
}