{
  "title": "50 Classic Philosophy Books",
  "description": "An anthology of 50 classic philosophy works with an active table of contents to make it easy to quickly find the book you are looking for.Works include:As A Man Thinketh by James AllenThe Age of Reason by Thomas PaineAlcibiades I by PlatoAlexandria and her Schools by Charles KingsleyAn 'Attic' Philosopher by Emile SouvestreAn Enquiry Concerning Human Understanding by David HumeAn Enquiry Concerning the Principles of Taste, and of the Origin of our Ideas of Beauty, etc. by Frances ReynoldsAn Essay on the Beautiful by PlotinusAn Introduction to Philosophy by George Stuart FullertonThe Analects of Confucius by James LeggeThe Analysis of Mind by Bertrand RussellThe Ancient East by D. G. HogarthSUN TZU ON THE ART OF WAR by Sun TzuThe Basis of Morality by Annie BesantBergson and His Philosophy by J. Alexander GunnBeyond Good and Evil by Friedrich NietzscheThe Book of Tea by Kakuzo OkakuraBook of Wise Sayings by W. A. CloustonThe Breath of Life by John BurroughsBushido, the Soul of Japan by Inazo NitobéThe Conditions of Existence as Affecting the Perpetuation of Living Beings by Thomas H. HuxleyThe Complete Angler 1653 by Isaak WaltonThe Conquest of Fear by Basil KingCosmic Consciousness by Ali NomadCreative Unity by Rabindranath TagoreThe Critique of Practical Reason by Immanuel KantDeath by Maurice MaeterlinckHints Towards the Formation of a More Comprehensive Theory of Life by Samuel Taylor ColeridgeA History of Freedom of Thought by John Bagnell BuryHistory of Mediaeval Jewish Philosophy by Isaac HusikThe Idea of God in Early Religions by F. B. JevonsInitiation into Philosophy by Emile FaguetIntroduction to the Philosophy and Writings of Plato by Thomas TaylorKant's Theory of Knowledge by Harold Arthur PrichardThe Law and the Word by Thomas TrowardLeviathan by Thomas HobbesMan And Superman by George Bernard ShawOn the Duty of Civil Disobedience by Henry David ThoreauPragmatism by William JamesPrinciples of Philosophy by Rene DescartesThoughts of Marcus Aurelius Antoninus by Marcus Aurelius AntoninusTragic Sense of Life by Miguel de UnamunoWhat is Property? by P. J. ProudhonWhere No Fear Was: A Book About Fear by Arthur Christopher BensonWithin You is the Power by Henry Thomas HamblinFundamental Principals of the Metaphysic of Morals by Immanuel KantThus Spake Zarathustra by Friedrich NietzscheA Treatise of Human Nature by David HumeThe Problems of Philosophy by Bertrand RussellThe Ethics by Benedict de Spinoza",
  "genres": [
    "Philosophy"
  ],
  "author": "Golgotha Press",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/17828182-50-classic-philosophy-books"
}