{
  "title": "Taming Emma",
  "description": "Emma had always been interested in exploring the world of BDSM, and given her desperate circumstances, this sounded like the perfect opportunity. One weekend of complete submission to the highest bidder among a select group of wealthy men, and her financial troubles would be over. Emma wasn’t really sure what to expect when she agreed to the deal, but one thing she definitely did not expect was Luke Roark.The moment Luke removed the blindfold and recognized the beautiful, nearly-nude young woman standing before him as Emma Lawson, his best-friend’s little sister, he knew what he had to do. However, after buying her contract with the intention of giving her a firm lecture and taking her home, he cannot help but imagine the things he could teach her.Emma spent many years as a teenager fantasizing about Luke, and when he is suddenly thrust into her life again she is torn between her fears and her desires, but her need to submit wins out. Emma chooses to stay and honor her contract, and she quickly finds herself on her knees before him, bare, bound, helpless, and forced to take whatever he wishes to give her… and he wishes to give her a great deal, relishing the chance to play Emma’s naked, trembling body like a finely-tuned instrument until she is blushing red and begging for more.It is not long, though, before both Luke and Emma can feel that something much more than just physical attraction binds them together, but can they put aside their painful pasts and embrace a future together?Publisher’s Note: Taming Emma is an erotic novel that includes spankings, anal play, exhibitionism, graphic sexual scenes, elements of BDSM, and more. If such material offends you, please don’t buy this book.",
  "genres": [
    "BDSM",
    "Erotica",
    "Contemporary",
    "Romance",
    "Erotic Romance",
    "Contemporary Romance",
    "Fiction"
  ],
  "author": "Natasha Knight",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/17828940-taming-emma"
}