{
  "title": "Shiloh",
  "description": "In a world of perpetual darkness, a boy is born who wields remarkable power over fire. Amos is no more than seven when he kills a Shadow Wolf and becomes a legend in Shiloh. He would be destined for great things were it not for the stories his father tells about a world beyond the Shadow and a time before the Shadow. Only madmen hold to such tales, and in Shiloh, they have always come to bad ends.Amos is fearless. He walks with easy confidence, certain that the Shadow cannot touch him. Even his family is in awe of him. His father marvels at his skill with the bow, his mother thanks the gods that he has all the courage she lacks, and his sister, Phebe, worships him for saving her from an attack of the Shadow Cats.On a trip to the village of Emmerich, Amos rescues the Magistrate’s son, Simeon, from the village bullies. Simeon, fair-skinned and pale-eyed like other Dreamers in Shiloh’s history, becomes Amos’s constant companion and dearest friend. Simeon becomes a part of Amos’s family, listening to fireside stories told in a way he’s never heard them before and learning to wield a bow and arrow.The year the boys turn twelve, they are itching to prove themselves. An impetuous plan to steal a beautiful lantern goes miserably awry, and the lantern’s owner prophecies that Amos will be devoured by the Shadow. For the first time, a seed of fear is planted in Amos’s mind, and when his father is killed by a Shadow Wolf on the last day of the Great Hunt, the fear takes hold. If so great and brave a man as his father could fall to the Shadow, what hope has he?Buy your copy of Shiloh today to find out more ...Authors Website: http://www.helenasorensen.com Twitter: http://twitter.com/HelenaSorensen1 Facebook: http://www.facebook.com/pages/Helena-...Publishers Website: http://www.MyInkBooks.comReviews:http://downrightdystopian.blogspot.ca...We are doing a black Friday Sale on Amazon! This book will be at the unheard of price of .99 USD (note, it is more than likely we won't ever have the book at this price again, so if you wanted to read it, the black Friday sales is the time to get it.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Young Adult",
    "Christian",
    "Christian Fiction",
    "Teen",
    "Childrens"
  ],
  "author": "Helena Sorensen",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/17829453-shiloh"
}