{
  "title": "Empty Roads & Broken Bottles: in search for The Great Perhaps",
  "description": "For signed copies + more quotes: http://www.CharlotteEriksson.comThe story of The Glass Child, Charlotte Eriksson, is one of those you usually see on movies. Only 18 years old she left everything she had and knew to dedicate her life to her music and art. A vague dream about reaching out turned out to be a fight for freedom, real art and belonging. A journey about self-discovery, learning solitude, the difference between having a home and feeling at home and finally, slowly, finding a home in oneself. In music, in words, in moments. Charlotte spent a year homeless on the road, sleeping at friends’ and fans’ floors, learning and searching. Aiming to inspire others to create their own lives and showing that you can become exactly who you want to become, if you just want it bad enough. ”I wanted to turn my life into art. My very existence into a poem. This is my story. It’s been a beautiful adventure. It always will be.”*************************\"Instant coffee and a tip from the sound-guy. I'm learning sounds, laying wide awake on different sofas every night. I know the difference between a well built wall and broken strength. I'm learning mindfulness, reading about gurus and poets every day on different trains to nowhere. I don't know what I'm learning but I hope I will understand one day. I'm selling my heart with each album and a silent prayer that they’ll be gentle with it, gentle with me. And then the concerned looks they throw when I point at my worn out bag and broken guitar case as the answer to where I live. Sure I could spend a year or two selling my days and time for money, and I could buy all these things people want to have without never really needing it. It's just that when I'm on that stage every night, it all just seems so stupid. My guitar, my voice, my words, my story. That's all I want, that's what makes my heart beat. What am I supposed to do with belongings and material stuff when all I want is this. The open road and a new beginning every day. I don't have a lot and I gave away the things you're supposed to have to be able to live. I don't own any keys and I threw my phone in the river. My family will always remember me as the confused one who left and never came back. I'm searching. I will be forever wandering. I don't know what I'm looking for, but I will spend the rest of my life trying to find it.\"\"I want my life to be the greatest story. My very existence will be the greatest poem.Watch me burn.\"Reviews of Empty Roads & Broken Bottles; in search for The Great Perhaps:\"This book is a beautiful journey. Charlotte's words are like magic and you just can't stop reading. This book gave me answers to life that I didn't know I was looking for!\" - Hanna Olofsson This book was such an emotional and beautiful experience that really consumed my soul while reading it I felt like I was there in person with her on her amazing journey every step of the way, This book made me cry it made me smile and it made me realise facts about myself it is a truly emotional and inspiring reading experience. I would recommend this book to anyone who can appreciate the genius and brilliance of an artist or someone who wants to discover themsselves.\" - Mattias Bergstöm",
  "genres": [
    "Poetry",
    "Nonfiction",
    "Memoir",
    "Travel",
    "Spirituality",
    "Biography",
    "Autobiography"
  ],
  "author": "Charlotte Eriksson",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/17829704-empty-roads-broken-bottles"
}