{
  "title": "If This is a Woman: Inside Ravensbrück: Hitler's Concentration Camp for Women",
  "description": "A groundbreaking, masterful, and absorbing account of the last hidden atrocity of World War II — Ravensbrück — the largest female-only concentration camp, where more than 100,000 women consisting of more than twenty nationalities were imprisoned.Shortly before the outbreak of World War II, Heinrich Himmler, the head of the SS and the architect of the Holocaust, oversaw the construction of a special concentration camp just fifty miles north of Berlin. He called it Ravensbrück, and during the years that followed thousands of people died there after enduring brutal forms of torture. All were women.There are a handful of studies and memoirs that reference Ravensbrück, but until now no one has written a full account of this atrocity, perhaps due to the mostly masculine narrative of war, or perhaps because it lacks the Jewish context of most mainstream Holocaust history. Ninety percent of Ravensbrück's prisoners were not Jewish. Rather, they were political prisoners, Resistance fighters, lesbians, prostitutes, even the sister of New York's Mayor LaGuardia. In a perverse twist, most of the guards were women themselves.Sarah Helm's groundbreaking work sheds much-needed light on an aspect of World War II that has remained in the shadows for decades. Using research into German and newly opened Russian archives, as well as interviews with survivors, Helm has produced a landmark achievement that weaves together various accounts, allowing us to follow characters on both sides of the prisoner/guard divide. Chilling, compelling, and deeply unsettling, Ravensbrück is essential reading for anyone concerned with Nazi history.",
  "genres": [
    "History",
    "Nonfiction",
    "Holocaust",
    "World War II",
    "War",
    "Historical",
    "Germany"
  ],
  "author": "Sarah Helm",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/10838049-if-this-is-a-woman"
}