{
  "title": "Everdeen",
  "description": "Welcome to Everdeen, South Carolina. In Everdeen, the lemonade is homemade, the tea is sweet and there are more churches than gas stations. Most importantly, anything above the Mason Dixon is seen as backward or just plain wrong.Author NK Navarro brings a page turning romantic thriller filled with humor and unexpected twists sure to keep readers at the edge of their seats. In her tale, the lives of several women living in a quaint southern town are anything but typical. The women learn that they are all connected via secrets that can never be shared. Main Characters:Elizabeth Blanchard- PryleDaughter of Everdeen's richest family, Elizabeth did the despicable, married a Yankee and now can't seem to get pregnant. She's at her wits end trying to procreate with her unresponsive husband, David, and will stop at nothing to have a baby.Elaine Blanchard (mother of Elizabeth)Wife of billionaire entrepreneur and daughter of a senator, Elaine is 'the' southern belle and is known for her tyrannical behavior to get whatever she wants most. Will her money and mean spirit be enough to hide her children's latest mistakes?Susan Fairfield- BrownSusan loves all things Everdeen, except for the Blanchard family. Her marriage is a wreck but she's holding on to her husband for the sake of her son. Susan's life is put upside down when she discovers the truth behind her husband's constant disappearing act. At the risk of being disgraced, will she play nice with the Blanchard's to protect her son?Charlotte Fairfield (mother of Susan)Known as Everdeen's gossip, Charlotte lives a double life and fights tooth and nail to cover the 28 years of abuse she has endured from her husband, Michael. Will she finally take a stand and end her lie or will she choose to end her horrid existence?Each chapter is told from one of the four main characters’ point of view. Everdeen- Book I is the first of the Everdeen series.Category: Romantic Thriller",
  "genres": [],
  "author": "N.K. Navarro",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/17830298-everdeen"
}