{
  "title": "Membrane",
  "description": "\"Imagine, if you will, a novel that feels like a cross between The Hunger Games trilogy and the popular television series Fringe. Carol Moreira’s new novel for young adults, Membrane, struck me as being a cross between those two, but it’s not at all derivative.\" — Chronicle HeraldYou can’t outrun the membrane ...For Tanya turning sixteen sucks. Her former friend Rachel is bullying her, the love of her life doesn’t know she exists and her self-esteem isn’t exactly sky-high. Things go from bad to worse when she gets slimed at a bus stop and finds herself in an alternate universe and faced with another version of herself. Her alternate universe double is cool and confident, if a bit bossy. P — short for Princess because in Tanya’s eyes she is one — is part of an organization called Resist. Trained in tactical defense, Resist is preparing for an invasion by the Others. But are the Others really mobilizing to take over P’s universe or has there been some kind of galactic miscommunication?On the other side of the membrane, who can Tanya trust to make it back to her universe alive?RATED E - Everyone over ten: Content is suitable for everyone but may contain mild violence and language and minimal suggestive themes.Excerpt:I was flinging myself around the street when I felt a hand on my arm.\"What's wrong, dear?\" someone asked.I spun around and found myself looking at an elderly woman. At first I thought it was Mrs. Morris, the woman TOM called the seer, but it wasn't. This woman had silver hair neatly curling about her chin. She wore a pale blue pantsuit. I looked at her serene face and nearly told her my problem, but something stopped me. Something about her wasn't right -- she just looked too interested. I shook her hand off. \"Nothing,\" I said.\"Come with me.\" She put her hand out again and pulled my arm inside hers.\"Leave me alone!\" I jumped away, frantically looking around for someone to help me. Then I saw that every door on the street had a person standing in front of it. Woodfield Road -- normally so quiet -- was being blitzed by a crowd of people...I turned back to the woman. Looking at her, I realized why I was wary of her. Her eyes were too intense. Although they were as gray and cold as the Atlantic in winter, they were unnaturally bright. They reminded me of the white room where Pat was imprisoned.\"Let's have some fun, dear,\" she said. (Membrane, chapter 13)",
  "genres": [],
  "author": "Carol Moreira",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/17831704-membrane"
}