{
  "title": "Hearts Aflame Collection I",
  "description": "From the bottom of my heart and for the love of books, I'm offering this amazing bundle of books as a thank you for your support.- Hunter's HeartIn a world of vampire clans and expected alliances, Garrett is a loner. He hurts no one. He helps no one. But his very refusal to join a clan puts him in danger from the often vicious blood families. When a nearby clan sends a hunting party to convert or kill him, he encounters the deadly and beautiful Tahlia. The sparks immediately fly between the two vampires, leading to a final confrontation that could put them both at risk.- Falling for an Angel (Angel at Large, Book 1)Adrian is a messenger angel. He loves nothing better than zipping through the realms, dodging the enemies who try to keep him from doing his duty. He is fast and swift and as dedicated as they come. But he’s a fun loving individual. Even though he likes being an angel, he is lonely and can’t help wondering what it would be like to have someone that belongs to him, and that he belongs to. So when his best friend, the guardian angel Cassel falls in love with his mortal and he finds out that the only hope is for him to also find love, he embraces the challenge in his usual fun loving way. How hard can it be to find a mortal who will love him? He’s good looking, smart and can show her a good time. Unfortunately, he meets and is instantly attracted to Melissa, the only mortal woman in the world who is not impressed either by his good looks, his wit or his charm. To win her heart, he will have to reach deep into himself to discover what she really wants.- Christmas Choices (When Naughty Becomes so Nice, Book 1)When Andie Nichols breaks up with her controlling boyfriend Evan Harrington just before the big Christmas party, she dreads going and having to see him there. Still, she doesn’t want to give him the satisfaction of knowing that she didn’t go just to avoid him, so she takes up residence at the free bar, just hoping to avoid him That’s when she meets Ryan Miller and kisses him to show off to Evan. Ryan is shocked, but likes it. They leave the party together, and Ryan reveals a shocking secret of his own. He likes a woman who isn’t afraid to demand what she wants and offers to be her sex slave. The choice is all hers, but if she is willing to be a little naughty, he promises to make her feel oh so very nice.- It's Not Enough (The Clover Leaf Café, Book 1)Jeff Masterson is a cynical businessman. He has no time for love and no time for women except in the bedroom. Lisa Smith is vulnerable when her long term boyfriend dumps her for a man. She felt an instant attraction to Jeff but working in The Clover Leaf Café, she had heard of his reputation as a one night stand man and agrees to go off with Jeff but it will only be one night. What she does not count on though is the flood of feelings that night releases in her. She can’t seem to get Jeff out of her mind. She knows she is just another one night stand but the way Jeff keeps coming at her, she is beginning to think he might see her as more. But she’s not sure she is ready to trust again so soon.",
  "genres": [
    "Romance",
    "Paranormal",
    "Erotica",
    "Paranormal Romance",
    "Vampires",
    "Anthologies",
    "Fiction"
  ],
  "author": "Melissa F. Hart",
  "average_rating": "3.47",
  "url": "https://www.goodreads.com/book/show/17832518-hearts-aflame-collection-i"
}