{
  "title": "The Chocolate Temptation",
  "description": "Romantic Times acclaims Laura Florand's work as \"sensuous and sumptuous\", nominating her for Best Book of the Year, and NPR says it's \"explosive, sensual . . . and utterly sweet\". Now, in her sixth book in the internationally bestselling Amour et Chocolat series, Florand takes us into a top Paris restaurant’s pastry kitchen and into the hearts and irresistible temptations of its chefs in The Chocolate Temptation.She hated him.Patrick Chevalier. The charming, laid-back, golden second-in-command of the Paris pastry kitchen where Sarah worked as intern, who made everything she failed at seem so easy, and who could have every woman he winked at falling for him without even trying. She hated him, but she’d risked too much for this dream to give up on it and walk out just so he wouldn’t break her heart.But he didn’t hate her.Sarah Lin. Patrick’s serious, dark-haired American intern, who looked at him as if she could see right through him and wasn’t so impressed with what she saw. As her boss, he knew he should leave her alone. The same way he knew better than to risk his heart and gamble on love.But he was never good at not going after what – or who – he wanted.He could make magic out of sugar. But could he mold hate into love?Praise for Laura Florand and her novels“Sweet and sexy and all around delicious!!” – New York Times bestselling author Nalini Singh “I adored this story…Paris, chocolate, and romance, all in one hilarious package.” – New York Times bestselling author Eloisa James“It’s like when you find that amazing piece of chocolate — you take a bite, and it sits on your tongue and melts into a pool of liquid heaven.” – RT Book Reviews“Explosive, sensual . . . and utterly sweet.” – NPR“Gorgeously written, in that way that sort of creeps through my entire body and makes me shiver with delight.” – Dear Author",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Adult",
    "Chick Lit",
    "France",
    "Food"
  ],
  "author": "Laura Florand",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/17832864-the-chocolate-temptation"
}