{
  "title": "Grading on Curves",
  "description": "One-on-one instruction never felt so right—or so wrong.There's nothing unusual about Mia Page's attraction to the young science teacher at the middle school. After all, she's not the only one who finds him enticing. But when he pulls her son aside to ask for her phone number, she knows she's in serious trouble. Since her divorce four years earlier, she's been out of circulation, choosing to focus on parenting instead, and she's not entirely sure she can handle an entanglement with the sexy Mr. Walden.There are also other reasons why getting involved with Curt would be a bad idea. He's two years shy of thirty, and she's on the downside of that unmentionable number. He's adamant about never having kids, and she has a son. Even the guy's romantic gifts are suspect. Energy saving light bulbs? He has to be kidding.On the other hand, he's fun, sweet, and smart. He stimulates her intellectually, emotionally, and Lord help her, physically, opening her eyes to life outside her comfortable world. Yet their differences quietly gnaw at Mia even while she succumbs to their undeniable chemistry.As their romance deepens, so do Mia's fears that Curt will eventually hurt her. On edge, all it takes is an innocent comment to provoke her into drawing first blood. Mia recklessly wounds Curt, learning only too late that this blade cuts both ways. Frantic to make amends, she fears it might be too late to admit the feelings she's tried so hard to suppress.Content contains sensual sex\"Grading on Curves is a perfect beach read this summer. Not only is it sensual, but it's funny and sweet. If you're looking for a book with heat and heart and a couple that you are rooting for, then you NEED to check this book out.\" My Book Muse\"Good hero and good romantic chemistry brings this story together. Very sexy and well written love scenes.\" Romance Book Scene",
  "genres": [
    "Contemporary Romance",
    "Romance"
  ],
  "author": "Tara Mills",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/17834001-grading-on-curves"
}