{
  "title": "Patti LuPone: A Memoir",
  "description": "The legendary Patti LuPone is one of the theatre’s most beloved leading ladies. Now she lays it all bare, sharing the intimate story of her life both onstage and off--through the dizzying highs and darkest lows--with the humor and outspokenness that have become her trademarks.With nearly 100 photographs, including an 8-page four-color insert, and illuminating details about the life of a working actor, from inspired costars and demanding directors to her distinct perspective on how she developed and honed her Tony Award–winning performances, Patti A Memoir is as inspirational as it is entertaining. And though the title might say “a memoir,” this is ultimately a love letter to the theatre by a unique American artist.Raised on Long Island’s North Shore, Patti discovered her calling at the age of four and knew that she was destined for the stage. A prodigiously gifted child, she was one of only 36 young actors chosen for the inaugural class of The Juilliard School’s Drama Division, where she fought near-constant criticism from her instructors, and here describes those early years with disarming frankness.From the heady days of her early twenties—crisscrossing the country as a founding member of the classical repertory theatre ensemble, The Acting Company--to her early success on Broadway, her four-year stint as Libby Thacher on the television series Life Goes On, her loving marriage to Matt Johnston, and much, much more, Patti chronicles her professional and personal life with inimitable candor and wit. With its insightful retrospective of her career-defining turns, both on Broadway and abroad, in Evita , Les Misérables , Anything Goes, Sunset Boulevard , Sweeney Todd , and Gypsy , Patti A Memoir reveals the artist’s deeply felt passion for music and the theatre and is, in the end, the compelling and quintessential tale of an exceptional life well lived. “I have been incredibly fortunate over the course of my career to have been associated with some extraordinary dramatic and musical productions, and also some rather spectacular disasters. Looking back, I can find gifts and life lessons in every one.”",
  "genres": [
    "Memoir",
    "Biography",
    "Nonfiction",
    "Theatre",
    "Audiobook",
    "Autobiography",
    "Biography Memoir"
  ],
  "author": "Patti LuPone",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/10839082-patti-lupone"
}