{
  "title": "The Kentuckians",
  "description": "The Kentuckians of Janice Holt Giles's title were that hardy band of angels who straggled through Cumberland Gap in the 1770s and carved their farms from the wilderness of Virginia's westernmost country. In her historical novel, first published in 1953, Giles invited the reader to experience the danger and beauty of life on the American frontier.Many of the frontiersmen were hunter in search of escape from an ever advancing civilization, seeking freedom and space. Such a man was David Cooper, who had hunted the Kentucky wilderness with Daniel Boone before the first settlers crossed the Appalachians. No love of land or home or woman had been strong enough to hold David -- until he met Bethia. It was for her that he cleared his patch of forest, planted crops, and built a cabin. Too late, he learned that the girl he had dreamed of marrying was the wife of his enemy. David and Bethia belonged to a generation that never knew or expected security, and the background of their story is one of outnumbered and ill-equipped, were hard put to defend their forts. And, although united in war against the British and their Indian allies, the settlers were at odds among themselves. Many, including Boone, held land grants from Judge Henderson's Transylvania Company. Others, like David, based their claims on the authority of Virginia. Few today realize how close Henderson came to winning out.In her research, Giles studied the journals of the early Kentuckians and has retold their story in their own easy-flowing, cadenced prose. Only the three central characters are fictional. All subsidiary characters and historical events are authentic, set against the background of a country the author knows and loves.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "18th Century",
    "Novels",
    "Classics",
    "Southern"
  ],
  "author": "Janice Holt Giles",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/1083909.The_Kentuckians"
}