{
  "title": "The Three Kitties That Saved My Life",
  "description": "A true romance memoir. \"This is like drinking tea and honey on a cold day.\" When tragedy struck, I thought for sure that my own life was at an end. I was wrong. This is the true story of how two stray rescue cats and a woman named Kitty, whom I finally met after a wild ride of internet dating, brought love, romance, and laughter back into my life.Love was then. Love is now. Love is forever. WINNER of the 2018 Stephen Memorial Award FINALIST for the 2014 RONE AWARD If you love reading feel-good memoirs, then don't miss THE THREE KITTIES THAT SAVED MY LIFE, where \"Mike Meyer pens a tender tale of love, loss, and renewal. The depth of emotion is palpable...The Three Kitties will tug at readers' heartstrings, as they ride through the emotional highs and lows of Mike Meyer's remarkable story.\" - InD'tale MagazineEXCERPTIt is amazing how time helps. In time, I have learned to overcome my own albatross. I have learned to live again, to love again. Life is a gift reads a plaque on our dining room wall, and that sums up what I have gained from the three kitties that saved my life. From Coco, I learned to care again. From Kitty, I learned to love again. From Pom Pom, I have learned how to cope with my own demons, the effects of aging being one of these. Pom Pom has taught me to accept what is and then to move onward. Yes, I have learned plenty from my three kitties.My journey has been a long one, a difficult one at times, but it has a happy ending. The three kitties in my life have made it so. They have all helped me to become the happy-to-be-alive man that I am today. I now accept rather than cope. I live each day to the fullest, knowing full well that life is a gift, and a very precious one at that. I look back on my life and I often think that I must be the luckiest man in the world. I have so much to be thankful for. The wonderment and beauty of life are both so dear to me.And, to add a delicious icing to the lovely taste of my life, I can say with total honesty to the whole world, my voice booming into the sky, my dancing feet not caring in the least who might see me, that I have been very fortunate to have done something that brings more sheer delight and wonderful pride to me than anything else that I have accomplished in my life: I have fallen madly, head-over-heels in love not once, but twice, and how many others can say that?Thank you, Kitty! AWARDSWINNER 2018 Stephen Memorial AwardFINALIST 2014 RONE Award, Inspirational Book #1 Amazon best seller in Love & Romance, Pet Cats, and Educator Biographies",
  "genres": [
    "Animals",
    "Memoir",
    "Nonfiction",
    "Biography",
    "Biography Memoir",
    "True Story",
    "Cats"
  ],
  "author": "Mike  Meyer",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/17836237-the-three-kitties-that-saved-my-life"
}