{
  "title": "The Library: A World History",
  "description": "A library is not just a collection of books, but also the buildings that house them. As varied and inventive as the volumes they hold, such buildings can be much more than the dusty, dark wooden shelves found in mystery stories or the catacombs of stacks in the basements of academia. From the great dome of the Library of Congress, to the white façade of the Seinäjoki Library in Finland, to the ancient ruins of the library of Pergamum in modern Turkey, the architecture of a library is a symbol of its time as well as of its builders’ wealth, culture, and learning. Architectural historian James Campbell and photographer Will Pryce traveled the globe together, visiting and documenting over eighty libraries that exemplify the many different approaches to thinking about and designing libraries. The result of their travels, The Library: A World History is one of the first books to tell the story of library architecture around the world and through time in a single volume, from ancient Mesopotamia to modern China and from the beginnings of writing to the present day. As these beautiful and striking photos reveal, each age and culture has reinvented the library, molding it to reflect their priorities and preoccupations—and in turn mirroring the history of civilization itself. Campbell’s authoritative yet readable text recounts the history of these libraries, while Pryce’s stunning photographs vividly capture each building’s structure and atmosphere. Together, Campbell and Pryce have produced a landmark book—the definitive photographic history of the library and one that will be essential for the home libraries of book lovers and architecture devotees alike.",
  "genres": [
    "History",
    "Nonfiction",
    "Books About Books",
    "Art",
    "Architecture",
    "Photography",
    "World History"
  ],
  "author": "James W.P. Campbell",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/17836013-the-library"
}