{
  "title": "Mastering the Art of Quitting: Why It Matters in Life, Love, and Work",
  "description": "Find out why the happiest, most successful people have the ability both to persist and to quit. In a culture that perceives quitting as a last resort and urges us to hang in, Mastering the Art of Quitting tackles our tendencies to overanalyze, ruminate, and put a positive spin on goals that have outlived their usefulness. Bestselling author Peg Streep and psychotherapist Alan Bernstein demonstrate that persistence alone isn't always the answer. We also need to be able to quit to get the most out of life. They reveal simple truths that apply to goal setting and achievement in all areas of life, including love, relationships, and work:Quitting promotes growth and learning, as well as the ability to frame new goals. Without the ability to give up, most people will end up in a discouraging loop. The most satisfied people know when it's time to stop persisting and start quitting. Quitting is a healthy, adaptive response when a goal can't be reached.  Featuring compelling stories of people who successfully quit, along with helpful questionnaires and goal maps to guide you on the right path, Mastering the Art of Quitting allows you to evaluate whether your goals are working for or against you, and whether you need to rechart certain aspects of your life.When is it time to stop persisting and start quitting? Take a moment and answer the following questions. Just thinking about the answers will give you insight into your ability to quit artfully and restart your life.Do you believe that \"winners never quit and quitters never win\"? How realistic are you when it comes to setting goals? What matters more: staying the course or exploring new possibilities in life? How much of your sense of self relies on other people's judgments? Do you tend to hang in longer than you should, even when you're unhappy? When you try something new, do you focus on the effort you have to put in or the possibility of failure? Are you a procrastinator or a delayer when it comes to getting things done? How much do you worry about making a mistake? Do you second-guess yourself? How hard is it for you to get over a setback?",
  "genres": [
    "Nonfiction",
    "Self Help",
    "Psychology",
    "Personal Development",
    "Productivity",
    "Audiobook",
    "Business"
  ],
  "author": "Peg Streep",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/17836502-mastering-the-art-of-quitting"
}