{
  "title": "Written in My Own Heart's Blood",
  "description": "#1 NEW YORK TIMES BESTSELLER • NAMED ONE OF THE BEST BOOKS OF THE YEAR BY BOOKLISTIn her now classic novel Outlander, Diana Gabaldon told the story of Claire Randall, an English ex-combat nurse who walks through a stone circle in the Scottish Highlands in 1946, and disappears . . . into 1743. The story unfolded from there in seven bestselling novels, and CNN has called it “a grand adventure written on a canvas that probes the heart, weighs the soul and measures the human spirit across [centuries].” Now the story continues in Written in My Own Heart’s Blood. 1778: France declares war on Great Britain, the British army leaves Philadelphia, and George Washington’s troops leave Valley Forge in pursuit. At this moment, Jamie Fraser returns from a presumed watery grave to discover that his best friend has married his wife, his illegitimate son has discovered (to his horror) who his father really is, and his beloved nephew, Ian, wants to marry a Quaker. Meanwhile, Jamie’s wife, Claire, and his sister, Jenny, are busy picking up the pieces. The Frasers can only be thankful that their daughter Brianna and her family are safe in twentieth-century Scotland. Or not. In fact, Brianna is searching for her own son, who was kidnapped by a man determined to learn her family’s secrets. Her husband, Roger, has ventured into the past in search of the missing boy . . . never suspecting that the object of his quest has not left the present. Now, with Roger out of the way, the kidnapper can focus on his true target: Brianna herself. Written in My Own Heart’s Blood is the brilliant next chapter in a masterpiece of the imagination unlike any other.",
  "genres": [
    "Historical Fiction",
    "Romance",
    "Fiction",
    "Fantasy",
    "Time Travel",
    "Historical",
    "Historical Romance"
  ],
  "author": "Diana Gabaldon",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/17838167-written-in-my-own-heart-s-blood"
}