{
  "title": "Birching His Bride",
  "description": "Edwin Villiers, Lord Hyde and only child of the Earl of Clarendon, didn't realize that women were also sometimes disciplined with the birch until the day he was invited by his friend Hugh Stanley, Viscount Petersham and son of the Earl of Harrington, to witness the disciplining of Hugh's sister Eleanor. While he'd known Eleanor as a young girl, she had grown up to a beautiful but spoiled young woman who, even at the age of 18, wasn't quite ready to make her debut. After being overly indulged by her mother for years her father Lord Harrington has realized that he must take her in hand or risk her ruining the family's reputation with her willful ways once she's out in Society.While watching the young lady receive a bare bottom birching, Edwin finds himself having a reaction he'd never expected - a shocking arousal that awakens a new array of sensual desires in him. When Eleanor appears in Society a year later, having learned to pretend to the demure manners her father demands, Edwin starts to think about leaving his bachelor days behind and securing Eleanor as his wife. He knows that a sweet and generous person lurks beneath the spoiled manner she's adopted in recent years, and he's not at all adverse to administering the necessary punishments to bring back the Eleanor he once knew. When Eleanor enters the marriage mart she already knows exactly what she's looking for: someone who will love her more than she loves him. After watching her parents' marriage she's seen the power her father wields over her mother, who is worshipfully in love with him. Eleanor wants the jewels, the silks, the dresses, and she absolutely does not want to lose her heart. The man she's looking for is kind, indulgent and will never threaten her emotional happiness. He's certainly nothing like her brother's rather rakish and dangerously handsome friend Lord Hyde, even if the man does make her feel strange yearnings that she's never experienced before.Unfortunately her father has little trust in his daughter's supposed reformation, especially after her behavior at her come-out ball when he sees the men she's chosen to attract - and her tactics for doing so. Sure that Eleanor is on the way towards ruining her reputation as well as the family's, her father marries her off to the overbearing and far-to-attractive Lord Hyde within the first week of her Season. Never at a loss for long, Eleanor soon comes up with a plan that will make her a constant thorn in her husband's side until he's all too happy to allow her to live separately from him and manage her own life. Unfortunately for her, Edwin is just as determined to see his spoiled bride tamed and she finds his methods of discipline as disturbingly arousing as they are painful. This book is contains graphic depictions of hot sex, consensual and non-consensual spankings and birchings, and Victorian domestic discipline. If any of these things are offensive to you it is suggested that you do not download this book.",
  "genres": [
    "Historical Romance",
    "Historical",
    "Erotica",
    "Romance",
    "BDSM",
    "Historical Fiction",
    "Adult"
  ],
  "author": "Golden Angel",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/17839005-birching-his-bride"
}