{
  "title": "Familiar of the Witch",
  "description": "I may be down – but I’m not out.\nWhen I’m arrested for killing a member of the Coven Council, I’m pretty sure we’ll get things straightened out quickly – after all, my victim was a black witch and she was trying to kill me too. Like most things in my competitive life, I just got there first.Separated from my alluring bodyguard Bastion, I order him not to rescue me by any means necessary. My griffin protector will happily leave a trail of bodies behind him if it means securing my freedom, but we have to play this smart because the Coven Council might not be pulling the strings. If I'm right and the Black Coven is manipulating events, including trying to orchestrate our doom, I must stop them no matter the cost.I need to clear my name and free myself, then I need to face facts. My mum keeps telling me there’s a prophecy with my name on it… I’m done burying my head in the sand. It’s time to visit the seers and see what they have to say about my future.Here’s hoping I stay alive long enough to have one.Don't miss this witchy series if you like humour, heart and a strong heroine with a slow burn, enemies to lovers, fade-to-black romance.Written in British English.Binge read all the books in the Other Realm (Listed in optimal reading order)!The Glimmer Series - a Jinx Sharp adventureGlimmer of the OtherGlimmer of DragonsGlimmer of HopeGlimmer of ChristmasGlimmer of DeathGlimmer of DeceptionThe Other Wolf Series - a Lucy Barrett caperProtection of the PackGuardians of the PackSaviour of the PackThe Court Series - A Jinx Sharp taleChallenge of the CourtBetrayal of the CourtRevival of the CourtThe Other Witch - An Amber DeLea grimoireRune of the WitchHex of the WitchCoven of the WitchFamiliar of the WitchDestiny of the Witch",
  "genres": [
    "Urban Fantasy",
    "Fantasy",
    "Paranormal",
    "Romance",
    "Magic",
    "Witches",
    "Vampires"
  ],
  "author": "Heather G. Harris",
  "average_rating": "4.55",
  "url": "https://www.goodreads.com/book/show/178391894-familiar-of-the-witch"
}