{
  "title": "Finding Love's Wings",
  "description": "\"Journey to an island paradise and fall in love. This story will make you yearn for the power of love, the sting of passion, and the addiction of desire!\" - Faerie Tale Books 5 of 5 Stars CAMERON ENDERS seems to have it all: a brand new condo in a city she loves, a top executive position at an international entertainment firm, an insane amount of money, and a gorgeous boyfriend. But when Cami catches the boyfriend in the act with another woman, it triggers all the anguish from years of neglect by her parents, and she realizes she never learned how to love or be loved. Cami flees to the remote tropical island of Tarah, but she can't avoid facing her problems any longer when she meets the man of her fantasies... TRISTAN MICHAELS, one of Hollywood's hottest new stars, has come to Tarah to ride out a storm. His girlfriend of five years has been caught on camera cheating, and she's determined to make Tristan stop the story from breaking. But Tristan's done cleaning up her messes. He needs to escape all things Hollywood for a while--and especially the firm that represents him--until the whole thing blows over. What he doesn't count on is meeting an irresistibly beautiful woman, a woman who just so happens to be the CEO of the firm he's trying to avoid. Can Tristan and Cami help each other learn to trust and love again, or will their histories of betrayal tear them apart? This story contains Tattoos, Piercings, a Hot Movie Star and a Sexy Heroine. No rich guy poor girl story here, just a story of what it's like to learn to love. ******Content Warning****** This book contains adult situations and strong sexual content and is not recommended for anyone under the age of 18.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "New Adult",
    "Contemporary",
    "Erotica",
    "Adult",
    "Chick Lit"
  ],
  "author": "Zoey Derrick",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/17840123-finding-love-s-wings"
}