{
  "title": "Wounded by God's People: Discovering How God's Love Heals Our Hearts",
  "description": "Tucked into Abraham's biography is the story of Hagar, a young Egyptian slave with whom Abraham had a son named Ishmael. Hagar stood out because she was wounded--not physically, but in ways that were as emotionally and spiritually painful as any injury to a body would be. Some wounds were provoked by her own bad behavior, but others were inflicted by those who considered themselves God's people. Anne Graham Lotz too has been wounded by God's people. Some wounds have been deeper than others, some have come out of nowhere, and still others have been provoked by her own behavior, but all of the wounds have been deeply painful. They seemed to hurt even more when the wounders wrapped their behavior in a semblance of religion or piety. As Hagar's story unfolds, you will discover that wounded people often become wounders themselves. While Anne identifies with the wounded, the unpleasant reality is that she also identifies with the wounders, because she has been one, too. She knows from experience that wounding is a cycle that needs to be broken. And by God's grace, it can be. Many have had similar experiences. And perhaps you are among those who have been so deeply hurt that you have confused God's imperfect people with God. Maybe you have even run away from God as a result. Or perhaps you have been a wounder to the extent that you are living in a self-imposed exile, believing you are unworthy to be restored to a warm, loving relationship with God or with God's people. Whatever your hurts may be, Wounded by God's People helps you to begin a healing journey--one that enables you to reclaim the joy of God's presence and all the blessings God has for you. God loves the wounded. And the wounders.",
  "genres": [
    "Christian",
    "Nonfiction",
    "Christian Living",
    "Spirituality",
    "Religion",
    "Christian Non Fiction",
    "Relationships"
  ],
  "author": "Anne Graham Lotz",
  "average_rating": "4.26",
  "url": "https://www.goodreads.com/book/show/17841888-wounded-by-god-s-people"
}