{
  "title": "Love & Treasure",
  "description": "A spellbinding new novel of contraband masterpieces, tragic love, and the unexpected legacies of forgotten crimes, Ayelet Waldman’s Love and Treasure weaves a tale around the fascinating, true history of the Hungarian Gold Train in the Second World War.In 1945 on the outskirts of Salzburg, victorious American soldiers capture a train filled with unspeakable riches: piles of fine gold watches; mountains of fur coats; crates filled with wedding rings, silver picture frames, family heirlooms, and Shabbat candlesticks passed down through generations. Jack Wiseman, a tough, smart New York Jew, is the lieutenant charged with guarding this treasure—a responsibility that grows more complicated when he meets Ilona, a fierce, beautiful Hungarian who has lost everything in the ravages of the Holocaust. Seventy years later, amid the shadowy world of art dealers who profit off the sins of previous generations, Jack gives a necklace to his granddaughter, Natalie Stein, and charges her with searching for an unknown woman—a woman whose portrait and fate come to haunt Natalie, a woman whose secret may help Natalie to understand the guilt her grandfather will take to his grave and to find a way out of the mess she has made of her own life.A story of brilliantly drawn characters—a suave and shady art historian, a delusive and infatuated Freudian, a family of singing circus dwarfs fallen into the clutches of Josef Mengele, and desperate lovers facing choices that will tear them apart—Love and Treasure is Ayelet Waldman’s finest novel to date: a sad, funny, richly detailed work that poses hard questions about the value of precious things in a time when life itself has no value, and about the slenderest of chains that can bind us to the griefs and passions of the past.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Holocaust",
    "World War II",
    "Book Club",
    "Historical",
    "Jewish"
  ],
  "author": "Ayelet Waldman",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/17842038-love-treasure"
}