{
  "title": "The Sense of Touch",
  "description": "Named to Kirkus Reviews Best Books of 2014Sprung from the variously lush, rugged, and frozen emotional landscapes of the north country, this luminous collection of stories captures the progress of a diverse ensemble of souls as they struggle to uncover themselves and negotiate a meaningful communion, of any kind, with the world around them. A brilliant but troubled Bangladeshi physics student searches for balance, acceptance, and his own extraordinary destiny after his father disappears. When a Halloween blizzard immobilizes Minneapolis, a young woman is forced to confront the snow-bound nature of her own relationships and emotions. During an excursion to an idyllic swimming hole hidden in the Black Hills, two old friends unexpectedly compete for the affections of an irresistible, though married, Lakota woman. Like a mythical expedition to reach the horizon or the quest to distill truth from the beauty around us, the revelation confirmed by these imaginative stories - elegant, sometimes jarring, always wonderfully absurd - is that the very act of reaching is itself a form of touch.“The quiet plains of the North Country serve as a perfect backdrop for Parsons’ moving debut, a collection of short stories whose characters often live deeply solitary, if not always lonely, lives.”-- Kirkus Reviews (starred review)“Eloquently written and replete with a continual stream of un-hackneyed twists and turns, Parsons’ collection is superbly crafted. Engaging, riveting, and at times, mind-boggling, The Sense of Touch is earmarked to become a literary classic.”-- San Francisco Book Review (five-star review)\"Parsons has made himself a man to watch in the literary world. Each of these stories is as thrilling as the next.\" -- Portland Book Review (five-star review)\"Each story is honed with purpose and infused with subtle energies. He creates delicate lines between the frigid cosmos and the warmth that can be generated among people. Parsons' writing has a strong pulse. This debut assortment heralds his promising career.\" -- The US Review of Books (Top-Rated Recommended Review)",
  "genres": [
    "Short Stories",
    "Fiction",
    "Literary Fiction",
    "Contemporary",
    "Novels"
  ],
  "author": "Ron  Parsons",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/17843465-the-sense-of-touch"
}