{
  "title": "The Conviction of Richard Nixon: The Untold Story of the Frost/Nixon Interviews",
  "description": "The Watergate scandal began with a break-in at the office of the Democratic National Committee at the Watergate Hotel on June 17, 1971, and ended when President Gerald Ford granted Richard M. Nixon a pardon on September 8, 1974, one month after Nixon resigned from office in disgrace. Effectively removed from the reach of prosecutors, Nixon returned to California, uncontrite and unconvicted, convinced that time would exonerate him of any wrongdoing and certain that history would remember his great accomplishments—the opening of China and the winding down of the Vietnam War—and forget his “mistake,” the “pipsqueak thing” called Watergate.In 1977, three years after his resignation, Nixon agreed to a series of interviews with television personality David Frost. Conducted over twelve days, they resulted in twenty-eight hours of taped material, which were aired on prime-time television and watched by more than 50 million people worldwide. Nixon, a skilled lawyer by training, was paid $1 million for the interviews, confident that this exposure would launch him back into public life. Instead, they sealed his fate as a political pariah.James Reston, Jr., was David Frost’s Watergate advisor for the interiews, and The Conviction of Richard Nixon is his intimate, behind-the-scenes account of his involvement. Originally written in 1977 and published now for the first time, this book helped inspire Peter Morgan’s hit play Frost/Nixon. Reston doggedly researched the voluminous Watergate record and worked closely with Frost to develop the interrogation strategy. Even at the time, Reston recognized the historical importance of the Frost/Nixon interviews; they would result either in Nixon’s de facto conviction and vindication for the American people, or in his exoneration and public rehabilitation in the hands of a lightweight. Focused, driven, and committed to exposing the truth, Reston worked tirelessly to arm Frost with the information he needed to force Nixon to admit his culpability.In The Conviction of Richard Nixon , Reston provides a fascinating, fly-on-the-wall account of his involvement in the Nixon interviews as David Frost’s Watergate adviser. Written in 1977 immediately following these celebrated television interviews and published now for the first time, The Conviction of Richard Nixon explains how a British journalist of waning consequence drove the famously wily and formidable Richard Nixon to say, in an apparent personal epiphany, “I have impeached myself.”",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "Journalism",
    "Presidents",
    "Audiobook",
    "American History"
  ],
  "author": "James Reston Jr.",
  "average_rating": "3.35",
  "url": "https://www.goodreads.com/book/show/178451.The_Conviction_of_Richard_Nixon"
}