{
  "title": "The House of Mirth",
  "description": "The House of Mirth, by Edith Wharton, is part of the Barnes & Noble Classics series, which offers quality editions at affordable prices to the student and the general reader, including new scholarship, thoughtful design, and pages of carefully crafted extras. Here are some of the remarkable features of Barnes & Noble Classics:--New introductions commissioned from today's top writers and scholars--Biographies of the authors--Chronologies of contemporary historical, biographical, and cultural events--Footnotes and endnotes--Selective discussions of imitations, parodies, poems, books, plays, paintings, operas, statuary, and films inspired by the work--Comments by other famous authors--Study questions to challenge the reader's viewpoints and expectations--Bibliographies for further reading--Indices & Glossaries, when appropriateAll editions are beautifully designed and are printed to superior specifications; some include illustrations of historical interest. Barnes & Noble Classics pulls together a constellation of influences—biographical, historical, and literary—to enrich each reader's understanding of these enduring works. Edith Wharton’s dark view of society, the somber economics of marriage, and the powerlessness of the unwedded woman in the 1870s emerge dramatically in the tragic novel The House of Mirth. Faced with an array of wealthy suitors, New York socialite Lily Bart falls in love with lawyer Lawrence Selden, whose lack of money spoils their chances for happiness together. Dubious business deals and accusations of liaisons with a married man diminish Lily’s social status, and as she makes one bad choice after another, she learns how venal and brutally unforgiving the upper crust of New York can be. One of America’s finest novels of manners, The House of Mirth is a beautifully written and ultimately tragic account of the human capacity for cruelty.Jeffrey Meyers, a Fellow of the Royal Society of Literature, has published forty-three books, including biographies of Ernest Hemingway, Edmund Wilson, Robert Frost, D. H. Lawrence, Joseph Conrad, and George Orwell.",
  "genres": [
    "Fiction",
    "Classics",
    "Historical Fiction",
    "Literature",
    "Book Club",
    "Novels",
    "American"
  ],
  "author": "Edith Wharton",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/17846.The_House_of_Mirth"
}