{
  "title": "The Love Object: Selected Stories of Edna O'Brien",
  "description": "COLLECTED HERE FOR THE FIRST TIME ARE STORIES SPANNING FIVE DECADES OF WRITING BY THE \"SHORT STORY MASTER\" (HAROLD BLOOM).As John Banville writes in his introduction to 'The Love Object', Edna O'Brien \"is, simply, one of the finest writers of our time.\" The 31 stories collected in this volume provide, among other things, a cumulative portrait of Ireland, seen from within and without.Coming of age, the impact of class, and familial and romantic love are the prevalent motifs, along with the instinct toward escape and subsequent nostalgia for home. Some of the stories are linked, and some carry O'Brien's distinct sense of the comical. In \"A Rose in the Heart of New York\", the single-mindedness of love dramatically derails the relationship between a girl and her mother while in \"Sister Imelda\" and \"The Creature\", the strong ties between teacher and student and mother and son are ultimately broken. \"The Love Object\" recounts a passionate affair between the narrator and her older lover.The magnificent, mid-career story \"Lantern Slides\" portrays a Dublin dinner party that takes on the lives and loves of all the guests. More recent stories include \"Shovel Kings - \"a masterpiece of compression, distilling the pain of a lost, exiled generation\" (Sunday Times) - and \"Old Wounds\", which follows the revival and demise of the friendship between two elderly cousins.In 2011 Edna O'Brien's gifts were acknowledged with the most prestigious international award for the story, and was presented with the Frank O'Connor Short Story Award. 'The Love Object' illustrates a career's worth of shimmering, potent prose from a writer of great courage, vision, and heart.\"The most striking aspect of Edna O'Brien's short stories, aside from the consistent mastery with which they are executed, is their diversity\" (John Banville).©2015 Edna O'Brien (P)2013 Hachette Audio",
  "genres": [
    "Short Stories",
    "Fiction",
    "Ireland",
    "Irish Literature",
    "Classics",
    "Audiobook",
    "Anthologies"
  ],
  "author": "Edna O'Brien",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/17846864-the-love-object"
}