{
  "title": "Dog Whistle Politics: How Coded Racial Appeals Have Reinvented Racism and Wrecked the Middle Class",
  "description": "Campaigning for president in 1980, Ronald Reagan told stories of Cadillac-driving \"welfare queens\" and \"strapping young bucks\" buying T-bone steaks with food stamps. In trumpeting these tales of welfare run amok, Reagan never needed to mention race, because he was blowing a dog whistle: sending a message about racial minorities inaudible on one level, but clearly heard on another. In doing so, he tapped into a long political tradition that started with George Wallace and Richard Nixon, and is more relevant than ever in the age of the Tea Party and the first black president. In Dog Whistle Politics, Ian Haney Lopez offers a sweeping account of how politicians and plutocrats deploy veiled racial appeals to persuade white voters to support policies that favor the extremely rich yet threaten their own interests. Dog whistle appeals generate middle-class enthusiasm for political candidates who promise to crack down on crime, curb undocumented immigration, and protect the heartland against Islamic infiltration, but ultimately vote to slash taxes for the rich, give corporations regulatory control over industry and financial markets, and aggressively curtail social services. White voters, convinced by powerful interests that minorities are their true enemies, fail to see the connection between the political agendas they support and the surging wealth inequality that takes an increasing toll on their lives. The tactic continues at full force, with the Republican Party using racial provocations to drum up enthusiasm for weakening unions and public pensions, defunding public schools, and opposing health care reform. Rejecting any simple story of malevolent and obvious racism, Haney Lopez links as never before the two central themes that dominate American politics today: the decline of the middle class and the Republican Party's increasing reliance on white voters. Dog Whistle Politics will generate a lively and much-needed debate about how racial politics has destabilized the American middle class — white and nonwhite members alike.",
  "genres": [
    "Politics",
    "Nonfiction",
    "Race",
    "History",
    "Social Justice",
    "Sociology",
    "Anti Racist"
  ],
  "author": "Ian F. Haney-López",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/17847530-dog-whistle-politics"
}