{
  "title": "Out of the Mountains: The Coming Age of the Urban Guerrilla",
  "description": "When Americans think of modern warfare, what comes to mind is the US army skirmishing with terrorists and insurgents in the mountains of Afghanistan. But the face of global conflict is ever-changing. In Out of the Mountains , David Kilcullen, one of the world's leading experts on current and future conflict, offers a groundbreaking look at what may happen after today's wars end. This is a book about future conflicts and future cities, and about the challenges and opportunities that four powerful megatrends--population, urbanization, coastal settlement, and connectedness--are creating across the planet. And it is about what cities, communities and businesses can do to prepare for a future in which all aspects of human society--including, but not limited to, conflict, crime and violence--are changing at an unprecedented pace.Kilcullen argues that conflict is increasingly likely to occur in sprawling coastal cities, in peri-urban slum settlements that are enveloping many regions of the Middle East, Africa, Latin America and Asia, and in highly connected, electronically networked settings. He suggests that cities, rather than countries, are the critical unit of analysis for future conflict and that resiliency, not stability, will be the key objective. Ranging across the globe--from Kingston to Mogadishu to Lagos to Benghazi to Mumbai--he offers a unified theory of \"competitive control\" that explains how non-state armed groups such as drug cartels, street gangs, and warlords draw their strength from local populations, providing useful ideas for dealing with these groups and with diffuse social conflicts in general. His extensive fieldwork on the ground in a series of urban conflicts suggests that there will be no military solution for many of the struggles we will face in the future. We will need to involvelocal people deeply to address problems that neither outsiders nor locals alone can solve, drawing on the insight only locals can bring, together with outsider knowledge from fields like urban planning, systems engineering, renewable energy, conflict resolution and mediation.This deeply researched and compellingly argued book provides an invaluable roadmap to a future that will increasingly be crowded, urban, coastal, connected--and dangerous.",
  "genres": [
    "Military Fiction",
    "Nonfiction",
    "War",
    "History",
    "Politics",
    "Military History",
    "Geography"
  ],
  "author": "David Kilcullen",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/17847504-out-of-the-mountains"
}