{
  "title": "Apostles of Reason: The Crisis of Authority in American Evangelicalism",
  "description": "Evangelical Christianity is a paradox. Evangelicals are radically individualist, but devoted to community and family. They believe in the transformative power of a personal relationship with God, but are wary of religious enthusiasm. They are deeply skeptical of secular reason, but eager to find scientific proof that the Bible is true.In this groundbreaking history of modern American evangelicalism, Molly Worthen argues that these contradictions are the products of a crisis of authority that lies at the heart of the faith. Evangelicals have never had a single authority to guide them through these dilemmas or settle the troublesome question of what the Bible actually means. Worthen chronicles the ideological warfare, institutional conflict, and clashes between modern gurus and maverick disciples that lurk behind the more familiar narrative of the rise of the Christian Right. The result is an ambitious intellectual history that weaves together stories from all corners of the evangelical world to explain the ideas and personalities-the scholarly ambitions and anti-intellectual impulses-that have made evangelicalism a cultural and political force.In Apostles of Reason, Worthen recasts American evangelicalism as a movement defined not by shared doctrines or politics, but by the problem of reconciling head knowledge and heart religion in an increasingly secular America. She shows that understanding the rise of the Christian Right in purely political terms, as most scholars have done, misses the heart of the story. The culture wars of the late twentieth century emerged not only from the struggle between religious conservatives and secular liberals, but also from the civil war within evangelicalism itself-a battle over how to uphold the commands of both faith and reason, and how ultimately to lead the nation back onto the path of righteousness.",
  "genres": [
    "History",
    "Religion",
    "Nonfiction",
    "Christianity",
    "Church History",
    "Theology",
    "American History"
  ],
  "author": "Molly Worthen",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/17847517-apostles-of-reason"
}