{
  "title": "Change: What Really Leads to Lasting Personal Transformation",
  "description": "Change is often a mystery, one that baffles doctors, therapists, teachers, coaches, parents--and especially those of us who struggle to alter our own bad habits or make lasting improvements in our lives. Why do we suddenly change for the better after years of failed efforts? Why do some of us never escape our self-destructive behaviors, even when we desperately want to? What is it that most reliably and effectively produces growth, learning, and development that persist over time?In this vividly written volume, psychotherapist Jeffrey Kottler weaves together inspiring stories and the latest research, taking the reader on a fascinating exploration of human behavior while highlighting what does--and does not--lead to lasting change. Kottler illuminates our many efforts to change--to stop taking drugs, reduce dependencies, leave a destructive relationship, find new and more meaningful work, or adjust to a devastating accident or trauma. Readers are invited to explore key triggers such as hitting bottom, moments of clarity, the power of altruism and service, travel to new surroundings, reading or listening to stories, religious conversion, and much more. Kottler also explores why most changes don't last and what we can do to prevent relapses.Throughout the book, Kottler recounts stories of colleagues and patients--and even recalls episodes from his own life-often moving tales of remarkable, unexpected, and lasting transformation. He looks, for instance, at a young black basketball star, confined to a wheelchair for life after being shot four times, who turned his life around, becoming a scholar and a PhD.An intriguing glimpse into the complexity of the human psyche, Change will engage anyone who has ever struggled to alter a habit, enrich relationships, recover from disappointment or failure, strive for more meaningful and productive work, deal with anxiety, loneliness, fears, stress, and depression, or transform their lives in any kind of significant way.",
  "genres": [
    "Psychology",
    "Self Help",
    "Personal Development",
    "Nonfiction",
    "Mental Health"
  ],
  "author": "Jeffrey A. Kottler",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/17847535-change"
}