{
  "title": "Mirror to America",
  "description": "John Hope Franklin lived through America's most defining twentieth-century transformation, the dismantling of legally protected racial segregation. A renowned scholar, he has explored that transformation in its myriad aspects, notably in his 3.5-million-copy bestseller, From Slavery to Freedom . Born in 1915, he, like every other African American, could not help but he was evicted from whites-only train cars, confined to segregated schools, threatened―once with lynching―and consistently subjected to racism's denigration of his humanity. Yet he managed to receive a Ph.D. from Harvard; become the first black historian to assume a full professorship at a white institution, Brooklyn College; and be appointed chair of the University of Chicago's history department and, later, John B. Duke Professor at Duke University. He has reshaped the way African American history is understood and taught and become one of the world's most celebrated historians, garnering over 130 honorary degrees. But Franklin's participation was much more fundamental than that. From his effort in 1934 to hand President Franklin Roosevelt a petition calling for action in response to the Cordie Cheek lynching, to his 1997 appointment by President Clinton to head the President's Initiative on Race, and continuing to the present, Franklin has influenced with determination and dignity the nation's racial conscience. Whether aiding Thurgood Marshall's preparation for arguing Brown v. Board of Education in 1954, marching to Montgomery, Alabama, in 1965, or testifying against Robert Bork's nomination to the Supreme Court in 1987, Franklin has pushed the national conversation on race toward humanity and equality, a life long effort that earned him the Presidential Medal of Freedom, the nation's highest civilian honor, in 1995. Intimate, at times revelatory, Mirror to America chronicles Franklin's life and this nation's racial transformation in the twentieth century, and is a powerful reminder of the extent to which the problem of America remains the problem of color.",
  "genres": [
    "History",
    "Biography",
    "Nonfiction",
    "American History",
    "Memoir",
    "Race",
    "Politics"
  ],
  "author": "John Hope Franklin",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/178484.Mirror_to_America"
}