{
  "title": "Many Thousands Gone: The First Two Centuries of Slavery in North America",
  "description": "Today most Americans, black and white, identify slavery with cotton, the deep South, and the African-American church. But at the beginning of the nineteenth century, after almost two hundred years of African-American life in mainland North America, few slaves grew cotton, lived in the deep South, or embraced Christianity. Many Thousands Gone traces the evolution of black society from the first arrivals in the early seventeenth century through the Revolution. In telling their story, Ira Berlin, a leading historian of southern and African-American life, reintegrates slaves into the history of the American working class and into the tapestry of our nation.Laboring as field hands on tobacco and rice plantations, as skilled artisans in port cities, or soldiers along the frontier, generation after generation of African Americans struggled to create a world of their own in circumstances not of their own making. In a panoramic view that stretches from the North to the Chesapeake Bay and Carolina lowcountry to the Mississippi Valley, Many Thousands Gone reveals the diverse forms that slavery and freedom assumed before cotton was king. We witness the transformation that occurred as the first generations of creole slaves--who worked alongside their owners, free blacks, and indentured whites--gave way to the plantation generations, whose back-breaking labor was the sole engine of their society and whose physical and linguistic isolation sustained African traditions on American soil.As the nature of the slaves' labor changed with place and time, so did the relationship between slave and master, and between slave and society. In this fresh and vivid interpretation, Berlin demonstrates that the meaning of slavery and of race itself was continually renegotiated and redefined, as the nation lurched toward political and economic independence and grappled with the Enlightenment ideals that had inspired its birth.",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Race",
    "African American",
    "American",
    "Social Justice"
  ],
  "author": "Ira Berlin",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/178481.Many_Thousands_Gone"
}