{
  "title": "Hurting Me",
  "description": "Lucas Webb had been my best friend since I was six and he was eight. Today, twelve years later, nothing’s changed.I owe Lucas the world, he saved my life.I know it’s not normal – a fourteen year old girl being saved by a sixteen year old boy, but he did save me. He climbed through my bedroom window, luckily my father had already left my room, and he packed a bag for me. Then he took me home.At first his parents weren’t happy with what we had done but then Lucas explained my situation to them. They never questioned it after that.My own parents tried contacting me once, it took them two weeks to realize I’d gone missing. They may have known before that, they just didn’t care enough to do anything about it. I have no idea what happened, what Lucas’s parents told them, but they never tried to contact me again.Lucas’s family comes from money so, they could have paid my parents off. It’s a strange thought, that I might have been bought by another family. As long as I got to stay with my best friend though, I didn’t really care.After high school, magically I got into the same college in Miami that Lucas attended. We decided to stay out here after college. It was a fresh start for both of us, just what we needed.After college, Lucas opened a bar on the beach front.I work there full time, along with my other best friend, Emma Davis. Emma was my room mate in college and she’s still my room mate today, in our two bedroom apartment, just ten minutes away from the bar and beach. Apart from Lucas and Emma, no one knows what happened to me.To the outside world, everyone thinks that I’m normal, happy, outgoing, funny and carefree.No one, not even Lucas or Emma, know that I have a secret. Deep down, I’m not okay. For me, everyday is a struggle.So when I met Austin Moore, one of the hottest drummers in the world, which then led to me meeting Lola. My life started spiralling out of control, and there wasn’t a thing I could do to stop it.",
  "genres": [],
  "author": "R.S. Burnett",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/17852866-hurting-me"
}