{
  "title": "Nigger Heaven",
  "description": "A controversial but appealing, amusing, and vivacious celebration of Harlem and the Harlem Renaissance in the 1920’sNo other contemporary novel received the volume and intensity of criticism and curiosity that greeted Nigger Heaven upon its publication in 1926. Carl Van Vechten's novel generated a storm of controversy because of its scandalous title and fed an insatiable hunger on the part of the reading public for material relating to the black culture of Harlem's jazz clubs, cabarets, and social events.\"The book and not the title is the thing,\" James Weldon Johnson insisted with regard to Nigger Heaven, and the book is indeed a nuanced and vibrant portrait of \"the great black walled city\" of Harlem. Opening on a scene of tawdry sensationalism, Nigger Heaven shifts decisively to a world of black middle-class respectability, defined by intellectual values, professional ambition, and an acute consciousness of class and racial identity.Here is a Harlem where upper-class elites discuss art in well-appointed drawing rooms; rowdy and lascivious drunks spend long nights in jazz clubs and speakeasies; and politically conscious young intellectuals drink coffee and debate \"the race problem\" in walk-up apartments. At the center of the story, two young people--a quiet, serious librarian and a volatile aspiring writer--struggle to love each other as their dreams are slowly suffocated by racism.This reissue is based on the seventh printing, which included poetry composed by Langston Hughes especially for the book. Kathleen Pfeiffer's astute introduction investigates the controversy surrounding the shocking title and shows how the novel functioned in its time as a site to contest racial violence. She also signals questions of racial authenticity and racial identity raised by a novel about black culture written by a white admirer of that culture.Carl Van Vechten was a photographer and the author of numerous works of fiction and non-fiction. Kathleen Pfeiffer is an assistant professor of English at Oakland University, Rochester, Michigan.",
  "genres": [
    "Fiction",
    "Historical Fiction",
    "Classics",
    "Literature",
    "African American",
    "Race",
    "American"
  ],
  "author": "Carl van Vechten",
  "average_rating": "3.40",
  "url": "https://www.goodreads.com/book/show/178530.Nigger_Heaven"
}