{
  "title": "De onverwachte huwelijksreis",
  "description": "In deze kostelijke roman gaan twee jonge mensen volkomen onverwachts op huwelijksreis. Zo onverwachts, dat de huwelijkspartners nog van niets weten op de ochtend van de dag waarop de reis begint, sterker: elkaar nog nooit hebben ontmoet. De blonde Sibylle Sebald denkt er niet aan alleen om het kapitaal in de familie te houden, met Victor Laszleben te trouwen. Ze schrijft haar moeder een brief, waarin ze vertelt dat ze de vlucht neemt met een jongeman. Ze stapt in de trein; alleen — want de jongeman bestaat slechts in haar verbeelding. Op dezelfde prachtige dag heeft ook Constantijn Zott, een vrolijke en zeer ridderlijke jongeman, de trein genomen; en laat dat nu de trein zijn, waarin Sibylle haar vrijheid tegemoet vlucht! Constantijn is op weg naar zijn vakantieoord en verkeert in een allerbeste stemming, die nog aanmerkelijk verhoogd wordt, als tegenover hem de zenuwachtige, maar desondanks allercharmantste Sibylle plaatsneemt. Sibylle is zo zenuwachtig omdat ze ontdekt heeft dat haar oom Wendelin — een strenge officier van justitie — ook in de trein zit, kennelijk naar haar op zoek is en elk ogenblijk haar coupé kan binnenkomen. Sibylle ziet maar één oplossing: oom Wendelin voor een voldongen feit stellen en met een echtgenoot voor de dag komen. Wat ligt er voor Sibylle méér voor de hand dan de glimlachende jongeman op de bank tegenover haar met een paar woorden de situatie duidelijk te maken? En wie zal het de ridderlijke Constantijn kwalijk nemen, dat hij gevolg geeft aan het dringende verzoek van de lieftallige Sibylle gedurende enkele ogenblikken als haar echtgenoot op te treden? Oom Wendelin dringt triomfantelijk de coupé binnen en meent nog op tijd te zijn om zijn nicht van haar voorgenomen huwelijk terug te houden. Maar hij wordt met stomheid geslagen, als hij door een opgeluchte Sibylle wordt voorgesteld aan Constantijn Zott, haar man, met wie ze op huwelijksreis is! Waarheen? O, zo maar, ze reizen met onbekende bestemming: dat is wel zo leuk! Oom Wendelin herstelt zich van zijn schrik en weet het jonge paar over te halen die onbekende bestemming dan maar het buitengoed van tante Emma te laten zijn. Sibylle en Constantijn zien geen uitweg, belanden mét oom Wendelin in de prachtige villa in de Beierse Alpen en bevinden zich dan natuurlijk in een allerpijnlijkste situatie: ze moeten hun komedie voortzetten. Hoe hun dit lukt, ondanks alle valstrikken die de argwanende oom Wendelin stelt, wordt op zeer humoristische wijze verteld in deze lichtvoetige roman. Het verhaal zit vol verrassende wendingen en bewijst, dat de romantiek de wereld nog niet uit is.",
  "genres": [],
  "author": "Rudolf Anderl",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/17853168-de-onverwachte-huwelijksreis"
}