{
  "title": "Shades of the Stars: A Legend of the Dreamer Anthology",
  "description": "Shades of the Stars is a perfect read for fans of the Defy the Dark anthology and Lauren Oliver's Delirium Stories collection. This Legend of the Dreamer anthology features playlists, essays on the magical world of the Order, deleted scenes from Light of the Moon (Book 1), an author interview, and a special look at the sequel, Shadow of the Sun (Book 2). The pulse-pounding and lyrical short stories The Witch's Curse, The Warrior's Code, and an exclusive story called The Enchanter's Fire are included for the first time in print. In The Witch's Curse, Magda cannot stop her heart from running rampant with the beating drum of love. Whenever her eyes find Samuel, she can feel the pull of strings so vividly alive against her heart. But for Magda, love goes against fate; her destiny as a witch forbids her to need anything but the dark binds of magic. Soon, the witch's curse begins to call to Magda. To deny her love for Samuel would be unthinkable, but to defy her destiny would be impossible. Before the curse can consume her, Magda must decide between Samuel and destiny, and her heart may beat too savagely for anyone to stop.  In The Warrior's Code, Warriors fight for justice, freedom, and peace. Becoming a Warrior is an honor given to few, and twelve-year-olds Zackery Solts and Kate Black will do anything to have a place among the elite. Zack and Kate must compete against eighteen others and pass three deadly tests of courage and skill. Above all, they must be strong because while the dangers of the tests are unknown, one thing is clear: not everyone will survive.  In The Enchanter's Fire, Lily Woods is a girl on fire. Literally. Her element burns as fierce as her heart, and very few enchanters want to get close to a girl with such radiant power. None except for Shane Spencer, a boy as calm and cool as his icy element. But fire and ice don't mix, and the element Lily burns inside her is growing stronger. Unstoppable. Soon, Lily's fire may be the end of them all. Taking place during the final, pulse-pounding moments of Light of the Moon, The Enchanter's Fire burns with action and romance.",
  "genres": [
    "Fantasy",
    "Young Adult"
  ],
  "author": "David     James",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/17853546-shades-of-the-stars"
}