{
  "title": "The Illuminiers",
  "description": "Ever wonder what lies beyond the veil of magic? Magic is a series of commands upon the energy flowing through a force known as the Framework. While wizards and witches can recite the ancient commands to summon power, Illuminiers can amplify it. The one with the Synergium has limitless power. Markus Burne, an evil Illuminier, seeks the destruction of Elderwynne’s Academy to absorb the Synergium. The betrayal begins with an ancient entity and a deceitful girl with violet hair. Amberly and her mother are new to Locke Lake, and when they move into the notoriously haunted home of Connor Locke, they are easy targets. With promises of salvation, Markus steals the evil from Amberly’s home for a darker purpose. He disappears with the forbidden magic, leaving destruction in his wake. He leaves his daughter, Morgan behind. The daughter he traded for supremacy isn't an easy target. Morgan Fay Achron has the power of three and the gift of time. She’s a descendant of Morgan Le Fay with a timepiece, a coin, and a book of nonsensical poetry. Miserable with a stepmother that doesn't want her, she mourns for the father that vanished. Then Arthur Achron arrives. Convincing her to come to Locke Lake, she leaves the only home she’s ever known to seek answers. At H.B. Locke Private School, Morgan spies another student leaving the cafeteria; a girl with purple hair. Morgan discovers another school far out on the isthmus. With ingenuity and a white lie, she surprises the Illuminiers. They find her dishonesty unwelcome, distrusting her nearly as much as the one person who tried to destroy them. Despite having a lineage that dates back to Merlin and King Arthur, Morgan has to fight to gain the trust of the Illuminiers to use the Framework. Morgan’s friends are there to help her find herself. When the time comes, will Morgan betray the Illuminiers as Markus would have it? Will she stand with her friends against a dark adversary? Swept up in the Synergium, can she resist the lure of the Framework? Recommended for ages 9 - 12+, but a great fiction read for all ages!",
  "genres": [],
  "author": "Patricia    Arnold",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/17854565-the-illuminiers"
}