{
  "title": "Universal Laws: 18 Powerful Laws  & The Secret Behind Manifesting Your Desires",
  "description": "When it comes to working with the Law of Attraction, or manifesting your desires, there are many, so called “secrets”. When movies are produced or books are published on either of these two subjects some of the most important information is, well let’s just say… “missing.” You’re only provided with half of the information that you need. Is it on purpose? Maybe, sometimes…Is it on accident? Probably, most of the time…Is it because they don’t know the entire truth themselves? Most likely…You will never, ever, be able to fully understand how to manifest things into your life without understanding the how the ENTIRE manifestation process works. And I want you to succeed!In this book you will learn:•\tHow to “understand” Universal Laws.•\tWhy Universal Laws are important to manifesting your desires.•\tWhat it “feels” like when working with Universal Laws and manifesting. •\tManifesting Exercises.•\tManifesting Meditation.•\t6 Common blocks to manifesting your desires.I have taught thousands of people how to manifest their desires, and I have a huge success rate. And if you follow these things, I have no doubt in my mind that you too, will be successful!However, this book is not for everyone! Before you read this book:•\tYou must have an open mind.•\tYou must be willing to challenge your beliefs, and how you “think” the world currently works around you.•\tYou must also be okay with being different and “thinking” different then those who you choose to surround yourself with. And not worry that they will “make fun of your new perspective” or “think you’re crazy”. If you’re willing to learn what’s in this book, then take this knowledge and integrate it into your everyday life, you will embark on the most rewarding journey of your life…",
  "genres": [
    "Self Help",
    "Nonfiction",
    "Spirituality",
    "Personal Development",
    "New Age",
    "Amazon"
  ],
  "author": "Jennifer O'Neill",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/17856423-universal-laws"
}