{
  "title": "Birthright",
  "description": "A novel of consummate dramatic sweep and emotional force, BIRTHRIGHT is the story of a father and daughter locked in a bitter contest for control of the world's most legendary banking house. Reared in the splendid excess of her family's London home and country estate; blessed with beauty and a precocious intelligence that has already captured the eye of her empire-building grandfather, Deborah de Kronenegold has everything, or so it seems. But her childhood equilibrium is shattered when she discovers that she is adopted, and when she becomes the object of her father Leslie's malevolence. Upon the deaths of her her grandfather Samuel and her lovely and ill-fated mother Madeleine--and the mysterious disappearance of the will naming deborah Samuel's principal heir--Leslie sets in motion a series of shocking and irrevocable events. Deborah is turned out, and with nothing but her resolve to claim her birthright, she moves to New York, and starts to build a financial empire to rival her father's--and to bring him down. BIRTHIGHT is also a constellation of passionate love there is Bash, Deborah's first love, whose heritage forbids him what he most desires; and David, who offers Deborah wealth and security and adoration--but at a terrible price. Finally, there is the story of another love affair--set in distant war-torn Italy, which unlocks the secret of Deborah's birthright. As played out against the glamorous world of international finance, and set in the boardrooms of London, Paris, and New York, in sumptuous townhouses, chateaus, and penthouses, and in Italy and in in modern Israel, BIRTHRIGHT cuts a grand and satisfying swath. It is a triumph of the unexpected that will hold the reader captivated right up to its surprising conclusion. INCLUDES AN OPENING EXCERPT FROM JOSEPH AMIEL'S NOVEL \"DEEDS.\"",
  "genres": [
    "Fiction"
  ],
  "author": "Joseph Amiel",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/17857191-birthright"
}