{
  "title": "Empress Dowager Cixi: The Concubine Who Launched Modern China",
  "description": "A New York Times Notable BookEmpress Dowager Cixi (1835–1908) is the most important woman in Chinese history. She ruled China for decades and brought a medieval empire into the modern age.At the age of sixteen, in a nationwide selection for royal consorts, Cixi was chosen as one of the emperor’s numerous concubines. When he died in 1861, their five-year-old son succeeded to the throne. Cixi at once launched a palace coup against the regents appointed by her husband and made herself the real ruler of China—behind the throne, literally, with a silk screen separating her from her officials who were all male.In this groundbreaking biography, Jung Chang vividly describes how Cixi fought against monumental obstacles to change China. Under her the ancient country attained virtually all the attributes of a modern industries, railways, electricity, the telegraph and an army and navy with up-to-date weaponry. It was she who abolished gruesome punishments like “death by a thousand cuts” and put an end to foot-binding. She inaugurated women’s liberation and embarked on the path to introduce parliamentary elections to China. Chang comprehensively overturns the conventional view of Cixi as a diehard conservative and cruel despot.Cixi reigned during extraordinary times and had to deal with a host of major national the Taiping and Boxer rebellions, wars with France and Japan—and an invasion by eight allied powers including Britain, Germany, Russia and the United States. Jung Chang not only records the Empress Dowager’s conduct of domestic and foreign affairs, but also takes the reader into the depths of her splendid Summer Palace and the harem of Beijing’s Forbidden City, where she lived surrounded by eunuchs—one of whom she fell in love, with tragic consequences. The world Chang describes here, in fascinating detail, seems almost unbelievable in its extraordinary mixture of the very old and the very new.Based on newly available, mostly Chinese, historical documents such as court records, official and private correspondence, diaries and eyewitness accounts, this biography will revolutionize historical thinking about a crucial period in China’s—and the world’s—history. Packed with drama, fast paced and gripping, it is both a panoramic depiction of the birth of modern China and an intimate portrait of a as the concubine to a monarch, as the absolute ruler of a third of the world’s population, and as a unique stateswoman.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "China",
    "Historical",
    "Biography Memoir",
    "Audiobook"
  ],
  "author": "Jung Chang",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/17857634-empress-dowager-cixi"
}