{
  "title": "The Rich Get Richer and the Poor Get Prison: Ideology, Class, and Criminal Justice",
  "description": "Illustrates the issue of economic inequality within the American justice system. The best-selling text, The Rich Get Richer and the Poor Get Prison contends that the criminal justice system is biased against the poor from start to finish. The authors argue that even before the process of arrest, trial, and sentencing, the system is biased against the poor in what it chooses to treat as crime. The authors show that numerous acts of the well-off--such as their refusal to make workplaces safe, refusal to curtail deadly pollution, promotion of unnecessary surgery, and prescriptions for unnecessary drugs--cause as much harm as the acts of the poor that are treated as crimes. However, the dangerous acts of the well-off are almost never treated as crimes, and when they are, they are almost never treated as severely as the crimes of the poor. Not only does the criminal justice system fail to protect against the harmful acts of well-off people, it also fails to remedy the causes of crime, such as poverty. This results in a large population of poor criminals in our prisons and in our media. The authors contend that the idea of crime as a work of the poor serves the interests of the rich and powerful while conveying a misleading notion that the real threat to Americans comes from the bottom of society rather than the top. Learning Goals Upon completing this book, readers will be able Note : MySearchLab with eText does not come automatically packed with this text. To purchase MySearchLab with eText, please visitwww.mysearchlab.com or you can purchase a ValuePack of the text + MySearchLab with eText (at no additional cost): ValuePack 0205896103 / ValuePack 9780205896103.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Sociology",
    "Social Justice",
    "Law",
    "Economics",
    "Crime"
  ],
  "author": "Jeffrey H. Reiman",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/108431.The_Rich_Get_Richer_and_the_Poor_Get_Prison"
}