{
  "title": "Happy Utopia Day, Joe McCarthy",
  "description": "A xenophobic, alt-right wing advisor controls an unstable United States president. Through executive orders they utilize torture, censor the press, and construct monolithic border walls across Mexico and Canada. Only an unlikely hero can save the American people from complete totalitarianism.2014 Thurber Prize for American Humor Semi-Finalist2014 Reader's Favorite Silver Award Winner, Humor2013 IndieFab Bronze Award Winner, Thriller & Suspense2013 BOTYA - Foreword Book of the Year Finalist, Action & AdventureChris Thompson thought his youthful dreams of being a secret agent had long ago been put to rest. He has a wife and child, a stable job with the US Customs Department, and—aside from a minor incident involving outsourcing American apple pie production to Bangladesh—no real worries.This all changes when Chris receives a phone call from the president of the United States, Oscar I. Wright, regarding a secret invasion of America from Canada and Mexico—an invasion somehow tied to the “Big Mac Party,” a cultish political party that worships the legacy of the notorious Communist-hunting Senator Joseph McCarthy. Soon, Chris is equipped with firearms, designer suits, government helicopters, and an array of gadgets worthy of any top-notch spy. His mission: infiltrate the mysterious “Emergence” program founded by McCarthy within the shadowy halls of the US government—and, ultimately, save democracy as we know it from the xenophobic demons of America’s past.A unique, bubbling combination of Christopher Buckley-esque satire, political farce, and espionage comedy, Happy Utopia Day, Joe McCarthy reveals—through encounters with a hilarious cast of hallucinating politicians, Border Patrol commandants, crew-cut torturers, stuttering computer wizards, supposedly immortal pilots, and more—just how frightening a contemporary abuse of government power can be, and just how much we sometimes stand to lose when we decide to pursue our dreams.",
  "genres": [
    "Fiction",
    "Humor",
    "Thriller",
    "Novels",
    "Espionage"
  ],
  "author": "J.T. Lundy",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/17859212-happy-utopia-day-joe-mccarthy"
}