{
  "title": "Drifting into Darien: A Personal and Natural History of the Altamaha River",
  "description": "Janisse Ray was a babe in arms when a boat of her father’s construction cracked open and went down in the mighty Altamaha River. Tucked in a life preserver, she washed onto a sandbar as the craft sank from view. That first baptism began a lifelong relationship with a stunning and powerful river that almost nobody knows.The Altamaha rises dark and mysterious in southeast Georgia. It is deep and wide bordered by swamps. Its corridor contains an extraordinary biodi­versity, including many rare and endangered species, which led the Nature Conservancy to designate it as one of the world’s last great places.The Altamaha is Ray’s river, and from childhood she dreamed of paddling its entire length to where it empties into the sea. Drifting into Darien begins with an account of finally making that journey, turning to medita­tions on the many ways we accept a world that contains both good and evil. With praise, biting satire, and hope, Ray contemplates transformation and attempts with every page to settle peacefully into the now.Though commemorating a history that includes logging, Ray celebrates “a culture that sprang from the flatwoods, which required a judicious use of nature.” She looks in vain for an ivorybill woodpecker but is equally eager to see any of the imperiled species found in the river spiny mussel, American oystercatcher, Radford’s mint, Alabama milkvine. The book explores both the need and the possibilities for conservation of the river and the surrounding forests and wetlands. As in her groundbreaking Ecology of a Cracker Childhood , Ray writes an account of her beloved river that is both social history and natural history, understanding the two as inseparable, particularly in the rural corner of Georgia that she knows best. Ray goes looking for wisdom and finds a river.",
  "genres": [
    "Nonfiction",
    "Nature",
    "Biography",
    "Travel",
    "Memoir",
    "History",
    "Science"
  ],
  "author": "Janisse Ray",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/17859640-drifting-into-darien"
}