{
  "title": "Sebastian/Aristide",
  "description": "Coming November 2013SebastianA DIPLOMAT WITH THE HEART OF A SAVAGESebastian Duval has devoted his life to ensuring the survival of his people. He’ll do whatever is necessary to protect the Wildlands, even if it means working with the human FBI to prove the Pantera aren’t responsible for the sudden rash of puma attacks. But his honorable intentions have met their match when his liaison turns out to be a beautiful, mysterious woman who stirs his most primitive instincts. A WOMAN WITHOUT A PASTReny Smith refuses to allow her amnesia to ruin her life. She’s created a new identity and is determined to become a successful FBI agent. Unfortunately, that means working with a Pantera diplomat to solve the latest assaults in New Orleans. Sebastian is not only a risk to the secrets she’s worked so hard to conceal, but also to her career. She’ll have to choose whether to run from the man who threatens to strip away her defenses, or listen to her heart and become the woman she was always meant to be. AristideHE MUST MATE A PANTERA FEMALEGorgeous Nurturer Aristide, is a rare male. He wants to be mated, wants love and a family. But only a Pantera female will do. The problem is, the one female Ari can’t resist is human, and when she’s captured by the Pantera and called their greatest enemy, Aristide must decide between the abiding want of his puma heart and the vow he’s made to his shifter species. A HUMAN WOMAN WITH A DANGEROUS SECRETReporter Katherine Burke lives for one thing. Her five-year-old son, Noah. She will do anything to protect him, including writing heinous lies about a group of puma shifters she doesn’t even believe exist. But when she’s captured by the Pantera, sees the amazing truth of who they are, and gains the love of an honorable male, she knows she must choose between more lies or trusting someone for the first time in her life.",
  "genres": [
    "Paranormal",
    "Paranormal Romance",
    "Shapeshifters",
    "Romance",
    "Fantasy",
    "Magic",
    "Novella"
  ],
  "author": "Alexandra Ivy",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/17860805-sebastian-aristide"
}