{
  "title": "Worn Me Down",
  "description": "“Worn me down like a road. I did everything you told. Worn me down to my knees. I did everything to please.”Austin Conrad has never taken his personal life seriously. As a Navy SEAL, he spends all of his time in dangerous, life-threatening situations. The only way to leave behind the horrors he’s seen throughout his career, is to turn it all off when he gets home. He’s too much of a playboy to settle down; even if he did find a woman he could stand to be around for more than one night, he would never taint her life with the demons of his past. When his best friend and SEAL team member, Brady Marshall asks him to keep an eye on his baby sister, Gwen, Austin figures it will be a walk in the park. The only thing Austin likes more than flirting his way under a beautiful woman’s skin, is walking away with a smile on his face. Austin never expects that the single mom and her little girl will be the ones getting under his skin. Gwen Stratford knows all too well about living in a nightmare. After taking her daughter and fleeing from her abusive husband in the middle of the night several months ago, she’s worked hard to get her life back on track and forget about the man who tried to break her. Growing up under the iron thumb of her parents and then moving right on with a man who ruled their marriage with his fists, Gwen is finally able to breathe and live her life the way she wants.When scary, mysterious things begin to happen to Gwen and her daughter, she realizes you can never outrun your past; it always has a way of catching up with you. As she struggles with the desire to keep her newfound independence, she knows she won’t be able to protect herself and her child alone. She’ll need to lean on the one man who drives her crazy. Can Gwen really put her trust in a man who thinks life is one big joke, or will he be just another man in her life who tries to wear her down?",
  "genres": [
    "Contemporary Romance",
    "Military Fiction",
    "Romantic Suspense",
    "Contemporary",
    "New Adult",
    "Abuse",
    "Romance"
  ],
  "author": "T.E. Sivec",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/17861219-worn-me-down"
}