{
  "title": "Forever Mine",
  "description": "A catalytic meeting between two strong willed people sets the course for things to come.A war has been raging in D'rkenrealm for the past one hundred years. A war started to annihilate the Blendling race. Blendling Abaigeal Mac Branain is the youngest and only daughter of D'rkenrealm's Overlord Magnus Mac Branain and his mate Elizabeth. Treated like a princess by her father Abaigeal is anything but. She's a warrior like her mother and under the cover of lies and a disguise she's been fighting in the war. She hates lieing to her father but she can't live in the gilded cage he wants to keep her in. She's a strong self confident woman who fears nothing...well, except falling in love and especially with a dominate vampire. Yet on dark night on a bloody battlefield Abby meets the most dominate vampire there is and she can't help but feel pulled to the enigmatic alpha male.Lord General Nikolai Kotova has lived for centuries and for the past hundred years fighting a battle he has never believed in. The endless fighting has left him feeling cold and lost, unsure of exactly who and what his purpose is. But when he meets a masked woman who sets his heart pumping and sends a wave of light into his soul he knows she is his destiny. He's changing and he doesn't know why he only knows that she is the key. He knows the time has come for change and he'll set out to do just that. Fighing not only his own guilt but the men who started the war to begin with, and also the woman whose afraid to let herself love him, the woman that changed everything.Though Nikolai is unaware a violent past follows his every move, hiding lies and secrets that in their telling will forever change him and the world.Abaigael will fight her own desires and Nikolai's unrelenting seduction until she learns that falling in love doesn't have to mean losing herself.",
  "genres": [],
  "author": "Joss Wulff",
  "average_rating": "4.42",
  "url": "https://www.goodreads.com/book/show/17861277-forever-mine"
}