{
  "title": "His Name is Sir",
  "description": "Why won’t the past stay where it belongs?Nonnie Crawford seeks a destiny outside society’s norms, mapping her own sexual journey into the realm of BDSM. She puts the past behind her and looks forward with a newfound sense of freedom and purpose.Gibson Reeves, the enigmatic businessman, refuses to be relegated to the archives of Nonnie’s story. He claims his share of her sensual narrative and leaves her confused about the fine line between aversion and attraction.Meanwhile, the opportunistic playboy, Michael Weston, continues to make unwanted appearances in her life. He wants her back, and her adamant refusals do little to dampen his desire.Nonnie’s world is about to be rocked to its very core. She doesn’t know it yet, but the worst has already happened.*Warning: adult material. Only purchase if it is legal for you to do so. This book contains explicit language and scenes of a sexual nature, including exhibitionism, f/M/f/f, light bondage and consensual domination and submission, which some readers may find objectionable.*~~~~~~~~~~~~~~~~~~~~“The Power to Please,” is a planned four-part series of novels chronicling Nonnie Crawford’s journey into the alluring but sometimes dangerous realm of BDSM.After ending her disastrous ten-year marriage, Nonnie finds herself irresistibly drawn by the pull of passion. She yearns to submit herself, sexually, to a powerful and dominant male.Two masterful Doms vie for Nonnie’s submission, the enigmatic Businessman and the charming Playboy. Both men want to guide her sensual journey and lead her to places she never imagined she might go.Knowing who to trust is always a challenge, and adding in the heady seduction of novel desires only escalates the odds of making a mistake. Nonnie’s choices prove the difference between perfect bliss and utter ruin.In the end, she must answer the most critical question of all -- in a relationship that’s all about the exchange of power, who holds the ultimate power to please?",
  "genres": [
    "BDSM",
    "Erotica",
    "Romance",
    "Erotic Romance",
    "M F Romance",
    "Fiction"
  ],
  "author": "Deena Ward",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/17861409-his-name-is-sir"
}