{
  "title": "Sodium Bicarbonate: Nature's Unique First Aid Remedy",
  "description": "​*** OVER 47,000 COPIES SOLD ***# 1 AMAZON BESTSELLER(5 YEARS IN A ROW)What if there were a natural health-promoting substance that was inexpensive, available at any grocery store in the country, and probably sitting in your cupboard right now? There is. It is called sodium bicarbonate, although you may know it as baking soda. For years, sodium bicarbonate has been used on a daily basis as part of a number of hospital treatments, but most people remain unaware of its full therapeutic potential. In his new book, Dr. Mark Sircus shows how this common compound―along with magnesium, potassium, and calcium bicarbonates―may be used in the alleviation, or possibly even prevention, of many forms of illness.Sodium Bicarbonate begins with a basic overview of the everyday item known as baking soda, chronicling its long history of use as an effective home remedy. It then explains the role sodium bicarbonate plays in achieving optimal pH balance, which is revealed as an important factor in maintaining good health. The book goes on to detail how sodium bicarbonate and its effect on pH may benefit sufferers of a number of conditions, including kidney disease, fungal infection, colds and flu, periodontal disease, hypertension, and even cancer. Finally, the author explains the various ways in which sodium bicarbonate may be taken, suggesting the easiest and most effective method for your situation.By providing a modern approach to this time-honored remedy, Sodium Bicarbonate illustrates the need to see baking soda in a whole new light. Safe, simple, and effective, sodium bicarbonate contains powerful properties that may help you balance your system, regain your well-being, and avoid future health problems.",
  "genres": [
    "Health",
    "Nonfiction",
    "Nutrition"
  ],
  "author": "Mark Sircus",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/17861624-sodium-bicarbonate"
}