{
  "title": "Cruxim",
  "description": "A Number One Bestseller in Dark Fantasy, Gothic Romance and Vampire Romance All three books in the DARK GUARDIANS FANTASY SERIES are now available. Book Cruxim (You are Never Alone) Book Creche (Know Thyself) Creed Creed (All Things Know Where they Belong) A MYSTERIOUS, MYTHOLOGICAL PAST Amedeo is Cruxim, an enigmatic, immortal fallen angel who knows little about his dark past apart from a curious prophecy and an unremitting lust for blood. Destined to seek redemption as a vampire hunter, he nourishes his insatiable thirst on the blood of the undead. But when the object of his erotic passion, the novice nun Joslyn, is turned into a vampire and enters a coven, Amedeo's worlds collide. Shattered by the loss of his beloved, the dark hunter vows to wage an epic battle to rid the world of the undead once and for all, even if it destroys his vampire romance with Josyln, and even Joslyn herself. A DARK QUEST FOR A DARK ANGEL Joining dark angel Amedeo on his quest to decimate the undead is Sabine. As passionate, headstrong, romantic and immortal as she is, she is also half-woman, half-lioness. As a Sphinx—a winged guardian once believed to be a myth—she has protected mortals from vampires since sin saw mortals evicted from the Garden of Eden. Yet Sabine comes to the battle pursued by her own enemies. Archaeologist Dr. Claus Gandler knows the secret of Sabine's past and has vowed to torment her for eternity or find a way to destroy this dark huntress forever. IMMORTAL EVER AFTER? Captured and tortured by the evil doctor, Amedeo and Sabine are paraded as sideshow freaks in Gandler's Circus of Curiosities, a travelling freak show. Only vampire Joslyn has the power to intercede. Will she prove this dark angel's redemption, or his destruction? Set in 18th Century Europe, this epic saga of forbidden love plays out amid a mighty battle of good against evil, fallen angel against nosferatu devil, and reason against madness in an adventure fantasy series critics have described as reminding them of \"Anne Rice books, where the character must stay true to himself as well as the period and place of the tale\" and called \"dark, visceral and not for the squeamish.”",
  "genres": [
    "Paranormal",
    "Vampires",
    "Angels",
    "Fantasy",
    "Paranormal Romance",
    "Romance",
    "Urban Fantasy"
  ],
  "author": "Karin Cox",
  "average_rating": "3.50",
  "url": "https://www.goodreads.com/book/show/17861812-cruxim"
}