{
  "title": "Camellia Creek",
  "description": "In September 1865 Eli Calhoon, Lieutenant Colonel, Confederate States Army, returns to his war-ravished plantation home, of Camellia Creek, outside Port Gibson, Mississippi, resolved to begin again. But Mississippi, like the rest of the South, lies prostrate in the wake of a devastating conflict that wasted its population and destroyed what had been, only four years earlier, the third strongest economy in the world. More troubling, the South's recovery is now overseen by a victorious enemy determined that the economy, as well as the South's influence within the Union, will never be revived. For Southerners, getting a spring crop in the field is as far out of reach as is the payment of five years' back taxes, demanded by Congress demands from the states in Rebellion to pay for the war it waged against them. Orphaned Alice Shelto has come to Mississippi with her aunt and uncle, Betty and Peter Franklin. Peter is a speculator in search of investment. A veteran of the war, who'd seen duty in Mississippi and Louisiana, he knows opportunity exists in the defeated South. His preference for a home for his wife, daughter, and niece is the lovely bayou plantation home called Camellia Creek. outside Port Gibson, Mississippi. In company with the Franklins is Peter's widowed sister-in-law Eustacia from New York and her son, Jonathan, who Peter believes is the perfect match for Alice, heiress to a fortune. Betty Shelton is the sister of Alice's widowedr father, Jacob Shelton, and his two sons were killed in action during the late war, fighting for the Union.to bring the rebellious states back into the Union. The losses have left Alice in despair so deep her aunt fears Alice might take her own life. Seth Parker, Major, United States Marine Corps, has come to Mississippi at the request of a friend and military senior to investigate the murder of a U.S. Treasury agent, which military authorities in the state believemay ties into cotton thefts rampant among the white army officers stationed in Mississippi. The powers that be prefer a Southerner be found to blame, but his immediate the senior officer is not so sure. To investigate the death, Seth is given a troop of nine men, all colored members of Mississippi's Loyal Native Guard, for the most part ex-slaves recruited into the Union army during the war. Desperate times call for desperate measures, and in a lawless South where justice is arbitrary and order is maintained by the unprincipled and undisciplined, desperate acts measures are gambles that sometimes pay off. When an indiscretion lands the lovely Alice into the hands of a determined Eli Calhoon, he blackmails her into marriage, taking her person and her money, and brings her to Camellia Creek, where she is haunted by Jocelyn LeBlanc, an ill-fated beauty who reputedly took her own lifedied under mysterious circumstances decades earlier. Jocelyn's unresolved purpose inIn addition to Jocelyn's ghostly presence, Alice's life is overshadowed by war's aftermath, intrigue, murder, and jealousy, and greed which threaten Alice's new-found desire to live, a desire ignited by the very man who could be plotting to snuff it out.",
  "genres": [],
  "author": "Charlsie Russell",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/17861771-camellia-creek"
}