{
  "title": "Firebrand",
  "description": "Three djinn warriors. One power-hungry sorceress.The battle for good and evil has taken a whole new turn…Bound to Seduction – Book OneCareful what you wish for…Sentenced as a pleasure slave, Djinn Prince Tariq of the Marid tribe has no choice but to travel into the human realm and corrupt souls by granting wishes to the women who possess the Firebrand opal, a gemstone of magical power. When Mira Dawson summons him and requests he teach her how to pleasure others instead of ordering him to pleasure her though, duty and fantasy soon become a temptation even Tariq can’t deny. The only question left is…will the pleasure be worth the price? Because as Tariq has learned the hard way, nothing…not even fantasies…are free.Slave to Passion – Book TwoKill them all…Enslaved by his enemies and forced to fight in the pits of Jahannam for their depraved entertainment, Nasir, the once-proud Marid warrior and heir to the djinn throne, has become a killer. One celebrated and feared all at the same time. Even he doesn’t remember who he used to be, nor does he care anymore, until hope enters his cell in the form of an alluring woman full of secrets and mystery who may just be the key to his salvation.Possessed by Desire – Book ThreeEven desire comes at a price…Imprisonment has taught Ashur, the youngest djinn prince, one thing: life as a pleasure slave has its rewards…if you play by the rules. For a shot at revenge against the brothers who abandoned him, Ashur is willing to serve his master, even if it means using passion to corrupt the souls she needs to fuel her immortality. His first assignment, however, turns out to be more than just a woman in need of a little pleasure. Claire is an angel, and angels have the ability to steal djinn powers. No matter how much Ashur wants to see his brothers suffer, there’s no way he’s tangling with a celestial being. Unless, of course, she tangles with him first…",
  "genres": [
    "Romance",
    "Paranormal",
    "Fantasy",
    "Paranormal Romance"
  ],
  "author": "Elisabeth Naughton",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/17863591-firebrand"
}