{
  "title": "Uncivil War",
  "description": "Passionate, committed, and deeply humane, these poems bear witness with unflinching honesty to the horrific violence of the Sri Lankan civil war. “Indran Amirthanayagam is above all the poet of the bloody and bloody Sri Lankan conflict and division. His work honours the sufferings of the living and the injustices dealt the dead, and for any reader, as good poetry always does, it speaks for itself, for humanity in general, and rings with its own universal authenticity and grace.”—Thomas Keneally, author of Schindler’s Ark“In this staggeringly ambitious volume, Amirthanayagam sings about the Civil War in Sri Lanka, his beleaguered and beloved homeland. The poet’s voice is filled with rage as he shows, with an unflinching eye, the tragic eff ects of ethnic cleansing, genocide, fanaticism, religious intolerance, and the destruction of native cultures by their colonizers. But Amirthanayagam is equally at home writing about the great themes that have forever haunted the imagination of poets: memory, family, love, as well as the mythic tiger that Blake and Borges have sung. This is a Cosmos of a book. Indran Amirthanayagam is the true heir of Neruda in our time.” —Jaime Manrique, author of Our Lives Are The Rivers“Pathos, a trickle in the eye, a cold anger, war, loss, exodus. Th is Uncivil War of Indran Amirthanayagam is a personal bloodletting, an exorcism--a blind, brute belief that writing the horror down will keep it under control, corralled, digestible. The purpose is not suicide, but rather new life, a civil life. This is poetry that breaks down barriers of decorum, of art written for mere sensual pleasure. Yet there is a haunting lilt in the lyric voice of this poet. He delves into bitter subjects and finds tunes unbearably beautiful. He has gone into exile, and he says: let us remember paradise.”—Adam Zameenzad, author of Cyrus, Cyrus",
  "genres": [
    "Poetry"
  ],
  "author": "Indran Amirthanayagam",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/17865162-uncivil-war"
}