{
  "title": "Inhuman Bondage: The Rise and Fall of Slavery in the New World",
  "description": "David Brion Davis has long been recognized as the leading authority on slavery in the Western World. His books have won every major history award--including the Pulitzer Prize and the National Book Award--and he has been universally praised for his prodigious research, his brilliant analytical skill, and his rich and powerful prose. Now, in Inhuman Bondage, Davis sums up a lifetime of insight in what Stanley L. Engerman calls \"a monumental and magisterial book, the essential work on New World slavery for several decades to come.\"  Davis begins with the dramatic Amistad case, which vividly highlights the international character of the Atlantic slave trade and the roles of the American judiciary, the presidency, the media, and of both black and white abolitionists. The heart of the book looks at slavery in the American South, describing black slaveholding planters, the rise of the Cotton Kingdom, the daily life of ordinary slaves, the highly destructive internal, long-distance slave trade, the sexual exploitation of slaves, the emergence of an African-American culture, and much more. But though centered on the United States, the book offers a global perspective spanning four continents. It is the only study of American slavery that reaches back to ancient foundations (discussing the classical and biblical justifications for chattel bondage) and also traces the long evolution of anti-black racism (as in the writings of David Hume and Immanuel Kant, among many others). Equally important, it combines the subjects of slavery and abolitionism as very few books do, and it illuminates the meaning of nineteenth-century slave conspiracies and revolts, with a detailed comparison with 3 major revolts in the British Caribbean. It connects the actual life of slaves with the crucial place of slavery in American politics and stresses that slavery was integral to America's success as a nation--not a marginal enterprise.  A definitive history by a writer deeply immersed in the subject, Inhuman Bondage offers a compelling narrative that links together the profits of slavery, the pain of the enslaved, and the legacy of racism. It is the ultimate portrait of the dark side of the American dream. Yet it offers an inspiring example as well--the story of how abolitionists, barely a fringe group in the 1770s, successfully fought, in the space of a hundred years, to defeat one of human history's greatest evils.",
  "genres": [
    "History",
    "Nonfiction",
    "American History",
    "Race",
    "World History",
    "African American",
    "Civil War"
  ],
  "author": "David Brion Davis",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/178670.Inhuman_Bondage"
}