{
  "title": "Lee Child CD Audiobook Bundle: Bad Luck and Trouble; Gone Tomorrow; 61 Hours; Worth Dying For; The Affair; Nothing to Lose; A Wanted Man",
  "description": "This audiobook bundle includes seven riveting thrillers from Lee Child. Collection includes: \"Bad Luck and Trouble,\" \"Gone Tomorrow,\" \" 61 Hours,\" \" Worth Dying For,\" \" The Affair,\" \" Nothing to Lose,\" and \"A Wanted Man.\" Bad Luck and Trouble (5 CDs, Abridged): A decade postmilitary, Reacher has an ATM card and the clothes on his back--no phone, no ties, and no address. But now a woman from his old unit has done the impossible. From Chicago, Frances Neagley finds Reacher, using a signal only the eight members of their elite team of army investigators would know. She tells him a terrifying story--about the brutal death of a man they both served with. Soon Reacher is reuniting with the survivors of his old team, scrambling to raise the living, bury the dead, and connect the dots in a mystery that is growing darker by the day. The deeper they dig, the more they don't know: about two other comrades who have suddenly gone missing--and a trail that leads into the neon of Vegas and the darkness of international terrorism. For now, Reacher can only react. To every sound. Every suspicion. Every scent and every moment. Then Reacher will trust the people he once trusted with his life--and take this thing all the way to the end. Because in a world of bad luck and trouble, when someone targets Jack Reacher and his team, they'd better be ready for what comes right back at them... Gone Tomorrow (5 CDs, Abridged): New York City. Two in the morning. A subway car heading uptown. Jack Reacher, plus five other passengers. Four are okay. The fifth isn't. Susan Mark was the fifth passenger. She had a lonely heart, an estranged son, and a big secret. Reacher, working with a woman cop and a host of shadowy feds, wants to know just how big a hole Susan Mark was in, how many lives had already been twisted before hers, and what danger is looming around him now. Because a race has begun through the streets of Manhattan in a maze crowded with violent, skilled soldiers on all sides of a shadow war. Susan Mark's plain little life was critical to dozens of others in Washington, California, Afghanistan . . . from a former Delta Force operator now running for the U.S. Senate, to a beautiful young woman with a fantastic story to tell-and to a host of others who have just one thing in common: They're all lying to Reacher. A little. A lot. Or maybe just enough to get him killed. 61 Hours (5 CDs, Abridged): Sixty-one hours. Not a minute to spare. A tour bus crashes in a savage snowstorm and lands Jack Reacher in the middle of a deadly confrontation. In nearby Bolton, South Dakota, one brave woman is standing up for justice in a small town threatened by sinister forces. If she's going to live long enough to testify, she'll need help. Because a killer is coming to Bolton, a coldly proficient assassin who never misses. Reacher's original plan was to keep on moving. But the next 61 hours will change everything. The secrets are deadlier and his enemies are stronger than he could have guessed--but so is the woman whose life he'll risk his own to save. Worth Dying For (5 CDs, Abridged): There's deadly trouble in the corn country of Nebraska . . . and Jack Reacher walks right into it. First he falls foul of the Duncans, a local clan that has terrified an entire county into submission. But it's the unsolved case of a missing child, already decades-old, that Reacher can't let go. The Duncans want Reacher gone--and it's not just past secrets they're trying to hide. They're awaiting a secret shipment that's already late--and they have the kind of customers no one can afford to annoy. For as dangerous as the Duncans are, they're just the bottom of a criminal food chain stretching halfway around the world. For Reacher, it would have made much more sense to keep on going, to put some distance between himself and the hard-core trouble that's bearing down on him. For Reacher, that was also impossible. The Affair (5 CDs, Abridged): Everything starts somewhere. . . . For elite military cop Jack Reacher, that somewhere was Carter Crossing, Mississippi, way back in 1997. A lonely railroad track. A crime scene. A coverup. A young woman is dead, and solid evidence points to a soldier at a nearby military base. But that soldier has powerful friends in Washington. Reacher is ordered undercover--to find out everything he can, to control the local police, and then to vanish. Reacher is a good soldier. But when he gets to Carter Crossing, he finds layers no one saw coming, and the investigation spins out of control. Local sheriff Elizabeth Deveraux has a thirst for justice--and an appetite for secrets. Uncertain they can trust one another, Reacher and Deveraux reluctantly join forces. Reacher works to uncover the truth, while others try to bury it forever. The conspiracy threatens to shatter his faith in his mission, and turn him into a man to be feared. Nothing to Lose (5 CDs, Abridged): It wasn't the welcome Reacher expected. He was just passing through, minding his own business. But within minutes of his arrival a deputy is in the hospital and Reacher is back in Hope, setting up a base of operations against Despair, where a huge, seething walled-off industrial site does something nobody is supposed to see . . . where a small plane takes off every night and returns seven hours later . . . where a garrison of well-trained and well-armed military cops--the kind of soldiers Reacher once commanded--waits and watches . . . where above all two young men have disappeared and two frightened young women wait and hope for their return. Joining forces with a beautiful cop who runs Hope with a cool hand, Reacher goes up against Despair--against the deputies who try to break him and the rich man who tries to scare him--and starts to crack open the secrets, starts to expose the terrifying connection to a distant war that's killing Americans by the thousand. Now, between a town and the man who owns it, between Reacher and his conscience, something has to give. And Reacher never gives an inch. A Wanted Man (5 CDs, Abridged): Four people in a car, hoping to make Chicago by morning. One man driving, eyes on the road. Another man next to him, telling stories that don't add up. A woman in the back, silent and worried. And next to her, a huge man with a broken nose, hitching a ride east to Virginia. An hour behind them, a man lies stabbed to death in an old pumping station. He was seen going in with two others, but he never came out. He has been executed, the knife work professional, the killers vanished. Within minutes, the police are notified. Within hours, the FBI descends, laying claim to the victim without ever saying who he was or why he was there. All Reacher wanted was a ride to Virginia. All he did was stick out his thumb. But he soon discovers he has hitched more than a ride. He has tied himself to a massive conspiracy that makes him a threat--to both sides at once.",
  "genres": [],
  "author": "Lee Child",
  "average_rating": "4.88",
  "url": "https://www.goodreads.com/book/show/17867723-lee-child-cd-audiobook-bundle"
}