{
  "title": "Writing the Gettysburg Address",
  "description": "Four score and seven years ago . . . . Are any six words better known, of greater import, or from a more crucial moment in our nation's history? And yet after 150 years the dramatic and surprising story of how Lincoln wrote the Gettysburg Address has never been fully told. Until now.Martin Johnson's remarkable work of historical and literary detection illuminates a speech, a man, and a moment in history that we thought we knew. Johnson guides readers on Lincoln's emotional and intellectual journey to the speaker's platform, revealing that Lincoln himself experienced writing the Gettysburg Address as an eventful process that was filled with the possibility of failure, but which he knew resulted finally in success beyond expectation.We listen as Lincoln talks with the cemetery designer about the ideals and aspirations behind the unprecedented cemetery project, look over Lincoln's shoulder as he rethinks and rewrites his speech on the very morning of the ceremony, and share his anxiety that he might not live up to the occasion. And then, at last, we stand with Lincoln at Gettysburg, when he created the words and image of an enduring and authentic legend.Writing the Gettysburg Address resolves the puzzles and problems that have shrouded the composition of Lincoln's most admired speech in mystery for fifteen decades. Johnson shows when Lincoln first started his speech, reveals the state of the document Lincoln brought to Gettysburg, traces the origin of the false story that Lincoln wrote his speech on the train, identifies the manuscript Lincoln held while speaking, and presents a new method for deciding what Lincoln's audience actually heard him say.Ultimately, Johnson shows that the Gettysburg Address was a speech that grew and changed with each step of Lincoln's eventful journey to the podium. His two-minute speech made the battlefield and the cemetery into landmarks of the American imagination, but it was Lincoln's own journey to Gettysburg that made the Gettysburg Address.",
  "genres": [
    "Civil War",
    "History",
    "Presidents",
    "American History",
    "Nonfiction"
  ],
  "author": "Martin P. Johnson",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/17867293-writing-the-gettysburg-address"
}