{
  "title": "Slavery and Social Death: A Comparative Study",
  "description": "This is the first full-scale comparative study of the nature of slavery. In a work of prodigious scholarship and enormous breadth, which draws on the tribal, ancient, premodern, and modern worlds, Orlando Patterson discusses the internal dynamics of slavery in sixty-six societies over time. These include Greece and Rome, medieval Europe, China, Korea, the Islamic kingdoms, Africa, the Caribbean islands, and the American South. Slavery is shown to be a parasitic relationship between master and slave, invariably entailing the violent domination of a natally alienated, or socially dead, person. The phenomenon of slavery as an institution, the author argues, is a single process of recruitment, incorporation on the margin of society, and eventual manumission or death.Distinctions abound in this work. Beyond the reconceptualization of the basic master-slave relationship and the redefinition of slavery as an institution with universal attributes, Patterson rejects the legalistic Roman concept that places the \"slave as property\" at the core of the system. Rather, he emphasizes the centrality of sociological, symbolic, and ideological factors interwoven within the slavery system. Along the whole continuum of slavery, the cultural milieu is stressed, as well as political and psychological elements. Materialistic and racial factors are deemphasized. The author is thus able, for example, to deal with \"elite\" slaves, or even eunuchs, in the same framework of understanding as fieldhands; to uncover previously hidden principles of inheritance of slave and free status; and to show the tight relationship between slavery and freedom.Interdisciplinary in its methods, this study employs qualitative and quantitative techniques from all the social sciences to demonstrate the universality of structures and processes in slave systems and to reveal cross-cultural variations in the slave trade and in slavery, in rates of manumission, and in the status of freedmen. \"Slavery and Social Death\" lays out a vast new corpus of research that underpins an original and provocative thesis.",
  "genres": [
    "History",
    "Nonfiction",
    "Sociology",
    "Race",
    "Politics",
    "Anthropology",
    "Philosophy"
  ],
  "author": "Orlando Patterson",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/178680.Slavery_and_Social_Death"
}