{
  "title": "Shadow Catcher",
  "description": "\"Shadow Catcher will keep you guessing, on the edge of your seat, and eager for more.\" —Raymond Benson, author of The Black Stiletto seriesFrom James R. Hannibal—a veteran combat pilot with Top Secret clearance from the U.S. government—comes an electrifying high-tech thriller in the great tradition of Tom Clancy….Over ten years ago, Air Force major Nick Baron was part of a failed special ops mission that left a B-2 stealth bomber at the bottom of the Persian Gulf. Now, leading his men—the Triple Seven Chase team—Baron must find the bomber and dispose of it for good before any unfriendly nation can steal the onboard technology for its own purposes. But as the team embarks on its mission, there are greater dangers waiting.When the CIA intercepts a call signal from an operative in China long thought dead, the Triple Seven Chase team is given the perilous task of retrieving the lone soldier from deep within the Chinese wilderness. There is only one plane for such a dangerous mission: the Shadow Catcher, a plane with capabilities beyond anything that has ever flown.What Baron and his men don’t know is that the enemy is already among them—and that the Shadow Catcher itself may be the ultimate prize.“Just the right combination of authentic settings, nonstop action, backstabbing villains, and rough justice. Hannibal has a flair for the gutsy, the lost, and the fanatical.” —Steve Berry, New York Times bestselling author of The King’s Deception“The insider detail will fascinate you. The action will thrill you. Shadow Catcher by James R. Hannibal takes you on a riveting journey into today’s U.S. military and CIA in a high-stakes battle against Chinese espionage.” —Gayle Lynds, New York Times bestselling author of The Book of Spies",
  "genres": [
    "Fiction",
    "Military Fiction",
    "Thriller",
    "Audiobook",
    "Espionage",
    "Suspense",
    "Spy Thriller"
  ],
  "author": "James R. Hannibal",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/17869769-shadow-catcher"
}