{
  "title": "Keeping It Civil: The Case of the Pre-nup and the Porsche & Other True Accounts from the Files of a Family Lawyer",
  "description": "Margaret Klaw loves what she does. She has been on the cutting edge of family law for more than twenty-five years, helping her clients navigate the legal system from prenuptial agreements to divorce to child custody. In those years, she has witnessed her field change at a dizzying pace as the definition of family has expanded. We now have same-sex marriage, open adoption, and reproductive technologies that spread out the components of parenthood among multiple people, including egg donors, sperm donors, and gestational carriers.With a lawyer's mind and a writer's heart, Klaw lets us in on her most intriguing cases, exploring today's hot-button issues through the lens of ordinary people seeking counsel. For example, when a father sues for custody because his ex-wife sends their son to school in slippers--how dare she!--we're offered an inside look into how a lawyer selects what is relevant when pleading a case and how a judge determines what makes a \"good\" parent. Klaw shows us how a case about prenuptial agreement can reveal much about the financial independence of women over the past few decades. When Klaw draws up a contract for a couple and their sperm donor, it's an opportunity to demonstrate how reproductive technology affects the parents, the child, and society. Attorneys and armchair lawyers alike will enjoy accompanying Klaw as she negotiates with opposing counsel, prepares witnesses for testimony, develops her courtroom strategy, argues her case, and keeps her clients in check.Human beings are messy and complicated: we fall in love; we fall out of love; were sometimes vengeful and often honorable. In this emotionally rich and intellectually compelling book, Margaret Klaw reveals how the law reflects our most telling--and fascinating--cultural trends.",
  "genres": [
    "Nonfiction",
    "Law",
    "Politics"
  ],
  "author": "Margaret Klaw",
  "average_rating": "3.76",
  "url": "https://www.goodreads.com/book/show/17871517-keeping-it-civil"
}