{
  "title": "Fantomas",
  "description": "Enfantômastic - James JoyceFrom the moment it was published n February 1911, Fantômas (and the thirty-one sequels which immediately followed it) was a phenomenon: a work of fiction whose popularity cut across all social and cultural strata. Countesses and concierges; poets and proletarians; cubists, nascent dadaists, soon-to-be surrealists; everyone who could read, and even those who could not, shivered at posters of a masked man in impeccable evening clothes, dagger in hand, looming over Paris like a sombre Gulliver, contemplating hideous misdeeds from which no citizen was safe... - From the introduction by JOHN ASHBERYHere is a book as phantasmal as its unseen hero: a legendary crime novel unavailable in English for many decades, source of an equally legendary and equally inaccessible silent-movie serial by Louis Feuillade...Allain and Souvestre's creation has imposed itself through sheer aura. Just as their malevolent hero - a genius of crime, waging war on bourgeois society - terrifies most surely by his invisibility, the Fantômas novels are more powerfully imagined than read. The text, banal in itself, suggests a thousand potential scenarios of infinite fascination. Once you grasp the concept you can conjure up unlimited Fantômas adventures. - VOICEFantômas's success was due to the very nature of the character. Where literature had been high-minded, now this purely criminal hero inflamed imaginations as exquisite as those of Jean Cocteau and Guillaume Apollinaire as he violated society women and left their delicately slashed bodies for the servants to find. - NEW YORK TIMES BOOK REVIEWThat extraordinary novel, full of life and imagination...From the imaginative standpoint Fantômas is one of the richest works that exist - GUILLAUME APOLLINAIREThe Modern Aeniad - BLAISE CENDRARSAbsurd and magnificent lyricism - JEAN COCTEAU",
  "genres": [
    "Fiction",
    "Classics",
    "Mystery",
    "Crime",
    "France",
    "French Literature",
    "20th Century"
  ],
  "author": "Marcel Allain",
  "average_rating": "3.67",
  "url": "https://www.goodreads.com/book/show/1787350.Fantomas"
}