{
  "title": "Trompe-l'oeil",
  "description": "Why would a woman entering middle age — attractive, sexy, articulate, imaginative, intelligent, charming, charismatic, wealthy and successful in almost every aspect of her life — knowingly give up the only thing missing from that life: namely, love? And love with a younger man she meets serendipitously not once, but three times — and whose appreciation of her quickly grows from mere physical attraction to adoration and then to obsession? The riddle from start to finish is perhaps to be found in the word \"knowingly.\" The answer to that riddle? Revealed only in the final chapter.DANEKA SØRENSEN is a Danish transplant to NYC, where she manages her life from an Upper East Side apartment building by night and from the top floor of a mid-town skyscraper by day — ostensibly, all under tight control. KIT ADDISON is a fashion photographer with a sideline penchant for flora and poetry who lives on the Lower East Side. The distance between them, however, is about much more than a mere hundred city blocks.In Chapter One, serendipity brings Daneka and Kit together for the first time as both are exiting the Columbia campus — she from a poetry class in which she dabbles once a week, he from Philosophy Hall in which he labors days and nights without respite. This first encounter is both poetic and philosophical — but too hot to be captured in a mere haiku, too impulsive to be squeezed into an imperative, moral or historical, for either of them. At the start of Chapter Two, already eleven years later, they--or rather his camera and the front bumper of her limousine--meet a second time on a zebra crossing. Her search for a photographer for a special project (too hot and too imperative for any of the more than competent staff of a major magazine of which she is the Managing Editor) leads to a third serendipitous meeting. What follows these three meetings is, in the coming weeks, a game of cat and mouse — until, that is, their affair becomes such that \"it seemed as if they might engulf each other in this single, ferocious act, like tigers chasing their own tails and slowly churning, turning, burning into butter.\"Their affair takes them from New York to Paris, to the coast of Portugal, to Rome and Positano, Italy, to the Danish island of Bornholm in the Baltic Sea, then back to New York City. What they discover about each other in those few weeks is more than most people discover in a mate or lover over a lifetime. The exploration is an erotic Elysian field, but also a psychological inferno.What gradually comes to light in the space of two continents and one return transatlantic flight is that, while love's bite may initially be sweet, the aftertaste may be exceedingly bitter — when not downright nauseating.",
  "genres": [
    "Erotica",
    "Contemporary Romance"
  ],
  "author": "Russell Bittner",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/10844205-trompe-l-oeil"
}