{
  "title": "The Last Prince of Hell",
  "description": "Cassandra Clare said that she will publish another trilogy in the Shadowhunters' world after the Dark Artifices and The TLH trilogy. It will have two main characters, Kit and Ty Blackthorn. More information to come...Cassandra Clare said about writing more books in the Shadowhunter World:My plan at the moment is to do five Shadowhunter series, total. I don’t know if I’ll do any series in the Shadowhunter world beyond that. I don’t know why five exactly — maybe because one of my major literary idols has always been Tamora Pierce and she did five series set in Tortall. :) Maybe I think I have five stories to tell in this world. Maybe I’ll get to the end and want to tell more. Maybe not — I have a stockpile of other worlds and stories in my head; I’m writing one of them by writing Magisterium now, but there are many others.There is a special sort of enjoyment in developing stories in a created world, because you can take the rules you yourself have invented, and bend them or break them. You can create connections and history — the story of Isabelle’s ruby necklace stretches back all the way to Vampires, Scones and Edmund Herondale. Then again, with a brand new world, you get to make everything up again. It’s like: brand-new baby or adorable five-year old? They’re both good.(The five Shadowhunter series are TiD, TLH, TMI, TDA, and very far down the road, TWP. Don’t even ask about that one! It’s too far in the future! There are other Shadowhunter projects like The Bane Chronicles and the graphic novel project about the Circle, currently in planning stages and known as TST, but I’m not counting them: I’m only counting book series/trilogies written solely by me.)",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Urban Fantasy",
    "Paranormal",
    "Romance",
    "Young Adult Fantasy",
    "LGBT"
  ],
  "author": "Cassandra Clare",
  "average_rating": "4.37",
  "url": "https://www.goodreads.com/book/show/17874777-the-last-prince-of-hell"
}