{
  "title": "A Death in the Family",
  "description": "Forty years after its original publication, James Agee's last novel seems, more than ever, an American classic. For in his lyrical, sorrowful account of a man's death and its impact on his family, Agee painstakingly created a small world of domestic happiness and then showed how quickly and casually it could be destroyed. On a sultry summer night in 1915, Jay Follet leaves his house in Knoxville, Tennessee, to tend to his father, whom he believes is dying. The summons turns out to be a false alarm, but on his way back to his family, Jay has a car accident and is killed instantly. Dancing back and forth in time and braiding the viewpoints of Jay's wife, brother, and young son, Rufus, Agee creates an overwhelmingly powerful novel of innocence, tenderness, and loss that should be read aloud for the sheer music of its prose.\"An utterly individual and original book...one of the most deeply worked out expressions of human feeling that I have ever read.\"--Alfred Kazin, New York Times Book Review\"It is, in the full sense, poetry....The language of the book, at once luminous and discreet...remains in the mind.\"--New Republic\"People I know who read A Death in the Family forty years ago still talk about it. So do I. It is a great book, and I'm happy to see it done anew.\"--Andre Dubus, author of Dancing After Hours and Meditations From A Moveable ChairFrom the Trade Paperback edition. Agee was a poet, a penetrating film critic for TIME and other magazines, an intricate public conscience, and a man who carried all his life the burden of his father's death in a car accident when Agee was six. (Forty years later to the day Agee would die of a heart attack.) He brought all of that, both his gifts and his psychic injuries, to this grave and lyrical story of Rufus Follet, a boy whose world is upended by his father's sudden death in an auto accident. What this book lacks in form it more than makes up for in subtly delineated feeling. Agee's forgiving embrace of the deeply imperfect people he describes, a kind of Whitmanesque tenderness, stays with you a long time.—R.L. (Richard Lacayo)",
  "genres": [
    "Fiction",
    "Classics",
    "Literature",
    "Historical Fiction",
    "Novels",
    "American",
    "Literary Fiction"
  ],
  "author": "James Agee",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/1084430.A_Death_in_the_Family"
}