{
  "title": "The Cowboy's E-Mail Order Bride",
  "description": "Ethan Cruz should be mending fences on his Montana ranch, but instead he’s driving to the Chance Creek, Montana, airport – to pick up the bride he didn’t know he had. This latest salvo in his ongoing practical joke battle with his best friend, Rob Matheson, has gone too far, and Ethan plans to send his “bride” right back home, then get busy plotting his revenge. One look at Autumn Leeds changes his mind, however. Perhaps he needs a bride, after all. A breathtakingly beautiful city bride.Autumn Leeds needs a story – fast – or she’s going to lose her lucrative contract with CityPretty Magazine, so when she sees the crazy video plea for a modern mail-order bride for a cowboy, it sounds like the story of the century. Making a video of her own, she casts herself as the perfect mail-order bride for a rancher, but when she finally reaches Montana, she’s surprised to find Ethan’s the perfect cowboy husband-to-be. Against her better judgment, her plan to keep her handsome groom at arm’s length disintegrates into a night of passion spent in his arms.Ethan knows he can’t keep playing this game – he has to come clean with Autumn and tell her the truth; about the practical joke and about the state of his ranch. He’s about to lose it all because of the debts his mother racked up before his parents’ deaths. Now his sister, Claire, wants to sell the ranch and collect what little money they can. He’ll be out of a home and a job, and in no shape to support the bride he desperately wants to marry, after all.Autumn’s in bigger trouble than ever. Not only has she fallen in love with the subject of her expose – she might be carrying his child. If she doesn’t write this article and secure her contract for another year, she’ll lose everything – her career, her apartment, and more importantly, her family’s approval. The only alternative is to stay and marry Ethan. But how can she trust a man she’s just met when she knows too well that men always let you down?Can a love based on lies last?",
  "genres": [
    "Romance",
    "Westerns",
    "Contemporary Romance",
    "Contemporary",
    "Fiction",
    "Western Romance",
    "Adult"
  ],
  "author": "Cora Seton",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/17875167-the-cowboy-s-e-mail-order-bride"
}