{
  "title": "Gracefully Aroused: The Best of K D Grace",
  "description": "From a love spell that doesn’t quite go to plan to a farmhand who needs a little discipline; from a woman who is addicted to the confessional to a personal trainer with a very unorthodox method of guaranteeing his clients they’ll look fab come bikini season, K D Grace will tell you a naughty story with a twist. Before there was Ms Holly and the Pet Shop, before there were sexy ghosts, before Grace Marshall upped the romance ante, K D Grace was into quickies, and here’s a selection of her naughtiest.Hired HandPretty city boy, Tim Harris, is the last man Suzie Sheridan would have hired to help her on the farm had he not been the only one who applied for the job. But with strict discipline generously applied in all the right places, even Suzie is amazed at just how good a hired hand Tim turns out to be …Personal TrainerPenny Davis can’t afford to hire a personal trainer to get her fit for bikini season until ex-military hard man, Hawk Sturgis, offers her an unorthodox fitness regimen and an even more unorthodox payment plan, guaranteed to have her heating up the beach in her new bikini just in time for the summer hols.Accidental HitchhikerOn a road trip across America, Liz Martin’s car breaks down in the middle of nowhere South Dakota, and the ride a Good Samaritan lorry driver offers her is not exactly the one she expected.ProductivityUnder the careful supervision of his unorthodox management consultant, a stressed company CEO learns a hands-on technique guaranteed to up productivity.FlawsLove spells are the most dangerous kind of magic. Mick Denver learns the hard way when he enlists Sally Haddon, a witch who specialises in sex magic, to help him win the affections of his new co-worker, the exquisite and dangerous Darlene.Hard Times at the Nymphomaniac Rehabilitation FacilitySadie’s sexual appetite is out of control, and a spell at the Nymphomaniac Rehabilitation Facility is intended to put it right. It isn’t long before fellow inmate Carol is showing her how to bend the facility’s strict rules, earning them both punishments that are more than worth the crime.ConfessionsConfession is good for the soul, but Hail Marys and Our Fathers aren’t nearly enough to gain absolution when Jilly confesses to an unsuspecting priest that confession makes her come.ExcavationsWhile volunteering on an archaeological dig, Gina and Mike discover new and exciting ways to help their workaholic professor relieve stress – and he introduces them to one or two methods of his own, which are far from academic.Seeing RedWe all give off body heat, but only Jenny can see the red glow it gives off, darker and more intense the more turned on we become. When she’s compelled to follow a fellow bus passenger whose scarlet desires are too powerful to ignore, she learns the real secret of her unique vision.PheromonesAn unusually powerful sense of smell gives Chloe the ability to sniff out the scents of people in lust. When she volunteers for a research trial into pheromones, she doesn’t realise the scientist in charge will have the perfect, sexy aroma she’s always craved in a lover.",
  "genres": [
    "Erotica"
  ],
  "author": "K.D. Grace",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/17876272-gracefully-aroused"
}