{
  "title": "Betrayed and Marked",
  "description": "Sophie had been lied to her whole life. Who was she? Where did she belong? What she was destined for. Then one night that life they had kept her from came crashing down around her. She learns who she is and has to take a mate. The last Royal Female Alpha in the American continent with powers someone fears. Sophie not only has the obstacles of finding love in her situation but someone is hiding who they really are. As she takes the hand fate gave her she learns that this isn’t the worst of what she must deal with. She’s developing powers that give her an adrenalin rush. More strength then an average male of her species and magic that can transform her very presence. Her true mate has put her in heat and with two hot mates competing for their place beside her she has become her own worst nightmare. Who is her true destined mate and who is the added piece of this unique match? Drake dark headed with a body that makes you melt and those eyes. They make a woman of any species fall apart at the seams. Held close to his chest she fits like a glove the perfect fit. Is he hiding a secret from Sophie that could bring her to her knees and submit to him or could his love for her bring him out of the darkness that is eating at his very soul.Brad with his blond hair and bad boy cut takes a piece of Sophie’s soul with him from the minute they meet. They told her to stay away from humans. But something tells her his scent is not what it seems to others. The creature lurking behind his eyes makes her own Wolf say “MINE”. Will his secrets save him in this life and are they enough to protect Sophie when the time comes.A book that holds the secrets of the past that they hope gives them insight into their future has been brought back to her base for them to study. Someone is bent on having her no matter the cost. Being in heat has made her cross lines she never would have considered. A Masquerade Ball set to introduce them all brings Sophie’s nightmares to the front of her thoughts. With both mates carrying her mark in their eyes a bonding is coming no matter what. In the end even the Witches working with them can’t save her from this fate. Sophie has a secret she’s keeping from them all and only her trusted guards know the score. Will she flee taking the secret with her or will she stay and face the decision someone has made for them.",
  "genres": [],
  "author": "Katrina Vore",
  "average_rating": "4.57",
  "url": "https://www.goodreads.com/book/show/17876534-betrayed-and-marked"
}