{
  "title": "The Biscuit Witch",
  "description": "Dear Dr. Firth:I know you are in your cups at this time, drinking and sleeping under trees, but I have some experience rehabilitating lost souls in that regard, and so I am enclosing a box of my biscuits and a cold-wrapped container of cream gravy for dessert. Please eat and write back. We need a veterinarian of your gumption here in the Crossroads Cove of Jefferson County. —Delta Whittlespoon, proprietress of The Crossroads CaféBiscuit witches, Mama called them. She’d heard the term as a girl. She’d inherited that talent. My mother could cast spells on total strangers simply by setting a plate of her biscuits in front of them. –Tal MacBrideWelcome back to the Crossroads Cove where new loves, old feuds, and poignant mysteries will challenge siblings Tal, Gabby, and Gus MacBride to fight for the home they lost and to discover just how important their family once was, and still is, to the proud people of the Appalachian highlands. Tallulah MacBride hasn’t been back to North Carolina since their parents’ tragic deaths, twenty years ago. But now, Tal heads to cousin Delta Whittlespoon’s famous Crossroads Café in the mountains above Asheville, hoping to find a safe hiding place for her young daughter, Eve. What she finds is Cousin Delta gone, the café in a biscuit crisis, and a Scotsman, who refuses to believe she’s passing through instead of “running from.” He believes she needs a knight in shining flannel.When a pair of sinister private eyes show up, Tal’s troubles are just beginning. For Tal’s brother and sister—Gabby, the Pickle Queen, and Gus, the Kitchen Charmer—the next part of the journey will lead down forgotten roads and into beautiful but haunted legacies.",
  "genres": [
    "Romance",
    "Magical Realism",
    "Southern",
    "Fiction",
    "Contemporary Romance",
    "Fantasy",
    "Magic"
  ],
  "author": "Deborah  Smith",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/17877015-the-biscuit-witch"
}