{
  "title": "From Brain to Mind: Using Neuroscience to Guide Change in Education",
  "description": "Finalist for Foreword Magazine's 2011 Book of the YearWith his knack for making science intelligible for the layman, and his ability to illuminate scientific concepts through analogy and reference to personal experience, James Zull offers the reader an engrossing and coherent introduction to what neuroscience can tell us about cognitive development through experience, and its implications for education.Stating that educational change is underway and that the time is ripe to recognize that “the primary objective of education is to understand human learning” and that “all other objectives depend on achieving this understanding”, James Zull challenges the reader to focus on this purpose, first for her or himself, and then for those for whose learning they are responsible. The book is addressed to all learners and educators – to the reader as self-educator embarked on the journey of lifelong learning, to the reader as parent, and to readers who are educators in schools or university settings, as well as mentors and trainers in the workplace.In this work, James Zull presents cognitive development as a journey taken by the brain, from an organ of organized cells, blood vessels, and chemicals at birth, through its shaping by experience and environment into potentially to the most powerful and exquisite force in the universe, the human mind.Zull begins his journey with sensory-motor learning, and how that leads to discovery, and discovery to emotion. He then describes how deeper learning develops, how symbolic systems such as language and numbers emerge as tools for thought, how memory builds a knowledge base, and how memory is then used to create ideas and solve problems. Along the way he prompts us to think of new ways to shape educational experiences from early in life through adulthood, informed by the insight that metacognition lies at the root of all learning.At a time when we can expect to change jobs and careers frequently during our lifetime, when technology is changing society at break-neck speed, and we have instant access to almost infinite information and opinion, he argues that self-knowledge, awareness of how and why we think as we do, and the ability to adapt and learn, are critical to our survival as individuals; and that the transformation of education, in the light of all this and what neuroscience can tell us, is a key element in future development of healthy and productive societies.",
  "genres": [
    "Education",
    "Nonfiction",
    "Neuroscience",
    "Psychology"
  ],
  "author": "James E. Zull",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/10845442-from-brain-to-mind"
}