{
  "title": "Hot, Naked and Awake",
  "description": "My dear menopausal if you’re hot, naked and awake and reading this, don’t despair. Just click the “Buy” button for this l’il ebook and you’ll experience instant relief, not unlike like a cool, salt-kissed ocean breeze on badass flash.   Word is that one day you found yourself naked in Costco. Is that true?   Hmm, I guess word gets around. Here’s the I was standing in the bulk cheeses wondering just what to do with a 50 pound wheel of brie when a grand mal hot flash surged up from my nethers and engulfed me. I started stripping and people started screaming and that was when I knew I had gone too far. Crossed a line, if you will.   Birthday suit?   Close. Some bouncy bits were out. Damned YouTube!   Why do people say midlife is so great?   Because they hate it. They miss being young and gorgeous. But, finally, they’re smart, which totally is the cool part. But you look back at pictures of yourself at 20, 30, even 45 and say wtf! Why did I always think I was fat and ugly? NOW I’m fat and ugly! Why didn’t I cover myself with kisses and adoration daily? Why didn’t I worship at my own feet? I was the most gorgeous thing ever, but man, was I stupid.   Any diet tips?   Hating yourself is a good jumpstart, but it doesn’t last. Well, it lasts, don’t get me wrong, but it doesn’t always translate into dropping tonnage. One thing you can do is chew ice till your teeth break off and you can’t eat solid food. But then the Oreo frappucinos’ll getcha. Recently I tried just eating white white rice, cauliflower, egg whites, vanilla shakes, and sugar. I lost my short term memory, I think. Did you just say something?   Did you ever find a purse you like?   I have 47 purses and I hate every goddammed one of them. I’m telling you, they give me hives. I usually end up dragging around the one I loathe the least on any given day. The one I’m using now sucks my phone into another dimension. I have to call myself to find it, but I can’t find my fucking phone. Of fucking course.   What do you think of reinvention?   I think it’s a crock of shit. It’s a term invented to give unemployed, clueless boomers like myself false hope. Yeah right, I’ll be a software developer! I’ll go back to school for biochemistry! In my dreams. I’m like Popeye. I yam what I yam.   You have a story in this collection about buying your first dildo at age 52. What took you so long?   First of all, that’s gross. Don’t tell people that! Oh yeah, it’s in the book. Anyway, my first dildo. Whatever. I’m a Luddite. Plus I’m cheap. But you know, you have to keep your options open. New horizons and all of that.  To finally answer your question, I was busy. That’s what took me so long. But then I kept getting invited to all these sex toy parties by desperately reinventing women. So I began to feel that peer pressure. It was like high school. OMG, Shelley bought the spinning pleasure frog with the tickly tips! You have to have it or you are just NOT in touch with your inner goddess. Some dreck like that. But then after I got my spinning frog thingie the thrill was gone pretty fast. For me it was like inline skates. Would have given my right arm to have them in 1998 but after a few spins around the ‘hood it was like, meh.",
  "genres": [],
  "author": "Erica Ferencik",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/17878834-hot-naked-and-awake"
}