{
  "title": "A Forgotten Kitten",
  "description": "Many readers enjoy Star Wars-esque stories of conflict on faraway planets, while other readers tend to stick to epic romances. Few authors have managed to combine the two genres in such a seamless way as Jessica A. Kong has in her Sea-anan Saga. She has created a highly complex story with fully developed characters, and the themes explored here are inarguably adult, yet the reading level required is no more than eighth grade. A Forgotten Kitten zips along at just the right pace, allowing the reader to digest the complexity of the plot and interrelation between the characters without having to think too hard. The story revolves around Sev, a young, handsome prince and member of a royal family who rises to become king of the Oceanan race. Sev is raised in the midst of a vicious family feud, but all seems worth it when his adoptive aunt gives birth to a beautiful little girl whom Sev falls instantly and irrevocably in love with. But when Sev’s planet collides with its own sun and collapses, he must bear the loss of his entire family, including his love as well as any memory of her.Areo, the heroine of the story, is that little girl that Sev fell for during his childhood. She is a human-feline hybrid who has grown to hate the royal family that her soul mate hails from. She undergoes a destructive event and space travel episode similar to Sev’s, and it is not too long before she has settled her new planet and with her fellow half-bloods, created a strong, thriving society. When she is brutally attacked by Daehog, everyone in her empire is scattered throughout the universe. Where does she land but the planet that Sev is currently occupying.What follows is a continually building conflict interlaced with one of the most fervently passionate love stories seen in these kinds of novels. Kong chooses not just to write about space travel, or war, or love, or family, or even racism; instead, she chooses to combine all of these classic literary themes into one amazing story. The result is a mysterious and ultimately deeply satisfying story that only leads to the craving for more from this gifted and astoundingly creative writer. Reading should always be enjoyable, especially when reading escapist literature, and Kong has remembered this and accomplished it without sacrificing plot or characterization. The task of any science fiction writer is to take alien, unbelievable concepts and present them in a way that convinces the reader they are plausible in reality, and Kong has certainly hit the mark with her second novel in this delightfully mystifying series.",
  "genres": [],
  "author": "Jessica A.  Kong",
  "average_rating": "4.74",
  "url": "https://www.goodreads.com/book/show/17878961-a-forgotten-kitten"
}