{
  "title": "The Most Famous Man in America: The Biography of Henry Ward Beecher",
  "description": "No one predicted success for Henry Ward Beecher at his birth in 1813. The blithe, boisterous son of the last great Puritan minister, he seemed destined to be overshadowed by his brilliant siblings—especially his sister, Harriet Beecher Stowe, who penned the century’s bestselling book Uncle Tom’s Cabin. But when pushed into the ministry, the charismatic Beecher found international fame by shedding his father’s Old Testament–style fire-and-brimstone theology and instead preaching a New Testament–based gospel of unconditional love and healing, becoming one of the founding fathers of modern American Christianity. By the 1850s, his spectacular sermons at Plymouth Church in Brooklyn Heights had made him New York’s number one tourist attraction, so wildly popular that the ferries from Manhattan to Brooklyn were dubbed “Beecher Boats.” Beecher inserted himself into nearly every important drama of the era—among them the antislavery and women’s suffrage movements, the rise of the entertainment industry and tabloid press, and controversies ranging from Darwinian evolution to presidential politics. He was notorious for his irreverent humor and melodramatic gestures, such as auctioning slaves to freedom in his pulpit and shipping rifles—nicknamed “Beecher’s Bibles”—to the antislavery resistance fighters in Kansas. Thinkers such as Emerson, Thoreau, Whitman, and Twain befriended—and sometimes parodied—him.And then it all fell apart. In 1872 Beecher was accused by feminist firebrand Victoria Woodhull of adultery with one of his most pious parishioners. Suddenly the “Gospel of Love” seemed to rationalize a life of lust. The cuckolded husband brought charges of “criminal conversation” in a salacious trial that became the most widely covered event of the century, garnering more newspaper headlines than the entire Civil War. Beecher survived, but his reputation and his causes—from women’s rights to progressive evangelicalism—suffered devastating setbacks that echo to this day.Featuring the page-turning suspense of a novel and dramatic new historical evidence, Debby Applegate has written the definitive biography of this captivating, mercurial, and sometimes infuriating figure. In our own time, when religion and politics are again colliding and adultery in high places still commands headlines, Beecher’s story sheds new light on the culture and conflicts of contemporary America.",
  "genres": [
    "Biography",
    "History",
    "Nonfiction",
    "Biography Memoir",
    "American History",
    "Religion",
    "19th Century"
  ],
  "author": "Debby Applegate",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/108457.The_Most_Famous_Man_in_America"
}