{
  "title": "When China Ruled the Seas: The Treasure Fleet of the Dragon Throne, 1405-1433",
  "description": "A hundred years before Columbus and his fellow Europeans began making their way to the New World, fleets of giant Chinese junks commanded by the eunuch admiral Zheng He and filled with the empire's finest porcelains, lacquerware, and silk ventured to the edge of the world's \"four corners.\" It was a time of exploration and conquest, but it ended in a retrenchment so complete that less than a century later, it was a crime to go to sea in a multimasted ship. In When China Ruled the Seas , Louise Levathes takes a fascinating and unprecedented look at this dynamic period in China's enigmatic history, focusing on China's rise as a naval power that literally could have ruled the world and at its precipitious plunge into isolation when a new emperor ascended the Dragon Throne.During the brief period from 1405 to 1433, seven epic expeditions brought China's \"treasure ships\" across the China Seas and the Indian Ocean, from Taiwan to the spice islands of Indonesia and the Malabar coast of India, on to the rich ports of the Persian Gulf and down the African coast, China's \"El Dorado,\" and perhaps even to Australia, three hundred years before Captain Cook was credited with its discovery. With over 300 ships--some measuring as much as 400 feet long and 160 feet wide, with upwards of nine masts and twelve sails, and combined crews sometimes numbering over 28,000 men--the emperor Zhu Di's fantastic fleet was a virtual floating city, a naval expression of his Forbidden City in Beijing. The largest wooden boats ever built, these extraordinary ships were the most technically superior vessels in the world with innovations such as balanced rudders and bulwarked compartments that predated European ships by centuries. For thirty years foreign goods, medicines,geographic knowledge, and cultural insights flowed into China at an extraordinary rate, and China extended its sphere of political power and influence throughout the Indian Ocean. Half the world was in China's grasp, and the rest could easily have been, had the emperor so wished. But instead, China turned inward, as suceeding emperors forbade overseas travel and stopped all building and repair of oceangoing junks. Disobedient merchants and seamen were killed, and within a hundred years the greatest navy the world had ever known willed itself into extinction. The period of China's greatest outward expansion was followed by the period of its greatest isolation.Drawing on eye-witness accounts, official Ming histories, and African, Arab, and Indian sources, many translated for the first time, Levathes brings readers inside China's most illustrious scientific and technological era. She sheds new light on the historical and cultural context in which this great civilization thrived, as well as the perception of other cultures toward this little understood empire at the time. Beautifully illustrated and engagingly written, When China Ruled the Seas is the fullest picture yet of the early Ming Dynasty--the last flowering of Chinese culture before the Manchu invasions.",
  "genres": [
    "History",
    "China",
    "Nonfiction",
    "World History",
    "Asia",
    "Historical",
    "Medieval"
  ],
  "author": "Louise Levathes",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/178801.When_China_Ruled_the_Seas"
}