{
  "title": "The Catastrophist",
  "description": "Heart of DarknessFew literary works have achieved the sustained, unflinching pessimism of Heart of Darkness, Joseph Conrad's haunting tale of one man's journey into the African subcontinent. One new novel that can justly make that claim is The Catastrophist, by the talented Irish writer/activist Ronan Bennett. Here, Conrad's classic tale is transmogrified by a century of irony, Westernization, and a tip of the hat to Graham Greene and John le Carré. Benett's Marlow is James Gillespie, an Irish historian turned novelist who travels to the Congo in 1959. Set against the death throes of the age of imperialism, the new nation's violent struggle for independence from Belgium provides ample opportunity for Gillespie to explore the dark territory of political and emotional engagement.Gillespie's Kurtz, the figure who draws him to the Congo and whose maddening attachment to the place both fascinates and repulses him, is Inès, a fiery Italian journalist, who pens fiercely pro-Congolese articles for a radical newspaper. Inès and Gillespie met in London at the house of Gillespie's publisher, and soon after, were heading to Ireland for a romantic getaway. Inès was smitten instantly (\"I am already loving you\" she whispers as they first make love), but Gillespie, considerably less headstrong, was slower to recognize his feelings. Following Inès to Léopoldville (Kinshasa), the Congolese capital, was his emotional plunge, his gesture toward commitment. But soon after his arrival, Gillespie realizes that he has been displaced from Inès's attentions by her devotion to Patrice Lumumba, the charismatic Congolese independence leader. Gillespie, on the other hand, is incapable of viewing the disorganized independence movement as anything more than an unfortunate farce; nor does he sympathize with the Belgians in Léopoldville, who live in cloistered luxury, walled off from the cité indigène -- \"where the blacks live\" -- by well-patrolled walls and their own willful obliviousness.Despairing over Inès's increasingly distant air, Gillespie befriends an American named Stipe, who is in the Congo to promote American security interests, as well as Stipe's loyal, ambitious driver, Auguste. Stipe feeds Gillespie information about the imminence of an uprising, allowing him to complete some lucrative freelance pieces, while Auguste shares his dreams about having an office on Fifth Avenue.These bonds prove fragile, however, and dissolve once the independence movement comes to a violent, chaotic boil. Inès's partisanship becomes even more pronounced, and she spends all her time at Lumumba's camp. Gillespie's articles alienate him from many of the Belgians, who refuse to consider the Congolese other than as mischievous children. Stipe and his Belgian companions, meanwhile, become fearful of Lumumba's Communist sympathies and begin unsavory efforts to undermine his authority, supporting the right-wing party of the pro-Western Mobutu Sese Seko instead. Auguste, who has become active in Lumumba's youth movement, dissociates himself from Stipe; entering into Lumumba's inner circle, he soon meets Inès. Inès and Auguste become lovers and Gillespie, after countless efforts to win her back, is forced to contemplate a world breaking up around him.The Catastrophist is primarily a story of failure, both of a crumbling political movement and of a doomed relationship. (There is little surprise about the former, even for those unfamiliar with Congolese history; in the opening scene of the book, Lumumba is captured by Mobutu after attempting to escape the country). Inès once charged Gillespie with being a \"catastrophist,\" one who believes \"it is always the end.\" He countered by claiming that \"if the problem is big&the only thing to do is leave it behind.\" As the events of the book lead inexorably to a series of personal and political catastrophes, Gillespie's pessimism seems only to be confirmed; and yet, tethered by his love for Inès, he cannot leave these catastrophes behind.Thus, surrounded by zealots, but insulated by a carapace of solipsism, Gillespie struggles futilely to maintain his position on the sidelines. Once embarrassed by melodrama and maudlin displays of affection, he finds himself begging Inès to take him back. And once so bitterly skeptical of Lumumba's efforts, he finds himself drawn into the struggle, forced to make a sacrifice for a cause he doubts, a self-consciously doomed gesture to win back Inès's love. For much of the book, Gillespie's presiding motto is a quote from Pushkin, \"Does a man die at your feet, your business is not to help him, but to note the color of his lips.\" But when he has an opportunity to enact that dictum, its guidance seems woefully inadequate. Gillespie's policy of detachment becomes the ultimate catastrophe. \"I was always too much a watcher,\" Gillespie laments at the close of the book. Indeed, one of The Catastrophist's finest ironies is that the journalist, Inès, has discarded all objectivity, while Gillespie, the novelist and narrator, insists his writing maintain a sense of distance. Bennett, too, is a watcher, his prose alert and deliberate, and yet for him, this policy of detachment works brilliantly. Much of the book's power derives from its implacable, steady tone, and many of its most stirring passages are the love scenes in which Gillespie's cool, measured narrative voice struggles against, and succumbs to, the eroticism and immediacy of the moment.This tactic does have its weaknesses, however; the climactic scenes of violence and brutality, depicting the aftermath of Mobuto's coup, fall flat, as do Gillespie's ruminations on his love of literature. In both these cases, the crescendo in narrative intensity feels vaguely inauthentic. But on the whole, Bennett has given us a superb book -- part suspense thriller, part psychological study. It adds its capable voice to that unsettling opening of Conrad's own masterful tale: \"And this also has been one of the dark places of the earth.\"Benjamin Soskis",
  "genres": [
    "Fiction",
    "Africa",
    "Historical Fiction",
    "Irish Literature",
    "Book Club",
    "Literature",
    "Contemporary"
  ],
  "author": "Ronan Bennett",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/178803.The_Catastrophist"
}