{
  "title": "Buddhism Skillfulness and Mastering Life. Dharma Stories Ancient and Modern",
  "description": "DISCOVER THE TRUE MEANING OF BUDDHISM THROUGH ANCIENT BUDDHIST STORIES, CONTEMPORARY EVENTS AND EVEN HOLLYWOOD MOVIES!STORYTELLING HAS BEEN THE PRINCIPAL MEANS OF TRANSMITTING BUDDHIST TEACHINGS since the time of the Buddha. The intention behind these stories, and my commentary attached to each, is to illuminate the central teachings of Buddhism.Many of the stories are dramatic and occur at critical moments and turning points in the lives of the people involved. They confront the death of a loved one, grief, or the immediate prospect of their own death, loss of status, feelings of hopelessness and other common problems. Buddhist teachers often address these problems and crises through the medium of stories.The stories in ‘BUDDHISM, SKILLFULNESS AND MASTERING LIFE’ represent the full range of the kind of stories found in the Buddhist tradition. They include textually based stories apparently told by the Buddha himself and found in the Pali Canon. There are stories about or from recent or contemporary Buddhist teachers as well as an incident that I witnessed personally.There are stories from Hollywood movies, such as ‘Dirty Harry’ that convey a message endorsed by Buddhism, even if the characters are not Buddhist. Finally, there is a story from Leo Tolstoy, who was a mystically orientated Christian, not a Buddhist, but his message in the story is equally appropriate to Buddhism. These non-Buddhist sources serve to clarify the universality of the issues that are dealt with in Buddhist teachings; human suffering, loss, death, conflicting loyalties, dealing with prejudice and inequalities of wealth and privilege.My wish is that in sharing these stories, readers will find them as challenging and inspirational as I have. My hope is to enable you to engage with Buddhism as a living discipline and tradition.FORMATS AVAILABLE: Kindle(Amazon)or EPub/PDF  http://www.taichi-exercises.comAbout Stewart…DR STEWART McFARLANE IS A WELL-KNOWN SCHOLAR of Chinese Religions and Buddhism, and a teacher of Chinese Martial Arts. He was Director of Asian Studies at Liverpool Hope University until his retirement in 2004.TRAINING IN WING CHUNHe first trained in Wing Chun kung Fu as a student, with Hong Kong students in 73-74 at the height of Bruce Lee’s fame, and the Wing Chun/Jeet kune Do craze. After finishing his degree, he joined the Soto Zen community (Order of Buddhist Contemplatives) at Throssel Hole Priory in Northumberland.THE BRUCE LEE CONNECTIONIn 1975, he was studying Chinese at Durham University one of his Chinese teachers was Rose Li, a very good Yang style t’ai chi teacher. He trained with her from 1975-77. When he started lecturing at Lancaster University, he trained in Wing Chun under Sam Kwok, his teacher Yip Chun & eventually with Lo Man Kam in Taiwan. (Yip Chun is Yip Man’s son, Lo Man Kam is Yip Man’s nephew, Yip Man was Bruce Lee’s Wing Chun teacher in Hong Kong.)PROTECTING THE DALAI LAMAIn 1995, he was asked to form a security team of martial artists and conflict resolution specialists to help provide the security protection for His Holiness the Dalai Lama, which they did from 1996 to 2004 whenever he visited the UK.BBC DOCUMENTARYIn 1997 he made SHADOW BOXING ON THE PATH TO NIRVANA, a 4-part documentary on the spiritual dimensions of Martial Arts produced by the BBC WORLD SERVICE, travelled extensively for that and had the chance to train with some of the world’s leading martial artists such as Dan Inosanto (Bruce Lee’s friend & colleague, JKD & Philippine martial arts), Stephen Hayes (Ninjutsu), Mary Heiny (Aikido), Bob Frager (Aikido), Lily Lau (Kung Fu), Jimmy Wong (Tai ji), Master Shih Yen Tzu of the Henan Shaolin Temple, and a number of very good Chinese T’ai ji masters in Malaysia.LIVING WITH ELEPHANTSNow living in Thailand, he finds that the climate and regular contact with elephants are highly therapeutic. He speaks and reads Thai and is now a regular contributor as a lecturer at the Siam Society in Bangkok and a number of research and cultural centres in Thailand.",
  "genres": [],
  "author": "Stewart McFarlane",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/17881383-buddhism-skillfulness-and-mastering-life-dharma-stories-ancient-and-mod"
}