{
  "title": "Never Can Tell",
  "description": "Never Can Tell, a New Adult Romance Novel Recommended for Ages 18 and UpBook #4 in the series beginning with \"Tasting Never\"(Books #1-#5 are available now! Reading list included below.)\"This is love. It's that simple.\"Some stories are Never finished being told. After all, we're all victims of heartache and strife at some point. Maybe I'm a little more susceptible to both, but I've got an ace up my sleeve. I've got Ty McCabe. He's helped me survive a lot. More than I ever thought possible. We've come a long way together, but we can't stop now. What's that old saying? Don't rest on your laurels? Well, I'm not resting and neither is he. Life didn't even give us that option. We've got problems. Big ones. Let's see if we can do this, survive the downs and get back to the ups. Guess only time will tell.“...We're just one. Just one, f*cking, twisted bit of soul in love.”*Never Series Reading Order*Book #1: Tasting NeverBook #2: Finding NeverBook #3: Keeping NeverOR Books #1-#3 in one volume, \"Tasting, Finding, Keeping: The Story of Never\"Book #4: Never Can TellBook #5: Never Let Go*174 PAGES IN TRADE PAPERBACK SIZENEVER CAN TELL EXCERPT:When I glance up into the mirror, I look young, too young to be a mother. My face is soft and my eyes are hard. I question my own strength and then glance away. “If Jade wants to see that piece of sh*t, what can I do to stop her? I might ask her why, but that's all I can do. I doubt she'll even answer me.”\tTy doesn't say anything, but he reaches out and brushes my hair back with his rings, all twelve of them, glittering and sparkling like rubies. They match the piercings in his face. Gotta love a color coordinated badass.\tNeither of us misses how small and tight this bathroom is, how close we are, how hard he was in the kitchen.\t“Ty,” I warn as he comes up behind me and slides his fingers under my shirt, up my belly, cupping my tender breasts with strong hands. “So not fair,” I groan, reaching up and smacking the fan. It coughs to life and is loud as f*ck, blocking any sounds from escaping this little room. “You can't touch those.” My c*nt is pulsing and my heart is pounding in my skull. Down below, I know I'm soaking wet.“Why not?” he whispers against my ear. “It'll make you feel better.”",
  "genres": [
    "New Adult",
    "Romance",
    "Contemporary",
    "Erotica",
    "Contemporary Romance",
    "College",
    "Family"
  ],
  "author": "C.M. Stunich",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/17881358-never-can-tell"
}