{
  "title": "Beautifully Broken",
  "description": "Good girl Lindsay Cramer has her life completely in order, and she keeps her goals on a checklist -- obtain scholarship to Ivy League University, finish undergrad, and move on to med school. She’s worked hard to get where she is, and she’s determined not to let anything – or anyone -- get in her way.Until she meets Justin Brown. JB is gorgeous, and the kind of guy who is all wrong for Lindsay -- the kind of guy who is all wrong for anyone . He drinks, he fights, and he has a secret past Lindsay’s not so sure she wants to know about.But when the two of them are together, Lindsay can’t help but lose herself in him. It’s the way his eyes burn when he looks at her. The way his smile makes her dizzy. The way his hands feel on her body.Soon, Lindsay and Justin are completely addicted to each other. But when their dangerous game culminates with Lindsay having to make a shocking choice, will she be able to keep JB in her life? And if so, will she lose everything in the process?***BEAUTIFULLY BROKEN is the second episode of a new series, ADDICTED TO YOU, with episodes releasing every week. It is for a mature audience, due to sexual situations and language.***EXCERPT:He led me down to the water, and we stood on the dock. “We’re going swimming.”I gaped at him. “Are you crazy?”“It’s hot out.”“So?”“So when it’s hot out, you go swimming.” He grinned and then, like it was nothing, he reached down and pulled off his shirt. His arms were tan and cut, his chest chiseled and smooth. His six pack flexed as he tossed his shirt onto the dock, and I started to feel a little dizzy.“I’m not going in the water.”“Why not?”“Because it’s illegal!”He grinned. “You’ve never done anything illegal before?”“Not really.”“Well, let me tell you a secret about doing things that are illegal.” He motioned me toward him, and I took a tiny step. I didn’t trust myself to be close to him. There was an air of excitement and anticipation thrumming below the surface of our interactions, and I didn’t know what he was going to do – kiss me? Throw me in the water? It was scary and wonderful at the same time.“Closer,” he said, teasing.I moved closer.He rolled his eyes, then closed the gap between us, leaning down so he could whisper in my ear. “Ready for the secret?” His breath tickled the skin of my neck, and it was so warm it made the summer night air feel cold. A shiver skittered down my spine.“Ready,” I breathed.“Things are only illegal if you get caught. And I never get caught.”",
  "genres": [],
  "author": "Lucy Covington",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/17882172-beautifully-broken"
}