{
  "title": "Tales of Iceland or \"Running with the Huldufólk in the Permanent Daylight\"",
  "description": "When American author Stephen Markley was a fresh-faced, impressionable university student in Ohio, he saw Quentin Tarantino describe a trip he’d taken to Iceland.“Supermodels working at McDonald’s,” said Tarantino of the Icelandic.Markley never forgot those words.Seven years later, Markley set out with two friends for Iceland, and adventure would ensue. The three young men found a country straddling Europe and North America, recovering from its 2008 economic crisis, struggling to regain its national identity, influenced by the entire globe yet trafficking in its singular Icelandic sagas and legends.With Tales of Iceland, Markley delivers the fastest, funniest memoir and travelogue of an American experience in Iceland.Beware: You will NOT learn how to say \"Which way to the potato farm\" in the Icelandic language. Nor will you learn how to locate the finest dining options in Reykjavik, or the best opera house. This is not that kind of travel book. Markley and his two irrepressible twenty-something American pals do not like opera, had no money to eat much besides eggs and skyr, and learned only how to say “Skál!” “Takk,” and “Skyr.”The author of the growing cult classic Publish This Book, Markley dives headfirst into Icelandic history and culture while not ignoring all those weird stories found in the best travel writing: a road trip around the golden circle; partying in Reykjavík on National Day; drinking late into the night with gorgeous Icelandic women; hiking over pristine white glaciers featured in Game of Thrones; encountering a drunk, raging Kiefer Sutherland; crashing in the band Of Monsters and Men’s old apartment; getting hit on by a Wiccan in the famed Blue Lagoon; searching for signs of Icelandic “hidden people;” interviewing Jón Gnarr, the actor-comedian who accidentally became the funniest mayor in the world (by vowing not to form a coalition government with anyone who hadn’t watched all five seasons of The Wire); and countless other travel tales of youthful irreverence. If you’re about to pick up this book about Iceland, just know that it will be a little foul. Markley also brings his twisted sense of humor and combative social conscience to bear on why there are no prostitutes in Iceland, how fishing quotas planted the seeds of an economic doomsday, and why one should never invite Icelanders over for an after-party.Tales of Iceland is the indispensable travelogue and required reading for anyone wishing to visit this strange, beautiful, and remarkable country.As Markley reflects: “All I can say with full credibility is that I went to Iceland and kind of fell in love with the place.”Tales of Iceland tells how it happened.A Note from the Publisher, GiveLiveExplore:Travel guides are becoming static and stale. Savvy travelers in today’s connected world are better served using free, curated websites like TripAdvisor and Lonely Planet, and personalized travel tips are better garnered by polling friends, meeting fellow travelers abroad, or talking to locals on the street.While travel information has become a commodity, we believe good, honest tales are in short supply.Tales of Iceland is our answer. It’s the anti-guidebook -- a fun, engaging story with useful cultural context to compliment your own travel experiences. Our hope is not only that this travelogue becomes the book travelers read before or during a trip to Iceland, but also that it inspires more to explore and live out his or her own tales of Iceland.",
  "genres": [
    "Travel",
    "Nonfiction",
    "Humor",
    "Memoir",
    "Scandinavian Literature"
  ],
  "author": "Stephen Markley",
  "average_rating": "3.37",
  "url": "https://www.goodreads.com/book/show/17882286-tales-of-iceland-or-running-with-the-hulduf-lk-in-the-permanent-dayligh"
}