{
  "title": "The Natural Stress Response",
  "description": "Amazon Best Seller in Women's Health and Stress ManagementSimple 5 Week Plan for Stress Relief and PreventionAre you part of the 70% of Americans that stressed and sick of it?! The American Psychological Association found that stress is a leading cause of many chronic diseases including high blood pressure and cardiovascular diseases. While stress is a part of most American’s lives, being caused by work, money, relationships, family, and health, only 30% of Americans believe they are effectively managing stress. In this book, Holistic Health Counselor Dr. Rachel Frank teaches you the program she uses with her health coaching clients.Imagine...Managing stressful event with ease so you can keep calm and move onReducing your blood pressure and risk for cardiovascular diseaseFinally getting amazing restful sleep and waking up refreshed and alertReducing your stress without taking medications of paying for costly doctors visitsTaking your health and wellbeing into your own hands and SUCCEEDING!!!!˃˃˃ Anyone can be stress freeDr. Rachel will teach you what what stress is, the two types of stress, the health impact of stress, 5 stress management techniques you can do NOW at home, and provide a week by week plan for implementing those techniques. You will learn meditation/ the relaxation response, the law of attraction, how food impacts mood, developing a successful sleep strategy, and how to use aromatherapy for yourself.˃˃˃ Learn a variety of natural stress relief techniquesYou will learn meditation/ the relaxation response, the law of attraction, how food impacts mood, developing a successful sleep strategy, and how to use aromatherapy for yourself. Join Dr. Rachel and her clients in taking control of the stress in your life using the 5 week training program in The Natural Stress Solution today!",
  "genres": [
    "Nonfiction",
    "Self Help"
  ],
  "author": "Rachel Lynn Frank",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/17882212-the-natural-stress-response"
}