{
  "title": "The LIEography of Harry Houdini: The Absolutely Untrue, Totally Made Up, 100% Fake Life Story of the World's Greatest Escape Artist",
  "description": "\"This is the funniest book I've read since Dan Gutman's My Weird School series.\"--Dan Gutman Fans of Captain Underpants and the Wimpy Kid series will love the silly, slapstick comedy in the parody The LIEography (™) of Harry Houdini. Get ready to split a side and roll on the floor laughing with Alan Katz's satirical look at history's greatest escape artist.Magic is magical. And humor is humorous. Put them together and what have you got? Nothing… unless you read The LIEography (™) of Harry Houdini. And when you do, you’ll be giggling and laughing faster than you can say, “Presto Chango!” Readers everywhere agree: this is the funniest book ever written with this title! You have to say “The Great” Harry Houdini. You have to. Really. It’s just the way it is.Because if you do leave out “The Great” when talking about him, strange things happen. Seems mystical, almost crazy, to be sure. But recent history shows that if you don’t add “The Great” to his name, you might have trouble talking, or even typing.Find out what else didn't happen in The LIEography of Harry Houdini!More about the series:Perhaps you’ve heard that Babe Ruth “called his shot” before hitting a mammoth home run. Or learned about Columbus’s voyage to prove the earth was round. Maybe you’ve been told of the triumphs of people such as Thomas Edison and Houdini. You may know some of the facts about these legendary figures. But you’ve never been able to read their totally made up, absolutely untrue, 100% fake life stories. Until now.Listen, why just focus on the historical…when you can have a whole series about the hysterical? And that’s the whole idea behind…LIEographies. Each edition of LIEographies hilariously examines the outrageously fake lives of the greats. Read a LIEography and you’re sure to want to read another…and another…and another. (And chances are you’re also gonna want to read the true stories of these amazing folks!)",
  "genres": [],
  "author": "Alan Katz",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/17882575-the-lieography-of-harry-houdini"
}