{
  "title": "Reflection of the Gods",
  "description": "\"This is the story of how my third life began. And how my second life ended. They’re the same thing, you know—endings and beginnings. We’re taught to believe they’re different, but in order for one thing to begin, something else must end.\" Newly divorced Das MacDermott longs for a fresh start. As he packs up and prepares to move out of the city, he spots a young woman being held at gunpoint by three men. Despite being outnumbered and unarmed, Das does his best to intervene. Once liberated, the victim seems oddly ungrateful, but on an apparent whim decides to join Das in his new life in rural Ontario. Aislinn, as she is called, returns the favour; with her encouragement and support, his start-up photography business takes off, and more importantly, Das is saved from loneliness and self-doubt. Das, however, is never quite able to fully dismiss the contrary aspects of Aislinn’s nature, and is strictly forbidden from asking about Aislinn’s past. All seems too good to be true, and indeed it is. Aislinn’s unusual talents and odd behaviour, unbeknownst to Das, come from her demigod status. Aislinn is half-Sidhe, daughter of Fionvarra, Ireland’s fairy king, and a human woman. Sidhe wars have so disrupted the mortal world that Aislinn has joined with other immortals in an effort to permanently separate it from Tir N’a Nog, the fairy realm.Born in ancient Ireland, Aislinn spends millennia as the plaything of the cruel and narcissistic gods. The pain of being neither human nor Sidhe is offset by her relationship to the Fir Bolg, another race of fair folk who take pity on her lonely state; and the refuge she takes in being Das’s lover and protector. As Das comes to accept the possibility that Aislinn belongs to a supernatural world, he discovers that the two worlds are set to collide in a way that may mean the destruction of all humanity.",
  "genres": [
    "Urban Fantasy"
  ],
  "author": "Lisa Llamrei",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/17882755-reflection-of-the-gods"
}