{
  "title": "The Ghost of the Mary Celeste",
  "description": "A captivating, atmospheric return to historical fiction that is every bit as convincing and engrossing as Martin's landmark Mary Reilly .In 1872 the American merchant vessel Mary Celeste was discovered adrift off the coast of Spain. Her cargo was intact and there was no sign of struggle, but the crew was gone. They were never found.This maritime mystery lies at the center of an intricate narrative branching through the highest levels of late-nineteenth-century literary society. While on a voyage to Africa, a rather hard-up and unproven young writer named Arthur Conan Doyle hears of the Mary Celeste and decides to write an outlandish short story about what took place. This story causes quite a sensation back in the United States, particularly between sought-after Philadelphia spiritualist medium Violet Petra and a rational-minded journalist named Phoebe Grant, who is seeking to expose Petra as a fraud. Then there is the family of the Mary Celeste 's captain, a family linked to the sea for generations and marked repeatedly by tragedy. Each member of this ensemble cast holds a critical piece to the puzzle of the Mary Celeste .These three elements—a ship found sailing without a crew, a famous writer on the verge of enormous success, and the rise of an unorthodox and heretical religious fervor—converge in unexpected ways, in diaries, in letters, in safe harbors and rough seas. In a haunted, death-obsessed age, a ghost ship appearing in the mist is by turns a provocative mystery, an inspiration to creativity, and a tragic story of the disappearance of a family and of a bond between husband and wife that, for one moment, transcends the impenetrable barrier of death.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Mystery",
    "Historical",
    "Paranormal",
    "Supernatural",
    "Fantasy"
  ],
  "author": "Valerie Martin",
  "average_rating": "3.13",
  "url": "https://www.goodreads.com/book/show/17883956-the-ghost-of-the-mary-celeste"
}