{
  "title": "The Muslims are Coming!: Islamophobia, Extremism, and the Domestic War on Terror",
  "description": "Death came instantly to Imam Luqman, as four FBI agents fired semi-automatic rifles at him from a few feet away. Another sixty officers surrounded the building on that October morning, the culmination of a two-year undercover investigation that had infiltrated the imam’s Detroit mosque. The FBI quickly claimed that Luqman Abdullah was “the leader of a domestic terrorist group.” And yet, caught on tape, he had refused to help “do something” violent, as it might injure innocents, and no terrorism charges were ever lodged against him.Jameel Scott thought he was exercising his rights when he went to challenge an Israeli official’s lecture at Manchester University. But the teenager’s presence at the protest with fellow socialists made him the subject of police surveillance for the next two years. Counterterrorism agents visited his parents, his relatives, his school. They asked him for activists’ names and told him not to attend demonstrations. They called his mother and told her to move the family to another neighborhood. Although he doesn’t identify as Muslim, Jameel had become another face of the presumed homegrown terrorist.The new front in the War on Terror is the “homegrown enemy,” domestic terrorists who have become the focus of sprawling counterterrorism structures of policing and surveillance in the United States and across Europe. Domestic surveillance has mushroomed—at least 100,000 Muslims in America have been secretly under scrutiny. British police compiled a secret suspect list of more than 8,000 al-Qaeda “sympathizers,” and in another operation included almost 300 children fifteen and under among the potential extremists investigated. MI5 doubled in size in just five years.Based on several years of research and reportage, in locations as disparate as Texas, New York, and Yorkshire, and written in engrossing, precise prose, this is the first comprehensive critique of counterradicalization strategies. The new policy and policing campaigns have been backed by an industry of freshly minted experts and liberal commentators. The Muslims Are Coming! looks at the way these debates have been transformed by the embrace of a narrowly configured and ill-conceived antiextremism.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Islam",
    "Religion",
    "History",
    "Race",
    "Social Justice"
  ],
  "author": "Arun Kundnani",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/17884088-the-muslims-are-coming"
}