{
  "title": "Remembering America Looking Back at the Last Innocent Age",
  "description": "Do you remember Drive-in Movies, Spider Bikes with sissy bars and baseball cards in the spokes? Do you remember Tiger Beat magazine, Bobby Sherman and Davey Jones? Did Sunday Evening mean \"Mutual of Omaha's Wild Kingdom\" and \"The Wonderful World of Disney\"? Do you remember a time and place in America when a kid could go outside on Saturday morning and stay out all day and nobody worried and nothing bad happened? When we walked to school, ran through the open yards where our moms were hanging out the clothes on a clothesline? Do you remember when neighbors cared about each other because they really knew each other? Holding your baseball cap over your heart and singing the National Anthem on opening day of Little League because being American meant loving your country and showing respect? Do you remember \"The Carol Burnett Show\" \"Laugh-in\" and \"Happy Days\"? When scary movies had legendary characters like Dracula or the Mummy or the Wolfman? Do you remember when our country was innocent...and so were we? \"Remembering America: Looking Back at the Last Innocent Age\" is a wonderful, sentimental, humorous, and emotional journey that takes one last look at the childhood of the last of the Baby-Boomers and their little brothers and sisters. If you grew up in the 60's and 70's, you'll fall in love with every story. The images are sweet and reminiscent of a different time...and what most would say was a better time. Author Craig Daliessio chronicled these wonderful stories during his own time of turmoil and homelessness after losing his career in the collapse in 2008. The memories, and images and words became his refuge during the most difficult and desperate time in his life. In his own words, Craig tells the \"story of the story\" \"The only stories that didn't make me laugh with their silliness, were the ones that made me cry with their poignant sweetness. It was such a great time and a great period in America. My neighbors were my family and my friends and I walked together into adulthood with a bond that my own daughter will never know. I set out to simply chronicle the past in an effort to get a new grip on the future. What I wound up doing was revisiting the best time of my life and an America I miss more each day.\" It's an engaging, wistful, wonderful voyage to a sweet place in the hearts of those who were lucky enough to have grown up in \"The Last Innocent Age\"",
  "genres": [
    "Nonfiction"
  ],
  "author": "Craig Daliessio",
  "average_rating": "4.71",
  "url": "https://www.goodreads.com/book/show/17884843-remembering-america-looking-back-at-the-last-innocent-age"
}