{
  "title": "Something to Believe In",
  "description": "She's nothing he expected. He's nothing she wanted. She's filthy, guilty, damaged. He's broken, lost, seeking redemption. Tragedies, decisions, and coincidences bring Mackaela Stone and Simon Silver together in a way neither imagined. They have to trust, they have to have faith, they have to find something to believe in. *This book is intended for mature readers. Adult content including sexual situations and language.*Learning how to trust in someone is difficult, giving them your already broken heart is nearly impossible.Mackaela Stone looks the part of every normal twenty one year old girl, but she hides a lot of secrets. Running from the things that have haunted her for most of her life, a snowball effect of being forced into adulthood, nearly losing her life at the hands of her mother, and being forced to drop out of high school, she is left dejected and isolated.She lives in a world run by her best friend Mickey Silver. Where drugs are a thriving business, violence is second nature, and watching your back comes with the territory, it has been ingrained in Mackaela to shut down all sense of feeling or ambition and just exist.Simon Silver is your typical good looking guy with dark hair, emerald eyes and a few tattoos etched across his perfect body. He reaches out to his brother Mickey to get back on his feet after being left homeless and hopeless after a devastating loss and misunderstanding. When he meets the girl who is Mick's best friend he is automatically fascinated, little does he know that she is tougher than meets the eye and not anything like the other girls from his past. He knows there is more to her than the strong exterior she hides behind. Assuming he is a spoiled rotten “pretty boy”, Mackaela refuses to open up to Simon, let alone give him her name.After yet another tragedy is thrust her way, Mackaela finds an unexpected comfort in Simon who is all too familiar with the pain she faces. Forming an intense bond and undeniable attraction, they discover how much they need each other. When it is difficult to find light in the darkness and you have to fight like hell to chase the ghosts that haunt you, sometimes facing your fears can be the best thing for you. You grow strong, you find yourself, and maybe, just maybe, you’ll find something to believe in.",
  "genres": [
    "New Adult",
    "Romance"
  ],
  "author": "M.K. Oien",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/17886165-something-to-believe-in"
}