{
  "title": "Soeis",
  "description": "\"Do I deserve love again when I have done nothing but murder? And when again I do find him, will there be anything of me left to give?\"Though she treasures her homeland of Ireland, Aislinn only knows she must find escape from the painful memories. Not knowing where she is heading, her intuition beckons her to Italy. Perhaps, she will resume her long ago dreams of becoming a famous violinist— such a thing would be possible there. But that was before her existence had been altered by her love for Donovan. How can those old dreams possibly even matter anymore— when she has lost everything that did matter?Barely sustaining herself in the underground of Florence, Aislinn is found by a couple of stunning seasoned vampires who offer to take her under their wing and demonstrate to her how a Vampiress should be conducting herself. While relieved to be taken from her dreary homeless existence and to be living in their beautiful old villa, she finds acclimating to their régime of seducing their helpless male prey with the lure of sexual promises to be inflicting turmoil on her conscience. There is one catch. Aislinn is truly enticed by Katja, the angelic Hungarian golden-haired Vampire. When Katja seduces her, Aislinn is awakened to pleasures she never imagined existed before.And she wants more. Much more... Even as she battles against everything that they are— and in turn, everything she is becoming—Aislinn cannot help but be overcome with the intense sexual desire, as well as the bloodlust of their realm. Determined to find her love reincarnate once again—as she avowed to him as he lay dying in her arms—she is struggling between losing herself and preserving her virginity in the midst of these increasingly overwhelming desires. Then, one day, Aislinn is certain she glimpses and catches the scent of her love. With this new driving force, she is desperate to be with him again. But she knows she must be vigilant in safeguarding her secret. It is vital that she finds him before they do and relish turning him into their next victim.When her cohorts imprison Aislinn in the dungeon, she sinks into despair. Now, how will she ever find him? Worse yet, trapped there, how will she protect her love from them?What Aislinn does not know is that she possesses powers of which she is unaware. Will she discover them in time to save herself—and her one true love?Warning: Contains steamy Sensuality & Explicit Sexuality. Not intended for Readers below the age of Eighteen!",
  "genres": [
    "Paranormal Romance",
    "BDSM"
  ],
  "author": "Rosalind Scarlett",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/17886213-soeis"
}