{
  "title": "The Awakening of Celeste",
  "description": "“I never fathomed I would know such immense pleasure as he has shown me. I might even be happy, if only I can acclimate to this way of life.”The year is 1499, Morocco.While dreaming of returning home to receive the expected proposal of Mathieu, young Celeste is instead sold to a procurer for the Sultan by her parents while on holiday to Rabat, Morocco from Paris, France.She is scared and very angry. The other harem women dote on her and prepare her to be presented to the Sultan, instructing her on the ways of love. Her encounter with him is better than she feared and he makes love to her gently, introducing her to her first pleasures of the flesh, holding her in his arms the duration of the night.In the afterglow of passion, Celeste begins to think perhaps her life will not be so bad. She thinks she has never felt so loved, so alive. He continues to call for her several days in a row. Her feelings escalate and she believes she is truly in love for the first time.Then one day she is called into the Sultan’s chamber, along with two other women and expected to perform with them. Disgusted and confused, Celeste must watch him pleasure and be pleasured by the other women, as well as participate if she wishes to remain in his favor.When she becomes pregnant, he seems overjoyed, and she is delighted to be able to give him a child. But will Celeste be able to continue to please him or will her jealousy get the better of her? Will she ever truly adjust to life as a harem wife?'The Awakening of Celeste' is an Erotic Novella focusing on an individual character from Soeis, Book II of the Anam Céile Chronicles, a series which centers around true love, soul mates, self-discovery, loss, vampires, lust, and the faith in reincarnation set in the lush backdrops of rugged Ireland, beautiful, culturally rich Venice and Florence, Italy, France and Morocco, amongst others. It can be read alone or in conjunction with the series.Warning: Contains steamy Sensuality & Explicit Sexuality. Not intended for Readers below the age of Eighteen!",
  "genres": [
    "Harem"
  ],
  "author": "Rosalind Scarlett",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/17886234-the-awakening-of-celeste"
}