{
  "title": "Switch! The Lost Kingdoms of Karibu",
  "description": "Alternate cover edition for ASIN B009H28446. A young adult fantasy adventure about magic, friendship and bravery, but also about bad judgement, rascally witches and thoroughly irresponsible adults.Trouble is brewing in the secret African rift valley of Karibu and Gogo Maya, the witch, and her leopard familiar are about to make matters worse. Of all the dubious magic tricks in her repertoire, they choose a risky ‘switch’ she’s been working on, to escape from somebody lurking in the forest. Unfortunately they overshoot, switching right out of Karibu and drawing an ordinary Zimbabwean boy into the vacuum they left behind them. The whole disaster that followed might have been averted if another boy had not gone and sucked up what was left of the witch’s power, leaving her too weak to switch back again. CPR, the daft boy called it. He should know better than to risk kissing a witch.If you had to choose between Joe’s two best friends, or his fifteen-year-old cousin, Ethan, to lead an adventure into the bush to rescue him, Ethan would be the last one you’d pick because, well … he’s useless that way. Yet, the witch’s leopard inexplicably chooses him, and starts issuing instructions right into his head. Apparently he’s Joe’s best hope because he has absorbed some of the witch’s questionable magic powers. Powers which might come in handy if he ever learns how to wield them, and if he can endure the painful backlash he suffers every time he tries.In a world that quite literally defies belief, where magic seeps into the drinking water for anyone to use or abuse, and the terrain is impossible to navigate without help from extremely risky sources, this is the tale of Ethan’s struggle to reach his cousin, Joe, before Joe falls into the wrong hands and gets himself killed.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Adventure",
    "Humor",
    "Magic",
    "Middle Grade",
    "Mythology"
  ],
  "author": "Karen  Prince",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/17886664-switch-the-lost-kingdoms-of-karibu"
}