{
  "title": "Perfect Glass",
  "description": "This is a gorgeous love story, but not the kind you're expecting. PERFECT GLASS is full of depth and dimension, and is a profound look at the longing for a place to belong. Kurk's ability to put readers into the minds of Henry and Meg as they struggle to come of age is a powerful thing.--Jennifer Murgia, author of the Angel Star series and BETWEEN THESE LINESPERFECT GLASS is Kurk's eloquent take on seeing and celebrating beauty in everyday life. This story will shift your thinking on what it takes to love well, on how fear, loss, and passion can turn into a powerful journey of self-discovery.--Stephanie Morrill, author of The Reinvention of Skylar Hoyt series and THE REVISED LIFE OF ELLIE SWEETPERFECT GLASS is a breathtaking look at what it means to love, and not just romantically. The genuine, raw emotion in this book makes your heart beat faster.--Nicole O’Dell, author of The Diamond Estates series and the Scenarios for Girls series.This is a book you absorb. Kurk’s writing is solid, fragile and reflective, just like glass. Throughout their separation, Meg and Henry learn that answers aren’t easy or obvious, and solutions are rarely where you look for them. Instead clarity appears in the unexpected—in ways too beautiful to predict or explain.--Laura L. Smith, author of IT’S COMPLICATED and IT’S OVER----------------------------\"I couldn’t stop crying because it was so intimate, in that way I always thought being physical with him would feel. If someone had walked in they might have thought Henry was barely touching me. I knew the truth of it.\"In this sequel to GLASS GIRL, things get messy when Meg Kavanagh gets involved—first with Jo Russell, the eccentric old artist, and then with Quinn O’Neill, the intriguing loner who can’t hide how he feels about Meg. Her senior year isn’t turning out like she planned it, but sometimes the best parts of life happen in the in-between moments. And Henry will be home soon, right?He commits to one year in an orphanage that needs him more than he ever dreamed. Thousands of miles from Meg and the new punk who has fallen for her, and absent from the ranch that’s in his blood, Henry Whitmire finds out what it means to trust. When you’re so far from home, it’s terrifying to realize you’re not who you thought. But the perfect glass of calamity makes the best mirror.An identity crisis, long distance love, new temptation, and growing pains teach Henry and Meg how to hang onto each other and to what really matters.From YA author Laura Anderson Kurk comes the sequel to Glass Girl, a lyrical, multi-generational story about love that teaches, loss that haunts empty rooms, and reunions that feel like redemption.---------------------------------Laura Anderson Kurk writes unconventional and bittersweet contemporary YA. Her debut novel, Glass Girl, and its sequel, Perfect Glass, are available now from Playlist Young Adult Fiction. Laura lives in Texas with her husband and two children.",
  "genres": [
    "Romance",
    "Contemporary",
    "Fiction",
    "Young Adult",
    "Christian",
    "M F Romance",
    "Christian Fiction"
  ],
  "author": "Laura Anderson Kurk",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/17887151-perfect-glass"
}