{
  "title": "Механизмите на удоволствието: Защо харесваме нещата, които харесваме",
  "description": "Целта на тази книга е да обясни същността на удоволствието, като проследи корените и развитието му при отделните субекти и еволюционния му произход в нашия биологичен вид.Психологът Пол Блум защитава две твърдения, които обикновено не вървят ръка за ръка: Първо, че всекидневното удоволствие е дълбинно и трансцендентално, и второ, че то е израз на еволюцията ни като човешки същества. Като тези позиции на пръв поглед си противоречат. Ако удоволствието е задълбочено, то би трябвало да се основава на култура и ерудиция. Ако пък е продукт на еволюцията, би трябвало да е просто; би трябвало да сме„програмирани“ да реагираме по определен начин на определени стимули, което е в основата си сетивно, физическо и повърхностно – с една дума, елементарно.Пол Блум е наясно, че твърденията му в тази книга – че удоволствието се основава на дълбоки интуитивни подтици, че е интелигентно и в същото време, че е възникнало в резултат на еволюцията и затова е универсално и до голяма степен вродено– са необичайни, но верни и от голямо значение. Пол Блум подкрепя своите твърдения с многобройни интересни наблюдения и примери.Удоволствието не е проста работа. Нашите желания, предпочитания и вкусове ни отвеждат отвъд симетрията на красивите лица, отвъд захарта и мазнините в храната, отвъд великолепието на картините. Защо някои мъже са толкова привлечени от девствениците? Защо средностатистическият американец прекарва повече от четири часа дневно пред телевизора? Защо абстрактното изкуство се продава за милиони долари? Защо намаляваме, когато шофираме, за да позяпаме кървава злополука на пътя, и гледаме филми, които ни плашат и разстройват?В „Механизмите на удоволствията” психологът Пол Блум отхвърля традиционното тълкуване на удоволствието като елементарна сетивна реакция и ни показва, че то се корени в убежденията ни за скритата природа – същността – на определен обект, независимо дали става дума за плюшено мече, „Ролекс”, картина на Пикасо или брачния ни партньор. Увлекателно и духовито авторът представя най-новите резултати от областта на детското развитие, философията, неврологията и икономическия бихевиоризъм, за да обясни благородни и низки, интелектуални и популярни наслади и да изгради завладяваща,смела нова концепция за удоволствието, желанието и ползата.",
  "genres": [
    "Psychology",
    "Nonfiction",
    "Science",
    "Philosophy",
    "Neuroscience",
    "Sociology",
    "Social Science"
  ],
  "author": "Paul Bloom",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/17887342"
}