{
  "title": "The ABC Movie of the Week: Big Movies for the Small Screen",
  "description": "On September 23, 1969, five years after the first made-for-television movie premiered, the ABC network broadcast Seven in Darkness. This was the first television film for an anthology show called the Tuesday Night Movie of the Week. Dedicating ninety minutes of weekly airtime to a still-emerging genre was a financial risk for the third-place network—a risk that paid off. The films were so successful that in 1972 the network debuted The Wednesday Movie of the Week. Although most of the movies are no longer remembered, a handful are still fondly recalled by viewers today, including Duel, Brian’s Song, and The Night Stalker. The series also showcased pilot films for many eventual series, such as Alias Smith and Jones, The Six Million Dollar Man, and Starsky and Hutch. By the end of both shows’ regular runs in the spring of 1975, the network had broadcast more than 200 made-for-television films.In The ABC Movie of the Big Movies for the Small Screen, Michael McKenna examines this programming experiment that transformed the television landscape and became a staple of broadcast programming for several years. The author looks at how the revolving films showcased the right mixture of romantic comedy, action, horror, and social relevance to keep viewers interested week after week. McKenna also chronicles how the ratings success led to imitations from the other networks, resulting in a saturation of television movies.As a cultural touchstone for millions who experienced the first run and syndicated versions of these films, The ABC Movie of the Week is a worthy subject of study. Featuring a complete filmography of all 240 movies with credit information and plot summaries, a chronology, and a list of pilots—both failed and successful—this volume will be valuable to television historians and scholars, as well as to anyone interested in one of the great triumphs of network programming.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Michael McKenna",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/17887601-the-abc-movie-of-the-week"
}