{
  "title": "Shattered",
  "description": "A man with a name like Anderson \"The Shatter Man\" Cole...he was trouble for sure...But Kaela's a good girl - she's paying her own way, working a shit job for shit pay, and living the single life in Alphabet City in NYC. When her asshole boss leaves her to close the shop alone late at night, Kaela finds herself in a situation of unimaginable danger.As she locks up and begins to head home, four burly drunken men surround her, their eyes void of all emotion except lust and violence. Despite her futile pleas the men attack her, intent on using her like a piece of meat...Just when all hope is lost a mysterious savior comes to her rescue. The unknown man beats her four drunken attackers into submission, breaking bones, cracking skulls and taking absolutely no mercy on her despicable assailants. His lean body glimmers in the street lights, the sinewy ropes of cut muscle on his tattooed arms and back tensing as he incapacitates the attackers with utter finesse.When the hero finds her in the corner alley, shaken and beyond terrified, he offers her his hand. The fighter's dark brown eyes are filled with steel resolve... these are eyes that know pain and suffering, but as Kaela looks deeper she finds that there's also kindness. His gentle touch immediately calms her nerves...as he swoops her into his arms and carries her home to safety.Kaela is already a goner, this beautiful man has her in his clutches and she's about to enter his world - one of danger, violence, treachery, and utter secrecy. Will she survive in his cut-throat world of professional violence? Will she be able to handle all of Anderson...the damaged man, the bad boy, the raw fighter?**This novel contains intense sexual situations and mature language. It is intended for an audience at 18+ years of age.",
  "genres": [
    "Romance",
    "Fighters",
    "Contemporary",
    "Mixed Martial Arts",
    "Contemporary Romance",
    "New Adult",
    "Erotica"
  ],
  "author": "Natalie Baird",
  "average_rating": "3.32",
  "url": "https://www.goodreads.com/book/show/17887284-shattered"
}