{
  "title": "A Vow of Glory",
  "description": "A VOW OF GLORY is book #5 in the Bestselling series THE SORCERER'S RING, which begins with A QUEST OF HEROES, a #1 Bestseller! In A VOW OF GLORY, Thor embarks with his Legion friends on an epic quest into the vast wilds of the Empire to try to find the ancient Destiny Sword and save the Ring. Thor’s friendships deepen, as they journey to new places, face unexpected monsters and fight side by side in unimaginable battle. They encounter exotic lands, creatures and peoples beyond which they could have ever imagined, each step of their journey fraught with increasing danger. They will have to summon all their skills if they are to survive as they follow the trail of the thieves, deeper and deeper into the Empire. Their quest will bring them all the way into the heart of the Underworld, one of the seven realms of hell, where the undead rule and fields are lined with bones. As Thor must summon his powers, more than ever, he struggles to understand the nature of who he is. Back in the Ring, Gwendolyn must lead half of King’s Court to the Western stronghold of Silesia, an ancient city perched on the edge of the Canyon that has stood for one thousand years. Silesia’s fortifications have allowed it to survive every attack throughout every century—but it has never been faced with an assault by a leader like Andronicus, by an army like his million men. Gwendolyn learns what it means to be queen as she takes on a leadership role, Srog, Kolk, Brom, Steffen, Kendrick and Godfrey by her side, preparing to defend the city for the massive war to come. Meanwhile, Gareth is descending deeper into madness, trying to fend off a coup that would have him assassinated in King’s Court, while Erec fights for his life to save his love, Alistair and the Duke’s city of Savaria as the downed shield enables the wild creatures to invade. And Godfrey, wallowing in drink, will have to decide if he is ready to cast off his past and become the man his family expects him to be. As they all fight for their lives and as things seem as if they can’t get any worse, the story ends with two shocking twists. Will Gwendolyn survive the assault? Will Thor survive the Empire? Will the Destiny Sword be found? With its sophisticated world-building and characterization, A VOW OF GLORY is an epic tale of friends and lovers, of rivals and suitors, of knights and dragons, of intrigues and political machinations, of coming of age, of broken hearts, of deception, ambition and betrayal. It is a tale of honor and courage, of fate and destiny, of sorcery. It is a fantasy that brings us into a world we will never forget, and which will appeal to all ages and genders.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Fiction",
    "Magic",
    "Adventure",
    "Epic Fantasy",
    "Audiobook"
  ],
  "author": "Morgan Rice",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/17899116-a-vow-of-glory"
}