{
  "title": "Un covo di vipere",
  "description": "È l’alba a Marinella e il sonno di Montalbano viene interrotto dal canto di un usignolo. O almeno così pare al commissario, salvo poi scoprire che si tratta del fischiettare di un vagabondo che ha trovato rifugio nella verandina durante un temporale di fine estate. Un barbone sui generis però, perché parla un italiano perfetto e si vede che ha conosciuto tempi migliori. Confessa di abitare in una grotta poco distante ma non c’è tempo di approfondire la questione perché Montalbano deve correre in commissariato dove Catarella gli annuncia l’assassinio del ragionier Cosimo Barletta. Nel villino lungo la strada che costeggia il mare nessun segno di effrazione, nessuna traccia di lotta: l’uomo è stato colpito alla nuca da un colpo di pistola mentre seduto in cucina stava bevendo un caffè. Un tipo strano il ragioniere, una vita solo in apparenza rispettabile: vedovo, benestante, casa in paese e villino sul mare, due figli, Arturo e Giovanna, entrambi sposati. Dalle loro parole però emerge un ritratto dell’uomo non proprio edificante. Malo carattere, qualche affare immobiliare che fa sospettare prestiti ai limiti del lecito, cosa altro ancora? Se lo chiede il commissario quando foto equivoche e lettere nascoste in un doppio fondo della scrivania della vittima svelano una passione malata. L’autopsia poi mette a nudo un particolare inquietante che costringe a cambiare marcia nell’indagine, tanto più che entrambi i figli di Barletta parlano di un testamento - che non si trova - che il padre intendeva rivedere. Livia arriva a Vigàta proprio quando l’inchiesta sta entrando nel vivo e mentre il commissario si attarda tra interrogatori di testimoni e perquisizioni, lei conosce Mario, l’uomo della grotta, e ne vuole carpire il segreto. La verità lentamente si fa strada ma è una soluzione che Montalbano non vorrebbe ammettere neanche a se stesso.",
  "genres": [
    "Mystery",
    "Crime",
    "Italy",
    "Fiction",
    "Italian Literature",
    "Audiobook",
    "Mystery Thriller"
  ],
  "author": "Andrea Camilleri",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/17899155-un-covo-di-vipere"
}