{
  "title": "Disney The Little Big Book Of Christmas",
  "description": "Celebrate the magic of Christmas with a cast of your favorite storybook and animated characters! Disney The Little Big Book of Christmas is simply the best way for families of young and old to come together on those chilly afternoons and winter nights. Curl up with wonderful holiday tales starring Winnie the Pooh and Mickey, share fun in the kitchen by whipping up some of Cinderella’s favorite sweets, get the whole gang smiling as you sing time-honored Christmas songs, and spend snowy days making gifts suggested by the Seven Dwarfs.Disney The Little Big Book of Christmas is filled with Disney-inspired stories, comics, activities, recipes, songs, and ideas to make the holidays special. Beautifully illustrated with over 200 images–familiar and rarely seen–from Disney’s archives, this is real a treasure for all Disney fans. This fun-filled book for the whole family Stories and Christmas stories featuring Disney’s favorite old standbys (Mickey, Minnie, Pluto, Goofy, Donald) as well as new such as Ariel’s Christmas Under the Sea, Andy’s Christmas Puppy, Pinocchio’s Perfect Gift, and Winnie the Pooh and Christmas Too. Also included are comic strips loaded with holiday fun! Make Seven Dwarfs Pinecone Carolers, Pooh’s Wishing Star, or Bambi’s Snow Globe. Decorate tree and home, send cards, wrap presents, make gifts . . . all with a Disney twist!Fun, Facts, and Find out how Eeyore spreads Christmas cheer, what the Princesses wish for Christmas, and how the holidays are celebrated at Disney Theme Parks. Daisy gives decorating tips and Tinker Bell offers stocking-stuffer ideas. Make holiday treats for enjoying and giving! Try Bambi’s Reindeer Lollipops, Cinderella’s Chocolate Mice, Captain Hook’s Hidden Treasure Cookies, and much more. Rarely seen art from the Disney Archives–Peter Pan and friends caroling, Lion King’s lions a-leaping–illustrate favorite traditional Christmas carols.The Joy of Learn how to spread the Christmas spirit with Disney characters setting an Toy Story characters support Toys for Tots; the puppies from 101 Dalmatians list their favorite animal charities; Aladdin wishes to feed the hungry.",
  "genres": [],
  "author": "Monique Peterson",
  "average_rating": "4.83",
  "url": "https://www.goodreads.com/book/show/1084965.Disney_The_Little_Big_Book_Of_Christmas"
}