{
  "title": "Dragonlinked",
  "description": "Many will be acceptable candidates, truth be told. And eventually, there will be thousands upon thousands of dragonlinked. But there will be one who is first.All fourteen-year-old Aeron wants is to make his father proud. After all, he’d managed to get Aeron a chance at an apprenticeship in Caer Baronel, the seat of Lord Baronel’s newly formed settlement in the northern wilds, and Aeron does not want to let him down. When Aeron is invited to be an accepted in Magic Craft, things seem to be going his way. His life is thrown into complete chaos, however, when he discovers an enormous egg, and unable to ignore its desperate cries, he helps the creature struggling within to hatch. As if he didn’t already have enough on his plate studying magic, avoiding an older boy’s persistent bullying, and trying to ignore the increasing reports of deadly nahual attacks, he now has the responsibility of caring for his young dragon companion. Sure, it’s every boy’s dream, as no one has ever been able to get close to the incredible creatures. But how will he continue to feed her and take care of her once she’s a full-grown dragon? Will he be able to do so and keep up with his Magic Craft lessons? And how in Yrdra’s deepest hells will he keep her a secret?Aeron’s search for answers in his now drastically changed world will lead to surprising discoveries and revelations, dangerous and distressingly close encounters with nahual, and the possibility of a greater, more fulfilling purpose—if he survives.In his debut novel, DRAGONLINKED, author Adolfo Garza Jr. immerses readers in the world of Lethera, where magic and a nascent Industrial Revolution will be the backdrop for several tales about dragons, their newly discovered roles, and the brave souls who are their bond-mates.",
  "genres": [
    "Fantasy",
    "Dragons"
  ],
  "author": "Adolfo Garza Jr.",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/17900324-dragonlinked"
}