{
  "title": "The Emperor of Ocean Park",
  "description": "Intricate, superbly written, often scathingly funny - a brilliantly crafted tapestry of ambition, family secrets, murder, integrity tested, and justice has gone terribly wrong.An extraordinary fiction debut: a large, stirring novel of suspense that is, at the same time, a work of brilliantly astute social observation. The Emperor of Ocean Park is set in two privileged worlds: the upper crust African American society of the eastern seaboard--old families who summer on Martha's Vineyard--and the inner circle of an Ivy League law school. It tells the story of a complex family with a single, seductive link to the shadowlands of crime.The Emperor of the title, Judge Oliver Garland, has just died, suddenly. A brilliant legal mind, conservative and famously controversial, Judge Garland made more enemies than friends. Many years before, he'd earned a judge's highest prize: a Supreme Court nomination. But in a scene of bitter humiliation, televised across the country, his nomination collapsed in scandal. The humbling defeat became a private agony, one from which he never recovered.But now the Judge's death raises, even more, questions--and it seems to be leading to a second, even more, terrible scandal. Could Oliver Garland have been murdered? He has left a strange message for his son Talcott, a professor of law at a great university, entrusting him with \"the arrangements\"--a mysterious puzzle that only Tal can unlock, and only by unearthing the ambiguities of his father's past. When another man is found dead, and then another, Talcott--wry, straight-arrow, almost too self-aware to be a man of action--must risk his career, his marriage, and even his life, following the clues his father left him.Intricate, superbly written, often scathingly funny, The Emperor of Ocean Park is a triumphant work of fiction, packed with character and incident--a brilliantly crafted tapestry of ambition, family secrets, murder, integrity tested, and justice has gone terribly wrong.",
  "genres": [
    "Fiction",
    "Mystery",
    "Thriller",
    "Mystery Thriller",
    "African American",
    "Contemporary",
    "Book Club"
  ],
  "author": "Stephen L. Carter",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/108505.The_Emperor_of_Ocean_Park"
}