{
  "title": "Freedom from Bosses Forever",
  "description": "Freedom from Bosses Forever is classic comedy, biting satire and a really practical, useful guide to being your own boss. This is an updated, new e-book exclusive version of the popular book 'Stripping for Freedom'. See the reader reviews: 'snorting with laughter' is not unusual but all agree the Be Your Own Boss advice is spot on.Successful global entrepreneur and CEO of cloud software and apps multinational WinWeb, Stefan Topfer, has called it 'The funniest hard-hitting business book, that is absolutely full of business truth' Most successful business owners, entrepreneurs, even sports stars and top entertainers, have been willing to strip their lifestyle down to the bare essentials so that they can control their own destiny, gain their freedom from bosses, by earning a living working for themselves. Freedom from Bosses Forever shows you how to gain the bare enterprise-ready essentials in order to successfully start your own small or home business (and escape the rat race). As well as a useful guide to starting your own business this is also a very funny book. It has received excellent reviews for both editions in paperback and this new e-book improves it again.The e-book format makes it easy to read and clickable links take you to the author's favourite, free websites that provide further help for all those thinking about, preparing for and starting their own business. The humorous narrative is based on the book's mythical author, Canadian fashionista,Leonora Soculitherz (So-cool-it-hurts - geddit?) returning to the UK to conduct a piece of investigative journalism. As well as finding out what it takes to prepare for and start your own business, Soculitherz also has in her sights the UK's fat cats, corporate clowns and insane politicians. Conspiracy theories abound. Along the way Soculitherz provides absolute business truths which anyone interested in being more enterprising will value. There is even a highly useful and fully updated list of free websites provided that will give you all the additional know how to start your own business. It s a cracking read even if you don t want to escape the rat race and be free of bosses forever. Many people, now seen smiling knowingly, have bought and read the book just for its humour and satire. Join the cult of Soculitherz! Now is the time to consider being free from bosses forever.",
  "genres": [
    "Business"
  ],
  "author": "Tony  Robinson",
  "average_rating": "4.52",
  "url": "https://www.goodreads.com/book/show/17901607-freedom-from-bosses-forever"
}