{
  "title": "Elements of Retrofit",
  "description": "A successful New York architect, forty-four year old Thomas Elkin almost has it all. An esteemed traditional draftsman, he thought he knew everything about architecture, about life.Cooper Jones, twenty-two years old, is about to take the architect world by storm. Talented, professional, driven, and completely infuriating, Cooper is the definition of Generation Y.Generation versus generation, traditional versus contemporary, these men are about to learn a lesson in architecture, egos and love. Can they prove to the world that the old and new can be the perfect design?Book One in the Thomas Elkin series.Generation versus generation, traditional versus contemporary, these men are about to learn a lesson in architecture and love. Can they prove that the old and new can be the perfect design?A successful New York architect, Thomas Elkin almost has it all. Coming out as gay and ending his marriage before his fortieth birthday, he needed to start living his life. Now, four years later, with his relationship with his son back on track, and after a few short-lived romances, this esteemed traditional draftsman thought he knew everything about architecture, about life.Cooper Jones, twenty-two years old, is about to take the architect world by storm. Talented, professional, driven, and completely infuriating, Cooper is the definition of Generation Y.Starting an internship working with Thomas, Cooper is about to knock Tom’s world off its axis. Tom can teach Cooper about the architecture industry, but Cooper is about to teach Tom what it means to live.N.R. WalkerWho am I?Good question…I am many things; a mother, a wife, a sister, a writer.I have pretty, pretty boys who live in my head, who don't let me sleep at night unless I give them life with words.I like it when they do dirty, dirty things...but I like it even more when they fall in love.I used to think having people in my head talking to me was weird, until one day I happened across other writers who told me it was normal.I've been writing ever since…",
  "genres": [
    "M M Romance",
    "Contemporary",
    "Romance",
    "LGBT",
    "Contemporary Romance",
    "Audiobook",
    "Novella"
  ],
  "author": "N.R. Walker",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/17901475-elements-of-retrofit"
}