{
  "title": "Huellas en la Nieve",
  "description": "PROYECTO EN HIATUS, SIN FECHA DE PUBLICACIÓN POR EL MOMENTOEL ENLACE DE \"COMPRAR EN AMAZON\" NO LLEVA A NINGUNA PARTE, ES GENÉRICO Y GOODREADS SE LO PONE A TODOS LOS LIBROS. SUSCRIBITE A LA WEB DE LA AUTORA PARA ENTERARTE DE CUANDO SALGA.-------------------------Rusia, 1979Sergei Valinchenko, Alfa Mayoritario de la nación loba, se ha ido.Después de las -misteriosas- muertes de sus hermanos mayores, Illya Valinchenko (el tercer hijo de Sergei) es el único que puede tomar las riendas de una empresa que amenaza con desmoronarse. Lo que el Mando Común no sabe, es que debajo de la prístina piel del lobo se esconde una bestia aún más feroz con sus propios ideales. Brutal, certero y decidido, Illya tiene la visión y la fuerza para hacer cumplir sus planes. No conoce límites.Él es la pesadilla con la que se alimentan los rumores, uno más oscuro que el otro. ¿Cuánto de eso es mentira, y cuánto es verdad?¿Cuánto oculta Illya, en beneficio de su gente y del Bien Común?Ekaterina Tasarova no le teme a Illya Valinchenko. Ni siquiera lo conoce. Pero cuando llega a Vladivostok una carta del Mando Común avisándole que es una de las candidatas para casarse con él, ella elige obedecer. Tal vez ser la Primera Hembra Alfa es demasiado, pero una chica de pueblo no desaprovecha oportunidades; sobre todo si esa chica tiene un espíritu \"alfa\" imparable y siempre quiso hacer grandes cosas. Ella le ofreció lealtad, él le ofreció poder. La nación loba está a punto de entrar en una nueva era...Si la pareja \"alfa\" sobrevive lo suficiente.Esta es la historia de una relación atípica enmarcada por la Rusia de la Guerra Fría, de un pueblo fraccionado y dolido por la pérdida de un líder débil pero amado y de un juego peligroso de lealtades y traiciones que es imposible ganar en solitario. NO DISPONIBLE TODAVÍA",
  "genres": [],
  "author": "Melisa S. Ramonda",
  "average_rating": "4.60",
  "url": "https://www.goodreads.com/book/show/17901935-huellas-en-la-nieve"
}