{
  "title": "Van het westelijk front geen nieuws ~ De weg terug ~ Drie kameraden",
  "description": "Deze trilogie bevat \nVan het westelĳk front geen nieuws\n (Im Westen nichts Neues, 1929), \nDe weg terug\n (Der Weg zurück, 1931) en \nDrie kameraden\n (Drei Kameraden, 1936).\nVan het westelijk front geen nieuws\nEind 1928 voltooide Erich Maria Remarque zijn Im Westen nichts Neues. Reeds op 18 april van het volgende jaar verscheen bij uitgeverij Erven J. Bijleveld de eerste vertaalde editie ter wereld van deze fameuze anti-oorlogsroman. Alleen al van de Nederlandse uitgave werden er in de eerste jaren na verschijnen meer dan honderdduizend verkocht, tot de bezetter het boek in 1940 in beslag nam.Van het westelijk front geen nieuws is sedert de eerste dag van verschijnen niet alleen een literair monument geweest, maar een politiek en cultureel feit van grote betekenis. Door de sobere en pregnante beschrijving van de oorlogswaanzin werd het werk ogenblikkelijk en blijvend herkend als een der belangrijkste en indrukwekkendste boeken van de moderne tijd.Nog altijd is dit meesterwerk van de moderne romankunst een manifest van wat literatuur vermag: zelden is de menselijke werkelijkheid en het menselijke levenslot verwoord in zo een beslissende leeservaring.Dit boek wil noch een aanklacht noch een bekentenis zijn. Het wil alleen een poging wagen verslag uit te brengen over een generatie die door de oorlog vernield werd, ook als ze aan de granaten wist te ontkomen.\nDe weg terug\nMet zijn oorlogsroman Van het westelijk front geen nieuws verwierf Erich Maria Remarque wereldfaam. De weg terug begint waar de oorlog eindigt. Het laat zien hoe het leven aan het front iemand verandert, en hoe eenzaam de weg terug is naar de vrede en de burgermaatschappij. Het verhaal is van alle tijden: de oorlog smeedt kameraadschappen die in vredestijd ondenkbaar zijn, en de alledaagse omgang met de dood wist alles uit wat niet tot de absolute hoofdzaken hoort. Leven, vriendschap, moed en humor, met die bagage komen acht vrienden thuis in een armoedig, kleinburgerlijk, feestvierend Duitsland, waar in de tussentijd niet veel veranderd lijkt. De weg terug is een aangrijpend, warm, gevoelig boek dat door velen als Remarques beste werk wordt beschouwd.\nDrie kameraden\nDrie vrienden keren terug uit de loopgraven van de Eerste Wereldoorlog, beroofd van ieder idealisme, iedere illusie. Ze beginnen een garage in Berlijn en gaan een nieuwe strijd aan: de strijd om overeind te blijven in het burgerlijk leven. Hun wapens: sterke drank, kameraadschap en de durf om het lot te bespotten. Kameraden, wat zijn dat? Dat zijn mensen waarbij je je niet groter hoeft voor te doen dan je bent en van wie je onder geen voorwaarde accepteert dat ze naar de donder gaan. Deze magistrale roman schetst de hoofdthema's van de periode tussen de twee Wereldoorlogen op indringende wijze. Werkeloosheid, opkomend Nazisme en het wegvallen van solidariteit, de drie kameraden krijgen er alles mee te maken. Tegen deze achtergrond ontspint zich een liefdesverhaal dat alle cynisme trotseert en al in vele talen miljoenen lezers heeft ontroerd.",
  "genres": [
    "Fiction",
    "Roman",
    "Germany",
    "Classics"
  ],
  "author": "Erich Maria Remarque",
  "average_rating": "4.64",
  "url": "https://www.goodreads.com/book/show/17902133-van-het-westelijk-front-geen-nieuws-de-weg-terug-drie-kameraden"
}