{
  "title": "The Moonlight Prince",
  "description": "I can and will find you, no matter where you are…  These were the chilling words left behind on a note written by the fallen angel, Nathaniel. Did he really mean what he wrote? Or was it just a way to scare Ella into believing the outlandish stories. Either way…  something  is coming for her. A rare demon attack during the day leaves Ella McMillan waking up in a strange and unknown place with very little memory of how she got there. Dash is nowhere to be seen and Ella is quick to learn that she is no longer in Brooklyn or even on the same continent anymore, but in Russia and in the very heart of the Guardian kingdom. Ella is instantly drawn to the magical realm but what she can’t seem to figure out is why the Guardians, who consider her kind the enemy, have allowed her into their secretive world in the first place or why their handsome and charming prince has taken interest in her. But not everyone is happy to have her there… When a famous ballerina is murdered one evening, Ella immediately falls under the suspicion of everyone except the royal family and the few people who have come to know her. To complicate matters, Dash reappears causing unresolved issues between them to resurface. Even though they don't always see eye to eye, Ella can’t stop her feelings for Dash but she can’t help what she feels for the prince either. As more bodies fall, not everyone is who they appear to be and something about Ella is different...very different. Has Nathaniel finally found a way to get to her? Is she capable of murder without even realizing it? Or is this part of something much bigger? Even in a kingdom glittered with gold that is sworn to protect the human race, evil has a way of lurking in the shadows. An unforgivable betrayal is made, relationships are tested and a scandalous secret is revealed in the second installment of the Moonlight Series",
  "genres": [],
  "author": "Michelle Congdon",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/17903322-the-moonlight-prince"
}