{
  "title": "A Dirty Drag Collection",
  "description": "Contains Dirty Drag, Dirty Drag 2: The Night Drags On, and Dirty Drag 3: Beyond The Drag. If you haven't read the Dirty Drag series, here is your chance to read them all at once. Dirty Drag: Ashley is on a mission, but is he willing to take all the risks to show he’s got what it takes? Rick is a man who knows what he wants, and he is willing to do whatever it takes to make sure he gets it. When a gorgeous redhead walks into his local bar, wearing sexy heels and a mini skirt, he knows exactly who wants. But, looks can be deceiving, and sometimes you shouldn’t judge a book by its cover.Dirty Drag 2: The Night Drags On: If you liked Dirty Drag and wanted to follow along when Ashley left the bar with Rick, well then this story is for you. The night didn’t just end in some swanky bar bathroom. No, the night continued with Ashley, our cheeky drag queen, taking Rick up on his offer to take him home. The fun ensues and things get wet – um, wait you’ll have to read it to see if that’s true.When reality sets in the following morning, Ashley has a huge problem. What is he going to wear home? For Ashley, drag simply does not work during the day. Ashley’s second biggest fear is getting caught in day drag and arrested for looking like a cross-dressing hooker. If you want to know how Ashley gets out of this jam, you’ll have to read it and see.The real question on everyone’s lips is, after one night with Ashley, has Rick had enough? Or is the lure of Ashley’s snark more addicting than a sweet luscious Oreo? One way to find out, read this book! Come on, it’s free. Dirty Drag 3: Beyond The Drag: picks up right after the shocking conclusion of book two. Ashley is on a new mission to impress Rick and show him he can be serious about a relationship. If he's able to open up and let a few things off his chest and can avoid making a boob of himself in the process, he might just succeed. This is the final story for Rick and Ashley, and it’s a finale you don't want to miss.",
  "genres": [
    "M M Romance",
    "Contemporary",
    "Erotica",
    "Cross Dressing",
    "Anthologies",
    "Short Stories",
    "Humor"
  ],
  "author": "Kyle Adams",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/17903340-a-dirty-drag-collection"
}