{
  "title": "بقايا القهوة",
  "description": "رواية \"بقايا القهوة\" فضاء مليء بالبساطة والدهشة والتفاصيل الصغيرة التي تستثير الذاكرة والحنين، فهي كل ما تبقَّى من تفاصيل الذاكرة، التي كلَّما تغلغل فيها القارئ، كلما رأى ذاته فيها بشدة، وإذ ذاك، لن يملك إلاَّ أن يبتسم أو يضحك أو يبكي، فثمة ذكرى لطفولة أو شقاوة أو حزن لا بد أن تتحرك داخله، وهو يقرأ طفولة كلاوديو، بطل الرواية.كما تحكي الرواية فترة نضوج هذا الطفل حيث يكبر وتكبر معه أحلامه وتطلُّعاته، وتتغير نظرته للحياة وللأشياء، ومع هذه اللحظات والتفاصيل الروائية لن يملك هذا القارئ إلا أن يتذكر أيضاً محطَّات من حياته، التي لا بدَّ وأنه يتقاسمها مع كلاوديو الشاب، ومع أنها رواية تحمل الكثير من \"الذاتي\" – وبخاصة لمن يعرف سيرة بينيديتي، يكتشف هذا بسرعة إلا أن هذه الذاتية تمتزج بالسردي الحكائي بحبكة عالية متقنة، وخفة روح وعفوية لا تخلو منها كتابات هذا المؤلف البارع.كما أن رواية \"بقايا القهوة\" لا تعالج أية معضلة كبرى، ولا تطرح أية قضية فلسفية محيِّرة، ولكن جماليتها تكمن في أنها رواية جد إنسانية وكونية، يمكن لأيٍّ كان في أي مكان، أن يقرأها بشيء من الحنين، وهو يرى أطيافاً من حياته تمر أمامه، بين سطور الرواية.أمّا مؤلف الرواية ماريو بينيديتي \"1920-2009\" فكان يُصرُّ على أنه شاعر قبل كل شيء، إلا أنه روائياً وقاصاًّ وكاتباً مسرحياً ناجحاً ومتميزاً، فنتاجه الأدبي غزير، إذ أصدر أكثر من 80 ديواناً وكتاباً جرت ترجمتها –كما يشير الكاتب في الإهداء- إلى أكثر من عشرين لغة، كما أن العديد من أعماله الأدبية نُقِلت إلى السينما والمسرح، ما أعطاه الكثير من الشهرة والانتشار، إلا أن أهم الأعمال التي يدين لها الكاتب بشهرته الواسعة هي رواية \"الهدنة\" \"1960\" التي لقيت نجاحاً فاجأ المؤلِّف نفسه، إذ ضربت أرقاماً قياسية من حيث عدد الطبعات والمبيعات، كما نجد أيضاً مجموعاته القصصية \"الموت ومفاجآت أخرى\" \"قصص 1968\"، \"بحنين وبدونه\" \"قصص 1977\"، \"شكراً على إشعالك سيجارتي\" \"رواية 1965\" من بين أعماله الأكثر نجاحاً بين القراء.رحل مؤلف \"بقايا القهوة\" يوم 17 ماي / أيار 2009، ولا شك أن كثيراً ممَّن قرأوا له دائماً تذكَّروا أبياته هذه:وإذا حلَّت ساعة الدفنأرجوكم لا تنسواقلمي.ومترجم الرواية، محمد العشيري، من مواليد 1950، كاتب ومترجم، يعمل حالياً أستاذاً للغة الإسبانية في الدار البيضاء، صدرت له أربع مجموعات قصصية باللغة الإسبانية، كما أنه ترجم عدة أعمال أدبية من بينها \"رائحة الغوافة\" لغرثيا ماركيث، \"بيت برناردا ألبا\" لغرثيا لوركا، \"سيدة الفجر\" لألخاندرو كاصونا، و\"ليلة حرب بمتحف البرادو\" لرافاييل ألبرتي.",
  "genres": [
    "Novels",
    "Fiction",
    "Literature",
    "Spanish Literature",
    "Drama",
    "Latin American Literature",
    "School"
  ],
  "author": "Mario Benedetti",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/10851790"
}