{
  "title": "Books of Blood: Volume 6",
  "description": "Few authors can claim to have marked a genre so thoroughly and personally that their words have leaked into every aspect of modern pop culture. Clive Barker is such an author, and the Books of Blood marked his debut - his coming out to the world - in brilliant, unforgettable fashion. Crossroad Press is proud to present Clive Barker's \"Books of Blood\" in digital for the first time.The Books of Blood combine the ordinary with the extraordinary while radiating the eroticism that has become Barker's signature. Weaving tales of the everyday world transformed into an unrecognizable place, where reason no longer exists and logic ceases to explain the workings of the universe, Clive Barker provides the stuff of nightmares in packages too tantalizing to resist. Never one to shy away from the unimaginable or the unspeakable, Clive Barker breathes life into our deepest, darkest nightmares, creating visions that are at once terrifying, tender, and witty. The Books of Blood confirm what horror fans everywhere have known for a long time: We will be hearing from Clive Barker for many years to come.In this, the sixth and final volume of Clive Barker's Books of Blood, with a new introduction by Mark Miller, five new stories of darkness unleashed:THE LIFE OF DEATH - Hidden in the crypt of a derelict church she found Decay and Corruption in hits terrible glory. But such glamour can prove infectious....HOW SPOILERS BLEED - They commited a crime no jury could convict them for. But there were other judges...other punishments...TWILIGHT AT THE TOWERS - Ballard was the perfect spy. A man with all the cunning of an animal. Or was it vice-versa?THE LAST ILLUSION - (A Harry D'Amour novella) - New York had shown Harry horrors enough for a dozen lifetimes. He thought he'd seen the worst that flesh could suffer. Then the beautiful widow walked into his life, with a husband who wouldn't lie down dead, and all Hell on her hells. And suddenly Harry was face to face with forces that could teach Manhattan a lesson in depravity.ON JERUSALEM STREET (a Postscript) After the end, a new beginning: walking the highway of the dead...",
  "genres": [
    "Horror",
    "Short Stories",
    "Fiction",
    "Fantasy",
    "Anthologies",
    "Thriller",
    "Audiobook"
  ],
  "author": "Clive Barker",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/17905849-books-of-blood"
}