{
  "title": "Einstein's Relativity and the Quantum Revolution: Modern Physics for Non-Scientists",
  "description": "\"It doesn't take an Einstein to understand modern physics,\" says Professor Richard Wolfson at the outset of this course on what may be the most important subject in the universe. Relativity and quantum physics touch the very basis of physical reality, altering our commonsense notions of space and time, cause and effect. Both have reputations for complexity. But the basic ideas behind relativity and quantum physics are, in fact, simple and comprehensible by anyone. As Professor Wolfson points out, the essence of relativity can be summed up in a single sentence: The laws of physics are the same for all observers in uniform motion. The same goes for quantum theory, which is based on the principle that the \"stuff \" of the universe-matter and energy-is not infinitely divisible but comes in discrete chunks called \"quanta.\" Profound ... Beautiful ... Relevant Why should you care about these landmark theories? Because relativity and quantum physics are not only profound and beautiful ideas in their own right, they are also the gateway to understanding many of the latest science stories in the media. These are the stories about time travel, string theory, black holes, space telescopes, particle accelerators, and other cutting-edge developments. Consider these ideas: Although Einstein's theory of general relativity dates from 1914, it has not been possible to test certain predictions until recently. The Hubble Space Telescope is providing some of the most striking confirmations of the theory, including certain evidence for the existence of black holes, objects that warp space and time so that not even light can escape. Also, the expansion of the universe predicted by the theory of general relativity is now a known rate. General relativity also predicts an even weirder phenomenon called \"wormholes\" that offer shortcuts to remote reaches of time and space. According to Einstein's theory of special relativity, two twins would age at different rates if one left on a high-speed journey to a distant star and then returned. This experiment has actually been done, not with twins, but with an atomic clock flown around the world. Another fascinating experiment confirming that time slows as speed increases comes from measuring muons at the top and bottom of mountains. A seemingly absurd consequence of quantum mechanics, called \"quantum tunneling,\" makes it possible for objects to materialize through impenetrable barriers. Quantum tunneling happens all the time on the subatomic scale and plays an important role in electronic devices and the nuclear processes that keep the sun shining. Some predictions about the expansion of the universe were so odd that Einstein himself tried to rewrite the mathematics in order to eliminate them. When Hubble discovered the expansion of the universe, Einstein called the revisions the biggest mistake he had ever made. An intriguing thought experiment called \"Schrödinger's cat\" suggests that a cat in an enclosed box is simultaneously alive and dead under experimental conditions involving quantum phenomena. From Aristotle to the Theory of Everything Professor Wolfson begins with a brief overview of theories of physical reality starting with Aristotle and culminating in Newtonian or \"classical\" physics. Then he outlines the logic that led to Einstein's theory of special relativity, and the simple yet far-reaching insight on which it rests. With that insight in mind, you move on to consider Einstein's theory of general relativity and its interpretation of gravitation in terms of the curvature of space and time. Professor Wolfson then shows how inquiry into matter at the atomic and subatomic scales led to quandaries that are resolved-or at least clarified-by quantum mechanics, a vision of physical reality so at odds with our experience that it nearly defies language. Bringing relativity and quantum mechanics into the same picture leads to hypotheses about the origin, development, and possible futures of the entire universe, and the possibility that physics can produce a \"theory of everything\" to account for all aspects of the physical world. Fascinating Incidents and Ideas Along the way, you'll explore these fascinating incidents and ideas: In the 1880s, Albert Michelson and Edward Morley conducted an experiment to determine the motion of the Earth relative to the ether, which was a supposedly imponderable substance pervading all of space. You'll learn about their experiment, its shocking result, and the resulting theoretical crisis. In 1905, a young Swiss patent clerk named Albert Einstein resolved the crisis by discarding the ether concept and asserting the principle of relativity-that the laws of physics are the same for all observers in uniform motion. Relativity implies that the time order of events can be different in different reference frames. Does this wreak havoc with cause and effect? And why does Einstein assert that nothing can go faster than light? Shortly after publishing his 1905 paper on special relativity, Einstein realized that his theory required a fundamental equivalence between mass and energy, which he expressed in the equation E=mc2. Among other things, this famous formula means that the energy contained in a single raisin could power a large city for a whole day. Historically, the path to general relativity followed Einstein's attempt to incorporate gravity into relativity theory, which led to his understanding of gravity not as a force, but as a local manifestation of geometry in curved spacetime. Quantum theory places severe limits on our ability to observe nature at the atomic scale because it implies that the act of observation necessarily disturbs the thing that is being observed. The result is Werner Heisenberg's famous \"uncertainty principle.\" Are quarks, the particles that make up protons and neutrons, the truly elementary particles? What are the three fundamental forces that physicists identify as holding particles together? Could they be manifestations of a single, universal force? A Teaching Legend On his own Middlebury College campus, Professor Wolfson is a teaching legend with an infectious enthusiasm for his subject and a knack for conveying difficult concepts in a way that fosters true understanding. He is the author of an introductory text on physics, a contributor to the esteemed publication Scientific American, and a specialist in interpreting science for the nonspecialist. In this course, Professor Wolfson uses extensive illustrations and diagrams to help bring to life the theories and concepts that he discusses. Thus we highly recommend our DVD version, although Professor Wolfson is mindful of our audio students and carefully describes visual materials throughout his lectures. Professor Richard Wolfson on the Second Edition of Einstein's Relativity: \"The first version of this course was produced in 1995. In this new version, I have chosen to spend more time on the philosophical interpretation of quantum physics, and on recent experiments relevant to that interpretation. I have also added a final lecture on the theory of everything and its possible implementation through string theory. The graphic presentations for the DVD version have also been extensively revised and enhanced. But the goal remains the same: to present the key ideas of modern physics in a way that makes them clear to the interested layperson.\"",
  "genres": [
    "Science",
    "Nonfiction",
    "Physics",
    "Audiobook",
    "History",
    "Quantum Mechanics",
    "Astronomy"
  ],
  "author": "Richard Wolfson",
  "average_rating": "4.31",
  "url": "https://www.goodreads.com/book/show/17906571-einstein-s-relativity-and-the-quantum-revolution"
}