{
  "title": "Athena's Daughter",
  "description": "Seven years ago, Athena Hill made a hasty decision that hurt the two people she loves most, only they don’t know it. Yet.When Athena discovers she’s pregnant after her blissful summer in England, she isn’t too worried. After all, she and Derek Marshall plan to get married anyway – they’d already be married if it wasn’t for her visa expiring, sending her back to the States to apply for another one. But when she calls Derek to tell him about their baby, a girl answers the phone; a girl who tells Athena that she is Derek’s fiancée. When Athena’s sister urges her to forget about a man who would use her and then toss her aside, she’s conflicted. But frightened by her sister’s warnings that such a man might also try to take the baby from her, Athena enters into a hasty marriage of convenience with a man she doesn’t love. Seven years later, Athena is divorced and raising Derek’s look-alike daughter on her own and regretting not finding a way to tell Derek, even if she could reach him. His once fledgling rock band is now a success and he’s surrounded by security, making contact with him impossible. Or so she thinks until the owner of the record store where she’s manager books the band for a personal appearance. Now she’s face to face with Derek again, and he’s furious. He was never engaged to anyone else and has spent the past seven years thinking Athena ran out on him without a word. Realizing she was played for a fool, and ashamed for keeping Derek’s child from him, Athena knows she has to make right the colossal wrong she committed seven years ago.But breaking through Derek’s anger at what he thinks was her callous abandonment of him is harder than Athena thought. That anger is nothing compared to his reaction when she finally tells him about his child, and it destroys the loving connection they’d re-established.Now Athena’s daughter has the father she always wanted and needed, and Derek is overjoyed to have his child in his life. But even though there’s still an undercurrent of passion and desire between Athena and Derek, he still treats her like someone he used to know. Will he ever be able to forgive her for what she did, or have her past actions destroyed any chance of happiness with the man she still loves?",
  "genres": [
    "Romance",
    "Music",
    "Second Chance"
  ],
  "author": "Juli Page Morgan",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/17906936-athena-s-daughter"
}