{
  "title": "The Caves: Book One - The Event",
  "description": "If you woke up in the morning to a radically altered world, what would you do? Would you know how to survive? If someone asked you to make a choice today about what you believe in, could you give a definitive answer? The Caves: Book One is the first installment of a series about surviving in a world that has radically changed.Ira PrattIra Pratt stared at the squared board lost in thought. If he moved to the right, he would surely lose two checkers. Maybe, he thought, as many as four. Moving to the left would not help either. There was actually only one semi-safe move to make, and that was straight ahead. However, even that move could put a hurtin' on his few remaining checkers, he thought. Nothing to do for it though, but move it, and see what happened.Richard PierceFar below the small city of Watertown New York, Richard Pierce sat working before an elaborate computer terminal. He had just initiated the program that managed the small nuclear power plant hidden deep below him in the rock. A small handset beside the computer station chimed, and he picked it up and listened. He did not speak at first, but as he listened, a smile spread across his face. \"Very good,\" he said happily, when the caller was finished, \"keep me advised.\" He set the small handset back into its cradle and turned his attention back to the screen in front of him. The plant had powered up just as it was supposed to, no problems whatsoever, and that made Richard Pierce extremely happy. Two more days tops, he thought, and then maybe I will get out of this dump.Gary JonesAt a large gravel pit on the outskirts of Watertown, Gary Jones carefully maneuvered the wide mouth of the loader bucket over the dump box of the truck, and pulled back on the lever closest to him to release the load. Ain't this something, he thought as he slowly topped off the dump box, barely 10 AM and we've already sent out twenty seven truckloads of gravel to the base.Jonathan DuffanyTomorrow, six-year-old Jonathan Duffany thought, as he lay wide-awake in the darkness of his room. Tomorrow and we shall go and see the caves. The caves, just as Robert had last year, and he was sure he would not sleep at all this night. With such a thrilling adventure to look forward to, sleep would surely elude him.Frank WeirFrank sat at the small, scarred, wooden table at Mikes Pub on Sixth Avenue, nursing a shot of gin, his thoughts turned inward, mulling over the same problem he had been mentally chewing for the last several weeks. It always came back, no matter how far away he pushed it. It slipped right back to the front and began to hammer away at him. However, today was much worse. It had seemed endless as it dragged on, and he had been able to concentrate on next to nothing. He had avoided the office, and Pearlson, no sense compounding things when he was so close to the truth by chancing a confrontation with Pearlson.The CavesA vast network of caverns of varying heights and expanses with intricate ramifications and labyrinthine corridors occupy the thick and expansive deposit of limestone over which the city of Watertown has been built.",
  "genres": [],
  "author": "Melody Laughlin",
  "average_rating": "4.44",
  "url": "https://www.goodreads.com/book/show/17909028-the-caves"
}