{
  "title": "Shadows in the Dark: A Novel of the Supernatural World",
  "description": "Shadows in the Dark is an adrenaline-charged story based on the supernatural world, centered on a battle between the Gods of the Universe and the Powers of Evil. It orbits around the Seven Deadly Sins, which takes the reader on an exhilarating, white-knuckle ride through the seven levels of Hell. Each terrifying level of Hell is charged with keeping alive the frightening theme of one of the seven sins.This adrenaline-charged book starts out just like a simple mountain stream can lull anyone into a false sense of security, and perhaps the reader may be unimpressed by the simple way it evolves. Do not be fooled by the creatively unhurried way Alfred Nestor draws you into a surreal world of demons and gods, for Alfred Nestor’s magnum opus will soon have your eyes glued to every breathtaking page, where the mountain stream becomes a white-water torrent of destruction!The perilous climax runs into various levels of Heaven, which balances the Universe, and runs into the different dimensions of Earth and a crystal dimension. The two heroes given the overwhelming task of stopping the Devil in his destructive path are the Twin Flames, accompanied by their ever-loyal guide sent to them by the Gods of the Universe.The message running through the book is about the fight between good and evil. The battle between the Devil and the Twin Flames continues from the depths of Hell into Heaven itself, where the Gods of the Universe themselves become involved in the final war between the forces of good and evil in the race to save the Universe from the clutches of Armageddon!The novel involves a thrilling plethora of ancient legends of Heaven and Hell. Full to overflowing with demons, magic, gods and the Devil himself ... set on destroying everything and anything so long as he wins, and at any cost! The role of the Twin Flames is to reset the balance of the Universe and ensure Earth is saved! Who will be victorious in the tense ending, the Devil or the Twin Flames? Be prepared to be on the edge of your metaphorical seat!",
  "genres": [],
  "author": "Alfred Nestor",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/17909346-shadows-in-the-dark"
}