{
  "title": "The Neighborhood Project: Using Evolution to Improve My City, One Block at a Time",
  "description": "After decades studying creatures great and small, evolutionary biologist David Sloan Wilson had an Darwin's theory won't fully prove itself until it improves the quality of human life in a practical sense. And what better place to begin than his hometown of Binghamton, New York? Making a difference in his own city would provide a model for cities everywhere, which have become the habitat for over half of the people on earth.Inspired to become an agent of change, Wilson descended on Binghamton with a scientist's eye and looked at its toughest questions, such as how to empower neighborhoods and how best to teach our children. He combined the latest research methods from experimental economics with studies of holiday decorations and garage sales. Drawing upon examples from nature as diverse as water striders, wasps, and crows, Wilson's scientific odyssey took him around the world, from a cave in southern Africa that preserved the dawn of human culture to the Vatican in Rome. Along the way, he spoke with dozens of fellow scientists, whose stories he relates along with his own.Wilson's remarkable findings help us to understand how we must become wise managers of evolutionary processes to accomplish positive change at all scales, from effective therapies for individuals, to empowering neighborhoods, to regulating the worldwide economy.With an ambitious scope that spans biology, sociology, religion, and economics, The Neighborhood Project is a memoir, a practical handbook for improving the quality of life, and an exploration of the big questions long pondered by religious sages, philosophers, and storytellers. Approaching the same questions from an evolutionary perspective shows, as never before, how places define us.",
  "genres": [
    "Nonfiction",
    "Science",
    "Sociology",
    "Psychology",
    "Sustainability",
    "Evolution",
    "Economics"
  ],
  "author": "David Sloan Wilson",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/10852303-the-neighborhood-project"
}