{
  "title": "Flappers: Six Women of a Dangerous Generation",
  "description": "By the 1920s, women were on the verge of something huge. Jazz, racy fashions, eyebrowraising new attitudes about art and sex―all of this pointed to a sleek, modern world, one that could shake off the grimness of the Great War and stride into the future in one deft, stylized gesture. The women who defined this the Jazz Age―Josephine Baker, Tallulah Bankhead, Diana Cooper, Nancy Cunard, Zelda Fitzgerald, and Tamara de Lempicka―would presage the sexual revolution by nearly half a century and would shape the role of women for generations to come.In Flappers , the acclaimed biographer Judith Mackrell renders these women with all the color that marked their lives and their era. Both sensuous and sympathetic, her admiring biography lays bare the private lives of her heroines, filling in the bold contours. These women came from vastly different backgrounds, but all ended up passing through Paris, the mecca of the avant-garde. Before she was the toast of Parisian society, Josephine Baker was a poor black girl from the slums of Saint Louis. Tamara de Lempicka fled the Russian Revolution only to struggle to scrape together a life for herself and her family. A committed painter, her portraits were indicative of the age's art deco sensibility and sexual daring. The Brits in the group―Nancy Cunard and Diana Cooper― came from pinkie-raising aristocratic families but soon descended into the salacious delights of the vanguard. Tallulah Bankhead and Zelda Fitzgerald were two Alabama girls driven across the Atlantic by a thirst for adventure and artistic validation. But beneath the flamboyance and excess of the Roaring Twenties lay age-old prejudices about gender, race, and sexuality. These flappers weren't just dancing and carousing; they were fighting for recognition and dignity in a male-dominated world. They were more than mere lovers or muses to the modernist masters―in their pursuit of fame and intense experience, we see a generation of women taking bold steps toward something burgeoning, undefined, maybe a New Woman.",
  "genres": [
    "History",
    "Nonfiction",
    "Biography",
    "Feminism",
    "Womens",
    "Historical",
    "Audiobook"
  ],
  "author": "Judith Mackrell",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/17910069-flappers"
}