{
  "title": "Pillar to the Sky",
  "description": "From William Forstchen, the New York Times bestselling author of One Second After, comes Pillar to the Sky, a towering epic to rank with Douglas Preston's Blasphemy and Michael Crichton's Prey...\n\n\n\nPandemic drought, skyrocketing oil prices, dwindling energy supplies and wars of water scarcity threaten the planet. Only four people can prevent global chaos.Gary Morgan—a brilliant, renegade scientist is pilloried by the scientific community for his belief in a space elevator: a pillar to the sky, which he believes will make space flight fast, simple and affordable.Eva Morgan—a brilliant and beautiful scientist of Ukranian descent, she has had a lifelong obsession to build a pillar to the sky, a vertiginous tower which would mine the power of the sun and supply humanity with cheap, limitless energy forever.Erich Rothenberg—the ancient but revered rocket-scientist who labored with von Braun to create the first rockets and continued on to build those of today. A legend, he has mentored Gary and Eva for two decades, nurturing and encouraging their transcendent vision.Franklin Smith—the eccentric Silicon Valley billionaire who will champion their cause, wage war with Congress and government bureaucracy and most important, finance their herculean undertaking.The Goddard Space Flight Center—the novel's pre-eminent hero, it's enormous army of scientists, engineers and astronauts will design, machine, and build the space elevator. They will fight endless battles and overcome countless obstacles every step of the way.This journey to the stars will not be easy—a tumultuous struggle filled with violence and heroism, love and death, spellbinding beauty and heartbreaking betrayal. The stakes could not be higher. Humanity's salvation will hang in the balance.",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Audiobook",
    "Post Apocalyptic",
    "Space",
    "Science Fiction Fantasy",
    "Dystopia"
  ],
  "author": "William R. Forstchen",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/17910106-pillar-to-the-sky"
}