{
  "title": "The One-Day Contract: How to Add Value to Every Minute of Your Life",
  "description": "A life-changing guide to achieving your goals, by the 2013 NCAA champion college basketball coach and #1 New York Times bestselling author. Rick Pitino is famous as one of the most dynamic and successful basketball coaches of our time, leading the University of Louisville Cardinals to the NCAA basketball championship in 2013, and is renowned for writing the #1 New York Times bestselling success and leadership book, Success is a Choice.In his new book, The One-Day Contract, Pitino details his key to success, on the court and in life: to focus on making the most of each day, by creating a contract with yourself. Coach Pitino was able to turn Louisville into NCAA champions by applying this idea to everything he and the team did—every practice, every recruiting visit, every game preparation, every scouting report, every instruction that he gave players and coaches, and everything he did himself. Each day became just as important as reaching the national championship, and so, by honoring the one-day contract, he and Louisville moved through adversity toward their goal.In this inspiring and practical guide, Coach Rick Pitino illustrates how to set your own one-day contract, and follow through to honor it for each day, each goal, and each interaction with another person. Pitino shows how to:Establish focus as a discipline in everything you do: planning, strategy, priorities, and career advancement.Discover the true key to success: not ambition, not wealth, not power, but humility.Use technology wisely—but don't let it replace personal connection with the people you work and live with.Own up to your problems, tell the truth and they will become part of your past. Lie and they become part of your future.Make small changes and add value to every minute of your life.The One-Day Contract will reshape the way you approach your job, your goals, and your life.",
  "genres": [
    "Sports",
    "Basketball",
    "Self Help",
    "Nonfiction",
    "Inspirational"
  ],
  "author": "Rick Pitino",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/17910379-the-one-day-contract"
}