{
  "title": "Glitter and Glue",
  "description": "From the New York Times bestselling author of The Middle Place comes a new memoir that examines the bond—sometimes nourishing, sometimes exasperating, occasionally divine—between mothers and daughters.  When Kelly Corrigan was in high school, her mother neatly summarized the family dynamic as “Your father’s the glitter but I’m the glue.” This meant nothing to Kelly, who left childhood sure that her mom—with her inviolable commandments and proud stoicism—would remain her father’s understudy for the rest of Kelly’s life, which she was carefully orienting toward adventure. After college, armed with a backpack, her personal mission statement, and a wad of traveler’s checks, she took off for Australia to see things and do things and Become Interesting.   But it didn’t turn out the way she pictured it. In a matter of months, her fanny pack full of savings had dwindled and she realized she needed a job. That’s how Kelly met John Tanner, a newly widowed father of two looking for a live-in nanny. They chatted for an hour, discussed timing and pay, and a week later, Kelly moved in. And there, in that house in a suburb north of Sydney, she suddenly heard her mother’s voice everywhere, nudging and advising, cautioning and directing, escorting her through a terrain as foreign as any she had ever trekked. Every day she spent with the Tanner kids was a day she spent reconsidering her relationship with her mother, turning it over in her hands like a shell, trying to hear whatever messages might be trapped in its shadowy spiral.   This is a book about the difference between travel and life experience, stepping out and stepping up, fathers and mothers. But mostly it’s about who you admire and why, and how that changes over time.From the Hardcover edition.",
  "genres": [
    "Memoir",
    "Nonfiction",
    "Book Club",
    "Audiobook",
    "Biography",
    "Biography Memoir",
    "Parenting"
  ],
  "author": "Kelly Corrigan",
  "average_rating": "3.84",
  "url": "https://www.goodreads.com/book/show/17910557-glitter-and-glue"
}