{
  "title": "Full Dark House",
  "description": "Edgy, suspenseful, and darkly comic, here is the first novel in a riveting new mystery series starring two cranky but brilliant old detectives whose lifelong friendship was forged solving crimes for the London Police Department's Peculiar Crimes Unit. In Full Dark House, Christopher Fowler tells the story of both their first and last case--and how along the way the unlikely pair of crime fighters changed the face of detection.A present-day bombing rips through London and claims the life of eighty-year-old detective Arthur Bryant. For his partner John May, it means the end of a partnership that lasted over half-a-century and an eerie echo back to the Blitz of World War II when they first met. Desperately searching for clues to the killer's identity, May finds his old friend's notes of their very first case and becomes convinced that the past has returned...with a killing vengeance.It begins when a dancer in a risque new production of Orpheus in Hell is found without her feet. Suddenly, the young detectives are plunged in a bizarre gothic mystery that will push them to their limits--and beyond. For in a city shaken by war, a faceless killer is stalking London's theaters, creating his own kind of sinister drama. And it will take Arthur Bryant's unorthodox techniques and John May's dogged police work to catch a criminal whose ability to escape detection seems almost supernatural--a murderer who even decades later seems to have claimed the life of one of them...and is ready to claim the other.Filled with startling twists, unforgettable characters, and a mystery that will keep you guessing, Full Dark House is a witty, heartbreaking, and all-too-human thriller about the hunt for an inhuman killer.",
  "genres": [
    "Mystery",
    "Fiction",
    "Historical Fiction",
    "Crime",
    "Mystery Thriller",
    "Historical",
    "Detective"
  ],
  "author": "Christopher Fowler",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/108531.Full_Dark_House"
}