{
  "title": "Tied to Him",
  "description": "From best selling author Delilah Fawkes, comes another sizzling romance, packed with suspense, sensuality, and a billionaire so hot, he'll leaving you begging for more!This is the third book in the Billionaire's Beck and Call Series, but also be enjoyed as a standalone.Jackson Pierce is a man with a secret...Becoming Governor isn't in the cards for billionaire and former D.A. Jackson Pierce unless he can squelch the unsavory rumors flying around. He's not ashamed of his bad boy past being a dominant at a BDSM club, but he knows the revelation could ruin his political career before it even begins.He's skeptical of his campaign advisor's idea--find a do-gooder wife to give him a more respectable image--until he meets Rose Turner, a former foster kid working in a local community center. Compassionate, feisty and passionate about helping troubled youth, she's perfect for his needs. But as they get to know one another, his feelings for her grow all too real. Rose Turner can't take another heartbreak, not after being abandoned by everyone she ever loved. When she accepts Jackson's proposal, she vows to keep her distance, but the more she gets to know him, the more she wants to let him in. But trust doesn't come easy--if he wants it, he'll have to earn it. As the two draw closer, threats roll in: if Jackson doesn't flip on education reform, a blackmailer will expose the fake marriage, ruining his career and tarnishing Rose's reputation. But if he gives in, funding for the community center will be cut, and Rose's kids will lose it all. With everything on the line, he must make an impossible decision as the clock runs down. What's a man of principle to do when everything he believes in falls apart?Don't miss the other sizzling books in this series, available now:The Billionaire's Beck and Call, Book OneBound to Him: The Billionaire's Beck and Call, Book Two",
  "genres": [
    "BDSM",
    "Erotica",
    "Contemporary Romance",
    "Romance"
  ],
  "author": "Delilah Fawkes",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/17911426-tied-to-him"
}