{
  "title": "Enthrall",
  "description": "Librarian's Note: This is an alternate cover edition of ASIN B00EN0ZKIK\nThis is the world of the forbidden. This is the embrace of Enthrall.\nMia Lauren is a single, twenty-one-year old working in a West Hollywood art store who dreams of one day becoming a fashion designer. When an unexpected offer arises to work at Enthrall, L.A.'s premier fetish club for the wealthy, Mia accepts. It's a salary beyond her wildest imagination.Mia becomes the secretary to the club's assistant director, blond and broody Richard Booth. Richard is not only one of L.A.'s most beautiful and wealthiest men, he is also the club's senior dominant. Mia is both drawn and terrified when he reveals flashes of his white-hot passion, threatening an unbound pleasure like no other. She knows her attraction may be her undoing, but the spellbinding feelings render her powerless to resist his advances. What Mia cannot know is that Enthrall's dashing founder and director thirty-four year old Cameron Cole, who is also the club's psychiatrist, has lured Mia to save his best friend and patient Richard from his obsession with thrill seeking. Cameron masterfully sets up sexy scenarios to ensure the collision of Richard and Mia, hoping that love will save him. However, despite Cameron's noble intentions, he also finds himself enticed by Mia's haunting innocence. Passion and pleasure stir, forming a dangerous love triangle. This is the world of the forbidden. This is the embrace of Enthrall.THE ENTHRALL SESSIONS TRILOGY (now available in box set) is Mia Lauren’s awakening set against the backdrop of the exclusive Enthrall BDSM club in Los Angeles.THE BEYOND ENTHRALL DUET is founder of Enthrall, Cameron Cole’s story, picking up after Enthrall Him, book 3’s ending, but can be read as a stand-alone duet.WITHIN ENTHRALL are stand-alone novellas featuring characters from the Enthrall Sessions trilogy and Beyond Enthrall duet.",
  "genres": [
    "BDSM",
    "Romance",
    "Erotica",
    "Contemporary Romance",
    "Dark",
    "Contemporary",
    "Erotic Romance"
  ],
  "author": "Vanessa Fewings",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/17911879-enthrall"
}