{
  "title": "House of Dark Delights",
  "description": "In this extraordinary debut, Louisa Burton extends an irresistible invitation to an erotic adventure that is quite literally out of this world. Youâ re hereby invited to spend a night youâ ll never forget in the . . .House of Dark DelightsNestled deep in the French countryside, hidden from prying eyes, stands an infamous castle that for centuries has lured guests with its whispered promise to make any erotic dream come true. Inside its walls youâ ll discover a world of sensuality, magic, and mystery, courtesy of the chÃteauâ s residentsâ beautiful and reclusive immortals who strive to fulfill their guestsâ most secret desires even as they pursue their own insatiable gratification. Youâ ll meet a tall, seductive elf who can morph from male to female, a bewitching goddess from ancient Babylonia, a playfully lusty satyr, a djinni obligated to satisfy the unspoken appetites of any human he touches, and a vampire as sexually rapacious as he is bloodthirsty.Within these pages are related the Houseâ s most scintillating encounters, past and present. A pair of modern lovers find themselves captivatedâ and transformedâ by the carnal demands of their hosts. An adventuress visiting with the notorious Hellfire Club stumbles from a black mass into a dungeon fitted out for restraint and discipline, where a brooding stranger turns her darkest longings into reality. A virginal female scientist is awakened by an invisible lover to the pleasures of the flesh. A young couple, forbidden to wed by an ancient taboo, finds hope in a sensual threesome. A journey into the realm of sexual love and erotic passion, House of Dark Delights is sure to leave you feeling enthralled, seduced . . . and utterly ravished.",
  "genres": [
    "Erotica",
    "Fantasy",
    "Romance",
    "Fiction",
    "Paranormal",
    "BDSM",
    "Erotic Romance"
  ],
  "author": "Louisa Burton",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/108532.House_of_Dark_Delights"
}