{
  "title": "Boston's Back Bay: The Story of America's Greatest Nineteenth-Century Landfill Project",
  "description": "Boston’s Back Bay neighborhood is well known today for its upscale residences, high-rise office buildings, fine hotels, and excellent restaurants. Extending from Arlington Street to Massachusetts Avenue, and from the Charles River to the Amtrak and MBTA tracks, the neighborhood includes Commonwealth Avenue, Newbury Street, Boylston Street, the John Hancock and Prudential towers, Copley Square, and the Charles River Esplanade. The Back Bay today contributes heavily to Boston’s image as a prosperous, modern city with a rich historical legacy.Before 1820, however, this region was a tidal marsh that appeared to early settlers as a large bay behind the town when it filled with high-tide water twice each day. Only one road, now Washington Street, extended across a narrow peninsula and connected Boston to the mainland. In the early nineteenth century, Boston expanded by filling in some shallow areas around the edge of the Back Bay. Two dams, constructed to generate power using the tides, cut off the area from the Charles River, dividing it into two the “Full Basin” and the “Receiving Basin.” This book focuses on filling the Back Bay’s largest section, the Receiving Basin. By the 1850s, pollution of the former tidal marsh and severe overcrowding in Boston inspired plans to fill the Receiving Basin. Work on the landfill began in earnest in 1858 and was completed around 1890—and remains the largest residential and commercial landfill project ever carried out in the United States.Opening with a look at the geological history of the Back Bay and its life as a tidal marsh, this fascinating narrative examines the roles of planners, politicians, engineers, and contractors who made it possible to dump millions of tons of sand and gravel into the marsh. Innovative new technologies were needed to excavate, move, and grade the heavy loads, and to construct substantial buildings on very soft ground. Newman and Holton tap into a wide variety of primary sources including rare maps and plans, photography collections, corporate and railroad archives, political documents, deeds, mortgages, and bankruptcy records, all of which underscore the significance of the Back Bay landfill as a central component of Boston’s development from a small town to a major metropolis in the nineteenth century.",
  "genres": [
    "Nonfiction",
    "History"
  ],
  "author": "William A. Newman",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/1791310.Boston_s_Back_Bay"
}