{
  "title": "Georgetown Academy: Book Four",
  "description": "When the vice president resigns and Ellie and Taryn’s parents emerge as the frontrunners, the girls find themselves back in the spotlight.Ellie could not care less about becoming the Second Daughter, but she knows how much the opportunity to make history means to her mother – and women everywhere. With her family taking center stage, Ellie must decide whether she can put her feelings for Gabe on hold - again.Taryn, so used to captivating the hearts and minds of everyone she meets, is unbothered by the increased media scrutiny. But an inopportune screw-up has her beholden to an unlikely – and unfriendly – source for help. Overnight, Evan has skyrocketed from social pariah to Miss Popular. As she and her reluctant parents adjust to her new lifestyle, the last thing she needs is a front-page scandal.Brinley can’t stop thinking about her Stowe-bound hook-up…until her father’s intern, Patrick, starts flirting. Is it time to abandon her fling now that she has a more appropriate suitor?With the second highest office in the land up for grabs, everyone is picking sides. But where does the heart lie when duty, truth, and love collide? What’s Cool from As the party scene at Georgetown Academy gets underway, authors Alyssa and Jessica let readers decide which of the main girls to follow. You’ll see scandalous behavior, unexpected liaisons, and secret betrayals...all giving you a different perspective as events unfold. About the AuthorsJessica Koosed Etting and Alyssa Embree Schwartz met the first day of freshman year at the University of Southern California and instantly bonded over their obsessions with Brenda Walsh, Robin Prince of Thieves and The Babysitters Club books they read growing up. After spending a full year mourning the end of college, they began writing television and feature scripts together. They have set up pilots at ABC, NBC, Fox and CW, and sold films to The Weinstein Company, Happy Madison, Paramount, New Regency, MGM and Alloy Entertainment. They love writing female-centric stories, especially for teen and tween audiences, mainly because they still think they are the 18-year-old girls they were when they first met at USC.www.georgetownacademyseries.com",
  "genres": [
    "Young Adult",
    "Contemporary",
    "Politics"
  ],
  "author": "Alyssa Embree Schwartz",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/17913589-georgetown-academy"
}