{
  "title": "Advent of Darkness",
  "description": "Advent of Darkness was awarded Finalist of the 2014 Indie Excellence Awards in fantasy and Finalist of the 2014 International Book Awards in fiction-fantasy during May of 2014.When veteran and archaeologist John Gideon is transported from Earth by a tall, strange man clothed in ornate red robes, he soon finds himself a stranger in a different world. Unbeknownst to him, the world of Illúmaril is the birthplace of his ancestors and where he truly belongs. Meeting the archmaster wizard Ragan, John is taken under the wizard's wing as a ward and student and begins his journey of exploring this strange new world. From gnomes, elves, and menfolk to surprising new creatures, John is soon befriended by all, as he reestablishes his connection to his ancestor's home world and begins to learn the truth. Hidden on Earth as a child, John's true importance is only beginning to reveal itself as this foreign world becomes home. With his world turned upside down, John continues to learn about his past and more importantly, of the vital destiny that he has to fulfill.Advent of Darkness is the first story and part of the epic fantasy series, The Chronicles of Illúmaril. Styled after the timeless Lord of the Rings series, this sweeping novel is packed with action and adventure that will instantly hook science-fiction and fantasy fans everywhere. Sword and sorcery at its finest, this excellent story will take readers on an amazing journey through intense conflict and an awe-inspiring new world. With its huge scope and thrilling adventure, this is one novel that deserves a place in every reader's collection.Following John Gideon and his adventures while trying to find his place in society, as well as his destiny, Advent of Darkness takes readers to the wonderful new world of Illúmaril. Embracing all sides of the conflict, the novel uniquely uses epic voices to describe what's happening across the landscape while still using John Gideon as the main character and tool for describing his and his companions' points of view. Utilizing dramatic fantasy and exhilarating action and adventure, this thrilling sword and sorcery novel sets a new standard for epic fantasy.",
  "genres": [],
  "author": "Gary Caplan",
  "average_rating": "3.32",
  "url": "https://www.goodreads.com/book/show/17914776-advent-of-darkness"
}