{
  "title": "Deacon's Winter: One man's quest for justice",
  "description": "\"From the moment a bloody and battered woman came into my church for refuge, I was drawn into a web of blackmail, torture, murder and corruption of the highest order in Chicago politics. I'd have to put aside my own crisis of faith and help her. It was a necessary part of my calling.\" Those are the words of Deacon Adelius protagonist of my new thriller, \"Deacon's Winter.\" Deacon works and struggles with his issues of faith at Saint Sebastian's Catholic Church in the tough Chicago neighborhood where he grew up. He is a product of the streets, and the contacts he's retained--as well as the moves he learned in the Army--help him survive, and in his own way, do the work of the Church. He is also an \"Announcer,\" within a secret society of the Church, called \"The Gabrians,\" who have developed a unique system of ridding the Church of its sexual predators. One late winter's night, a battered woman takes refuge in his church. Deacon helps to protect her. She is a high-end madam who is blackmailing the candidates for Mayor and Governor. She is discovered, Deacon is wounded and she is taken. When she's found murdered wearing Deacon's sweatshirt, he becomes a suspect. Thus he and his friends and the murdered woman's sister are drawn into a world of wickedness and terror. With mounting urgency, he'll draw on the people closest to him to clear himself even as he searches frantically for the information that will set him free and protect the people he loves. He must also prevent the assassination of a Cardinal and stop the politicians behind the plot as he battles a professional killer. \"Deacon's Winter,\" is a story that could be pulled from the front pages of any Chicago newspaper. It is the story of a man struggling to do the work of God in the midst of Chicago's dark alleys and political foul play. If you enjoy good thriller stories as much as I do, \"Deacon's Winter,\" should appeal to those of you who appreciate engaging characters, edge-of-the-seat suspense and adventures in the darker side of of the human soul.",
  "genres": [],
  "author": "Roger I. Burgraff",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/17915107-deacon-s-winter"
}