{
  "title": "The Unofficial Recipes of The Hunger Games: 187 Recipes Inspired by The Hunger Games, Catching Fire, and Mockingjay",
  "description": "\"What must it be like, I wonder, to live in a world where food appears at the press of a button? How would I spend the hours I now commit to combing the woods for sustenance if it were so easy to come by?\" -- Katniss Everdeen The Hunger Games trilogy captivates its audience through a storyline dominated by the quest for food, with the vast culinary disparity between the impoverished districts and the opulent Capitol taking center stage. Food is both a weapon and an act of love, and -- as in today's world -- it is essential to survival. Fortunately, most of us inhabit a more prosperous world than the tributes, one where food can appear with the press of a button or two. THE UNOFFICIAL RECIPES OF THE HUNGER GAMES Savor the post-apocalyptic world of Panem one dish at a time with The Unofficial Recipes of The Hunger Games. Offering 187 recipes, this cookbook serves fans an authentic taste of the Hunger Games trilogy, whether foraged for in the impoverished District 12 or devoured at the lavish banquets of the Capitol. Satisfy your appetite with the recipes savored by the tributes: * Peeta's Burnt Raisin Nut Bread * Orange Chicken in Cream Sauce * Beloved Lamb Stew With Dried Plums Consume the dishes inspired by the trilogy's heroic characters: * Creamy Roasted Katniss Soup * Prim's Birthday Venison Steaks * Gale's Venison Pot Roast Hunt like Katniss and Gale for adventurous ingredients and create daring dishes: * Greasy Sae's Holiday Stuffed Possum * Hazelle's Authentic Beaver Stew Transport your senses into the world of The Hunger Games, Catching Fire and Mockingjay, and relish the delicious adventures of the trilogy over and over again.",
  "genres": [
    "Cookbooks"
  ],
  "author": "Rockridge Press",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/17915906-the-unofficial-recipes-of-the-hunger-games"
}