{
  "title": "Lifted: A Cultural History of the Elevator",
  "description": "Before skyscrapers forever transformed the landscape of the modern metropolis, the conveyance that made them possible had to be created. Invented in New York in the 1850s, the elevator became an urban fact of life on both sides of the Atlantic by the early twentieth century. While it may at first glance seem a modest innovation, it had wide-ranging effects, from fundamentally restructuring building design to reinforcing social class hierarchies by moving luxury apartments to upper levels, previously the domain of the lower classes. The cramped elevator cabin itself served as a reflection of life in modern growing cities, as a space of simultaneous intimacy and anonymity, constantly in motion. In this elegant and fascinating book, Andreas Bernard explores how the appearance of this new element changed notions of verticality and urban space. Transforming such landmarks as the Waldorf-Astoria and Ritz Tower in New York, he traces how the elevator quickly took hold in large American cities while gaining much slower acceptance in European cities like Paris and Berlin. Combining technological and architectural history with the literary and cinematic, Bernard opens up new ways of looking at the elevator--as a secular confessional when stalled between floors or as a recurring space in which couples fall in love. Rising upwards through modernity, Lifted takes the reader on a compelling ride through the history of the elevator. Andreas Bernard is editor of Suddeutsche Zeitung, Germany's largest daily newspaper. He received his Ph.D. in Cultural Sciences from the Bauhaus University Weimar, and teaches cultural studies in Berlin and Lucerne, Switzerland.“The elevator, which today seems so boring, was once a vehicle of change of compelling power. Whoever reads this book will view the world’s elevators with different eyes.”-Frankfurter Allgemeine Zeitung",
  "genres": [
    "Nonfiction",
    "History"
  ],
  "author": "Andreas Bernard",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/17918200-lifted"
}