{
  "title": "Evil in a Small Town",
  "description": "Was Samantha Wilds targeted for murder? Small towns hold very few secrets, and as Samantha’s sister, Sarah, hones in on her instincts it becomes apparent a deadly plot is brewing. The question is who’s behind the attack on Sarah’s sister, and why? The aftermath of a brutal attack in a small town takes Sarah Wilds on a journey to learn the secrets that brought on this attack. Nearly run down by a speeding car, Sarah soon finds herself the newest target, and it becomes clear this secret is far too menacing to allow these sisters to live. To add to this mystery, Sarah’s partner, Gideon Glass blows into town to help unravel this intricate puzzle. It becomes clear Sarah gets too close to learning the truth, and before long, her nemesis kidnaps her. Sarah gives the fight of her life while shuddering at the thought of her impending death -- and then someone comes to her rescue. Sarah finally acknowledges she has feelings for her hero and allows herself to fall in love, and it’s a welcomed distraction from all the painful events. But is this yet another trap that leads her directly to her killer’s lair? She still has unanswered questions. Who rescued her? Was it Gideon and if so, how did he find her? Just when you think it’s safe, dangerous curves take us on another thrilling ride until the end of the book.Suspense, fierce courage and the pursuit of a secret has become fathomable page-turners that are sure to please. This well-written, thrilling storyline has so many wists and turns, it keeps you guessing and anticipating more. “Stormy Raines” has captured the perfect cat-and-mouse mystery, with a combination of gutsy suspense, and a bit of romance thrown in. With its explosive intensity, it surely sets a commanding presence among murder mysteries. While this book certainly stands out on its own, you won’t want to miss what she has coming next.",
  "genres": [],
  "author": "Stormy Raines",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/17917949-evil-in-a-small-town"
}