{
  "title": "Hanukkah in America: A History",
  "description": "In New Orleans, Hanukkah means decorating your door with a menorah made of hominy grits. Latkes in Texas are seasoned with cilantro and cayenne pepper. Children in Cincinnati sing Hanukkah songs and eat oranges and ice cream. While each tradition springs from its own unique set of cultural references, what ties them together is that they all celebrate a holiday that is different in America than it is any place else. For the past two hundred years, American Jews have been transforming the ancient holiday of Hanukkah from a simple occasion into something grand. Each year, as they retell its story and enact its customs, they bring their ever-changing perspectives and desires to its celebration. Providing an attractive alternative to the Christian dominated December, rabbis and lay people alike have addressed contemporary hopes by fashioning an authentically Jewish festival that blossomed in their American world. The ways in which Hanukkah was reshaped by American Jews reveals the changing goals and values that emerged among different contingents each December as they confronted the reality of living as a religious minority in the United States. Bringing together clergy and laity, artists and businessmen, teachers, parents, and children, Hanukkah has been a dynamic force for both stability and change in American Jewish life. The holiday's distinctive transformation from a minor festival to a major occasion that looms large in the American Jewish psyche is a marker of American Jewish life. Drawing on a varied archive of songs, plays, liturgy, sermons, and a range of illustrative material, as well as developing portraits of various communities, congregations, and rabbis, Hanukkah in America reveals how an almost forgotten festival became the most visible of American Jewish holidays.\"Hanukkah, traditionally a minor Jewish festival, grew like a beanstalk in America, becoming one of Judaism’s most widely celebrated holidays. In this definitive history, Dianne Ashton explains how this happened, and what it teaches us about America, about religion, and about Jews.\"-Jonathan D. Sarna, author of American Judaism: A History",
  "genres": [
    "Judaism",
    "Nonfiction",
    "Jewish",
    "Religion",
    "History"
  ],
  "author": "Dianne Ashton",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/17918154-hanukkah-in-america"
}