{
  "title": "How the World Became Quiet",
  "description": "After a powerful sorceress is murdered, she's summoned over the centuries to witness devastating changes to the land where she was born. A woman who lives by scavenging corpses in the Japanese suicide forest is haunted by her dead lover. A man searches for the memory that will overwrite his childhood abuse. Helios is left at the altar. The world is made quiet by a series of apocalypses. From the riveting emotion and politics of 'The Lady Who Plucked Red Flowers beneath the Queen's Window' (Nebula winner) to the melancholy family saga of 'Eros, Philia, Agape' (Hugo and Theodore Sturgeon finalist), Rachel Swirsky's critically acclaimed stories have quickly made her one of the field's rising stars. Her work is, by turns, clever and engaging, unflinching and quietly devastating--often in the space of the same story. How the World Became Quiet: Myths of the Past, Present, and Future collects the body of Swirsky's short fiction to date for the first time. While these stories envision pasts, presents, and futures that never existed, they offer revealing examinations of humanity that readers will find undeniably true.Table of contents…The Lady Who Plucked Red Flowers Beneath the Queen’s WindowMonstrous EmbraceThe Adventues of Captain Blackheart Wentworth: A Nautical TaleHeartstrungMarrying the SunA Monkey Will Never Be Rid of Its Black HandsThe Sea of TreesFields of GoldEros, Philia, AgapeThe Monster’s Million FacesAgain and Again and AgainDiving After the MoonScenes from a DystopiaThe Taste of PromisesWith Singleness of HeartDispersed by the Sun, Melting in the WindHow the World Became Quiet: A Post-Human Creation MythSpeech Strata",
  "genres": [
    "Fantasy",
    "Short Stories",
    "Fiction",
    "Science Fiction",
    "Novella",
    "Speculative Fiction",
    "Science Fiction Fantasy"
  ],
  "author": "Rachel Swirsky",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/17921102-how-the-world-became-quiet"
}