{
  "title": "Defensive Wounds",
  "description": "In this fourth novel in Lisa Black's captivating suspense series, forensic investigator Theresa MacLean finds herself embroiled in a case in which everyone has a motive and everyone is a suspect—especially when high-powered defense attorneys start turning up dead.   When Marie Corrigan, a Cleveland defense attorney with a history of falsifying evidence and no shortage of enemies, is found dead in the presidential suite at the Ritz-Carlton, most people would agree that she had it coming. Forensic investigator Theresa MacLean is summoned to the crime scene by her daughter, Rachel, who is working the front desk. But even before Theresa enters the room, she knows that she's walking into a forensic nightmare—for crime scenes at hotels, even the most luxurious, are teeming with trace evidence that has been left behind by innumerable guests and may or may not be related to the murder. But what Theresa finds is even worse than she imagined.   Given the positioning of Marie's body, everyone assumes the same thing—that it's a lovers' tryst turned lethal. But large questions remain: How did the killer gain access to the room without anyone's knowledge? And has the scene been staged for their benefit? The little evidence Theresa has is conflicting at best. What's more, a legal convention at the hotel provides an endless list of suspects—and potential victims.   When two more bodies show up in quick succession, each in a similar state, Theresa's investigation takes on a whole new urgency as she fears they may have a serial killer on their hands—a serial killer with a vendetta. But as she searches for the threads that tie the cases together, Theresa begins to suspect that she and her daughter are closer to danger than they realize. And a mother will stop at nothing to protect the life of her child.",
  "genres": [
    "Mystery",
    "Fiction",
    "Mystery Thriller",
    "Audiobook",
    "Thriller",
    "Suspense",
    "Crime"
  ],
  "author": "Lisa Black",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/10854062-defensive-wounds"
}