{
  "title": "Losing My Breath",
  "description": "A princess and a…grump?Battle lines are drawn and sparks ignite when sheltered debutante Meridian Daly moves next door to grumpy veteran Marine Callan Brand. But can Callan let go of his pride and tell Meridian the whole truth of who he is and what he’s done—in the name of honor and country?A steamy, new adult grumpy x sunshine romcom with military vibes and a focus on mental health issues.\"This book is hot, hilarious, and devourable.\" - International Review of Books...one of those rare “unputdownable” page-turners... - Indie Reader ⭐️⭐️⭐️⭐️⭐️——————— Official Description ———————-A Marine never says die. Neither does his princess.Battle lines are drawn when sheltered debutante Meridian Daly moves across the hall from grumpy former special forces Marine Callan Brand. Situated a bit closer than advertised to 'crime alley', Meridian’s neighbor finds himself grudgingly guarding the pampered princess out of habit. But with her sharp wit and killer curves, he can’t help but surrender to temptation…When their relationship evolves from casual courtship to something more, Callan finds that Meridian's already discovered his closely-guarded secret. But can he let go of his pride, and tell her the whole truth of who he is and what he’s done—in the name of honor and country?As Callan’s scars start to reveal themselves, his life spirals beyond the careful control that's helped him survive—and kept those he cares about safe. From him.But this tough-in-a-tiara princess won't back down, even in Callan’s darkest hours. And Meridian just might prove to be more tenacious than a never-say-die Marine!——————— Awards / Editorial Reviews ———————- 1st Runner Up, Eric Hoffer Award - Romance  Distinguished Favorite, Independent Press Award - Romantic Comedy Gold Medal, BookFest Awards - Romantic Comedy First Place, Incipere Awards - Women's Fiction\"Losing My Breath is a heartfelt romance novel in which opposites attract--and do the work to make their love last.\"- Foreword Clarion Reviews  ⭐️⭐️⭐️⭐️\"...engaging characters, touching love story, generous dashes of playful, crackling humor, and seriously steamy...\" - Indie Reader ⭐️⭐️⭐️⭐️\"In J. Rose Black's enchanting novel, Losing My Breath, readers are swept away on a delightful and unexpectedly heartwarming journey...this book is a must-read.\" - Literary Titan ⭐️⭐️⭐️⭐️⭐️\"...an emotionally driven romance that will quench readers' thirst for passion...\" - Readers View ⭐️⭐️⭐️⭐️⭐️\"... J Rose Black has crafted a fascinating romance.\" - BookTrib Short List, Eric Hoffer Award - Grand Prize for fiction  Silver Medal, BookFest Awards - Military Fiction Silver, Wishing Shelf Awards - Adult Fiction Second Place, Incipere Awards - Romance Winner, Literary Titan Gold Book Award (Dec 2023) Winner, Firebird Book Awards - Romantic Comedy, and New Adult Fiction Finalist, Indies Today",
  "genres": [
    "Contemporary",
    "Book Club",
    "Novels",
    "Romance",
    "Drama",
    "Military Fiction",
    "Adult"
  ],
  "author": "J. Rose Black",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/179272668-losing-my-breath"
}