{
  "title": "Such Great Heights",
  "description": "One part Gatsby, one part John Green, and one part Lana Del Rey... The perfect summer cocktail.\"The easy life is sometimes the hardest life of all.\" The words rang false to seventeen-year-old Charlie Middle when he first heard his cousin Maisey utter them, between sips of her gold-flaked martini. But by the end of his summer in California, they were among the truestwords he had ever heard. Such Great Heights is a retelling of The Great Gatsby, by way of Social Network and Less Than Zero. Author, Chris Cole, puts a millennial wardrobe on the Jazz Age classic, mashing up the styles and imagery of Brett Easton Ellis, F. Scott Fitzgerald and John Green into a new and timely voice.We are offered a ringside seat for the impossible love story of kid billionaire Joss Stember and heiress Maisey Landing. Told in heartbreaking detail through the eyes of Charlie, we watch these young lovers as they fight against the ceaseless waves of the past in a passionate attempt to make their way toward the shores of the present. Battling their own demons, and the demons that seem to prey upon them at every turn.Through the lens of recently graduated Midwest teen, Charlie Middle, we are afforded a rarefied glimpse into a lifestyle that is usually kept under lock and key. Charlie's innocent summer internship in Silicon Valley quickly morphs into a crucible of excess and intrigue amidst the one percent of the one percent--fraught with star-crossed lovers, million dollar cars, 24-hour parties, high-tech billionaires and a pageantry of excess that would have put Sodom and Gomorrah to shame, let alone East and West Egg. Such Great Heights is a novel for the Instagram generation, a generation for whom nostalgia is a stylish accessory and instant messages are sacred texts.★ 2013 IndieReader Summer Book Pick (Coming of Age)★ 2013 SF Weekly Summer Book Pick",
  "genres": [
    "Young Adult",
    "Retellings",
    "Contemporary",
    "Romance",
    "New Adult",
    "Contemporary Romance",
    "Coming Of Age"
  ],
  "author": "Chris    Cole",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/17927432-such-great-heights"
}