{
  "title": "Bloodfire Quest",
  "description": "NEW YORK TIMES BESTSELLERThe adventure that started in Wards of Faerie takes a thrilling new turn, in the second novel of Terry Brooks’s brand-new trilogy—The Dark Legacy of Shannara!The quest for the long-lost Elfstones has drawn the leader of the Druid order and her followers into the hellish dimension known as the Forbidding, where the most dangerous creatures banished from the Four Lands are imprisoned. Now the hunt for the powerful talismans that can save their world has become a series of great a desperate search for kidnapped comrades, a relentless battle against unspeakable predators, and a grim race to escape the Forbidding alive. But though freedom is closer than they know, it may come at a terrifying price.   Back in the village of Arborlon, the mystical, sentient tree that maintains the barrier between the Four Lands and the Forbidding is dying. And with each passing day, as the breach between the two worlds grows larger, the threat of the evil eager to spill forth and wreak havoc grows more dire. The only hope lies with a young Druid, faced with a staggering cling to the life she cherishes or combat an army of darkness by making the ultimate sacrifice.Includes a preview of the next book in the Dark Legacy of Shannara series, \nWitch Wraith\n\nPraise for Bloodfire Quest   “Explodes from the first page . . . and the action doesn’t stop until the novel’s cliffhanger ending. . . . Intense and exhilarating . . . The author balances character development with intense action, and he has a gift for creating characters the reader cares about. Brooks is one of the best fantasy writers in the business, and Bloodfire Quest is better than its predecessor.”—Associated Press   “Shannara fans will delight in Brooks’s sorcerous action, skilled characterizations, and rapid-fire storytelling twists.”—Publishers Weekly   “Brooks mixes things up here with several sharp battle scenes, for which he brings his distinct talent, giving a true grandeur to clashes involving terrifying creatures and powerful magic. . . . A fine middle chapter to Brooks’ latest Shannara adventure.”—Kirkus Reviews   “From the first pages to the harrowing ending, Bloodfire Quest . . . is a thrill ride that will leave readers wanting more. . . . This volume, paired with the first, might be just the right place to introduce new readers to this fine writer.”—Booklist (starred review)   Praise for Terry Brooks   “I can’t even begin to count how many of Terry Brooks’s books I’ve read (and reread) over the years. From Shannara to Landover, his work was a huge part of my childhood.”—Patrick Rothfuss, New York Times bestselling author of The Name of the Wind   “Terry Brooks has been my constant companion over a lifetime of exploring my beloved fantasy genre. I say with all honesty I would not be writing epic fantasy today if not for Shannara. If Tolkien is the grandfather of modern fantasy, Terry Brooks is its favorite uncle.”—Peter V. Brett, New York Times bestselling author of The Desert Spear   “Terry Brooks is a master of the craft and a trailblazer who established fantasy as a viable genre.",
  "genres": [
    "Fantasy",
    "Fiction",
    "Epic Fantasy",
    "Science Fiction Fantasy",
    "High Fantasy",
    "Magic",
    "Audiobook"
  ],
  "author": "Terry Brooks",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/17927960-bloodfire-quest"
}