{
  "title": "The Apollo Academy",
  "description": "The Apollo Academy has been picked up by Escape, Harlequin Australia and will be re-released February 2015.Take off with this dynamic, thrill-seeking, sexy New Adult Science Fiction series debut. Welcome to the exclusive Apollo Academy, where Aurora is about to discover that achieving her dream is only the first step towards her future.As the heiress to Titon Technologies, eighteen-year-old Aurora Titon can have whatever she wants—clothes, expensive gadgets, anything money can buy. But all she really wants is to escape her pampered, paparazzi-infested life for the stars. Becoming the first female pilot to train as an astronaut for the exclusive Apollo Academy is exactly the chance for which she has been waiting.Flying is everything she ever dreamed, her best friend also got into the Academy, and the paparazzi is banned from campus. Everything would be perfect, but for her unreciprocated crush on a fellow student, the sexy astronaut bent on making her life hell, and the fact that someone keeps trying to kill her.The most important education doesn’t happen in the classroom…Praise for The Apollo Academy: \"I am obsessed with this book! Suspenseful, sexy, and just a great read!\" -Cora Carmack, New York Times Bestselling author of LOSING IT.“Exquisite worldbuilding, thrilling suspense, and a sexy flight instructor! Chase’s exciting debut novel is one you don’t want to miss.” - K.A.Tucker, Author of Ten Tiny Breaths and One Tiny Lie \"Chase’s first in a four-part series is fast-paced, thrilling and wildly imaginative. Though it takes place more than 100 years in the future, the author makes the world feel contemporary, and it’s a breeze to follow — unlike heavier sci-fi. Aurora is unforgettable and a great role model for new adult fans because she is the epitome of strength. The sexy pilots add just enough spice to this space saga.\" -RT BOOK REVIEWS",
  "genres": [
    "Science Fiction",
    "New Adult",
    "Romance",
    "Young Adult",
    "Dystopia",
    "Space",
    "Fantasy"
  ],
  "author": "K.P. Lovely",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/17928444-the-apollo-academy"
}