{
  "title": "The Spirits' Book",
  "description": "When two \"grave and serious\" spirits began speaking to a French academic through two young mediums and \"completely revolutionized [his] ideas and convictions,\" Allan Kardec decided to set down these spiritualistic revelations. The result electrified the high society of the mid 19th century, which was already fascinated by \"spirit tapping\" and other paranormalities, and earned Kardec-a pseudonym his spirits commanded him to use-a place in this history of the paranormal as the father of spiritism. Kardec \"interviews\" the spirits, asking more than 1000 questions about morality, the nature of the soul, the history of humanity, and more, including: . \"Is the soul reincarnated immediately after its separation from the body?\" . \"Does the spirit remember his corporeal existence?\" . \"Could two beings, who have already known and loved each other, meet again and recognise one another, in another corporeal existence?\" . \"What is to be thought of the signification attributed to dreams?\" . \"Are good and evil absolute for all men?\" . \"What is the aim of God in visiting mankind with destructive calamities?\" . \"Is it possible for man to enjoy perfect happiness upon the earth?\" Promising nothing less than the secret of the destiny of the human race, this extraordinary book, first published in 1856, is as curious today as it was a century and a half ago. French scholar HIPPOLYTE LEON DENIZARD RIVAIL (1804-1869), aka Allan Kardec, was a longtime teacher of mathematics, astronomy, and other scientific disciplines before turning to the paranormal. He founded the Parisian Society of Psychologic Studies, and founded and edited the monthly magazine La Revue Spirite, Journal of Psychologic Studies. He is also the author of The Gospel as Explained by Spirits (1864).",
  "genres": [
    "Spirituality",
    "Religion",
    "Nonfiction",
    "Philosophy",
    "Occult",
    "Paranormal",
    "Self Help"
  ],
  "author": "Allan Kardec",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/1792894.The_Spirits_Book"
}