{
  "title": "Ithaca Road",
  "description": "Chamada às pressas pelo irmão mais velho para tomar o seu lugar na condução do Paddington Sour, um bar-restaurante situado numa das mais badaladas ruas de Sydney, Narelle chega da Irlanda, sendo imediatamente absorvida por uma realidade familiar e desafiadora.Para essa neozelandesa mestiça de maori com europeu, o retorno inusitado à cidade forçará um inevitável acerto de contas com o passado. A começar pelo irmão, que parece ter fugido do país para evitar as consequências de um complicado processo de falência. Enquanto cruza o tortuoso mundo dos burocratas e advogados, Narelle tenta acalmar os ânimos de funcionários e fornecedores do bar-restaurante, de modo a evitar que o seu funcionamento seja interrompido.Seu namorado, um jornalista investigativo idealista, está no Brasil cobrindo uma história de crimes relacionados à extração de minério de ferro. Conforme procura dar conta de um impasse no relacionamento cada vez mais à distância, Narelle também precisa negociar com antigos afetos que ressurgem, como até então nunca havia ocorrido.É nesse cenário conturbado que ela vai conhecer Anna, uma garota misteriosa que passa os dias desenhando no parque. Narelle sofre de psoríase, e a aspereza e a sensibilidade extrema de sua pele parecem por vezes reproduzir sua relação com o mundo. Nesse encontro inesperado com a menina que parece nunca sair de seu próprio mundo, a protagonista descobrirá uma nova mediação entre si e tudo que deixou para trás quando resolveu abandonar uma vida regular na Austrália. A partir da relação tênue e frágil desses dois personagens, Paulo Scott, uma das vozes mais vigorosas e originais da atual ficção brasileira, constrói uma delicada história de amor e companheirismo, de escolhas definitivas e coragem, e ainda assim tão imprevisível e verdadeira quanto qualquer paixão.",
  "genres": [],
  "author": "Paulo Scott",
  "average_rating": "2.72",
  "url": "https://www.goodreads.com/book/show/17929567-ithaca-road"
}