{
  "title": "Totally Tormented",
  "description": "Dangerous. Sexy. Damaged. These are the words used to describe Justin Brown.Intelligent. Capable. Responsible.These are the words used to describe Lindsay Cramer.Irresistible. Addicting. Passionate.These are the words used to describe their relationship.Good girl Lindsay Cramer has her life completely in order, and she keeps her goals on a checklist -- obtain scholarship to Ivy League University, finish undergrad, and move on to med school. She’s worked hard to get where she is, and she’s determined not to let anything – or anyone -- get in her way.Until she meets Justin Brown. JB is gorgeous, and the kind of guy who is all wrong for Lindsay -- the kind of guy who is all wrong for anyone . He drinks, he fights, and he has a secret past Lindsay’s not so sure she wants to know about.But when the two of them are together, Lindsay can’t help but lose herself in him. It’s the way his eyes burn when he looks at her. The way his smile makes her dizzy. The way his hands feel on her body.Soon, Lindsay and Justin are completely addicted to each other. But when their dangerous game culminates with Lindsay having to make a shocking choice, will she be able to keep JB in her life? And if so, will she lose everything in the process?EXCERPT:“I would never do anything to hurt you, Lindsay. You know that, right?”I nodded. But I wasn’t so sure. It wasn’t that I thought he would try to hurt me. It was that I could feel myself starting to get consumed by him. I was giving him the ability to hurt me just by letting him get so close. It was like tying yourself to a train track, just waiting to get run over. It wouldn’t be the train’s fault if it couldn’t stop in time – but you’d get hurt anyway, because you’d be lying there, like a sitting duck.“Come on,” he said, running his palms down my arms until he got to my hands. He intertwined his fingers with mine and then pulled them up so they were at eye level. It was totally sexy, and yet he made it seem somehow innocent, like we were playing a game of patty-cake or something.My breathing was accelerating and my heart was pounding. How could he stand there seemingly so cool while we were talking about showering together? Was it because he did this with tons of girls, all the time? No doubt he was more experienced than I was. He had a body that was built for sex, and I was sure girls were throwing themselves at him whenever and wherever they could.“I can’t.” I shook my head. But my will was starting to crumble.“Please,” he whispered. He wasn’t joking around anymore. Instead, he sounded intense. I wondered if he was as turned on as I was, not that I could imagine being any more turned on. My body felt like it was going to explode.",
  "genres": [],
  "author": "Lucy Covington",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/17929692-totally-tormented"
}