{
  "title": "The Vampire Armand",
  "description": "In The Vampire Armand, Anne Rice returns to her indomitable Vampire Chronicles and recaptures the gothic horror and delight she first explored in her classic tale Interview with the Vampire (in which Armand, played by Antonio Banderas in the film version, made his first appearance as director of the Théâtre des Vampires).The story begins in the aftermath of Memnoch the Devil. Vampires from all over the globe have gathered around Lestat, who lies prostrate on the floor of a cathedral. Dead? In a coma? As Armand reflects on Lestat's condition, he is drawn by David Talbot to tell the story of his own life. The narrative abruptly rushes back to 15th-century Constantinople, and the Armand of the present recounts the fragmented memories of his childhood abduction from Kiev. Eventually, he is sold to a Venetian artist (and vampire), Marius. Rice revels in descriptions of the sensual relationship between the young and still-mortal Armand and his vampiric mentor. But when Armand is finally transformed, the tone of the book dramatically shifts. Raw and sexually explicit scenes are displaced by Armand's introspective quest for a union of his Russian Orthodox childhood, his hedonistic life with Marius, and his newly acquired immortality. These final chapters remind one of the archetypal significance of Rice's vampires; at their best, Armand, Lestat, and Marius offer keen insights into the most human of concerns.The Vampire Armand is richly intertextual; readers will relish the retelling of critical events from Lestat and Louis's narratives. Nevertheless, the novel is very much Armand's own tragic tale. Rice deftly integrates the necessary back-story for new readers to enter her epic series, and the introduction of a few new voices adds a fresh perspective--and the promise of provocative future installments. --Patrick O'Kelley",
  "genres": [
    "Horror",
    "Vampires",
    "Fantasy",
    "Fiction",
    "Paranormal",
    "Supernatural",
    "Urban Fantasy"
  ],
  "author": "Anne Rice",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/10855819-the-vampire-armand"
}