{
  "title": "Baumgartner Box Set 1",
  "description": "Babysitting the Baumgartners Ronnie―or as Mrs. Baumgartner insists on calling her, Veronica―has been babysitting for the Baumgartners since she was fifteen years old and has practically become another member of the family. Now a college freshman, Ronnie jumps at the chance to work on her tan in the Florida Keys with \"Doc\" and \"Mrs. B\" under the pretense of babysitting the kids. Ronnie isn't the only one with ulterior motives, though, and she discovers that the Baumgartners have wayward plans for their young babysitter. This wicked hot sun and sand coming of age story will seduce you as quickly as the Baumgartners seduce innocent Ronnie and leave everyone yearning for more! Warnings: This title contains sand, sun, micro-bikinis, graphic language, seriously erotic erotica, lesbian sex, anal sex, sex toys, a MFF ménage a trois (threesome) between an older couple and their teen babysitter that may set your Kindle on fire (or your print pages if you haven't yet been Kindle-assimilated) and a coming-of-age fantasy that will rock your world.------------------ A Baumgartner Reunion Ronnie (or “Veronica” as Mrs. B always insisted on calling her) is all grown up with a family of her own, and the Christmas she babysat for the Baumgartners is just a pinpoint in her memory. That is, until a persistent suggestion of a threesome by her husband, T.J., brings it all flooding back. When she reveals how the Baumgartners and the nanny, Gretchen, had seduced her during her time in Key West, her husband takes it upon himself to make some phone calls. Opportunity, or perhaps fate, presents itself, and Ronnie and her husband get an invitation to join Gretchen and the Baumgartners on their vacation. Ronnie finds herself torn, once again, between what she wants and what someone else wants for her—or are they, after all, one in the same? Warning: This title contains erotic situations, graphic language, sex, and so much a ménage a trois (MFF threesome) action you just may begin to chafe!------------------ Baumgartner Generations: Henry Henry’s in trouble. He’s gone from being a big fish in a little pond in his home town to being a very small fish in a much bigger pond at college, and he’s just not keeping up.  Instead of passing him through his classes because of his athletic ability like they did in high school, he discovers his professors actually mean it when they say he needs to do the work or he’s going to fail his classes―and be kicked off the all-star hockey team.  Adjusting to life at university sure isn’t as easy or fun as he thought it was going to be―his roommate likes the same girl he does, and it looks like she likes him, too; he’s failing English for sure and the dragon-lady who teaches the class seems to have a personal vendetta against him; and his hockey coach has even gone so far as to bench him!  When his parents hire him a tutor, he turns to this angel of mercy for help, but little does he realize that Mrs. Toni Franklin is going to complicate his life in ways he never could have foreseen… Warning: This title contains erotic situations, graphic language, sex, and a sex toy and masturbation scene that you have to read to believe!Word Count: 161,000",
  "genres": [
    "Erotica",
    "BDSM",
    "Romance"
  ],
  "author": "Selena Kitt",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/17931557-baumgartner-box-set-1"
}