{
  "title": "Netherworld",
  "description": "What would you do if a demon threatened your mother's life? If you're like Koa, you'd sharpen your enchanted sword and go after him... Our world is threatened by the creatures of an alternate land called the Netherworld. Koa and the Netherworld division are there to keep the vampire population in check. Koa is a powerful half-blood vampire. Her best friend is her boss, she has a cursed mother, an enchanted sword, and an attractive human pet. Koa also has a problem. A Netherworld serial killer, with a taste for little girls, threatens everything Koa has worked hard to protect. Not even Koa's boss, Halston can stop him. But he knows one prisoner that can. Too bad that prison is in the Netherworld. Is Koa ready to journey to the Netherworld to release the one creature that can break her mother's curse and protect all that she holds dear? **Bonus Material** Someone has stolen classified documents from the Netherworld division's vaults. Read the secret interviews that were leaked to the press, and discover the hidden clues of Dark Prophet and Lyrinian Blade (The Chronicles of Koa #2 & #3) Editorial Reviews: “The Chronicles of Koa is a wonderful story full of likeable characters, a clear world, and a fun mission.” Kirstin L. Pulioff, author of The Escape of Princess Madeline ~~~ “It has a fantastic story, twists and turns throughout, and some mysteries you won't see coming. I'm looking forward to reading more of her books as she writes them. The Chronicles of Koa #2 will certainly be a day one purchase for me!” Thomas Ray Manning, author of Energize (From the Logs of Daniel Quinn) ~~~ “The ending had me on edge. I have to say I have not read a vampire novel like this one before.” Glenna Maynard, author of Beautiful Strangers ~~~ “The author has created an engrossing world with vampires, angels and other mythical creatures. And not just any mythical creatures, her creations were... awesome!” Morgan Jane, author of the Sanguis City series",
  "genres": [
    "Fantasy",
    "Paranormal",
    "Vampires",
    "Urban Fantasy",
    "Paranormal Romance",
    "Demons",
    "Angels"
  ],
  "author": "K.N. Lee",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/17931645-netherworld"
}