{
  "title": "رؤيا الفرعون الأخيرة",
  "description": "الطبعة الثانية من الرواية تصدر بالتزامن مع معرض الكتاب2015  تحت عنوان \"سرُّ العابر\"..----------------- يرتاد بنا \"محمد الجيزاوي\" فضاءً أدبياً مهجوراً، عزفت عن التجوال في جنباته أقلام الكاتبين من أهل العربية لعقودٍ خلَت، وكُنا نحسب أن أحداً منهم لن يعاود الاجتراء على الدلوف إلى غياهب جمالياته، ولو على سبيل المغامرة والنزق. غير أن \"الجيزاوي\" فعلها، حاملاً على عاتقه مسؤولية مجابهة ذائقة معاصرة، لجمهور رَكَن زمناً طويلاً إلى مقولاتٍ من قبيل: (التجريب)، و(التجديد)، و(الأجناس الأدبية الهجينة)، و(النصوص المتجاوزة لنوعها). وفي خضمّ هذا الانجراف خلف تلقُّف كل وافدٍ ومستجلَبٍ من نتاجات الدوائر الأدبية الغربية المعاصرة، مما يتم (تعريبه)، و(تمصيره)، وإعادة تعديله - بل و(استنساخه) أحياناً - بما يوافق حال (سوق) النشر العربي، ظن الجميع أن ثمة قطيعة أبدية قد حُسِمَت للأبد، بين أقلام الروائيين العرب وتراثهم، ولاسيما منه التراث المؤسس على مقولات استلهام النصوص المقدسة، واستهداء جماليات الكتب السماوية. يوغل \"الجيزاوي\" بعيداً في مغامرته، حتى يطاوِل حدود النزق الجسور في رهانه الروائي؛ فها هو يتخير موضوعاً لا ككُل الموضوعات محوراً لنصه الروائي، فيعمد إلى (أحسن القصص)، مستظلاً بسياق حكاية \"الصِدّيق يوسف\" عليه السلام، ليبُث من خلالها وعَبرها - بهدوءٍ هامسٍ - رؤيته الخاصة والحداثية لأزمة الفرد المستنير، ومجابهته لأسئلته الوجودية الكبرى، واكتشافه لحقائق المنظومة التاريخية الشوهاء في آن. وكأن \"الجيزاوي\" باختياره هذا يتحدى عتاة القصاصين والشعراء الفُرْس، الذين طالما أثروا مدوّنات الأدب الإسلامي بنصوص استلهمت النص الكريم ذاته، والتي ربما يكون أشهرها قصة \"يوسف وزليخا\" الرائجة في الذائقة الشعبية الفارسية، وما يتاخمها من أصقاع إسلامية متعددة الثقافات.ولكي يدمغ تجربته بالحس الفائض من فرادة التناول، يعمد \"الجيزاوي\" إلى النَفَس الشعري الغنائي، ليتخذه سبيلاً للبوح وأداة للترنيم في نصه الجديد، ليجعلك تحار في التصنيف ويلتبس عليك أمر التحديد، أهي رواية؟ أم تراها قصيدة من تلكُم القصائد المطوّلات التي بات الشعراء يهابون الاقتراب من قُدسِها؟ هل هو نص مسرحي شعري مما هجره الأدب العربي لعقود خَلَت؟ أم تراه نص من ذلك الصنف التجاوزي؟في كل الحالات لا مفر أمامك من الالتحام المباشر بتجربة \"محمد الجيزاوي\"، لتتمكن من صوغ إجابتك الخاصة على الأسئلة السالفة. وسواءٌ استطعت الإجابة أم لم تستطع، فحسبُك أنك اقتنصت متعة لا سبيل إلى تحاشي الوقوع في فخها المنصوب بدهاء الإبداع.د. ياسر منجي______________ ناقد مصري استاذ بكلية الفنون الجميلة وصاحب مؤلفات عديدة فى تاريخ الفن والحضارات",
  "genres": [],
  "author": "محمد الجيزاوي",
  "average_rating": "3.51",
  "url": "https://www.goodreads.com/book/show/17931640"
}