{
  "title": "Passion, Power & Sin - Books 1-5",
  "description": "This is the complete 5 book series.One spectacular financial scheme. One woman alone against the world. Young, beautiful, and yearning for love, Heather Bancroft meets the \"perfect\" man...and is lured into a game in which she begins to make more money than she ever imagined. Betrayed by her own innocence, she loses all that is dear to her and discovers that she has been mercilessly used. Defeated and broken, but surviving with sheer persistence and ingenuity, Heather emerges from her trying ordeal, determined to punish the ruthless man who destroyed her life. Her thirst for revenge takes her halfway around the globe, to the turquoise waters of the Mediterranean, where her nemesis secludes himself in obscene wealth that he's gained from the financial ruin of others. Heather is playing for the highest stakes in a lethal game. Only one man loves her - he's handsome, confident, and just as determined as she is. Only one man can stop her - a criminal mastermind who is intent on her destruction.From Jayne Lockwood ReviewsThis is another enormously enjoyable read from Mr. Wells. Heather is young, beautiful, living and working in New York City. There she gets involved in a dangerous game which seems to be the answer to all her financial worries. AND she meets her perfect man. Life is going swimmingly until she loses everything and has to claw it back, pitting her wits against an elusive millionaire whose get rich quick schemes have resulted in the ruination of countless other people. There is intrigue, tension, international travel, glamour, gleaming yachts, designer clothes, beautiful women, peril on the streets of Paris, murder and sex. It's all in there, a luscious mix of Sidney Sheldon and Shirley Conran, updated and fresh enough to stand tall in the 21st century. I could not put this book down. It was a huge amount of fun but more than that, it has stayed with me and is definitely one I will be recommending to anyone who wants a more than just a sexy romp through a millionaire's playground.Reviewed by David Savage, What's Good to Do MagazineA story of money, greed, scams, revenge and love! A 24 year old PR assistant, Heather Bancroft, is one of the people caught up in an elaborate scam. She starts to receive strange emails predicting the outcomes of things she can bet on...and these bets take her around the world to Japan onto Istanbul... A very well-written series of books where the pace does not let up from Book 1 to the final pages of Book 5. Filled with twists and turns that grab your attention and keep you reading...suspense and thrills and keeps you on the edge on your seat wanting more. A highly entertaining read, it has to be one of the best stories I have read in years.",
  "genres": [
    "Audiobook"
  ],
  "author": "Mike Wells",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/17932625-passion-power-sin---books-1-5"
}