{
  "title": "Inevitable",
  "description": "Thanks to her mother’s unstable moods and knack for making bad decisions, seventeen year old Maddie Davis has never lived in one place long enough to remember its postcode. A life spent running and caring for her wayward mother has turned British-born Maddie into the strong, outspoken and independent girl she is today – if not a little lonely. This time, running away is a whole new ballgame. For the first time her mum is not just dragging her to a different town – but a whole new country. It is only when they arrive in sunny California to be near Trudy - an old friend of her mum’s - Maddie starts to hope they’ve reached their final destination. For the first time she dreams of a future. She makes friends, commits to an education and meets a boy who has the potential to steal her heart… and break it even faster.Trudy’s stepson Blaine Elwood appears to have it all. To the outside world quarterback Blaine is rich, confident and has the ‘arrogant bad boy’ image down to a tee. But nobody knows what goes on behind closed doors. Nobody ever can. He has vowed never to let anyone get too close – let anyone discover how weak he is. So when new girl Maddie starts tugging at strings he didn’t know existed in his heart, his only option is to push her away – until he realises how much he needs her.Maddie and Blaine are heading for a future neither of them dreamed of – a happy one. But then, not only are Blaine’s issues at home intensifying, he discovers a shocking secret that could either send Maddie back running and force her out of his life forever, or pull them closer than they’ve ever been before. Will their shattered secrets leave too many broken shards to piece back together, or was their love inevitable from the start?(Not recommended for younger readers due to language and sexual content)",
  "genres": [
    "New Adult",
    "Romance",
    "High School",
    "Abuse",
    "Contemporary Romance",
    "Young Adult",
    "Contemporary"
  ],
  "author": "Nicola Haken",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/17932573-inevitable"
}