{
  "title": "Twice a Rake",
  "description": "Librarian Note: Alternate cover edition - ASIN B004XR01DC.Some scandals are meant to be . . .When Aurora Hyatt loses her journal in Hyde Park, her ruin is a foregone conclusion. After all, if anyone discovers her writings, they'll find scandalous fantasies involving the newest rake in Town alongside entirely-too-candid thoughts about her typical dreary suitors. Aurora will either be forced into a loveless marriage with the first nodcock to make an offer, or she'll be assigned a permanent position on the shelf. Oh, dear good Lord. What catastrophe will God smote down upon her next?If Niles Thornton, Baron Quinton, desires to maintain any semblance of his current lifestyle, he must fulfill the requirements his grandfather has set for him. First and foremost: he must marry and begin filling his nursery within the year. When he is nearly barreled over by a racing curricle and a journal flies out to land at his feet, his troubles are over. Inside the journals pages, Quin discovers a scandal waiting to happen. Surely a young lady who would write such brazen things in a journal (and then dare to lose it) must recognize the necessity of a hasty marriage, even if the gentleman making the offer is rather less-than-honorable.In a drunken haze, Quin kisses Aurora on a crowded ballroom floor, necessitating their immediate marriage. Quin's troubles are only beginning, however, as Aurora's writings are soon the focus of both gossip rags and drawing room conversation. When word arrives of an even greater scandal following in his wife's wake, will he prove himself a drunken abuser like his father, or will he become the loving husband of Aurora's fantasies?",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Regency",
    "Historical Fiction",
    "Regency Romance",
    "Fiction"
  ],
  "author": "Catherine Gayle",
  "average_rating": "3.62",
  "url": "https://www.goodreads.com/book/show/17932772-twice-a-rake"
}