{
  "title": "Tapping the Source",
  "description": "If you aren't already familiar with Kem Nunn's 1984 novel Tapping the Source, or if the idea of a \"classic surfing novel\" makes you either chuckle or shudder, be prepared to realign your literary biases. This is not a story of gilded surfers and sun-bleached blonds, of insouciant days and moonlit nights on the beach; instead, Nunn has crafted a darkly pensive meditation on solitude and desire. Ike Tucker is the quintessential loner, trapped by both circumstance and inclination in a California desert town, abandoned first by his mother and then by his sister, Ellen, who fled, in turn, toward the promise of the coast. His awareness of his own alienation, rendered in prose that is always elegant and often poignant, is haunting: As he listened the train sounds grew faint and disappeared and someone shut off the music so there was just the silence, that special kind of silence that comes to the desert, and he knew that if he waited there would come a time, stars fading, slim band of light creeping on the horizon, when the silence would grow until it was unbearable, until it was as if the land itself were about to break it, to give up some secret of its own. The secret, though, comes not from the desert but from the sea. Propelled by a mysterious rumor of his sister's murder, Ike enters the surfing mecca of Huntington Beach, whose bright façade conceals shadowy violence and joyless violation. Wistfully intent on understanding the men who might have killed his sister, Ike abandons himself to the hypnotic allure of the ocean: \"The tide was low and the waves turned crisp black faces toward the shore while trails of mist rose from their feathering lips in the golden sun.\" Nunn's language effortlessly reflects Ike's desires and fears; the novel spirals gracefully into the young man's eventual immersion in the surfing culture and riffs on the terrifying ease with which that immersion becomes overwhelming. Although a murder may lie at the heart of the narrative, the novel is far more an exploration of character than of suspect and motive--and that exploration is infinitely rewarding. --Kelly Flynn",
  "genres": [
    "Fiction",
    "Mystery",
    "Crime",
    "Noir",
    "Thriller",
    "Audiobook",
    "Novels"
  ],
  "author": "Kem Nunn",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/17933571-tapping-the-source"
}