{
  "title": "A Brewing Storm",
  "description": "Get your copy now at a massive 87% discount for a few weeks only!! The Fall of the  The Weavers are a mystical race, created by the old Gods eons ago. They bestride the Shadow Worlds as Gods themselves, involving themselves in the politics and power of those Worlds. Now the Shadow Worlds are dying and Master Weavers are disappearing.It falls to two sworn enemies to discover the truth of what is happening, but can they work together and ignore the passion that blazes between them? Can they move from enemies to friends, and maybe even more, when everything is aligned against them?With only a small group of allies they can rely on, the two men find themselves facing a conspiracy that stretches back centuries and encompasses the whole of the Shadow Worlds, and the Weavers entire existence may be called into question. A Brewing Storm by E.J. Sutter Book One in the The Fall of the Weavers series.If you enjoyed Reluctant Mateby Eden Cole and Silent Secrets by Lynn Hagen then this is absolutely perfect for you!The Shadow Worlds are dying. Can two sworn enemies manage to get past their differences and ignore their burning attraction to each other long enough to save them?Brandon is a Weaver, a member of an old, powerful race. His discovery that Master Weavers are disappearing, presumed murdered, is a shock. Even more so when he realises that the person responsible is not actually a person at all, but a Revenant, and worse, the creature also known as the Abomination.Things are not quite how they seem, however.Jaime is a Revenant, a creature born from death and designed to do his Master's bidding. He's been living in the shadows for years. Now, the Shadow Worlds are dying, Weavers are disappearing, and Jamie is no longer the only Revenant to survive their Master.Can these two men ignore the hatred, and the passion, that burns between them, and work together to find out just what is happening to the Universe around them?They must uncover age old secrets of the Weavers, and defeat enemies who are closer to them than they'd realised.E.J. Sutter About the   E.J Sutter hails from the North West of the UK, specifically Liverpool. She currently lives in the wilds of Lancashire with two cats and two extremely stupid dogs. She has been scribbling ever since she was a child when, at the tender age of 7, she had a poem published in a local anthology. This led to a life long hatred of poetry, as she was then expected to be able to write it! In fact, she wrote the poem in about five minutes, as she'd wasted the whole of the lesson talking, and wasn't allowed out at playtime until she'd finished it.Stories, however, have been tumbling out of her brain for as long as she can remember, but she's only just got around to putting them down on her laptop.",
  "genres": [
    "M M Romance",
    "Fantasy",
    "Paranormal",
    "Magic",
    "Romance",
    "Science Fiction"
  ],
  "author": "E.J. Sutter",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/17933780-a-brewing-storm"
}