{
  "title": "Off Course",
  "description": "A bear climbs onto a cabin's deck, presses his nose to the sliding door. Inside, a young woman stands to face him. She comes closer, and closer yet, until only the glass stands between them . . .The year is 1981, Reagan is in the White House, and the country is stalled in a recession. Cressida Hartley, a gifted Ph.D. student in economics, moves into her parents' shabby A-frame cabin in the Sierras to write her dissertation. In her most intimate and emotionally compelling novel to date, Michelle Huneven--author of Blame , which was a finalist for the National Book Critics Circle Award--returns with her signature mix of fine-grained storytelling, unforgettable characters, and moral complexity.Cress, increasingly resistant to her topic (art in the marketplace), allows herself to be drawn into the social life of the small mountain community. The exuberant local lodge owner, Jakey Yates, with his big personality and great animal magnetism, is the first to blur Cress' focus. The builder Rick Garsh gives her a job driving up and down the mountain for supplies. And then there are the two Morrow brothers, skilled carpenters, who are witty, intriguing, and married.As Cress tells her best friend back home in Pasadena, being a single woman on the mountain amounts to a form of public service. Falling prey to her own perilous reasoning, she soon finds herself in dark new territory, subject to forces beyond her control from both within and without.Unsentimental, immersive, and beautifully written--\"Huneven's prose is flawless,\" according to The New Yorker-- Off Course evokes the rapture of new love, the addictive draw of an intense, impossible connection, and what happens when two people simply can't let go of each other or of their previous commitments. As her characters struggle with and delight in one another, Huneven subtly exposes the personal and social forces at issues of class, money, and family, as well as the intricate emotional and economic transactions between parents and children, between husbands and wives, between lovers, and between friends.Michelle Huneven is one of our most searching, elegant novelists--Richard Russo has called her \"a writer of extraordinary and thrilling talent.\" In Off Course , she introduces us to an intelligent young woman who discovers that love is the great distraction, and impossible love the greatest distraction of all.",
  "genres": [],
  "author": "Michelle Huneven",
  "average_rating": "3.38",
  "url": "https://www.goodreads.com/book/show/17934513-off-course"
}