{
  "title": "Encounter in Rendlesham Forest: The Inside Story of the World's Best-Documented UFO Incident",
  "description": "Over a series of three nights in December 1980 an extraordinary series of UFO incidents took place in Rendlesham Forest in the UK, next to the twin United States Air Force bases of Bentwaters and Woodbridge. This was not some vague sighting of lights in the sky, but a controlled landing and take-off. The UFO was tracked on military radar and left physical evidence at the landing site, including damage and scorch marks on trees, indentations in the frozen ground, and abnormally high levels of radiation. The UFO was seen by dozens of military witnesses, including the Deputy Base Commander. The object fired light beams at some of the men and, later, into the Weapons Storage Area, where some military personnel based there at the time allege that nuclear weapons were kept. Encounter in Rendlesham Forest tells the extraordinary story of the world’s most compelling and best-evidenced UFO incident – a case that is more significant than the infamous Roswell Incident. Co-written by former UK government UFO investigator Nick Pope, with John Burroughs and Jim Penniston, the two military witnesses at the heart of these encounters, this disturbing and compelling book tells the inside story of what really happened, and lifts the lid on the true role played by government, the military and the intelligence community in relation to the UFO phenomenon. This controversial new book is largely based on recently declassified government documents and is the only UFO book ever to have needed security clearance from both the British and American governments. Encounter in Rendlesham Forest will leave you questioning everything you thought you knew about the UFO mystery.",
  "genres": [
    "Nonfiction",
    "Paranormal",
    "History",
    "Aliens",
    "Mystery",
    "Audiobook",
    "Mythology"
  ],
  "author": "Nick Pope",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/17934510-encounter-in-rendlesham-forest"
}