{
  "title": "Blood Lite III: Aftertaste",
  "description": "The third book in the hilarious and horrifying national bestselling anthology series from the Horror Writers Association--a frightfest of sidesplitting stories from such \"New York Times\" bestselling authors as Jim Butcher, Sherrilyn Kenyon, Heather Graham, L.A. Banks, Kelley Armstrong, and many more! Horror fiction explores the dark side of human nature, often pushing the limits of violence, graphic gore, and extreme emotions. But with the popularity of shows and movies, such as \"The Walking Dead,\" \"True Blood,\" \"Twilight,\" \"Buffy the Vampire Slayer,\" audiences have demonstrated their love for the genre--especially accompanied with a dose of humor to tone down the terror.\"Blood Lite III: Aftertaste\" continues to put the fun back into dark fiction, featuring a wide range of humorous and highly entertaining horror-filled tales. Edited by Horror Writers Association founding member and award-winning author Kevin J. Anderson, the stories vary in tone from wry to downright laugh-out-loud funny. Featuring such well-known horror writers as Jim Butcher, Sherrilyn Kenyon, Christopher Golden, and many others, this collection of tales is perfect for anyone who enjoys being entertained as much as they love a good scare.Contents:I was a teenage Bigfoot / Jim Butcher --Blood-red greens / Joel A. Sutherland --V plates / Kelley Armstong --Put on a happy face / Christopher Golden --Devil's contract / E.S. Magill --Nine-tenths of the law / Eric James Stone --Scrumptious bone bread / Jeff Strand --Let that be a lesson to you / Mark Onspaugh --Mint in box / Mike Baron --Great zombie invasion of 1979 / J.G. Faherty --Dating after the apocalypse / Stephen Dorato --Typecast / Jeff Ryan --Making the cut / Mike Resnick, Lezli Robyn --Acknowledgments / Will Ludwigsen --Mannequin / Heather Graham --Short term / Daniel Pyle --Distressed travelers / Nina Kiriki Hoffman --Bayou brawl / L.A. Banks --Steeple people / John Alfred Taylor --For sale / David Sakmyster --Man who could not be bothered to die / Norman Prentiss --Last demon / Don D'Ammassa --Misadventure to call your own / Adrian Ludens --Smoke and mirrorballs / Chris Abbey --Brians!!! / D.L. Snell --Still life / Ken Lilli-Paetz --Day in the life / Sherrilyn",
  "genres": [
    "Urban Fantasy",
    "Fantasy",
    "Anthologies",
    "Short Stories",
    "Paranormal",
    "Horror",
    "Fiction"
  ],
  "author": "Kevin J. Anderson",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/10857421-blood-lite-iii"
}