{
  "title": "The Living",
  "description": "Newbery Award-winning author Matt de la Peña's The Living is \"a rare thing: a plot-driven YA with characters worthy of a John Green novel.” [Entertainment Weekly, A-]\n\n\n\n\n   Shy takes the summer job to make some money. A few months on a luxury cruise liner--how bad can it be? Bikinis, free food, maybe even a girl or two . . . every cruise has a fresh crop of passengers, after all. He'll rake in the tips and be able to help his mom and sister out with the bills.    But then, an earthquake more massive than any ever recorded hits California and Shy's life is changed forever. The earthquake is only the beginning. Twenty-four hours and a catastrophic chain of events later, Shy is lost at sea, fighting to survive--and stuck with her.  She's blond and she's rich, and never in her life would she have dreamed she'd be adrift in the Pacific Ocean, surrounded by death and completely dependent on a guy like Shy.  And Shy hasn't even faced the worst yet.\n  \nLook for the thrilling sequel, The Hunted, in bookstores now!\n\n\n\n\n\n\n\nPraise for The Living:\n \n“De la Peña has created a rare thing: a plot-driven YA with characters worthy of a John Green novel.”-Entertainment Weekly, A-   “Action is first and foremost. . . . De la Peña can uncork delicate but vivid scenes.” —The New York Times “[The Living] is special because of its extraordinary protagonist, Shy, who I haven’t been able to shake from my mind in the weeks since I read the book.”-John Green, author of The Fault in Our Stars\"There's no way to classify The Living. It's everything I love mixed into one fantastic, relentless, action-packed story. As always with Matt, the characters are the best part. So real. I loved this book.\"-James Dashner, #1 New York Times bestselling author of the Maze Runner series\n\n[STAR] \"An addictive page-turner and character-driven literary novel with broad appeal for fans of both.\"-Kirkus Reviews, Starred[STAR] \"An excellent, enthralling ride...a great read for those looking for adventure and survival stories.\"-VOYA, StarredA Pura Belpré Author Honor Award WinnerAn ALSC Notable Children's Book PickFrom the Trade Paperback edition.",
  "genres": [
    "Young Adult",
    "Adventure",
    "Survival",
    "Fiction",
    "Science Fiction",
    "Mystery",
    "Teen"
  ],
  "author": "Matt de la Peña",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/17934892-the-living"
}