{
  "title": "The Making of Our Bodies, Ourselves: How Feminism Travels across Borders",
  "description": "The book Our Bodies, Ourselves is a feminist success story. Selling more than four million copies since its debut in 1970, it has challenged medical dogmas about women’s bodies and sexuality, shaped health care policies, energized the reproductive rights movement, and stimulated medical research on women’s health. The book has influenced how generations of U.S. women feel about their bodies and health. Our Bodies, Ourselves has also had a whole life outside the United States. It has been taken up, translated, and adapted by women across the globe, inspiring more than thirty foreign language editions. Kathy Davis tells the story of this remarkable book’s global circulation. Based on interviews with members of the Boston Women’s Health Book Collective, the group of women who created Our Bodies, Ourselves , as well as responses to the book from readers, and discussions with translators from Latin America, Egypt, Thailand, China, Eastern Europe, Francophone Africa, and many other countries and regions, Davis shows why Our Bodies, Ourselves could never have been so influential if it had been just a popular manual on women’s health. It was precisely the book’s distinctive epistemology, inviting women to use their own experiences as resources for producing situated, critical knowledge about their bodies and health, that allowed the book to speak to so many women within and outside the United States. Davis provides a grounded analysis of how feminist knowledge and political practice actually travel, and she shows how the process of transforming Our Bodies, Ourselves offers a glimpse of a truly transnational feminism, one that joins the acknowledgment of difference and diversity among women in different locations with critical reflexivity and political empowerment.",
  "genres": [
    "Feminism",
    "Nonfiction",
    "History",
    "Womens",
    "Sexuality"
  ],
  "author": "Kathy Davis",
  "average_rating": "3.85",
  "url": "https://www.goodreads.com/book/show/1793603.The_Making_of_Our_Bodies_Ourselves"
}