{
  "title": "Alexander's Choice",
  "description": "Sweet-natured, intelligent and good-looking, thirteen-year-old aristocrat Alexander Aylmer seems to have everything going for him when he goes to Eton, the prestigious English public school. Within months, however, tragedy strikes, leaving him vulnerable, heartbroken and increasingly alone, forced to find his own emotional salvation in a world that is effectively uncaring despite its good intentions. The longings recently come with puberty aggravate his turmoil until he sees the solution to them is the key to everything. Two very different people seem to promise help. Timid Julian Smith, three years older, nurses two secrets he is terrified the other boys might discover: his humble background as the son of a removals man who had saved all his life to send a son to Eton, and his being hopelessly in love with Alexander. Damian Cavendish, a charming, young English master, is romantically only interested in women. He is conscious though of a special affinity with boys that has brought him to Eton determined to teach and befriend them. He burns too with a longing to find himself badly needed. By luck and pluck, Alexander finds his way to unsurpassed happiness. But can he really get away with making his own choices as to how, without regard to what society has decided in advance is good for him? Alternately uplifting and heart-wrenching, and at times erotic, Alexander’s Choice candidly depicts a kind of passionate love the world is averse to recognising. It also reveals unflinchingly the brutal reality that can face a boy trying to have his emotional needs met in a society fallen into frightened confusion about the sexuality of early teens. Edmund Marlowe, himself an old boy of the school, has in this, his first novel, accurately evoked the idiosyncratic but appealing world of Eton, which carried on in many of its centuries-old ways, but could not protect its own against the new spirit of the 1980s.",
  "genres": [
    "Coming Of Age",
    "Gay"
  ],
  "author": "Edmund Marlowe",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/17936183-alexander-s-choice"
}