{
  "title": "Dark Child (the Awakening): The Omnibus Edition",
  "description": "Perfect for fans of The Mortal Instruments series by Cassandra Clare, this intriguing urban fantasy follows the story of Kat Chanter, who discovers that the world she knows is controlled by ancient creatures who feed on blood. And she might just be one of them ...Lately things have been getting weird for pathology technician Kat Chanter. She's been craving raw meat, and having dreams so realistic they're scary. When she accepts a job offer from the prestigious Hema Castus Research Institute, she hopes she'll have the chance to discover what's wrong with her, but instead, her move to New York thrusts her headlong into a treacherous hidden world, where the wrong move could be fatal . . .Tarot, witchcraft and astrology all take on a frightening resonance in Dark Child 's richly imagined alternative reality where vampiric beings live among us, hidden by magic. Dark romance tangles with paranormal fantasy and page-turning suspense in this enthralling tale of 'dark child' Kat Chanter, half human and half vampire, who has woken an ancient prophecy and must face a formidable destiny.Dark Child (The Awakening): Omnibus Edition is the first book in the Dark Child series. This is a full length novel. Dark Child (The Awakening)*: Omnibus Edition bundles together Dark Child (The Awakening) Episodes 1-5. Look out for the next in this series, Dark Child (Covens Rising) : Omnibus Edition available late August/early September 2014.*Dark Child (The Awakening) was originally published in 2013 as Dark Child Episodes 1-5 and Dark Omnibus Edition.Recommended Dark Child reading order Dark Child (The Awakening) Omnibus Editionfollowed byDark Child (Covens Rising) Omnibus Edition",
  "genres": [
    "Paranormal",
    "Vampires",
    "Urban Fantasy",
    "Fantasy",
    "Romance",
    "Shapeshifters",
    "Supernatural"
  ],
  "author": "Adina West",
  "average_rating": "3.77",
  "url": "https://www.goodreads.com/book/show/17936753-dark-child-the-awakening"
}