{
  "title": "Out in Colorado",
  "description": "This collection brings six talented authors from the Centennial State together under one title, all offering their take on what it means to be \"Out in Colorado\". These stories explore the cultures and mores of the state as only native authors can, each bringing a unique perspective on the diverse peoples and changing attitudes that are quickly coming to define this state in transition.First, in \"Something Old, Something Blue\", Justin Pauldino, the adopted son of Denver's Italian mob boss, is a one night stand kind of guy and likes it that way, until his latest bed partner, Michael Blu, upsets his applecart world enough to make him consider settling down. When Justin decides to put his best foot forward with Michael—a third generation attorney, whose father and grandfather have an unpleasant history with Justin's adoptive father—Justin's world is turned upside down when his good intentions set in motion a series of events that will change his life forever. Then, Joey Graham has demonstrated his \"Casual Brilliance\" and landed the job of his dreams out of school; the only catch is that he has to move to Colorado to do it. Fortunately, Joey's got a new coworker who's more than happy to introduce him to everything his new home has to offer. Next, in a yearly tradition, five friends had gotten together in a cabin in the winter mountains of Colorado, but one of them has been lost for years. This year, all five friends will be back together and discover secrets that will change their lives forever, in \"Spirit's Fire\".In \"Take a Bow\", Brandon's daughter's wedding is approaching quickly, and the nervous father realizes that if he is to keep from embarrassing his little girl during the father-daughter dance, he needs some lessons pronto. But the gorgeous and charismatic dance instructor, Crispin, has Brandon too distracted to learn when all he can think of is dragging the man down for some dancing of a more horizontal sort. Next, stuck in an abusive relationship with the cultured and sophisticated (and closeted) Ethan, a relationship that is quickly spiraling downward, Trevor feels \"Frozen\", lost and left behind as everything spins on around him. When a sudden turn of violence forces Trevor to face the tragedy that his life has become and make a hard choice, it could be the awakening he needs, or it could be the last decision he ever makes. Finally, being an otter shifter, though fun, comes with its own set of problems for Lon, not the least of which is the need to be in his shifted form for at least a few hours every week. This biological imperative threatens his budding romance with University of Colorado adjunct professor Corey when an accident in the back country leaves Lon unable to make his shift without revealing his furry secret, in \"Slip/Slide/Snow\".",
  "genres": [
    "Anthologies",
    "M M Romance"
  ],
  "author": "Caitlin Ricci",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/17937069-out-in-colorado"
}