{
  "title": "At the Bottom of the Garden: A Dark History of Fairies, Hobgoblins, Nymphs, and Other Troublesome Things",
  "description": "At the Bottom of the Garden is a history of fairies from the ancient world to the present. Steeped in folklore and fantasy, it is a rich and diverse account of the part that fairies and fairy stories have played in culture and society.The pretty pastel world of gauzy-winged things who grant wishes and make dreams come true--as brought to you by Disney's fairies flitting across a woodland glade, or Tinkerbell's magic wand--is predated by a darker, denser world of gorgons, goblins, and gellos; the ancient antecedents of Shakespeare's mischievous Puck or J.M. Barrie's Peter Pan. For, as Diane Purkiss explains in this engrossing history, ancient fairies were born of fear: fear of the dark, of death, and of other great rites of passage, birth and sex. To understand the importance of these early fairies to pre-industrial peoples, we need to recover that sense of dread.This book begins with the earliest manifestations of fairies in ancient civilizations of the Mediterranean. The child-killing demons and nymphs of these cultures are the joint ancestors of the medieval fairies of northern Europe, when fairy figures provided a bridge between the secular and the sacred. Fairies abducted babies and virgins, spirited away young men who were seduced by fairy queens and remained suspended in liminal states.Tamed by Shakespeare's view of the spirit world, Victorian fairies fluttered across the theater stage and the pages of children's books to reappear a century later as detergent trade marks and alien abductors. In learning about these often strange and mysterious creatures, we learn something about ourselves--our fears and our desires.",
  "genres": [
    "Nonfiction",
    "History",
    "Mythology",
    "Folklore",
    "Fairy Tales",
    "Reference",
    "Research"
  ],
  "author": "Diane Purkiss",
  "average_rating": "3.72",
  "url": "https://www.goodreads.com/book/show/1793710.At_the_Bottom_of_the_Garden"
}