{
  "title": "It's Not Over",
  "description": "He had wanted her to help him win his ex-girlfriend back. She had wanted to teach him a few lessons on how to treat a woman. Neither one planned for the unexpected.Madison Stuart thrives on self-discipline and control. She’s driven by her career ambitions and isn’t about to let anyone derail her from her goals. Over the years, Madison uses sex for sport, believing love is an illusion. For months, she sat on the sidelines tutoring her student, Rick Marin, on the art of wooing a woman’s heart. Little did she expect that it would be her heart that he’d manage to win. Unable to watch the man she’s fallen for love another woman, she makes the spontaneous decision to leave town and put some distance between them. What she needs more than anything else is distance and to forget. Just when she thinks she’s gotten a clean getaway, the past knocks on her door, and her future aspirations are on the line. Madison goes deeper into survival mode to secure her legacy and her secrets. She’s Madison Stuart. She lives life by her rules, and no one is going to get in her way.Rick Marin is impulsive, passionate, and a man on a mission. Using his charm and good-looks, Rick manipulates women day in and day out for his own advantage. When he finally figures out that he’s been chasing the wrong woman, he tries to right the wrong. Little by little, he realizes just how deep his feelings for Madison run. Ready to face her and take their relationship to the next level, she’s nowhere to be found. Unable to reach her by phone, desperation takes over. Rick switches to autopilot. He’d rather swallow his pride than the bitter pill of regret. But when jealousy runs rampant, can he look beyond the facade and see what’s been right in front of him the entire time? The past is unforgiving, the present is unsympathetic, and the future is uncertain. Can these two very difficult and stubborn individuals overcome when everything is stacked up against them?Follow The Do Over’s most notorious couple, Rick and Madison, as they learn that It’s Not Over.",
  "genres": [
    "Romance",
    "New Adult",
    "Contemporary Romance",
    "Amazon",
    "Contemporary",
    "Chick Lit",
    "Love"
  ],
  "author": "A.L. Zaun",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/17937669-it-s-not-over"
}