{
  "title": "Land of Second Chances: The Impossible Rise of Rwanda's Cycling Team",
  "description": "Hailed as \"the sports book of the year,\" Land of Second Chances is the inspiring true story of four men who found a new hope for Rwanda. Meet Adrien Niyonshuti, Tom Ritchey, Jonathan Boyer, and Paul Kagame. In a land clamoring for heroes, they confront impossible odds as they struggle to put an upstart cycling team on the map--and find redemption in the eyes of the world. Land of Second Chances is an inspirational story of hope and victory for Africa. Though Rwanda is a tiny, landlocked country dropped like a pebble on the equator, it is a lush and beautiful land fertile with hope and searching for a new identity. So when its best young bike racer, Adrien Niyonshuti, becomes obsessed with earning a slot to compete in the London Olympic Games, all eyes turn to him. Supporting Adrien is his coach, Jonathan Boyer, the first American to race in the Tour de France. Also Tom Ritchey, an inventor of the mountain bike who comes to Rwanda with money and a vision to help coffee farmers raise their standard of living with a new breed of bike. And there is Paul Kagame, the president of Rwanda, a man piecing together an egalitarian future for his country but who is all too susceptible to the corruption of power. Land of Second Chances is the incredible true story of struggle, hope, and the life-giving promise of redemption through the unifying power of sport. \" Land of Second Chances is a tale that quite brilliantly portrays the power of sport to effect change. Superb, a must-read.\" -- Huffington Post \"Lewis is a reporter of rare skill and he writes with wit and verve. Land of Second Chances is\" ¦the sports book of the year by a backcountry mile.\" -- Esquire UK \"The best sports book of the year.\" -- Podium CafÃƒ © \"Tim Lewis's fascinating story of Rwandan cycling isn't a typical rags to riches, triumph against adversity tale\" ¦ This is also a story about the potential of African cycling and its undoubted capacity to change lives.\" -- The Guardian \" Land of Second Chances transcends most sports books.\" -- Boston Globe \"Well sourced, with encyclopedic references to those in the cycling world, Land of Second Chances is set on the cusp of an extraordinary moment in the sport, with Africa poised to start producing contenders.\" -- Booklist of the American Library Association \"Lewis places cycling at the heart of Rwanda's changing fortunes by stitching together various stories and providing excellent, cogent synopses of the political and social history of the country\" ¦[An] intelligent, thoughtful social history\" ¦\" -- Library Journal Books for Dudes \"Team Rwanda's story could have been edited into an uplifting tale of unlikely success, with Niyonshuti's Olympic appearance as the rousing finale. Instead this is a more complicated, darker, account.\" -- Financial Times",
  "genres": [
    "Cycling",
    "Nonfiction",
    "Sports",
    "Africa",
    "Rwanda",
    "Biography",
    "History"
  ],
  "author": "Tim   Lewis",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/17937822-land-of-second-chances"
}