{
  "title": "Loyal to a Degree",
  "description": "A World War Two Historical Fiction Novel Based On A True StoryA young boy in Nazi Germany is forced to become a man well before his time, or perish.As 14-year-old Karl Veth listens to the German special OKW report, the news he has feared and anticipated becomes a reality. Russian tanks have broken through the German defense lines east of the KLV evacuation camp in Poland where he and 120 other German boys are living. The time has come to leave the camp and return to Berlin.Despite his young age, Karl is a trained member of the Hitler Jugend (Hitler Youth) and assistant to KLV camp leader. Due to injuries sustained in battle, the camp leader is handicapped and unable to see to the evacuation of the boys from the camp. The job falls squarely on Karl’s shoulders as orders come from headquarters putting him in command of the mission. He must refine and execute an evacuation plan that will reunite the boys with their families and he must do it on his own. Berlin has no soldiers to spare.Once back in Berlin, Karl is reunited with his good friend and fellow Hitler Jugend member, Harold. The two boys are close and share a common bond – they are both “subway rats.” They earned the nickname because of the time they spent playing in and exploring the subway tunnels under Berlin when they were younger. They are experts when it comes to the subway system but little do they know, their unique knowledge of the tunnels will put them in grave danger.When SS leaders learn Karl is a subway rat, they take advantage of his knowledge and order him to act as a guide for SS demolition commandos in the tunnels. Having been relieved of his previous post, Harold is ordered to assist Karl. The SS cannot be trusted and Karl walks a fine line between life and death as he follows orders while working on a secret plan with Harold. The fall of Berlin is imminent and it’s only a matter of time before the Russians take over the city.Facing death at every turn, Karl must use his wits simply to stay alive. As the chain of command breaks down, the SS starts conducting courts-martial on the fly, executing anyone with a single bullet in their pocket. Meanwhile, the nightly air raids continue, scorching the city and leaving the stench of death in the air. Chaos reigns as the Russian Army moves closer and closer.As a member of the Hitler Youth growing up, Karl has been taught that loyalty to the Fatherland comes first, yet he is fighting for a cause he does not understand. In the final days before Berlin falls, Karl finds himself hungry, scared, and completely disillusioned with the war. He also realizes that he can only afford to be loyal to a degree as he is forced to make a crucial decision – live or die.Books In The Series:Children To A DegreeLoyal To A DegreeTrust To A DegreePartners To A Degree",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "World War II"
  ],
  "author": "Horst Christian",
  "average_rating": "4.24",
  "url": "https://www.goodreads.com/book/show/17938464-loyal-to-a-degree"
}