{
  "title": "Revolt Against the Modern World",
  "description": "In what many consider to be his masterwork, Evola contrasts the characteristics of the modern world with those of traditional societies, from politics and institutions to views on life and death. \"No idea is as absurd as the idea of progress, which together with its corollary notion of the superiority of modern civilization, has created its own 'positive' alibis by falsifying history, by insinuating harmful myths in people's minds, and by proclaiming itself sovereign at the crossroads of the plebeian ideology from which it originated. In order to understand both the spirit of Tradition and its antithesis, modern civilization, it is necessary to begin with the fundamental doctrine of the two natures. According to this doctrine there is a physical order of things and a metaphysical one; there is a mortal nature and an immortal one; there is the superior realm of 'being' and the inferior realm of 'becoming.' Generally speaking, there is a visible and tangible dimension and, prior to and beyond it, an invisible and intangible dimension that is the support, the source, and the true life of the former.\" —From Chapter One. With unflinching gaze and uncompromising intensity Julius Evola analyzes the spiritual and cultural malaise at the heart of Western civilization and all that passes for progress in the modern world. As a gadfly, Evola spares no one and nothing in his survey of what we have lost and where we are headed. At turns prophetic and provocative, Revolt against the Modern World outlines a profound metaphysics of history and demonstrates how and why we have lost contact with the transcendent dimension of being. The revolt advocated by Evola does not resemble the familiar protests of either liberals or conservatives. His criticisms are not limited to exposing the mindless nature of consumerism, the march of progress, the rise of technocracy, or the dominance of unalloyed individualism, although these and other subjects come under his scrutiny. Rather, he attempts to trace in space and time the remote causes and processes that have exercised corrosive influence on what he considers to be the higher values, ideals, beliefs, and codes of conduct—the world of Tradition—that are at the foundation of Western civilization and described in the myths and sacred literature of the Indo-Europeans. Agreeing with the Hindu philosophers that history is the movement of huge cycles and that we are now in the Kali Yuga, the age of dissolution and decadence, Evola finds revolt to be the only logical response for those who oppose the materialism and ritualized meaninglessness of life in the twentieth century. Through a sweeping study of the structures, myths, beliefs, and spiritual traditions of the major Western civilizations, the author compares the characteristics of the modern world with those of traditional societies. The domains explored include politics, law, the rise and fall of empires, the history of the Church, the doctrine of the two natures, life and death, social institutions and the caste system, the limits of racial theories, capitalism and communism, relations between the sexes, and the meaning of warriorhood. At every turn Evola challenges the reader's most cherished assumptions about fundamental aspects of modern life.",
  "genres": [
    "Philosophy",
    "Politics",
    "History",
    "Nonfiction",
    "Religion",
    "Sociology",
    "Occult"
  ],
  "author": "Julius Evola",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/179404.Revolt_Against_the_Modern_World"
}