{
  "title": "Plan X",
  "description": "\"Thrilling and sophisticated. In a serpentine story that races from small-town Montana to the vaulted halls of Windsor Castle, nothing is as it seems, including the works of the great Shakespeare himself. Former military and current police officer Cody Byrne is unforgettable--a heroine you want to root for. I love this book!\" -- New York Times and USA Today Bestselling Author J. Carson BlackLise McClendon (as Rory Tate) weaves a thrilling police procedural as Iraqi war veteran turned police officer Cody Byrne investigates the death of a Montana professor who may have been hiding one of the biggest secrets in academia—or perpetuating one of the biggest frauds—one that could scandalize the royal family of Great Britain. An entertaining read! -- Robin Burcell - award winning author of THE BLACK LISTThis is one of the best crime/mystery novels I have ever read and I've read a lot of them. The action begins in the first chapters and continues up to the end. It is exciting, spellbinding and riveting. -- Ruth Ann Hixson, Book Pleasures bloggerPolice officer Cody Byrne is dealing with the psychological effects of her Iraq tour when she’s assigned to find the next-of-kin for a Shakespeare professor at Montana State University who is injured in an explosion. The trail to find his relatives, and who he really is, leads her around the world where she confronts her estranged father, an MI5 agent. A (possibly) forged Shakespeare play, a massive cover-up, panic attacks and the nature of duty in the face of tragedy… you’ll find all this and more in PLAN X.\"Her heart was thumping through her uniform as she pulled the car to the curb. She jogged past cruisers and ducked under yellow tape, trying to contain the exhilaration. Action: god, she loved it. The tingling in her fingers, the edge so close. The thrill would engulf her with its seductive ways, wrapping its arms around her, hugging the fear out of her. Would excitement kill her or cure her? Was there any other way to live but like this, in the middle of everything?She took a breath. The smoke was pungent. Stay calm. Right now she wanted it, all of it. The good, the bad, the freaking drama of it all. But she had to stay cool. Firefighters pulled on hazmat suits. Smoke, nerves, shouts of Now! Bro! Let’s do it! She wanted a chemical suit, a vest, a tank. She was just a police officer but she wanted to go.\"",
  "genres": [
    "Thriller",
    "Fiction",
    "M M Romance",
    "Mystery"
  ],
  "author": "Rory Tate",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/17943008-plan-x"
}