{
  "title": "Tread Softly",
  "description": "\"You don't attract trouble. You go looking for it.\"On a sabbatical from the Metropolitan Police, Beatrice Stubbs is considering her future while touring Northern Spain.In the Basque County, she encounters a distant acquaintance. Beautiful, bloody-minded journalist Ana Herrero is onto a story.Beatrice, scenting adventure, offers her expertise. The two women are sucked into a mystery of missing persons, violent threats, mutilated bodies and industrial-scale fraud. They are out of their depth. With no official authority and unsure who to trust, they find themselves up to their necks in corruption, blackmail and Rioja.Beatrice calls for the cavalry. The boys are back, and this time, it's a matter of taste. But when her instincts prove fallible, Beatrice discovers that justice is a matter of interpretation.Each book of the Beatrice Stubbs Series works stand-alone.If you enjoy Martin Walker, DL Sayers and Louise Penny, you'll love Tread Softly.\"The novel oozes atmosphere and JJ Marsh captures the sights, sounds and richness of Spain in all its glory. I literally salivated as I read the descriptions of food and wine. JJ Marsh is an extremely talented author and this is a wonderful novel.\" - Sheila Bugler, author of Hunting Shadows\"There are moments of farce and irony, there are scenes of friendship, tenderness and total exasperation - and underlying it all a story of corruption, brutality, manipulation and oppression with all the elements you'd expect to find in a good thriller, including a truly chilling villain.\" - Lorna Fergusson, FictionFire\"Reminds me of Nicci French's new series featuring Dr Frieda Klein.\" Book'd Out\"I was hooked from start to finish by the plot, the rising tension and looming menace, and the many-faceted personalities--even minor characters leap off the page.\" Goodreads\"Read this, and you'll be desperate for a seat on a Vitoria balcony with a glass of white Rioja, a plate of pintxos and the next Beatrice Stubbs to accompany them.\" Annemarie Neary, author of A Parachute in the Lime Tree",
  "genres": [
    "Mystery",
    "Crime",
    "Audiobook",
    "Fiction",
    "Spain",
    "Thriller"
  ],
  "author": "J.J. Marsh",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/17947174-tread-softly"
}