{
  "title": "Mushroom Satori: The Cult Diary",
  "description": "A powerful journey where faith, ­philosophy, and family collide...The philosophy was perfect. The image, so new-age. And the idea of Zen enlightenment, so fantastically nontraditional. For Jake, the Zen Center in remote New Mexico seemed like the perfect answer to life's problems, and for ten years he knew little else. His life was slowly consumed by the cult that he thought was saving him.Acclaimed exit therapist and cult expert Joseph Szimhart crafts a narrative that explores the complex interactions between faith, family, and reality. Inspired by the author's own experiences in a cult, the story's framework is set in the emotionally rooted trappings of a fringe religious commune, which provides a poignant backdrop for examining the problems we all struggle to overcome. It also presents a chilling look at the subtle manipulations that charismatic figures use on the rest of us.It is estimated that five to seven million Americans have been involved in cults or similar groups. Today, organizations such as the Church of Scientology continue to grow in size and in fame, even as they become more and more controversial. Through his vast experience Joseph Szimhart gives readers a unique opportunity to not only peer behind this curtain, but to truly understand what it is like to be entangled in a cult. He provides insight and perspective on the abstract, the dogmatic, the ordinary, and everything in between. Mushroom Satori is a secret glimpse into a world that most of us cannot fathom, and it serves as both lens and mirror with which to examine our own lives.This novel ultimately presents a beautifully crafted message--one that will interest any reader who seeks more substance than just another happy ending. Readers will find themselves grieving over the protagonist's stolen youth even as they sympathize with the young man's bewildering trek toward adulthood. They will marvel at Szimhart's uncompromising account of the wild promises and limitations of faith that surround us and Jake alike. Mushroom Satori reminds us that when we are down, when we are disheartened, and when we are looking for answers, we are not alone.But when we go hunting for answers and for messiahs we must be cautious--they are hunting us too.",
  "genres": [],
  "author": "Joseph Szimhart",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/17949044-mushroom-satori"
}