{
  "title": "Bertrand Russell : The Spirit of Solitude 1872-1921",
  "description": "Born in 1872, the third child of Viscount Amberley, heir to the Russell earldom, Bertrand Russell was to become the most influential philosopher of the twentieth century. His early masterpiece Principia Mathematica, written with Alfred North Whitehead, set the course for the modern and post modern preoccupation with language; its philosophical ambitions are what drew Ludwig Wittgenstein from Vienna to Cambridge to study under the already famous Russell. But Russell's interest in philosophy was only one aspect of his prodigious appetite for ideas. His anti-war pamphlets and protests got him expelled from the university and imprisoned - not for the last time.Russell's personal life was marked by the same promiscuous drive as his public one. The author of Marriage and Morals - a book that received special citation in the award of Russell's 1950 Nobel Prize for Literature - boldly applied his free-thinking principles in his own most intimate relationships. His spectacular success in seducing women, both married and single, constituted a relentless challenge to the Victorian morality that was his aristocratic birthright. Russell's avant-garde philosophy of free love combined with his principled pacificism would make him an icon of the international Left in the 1960s.In short, Russell's was a protean life so vast in influence, relationships and interests that it is virtually a window on the major historical events of the twentieth century. The Spirit of Solitude is the first biography of this towering figure to go behind Russell's public life and reveal a complex and even contradictory character that has, until now, remained obscure.",
  "genres": [
    "Philosophy",
    "Biography",
    "History",
    "Nonfiction",
    "Mathematics",
    "Biography Memoir",
    "British Literature"
  ],
  "author": "Ray Monk",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/179496.Bertrand_Russell_"
}