{
  "title": "Winning Paktika: Counterinsurgency in Afghanistan",
  "description": "\"We can win the war without killing a single person.\" Just days prior to deploying to combat in Afghanistan, Lieutenant Colonel Walter Piatt, commander of the 2nd Battalion, 27th Infantry \"Wolfhounds,\" announced this visionary statement in front of an assembly of 800 infantrymen and their families. Naturally, none of the soldiers listening to the Colonel's rhetoric thought it was possible to actually win the war without killing a single person. That hardly sounded like \"war\" at all. In fact, that simple concept was the very antithesis of the previous 10 months they had all spent training to explicitly kill people with speed and violence. Destroying the enemy was the fundamental focus of every infantryman. It was, of course, the very reason the infantry existed in the first place. The Colonel, an infantryman himself no less, challenged his battalion's conventional thinking that day and throughout the ensuing campaign. His striking pronouncement was the theoretical extreme of counterinsurgency doctrine. It emphasizes the importance of nation-building instead of man-hunting, construction instead of destruction, and dropping schools and wells into villages instead of artillery shells. That was his vision and that is what he led his infantrymen to do. This is the story of the Wolfhounds in 2nd Platoon, Bravo Company through the eyes of a young platoon leader. He details their adventures on the frontier in a little-known dangerous place called Paktika Province, centrally located along Afghanistan's volatile border with Pakistan. It is the story of ordinary men, cast into a treacherous and unfamiliar world with the mission to destroy the enemy's sanctuary, not just the enemy. It is the story of triumph and failure, elation and frustration through a hard-fought struggle with their identity as infantrymen, evolving from trained tactical killers to strategic nation builders in their quest to win Paktika.",
  "genres": [
    "Military Fiction"
  ],
  "author": "Robert S. Anders",
  "average_rating": "4.77",
  "url": "https://www.goodreads.com/book/show/17949836-winning-paktika"
}