{
  "title": "The Beginning Of The End",
  "description": "The Beginning of the End is the first novel by Michael T. Snyder, the publisher of The Economic Collapse Blog. If you want to know what things in America are going to look like in a few years, you need to read this book. The Beginning of the End is a mystery/thriller set in the United States in the near future. It is a time of unprecedented economic collapse, deep political corruption, accelerating social decay, out of control rioting in the cities and great natural disasters. In the midst of all of this chaos, a former CIA agent, a respected financial reporter and a blogger that takes his prepping to extremes all find themselves dropped into the middle of an ancient conflict between two shadowy international organizations. The three of them are absolutely horrified to discover that one of those shadowy international organizations is planning to hit New York City with the largest terror attack in U.S. history. The goal is to throw the entire country into chaos, but who will get the blame? A series of incredibly shocking twists and turns ultimately culminates in a wild cross country chase that leads up to a surprising ending that most readers will not see coming. A great storm is coming to America, and time is quickly running out. The Beginning of the End is a great book to give to anyone that is still not prepared for what is ahead. It is a wildly entertaining, fast-paced page-turner that is packed with an abundance of twists and turns that many readers will find difficult to put down, but it is also designed to communicate a tremendous amount of truth at the same time. This book is not just intended to entertain people - the explosive truths contained in this novel could literally change the world. If you have always felt a desire to be a part of something bigger than yourself, or if you are just a fan of great apocalyptic fiction, then you definitely should read The Beginning of the End. We are moving into the most unstable time in all of human history, and cataclysmic changes are coming. This is one book that will help you get prepared for what is ahead.",
  "genres": [
    "Fiction"
  ],
  "author": "Michael Snyder",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/17950280-the-beginning-of-the-end"
}