{
  "title": "Ghost Town Living: Mining for Purpose and Chasing Dreams at the Edge of Death Valley",
  "description": "A long-abandoned silver mine for sale sounded like an adventure too great to pass up, but it turned into much more—a calling, a community of millions, and hard-earned lessons about chasing impractical dreams.The siren song of Cerro Gordo, a desolate ghost town perched high above Death Valley, has seduced thousands since the 1800s, but few fell harder for it than Brent Underwood, who moved there in March of 2020, only to be immediately snowed in and trapped for weeks.It had once been the largest silver mine in California. Over $500 million worth of ore was pulled from the miles of tunnels below the town. Butch Cassidy, Mark Twain, and other infamous characters of the American West were rumored to have stayed there. Newspapers reported a murder a week. But that was over 150 years ago.Underwood bet his life savings—and his life—on this majestic, hardscrabble town that had broken its fair share of ambitious men and women. What followed were fires, floods, earthquakes, and perhaps strangest, fame. Ghost Town Living tells the story of a man against the elements, a forgotten historic place against the modern world, and a dream against all odds—one that has captured millions of followers around the world.He came looking for a challenge different from the traditional 9-5 job but discovered something much more fulfilling—an undertaking that would call on all of himself and push him beyond what he knew he was capable of. In fact, to bring this abandoned town back to life, Brent had to learn a wealth of new self-sufficiency and  problem-solving skills from many generous mentors.Ghost Town Living is a thrilling read, but it’s also a call to action—to question our too-practical lives and instead seek adventure, build something original, redefine work, and embrace the unknown. It shows what it means to dedicate your life to something, to take a mighty swing at a crazy idea and, like the cardsharps who once haunted Cerro Gordo, go all in.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "History",
    "Biography",
    "Audiobook",
    "Adventure",
    "Outdoors"
  ],
  "author": "Brent Underwood",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/179546787-ghost-town-living"
}