{
  "title": "The Limits",
  "description": "The most thrilling work yet from the best-selling, prize-winning author of The Newlyweds and Lost and Wanted , a stunning new novel set in French Polynesia and New York City about three characters who undergo massive transformations over the course of a single yearFrom Mo’orea, a tiny volcanic island off the coast of Tahiti, a French biologist obsessed with saving Polynesia’s imperiled coral reefs sends her teenage daughter to live with her ex-husband in New York. By the time fifteen-year-old Pia arrives at her father Stephen’s luxury apartment in Manhattan and meets his new, younger wife, Kate, she has been shuttled between her parents’ disparate lives—her father’s consuming work as a surgeon at an overwhelmed New York hospital, her mother’s relentless drive against a ticking ecological clock—for most of her life. Fluent in French, intellectually precocious, moving between cultures with seeming ease, Pia arrives in New York poised for a rebellion, just as COVID sends her and her stepmother together into near total isolation.A New York City schoolteacher, Kate struggles to connect with a teenager whose capacity for destruction seems exceeded only by her privilege. Even as Kate fails to parent Pia—and questions her own ability to become a mother—one of her sixteen-year-old students is already caring for a toddler full time. Athyna’s love for her nephew, Marcus, is a burden that becomes heavier as she struggles to finish her senior year online. Juggling her manifold responsibilities, Athyna finds herself more and more anxious every time she leaves the house. Just as her fear of what is waiting for her outside her Staten Island community feels insupportable, an incident at home makes her desperate to leave.When their lives collide, Pia and Athyna spiral toward parallel but inescapably different tragedies. Moving from a South Pacific “paradise,” where rage still simmers against the colonial government and its devastating nuclear tests, to the extreme inequalities of twenty-first century New York City, The Limits is an unforgettably moving novel about nation, race, class, and family. Heart-wrenching and humane, a profound work from one of America’s most prodigiously gifted novelists.",
  "genres": [
    "Fiction",
    "Literary Fiction",
    "Contemporary",
    "New York",
    "Audiobook",
    "Science Fiction",
    "Family"
  ],
  "author": "Nell Freudenberger",
  "average_rating": "3.33",
  "url": "https://www.goodreads.com/book/show/179546868-the-limits"
}