{
  "title": "Shades of Life",
  "description": "«Il bellissimo debutto di Glinda Izabel, Shades of Life, è una dolce ossessione. È toccante, misterioso, magico - un'avventura romantica che lascerà per sempre un'impronta sulla vostra anima. Assolutamente consigliato.» Rebecca Hamilton, autrice di The Forever Girl.Pensava che la morte fosse la fine — poi l’amore la riportò alla vita.Juniper Lee, diciottenne con una strana predilezione per i cimiteri, si aggira da sola tra le strade di Savannah, Georgia, assaporando gli ultimi bagliori di vita che pulsano in lei.Quando un paio di occhi blu la strappano dalla polverosa libreria ormai diventata il suo rifugio, Juniper deve affrontare la verità sul proprio passato e tenere a bada il suo cuore che sembra non poter fare a meno di battere per quel misterioso ragazzo che è piombato sul suo cammino e non sembra volerla lasciare andare.----------------------------------------------------------------She believed death was the end – but then love brought her back to life.\"Glinda Izabel's hauntingly beautiful debut, Shades of Life, is poignant, mysterious, and magical - a romantic endeavor that will draw you in and leave its mark forever on your soul. Highly recommended.\" Rebecca Hamilton, author of The Forever GirlEver since she has lost her life and memories, Juniper Lee, an eighteen-year-old moody girl with a fondness for graveyards, has been wandering alone around the streets of Savannah, Georgia, trying to taste the last beams of life that dwell in her.When a pair of blue eyes tears her away from the dusty bookstore - which has been her lair for so long - Juniper must face up to the truth of her past and keep her heart at bay which - though it is going to be off forever – seems it can’t stop pounding for that mysterious boy who ran into her and doesn’t want to let her go.",
  "genres": [
    "Romance",
    "Fantasy",
    "Young Adult",
    "Paranormal Romance",
    "Urban Fantasy",
    "Ghosts",
    "Paranormal"
  ],
  "author": "Glinda Izabel",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/17957516-shades-of-life"
}