{
  "title": "The Wife in the Photo",
  "description": "I pick up the photograph from their mantlepiece and carefully wipe away the dust. The beautiful wife. Supposedly happily married and enjoying a family vacation. I know her husband killed her. And I’m going to make him pay…This is my first job as a housekeeper, but Evan Warner doesn’t need to know that. It’s the first of many lies I’ll tell him. He just lost his wife, Lola , and now he and his young daughter Jessica are adrift. But no amount of cleaning will rid this house of the secrets that have seeped into the cracks. I never forgave Lola for what she did to me. But I can’t let Evan get away with her murder.In their impressive home, I busy myself preparing meals and peeking at carelessly discarded mail, looking for proof of his crimes. Evan hovers and I’m sure he is watching me… even as I bond with Jessica. But whenever he catches us alone together, his face darkens. I realize I have to get her out of this house before it’s too late for her, too.Then I find Lola’s diary, tucked away in a closet out of sight. Her words, hastily scrawled on these pages, change everything I thought I knew about this family. As I hear footsteps on the stairs, I know I’m trapped. And I’m in more danger now than ever before…The Wife in the Photo is a totally twisty psychological thriller guaranteed to keep you up all night. Fans of Freida McFadden, Gone Girl and The Couple Next Door will find it impossible to put down.See what readers are saying about Emily “ O.M.G!! WOW!! This. Book. Was. So. Good!! I was absolutely addicted to it and read it in one sitting! I could not get enough of her twisted, jaw-dropping, suspenseful, head-spinning read! A 5 star must-read book!… I was yelling at my e-reader!” Goodreads reviewer, ⭐⭐⭐⭐⭐“ Love, love, loved this absolutely gripping edge-of-your-seat page-turner!!! I devoured it in one sitting!! Perfect… makes the hair on your arms stand on end… extremely fast-paced … will absolutely blow your mind with its explosive twists!!! Do not start this book until you have cleared your schedules as you will not be able to put it down!! Action-packed, intriguing, will keep you up at night with a pounding heart!! ” Bookworm86 , ⭐⭐⭐⭐⭐“Will BLOW YOUR MIND! A wicked page-turner… will keep you glued to its pages —and, guessing wrong about who to trust—until its breathtaking ending! Full of heart-pounding suspense and jaw-dropping, stunning twists you will NOT see coming … a gripping story… My favorite!” Goodreads reviewer, ⭐⭐⭐⭐⭐“ GRIPPING. INTENSE. UTTERLY BINGE-WORTHY! ” Goodreads reviewer, ⭐⭐⭐⭐⭐“ Kept me up two nights in a row. Truly a page-turner and so fast-paced . I love Emily Shiner!” Goodreads reviewer, ⭐⭐⭐⭐⭐“ WOW!!! … Fantastic ! I could honestly sit all day and read her stories… Absolutelybrilliant .” Goodreads reviewer, ⭐⭐⭐⭐⭐“ Incredibly gripping … Absolutely fantastic … Fast-paced, suspenseful and exciting. Lots of twists… You’ll love it!” Goodreads reviewer, ⭐⭐⭐⭐⭐“ WOW! WOW! WOW! A top-notch, suspenseful thriller with many twists and turns and an ending you won’t see coming.” Goodreads reviewer, ⭐⭐⭐⭐⭐“ Read it in twelve hours! I could not put it down!” Goodreads reviewer, ⭐⭐⭐⭐⭐“ Wow! Just wow. This is a must-read. I started this last night and finished it this morning. Exciting from beginning to end. Surprise ending, twisted… Really delicious!!! ” Goodreads reviewer, ⭐⭐⭐⭐⭐",
  "genres": [
    "Thriller",
    "Fiction",
    "Mystery Thriller",
    "Crime",
    "Mystery",
    "Novels",
    "Murder Mystery"
  ],
  "author": "Emily Shiner",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/179641437-the-wife-in-the-photo"
}