{
  "title": "Bad Blood: The Tuskegee Syphilis Experiment",
  "description": "From 1932 to 1972, the United States Public Health Service conducted a non-therapeutic experiment involving over 400 black male sharecroppers infected with syphilis. The Tuskegee Study had nothing to do with treatment. Its purpose was to trace the spontaneous evolution of the disease in order to learn how syphilis affected black subjects.The men were not told they had syphilis; they were not warned about what the disease might do to them; and, with the exception of a smattering of medication during the first few months, they were not given health care. Instead of the powerful drugs they required, they were given aspirin for their aches and pains. Health officials systematically deceived the men into believing they were patients in a government study of “bad blood”, a catch-all phrase black sharecroppers used to describe a host of illnesses. At the end of this 40 year deathwatch, more than 100 men had died from syphilis or related complications.“Bad Blood” provides compelling answers to the question of how such a tragedy could have been allowed to occur. Tracing the evolution of medical ethics and the nature of decision making in bureaucracies, Jones attempted to show that the Tuskegee Study was not, in fact, an aberration, but a logical outgrowth of race relations and medical practice in the United States.Now, in this revised edition of “Bad Blood”, Jones traces the tragic consequences of the Tuskegee Study over the last decade. A new introduction explains why the Tuskegee Study has become a symbol of black oppression and a metaphor for medical neglect, inspiring a prize-winning play, a Nova special, and a motion picture. A new concluding chapter shows how the black community's wide-spread anger and distrust caused by the Tuskegee Study has hampered efforts by health officials to combat AIDS in the black community. “Bad Blood” was nominated for the Pulitzer Prize and was one of the “N.Y. Times” 12 best books of the year.",
  "genres": [
    "History",
    "Nonfiction",
    "Science",
    "Medicine",
    "Race",
    "Medical",
    "Health"
  ],
  "author": "James H. Jones",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/179682.Bad_Blood"
}