{
  "title": "Outin",
  "description": "OUTIN, book two of The Inner Movement trilogy, from the USA TODAY bestselling author of The Last Librarian.A story of wonder, in which time and dimensions collide in an explosion of psychic phenomena and kaleidoscopic magic. Relentlessly pursued, seventeen year old, Nate Ryder embarks on a new journey where he faces impossible choices that transcend life and death. Aided by mystics, he struggles to find understanding on a frantic quest through extraordinary realms. If he can keep his friends alive, avoid Lightyear, and unravel crucial mysteries from the past . . . the Movement just might have a chance to change everything. A fast paced conspiracy thriller, set in present day Oregon and California, A teenager finds himself leading the Inner Movement in a worldwide non-violent revolution. But the Movement is the target of a centuries-old conspiracy and now Nate is pitted against nefarious forces so powerful, he must move between other worlds if he hopes to save this one. Filled with more than paranormal mystery and supernatural phenomena. In OUTIN, Nate is pushed to question life’s great questions and philosophies in a search for the meaning of time itself. Across time and dimensions they are after him.Readers who enjoy contemporary, urban fantasy, metaphysical genres and books such as David Mitchell’s Cloud Atlas and The Bone Clocks, Paulo Coelho’s The Alchemist, Neil Gaiman’s The Ocean at the End of the Lane, James Redfield’s The Celestine Prophecy, Dan Millman’s Way of the Peaceful Warrior, Night Circus and Snow Child are sure to love The Inner Movement trilogy – A metaphysical fantasy thriller. Find out why nearly a million copies of Brandt Legg's books have been sold/downloaded worldwide.The complete series is available now!OUTVIEW (Inner Movement #1)OUTIN (Inner Moveme",
  "genres": [
    "Fantasy",
    "Science Fiction",
    "Fiction",
    "Paranormal",
    "Young Adult",
    "Time Travel"
  ],
  "author": "Brandt Legg",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/17969138-outin"
}