{
  "title": "Second Chances",
  "description": "Contains the novellas Reuniting and Reckoning - Books 3 and 4 of PAVAD.REUNITINGDan Reynolds spent every spare minute he could searching for his three missing daughters, taken from him by his malicious ex-wife years ago. When not searching for his girls, he excelled at his role as second-in-command of the CCU. He loved his team, loved them like family. And when it became necessary to risk his own life to protect one of those teammate he gladly does it, nearly dying in the process.His first day back on the job he's nearly knocked to the ground by a pretty little whirlwind. The younger woman makes him feel again and brings out all his protective instincts. Shame she'd never be interested in a man like Dan, one who had nothing to give. He gave it all to his search.Allison Brewster liked the look of the man who helped her to her feet. Yes, he was at least fifteen years older than she was, but he had a kind face. Strong hands. A spark of real intelligence in his eyes. She found him so intriguing...But Dan had a complicated situation, just as complicated as the recent divorcee's. Should they really get involved with one another?RECKONINGSomeone had hacked the PAVAD's secure maintenance system, trapping his daughter and a pregnant woman in the elevators, and that infuriated Edward Dennis, creator of the PAVAD division.Ed's fury faded away when he learned the culprit was 11 yr. old Teddy Glendower, son of the new forensics supervisor, Dr. marianna Glendower.Ed recognized the act for what it was--a boy stuck in the middle of six other brothers and needing attention. Since his daughter's recent marriage, Ed had the time to mentor the young boy. Provided his mother was agreeable...Ed Dennis terrified Marianna, with his cold brown eyes and commanding presence. And now Teddy's fate was in the man's hands, something Marianna, the survivor of domestic abuse, couldn't help but panic over.If Teddy didn't cooperate would Marianna lose her position? The position she'd worked hard for? Men who held that kind of power over people couldn't be trusted...Ed was determined to show the beautiful mother of seven boys that he could be trusted. Determined to show her he would never hurt her...But someone was trying to do just that. Hurt Marianna and her team, and her safety now rested in Ed's hands. And he could make one vow, and he'd die to keep it if necessary.No one would hurt Marianna or her children ever again...@84,443 words",
  "genres": [
    "Romantic Suspense",
    "Romance",
    "Contemporary",
    "Suspense",
    "Second Chance",
    "Crime",
    "Contemporary Romance"
  ],
  "author": "Calle J. Brookes",
  "average_rating": "4.34",
  "url": "https://www.goodreads.com/book/show/17969295-second-chances"
}