{
  "title": "End to End",
  "description": "Magical tales, plucked from the depths of time, lead you into a world of mystery and danger.The mythical land of the Nine Kingdoms lies far beyond our world, and perilously close to the borders of Faerie. Touching every kingdom, a vast forest holds secrets, marvels, and tales almost too strange to believe. End to End chronicles some of these stories, each a fairy tale that will take you to the furthest edges and lowest depths of the Nine Kingdoms.Pearl Against Diamond: When Pearl meets Lin in a forbidden forest, it is the beginning of a romance, and the beginning of a tragedy. For Lin is the slave to a faerie queen, and Pearl must journey through dangerous realms to save him. But Lin hides a secret of his own. A reimagining of the legend of Tam Lin, this story pulls inspiration from not only the original, but also the dreamland of ukiyo—the \"floating world\" of forgetfulness and pleasure.The Solider Underground: Alexander Stargazer is a wanderer and a mercenary. One day, when he stumbles into a new kingdom, he hears about a mystery he can't resist. For a full year, the twelve princesses have disappeared every night to go dancing...but no one knows where or how. Many have tried to solve the mystery. All have failed. Stargazer uses his wits and magic to discover the secret, which lies far below the castle in a subterranean world too fabulous to be believed...and far more sinister than it first appears.Wise Marah: We all know the legend of the Sleeping Beauty. Or do we? When a beloved queen falls into an enchanted slumber, a whole kingdom is dragged down into a shadowed grief. Can a simple housemaid break the spell? She can...if she is wise enough.When the Wolves Returned: In a forgotten kingdom severed from all others, life is incredibly dangerous, and survial depends on not falling prey to the sickness that ravages the land. The key to survival—a precious medicine—lies beyond the forest. A strong young woman named Red is the one who journeys through the woods, wary of wolves and other perils. But the largest threat may prove too powerful for Red to fight...until she makes a fragile, remarkable alliance with a former enemy. Together, they will bring their benighted land back into the light.These four tales continue the exploration begun in The Way Through the Woods, the first collection of stories surrounding the fairytale-inspired Nine Kingdoms.",
  "genres": [],
  "author": "Jocelyn Koehler",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/17969449-end-to-end"
}