{
  "title": "Aqua Erotica 2: 12 Stories",
  "description": "Aqua Erotica 2 is the sequel to the bestselling Aqua Erotica: 18 Stories for a Steamy Bath, now in its sixth printing. Intelligent, provocative, and very, very sexy, this collection includes contributions by today's most erotic voices, including Mary Ann Mohanraj, Rachel Kramer Bussel, Michael Hemmingson, Simon Sheppard, Thomas S. Roche, Cecilia Tan, and many more. Aqua Erotica 2 promises to push the limits of our own private boundaries and inhibitions. So long as the fantasy remains safely just that--a fantasy--readers have proven game to test boundaries.It is this realm of sexual boundaries that Aqua Erotica 2 will test: whether literal (encounters in foreign lands or between strangers) or figurative (adultery, fetishes, sex in public, and other \"taboos\"). The stories all share the idea of sexuality as a journey that starts in one place and ends in another, with infinite choices and surprises in between. The collection is eclectic, covering the spectrum of erotic tastes and inclinations: real and fantastical, male and female, dominant and submissive, gay and straight. Nothing is off limits.Readers experience thrilling, button-pushing erotic events, the kind of sweaty, mysterious sexual encounters where mind and body seem to fall out of time and discover true ecstasy. Aqua Erotica 2 celebrates mind-bending and life-altering sex and promises to be the hottest and most explicitly, rawly erotic title of the series.What's more, the book can go where other erotica collections can't. Made in Melcher Media's patented DuraBook(TM) format, its sleek, waterproof and stain-resistant pages can withstand a variety of aquatic environments. Take it with you to a secluded beach, a night-lit pool, a steamy sauna, or a sensual bath for two . . . whatever turns you on.",
  "genres": [
    "Short Stories",
    "Fiction",
    "Erotica",
    "Anthologies"
  ],
  "author": "Mary Anne Mohanraj",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/179695.Aqua_Erotica_2"
}