{
  "title": "قليل الرباية",
  "description": "صدر عن دار نهضة مصر في القاهرة، الديوان الأول لشاعر العامية المصرية أحمد عبده بعنوان «قليل الرباية»، ويضم 44 قصيدة ورباعيات ، كتب بعضها قبل ثورة 25 يناير، والآخر في الفترة ما بعد الثورة حتى بداية حكم الرئيس مرسي، وتتراوح القصائد بين السياسي، والاجتماعي، والإنساني، وتعبر عن الحالة التي تمر بها مصر منذ الثورة حتى اليوم.الشاعر يهدي ديوانه إلى الأطفال الذين يجلسون على سلم مترو الأنفاق يبيعون علب المناديل، وإلى الشباب الذين قدموا أرواحهم قربانا للوطن بغية الاستراحة على وسادة الحرية والكرامة، وإلى الكادحين على قوت يومهم. ويختتم بأنه بذلك الإهداء يرجع الحقوق لأصحابها.وعلى خلاف العادة، لم تكن كلمة الغلاف لكاتب واحد، بل 4 كتاب، هم: الشاعر علي سلامة الذي كتب يقول له «الشعر رزق... فاطمئن، ما تكتبه أنت لن يكتبه غيرك... ربنا يديم عليك نعمة الإحساس»، والكاتبات: إسعاد يونس، وفريدة الشوباشي، وحنان مفيد فوزي.ديوان الشاعر الشاب أحمد عبدهُ لا يكشف عن موهبة اكيدة فحسب ،بل ينبهنا الي قراءة هذا الجيل المعجزة قراءة صحيحة ، و يدعونا الي تأمل محتوياته بكل ما به من ابداع مبهر و رصد شديد الصدق و الوعي و الانتماء الى المطحونين في هذا الوطن الذين قد تحسبهم \"قليلوا الرباية\" بينما هذا الوصف ينطبق علي من نهبوا الوطن و دهسوا احلامه النبيلة باقدامهم الثقيلة الغبية ، ان احمد عبدهُ \"يوخز \" هؤلاء و يدعوهم الى \"التوبة\" قبل فوات الآوان لأن الوطن عامر بالكنوز المصرية و من اهمها شباب المحروسة الذى اقسم علي تحقيق حلم الثورة و الذي عصى على كل مؤامرات و ألاعيب الداخل و الخارج .فريده الشوباشيأحمد شاعر مُختلِف لعالم مُختلِف قُدر له أن يتوحد مع قصائده هرباً من زمن يحكمه التنافُر من أسراب جراد تمشي علي الارض ، إختار الأحمد ان يعلو بكلماته في براح السماء ليبقي و يدوم.اوعي تفتكر ان الشهره معناها ان فيه حد أحسن منك او اشطر ، بالعكس جايز جداً يتعلم منك ، الشِعر بيخلِص لصاحبه الأمين عليه ، و بيخون اللي بيستغلوه.حنان مفيد فوزيإن كان السكوت علي الظلم و القهر ، و الفاشية و الغباء ، و التآمر و الخيانة ، هم ا لرباية يا أحمد ، فأعلن إنضمامي إليكَ ، لنصبح احنا الاتنين قُلَلات الرباية.إسعاد يونسالشعر رزق .. فأطمئن ما تكتبه انت لن يكتبه غيرك .. ربنا يديم عليك نعمة الاحساسعلي سلامه",
  "genres": [
    "Poetry"
  ],
  "author": "Ahmed Abdo",
  "average_rating": "3.48",
  "url": "https://www.goodreads.com/book/show/17970547"
}