{
  "title": "Random Acts of Crazy",
  "description": "I never intended to pick up a naked hitchhiker wearing nothing but a guitar. A guitar. Really. I don't collect guys like that (don't ask what kind of guys I do collect), but when you spot a blonde, tanned, sculpted man with a gorgeous smile and his thumb poking up and practically begging you to stop – you stop.And I definitely never thought I'd be staring into the bright blue eyes of Trevor Connor, the lead singer for Random Acts of Crazy, an indie rock star I followed like the slobbering fileshare fangirl I am. How he came to be nude and lost six hundred miles from home is quite the tale, but how we fell in love is even more unreal.Because someone like Trevor Connor, headed to Harvard Law next year, isn't supposed to want someone like me, a rural Ohio chick majoring in Boredom at Convenience Store University who is all curves and frizzy blonde hair and manners so unpolished they have sharp edges that make you bleed.But he did.When his best friend, Joe Ross, the bass player for Random Acts of Crazy and a man who makes Calvin Klein models look like Shrek, drove eleven hours through the night to rescue him, though, it got real complicated. It's one thing to like two different guys and be torn.What do you do, though, when maybe – just maybe – you don't have to choose?As my Aunt Josie says sometimes, \"It's always complicated.\"* * * * * *\nRandom Acts of Crazy\n is a standalone, full-length novel featuring Darla Jo(sephine) Jennings, the 22-year-old niece of Josie Mendham from the Her Two Billionaires series. It has, like many New Adult novels, an exploration of sexuality for the three main characters, doesn't shy away from mature content, and Darla has a sailor's mouth.An alternate cover edition can be found here.",
  "genres": [
    "Romance",
    "New Adult",
    "Menage",
    "Contemporary",
    "Erotica",
    "Contemporary Romance",
    "Music"
  ],
  "author": "Julia Kent",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/17971217-random-acts-of-crazy"
}