{
  "title": "Oenone",
  "description": "Evelyn Dax is in love with her boss, Jeff Richards has an enemy and has been feeling a little cold lately, and Laura and Bruce Levinson have health problems. What does that all have to do with one Greek Nymph? Find out in this 378 page fantasy that reads like an independent film. Synopsis:Evelyn Dax is in love with her new boss, Jeff Richards. She does not want to reveal her feelings because of their professional relationship, however when Jeff asks her to accompany him during a business trip, the two spend a passionate night together.Although attracted to Evy, Jeff decides to limit their relationship to business-related issues only, as he is afraid of any commitment.Soon after coming back to the office in Boston, Jeff faces a sabotage plot against him triggered by one of the board members of the company they both work for. He is given a difficult task to accomplish and if he fails, he will lose his job.Laura Levinson, Evy’s best friend, learns she suffers from breast cancer and, with the support of her loving husband Bruce, she undergoes traumatic chemotherapy. While weakened and discouraged by the lack of progress with her treatment, she meets Alyssa, a healer, who miraculously helps her recover completely from her illness. Encouraged by Alyssa’s magic, Evelyn decides to seek her help regarding Jeff’s lack of attention. Soon the healer’s intervention is visible; Evy spends a passionate night withwhat appears to be an imagined entity introducing itself as Jeff.At the same time, the real Jeff’s feelings towards Evelyn begin to change drastically and the more often the intimate distractions, first pleasant, later on disturbing, happen to Evy, the more Jeff resents her.Shortly after Laura’s recovery, Bruce is diagnosed with lung cancer. All of thesestrange events cause Evy to begin wondering who Alyssa really is...",
  "genres": [
    "Romance",
    "Paranormal"
  ],
  "author": "Agatha Rae",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/17971345-oenone"
}