{
  "title": "The Immortality Clause",
  "description": "(Note: This book is an independent title and can be read separately from the rest of the series.) For as long as Claudia Bell could remember, she knew that there was something very wrong with our world. There were too many inconsistencies – the facts just didn’t add up. As a young law graduate, she saw her new job at Cornelius Pharmaceuticals not just as an opportunity to develop her career, but also as a means to find the truth. Driven by a need to discover more about the shadowy, undying Immortelle and the truth about her own family, she crosses the Tasman and takes a step into the unknown. What she finds is not what she expected. Thrown into a world of danger and intrigue, she discovers that the very people she is trying to unmask have their own designs on her. The fact that she knows about their existence at all puts her life in danger, but could she live with herself if she left the truth hidden forever? But then, she meets Luke Cavenelli, the youngest member of the immortal Cabal. Although almost a century old, he is kind, debonair, sensual and devastatingly handsome. When she pushes him hard enough, he breaks and gives her the information she craves… and much more. The Immortelle are not united. They are fractured, driven by internal politics that result in bloody, brutal wars that threaten humanity as a whole. She is just one more piece in the puzzle, one small part of a battle that spans thousands of years. The Cabal want her because her bloodline holds the key to power. She is their secret, their creation, and they would rather kill her than let her fall into the hands of one of the other clans. With Luke’s aid, she must struggle to escape with her life and flee halfway across the world, seeking safety in the most unlikely place of all – in the arms of their enemies. There – and only there – will Claudia finally have the opportunity to find out the truth about her own origins, and about who her father really is.",
  "genres": [
    "Romance",
    "Paranormal",
    "Fantasy"
  ],
  "author": "Abigail Hawk",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/17971813-the-immortality-clause"
}