{
  "title": "The Hunt for Summer",
  "description": "‘Only one who devotes himself to a cause with his whole strength and soul can be a true master. For this reason mastery demands all of a person’Layla Summers has run from her past for the last six years, and life is currently peaceful and controlled. That is until Hunter, a hot and hard Dom who frequents The Black Panther where Layla works as an erotic dancer, takes an interest in her.After turning down his offer of a hot night between the sheets, Layla brushes away her intensifying lust for Hunter and continues with her safe but lacklustre life.That is until Layla and Hunter’s paths cross in the most awkward of places and Layla is stunned by the different man Hunter is in the club to the man he is away from the club. He is rude, arrogant and so bloody cocky that Layla has visions of whipping the man with his own expensive tie.But it soon becomes increasingly difficult to keep their relationship professional and they are soon embroiled in a hot, steamy and dominant liaison.Lucas Hunt has wanted Layla since he first saw her spin the pole in The Black Panther and after her rejection of a night of hot hard sex he is stunned when the sexy little Redhead turns up in his daily routine.The temptation to drag her into his dominant sexual desires becomes harder and harder but he soon finds out just how perfect they are for each other.But Layla comes with dangerous baggage and lots of it, and Lucas is soon fighting against things that could kill their relationship and against people that could basically just kill them both.At the end of the day, is their relationship worth the risk? Or is Lucas willing to bite the bullet and endanger his life for the sexy little erotic dancer that has stormed and exploded into his life?This book contains explicit sex scenes, violence and strong language…oh, and one hot alpha male.",
  "genres": [
    "BDSM",
    "Erotica",
    "Romance",
    "Erotic Romance",
    "Contemporary Romance",
    "Amazon",
    "Dark"
  ],
  "author": "D.H. Sidebottom",
  "average_rating": "4.28",
  "url": "https://www.goodreads.com/book/show/17971749-the-hunt-for-summer"
}