{
  "title": "Summer Fling",
  "description": "Five romance novellas from from sizzling writers.Included in the anthology are:The Promise of Tomorrow by J. S. Cooper (New Adult Contemporary Romance)Lucy and Nick were two kids from opposite sides of the tracks. They became best friends and lovers and promised that nothing would ever break them up. But sometimes promises don't always last, or do they?Love Across the Atlantic by Jessica Wood (New Adult Contemporary Romance)Just a few days before Alex left for London to study abroad for the summer, she meets and falls for Nathan--the overly-confident, yet endearing guy that every other girl seems to want. Will the long distance ruin Alex's chances of a relationship with Nathan, or will Alex and Nathan develop a blossoming love across the Atlantic. Confessions of an Online Dater by Chloe Harrison (Chick Lit)As part of a bet, Anna spends her summer going on countless dates to prove that there are no dateable guys online. After 39 disastrous dates with guys who have cat obsessions, performance issues, and facial hair issues, she starts to call these guys, The Undateables, and believes that she will win the bet. Then she meets Jack, who seems at first to be another Undateable. But will Anna's date with Jack be another disaster, or will Jack be the one to cause Anna to lose the bet?Summer Loving by Helen Cooper (Erotic Romance)Jess is devastated when her boyfriend Zak dumps her right before her summer vacation with her best friends. She decides that the best way to get even is to have a one-night stand, only she may have picked the one man, that could make her life even more uncomfortable.We Meet Again by Suzi Case (Chick Lit)Gemma goes from odd job to odd job hoping to make ends meet. She struggles to keep her cool as the same obnoxious and handsome man keeps showing up as she fails each job disastrously.",
  "genres": [
    "Anthologies",
    "Romance"
  ],
  "author": "Chloe Harrison",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/17972012-summer-fling"
}