{
  "title": "The Story: The Bible as One Continuing Story of God and His People, NIV",
  "description": "The Story is an abridged, chronological Bible that reads like a novel. There are no verse references, and Scripture segments are seamlessly woven together with transition text into a single grand narrative. For those intimidated or overwhelmed by the unabridged Bible, The Story helps people understand God’s Word more fully and engage with it more easily.Simple, accessible, and easy to use, churches are finding The Story a powerful way to engage their people in Bible reading like never before. As The Story brings the Bible to life, the broad scope of God’s message will penetrate hearts. People of all ages will be swept up in the story of God’s love and God’s plan for their lives.God goes to great lengths to rescue lost and hurting people. That is what The Story is all about: the story of the Bible, God’s great love affair with humanity. Condensed into 31 accessible chapters, The Story sweeps you into the unfolding progression of Bible characters and events from Genesis to Revelation. Using the clear, accessible text of the NIV Bible, it allows the stories, poems, and teachings of the Bible to read like a novel. And like any good story, The Story is filled with intrigue, drama, conflict, romance, and redemption; and this story’s true! “This book tells the grandest, most compelling story of all time: the story of a true God who loves his children, who established for them a way of salvation and provided a route to eternity. Each story in these 31 chapters reveals the God of grace---the God who speaks; the God who acts; the God who listens; the God whose love for his people culminated in his sacrifice of Jesus, his only Son, to atone for the sins of humanity.”",
  "genres": [
    "Christian",
    "Nonfiction",
    "Religion",
    "Faith",
    "Christianity",
    "Spirituality",
    "Christian Non Fiction"
  ],
  "author": "Randy Frazee",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/10860921-the-story"
}