{
  "title": "Sophomore: Undeclared",
  "description": "Sometimes a college fling is just a fling, but sometimes that spark burns forever.Angel Cruz arrives at Pacific Rim University hard and cold, cut off from his feelings. Meeting Shane Roberts his freshman year changes all that. Free to explore his passions, Angel revels in his relationship with the older and wiser graduate student. But fear, family and the call of adult life outside Pacific Rim’s walls threaten to destroy the fragile world Angel and Shane are building together.Shane was raised to believe career should come first, and Angel was taught gay men couldn’t forge families. But in Pacific Rim’s IVORY TOWERS, they’ll build a love strong enough to survive growing up.Book Two in the Ivory Towers series.Graduation looms for Angel’s lover Shane. Neither guy wants to break up, but in a world of temptation, Shane will have to fight to make first love last.Shane is graduating soon, and when he leaves, he’s going to tear out Angel’s heart. It’s been more than a year since Shane laid Angel over a desk and changed his life, but with the end of the school year approaching, Angel sweats over what will happen when Shane leaves. Shane says he loves Angel…but only when they’re naked and panting…Preoccupied with finding a job, Shane doesn’t know what’s got Angel so stressed, but when he gets an opportunity to go to New York to make one of his movies, Shane realises just how badly his leaving will hurt his boyfriend. He wants to stay together—Angel is the best damn thing in his life. Shane knows all about temptation, though, and about how even the best relationships fall apart.Time and distance, temptations and fears…Love may not be enough to keep Angel and Shane together. But first love is stronger than either of them realises. Will it be strong enough to turn the jaded Shane into a believer, and to keep them together despite the odds?Daisy HarrisBirkenstock-wearing glamour girl and mother of two by immaculate conception, Daisy Harris still isn't sure if she writes erotica. Her romances start out innocently enough. However, her characters behave like complete sluts. Much to Miss Harris's dismay the sex tends to get completely out of hand.",
  "genres": [
    "M M Romance",
    "College",
    "Romance",
    "Contemporary"
  ],
  "author": "Daisy Harris",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/17974303-sophomore"
}