{
  "title": "Reaching the Edge",
  "description": "The Edge is a training company with a difference. Its weekend clients come for classes in bondage and domination, not team building and problem solving.The management, staff and customers of The Edge do not lead boring lives. In fact they have a habit of getting themselves into all kinds of trouble. Put Dominant, possessive alpha males together with bratty, loveable submissives and sparks are bound to fly. These Tales from The Edge are their stories.Book One in the Tales from The Edge series.When you reach the edge, you can’t avoid taking a leap of faith.Joe Dexter leads a complicated life. In one world he is a consultant criminal psychologist—in another he runs The Edge, a successful corporate training company. He’s also an active Dom in the London BDSM scene.A social call to The Underground, a club owned by an old friend, turns into much more when Joe is introduced to a prospective sub. Falling hard for the boy’s tumbling blonde curls, huge blue eyes and desperate need for protection, Joe carefully coaxes him out of his shell. By the end of an intense weekend, unbreakable bonds have been forged and Joe is well on the way to becoming Olly’s Master.Joe knows that there is trauma in Olly’s past, but it is not until his professional and private lives collide that Joe discovers the truth. He knows he shouldn’t have let Olly out of his sight but it’s too late—Olly’s old Master is back on the scene and he’s not in the mood to forgive and forget.With Olly’s life on the line, Joe risks everything to save him. Has Joe found his perfect submissive only to lose him in a horrible twist of fate, or will love win the day? They’ve reached the edge and there’s no avoiding a leap of faith.L.M. SomertonLucinda lives in a small village in the English countryside, surrounded by rolling hills, cows and sheep. She started writing to fill time between jobs and is now firmly and unashamedly addicted.",
  "genres": [
    "BDSM",
    "M M Romance",
    "Romance",
    "Contemporary",
    "Abuse",
    "Erotica",
    "Gay"
  ],
  "author": "L.M. Somerton",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/17974326-reaching-the-edge"
}