{
  "title": "Dave Barry Slept Here: A Sort of History of the United States",
  "description": "“What caused the American Revolution? This is indeed a rhetorical question that for many years historians have begun chapters with. As well they should. For the American Revolution is without a doubt the single most important historical event to occur in this nation except of course for Super Bowl III (Jets 16. Colts 7. This historian won $35).”So goes the skewed sensibility, the muddied mind, the bent pen of one of America's funniest writers, Dave Barry. This time his subject is U.S. history, the way it's never been told before. Every single momentous event and crucial moment is covered, including . . . • The Birthing Contractions of a Nation• Kicking Some British Butt• Barging Westward• The Forging of a Large, Wasteful Bureaucracy• Deep Economic Doo-doo• The Peace, Prosperity, Brain Death. . . and right up through the scintillating Reagan-Bush years, during which, Mr. Barry notes, America is steadfastly Napping Toward Glory.If you love to laugh, if you love your country, if you are unaware that “the Sixth Amendment states that if you are accused of a crime, you have a right to a trial before a jury of people too stupid to get out of jury duty,” Dave Barry Slept Here is the book you've been waiting for since 1776. Or at least since Super Bowl III.Praise for Dave Barry Slept Here“A dazzling performance . . . Barry is brilliant.” — The Washington Post Book World“[Dave] Barry turns his formidable wit to the subject of American history, with a result reminiscent of the Reduced Shakespeare The better you know the original, the funnier it gets.” — Los Angeles Times“I fear that Mr. Barry's dream of making millions of dollars through mass sales of his book to a captive audience of innocent schoolchildren will not be realized, and he will have to be content with making readers laugh a lot, as this one did.” — The New York Times Book Review",
  "genres": [
    "Humor",
    "History",
    "Nonfiction",
    "Comedy",
    "Essays",
    "American History",
    "American"
  ],
  "author": "Dave Barry",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/101021.Dave_Barry_Slept_Here"
}