{
  "title": "Junior: Unscripted",
  "description": "Sometimes a college fling is just a fling, but sometimes that spark burns forever.Angel Cruz arrives at Pacific Rim University hard and cold, cut off from his feelings. Meeting Shane Roberts his freshman year changes all that. Free to explore his passions, Angel revels in his relationship with the older and wiser graduate student. But fear, family and the call of adult life outside Pacific Rim’s walls threaten to destroy the fragile world Angel and Shane are building together.Shane was raised to believe career should come first, and Angel was taught gay men couldn’t forge families. But in Pacific Rim’s IVORY TOWERS, they’ll build a love strong enough to survive growing up.Book Three in the Ivory Towers series.Shane's first year out of college crushes his ego. When visiting Angel and the opportunity for a threesome arises, will it bring them closer or drive them apart?Two months filming his first movie away from school have left Shane Roberts a changed man—humbled, conflicted, and more than anything scared that his boyfriend Angel won’t love him anymore once he finds out Shane’s weaknesses.Excited as Angel is to have Shane home, Angel wonders why Shane feels like a stranger. He knows Shane has a wall up, but has no idea how to rip it down. When the opportunity arises to explore a ménage with an old friend of Shane’s, Angel is initially wary, but hopes that the experience will help jar him and Shane out of their funk.If there’s one thing Shane is still confident about, it’s his abilities in the bedroom. So despite their high blood alcohol level and his niggling worry that sharing Angel with another man will ruin their relationship, Shane tries to give Angel the sexual experience of a lifetime.But real world failures are tougher to handle than the silly hijinks Shane got up to in college. This time, the very thing Shane’s always relied on to hold Angel and Shane together backfires spectacularly. Shane fears he’s pushed Angel away right when he needs Angel the most.If Shane wants to keep his boyfriend and save his relationship, he’ll have to admit he’s not the guy Angel thought he was. But maybe if Shane opens his heart, he’ll find Angel loves him not only for his successes, but also for the man he is inside.Daisy HarrisBirkenstock-wearing glamour girl and mother of two by immaculate conception, Daisy Harris still isn't sure if she writes erotica. Her romances start out innocently enough. However, her characters behave like complete sluts. Much to Miss Harris's dismay the sex tends to get completely out of hand.",
  "genres": [
    "M M Romance",
    "College",
    "Romance"
  ],
  "author": "Daisy Harris",
  "average_rating": "3.58",
  "url": "https://www.goodreads.com/book/show/17976106-junior"
}