{
  "title": "The Company of Shadows",
  "description": "Editorial ReviewEthan Shaw is a demon hunter, working for a mysterious organization, simply dubbed - The Company. His neighbor Cady accidentally comes between the hunter and his quarry, a demon, stalking women in San Francisco. This isn't the scaly, fire and brimstone type demon, but the seductive, stalker type that can jump into any body, feeding off of fear or sexual energy. He can tap into your psyche to become the perfect man - and he's set his sights on Cady. Gutsy, vivacious (if a little pushy) heroine with more curiosity than sense sometimes - check. Sexy demon who can seduce with a single look - check. Secretive neighbor who pushes Cady away with one hand while pulling her into his mess with the other - check. Put together, creates a recipe for one thrilling read. I especially enjoyed Ethan's brand of polite rejection and his sometimes bewildered responses when Cady insinuates herself into his life. Her ties to the demon were an interesting twist as well, and I can't help but wonder what lies in store for them in the future.Product DescriptionCady Garrett can't help but be shaken when next door neighbor, Ethan, shows up in the nick of time to save her from a ruthless killer, spouting mumbo jumbo. Even more disturbed when the killer slits his own throat to escape Ethan after a vicious struggle. Curiously, Ethan insists on leaving before the dead killer returns, even though he can barely stand on his feet. Nursing him back to health, Cady is drawn into a world of half truths and mysteries, where shadows hide more than the seedy underbelly of San Francisco's Tenderloin district. She has become the obsession of a darker power, and no one, not even Ethan, can keep her safe from his twisted desires.",
  "genres": [
    "Paranormal",
    "Paranormal Romance",
    "Demons",
    "Romance",
    "Magic"
  ],
  "author": "Lisa Olsen",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/17977487-the-company-of-shadows"
}