{
  "title": "The Agent's Daughter",
  "description": "Melina has been preparing for a future career as a spy. She just doesn’t know it.Legendary spy Evan Roberts always knew that his fifteen-year-old daughter Melina also possessed the absolute lack of fear required of an agent. Without telling her his real profession or his intention, he began to guide her toward an eventual career as a spy. However, Melina’s world is shattered after her mom is involved in an accident that leaves her mysteriously unhurt but unresponsive. Her father’s plans on hold, Melina settles into life at a suburban high school, immersing herself in a world of schoolwork, her friends and a budding romance with Alex, the cute new guy in her class.When Melina and her father uncover shocking new information about her mother’s accident, Melina is pulled deep into her father’s shadowy world. With Alex desperately trying to find her and only hours to go before it will be too late to save her mother, Melina and her father work together using their combined skills to find a way to reach her.----------------------------------------------------------The Origin of This BookIt’s funny. I don’t think of myself as a writer. I am an electrical engineer and I design integrated circuits for a large telecommunications company. It is not as though I have written many books. This is the only book I have written. Nonetheless, if one were to ask me how I came to write this book, I can trace it to the exact moment.I was sitting on the couch playing a game on the Wii with my then seven-year-old son Travis. This was our usual as we had spent the better part of several hours a day playing various games throughout the entire summer. Toward the end of the night, my ten-year-old daughter Melina entered the room to tell me that she was going to bed. I realized that, as of late, I had not spent any time with her. She had been spending time working on a book review blog of her own called Reading Vacation, so I didn’t seem to see her much. It was sad. She was getting older, and she was spending way more time with her mother, just like I was spending way more time with our son. Then it hit me. I would write a book that would feature her (and her brother.) I could describe the feelings that I had about my daughter getting older. I could tell about the fierce protectiveness that fathers have as well as the joy that we have but might not show at having a daughter. I could even weave some anecdotes of events in her life into the story. (There is a scene in the book where a young Melina leaps off of a boat that is parked inside a store. That whole scene actually happened word for word.)Having decided to write a book, I needed a plot. The main characters had to be a dad and a daughter. I also wanted to showcase women in roles that traditionally were thought of as being done by men. I rolled it around in my head and came up with the spy genre. Finally, the dad and daughter had to spend time together so they could talk as well as work together to solve a problem. I can’t say any more without revealing the story, but I was very happy with what I came up with. I hope you enjoy it too.",
  "genres": [
    "Young Adult",
    "Romance",
    "Mystery",
    "Amazon",
    "Teen"
  ],
  "author": "Ron Corriveau",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/17977396-the-agent-s-daughter"
}