{
  "title": "A New History of Life: The Radical New Discoveries about the Origins and Evolution of Life on Earth",
  "description": "Charles Darwin's theories, first published more than 150 years ago, still set the paradigm of how we understand the evolution of life—but scientific advances of recent decades have radically altered that understanding. In fact the currently accepted history of life on Earth is flawed and out of date. Now two pioneering scientists, one already an award-winning popular author, deliver an eye-opening narrative that synthesizes a generation's worth of insights from new research. Writing with zest, humor, and clarity, Ward and Kirschvink show that many of our long-held beliefs about the history of life are wrong. Three central themes emerge from the narrative. First, the development of life was not a stately, gradual process: Catastrophe, argue Ward and Kirschvink, shaped life's history more than all other forces combined—from notorious events like the sudden extinction of dinosaurs to recently discovered ones like \"Snowball Earth\" and the \"Great Oxygenation Event.\" One startling possibility: that life arrived on Earth from Mars. Second, life consists of carbon, but three other molecules have determined how it evolved: oxygen, carbon dioxide, and hydrogen sulfide are carbon's silent partners. Third, ever since Darwin we have thought of evolution in terms of species. Yet it is the evolution of ecosystems—from deep-ocean vents to rainforests—that has formed the living world as we know it. Drawing on their years of experience in paleontology, biology, chemistry, and astrobiology, Ward and Kirschvink tell a story of life on Earth that is at once too fabulous to imagine and too familiar to dismiss. And in a provocative coda, they assemble discoveries from the latest cutting-edge research to imagine how the history of life might unfold deep into the future.",
  "genres": [
    "Science",
    "Nonfiction",
    "Biology",
    "Evolution",
    "History",
    "Nature",
    "Science Nature"
  ],
  "author": "Peter D. Ward",
  "average_rating": "4.09",
  "url": "https://www.goodreads.com/book/show/17978102-a-new-history-of-life"
}