{
  "title": "Midwinterblood",
  "description": "Seven stories of passion and love separated by centuries but mysteriously intertwined―this is a tale of horror and beauty, tenderness and sacrifice by a three-time Printz Award Honoree.“ Reminiscent of David Mitchell's Cloud Atlas . . . stark, suspenseful writing. ” ― School Library JournalAn archaeologist who unearths a mysterious artifact, an airman who finds himself far from home, a painter, a ghost, a vampire, and a the seven stories in this compelling novel all take place on the remote Scandinavian island of Blessed where a curiously powerful plant that resembles a dragon grows. What binds these stories together? What secrets lurk beneath the surface of this idyllic countryside? And what might be powerful enough to break the cycle of midwinterblood? From award-winning author Marcus Sedgwick comes a book about passion and preservation and ultimately an exploration of the bounds of love.This title has Common Core connections.A Publishers Weekly Best Children's Book of 2013A Kirkus Reviews Best Teen Book of 2013Praise for “A story that's simultaneously romantic, tragic, horrifying, and transcendental is more than enough to hold readers' attention, no matter their age.” ― Publishers Weekly, starred review“Part love story, part mystery, part horror, this is as much about the twisting hand of fate as it is about the mutability of folk tales. Its strange spell will capture you.” ― Booklist, starred review“ The Time Traveler's Wife meets Lost in this chilling exploration of love and memory . . . Haunting, sophisticated and ultimately exquisite.” ― Kirkus, starred review“Sedgwick's prose is unadorned yet melancholic. . .” ― Bulletin of the Center for Children's Books , starred review“Sedgwick's prose is taut, careful, and chilling.” ― The Horn Book, starred review“Reminiscent of David Mitchell's Cloud Atlas . . . stark, suspenseful writing.” ― School Library JournalNovels by Marcus Saint A propulsive, compelling, and unsparing novel set in the grimly violent world of the human and drug trade on the US-Mexican border.Blood Red Snow A gripping, romantic adventure novel based on the true story of Arthur Ransome's experiences with love and betrayal in war-torn Russia.The Ghosts of A Printz Honor Book! Timeless, beautiful, and haunting, spirals connect four episodes, from prehistory through the far future.She Is Not When her father goes missing, a blind girl talented in identifying patterns and her brother are thrust into a mystery. A Printz Medal Winner! Seven stories of passion and love separated by centuries but mysteriously intertwined.White A scary, thought provoking novel about secrets that are better left buried. A Printz Honor Book! A taut frontier survivor story, set at the time of the Alaska gold rush.Graphic novel by Marcus Sedgwick, art by Thomas Scarlett Monster A rip-roaring romp full of hairy horrors, villainous villains, and introducing the world’s toughest monster hunter―Scarlett Hart!",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Horror",
    "Romance",
    "Fiction",
    "Paranormal",
    "Mystery"
  ],
  "author": "Marcus Sedgwick",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/17978165-midwinterblood"
}