{
  "title": "Rabbit in the Jungle",
  "description": "“The prison system isn’t working. Theoretically, prisons deter and reform criminals. Given the high number of repeat visitors in the country’s prisons this theory doesn’t hold up very well. The unfortunate truth is that prison often becomes a training ground and network that actually encourages further criminal pursuits. Prisoners become hardened and desensitized by the brutal setting.” Rabbit in the Jungle tells a classically American story of second chances, hard work and hope. Sometimes raw and gritty, the book traces Anthony Alegrete’s rise from the streets of Los Angeles, through the penal system, to the halls of academia and the competitive business world of Las Vegas. Along the way he had a lot of fun, a little trouble and learned a few lessons. This book shares his story in a way meant to be cautionary and inspiring. Alegrete wants others to know the important role that family, friends and education play in keeping their lives on the right track. The title for the book comes from Anthony’s ability to survive in multiple dangerous environments. With more tricks than Bugs Bunny and more charm than Roger Rabbit he navigated the street culture of Los Angeles during the heyday of West Coast hip hop; navigated safely through prison politics; built a reputation for himself at University of Nevada - Las Vegas and partnered up with local fitness experts to bring a trendy gym to the downtown area of Vegas. In all of these jungles, there were threats to be dealt with and Alegrete always met them head on. At an early age he learned not to let fear stand in the way of what he wanted. No matter what the problem, he’s a master at taking stock of his resources and plunging ahead. Anthony Alegrete portrays his struggles and achievements with heart in full view on the proverbial sleeve and his energy level locked in at ‘turbo-charged. With co-author Holly Baker he has crafted a must-read for anyone fighting their way through the jungle.",
  "genres": [
    "Nonfiction"
  ],
  "author": "Anthony Alegrete",
  "average_rating": "4.59",
  "url": "https://www.goodreads.com/book/show/17979976-rabbit-in-the-jungle"
}