{
  "title": "How the West Won: The Neglected Story of the Triumph of Modernity",
  "description": "Finally the Truth about the Rise of the West Modernity developed only in the West―in Europe and North America. Nowhere else did science and democracy arise; nowhere else was slavery outlawed. Only Westerners invented chimneys, musical scores, telescopes, eyeglasses, pianos, electric lights, aspirin, and soap. The question is, Why? Unfortunately, that question has become so politically incorrect that most scholars avoid it. But acclaimed author Rodney Stark provides the answers in this sweeping new look at Western civilization. How the West Won demonstrates the primacy of uniquely Western ideas―among them the belief in free will, the commitment to the pursuit of knowledge, the notion that the universe functions according to rational rules that can be dis­covered, and the emphasis on human freedom and secure property rights. Taking readers on a thrilling journey from ancient Greece to the present, Stark challenges much of the received wisdom about Western his­tory. How the West Won shows, for • Why the fall of Rome was the single most beneficial event in the rise of Western civilization• Why the “Dark Ages” never happened• Why the Crusades had nothing to do with grabbing loot or attacking the Muslim world unprovoked• Why there was no “Scientific Revolution” in the seventeenth century• Why scholars’ recent efforts to dismiss the importance of battles are had the Greeks lost at the Battle of Marathon, we probably would never have heard of Plato or AristotleStark also debunks absurd fabrications that have flourished in the past few that the Greeks stole their culture from Africa; that the West’s “discoveries” were copied from the Chinese and Muslims; that Europe became rich by plundering the non-Western world. At the same time, he reveals the woeful inadequacy of recent attempts to attribute the rise of the West to purely material causes―favorable climates, abundant natural resources, guns and steel. How the West Won displays Rodney Stark’s gifts for lively narrative history and making the latest scholarship accessible to all readers. This bold, insightful book will force you to rethink your understanding of the West and the birth of modernity―and to recognize that Western civilization really has set itself apart from other cultures.",
  "genres": [
    "History",
    "Nonfiction",
    "Politics",
    "Philosophy",
    "Religion",
    "Audiobook",
    "World History"
  ],
  "author": "Rodney Stark",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/17980745-how-the-west-won"
}