{
  "title": "Taken by the Beast",
  "description": "Elijah had watched Kayla for years, serving as a hidden protector for this beautiful young woman—until the night an abusive boyfriend sought to do her harm. Afterwards, he knew that there could be no hiding what had happened, and she would have to come with him whether she liked it or not.Try as she might to convince herself that her eyes had deceived her, Kayla knew that she had seen a giant wolf toss men about like ragdolls and then shift into the human form of her neighbor Elijah. Then, before she can even begin to process what she has seen, she finds herself thrown over his shoulder and carried from her apartment against her will.In spite of Elijah’s insistence that their flight from the city to a cabin deep in the woods is for her own safety, Kayla attempts escape at every opportunity, but she finds that he is more than prepared to compel her obedience and he will not hesitate to spank her soundly when she makes it necessary. Worse, she soon learns that repeated defiance will earn her a punishment far more shameful than just a bare bottom spanking.As the days pass, however, she begins to see in Elijah a kind of loving care and concern that no man has ever shown her before. Stranger still, as she stands before him naked and blushing, waiting to be thoroughly chastised for disobeying him yet again, she begins to want him in a way that is so fierce it terrifies her.Elijah swears to himself that he has taken Kayla only to keep her safe, but in his heart he knows that is not true. His instinctual need for her—the overpowering urge to claim her as his own—grows stronger with every passing hour, and it is only a matter of time before he loses control and takes her. But can he keep her safe from those who would use her to get to him, and even if he can, can the primal lust between them ever grow into an equally powerful love?Publisher’s Note: Taken by the Beast is an erotic novel that includes spankings, anal play, graphic sexual scenes, elements of BDSM, and more. If such material offends you, please don’t buy this book.Claimed By The Beast is the sequel to Taken By The Beast",
  "genres": [
    "BDSM",
    "Paranormal",
    "Erotica",
    "Romance",
    "Paranormal Romance",
    "Shapeshifters",
    "Fantasy"
  ],
  "author": "Natasha Knight",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/17981250-taken-by-the-beast"
}