{
  "title": "Adventures with Max and Louise",
  "description": "\"Here's the thing,\" Max says. \"You're at a juncture right now. The road forks; you choose a path.The first option is that you keep trottin' right up that hill, go shoppin' with your mate. He tries to talk you into some fashionable clothes but you insist, no, they're not my cuppa. In the end, you win because 'e knows you been through a lot an 'e doesn't want to push. Life goes on pretty much as before. Not too bad but then again, not a 'ell of a lot of giggles either.\"I'm actually listening to Max, feeling interested, if not downright fascinated. Yes, I might be completely losing it but this guy seems to have given my love life, or lack thereof, a fair amount of thought.\"Path two: you with me now? You scoot right back down to the courthouse and you find your man. Make no mistake girly; he's your man; every cell in your body is saying 'I want 'im.' I'm not saying it won't be a job to get 'im. But I can tell you what'll happen if you keep runnin' away. You'll both go back to work and feck all will change. He'll be single and you'll be lonely. Listen to me. I can get him for you.\"\"I am going crazy.\" I have to say it out loud.As a child, Molly Gallagher filled her mind with magical voices that understood her every need, made her laugh, and, along with her family, loved her. At 15, she’s dealt such a blow, she decides to clamp down and quit listening. She’ll survive without anyone’s help. Ten years later, Molly undergoes plastic surgery hoping that her bad memories will disappear with the scars. Instead, her distracted plastic surgeon mistakes her for another patient, giving her someone else’s breast implants. Shaken and angry, Molly schedules surgery to have them removed. But not before they start talking to her.With a date for removal surgery on the calendar, the implants, Max and Louise, give her excellent advice about her burgeoning love life. Max, a Brit, offers a man’s no-nonsense perspective. Louise, an older black woman, looks out for Molly with clear-sighted honesty and fierce devotion. They rarely agree except when it comes to helping their girl.What began as a solution to erase the past, turns into a lesson about remembering, forgiving and, finally, after much laughter, falling in love.",
  "genres": [
    "Romance",
    "Chick Lit",
    "Fiction"
  ],
  "author": "Ellyn Oaksmith",
  "average_rating": "3.73",
  "url": "https://www.goodreads.com/book/show/10863222-adventures-with-max-and-louise"
}