{
  "title": "Ayah...: Kisah Buya Hamka",
  "description": "BUYA HAMKA. Nama besar ini bukan hanya dikenal sebagai ulama besar, melainkan juga sebagai sastrawan, budayawan, politisi, cendikiawan, dan pemimpin masyarakat. Ketokohan serta keagungan karyanya membuat banyak orang tertarik untuk mengabadikannya.Melalui penuturan anak kelimanya, Irfan Hamka, Republika Penerbit ingin mengenal sosok besar Hamka, namun dari sisi yang lebih dekat; Buya Hamka sebagai seorang ayah, suami, dan kepala keluarga.Buku Ayah… menyuguhkan banyak kenangan, pengalaman, dan kisah luar biasa yang mungkin tak akan kita peroleh selain dari orang-orang terdekatnya. Dan, Republika Penerbit merasa beruntung bisa “mendengarnya” langsung dari Penulis, lantas menyampaikannya kepada pembaca. Semoga pembaca pun dapat memperoleh manfaat dengan membacanya.Berikut sebagian kecil nasihat dan pengalaman yang dikenang oleh Irfan Hamka selama 33 tahun kebersamaannya dengan Buya Hamka, sang ayah. Kisah-kisah dalam buku Ayah… akan membawa pembaca mengenal lebih dekat sosok Buya Hamka dari sisi yang berbeda.“Ada tiga syarat yang harus dimiliki oleh orang yang suka berbohong. Pertama, orang itu harus memiliki mental baja, berani, tegas, dan tidak ragu-ragu untuk berbohong. Jangan seperti kamu tadi. Kedua, tidak pelupa akan kebohongan yang diucapkannya. Ketiga, harus menyiapkan bahan-bahan perkataan bohong untuk melindungi kebenaran bohongnya yang pertama. Contoh, ada seorang teman bertanya kepada temannya, ‘Tadi hari Jum’at shalat di mana?’ Si teman yang ditanya sebenarnya tidak ikut shalat berjamaah Jum’at, namun karena malu, dia berbohong, lalu menjawab, ‘Di Masjid Agung’. Si teman yang bertanya kembali bertanya, ‘Di lantai mana kau shalat?’ Yang ditanya kembali menjawab, ‘Di lantai bawah’. Bertambah lagi bohongnya. ‘Saya juga di lantai bawah, kok. Tidak,bertemu?’ Dengan mantap yang ditanya menjawab, ’Saya di saf paling belakang’. Coba kau hitung, Irfan! Untuk melindungi bohongnya, berapa kali dia menambah bohong agar temannya percaya bahwa dia memang shalat di Masjid Agung? Mengerti kau, Irfan, akan cerita Ayah ini?” –Halaman 10.***Atau kisah tentang perjalanan maut di Padang Pasir.Mulanya, gulungan angin bercampur pasir itu masih berjarak sekitar dua kilometer di belakang kami. Umar, sopir kami, menambah kecepatan mobil dari 100, 110, lalu 120 mill per jam. Mobil terasa melayang di atas jalan raya.Namun, angin pasir itu lebih cepat menyusul. Badan mobil terdengar seperti disiram oleh pasir. Suara gemuruh angin terdengar di dalam mobil kami. Seperti ada ribuan suara siulan yang mengepung mobil kami. Ayah terus menyebut nama Tuhan, “Allah, Allah”.Aku pun mengikuti ucapan Ayah, “Allah, Allah, Allah”. –Halaman 137-138.",
  "genres": [
    "Biography",
    "Islam",
    "Nonfiction",
    "Indonesian Literature",
    "History",
    "Inspirational"
  ],
  "author": "Irfan Hamka",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/17983604-ayah"
}