{
  "title": "The Valentine/Petrilo Series",
  "description": "Looking Through Blind Eyes: All Janie and Daniel wanted was a better life and growing up in small town Louisiana did not give them that opportunity. So the sister and brother headed to Los Angeles, California to make the most of their lives. However, their hopes begin to diminish when Daniel's work in organized crime lead them down dangerous and deadly roads. After Daniel's mysterious disappearance and death, Janie plunges headlong into grief and love for the assistant to the \"boss\". The couple seems to have everything going for them except for Rico's job that takes him away for days on end sometimes. Janie's suspicions and worries over Rico's possible infidelity reveals information she never imagined would come to light. Her undying love for this man leads to secrets, lies, and murder. Soon Janie finds herself on the wrong side of the gun hanging off a cliff deep in the woods of North Carolina.Reflection of Secrets: Janie had high hopes of getting her life on the right path and freedom from the Petrilo Crime Family, but more tragedies and startling revelations send her plans right out the window. Janie's past trouble and sadness lurk back from the shadows. The beautiful life Janie has come to love takes a turn leading her right back to where she started in the clutches of the Petrilos. Will Janie survive another go around with the organized crime family?Shattered Visions Haunted Memories: Just when Janie thought she had all she ever dreamt, the powers that be would suddenly change her course; throwing Janie head long into a world of uncertainty and casting a puzzling shadow on all this life she’d grown to love. Janie would soon discover nothing in her world was what it appeared. Leaving her confused, broken, and determined to find the answers in a new but familiar realm filled with secrets and deception.Memories and turbulence lead Janie on her quest to discover the truth concerning herself, her past, the Petrilo crime family, and her brother’s murder. Is Rico's unfinished business in Cherokee to finish the hit the Petrilos put on her? Is Malachi willing to take a bullet for his new love; or will he walk away from the danger and free himself of the drama Janie has brought to his once peaceful life? Love and deceit will lead them all to the truth.Revealing Visions: From the beginning Janie's life was in turmoil; brought up in a home with abuse and lies. Daniel always did what he felt was in the best interest of his sister, Janie. Rico's love for Janie was never ending; from the first moment he laid eyes on the woman she had become. Malachi was no stranger to heart break. Janie's arrival brought him hope for the future and a hurt he wouldn't soon forget. This is the back story to the Valentine/Petrilo Series characters. See where they came from and what was going on \"behind the scenes\". This novella will tell all the dirty little secrets that have been left untold... until now. Seeing Karma:Over 20 years has passed since Janie walked away from Malachi and returned to a life with Rico. The Battaglia's daughter, Sophia, is off to college and all seems grand. Until Sophia's chance encounter with two separate men connected to Janie's past. These encounters lead to kidnappings, murder, love, and the revelation that life is never what Janie thinks it is. Sophia has found the love of her life in MJ; but when Janie and Rico discover his true identity their world will never be the same. How is it possible after two decades for Malachi to be back in Janie's life? What will become of Janie and Rico's happy world? Is Malachi back in Janie's life to stay?",
  "genres": [],
  "author": "Reyna Hawk",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/17983402-the-valentine-petrilo-series"
}