{
  "title": "License to Love Series: Trilogy",
  "description": "Now available as a Trilogy, all three Amazon best selling books in the License to Love Series.Book 1: Stranded, Stalked and Finally Sated Clara Roberts has found herself forced to flee across country, pursued by a madman who seems to have access to every aspect of her life. Consequently, she is off the grid and under the radar when her truck breaks down in a small corner of Southwestern, Oklahoma, and she finds herself at the mercy of a local cowboy. While she knows that she will eventually have to keep running to stay one step ahead of her stalker, she begins to find herself drawn to this man. With his support she decides that her life is something worth fighting for.Shad Brandt wasn’t sure what to expect when he pulled over to help out the girl on the side of the road, but it isn’t long before he realizes that she was a lot more than he bargained for. He knows that she is running from something, but he can’t quite place his finger on what it is. However, he cannot turn his back on this woman in need and when he opens his home and his heart to her he finds something else entirely. So when danger comes to lay claim to Clara, he finds that he is willing to sacrifice everything to make sure she stays safe.Book 2: Mending HopeAlyssa Fairfield has led the life of a hermit since the death of her husband three years before. When her childhood friend, Clara Roberts, turns to her for help fleeing her stalker it forces Alyssa to break out of her self-imposed shell. When Clara doesn't show up a cryptic letter forces Alyssa to go on a manhunt in Southwestern Oklahoma to find her friend. Alyssa pushes her way into a garage, only to be confronted by a man who will break down every wall she has constructed to protect herself. But she may just need those barriers when she is confronted by evil.Woodruff \"Woody\" Brandt was the loner of his family who preferred working on the cars and trucks in the safety of his small town garage to dealing with people and taking chances. He is not sure what to expect when he hears someone breaking in, but the fiery redhead that greets him was not it. Spending time with Alyssa makes him realize just how much he has missed out on life. When she is thrust into danger he sets out on a mission to get her back at all costs, no matter what the risk.Book 3: Wounded PrideMelinda Brandt is fiercely protective of her brothers, and has been since her mother's death at an early age. In fact, she has built her life and her career as Sheriff on her ability to always maintain control. Now, it feels as if even that is slipping away from her. A madman (Charles Sanders) has entered her family's lives, causing her brothers to flee and leaving her all alone. Now an outside agency is moving in to take the case away from her, and she cannot bear to let it go. In a desperate attempt to regain control, Melinda goes outside of the law and leaves town with Charles's step-brother (Cale Winters) to track him down and bring him to her own brand justice. On the road, she finds her primal self responding to Cale's presence, but how can she dare to let her guard down with so much on the line?",
  "genres": [
    "Contemporary",
    "Romance",
    "Westerns"
  ],
  "author": "Amelia  Rose",
  "average_rating": "3.87",
  "url": "https://www.goodreads.com/book/show/17984272-license-to-love-series"
}