{
  "title": "Louis Armstrong, Master of Modernism",
  "description": "Nearly 100 years after bursting onto Chicago’s music scene under the tutelage of Joe \"King\" Oliver, Louis Armstrong is recognized as one of the most influential artists of the twentieth century. A trumpet virtuoso, seductive crooner, and consummate entertainer, Armstrong laid the foundation for the future of jazz with his stylistic innovations, but his story would be incomplete without examining how he struggled in a society seething with brutally racist ideologies, laws, and practices.Thomas Brothers picks up where he left off with the acclaimed Louis Armstrong's New Orleans, following the story of the great jazz musician into his most creatively fertile years in the 1920s and early 1930s, when Armstrong created not one but two modern musical styles. Brothers wields his own tremendous skill in making the connections between history and music accessible to everyone as Armstrong shucks and jives across the page. Through Brothers's expert ears and eyes we meet an Armstrong whose quickness and sureness, so evident in his performances, served him well in his encounters with racism while his music soared across the airwaves into homes all over America.Louis Armstrong, Master of Modernism blends cultural history, musical scholarship, and personal accounts from Armstrong's contemporaries to reveal his enduring contributions to jazz and popular music at a time when he and his bandmates couldn’t count on food or even a friendly face on their travels across the country. Thomas Brothers combines an intimate knowledge of Armstrong's life with the boldness to examine his place in such a racially charged landscape. In vivid prose and with vibrant photographs, Brothers illuminates the life and work of the man many consider to be the greatest American musician of the twentieth century.",
  "genres": [
    "Biography",
    "Music",
    "Nonfiction",
    "History",
    "Jazz",
    "Biography Memoir",
    "Cultural"
  ],
  "author": "Thomas Brothers",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/17986386-louis-armstrong-master-of-modernism"
}