{
  "title": "I Am Abraham: A Novel of Lincoln and the Civil War",
  "description": "Since publishing his first novel in 1964, Jerome Charyn has established himself as one of the most inventive and prolific literary chroniclers of the American landscape. Here in I Am Abraham, Charyn returns with an unforgettable portrait of Lincoln and the Civil War. Narrated boldly in the first person, I Am Abraham effortlessly mixes humor with Shakespearean-like tragedy, in the process creating an achingly human portrait of our sixteenth President.Tracing the historic arc of Lincoln's life from his picaresque days as a gangly young lawyer in Sangamon County, Illinois, through his improbable marriage to Kentucky belle Mary Todd, to his 1865 visit to war-shattered Richmond only days before his assassination, I Am Abraham hews closely to the familiar Lincoln saga. Charyn seamlessly braids historical figures such as Mrs. Keckley—the former slave, who became the First Lady's dressmaker and confidante—and the swaggering and almost treasonous General McClellan with a parade of fictional extras: wise-cracking knaves, conniving hangers-on, speculators, scheming Senators, and even patriotic whores.We encounter the renegade Rebel soldiers who flanked the District in tattered uniforms and cardboard shoes, living in a no-man's-land between North and South; as well as the Northern deserters, young men all, with sunken, hollowed faces, sitting in the punishing sun, waiting for their rendezvous with the firing squad; and the black recruits, whom Lincoln’s own generals wanted to discard, but who play a pivotal role in winning the Civil War. At the center of this grand pageant is always Lincoln himself, clad in a green shawl, pacing the White House halls in the darkest hours of America’s bloodiest war.Using biblically cadenced prose, cornpone nineteenth-century humor, and Lincoln’s own letters and speeches, Charyn concocts a profoundly moral but troubled commander in chief, whose relationship with his Ophelia-like wife and sons—Robert, Willie, and Tad—is explored with penetrating psychological insight and the utmost compassion. Seized by melancholy and imbued with an unfaltering sense of human worth, Charyn’s President Lincoln comes to vibrant, three-dimensional life in a haunting portrait we have rarely seen in historical fiction.",
  "genres": [
    "Historical Fiction",
    "Civil War",
    "Fiction",
    "Historical",
    "American History",
    "Presidents",
    "Adult Fiction"
  ],
  "author": "Jerome Charyn",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/17987663-i-am-abraham"
}