{
  "title": "Driving Forces",
  "description": "THE Many forces drive us into the decisions we new opportunity, chance meetings, rebel causes. Dr. Louise Hammel, an American-Australian, takes a job in Cagayan de Oro, Philippines, as a Regional Long-Term Advisor for an educational program called PROMES. Her assigned Filipino driver, Rico Bernales, becomes enamored with a Muslim widow whose uncle is the leader of the Moro Islamic Liberation Front (MILF). Rico is unwittingly drawn into the nefarious and dangerous underworld of the rebels.As the year progresses, Louise becomes more savvy in negotiating her way through complex issues of Filipino human relations, religion, education, culture and politics, but she is unable to help her driver with his personal entanglements. In the end, Louise must decide if she will return home to the USA leaving her driver to extricate himself from the vortex of impending dangers.BOOK REVIEWS Carol Fortino has woven an interesting tale, impressively detailed, melded with education, customs, culture and traditions of Catholic and Muslim Filipinos and the conflicts between them. The story is intertwined with romance, family conflict, betrayal, graft, subversion and disaster. The book illustrates a good comparison of the differences in cultures among the Philippines, Australia and America. Victor Moss, author of Beware the Wolves, a Soviet WWII Love Story (a potential Hollywood motion picture)a thoughtful fictionalized memoir of an American ex-pats life moving between the radically different cultures of Australia and the Philippines. The rich individuals of the book paint a raw rubbing of fundamentally different ways of conceiving the worldas well as the precariousness of life in a nation haunted by the mixed blessings of so-called modernity and a particularly fragile environment...a quick and thoroughly enjoyable read.\" Jim ODonnell, author of Notes for the Aurora Society and Rise and Go",
  "genres": [],
  "author": "Carol Fortino",
  "average_rating": "3.00",
  "url": "https://www.goodreads.com/book/show/17990221-driving-forces"
}