{
  "title": "Brandywine: A Military History of the Battle that Lost Philadelphia but Saved America, September 11, 1777",
  "description": "Finalist, 2014, Army Historical Foundation Distinguished Book AwardWinner, 2015, American Revolution Round Table of Richmond Book Award\"Brandywine Creek calmly meanders through the Pennsylvania countryside today, but on September 11, 1777, it served as the scenic backdrop for the largest battle of the American Revolution, one that encompassed more troops over more land than any combat fought on American soil until the Civil War. Long overshadowed by the stunning American victory at Saratoga, the complex British campaign that defeated George Washington’s colonial army and led to the capture of the capital city of Philadelphia was one of the most important military events of the war. Michael C. Harris’s impressive Brandywine: A Military History of the Battle that Lost Philadelphia but Saved America, September 11, 1777, is the first full-length study of this pivotal engagement in many years.General Sir William Howe launched his campaign in late July 1777, when he loaded his army of 16,500 British and Hessian soldiers aboard a 265-ship armada in New York and set sail. Six difficult weeks later Howe’s expedition landed near Elkton, Maryland, and moved north into Pennsylvania. Washington’s rebel army harassed Howe’s men at several locations including a minor but violent skirmish at Cooch’s Bridge in Delaware on September 3. Another week of hit-and-run tactics followed until Howe was within three miles of Chads’s Ford on Brandywine Creek, behind which Washington had posted his army in strategic blocking positions along a six-mile front. The young colonial capital of Philadelphia was just 25 miles farther east.Obscured by darkness and a heavy morning fog, General Howe initiated his plan of attack at 5:00 a.m. on September 11, pushing against the American center at Chads’s Ford with part of his army while the bulk of his command swung around Washington’s exposed right flank to deliver his coup de main, destroy the colonials, and march on Philadelphia. Warned of Howe’s flanking attack just in time, American generals turned their divisions to face the threat. The bitter fighting on Birmingham Hill drove the Americans from the field, but their heroic defensive stand saved Washington’s army from destruction and proved that the nascent Continental foot soldiers could stand toe-to-toe with their foe. Although fighting would follow, Philadelphia fell to Howe’s legions on September 26.Harris’s Brandywine is the first complete study to merge the strategic, political, and tactical history of this complex operation and important set-piece battle into a single compelling account. More than a decade in the making, his sweeping prose relies almost exclusively upon original archival research and his personal knowledge of the terrain. Enhanced with original maps, illustrations, and modern photos, and told largely through the words of those who fought there, Brandywine will take its place as one of the most important military studies of the American Revolution ever written.\"",
  "genres": [
    "History",
    "American Revolution",
    "American Revolutionary War",
    "American History",
    "Nonfiction",
    "Military History",
    "Military Fiction"
  ],
  "author": "Michael C. Harris",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/17990810-brandywine"
}