{
  "title": "The Arrow of Sherwood",
  "description": "1193. A Crusader returns from the Holy Land to his home in Nottinghamshire, where he is known as a murderer. His name is Robin of Locksley. Following a youth spent with lowborn friends Robin is determined to settle into the role his father wanted for him: a lord dispensing justice to the county. But a false rumour of his death in the East has stolen Robin’s lands from him, and the country he left only four years before is now crippled by taxation and struggling to maintain the King’s law. It seems Robin must choose between his desire to regain his lost inheritance and his intention to help the commons.In this lucidly imagined and carefully researched recreation of the era of King Richard ‘the Lionheart’, England is torn between the land-owning Norman lords and their English subjects, and it soon becomes clear that Robin can accomplish more outside the law than within it...In this her first novel, Lauren Johnson’s knowledge as a historian brings a vividness to the project, presenting us with an authentic depiction of the sights, sounds, conflicts and furies that defined this era. A story of redemption, loss, romance and adventure, this novel will excite and enthral.Writing and telling stories has been Lauren’s passion since she was a child. Since graduating in History from Oxford University she has pursued her interest in storytelling as Research Manager for a historical interpretation company based at heritage sites including Hampton Court Palace, Dover Castle and the Tower of London. There, she had plenty of practice at immersing visitors in a living historical world – a skill she has now brought to the world of historical fiction.",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Fantasy",
    "Retellings",
    "Historical",
    "Adult",
    "British Literature"
  ],
  "author": "Lauren  Johnson",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/17991330-the-arrow-of-sherwood"
}