{
  "title": "Black Vortex: One Man's Journey into Africa's Wars",
  "description": "Jim Hooper's work needs little introduction. His words and photographic images have captured the heart, soul and desperation of Third World conflict for almost three decades. Author of the critically acclaimed Koevoet! and A Hundred Feet Over Hell, Hooper is renowned for his brutal honesty. In this all-new work, he takes a powerful and retrospective look at four of Africa's deadliest conflicts.Known to many of the former South African Special Forces employed by the private military company Executive Outcomes, Hooper was granted unparalleled access to its engagement in Sierra Leone. He accompanied the black and white mercenaries fighting the sadistic Revolutionary United Front, which was responsible for the torture, mutilation and death of thousands. His images capture the role of guns for hire that protected the innocent as much as the failed state that bought their services.In Namibia, Hooper was the only outsider ever embedded with the South West African Police Counterinsurgency Unit - the legendary Koevoet. Over the course of five months, he earned the respect and trust of these elite warriors as they conducted aggressive search and destroy operations against the communist-backed People's Liberation Army of Namibia. Armed with just his pen and cameras, he was twice wounded in the chaos of close quarter combat. His unique images bear witness to the ferocity of the war fought by 'Ops K'.During the 35 years of the Angolan civil war, Hooper was one of only two journalists allowed first-hand access to Jonas Savimbi's Unita movement. Three long trips with the battle-hardened guerrillas took him into the heart of the country, trekking hundreds of kilometers through savannah and jungle to document attacks against Cuban-supported government forces. Included in his unique photographic record is the use of child soldiers, a tragedy he revealed long before it became a cause célèbre in the West.The third-largest country in Africa, Sudan suffered the continent's longest-running and least-reported civil war. On one side was the Arab government in Khartoum, which tried for over 50 years to impose fundamentalist Islam on the south. Treated as a friend by the ebony giants of the Sudan People's Liberation Army, Hooper crisscrossed the battlefields to record their struggle against the religious and racial oppression of the north. His images of their victories were the first to be published in the West.Each page in Black Vortex tells a story, each reflects the human cost of war. Look into the eyes of the warriors, the survivors, and the dead - reproduced here as a commentary on Africa's never-ending history of violence.",
  "genres": [],
  "author": "Jim Hooper",
  "average_rating": "2.67",
  "url": "https://www.goodreads.com/book/show/17991564-black-vortex"
}