{
  "title": "Slander & DOUBT",
  "description": "Enter the mind of a rapist… who's sleeping with your wife. Enter your own mind.Enter the minds of ordinary men. Unflinchingly explore rape, infidelity, drug use, BDSM, prostitution in the burning crucible of Slander & Doubt... this novel won't shy away from the truth - will you?Why should you be interested? Because that burning crucible is in your own mind. Think not? Listen to the novel's main protagonist:\"You're immune to insecurity, right? You have the odd moment, sure, but it's other people that let doubt take them over, that endlessly analyse their relationships and replay their glories and flaws, not you... right? You'd never be like me, Ken, at this moment lying awake sick to my stomach, in thrall to the accusation that my wife, Lol, is having an affair with a rapist.The rapist is an everyman family-man who flounders between the high of sexual assault and the low of self-loathing. To escape his urges he buries himself in work, drink, drugs, and sex, but his is a lifelong search for the woman who will understand him, love him anyway, and cure him of the need to rape.The slander's gnawing at me and it's so bloody powerful. Could you, even stable normal upstanding you, resist entertaining my unspeakable thoughts? Could you resist the fear that he might actually be telling the truth? My name is Ken and I have my... doubts.\"A note from Alistair: the inspiration for the book has been with me for over twenty years, from when I worked as a volunteer helping women in crises and their families. A rape counsellor came to speak to us, and she spoke frankly and honestly about rape and its affects. One statement in particular was very confronting for the teenage me, that all men have the capability and latent urge to rape. I have written this book about two men, one of whom is a rapist and the other is the husband of one of his victims.Sex, violence, sexual violence, drug use, and prostitution are part of this confronting story, and they are necessary and involving elements of the work. I would like to emphasise that neither I, nor my work, condone sexual violence in any way. I hate even having to write that, but there are some bloody fruitcakes in the world unfortunately.Additional note 16th July 2013....Before I go on, I'd like to say that a) the book was written with the highest ethical integrity, and b) it's fucking confronting. I need to say this as I've had people interested who see the title, see the blurb, but don't think it's for real. I guess we're all so bombarded with hype that we immediately think it's overkill, but I'd like to say that this book does exactly what it says on the tin. It's not Fifty Shades of tittilating bollocks, it's for real.If it were a movie then it would be an adapted screenplay of the works of Irvine Welsh, Michel Houellebecq, and Marquez, and it would be directed by Ken Loach.Whilst it's as graphic as some of Bret Easton Ellis's work, it's actually nothing like it. Dont mind a bit o' Bret now 'n' again, but my work wasn't aiming to bear any resemblance. It's not meant to allegorical, fantastic, or horror - though its reality can be horrific.Anyhoo, Part 1 is available on Kindle/epub for here for FREE, and the full novel is US$18.99 paperback and US$0.99 on Kindle and US$8.99 on most other ebooks (I don't control all the pricing). Check out the links here http://bit.ly/1dBIENZ",
  "genres": [],
  "author": "Alistair Baillie",
  "average_rating": "4.11",
  "url": "https://www.goodreads.com/book/show/17993233-slander-doubt"
}