{
  "title": "Startup",
  "description": "\" ... Reminiscent of John Grisham's THE FIRM. A solid business thriller ...\"-Kirkus Reviews\"...inspired by today's Wall Street scandal stories ...\"-Midwest Book Review\"The best novel about Silicon Valley that I've read in the last decade.\" -Review Maven Amazon\"...this is one author who will shortly become a household name ...STARTUP is a smashing achievement ...Ogura's mastery of plot development is spectacular ...\"wow\" this guy can write.\"-Examiner.com\"...a stellar cast of characters...a highly gifted writer... STARTUP will be the first of many Ogura bestsellers.\" -Pacific Book Review\"... the hype surrounding new author Glenn Ogura is right on the mark... if you love fast-paced fiction that will keep you reading into the wee hours of the night ...\"-Create with JoyYoung idealist Zack Penny usually gets to work early to take in the surroundings and breathe in the crisp, mechanically filtered air, knowing that one day his own company will be very different from Display Technik. As he follows the vision of his highly successful, results-at-all-costs mentor and CEO Allen Henley, Zack quietly nurtures a big dream--to create a new company of high morals and values, one that will revolutionize the world through the creation of wallpaper-thin displays to completely surround a viewer.That dream is set into motion one morning when he realizes an important paper has been taken from his office. Moments later, Zack learns someone has turned him in. After his boss, who also happens to be the father of his girlfriend, Mary Anne, gives him one last chance to pledge his loyalty, Zack resigns. Determined to realize his vision, he soon steps into his new facility with high hopes and no idea that Henley has already put a plan into action with the intent of systematically destroying Zack, his perfect company, and, most of all, the relationship between Zack and Mary Anne, who is unwittingly caught in the cross-fire.In this fast-paced thriller, a young entrepreneur faces moral dilemmas in Silicon Valley, a place where the inner working of the legal system favors the aggressor.",
  "genres": [
    "Fiction",
    "Thriller"
  ],
  "author": "Glenn Ogura",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/17993963-startup"
}