{
  "title": "Hounded by God: A Gay Man's Journey to Self-Acceptance, Love, and Relationship",
  "description": "Joseph Gentilini was born in 1948 in Columbus, Ohio, the youngest of four children, to Marie and Celso Gentilini. Their family was a fairly normal Catholic family of the 1950s. They went to St. Mary Magdalene's Catholic Church and parish elementary school. Joe made his first Holy Communion in second grade at this Church. The school teachers were all Sisters of St. Francis of Mary Immaculate of Joliet, Illinois. They were strict as were the religious teachings of the priests.Joseph realized he was \"different\" in grade school, but had no words to explain it. By fifth grade, he thought that he was homosexual but tried to repress these thoughts and feelings, to no avail. By eighth grade he was scrupulous, seeing mortal sin in everything he thought or did and this lasted for several years.In 1968, he had his first homosexual encounter the summer after his sophomore year at college. Feeling desperate, he entered conversion therapy from 1968-1974. During this period, he took medications, was trained to make love to a plastic blow-up doll, visited prostitutes, and dated women. None of these attempts changed his sexual orientation. He became suicidal and kept the means to kill himself in the top drawer of his dresser.In 1973, the National Catholic Reporter published excerpts of a speech that Father John McNeill, SJ gave to a gay group in California. This was the first positive article that Joe had read about homosexuality and Catholicism. It gave him hope that there was a way of integrating his homosexuality with his spirituality. The article mentioned DIGNITY, a group he joined and with five other men, helped to form a local Columbus chapter.In June of 1974, he attended \"The Gay Christian\", a conference that changed his life. He met a man to whom he was emotionally and sexually attracted. For the first time in his life, his emotional, sexual, and spiritual worlds came together. Joe decided to accept his homosexuality as God-given,and live his gay life.All the while, this and more is chronicled in detailed journals kept by his pain, his healing, his experiences with God and with men, his advocacy, etc. God kept hounding Joe to do something with these journals. In 2005, nearly 5,000 pages of entries became a book, Hounded By A Gay Mans' Journey To Self-Acceptance, Love, and Relationship .God is indeed good, and as a gay man, Joe is in relationship with God and with his partner, Leo.",
  "genres": [],
  "author": "Joseph Gentilini David Schimmel",
  "average_rating": "4.46",
  "url": "https://www.goodreads.com/book/show/17993714-hounded-by-god"
}