{
  "title": "The Patriarch",
  "description": "Synopsis This story traces the roots of a forgotten family across generations two centuries apart. It is narrated in a series of four books. In an ironic twist of fate, the Patriarch, in the year 1802, and his descendant in 1959, were both reluctantly engaged as spies at the tender age of seventeen, each at a very critical moment in history. In Book One, the Patriarch is enlisted by the future Duke of Wellington in the service of the British East India Company. In Book Two, his descendant is unwittingly recruited by an agent of the German and Israeli intelligence services, in the midst of an Egyptian plan to use German Nazi engineered rockets to crush its avowed enemy Israel, just 3 years after the Suez invasion by a joint British-French-Israeli force. Book one begins with a scene at Wellington House in the City of London. The Duke of Wellington, engaged in a conversation with a News Baron, is asked the question what his greatest battle was. The response, coming without hesitation, stuns the guest. The Battle of Assaye, responds the Duke, going on to reminisce. Assaye is a small village in the heart of India. The Battle was fought in a single afternoon on the 23rd of September, 1803, a dozen years before the Battle of Waterloo. The famous Duke, a young Major General at the time, faced an enemy five times his size, and twice faced certain death. In the first encounter with near death, as his favorite Arab steed Diomed takes a spear meant for him and goes down, his young recruit saves his life. The story begins in Surat, a village on the Western Coast of India. Well known today as the diamond capital of the world, three centuries ago it was a gateway to India, for foreign traders, be they Portuguese, Dutch, English, or Jews from Baghdad. A pigeon carries a short message a distance of four hundred miles from a jail in the city of Nagpur to Surat. It demands the recipient fulfill a pledge given seven years prior of a Life for a Life. The message is from a young Prince, in jail facing certain death. The Patriarch, four months short of his seventeenth birthday, travels the distance of four hundred miles to the Fort in Nagpur, to save the Prince. The rescue force accompanying him are five goondas, two of them Pindaris, whose lives he saves from the wrath of an English Officer. Thenceforth, a silent bond is forged between the Prince, who goes on to become a warrior King, and his young savior, even though the latter is of a lower social caste. The story details how the General utilizes the skill of this young recruit, to navigate through the thicket of intrigue surrounding the Maratha courts. The plan hatched in London by then British Prime Minister William Pitt, was devised by Lord Wellesley, appointed as Governor General, to be executed by his brother Arthur, the future Duke of Wellington. The success of the Plan was dependent on two factors; timely intelligence gathered from within the enemy camp, and dividing the enemy by neutralizing both, the Tiger, and the Jackal. This dangerous task is assigned to the Patriarch. The events depicted in the novel lead up to the famous battle where the young hero saves the life of the Duke, and plays a critical role in snatching victory, from the jaws of certain defeat. The plotline skillfully includes the Dance of Shiva, staged within the great Durbar of the enemy King, who uses it to give his answer to the British. Faced with an ultimatum, the King chooses War, over Peace. Reminiscing years later Wellington knew that it was this single battlefield victory that triggered the chain of events that contributed to his success over Napoleon. The Patriarch follows his own Karma. He goes on to build the first merchant banking house in India with a little help from the Baghdadi Jews that settled in Surat. A transcendant memory that, centuries later, moved his descendant to help the Jews living in Israel.",
  "genres": [],
  "author": "Pravin Banker",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/17994256-the-patriarch"
}