{
  "title": "Forgive Me Father For I Have Loved",
  "description": "Father Dane Caruso has been a priest for seven and a half years and certain of his affirmation to help the Catholic Church and preach the Word of God. He was the person everyone called on during a crisis or emotional devastation — Dane was everyone’s rock. However, all that came into question after the death of a dear friend. Dane begins to look at his life and do some soul searching, revisiting situations and monsters from the past that continue to rear their heads in his time of need and spiritual upheaval. He seeks relief in unconventional things, his flesh forcing him to make choices that he knows are not healthy. Trying to get back on track, he goes to a local park, one of his all-time favorites, and sits and simply thinks, day after day, trying to heal a broken heart.As he continues to visit the park for peace of mind and solace, he can’t help but notice a beautiful Bohemian woman. She more than catches his eye, arousing feelings in him he’d suppressed since he entered the priesthood. He can’t get her out of his mind, and though he can’t put his finger on it, she appears familiar to him. She is practically his polar opposite, yet the two forge a friendship built on humor, respect and admiration. However, the struggle soon ensues once Dane realizes he likes her to be more than just a friend, and he has to make serious choices that could affect so many people who love and depend on him.He is at a crossroads — does he give up the priesthood to be with her, or forge ahead, forgetting about Lotus, the angelic songbird that floated right into his heart...______________________Please Note: Though this book is not classified as erotica, it does involve the following subject matters/topics/ideals, which may be offensive to some audiences: religion – particularly the Catholic faith as it pertains to priesthood. It also includes detailed sexual and intimate depictions of a consenting couple and a host of situations that are adult in nature. This book is not intended to encourage or discourage those in the Catholic faith. It is a love story that deals with the human experience in its totality.",
  "genres": [
    "Romance",
    "Interracial Romance",
    "Contemporary",
    "Contemporary Romance",
    "Religion",
    "Friends To Lovers"
  ],
  "author": "Tiana Laveen",
  "average_rating": "4.29",
  "url": "https://www.goodreads.com/book/show/17994758-forgive-me-father-for-i-have-loved"
}