{
  "title": "Once Upon a Clockwork Tale",
  "description": "WingsBorn into a world where the fairer sex hides coyly behind fans, Winifred is nowhere near the stereotype. She is fearless and passionate about her father’s scientific work. When the King summons him, Winifred is worried. The arrival of her six brothers and the mysterious Amelia and her silent brother offers distraction, but Winifred's entire world is about to change beyond recognition and it’s up to her to save everyone she loves.Hands and GraterHands and Grater don't understand their mother's unique love for them. For how much love can a machine truly give? As Grimm originally intended, this is a bildungsroman, a tale of two young people coming of age in a time and place filled with danger and joy. The time has come for brother and sister to leave the nest, and learn their true nature, and the nature of their mother.Bitter ColdChildhood friends, Kit and Greta, live in an extraordinary place powered by alchemical magic and mechanical wonders. Just when life might offer him favors, Kit is captured by the Snow Queen, a ruthless industrialist, bent on developing her Eternity Engine. Greta must risk everything to save Kit. Can a stubborn young lady best the most powerful woman in the world, with a little alchemy, a lot of luck, and a clockwork reindeer? The Enchanted BeanHow do you reach a fabled land of giants without any magic beans? Build an airship, of course. A British adventurer takes to the skies seeking wealth and glory, instead he finds ancient gods ruling an oppressive flying kingdom. With the help of their allies, these former masters of men want to replant the World Tree and rebuild their war machines. To stop the sky from falling, our hero will have to do more than chop down a beanstalk.",
  "genres": [
    "Steampunk",
    "Fantasy"
  ],
  "author": "Ella Grey Kat French Robin Wyatt Dunn",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/17995092-once-upon-a-clockwork-tale"
}