{
  "title": "حلمك الكبير فى مشروعك الصغير",
  "description": "مقدمةالكتاب من منا لم يحلم بيوم يمتلك فيه مشروعاً يديره بنفسه؟، يُبدِع وَيبرُع فيه ويُصبح مديرا ورئيساً لنفسه لا مرؤوسا لآخرين. هذا الكتاب سوف يساعدك بصورة واضحة ومبسطة وعملية على تحقيق هذا الحُلم، وينقلك من عالم الموظفين إلى عالم ريادة الأعمال.وأعتقد أن المكتبة العربية في حاجة إلى هذا النوع من الكتب التي لا ترشدك فقط خطوة بخطوة إلى بدء مشروعك بصورة صحيحة، ولكن أيضا تزودك بآليات حديثة فنية وإدارية لنجاح مشروعك الصغير، مع سرد لقصص نجاح مُلهمة، وفي نهاية الكتاب تم عرض لبعض العناوين ومواقع الإنترنت المفيدة لمن يرغب بالمزيد من التثقيف والمعرفة في هذا المضمار. إن مصر في حاجة الآن -أكثر من أي وقت مضى- إلى تشجيع ريادة الأعمال، فبعد أن ثُرناعلى الفساد ونتأهب لبناء الأمجاد يجب العمل على كسر احتكار ما يُعرف بالحيتان في عالم الأعمال وتيسير حصول رواد الأعمال من الشباب على الفرص الاستثمارية التي تنعم بها بلادهم. هذا هو جزء أصيل من العدالة الاجتماعية التي نادت بها ثورة 25 يناير. كما أن مكافحة أمراض مثل الرشوة والواسطة من شأنها استحداث ملايين من المشاريع الصغيرة بالسنوات المقبلة، والتي ستكون القاطرة الاقتصادية والاجتماعية الأولى في مصر. تم تقسيم الكتاب إلى ثلاثة أجزاء، على النحو التالي:الجزء الأول\tيبدأ هذا الجزء بعرض نبذة تاريخية مختصرة عن ريادة الأعمال، وأهميتها ومميزاتها وأهم الخصائص والسمات والصفات التي يجب أن يتحلى بها رواد الأعمال، ومن خلال استبيان مكون من خمسين سؤال يجيب على السؤال الأول، هل يمكنني خوض غمار ريادة الأعمال؟، وبعد أن تتبع الخطوات المذكورة بالاستبيان سوف يتبين لك السمات القوية والضعيفة لتتعرف على نفسك أكثر، وكيف تتغلب على السمات الضعيفة لتصبح رائد أعمال ناجح؟. ويختتم هذا الجزء بعشرين طريقة مبتكرة لتوليد مئات الأفكار لمشروعات صغيرة، وجداول تتضمن معايير المفاضلة والمقارنة بين هذه الأفكار كفرص استثمارية لاختيار المشروع الأنسب لك، والذي ستضع له خطة عمل للبدء فيه، وهذا هو موضوع الجزء الثاني.الجزء الثاني\tيتحدث هذا الجزء عن الخطوات الأولى للمشروع،وما يجب فعله عند البدء، وتقييم تكاليف التخطيط والتنفيذ للمشروع من خلال قائمة تضم ثمانية عشرة خطوة لما يجب عمله قبل البدء في المشروع الصغير، والعناصر التسعة الأساسية لخطة العمل لمشروع صغير.الجزء الثالث\tيعرض بعض قصص النجاح المُلهمة من خلال عرض مسيرة \"شهبندر تجار مصر\"، الأستاذ محمود العربي مؤسس توشيبا العربي وقصص نجاح أخرى معاصرة لشباب ورواد أعمال، وأخيراً قائمة بعناوين ومواقع وروابط إنترنت مفيدة بمجال ريادة الأعمال وتنمية المنشآت الصغيرة والمتوسطة في مصر.مع أطيب أمنياتي بالنجاح، والله اسأل أن ينفع بهذا العمل شباب مصر(وآخر دعوانا أن الحمد لله رب العالمين)  المؤلفد. نبيل محمد شلبي1/1/2013",
  "genres": [],
  "author": "نبيل محمد شلبي",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/17996652"
}