{
  "title": "Hidden in Plain Sight: The Other People in Norman Rockwell's America",
  "description": "Named to Kirkus Review's Best Books of 2013!Named the 2014 Readers' Favorite Bronze Medal Winner for the Non-Fiction - Cultural!Norman Rockwell’s America was not all white. As early as 1936, Rockwell was portraying people of color with empathy and a dignity often denied them at the time. And he created these portraits from live models.Hidden in Plain Sight: The Other People in Norman Rockwell’s America unfolds, for the first time, the stories of the Asian, African, and Native Americans who modeled for Norman Rockwell. These people of color, though often hidden in plain sight, are present throughout Rockwell’s more than 4000 illustrations. People like the John Lane family, Navajos poignantly depicted in the virtually unknown Norman Rockwell painting, “Glen Canyon Dam.” People like Isaac Crawford, a ten year old African-American Boy Scout who helped Norman Rockwell finally integrate the Boy Scout calendar. In this engrossing and often humorous narrative, Jane Allen Petrick explores what motivated Norman Rockwell to slip people of color “into the picture” in the first place. And in so doing, she persuasively documents the famous illustrator’s deep commitment to and pointed portrayals of ethnic tolerance, portrayals that up to now have been, as Norman Rockwell biographer Laura Claridge so clearly put it, “bizarrely neglected”.Hidden in Plain Sight: The Other People in Norman Rockwell’s America is an eye opener for everyone who loves Norman Rockwell, everyone who hates Norman Rockwell and for all those people in between who never thought much about Norman Rockwell because they believed Norman Rockwell never thought much about them. This book will expand the way you think about Norman Rockwell. And it will deepen the way you think about Norman Rockwell's America.",
  "genres": [
    "Art",
    "Nonfiction",
    "Biography",
    "Photography",
    "History"
  ],
  "author": "Jane Allen Petrick",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/18000848-hidden-in-plain-sight"
}