{
  "title": "A Time & Place for Every Laird",
  "description": "Surely, she’d gone completely mad. Claire Manning can’t imagine what she was thinking when she decided to help the escapee from her company’s lab but after seeing him caged like an animal, her humanitarian compulsion cannot be overridden – even by the arrogant, scowling eighteenth-century Highlander Hugh Urquhart turns out to be.His entire life has been taken away from him and Claire understands the pain and torment of loss. She understands the desperation she sees in his eyes and is prepared to do whatever it takes to secure Hugh’s freedom and future. What she isn’t prepared for is the ruggedly handsome Scot she finds under the layers of grime and blood caked on him. Nor is she prepared to feel so much more than mere compassion for his suffering.Not once in Hugh’s entire life has he been taken for a savage or been argued with and commanded about like a lackey as often as he had by his savior from imprisonment.It was he who commanded.He who men yielded to.However, for this woman who had saved his life, Hugh is willing to concede that he doesn’t know everything, that he might need some small amount of help in navigating his way through the alien world he has been unwillingly dragged into. With inexplicable trust, Hugh hands over the reins of his future to Claire – or Sorcha as they would have called her in his world. A woman unlike any he has ever met. A woman of intelligence, wit, courage and startling passion buried deep beneath her bonny exterior.On the run, Claire and Hugh hide away from the agents pursuing them but cannot hide from the undeniable desire that ensnares them and both must face their pasts, the loss and heartache that plagues them if they hope to discover that there is a true time and place for every Highland laird.",
  "genres": [
    "Time Travel",
    "Romance",
    "Audiobook",
    "Historical Romance",
    "Historical Fiction",
    "Historical",
    "Contemporary Romance"
  ],
  "author": "Angeline Fortin",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/18001462-a-time-place-for-every-laird"
}