{
  "title": "Georgetown Academy: Season One",
  "description": "Available for the first time in a single volume, the first four books of the Georgetown Academy series have been hailed by Gossip Girl producer, Josh Schwartz, as “Smart, sexy and insanely addictive.” Now it’s your turn to get hooked. Meet Ellie, Brinley, Evan, and Taryn — Four sophomores at Georgetown Academy, D.C.’s most exclusive private school, where among the exclusive parties and perfectly manicured lawns, student life seems drama-free. But everyone always has something to hide. THE IT GIRL NEXT DOOREveryone wants a piece of Ellie Walker and her Senator mom, but Ellie’s always been happy to cede the spotlight. Kind-hearted, sweet, and half of G.A.’s perfect power couple, Ellie has it all…until her ex-boyfriend, Gabe, moves back to town and turns her world upside down leaving her to choose between love and loyalty. THE DC PRINCESSBrinley Madison, of those Madisons, relishes her family’s status as the ultimate D.C. insiders. While her political strategist father plays kingmaker, Brinley maneuvers behind the scenes in school and at home. Brinley knows better than to keep a secret that could hurt her family, but sometimes desire turns to addiction, putting the family reputation at risk. THE OUTSIDEREvan Hartnett doesn’t have the typical pedigree of a G.A. student. In fact, she has no pedigree at all. Her academic scholarship may get her access to the classroom, but she’s still on the outside looking in…until a series of unexpected boyfriends rocket her to national attention. THE CALIFORNIA GIRLTaryn Reyes’ laid-back, bohemian vibe doesn’t exactly mesh with her new surroundings, but she’s remarkably secure and unconcerned. But after her first run-in with D.C.’s dirty politics, she finds out that keeping her integrity and her heart intact may be harder than she thinks. About the AuthorsJessica Koosed Etting and Alyssa Embree Schwartz met the first day of freshman year at the University of Southern California and instantly bonded over their obsessions with Brenda Walsh, Robin Prince of Thieves and The Babysitters Club books they read growing up. After spending a full year mourning the end of college, they began writing television and feature scripts together. They have set up pilots at ABC, NBC, Fox and CW, and sold films to The Weinstein Company, Happy Madison, Paramount, New Regency, MGM and Alloy Entertainment. They love writing female-centric stories, especially for teen and tween audiences, mainly because they still think they are the 18-year-old girls they were when they first met at USC.www.georgetownacademyseries.com",
  "genres": [
    "Young Adult",
    "Contemporary",
    "High School",
    "Realistic Fiction"
  ],
  "author": "Alyssa Embree Schwartz",
  "average_rating": "4.23",
  "url": "https://www.goodreads.com/book/show/18001649-georgetown-academy"
}