{
  "title": "That Woman: The Life of Wallis Simpson, Duchess of Windsor",
  "description": "One of Britain's most distinguished biographers turns her focus on one of the most vilified woman of the last century. Historian Anne Sebba has written the first full biography of Wallis Simpson, Duchess of Windsor, by a woman which attempts to understand this fascinating and enigmatic American divorcee who nearly became Queen of England. 'That woman', as she was referred to by the Queen Mother, became a hate figure for allegedly ensnaring a British king. Born in 1896 in Baltimore, Bessiewallis Warfield endured an impoverished and comparatively obscure childhood which inflamed a burning desire to rise above her circumstances. Neither beautiful nor brilliant, and no longer young, she nevertheless became one of the most talked about women of her generation, and inspired such deep love and adoration in Edward VIII that even giving up a throne and an empire for her was not enough to prove his total devotion. Wallis lived by her wit and her wits, while both her apparent and alleged moral transgressions added to her aura and dazzle. Accused of Fascist sympathies, having Nazi lovers and learning bizarre sexual techniques in China, she was the subject of widespread gossip and fascination that has only increased with the years. In death, the Duchess became a symbol of empowerment and a style icon, a woman whose unequivocal aim was to win in the game of life. Based on new archives and material recently made available, this scrupulously researched biography re evaluates the role of politicians in the 1930s, sheds new light on the character and motivations of this powerful, charismatic and complex woman, and questions was this really the romantic love story of the century?",
  "genres": [
    "Biography",
    "Nonfiction",
    "History",
    "Biography Memoir",
    "British Literature",
    "Historical",
    "Book Club"
  ],
  "author": "Anne Sebba",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/10866215-that-woman"
}