{
  "title": "Black Redneck vs. Space Zombies",
  "description": "The Devourer and her Space-Zombie minions have destroyed untold planets.Those worlds didn't have a Black Redneck.***Jefferson Balladeer is an African American who was adopted as an infant by the Balladeer family of Picayune, MS. When Ma and Pa Balladeer die in a car crash, it’s left to Jefferson’s older brother, Big Beau Balladeer, to raise Jefferson.While Big Beau is large of heart and body, he’s not the ideal caregiver for the naturally intellectual Jefferson. Big Beau teaches young Jefferson the only thing he knows, how to be the ultimate redneck.Jefferson grows up to be a rodeo star and an expert marksman, and, as Big Beau would say, a certified, grade A ass-kicker. Jefferson becomes known as the Black-Redneck.When Jefferson is seventeen, he begins to question what he wants to do and who he really is. To further complicate matters, he finds out Pa-Balladeer told everyone that he adopted Jefferson so he could haul watermelons and cut wood.Jefferson puts Picayune in his rear view mirror and doesn’t plan on ever stepping foot in Mississippi again.Twelve years later, Big Beau gets himself killed in a drunk driving accident, and Jefferson learns he is the sole heir of Balladeer farm.Jefferson decides to turn the massive plot of land into a huge subdivision. The people of Picayune are not happy.Jefferson’s plan is going great until a creature known as the Devourer falls from the sky and begins turning the good people of Picayune into Space-Zombies. (Don’t you hate when that happens?)What Jefferson thought of as a major inconvenience turns into a struggle for survival against a creature that has destroyed countless worlds.Now, if Jefferson hopes to survive and save the world, he’ll have to remember all his rodeo and shooting skills. He’ll have to take one last ride as the Black-Redneck.",
  "genres": [
    "Zombies",
    "Horror",
    "Science Fiction",
    "Fantasy"
  ],
  "author": "Steven  Roy",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/18002735-black-redneck-vs-space-zombies"
}