{
  "title": "Up to the Challenge",
  "description": "Opposites attract in a sexy tale of unexpected loveWhen the Dempsey patriarch suffers a heart attack, Lucas Dempsey steps up to keep the doors of the family restaurant open. The proverbial prodigal son returns home to Anchor Island—putting family first and his quest to make partner at his high-powered law firm on hold. Sporting a bruised ego after losing his fiancée to his older brother, Lucas would rather walk on glass than spend six weeks within spitting distance of the happy couple. But family duty calls. And that duty includes working side-by-side with a tantalizing spitfire intent on driving him mad.Tough-as-nails boat mechanic Sid Navarro is happy to trade her tools for an apron to help the Dempseys in their time of need. That is, until she realizes she’ll be working alongside Lucas, the man she’s loved from afar since she first laid eyes on him in high school. Lucas could charm the paint off a schooner, but Sid knows she doesn’t fit his girl-next-door type. To show her true feelings would mean certain heartbreak, but the temptation of Lucas in her bed might be more than she can resist.After a rocky start punctuated by verbal barbs and exasperating arguments, things heat up between them—big-time—but their steamy affair turns more than casual in a matter of weeks. Sid’s life has become the dream she’s always wanted, and Lucas has fallen hard for the last woman he ever expected to love. But this affair has an end-date, as Lucas must return to his life and career in the big city, a place where Sid would never fit in. When the end comes earlier than expected, walking away turns out to be a challenge neither of them wants to win.Up to the Challenge is a sexy, fast-paced, romantic story of family, island life, and finding love in unexpected places.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary",
    "Chick Lit",
    "Audiobook",
    "Fiction",
    "Adult"
  ],
  "author": "Terri Osburn",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/18003475-up-to-the-challenge"
}