{
  "title": "Bird After Bird",
  "description": "\"Can you go home again? Maybe not, but you can find home when you stop running from the past.\"~ Katina F, Amazon reviewerFinally! An intelligent romance that flips the script on finding real love as a new adult. Wren is no damsel in distress, and Laurie is no mindless hero. Two very real, talented-but-damaged characters discover that growing up doesn't mean being healed by love, but choosing to heal because of love. Readers are saying, \"The question of 'will they or won't they' was well-played. I could not put it down and the ending was perfect! Laurie is my new book boyfriend!\"BIRD AFTER BIRD is the story of two survivors:Dear Birdy, Princess Birdzilla von MuffinStuff, Keeper of Dreams, Lover of our Fine Feathered Friends, queen of my life and light of my world, I hope this letter finds you well. If you are reading this then I am gone, and sweetheart, I am so sorry. Chi-town professional Wren Riley is 25 and a rising star in the business world. She can eat a man alive and laugh about it to her girlfriends in seconds flat--at least according to her reputation. Behind the power suits and the flashing, flirty eyes, however, Wren has a secret, vulnerable side. Following a devastating loss and the discovery of a bird journal she and her father made together years before, Wren sets out to seek peace, closure, and something she just can't name. Is that something tied to the little paper cranes she keeps finding along the way?BIRD AFTER BIRD is the story of two warriors:Laurence Byrd grew up a lanky Hoosier kid with the good/bad fortune of having the same name as the state's perennial basketball legend. With a better affinity for dogs than sports or school, he ends up in the Army instead of the Chicago art school of his dreams. Still, his service to our country is something he can be proud of--until an argument with the girl who means the world to him results in a series of events that blows his life apart. With no one left to understand him, black sheep Laurie pours out his heart into letters and drawings he never intends to send--then he folds them into paper cranes that he leaves behind like messages in little winged bottles. He never dreams someone might be finding them.God damn it, Sylvia, for a few moments I tricked myself into feeling really alive. I cut it off before anyone got hurt, but just for a moment or two, I really thought I might feel something again--something like trust. Something like love. Not the kind of love we had, but something new. Something like hope. BIRD AFTER BIRD is a love story. When Wren & Laurie meet, their lives will never be the same.\"A sweet romance in the new adult fiction genre, this book completely delivers. The setting of the story against a backdrop of 'birding' was fascinating, in that it introduced a world to me that I know nothing about, and a unique way of two people finding each other. Pick up a copy!\" ~M. Frastley, Amazon reviewer\"I must admit that when I got to the end of this book, I let out a tiny whimper from under my breath. It was over and I didn't want it to be; the style of writing was unique, fun, quirky and witty.\" ~JC at All Is Read\"Sweet and delightful.\" ~Yolanda, of Yolanda Has So Many Books And So Little Time",
  "genres": [
    "Romance",
    "New Adult",
    "Contemporary Romance",
    "Contemporary",
    "Birds"
  ],
  "author": "Leslea Tash",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/18004580-bird-after-bird"
}