{
  "title": "Love Thy Enemy",
  "description": "Anya Karekanova was destined for a life of normality, until a chance twist of fate swept her up into the world of mystery and intrigue of the undying Immortelle. Now, forty years later, she has become one of them; the student and favourite of the powerful elder, Viktor Grekov, and both respected and feared in her own right as well. She calls him ‘master’ and he calls her ‘pet’, but there is nothing subservient about their relationship. Anya is no one’s pet. She is a member of the dark and violent Slavic Clan that secretly dominate Russia and the territories of the former Soviet Union from behind the thick, ancient veil of secrecy that surround all of the Immortelle. Because of her Siberian blood, she possesses the bloody ability to use the Power to perform fleshcraft. She can manipulate of flesh of living things to suit her whims, including her own. But, that is only part of who Anya is.Anya Karekanova is a half-breed.While her mother’s Siberian blood links her to the Slavic Clan’s ability, the other half of her genetics originate from the sensual and charismatic Cabalist bloodlines of south-west Europe. The Cabal, who use the Power to manipulate the minds of their victims, and thrive on sex. Half shape-shifter and half empath, Anya must learn to balance the two warring halves of her nature in order to best serve her chosen allies.In the midst of her internal turmoil, two new men enter her life to complicate things. Twin brothers, the sons of her clan’s oldest enemies. Her master invited their family to Moscow to engage in peace talks, but talking is the last thing the twins are interested in.Just when things seem to be going well and Anya finally achieves some kind of balance between the dissimilar sides of her own personality, an unexpected betrayal turns everything around.Suddenly Anya must fight to defend her oldest enemies – and herself – from a deadly threat.",
  "genres": [
    "Paranormal Romance"
  ],
  "author": "Abigail Hawk",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/18005356-love-thy-enemy"
}