{
  "title": "European Collection",
  "description": "In War of Hearts, Annette Lyon’s exciting novella, Anna, a journalist, is desperate to escape the magazine where Pete, her now-former boyfriend, also works. Heartbroken and still in love with him, Anna snags an assignment to cover the Winter War in Finland. She arrives at a snowy Finnish battlefront only to discover that Pete is already there—as her photographer. She’s determined to be professional about the situation until a battle breaks out in camp, putting her and Pete in harm’s way and putting their love to the test.In G.G. Vandagriff’s enchanting novella, The Earl of Oaksey Takes a Wife, Melissa Burroughs is the new Countess of Oaksey. Her whirlwind romance and subsequent elopement was worth every divine moment, even if her parents did disapprove. When Melissa learns about her new husband’s apparently empty pockets, she wonders if the intimacy they’ve shared is only the ruse of a fortune-hunter. Melissa is devastated and determines to live a separate life from her new husband. But the Earl has other plans, which do not include staying away from his wife.In Michele Paige Holmes’ charming story, Gift of Love, Ethan Mooreleigh knows he’ll never love another woman after the loss of his beloved wife. Yet he needs a male heir to inherit his vast fortune. Ethan’s best friend, Stuart, has an idea and retrieves his sister, Amelia, who has been living in a convent since the tragic death of her parents. Amelia only agrees to enter into the contract marriage because there’s a child involved, Ethan’s neglected three-year-old daughter. When Amelia meets Ethan for the first time at the altar, she realizes that the last thing she wants her marriage to be is loveless. But winning a man whose heart is still broken may be impossible.A Lesson in Love, a delightful novella by Sarah M. Eden, captures the uncertainties of newlywed life. Lucy Stanthorpe arrives for the London Season, planning to attend every ball and musicale with her new husband, Reed, only to discover he has no intention of taking part in the social whirl. Spurred on by their family and friends, Lucy and Reed each formulate increasingly outlandish plans to teach the other a lesson in appreciation. Their battle of wills threatens to pull the young couple apart unless they can both soften their stubborn hearts.In An Ocean Away, Heather B. Moore’s captivating story, Gina Graydon knows the last thing she’ll attract on her holiday in France is an eligible bachelor. Tall, outspoken, and with a weakness for laughing at the wrong moment, not to mention being much too occupied with reading gothic romances, Gina decides she’d rather live in her fictional world. Besides, the only man who pays attention to her at the resort hotel happens to be her father’s worst enemy. And that is far from romantic. Reading in a secluded garden, and dreaming about the perfect kiss, all keep Gina much too busy to consider Mr. Edmund Donaldson any sort of hero.Nancy Campbell Allen’s entrancing novella, What Happens in Venice, follows Evangeline Stuart as she determines to enjoy her vacation in Venice—her first and likely her last since she lives under the strict confines of her step-father’s control. When she meets the mysterious and romantic Conte Bellini, who happens to be Italy’s most eligible bachelor, she decides he is all part of the dream of visiting Venice. It’s impossible for her to believe that his interest in her is anything more than kindness to a foreign visitor. But when he discovers the true betrayal of her step-father, Evangeline learns the Conte may be the one person with the power to restore her happiness.",
  "genres": [
    "Romance",
    "Historical Fiction",
    "Clean Romance",
    "Novella",
    "Short Stories",
    "Historical Romance",
    "Anthologies"
  ],
  "author": "Annette Lyon",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/18005654-european-collection"
}