{
  "title": "Wicked Thing",
  "description": "New Adult Contemporary Romance**Due to content, this book is not suitable for readers under the age of 18.**Carmyn Rafferty witnessed the aftermath of her mother's affair. She learned at a young age not to trust anyone. Especially not your spouse. So she's planned. She's planned every detail of her life: who her husband will be, what their careers will be, what their lives will be like. All to avoid the pain of infidelity. Dallas Brown lives according to his own terms. He doesn't do relationships, he doesn't care what anyone thinks of him, and he doesn't live up to anyone's expectations. When Carmyn's fiancé cheats on her, it sends her into a whirlwind of one-night stands with the most infamous player on campus. She can't seem to stay away from this tough guy and his dangerous motorcycle. Everything about him is the complete opposite of who she'd planned to fall in love with: tattoos, dark stubble along his jawline, and hair that brushes his shoulders. As Dallas and Carmyn begin to fall deeper and deeper into each other, they learn that love can truly be a wicked, wicked thing.Sneak Peek of WICKED THING by Angeline Kace. New Adult Romance, Coming Sept 2013“What gives you the right? We are not together. Stop sticking your nose where it doesn’t belong.”Carmyn’s forehead creases, and if I were a fool, I’d say it was in pain.Her face flushes with anger. “You’re right, Dallas.” Her words are clipped and cold. A stark contrast to the heat radiating from her. “We’re not together and I had no right. I’m sorry.” She snatches her purse off my dresser and turns to leave.“Carmyn, wait.”She stops but doesn’t turn around.I’m confused. She won’t let me tell her how I feel, but I’m supposed to allow her to fix the most broken part of my life? A part of me wants her to. For her to be the one who makes the broken things work. But not like this. Not when she insists on keeping things the way they are. I can’t give myself to her if she won’t accept my heart, let alone give me hers.She marches to the door and flings it open.I want to tell her to wait, but I still don’t know what to say. I got what I wanted; she won’t try to push me about Denton anymore. Was it worth losing whatever part of her I had?I’m not sure it is.Meet Dallas and Carmyn this summer in WICKED THING by Angeline Kace. For more details and teasers, visit her website at www.angelinekace.com.",
  "genres": [
    "New Adult",
    "Romance",
    "College",
    "Contemporary",
    "Contemporary Romance",
    "Amazon",
    "Realistic Fiction"
  ],
  "author": "Angeline Kace",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/18005643-wicked-thing"
}