{
  "title": "Hidden",
  "description": "She’s running from a past she can’t escapeLyndsey Anderson left her dark past behind and fled to Hawaii, hoping to escape a mistake she can’t forget. Convinced that she’s unworthy of love, she vows to avoid relationships and build a new life alone—until she meets Nick, an exciting and handsome surfer who sets her body on fire and has her aching to open her heart once more. But trusting Nick will mean revealing a secret that could destroy any chance she has of winning his love.He’s hiding from the memory of an unforgivable actNick Carlisle can’t run far enough away from the haunting secret that ruined the life of a good woman and his army career. Unable to forgive himself and determined never to hurt another, he’s devoted his days to surfing and steering clear of relationships at any cost. Until he meets Lyndsey, a stunning beauty who makes his pulse race with every electric touch and sensuous look. Though he’s torn by fear and wracked by doubts, Nick can’t ignore the growing passion he feels for the one woman who might set his heart free.They’ll have to help themselves before they can help each otherAs these two damaged souls struggle to protect themselves from the powerful feelings they stir in each other, they must choose between facing their deepest fears and grasping the true love they both so strongly need and desire—or letting the secrets they’ve kept hidden destroy them.“Selena Laurence has the ability to bring to life complex characters you instantly start rooting for from page one. Passion, humor, and a sexy hero all make for one read you don’t want to miss.” —New York Times and USA Today bestselling author Ilsa Madden-MillsThis national bestseller was originally published as Hidden.",
  "genres": [
    "Romance",
    "New Adult",
    "Military Fiction",
    "Contemporary Romance",
    "Contemporary",
    "Abuse",
    "Love"
  ],
  "author": "Selena Laurence",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/18006312-hidden"
}