{
  "title": "El jardín de la infanta",
  "description": "«[Au Jardín de l’Infante]. Recopilación de poe­sías con que el poeta francés en 1893, tomaba posición en el movimiento simbolista.Melancólico y sutilmente elegiaco, el poeta se difunde en un galanteo de solitario y encuentra la más genuina expresión de su mundo en representaciones vivas de paisaje, en rit­mos fugaces de encantos, con una lozanía de sensaciones que truncan las crudezas del impresionismo y las transforman en una fluidez musical que tiene algo de malabarismo. El alma del poeta está representada en la poesía que da título y símbolo al volumen: como una Infanta española rica­mente vestida, entre los muelles esplen­dores de su palacio. Melancolía de sueño que se extiende por las lentas cuartetas, como susurradas en voz baja; candor de lirio (ténganse presentes, en el mismo sim­bolismo, los motivos prerrafaelistas y ruskinianos) en el fondo de un paisaje des­vaído en el crepúsculo. Los silencios del viejo Escorial, el trono hierático de la real chiquilla, los dos lebreles, el parque con sus fuentes que gotean hilos de plata, los retratos que sensualmente relumbran sobre el trono y sobre los tapices, son toques de color que tienen la viveza e incluso el preciosismo de una miniatura. Este carác­ter de musicalidad sutil lo transforma todo en una melodía que envuelve paisajes y descripciones, suspiros y confesiones, en vibrante fantasía.El mundo de Samain en­cuentra su realización en delicadas varia­ciones de estados de ánimo, a través de una musicalidad que da a las palabras un significado misterioso y las sumerge en una iridiscencia indefinida. La poética de este mundo de lo vago e indeciso enlaza con la de Verlaine, especialmente por las Fies­tas galantes (v.). Pero de tarde en tarde aparecen en la obra de Samain señales de un simbolismo decadente y muellemente oriental, que aparecerá mejor en otras obras publicadas más tarde y que constituirá su aspecto más turbio y débil: literatura en la literatura, casi por mero juego de rebus­ca estilística. Esta obra mantiene en cam­bio en sus justos límites de grácil impre­sionismo, no exento de delicadeza, un sue­ño de artista, digno de ser reconocido por el dolor de su existencia y por su humilde y sincera dedicación a la poesía.»(C. Cordié)",
  "genres": [],
  "author": "Albert Samain",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/18006403-el-jard-n-de-la-infanta"
}