{
  "title": "Tweet Naked: A Bare-All Social Media Strategy for Boosting Your Brand and Your Business",
  "description": "Presenting a fresh perspective on a common challenge, author Scott Levy delivers a new answer to every business owner’s social media question — how can I make social media work for me? Levy’s solution takes a cue from another explosive media phenomenon: reality TV. Levy invites you to create the same magnetism that pulls reality TV viewers in by using the same tools: transparency, authenticity, and a human element.Learn how to use social platforms such as Twitter to tactfully share, or bare, your brand, inciting consumer action. Also learn how to strip your social media strategy down to what works for your brand, exhibit transparency that engages followers on all popular social channels, and create brand consistency across all social platforms. Other topics cover engineering positive brand impacts and avoid devastating damage, using crowdsourcing and retweets, and lifting a brand from relative obscurity to significant popularity.Real-life examples relate well-known business brands such as Sharpie and Jet Blue, and personal brands such as NFL Runningback DeAngelo Williams. Discover exactly what it takes to seduce the masses and turn them from passive followers into brand champions and loyal brand buyers. Reviews Scott Levy asks you to consider and use social media for what it is—a broadcast medium like TV or radio. Instead of channels, there are user profiles. Tweets and posts are the programs, and Levy provides a look into getting loyal viewers to stay tuned. Content matters but Context matters more. Scott hustles and is a true entrepreneur, and if you know me I love hustle!—Gary Vaynerchuk, Author, Jab Jab Jab Right HookYou want to go far, you need the fuel. You want to rock social media, you need Scott's book. He takes all the crap we hear on a regular basis and turns it into actual facts you can put towards increasing your business and revenue TODAY. Want to make sense of it all? Buy this book. —Peter Shankman Founder, HARO (helpareporter.com) Co-Founder, Shankman|Honig (shankmanhonig.com)There are very few good starting points for knowledge when it comes to figuring out how to work your way through the world of social media. As I read Levy's tips, I found myself nodding in agreement several times - as though I could've written them myself based on my own experiences. I'd have no need to write them now, though - I'd simply share this book!—Chris Pirillo, Social Content Curator LockerGnome.com @ChrisPirilloI'm impressed with the work of Scott Levy of Fuel Online. Scott not only truly understands social media engagement, but he's one of Kred's top influencers. To really understand influencers, it is important to be one as well.—Andrew Grill, CEO, KRED a leading social influencer platformAs an actress in Hollywood I thought I had a pretty good grasp of the importance of Social Media and its uses. Then I met Scott Levy from Fuel Online and he opened up a whole new Twitterverse to me! He has taught me so much about Twitter and Facebook and the power they have in my career. Thanks Scott. Wait, I should Tweet this…—Rebecca Mader, Actress, Lost, Devil Wears Prada, Iron Man 3Scott and Fuel Online are a top notch firm. They know their business inside and out and are continually focused on delivering results. I'd highly recommend them—Mike Hostetler, Founder and CEO, appendToFuel has been an awesome addition to our social media team and has provided us with great insight and fresh ideas in the field. Scott and his team at Fuel are easy to work with and get things done the right way.—Ronnie Winter - CEO/Manager/Lead Singer The Red Jumpsuit ApparatusScott Levy and Fuel Online consulted in my social media strategy. His advice I found helpful and we brainstormed together on Twitter and helped with my Facebook presence as well. He's been in the business a long time and knows his stuff.—Todd Hoffman, Creator, Gold Rush on the Discovery Channel",
  "genres": [
    "Business",
    "Nonfiction"
  ],
  "author": "Scott Levy",
  "average_rating": "3.49",
  "url": "https://www.goodreads.com/book/show/18007142-tweet-naked"
}