{
  "title": "A Wicked Pursuit",
  "description": "In Isabella Bradford's enthralling new trilogy, three noble brothers--London's most scandalous rakes--are about to do the unthinkable: settle down. Harry Fitzroy, Earl of Hargreave, is the first to meet his match and lose his heart . . . to a lady who's not all what he expected.   As the eldest son of the Duke of Breconridge, Harry Fitzroy is duty-bound to marry--and marry well. Giving up his rakish ways for the pleasures of a bride's bed becomes a delightful prospect when Harry chooses beautiful Lady Julia Wetherby, the catch of the season. But a fall from his horse puts a serious crimp in his plans. Abandoned by Julia before he can propose, the unlucky bachelor finds himself trapped in the country in the care of Julia's younger sister.Harry has never met a woman like Lady Augusta. Utterly without artifice, Gus is clever and capable, and seems to care not a fig for society. After a taboo kiss awakens passion that takes them both by surprise, Harry realizes he'd almost given his heart to the wrong sister. While London tongues wag, he'll use his most seductive powers of persuasion to convince the reluctant Gus that she belongs with him--as his equal, his love, his wife.Praise for A Wicked Pursuit \n \n \"The appealing characters, the emotional growth of the hero and the lively dialogue turn what could have been a predictable tale into a delightful non-stop read. This is a fine start to a new trilogy.\"--RT Book Reviews \n \n \"This story is every bit as delightful as those by my favorite Regency authors: Lisa Kleypas, Sabrina Jeffries, Julia Quinn. . . . I will definitely be looking for the other books in the series!\"--Susana's Parlour \n \n \"A bewitching tale of a most accidental match.\"--Shelf Awareness \n \n \"Isabella Bradford's experience shows with her charming, witty tale. . . . Wonderfully crafted, the next installments are sure to please as this one most decidedly did.\"--Literarily Illumined \n \n \"Bradford pulls no punches, which makes the story all the richer. . . . Period details create a believable world that fully immerses the reader.\"--Heroes and Heartbreakers \n \n \"I loved seeing the quality of the story come through. . . . Overall a hypnotic love tale to overwhelm, excite, and endear you. A rare treasure!\"--Addicted to Romance \n \n \"An awesome start to a new series and I can't wait for the rest of it to come out. . . . I will definitely be going back and reading her Wylder Sisters series.\"--Historical Romance Lover",
  "genres": [
    "Historical Romance",
    "Romance",
    "Historical",
    "Historical Fiction",
    "Regency",
    "Adult",
    "British Literature"
  ],
  "author": "Isabella Bradford",
  "average_rating": "3.57",
  "url": "https://www.goodreads.com/book/show/18007523-a-wicked-pursuit"
}