{
  "title": "Europe Without Capitalism: Political and Philosophic Thoughts",
  "description": "The book brings forward the author's personal attitudes to the analysis of the present difficult political, economic, and financial situation in the EU member states. It reveals the author's prognoses of the necessity of system reforms, avoiding useless attempts to reanimate the obsolete political and financial structure of capitalism. In the author's opinion, for objective reasons, modern capitalism is not able to solve problems of preservation of life-supporting financial institutions the European states and the West are facing today. The author thinks that Europe has to go over to a postcapitalistic way of development. This is the call of the times, the demand of the historical moment. Capitalism as a system of political and economic development has completed its historical mission, having brought Western countries to the highest level of economic and technical development, creation of the best welfare for the countries of Europe and the West (i.e., it has exhausted resources for progress). Principally, new empires should have been built ten years ago (i.e., it was time for imperialism). However, today it is impossible for objective reasons. Countries like China, Russia, former USSR republics, and part of the third world will develop according to the capitalistic way of development, taking into consideration a mass of mistake the West has made. They have a huge amount of resources for a capitalistic way of development. What will happen to Europe in the future? Prof. Rafig Y. Aliyev has specific proposals about that worthy of attention and discussion. However, the delay of important decisions on the very political and financial system may turn into a tragedy for many nations, including the EU member states. The book is meant for a wide circle of readers.",
  "genres": [],
  "author": "Rafig Y. Aliyev",
  "average_rating": "4.68",
  "url": "https://www.goodreads.com/book/show/18008981-europe-without-capitalism"
}