{
  "title": "Subversive Words: Public Opinion in Eighteenth-Century France",
  "description": "From the \"Paris was fond of stormy weather and emerging toads; the thirst for knowledge was supreme, and the first to read and reread the news were the first to render it with criticism. Authors and readers, great and small, all shared the impression that they were caught between truth and falsehood, and moreover that the 'probable-improbable' they relished so much was being manipulated by the complex strategies of the court, the police and the petty hordes of the evil-minded. We cannot understand the curiosity of the Parisian public without realizing that they did at least know one the extent they were being made fools of.\" The eighteenth century was awash with rumor and talk. The words and opinions of ordinary people filled the streets of Paris. But were these simply the isolated grumblings and gossip of the crowd, or is it possible to speak of genuine \"public opinion\" among the common people? This is the subject of Subversive Words , the newest book by French historian Arlette Farge. Farge begins with Jürgen Habermas's notion of a bourgeois public sphere. However, whereas Habermas was concerned mostly with the \"cultured classes,\" Farge focuses on the uneducated common people. Drawing on chronicles, newspapers, memoirs, police reports, and news sheets from the time, she finds that by the second half of the eighteenth century ordinary Parisians had come to assert their right to hold and declare clear opinions on what was happening in their city—visible, real, everyday events such as executions, price rises, and revolts. Yet the government preferred to regard ordinary Parisians as unsophisticated, impulsive, or inept. In the years leading up to the Revolution, however, the administration increasingly feared the mobilization of these people. Officially, it denied the existence of any distinct popular public opinion, but in practice it kept the streets of Paris under regular surveillance through a system of spies, inspectors, and observers. Amid this curious tension between denial and action, Farge argues, popular rumors arose and gained a life of their own. Wise and filled with vivid descriptions of everyday life, Subversive Words is cultural and intellectual history at its best.",
  "genres": [
    "History",
    "France",
    "18th Century"
  ],
  "author": "Arlette Farge",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/1801184.Subversive_Words"
}