{
  "title": "The Prodigal: A Ragamuffin Story",
  "description": "From the inspirational author of The Ragamuffin Gospel  and the critically acclaimed novelist of Free Bird  comes a powerful contemporary retelling of the Parable of the Prodigal Son.Jack Chisholm is \"the people's pastor.\" He leads a devoted and growing megachurch, has several best-selling books, and a memorable slogan, \"We have got to do better.\" Jack knows how to preach, and he understands how to chastise people into performing. What he doesn't know is anything about grace.This year, when it comes time for the Christmas sermon, the congregation at Grace Cathedral will look to the pulpit, and Jack will not be there. Of course, they will have seen plenty of him already--on the news.After an evening of debauchery that leads to an affair with his beautiful assistant, Jack Chisholm finds himself deserted with chilling swiftness. The church elders remove him from his own pulpit. His publisher withholds the royalties from his books. Worst of all, his wife disappears with their eight-year-old daughter.But just as Jack is hitting bottom, hopeless and penniless, drinking his way to oblivion, who should appear but his long-estranged father, imploring his prodigal \"Come home.\"A true companion piece to Brennan Manning's  The Ragamuffin Gospel, The Prodigal illustrates the power of grace through the story of a broken man who finally saw Jesus not because he preached his greatest sermon or wrote his most powerful book, but because he failed miserably. Jack Chisholm lost everything--his church, his family, his respect, and his old way of believing--but he found grace. It's the same grace that Brennan Manning devoted his life to profound in nature and coming from a God who loves us just as we are, and not as we should be .\"A wonderfully written story that is as entertaining as it is thought provoking.\" --Publishers Weekly , starred review\". . . the consummate final tale. What they have created is the Ragamuffin at his best, full of hope, full of love, and finally, full of belief in the goodness of God.\" --Phyllis Tickle, founding editor, Religion Department, Publishers Weekly\"Brennan Manning's last work continues the powerful message of grace and forgiveness that has transformed so many lives. The Prodigal will transform you too.\" --Mark Batterson, New York Times best-selling author of The Circle Maker",
  "genres": [
    "Christian Fiction",
    "Fiction",
    "Christian",
    "Spirituality",
    "Audiobook",
    "Religion",
    "Faith"
  ],
  "author": "Brennan Manning",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/18012379-the-prodigal"
}