{
  "title": "Opiate Addiction - The Painkiller Addiction Epidemic, Heroin Addiction and the Way Out",
  "description": "Opiate addiction has reached epidemic proportions in the United States, and the problem shows no signs of slowing. Overcoming addiction is tough and, with opiates, many find it nearly impossible. Overdose deaths from prescription painkillers have more than quadrupled over the last fifteen years, and this is just a fraction of the problem. In fact, with prescription opiate addiction now shown to be a gateway drug to heroin, the issue is only getting worse. Last year alone, 11.5 million Americans abused some type of opioid, and more than 660,000 have used heroin in the past year.If you or someone you love is addicted to opiates, Opiate Addiction , now in its 6th Edition, offers a powerful message balanced with both useful information and hope for a way out from its stifling grip. There is no doubt that addiction is a cunning and cruel disease that robs its victims of nearly everything. Those suffering from opiate addiction are often baffled by its effects on their lives and the devastation that can be wrought in such a short period of time. Loved ones feel helpless and hopeless as they are forced to stand by and watch as someone they care about erodes before their eyes.Are you looking to move beyond addiction? With a clear approach to providing hard facts and drawing on her own history of opiate addiction and recovery, author Taite Adams is able to give the opiate addict or their loved ones answers to many questions, allay common fears, and provide a clear direction for a way out. Some of the areas that are addressed in detail are:Whether just coming to terms with the idea that there is a \"problem\", looking for opiate detox help, or considering going to treatment, opiate and heroin addiction help is available in many forms and Opiate Addiction is an invaluable tool to get your questions answered about overcoming addiction and help you move one step closer to freedom and to a better way of life. 6th Edition Released January 10, 2018.Tags: opiate addiction, painkiller addiction, heroin addiction, opiates, addiction, heroin detox, opiate detox, opiate recovery, opiate withdrawal, opiate detox, opiate addictions",
  "genres": [
    "Nonfiction"
  ],
  "author": "Taite Adams",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/18013776-opiate-addiction---the-painkiller-addiction-epidemic-heroin-addiction-a"
}