{
  "title": "Beyond the Gloaming Pass: An Emotional High Fantasy Adventure",
  "description": "★★★★★ “Beyond the Gloaming Pass did not just keep me glued to my seat. It dominated my thoughts... Fantasy does not get much better than this!” -Joseph Ogbonna, Readers’ FavoriteLife in the gas-lit city of Tunswick has never been easy for best friends Rubriel and Molindra.An unlicensed mage, Molindra struggles to contain her innate magical abilities, while Rubriel bounces from one job to the next after industrialization left her skillset redundant. When a contract from a wealthy merchant offers a hefty payout for a dangerous mission in a mysterious land, Molindra seizes the opportunity for a better life.Cold, barren and brutally efficient, the Gloaming Mountains conceal a powerful nation, where the sun never rises and the dead watch tirelessly - a nation determined to claim Bantria’s abundant natural resources for themselves. In the heart of Langlythe, Molindra receives the mage training she so desperately desires. In return, she must retrieve an ancient artifact buried deep in the frozen north. Fears for her safety at odds with festering resentment, Rubriel chases Molindra through inhospitable territory. The pair soon find themselves swept onto opposite sides of a bitter conflict that spirals rapidly out of control.Separated and pushed to the limits of endurance, their journey will put the bonds of friendship to the ultimate test and challenge their perception of the world to its very core. Will they reunite and save Bantria from the growing threat, or become unwitting agents of its destruction?Beyond the Gloaming Pass is a down-to-earth high fantasy adventure that weaves together themes of friendship, resilience, and the search for truth. With its strong female leads, profound emotional depth, and heart-wrenching conclusion, this book will keep readers enchanted until the very last page.\"Riveting and breathtaking. If you enjoy original takes on high fantasy you will be captivated with this novel.\" -The International Review of Books★★★★★ \"Beyond the Gloaming Pass is the type of fantasy book I can immerse myself in for hours without realizing it.\" -Miche Arendse, Readers' Favorite★★★★★ \"This book amazed me with its exceptional world-building... a must-read for the fans of A Song of Ice and Fire saga.\" -Shrabastee Chakraborty, Readers' Favorite ★★★★ \"Engaging plot, meticulously crafted characters, and a compelling theme... an absorbing read.\" -Literary Titan",
  "genres": [],
  "author": "Rebecca  Holmes",
  "average_rating": "4.45",
  "url": "https://www.goodreads.com/book/show/180173826-beyond-the-gloaming-pass"
}