{
  "title": "Bookmarks: Reading in Black and White A Memoir",
  "description": "\"BookMarks is a moving and revelatory memoir... a work of fiercely intelligent scholarship.\" - Susan Larson, \"Erudite and emotional in turns, [BookMarks] is full of truths that appeal to the head and the heart.\" - Charlotte News Observer\"What are you reading? What books have been important to you? Whether you are interviewing for a job, chatting with a friend or colleague, or making small talk, these questions arise almost unfailingly.  Some of us have stock responses, which may or may not be a fiction of our own making. Others gauge their answers according to who is asking the question. Either way, the replies that we give are thoughtfully crafted to suggest the intelligence, worldliness, political agenda, or good humor that we are hoping to convey.  We form our answers carefully because we know that our responses say a lot.But what exactly do our answers say? In BookMarks , Karla FC Holloway explores the public side of reading, and specifically how books and booklists form a public image of African Americans. Revealing her own love of books and her quirky passion for their locations in libraries and on bookshelves, Holloway reflects on the ways that her parents guided her reading when she was young and her bittersweet memories of reading to her children. She takes us on a personal and candid journey that considers the histories of reading in children’s rooms, prison libraries, and “Negro” libraries of the early twentieth century, and that finally reveals how her identity as a scholar, a parent, and an African American woman has been subject to judgments that public cultures make about race and our habits of reading.Holloway is the first to call our attention to a remarkable trend of many prominent African American writers—including Maya Angelou, W.E.B. Du Bois, Henry Louis Gates, Malcolm X, and Zora Neale Hurston. Their autobiographies and memoirs are consistently marked with booklists—records of their own habits of reading. She examines these lists, along with the trends of selection in Oprah Winfrey’s popular book club, raising the What does it mean for prominent African Americans to associate themselves with European learning and culture? How do books by black authors fare in the inevitable hierarchy of a booklist? BookMarks provides a unique window into the ways that African Americans negotiate between black and white cultures. This compelling rumination on reading is a book that everyone should add to their personal collections and proudly carry “cover out.”",
  "genres": [
    "Nonfiction",
    "Books About Books",
    "Memoir"
  ],
  "author": "Karla F.C. Holloway",
  "average_rating": "3.64",
  "url": "https://www.goodreads.com/book/show/1802699.Bookmarks"
}