{
  "title": "Hagar Of The Pawnshop",
  "description": "Hagar Of The Pawnshop is a novel written by Fergus Hume. The story revolves around a young woman named Hagar who is forced to work in a pawnshop after her father's sudden death. Hagar is a strong-willed and determined character who faces a number of challenges in her new job. She must deal with difficult customers, navigate the complex world of pawnbroking, and try to keep her own personal life in order. Along the way, Hagar meets a number of interesting characters, including a handsome young man named Jack, who becomes her love interest. As the story unfolds, Hagar finds herself caught up in a web of intrigue and danger, as she becomes involved in a plot to steal a valuable diamond. With its fast-paced plot, engaging characters, and vivid descriptions of life in a pawnshop, Hagar Of The Pawnshop is a captivating read that will keep readers on the edge of their seats from beginning to end.Hagar hesitated. The article, notwithstanding its workmanship, its age, and its historical associations, was worth very little. Had its interest consisted of these merely, she would not have taken the key in pawn. But the row of mysterious figures decided her. Here was a secret, connected--as was probable from the remark of the old man--with a hidden treasure. Remembering her experience with the cryptogram of the Florentine Dante, Hagar determined to retain the key, and, if possible, to discover the secret.This scarce antiquarian book is a facsimile reprint of the old original and may contain some imperfections such as library marks and notations. Because we believe this work is culturally important, we have made it available as part of our commitment for protecting, preserving, and promoting the world's literature in affordable, high quality, modern editions, that are true to their original work.",
  "genres": [
    "Fiction",
    "Mystery",
    "Historical"
  ],
  "author": "Fergus W. Hume",
  "average_rating": "3.83",
  "url": "https://www.goodreads.com/book/show/1803437.Hagar_Of_The_Pawnshop"
}