{
  "title": "The Ghost in the House: Motherhood, Raising Children, and Struggling with Depression",
  "description": "An award-winning reporter for the Washington Post , Tracy Thompson was thirty-four when she was hospitalized and put on suicide watch during a major depressive episode. This event, the culmination of more than twenty years of silent suffering, became the point of departure for an in-depth, groundbreaking book on depression and her struggle with the disease. The Beast shattered stereotypes and inspired countless readers to confront their own battles with mental illness. Having written that book, and having found the security of a happy marriage, Thompson assumed that she had learned to manage her illness. But when she took on one of the most emotionally demanding jobs of all—being a mother—depression returned with fresh vengeance. Very quickly Thompson realized that virtually everything she had learned up to then about dealing with depression was now either inadequate or useless. In fact, maternal depression was a different beast altogether. She tackled her problem head-on, meticulously investigating the latest scientific research and collecting the stories of nearly 400 mothers with depression. What she found was a problem more widespread than she or any other mother struggling alone with this affliction could have imagined. Women make up nearly 12 million of the 19 million Americans affected by depression every year, experiencing episodes at nearly twice the rate that men do. Women suffer most frequently between the ages of twenty-five and forty-four—not coincidentally, the primary childbearing years. The Ghost in the House , the result of Thompson's extensive studies, is the first book to address maternal depression as a lifelong illness that can have profound ramifications for mother and child. A striking blend of memoir and journalism, here is an invaluable resource for the millions of women who are white-knuckling their way through what should be the most satisfying years of their lives. Thompson offers her readers a concise summary of the cutting-edge research in this field, deftly written prose, and, above all, hope.",
  "genres": [
    "Parenting",
    "Nonfiction",
    "Psychology",
    "Memoir",
    "Mental Illness",
    "Medical",
    "Womens"
  ],
  "author": "Tracy Thompson",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/1803874.The_Ghost_in_the_House"
}