{
  "title": "مضاد حيوي لليأس: قصص نجاح سعودية",
  "description": "قررت جمع هذه السطور بين دفتي كتاب بعد أن شعرت بحاجتنا الماسة إلى قصص نجاح محفزة وملهمة. إلى أمثلة معاصرة نقتفي أثرها. فمن يتصفح رفوف مكتباتنا العربية سيجد الكثير من قصص النجاح المستوردة، التي نبتت في بيئة غير بيئتنا. في محيط غير محيطنا، مما يقلل من حجم تأثيرها وفعاليتها. فرأيت أن أضع هذه الوجوه السعودية المتميزة بين أيديكم لعلها تساهم ولو بقدر طفيف في شحذ الهمم وتعزيز الثقة في دواخلنا. فالناجحون الذين قطفتهم من أنحاء وطننا الغالي لم يترعرعوا في بوسطن الأمريكية أو طوكيو اليابانية أو أمستردام الهولندية بل نشأوا في المملكة وحققوا نجاحات مختلفة ومتفاوتة. درسوا في نفس فصولنا. عاشوا في منازل تشبه منازلنا. لكنهم امتطوا أحلامهم دون أن تخدرهم الإحباطات وتثبط عزائمهم الكلمات متسلحين بالطموح والإرادة، متيمنين بقول الشاعر ابن هانئ:ولَمْ أَجِدِ الإِنْسانَ إِلاَّ ابْنَ سَعْيِهِفَمَنْ كانَ أَسْعَى كانَ بِالمَجْدِ أَجدَرَاوبِالهِمَّةِ العَلْياءِ يَرْقَى إلى العُلَىفَمَنْ كانِ أَرقَى هِمَّةً كانَ أَظْهَرَاعلى الصعيد الشخصي تأثرت بالكثير مما التقيتهم وكتبت عنهم في هذا الكتاب. كأم عبد الهادي المري، الفرّاشة في الإبتدائية الرابعة عشرة بالجيبل، التي تدرس حاليا في كلية التربية بالخفجي وهي في الستين من عمرها. والتي تكنس الفصول بيد وتكنس جهلها باليد الأخرى، مواصلة تعليمها في ظروف صعبة ووسط 11 ابن وابنة تعتني بتربيتهم وشؤونهم. تأثرت جدا بكفاح صديقي سنوي شراحيلي، من ذوي الاحتياجات الخاصة، الذي كان يذهب لمدرسته في قرية الخقاقة التابعة لمحافظة الحرث بمنطقة جازان، التي تبعد عن منزله نحو كيلومتر ونصف حبوا لعدم قدرة والده على توفير كرسي متحرك له وقتئذ، بينما الآن يركض نحو تحقيق حلمه بالحصول على درجة الدكتوراه في إدارة المنازعات الدولية في بريطانيا.أسرني إصرار إبراهيم المعجل للحصول على درجة الدكتوراه من جامعة ستانفورد، أحد أهم الجامعات العالمية، رغم كل الصعوبات التي واجهته. استفزني ذكاء عادل الطريفي، الذي حول حادث السير الأليم الذي تعرض له إلى دافع للتحليق عاليا، حيث أصبح حاليا رئيسا لتحرير مجلة المجلة وباحثا مرموقا في جامعة لندن.أدهشني بتال القوس الذي استطاع أن يحفر الصخر ليصبح أحد أكثر المذيعين السعوديين أجرا جراء كفاحه وموهبته.أبهرني فهد الأحمدي بقدرته تحويل كلمات صغيرة سمعها في بوفيه صغير إلى وقود للنجاح العارم بعد أن أخفق في متابعة دراسته.أنا على يقين تام أن هذه الوجوه ستملؤكم زهوا وحماسة كما ملأتني. وستطرد يأسكم وستجعلكم تلاحقون أحلامكم وتحتفلون بإنجازاتكم.",
  "genres": [
    "Nonfiction"
  ],
  "author": "عبدالله المغلوث",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/10869768"
}