{
  "title": "Mirage - The First of the Nascentian Chronicles",
  "description": "What if every bedtime story ever told to any child by any parent in all the history of all the cultures of the world...was real?What if there was another world, parallel to ours where all these stories thrive? A world where the veil between our world and theirs is thin, and easy to slip through?Exactly one year after his 19 birthday, Kellen T. Samuelsson finds himself on the green trails of Grouse Mountain where he runs into a beautiful and mysterious young woman who calls herself 'Mirage' and changes his life forever. In an epic new tale of adventure, fantasy, myth, and love, young Kellen is whisked away to a new world, her world. The world Mirage calls home is very different from ours. But the fate of our two worlds are intertwined. All of our futures rest in Kel's hands, as he battles to preserve the delicate balance in Nascentia with Mirage at his side. In the world of Nascentia, readers will discover their imaginary friends and get courage and help from their favorite heroes. Nascentia is home to the characters of myth and legend from all over the world, from every culture, from the mind of every child. The world of Nascentia is constantly changing. Old stories die, while others live on, and more are yet born. Their very existence depends on humanity's belief...a delicate balance of faith and knowledge.Do you believe?Experience the beginning of a Saga unlike any other...yet more familiar than you think.Reviews from readers:\"Worth every minute of your time...you will come to realize a little more fully the importance of storytelling and the beauty of childhood imagination.\" -M.Wilfley\"...inspiring, and it's depth and plot intrigues and demands respect.\" -K.Plett\"Be prepared to get lost in this entrancing book!\" -S.Davy",
  "genres": [],
  "author": "David J. Eden",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/18039586-mirage---the-first-of-the-nascentian-chronicles"
}