{
  "title": "The ABCs and Ñ of America's Cultural Evolution: A Primer on the Growing Influence of Hispanics, Latinos, and mestizos in the USA.",
  "description": "“The ABCs and Ñ of America’s Cultural Evolution: A Primer on the Growing Influence of Hispanics, Latinos, and mestizos in the USA” is a veteran communicator's perspective of 500 years of cultural evolution by the Western Hemisphere's mestizo—most of today’s 52 million U.S. Hispanics and Latinos. This collection of essays provides readers the “basics” about the largest and fastest growing ethnic consumers, employees, students, taxpayers and voters in the USA.“The ABCs and Ñ” focuses on a variety of issues, from omission of Latino history and contributions, to debunking of unsubstantiated stereotypes, to the growing Latino presence in the social fabric of the USA. The author’s personal experiences as a community activist, television news journalist, public and corporate executive—and marketing consultant to some of the most respected corporations and nonprofits in the USA—give readers a practitioner's perspective on how to create culturally relevant outreach efforts aimed at our nation's largest and fastest growing ethnic population.This book explains how similar histories and cultures have helped members of this diverse ethnic group adapt to two of the greatest world powers of their respective times: Spain and the USA. Hispanics, Latinos, and mestizos are creating a “tipping point” in areas affecting U.S. society: the economy, education, politics, and workforce development. “The ABCs and Ñ” will help readers improve their cultural intelligence, relevance, and competence in their personal and professional interaction with members of our nation's largest non-European ethnic population.Advance copies available online at: http://on.fb.me/16yKVKF",
  "genres": [],
  "author": "Jim Estrada",
  "average_rating": "0.00",
  "url": "https://www.goodreads.com/book/show/18039655-the-abcs-and-of-america-s-cultural-evolution"
}