{
  "title": "Public Obsession",
  "description": "*** The entire Awakening Sophy series is now available in Awakening Sophy: The Boxed Set Books 1-6 (Includes a Special Bonus Story) for the low price of $3.99 ***An Amazon Top 50 Hot New ReleaseThe Sizzling Sequel to the Amazon Top 50 Best Seller in Erotica - Stranger Addiction from Amazon Best Selling Author - Bianca JamesSophy was satisfied with her cloistered existence. You couldn't get hurt again if you kept to yourself. Right?Then The Stranger entered her home, and Sophy.After exposing a highly erotic, insatiable part of her that she had never been aware of, what is she to do?She can try to go back to her old life, but it’s not that easy to put the Genie back into the bottle and when she meets the hard bodied, charismatic and commanding Rick, does she even want to try?Is she really up to the challenge of satisfying her freshly awakened, ravenous appetite for erotic fantasy?Another compelling, sex charged, addictive and highly erotic short story which will leave you begging for another.If you’re tired of Shades of Grey and looking for a well written, refreshingly steamy read, then you will love this.This is not a standalone story. It is the sequel to Stranger Addiction, which should be read first and is currently available, for a limited time, at only 99 cents.Here’s what a couple of readers had to say about Stranger Addiction …\"One of those short, hot secret books you sneak in every once in a while. I really liked it but don't tell anybody.\" 4 Stars - Goodreads“This story took me to a place in my mind that you will want to be. Can't wait for the next book.” 5 Stars – Amazon Review** Warning: This highly erotic, 10,500 word story, is suitable for adults only (18+) as it contains many explicit sex scenes between consenting adults, sex fantasies, graphic language, elements of BDSM, oral sex, spanking, rough sex and anal play **",
  "genres": [],
  "author": "Bianca  James",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/18042168-public-obsession"
}