{
  "title": "Đảo Tường Vy",
  "description": "Truyện kể về cuộc hành trình đơn độc của một cô gái khi đi qua các nước Việt Nam, Campuchia, Hong Kong, Tây Tạng....mục đích duy nhất chính là để bản thân nhìn thấy mình đang đi.Mỗi chuyến đi là sự trở về với nội tâm, sự nhận biết mình và con đường nối với thế giới cho nên khung cảnh ở những nơi dừng chân ngắn ngủi của cuộc đời này đều không quan trọng.Tình cảm và nỗi cô đơn trên thế giới này ở đâu cũng như nhau. Nên đi, cũng chính là một cách để nhìn thấy mình trong tất cả và tất cả trong mình.Vì thế mà du hàng cũng là bắt của một cuộc phiêu lưu tâm tưởng.Chuyến du hành của riêng tác giả còn là một hành trình soi lại ký ức. Ký ức trĩu nặng một tình cảm sâu sắc và dở dang, với BỐ. Có những khoảnh khắc như một nhát dao chém, vết thương còn lại mãi. Khoảnh khắc chuyển đổi từ thân phận này sang thân phận khác khi chấm dứt một kiếp luân hồi. Khoảnh khắc rơi vào tình yêu và giây phút giã từ. Những khoảnh khắc ấy, từ trang sách, ta bắt gặp âm thanh của nội tâm vang vọng chân thành.Đảo Tường Vy còn là một sự tìm kiếm chính mình trong tình yêu. \"Tình cảm là bài học suốt đời của chúng ta\", nên đây mới là chuyến du hành không có điểm dừng. Tình yêu dường như chỉ là ảo giác. Trong tình yêu, hoặc là an toàn, hoặc là tự do, không thể cùng một lúc nắm được cả hai, và \"thứ mà chúng ta yêu vẫn chỉ là bản thân tình yêu\". Có những tổn thương phải trả giá. Nhưng tình yêu mãi là một khát khao êm ả của con người, như nỗi khát khao của linh hồn cần một nơi cập bến. Tuy nhiên, linh hồn cứ mãi lang thang. Lang thang nên bất an thường trực. Tìm sự tĩnh tại thật dễ dàng mà cũng rất không.Triết lý về tình yêu và cuộc sống đan xen nhuần nhị trong những ghi chép nhỏ. Cuốn sách vì vậy đẫm một hương vị quyến rũ. Quyến rũ như bản thân những cuộc du hành và tình yêu. Trong nỗi trầm cảm ngọt ngào, sâu lắng, con đường đẹp nhất là con đường giúp ta tìm thấy mình. Từ một trái tim bình tĩnh, hơi thở mang chút u sầu cũng lấp lánh như một ánh nắng soi nghiêng và tươi mát như giọt mưa đầu mùa trong trẻo...",
  "genres": [
    "Chinese Literature",
    "Fiction",
    "China"
  ],
  "author": "An Ni Bảo Bối",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/10870752-o-t-ng-vy"
}