{
  "title": "The Bitter Glass",
  "description": "From the pen of one of Ireland’s most distinguished writers comes a powerful novel, set in Connemara at the time of the Civil War.A group of young people, isolated in a remote farmhouse by an IRA attack, are confronted with questions of life and death. As the plot builds to a shattering climax, their harrowing experience alters their lives and their hopes forever.The Bitter Glass is a haunting and evocative book, and enjoyed critical acclaim upon publication in 1958. It is essential reading for anyone interested in Irish literature and history, and a superb novel in its own right.Praise for The Bitter Glass :’ The Bitter Glass has a rounded excellence which comes from a mature technique and imagination of high quality. Without being in the least overwritten or sentimental, this is a most poetical book’ - The Times‘This is a subtle and nicely crafted story, which deals directly with themes of life and death and war, without becoming sentimental or over dramatic. The descriptions of rural Connemara and its people are beautifully constructed, so that the reader can almost smell the peat smoke and hear the waves on the shore …’ - Goodreads reviewBorn in Galway in 1920, Eilís Dillon wrote more than forty books, published in several languages including Irish, English, French, Flemish, German, Polish, Czech, Icelandic, Swedish, Hebrew and Italian. Her six novels and many children’s books, on a wide variety of subjects, had already won her numerous distinctions and a widespread critical reputation by the time her bestselling historical novel, Across the Bitter Sea , was published in 1974. Acclaimed by the Sunday Times as ‘a quite remarkable novel … a novel of which Zola might have felt proud’, this was followed by Blood Relations (1977), Wild Geese (1981) and Citizen Burke (1984). In 1982 she published ‘Inside Ireland’, a personal essay about the country, its people, places and history. She was elected a Fellow of the Royal Society of Literature in 1979.",
  "genres": [
    "Ireland",
    "Fiction",
    "20th Century",
    "War",
    "Literature",
    "Classics",
    "Irish Literature"
  ],
  "author": "Eilís Dillon",
  "average_rating": "3.29",
  "url": "https://www.goodreads.com/book/show/1804324.The_Bitter_Glass"
}