{
  "title": "The Business Parables",
  "description": "First Preview of the Second Edition !! I almost got thrown out when I suggested to the head of a well-known educational establishment that I wanted to tell students about business. ‘How dare you pollute the pristine environs of this august institution’ was what her eyes said to me. To her business smacked of greed and accumulation. I can hardly blame her. Like gravity, business was not invented but discovered. It was already there. Peeping out, faceless, whenever someone traded wool for bread thousands of years ago or whenever, more recently, a small boy traded his prized candy for a turn at the video game. Like gravity, it is something of an intrinsic force that we can’t ignore. The same force can be used, both, for dropping bombs or for dropping food packets. Choice is ours. Almost three and half decades after I was told the story of ‘the hare and the tortoise’, I still remember the story, who won and why. I may not remember the distance, or how many stops the hare took or the speed comparison of both the contestants, but I remember the essence of the story. I remember the ‘point’ the story was trying to make. That is exactly my intention: to try and convey the ‘point’ of business. I wish I could use the hare, the tortoise or the thirsty crow. Instead I have relied on a determined professor, an ambitious corporate honcho, an unforgiving thief and his goofy accomplice, a retired investment banker and two sons impatient to outdo their father. Years later, you might forget who the ‘tea-brewer’ to Professor Chatterjee was or who distracted Times-Square-car-thief Jim as he stood before the hardened Judge. You might forget the small Indian village and the big dreams closeted in it. Chances are you will forget the details but even if you want to, chances are, you may not forget the essence, ‘the big picture’.",
  "genres": [],
  "author": "Venugopal Gupta",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/18044819-the-business-parables"
}