{
  "title": "Islamophilia",
  "description": "Columnist and broadcaster Douglas Murray, with trademark wit, delivers an alarming analysis behind the events of the past week in the UK, as the country tries to make sense of the barbaric slaughter of British soldier Lee Rigby on the streets of London. In a devastating satire on the climate of fear in the UK today, Murray’s analysis is wildly entertaining yet ultimately profound:“If absolutely everybody in the world agrees on something – from the President of the United States to most film-stars, pop-stars, Popes, Bishops, atheists, writers, film-makers, brain-boxes and everyone else – then surely they must be right. Well, no. I think they are wrong. Wildly, terribly, embarrassingly and dangerously wrong, “ writes Murray.ISLAMOPHILIA shows how so many of the celebrities above, have, at some point chosen to abandon any hope or wish to criticize Islam and instead decided to profess some degree of love for it. Love, that Murray points out in the book, is often irrational and certainly misguided: Murray is not afraid to name and shame, and the book’s tour includes novelists Sebastian Faulks and Martin Amis, Boris Johnson, South Park, Tony Blair, Ridley Scott, David Cameron, Liam Neeson, Justin Bieber, Random House Publishers, the BBC, Richard Dawkins, the Prince of Wales and even George Bush. Yes, George Bush.“They may have done this for a range of good and bad reasons. Some of them have to done it to save other people. Some of them have done it to save themselves. Some of them have done it because they are too stupid to do anything else and others because clever people can be really dumb at times.”Murray then goes to detail the extraordinary strategic cultural efforts made in recent years to “rewrite the last few millennia of history, minimising and denigrating the impact of actual scientists and promoting the claims of Islamic proselytisers” and he has fighting words for the version of history depicted by Ridley Scott and others in Hollywood.Artists and writers have been caught off-guard, he alleges, “Having poked at empty hornets nests for so many years they have forgotten the courage required to do the necessary poking at full ones.”He concludes, “Let’s be clear. For the record I don’t think everybody needs to spend their time being offensive about Islam. Not only is there no need to be offensive all the time, but most Muslims just want to get on with their lives as peacefully and successfully as everybody else. But there is an un-evenness in our societies that needs to be righted…to think that the answer to any criticism of Islam or Muslims is a delegitimizing of critics and an indulgence in self-pity is not to make an advance. It is to pave the way for self-harm. For all of us.Where people are telling lies about it we should not be fearful to correct them. And where people are fearful – and genuine reasons to be so do keep coming along – people should remind themselves of something. Which is that just as bravery in one person instils bravery in others, so cowardice in one person has a tendency to be catching.”",
  "genres": [
    "Politics",
    "Nonfiction",
    "Religion",
    "Islam",
    "Philosophy",
    "History",
    "Essays"
  ],
  "author": "Douglas Murray",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/18044655-islamophilia"
}