{
  "title": "Children of Time Book 1: The Smallest Giant",
  "description": "What century are heroes from?A HERO IS BORN IN ANOTHER TIMEKenneth may have thought his life was insignificant until one day he was caught up into something bigger than he ever imagined.Kenneth Yardrow, a shy 13 year old, had the impossible occur one day in class after school. Nearly everything that Kenneth had seen in science fiction and learned not to be true, became true. Without warning, space and time opened, and a man in a spacesuit actually entered into his eighth grade classroom. Before Kenneth could make sense of anything, he and his classmate Savannah, a girl he did not particularly like, were removed from the time they knew.When Kenneth woke up, he was no longer in school but in a place that could only exist in his dreams. Where was he? Who was the peculiar man staring at him? What does he even want with a 13 year old boy? And why was Savannah there, too?Kenneth has more questions than the strange man seems to have answers to. What will the stranger reveal? And how does one insignificant boy suddenly become so significant?EXCERPT\"Good morning, significant citizen,\" the man said. \"I trust you are well?\"The words came to Kenneth as though they traveled a long way to reach him. He put a hand to his forehead, already despising the headache that he felt growing there.\"What?\" was all Kenneth could utter. The back of his eyes felt like they were being punctured by shards of glass and he blinked his eyes in rapid succession, trying to will away the pain.\"I am your introductory guide to the 73rd century. My designation is Unquill Hester. Please be at ease. You were chosen out of an infinite number of lives in the time stream because you are special.\" The man, larger than any man Kenneth could remember seeing, looked delighted. He couldn't stop grinning.A light danced in the man's eyes. He looked to Kenneth like a scientist who'd just discovered a particularly fascinating insect in its natural habitat.",
  "genres": [
    "Amazon"
  ],
  "author": "G.J. Winters",
  "average_rating": "3.27",
  "url": "https://www.goodreads.com/book/show/18045977-children-of-time-book-1"
}