{
  "title": "Trapped Wings ,Open Sky . . . still I Want To Fly",
  "description": "An ardent stargazer, an egghead girl from a conservative North Indian family unlike her community girls doesn’t bind herself to the belief that education is synonymous with BA, parents are the unwritten rule and a husband is the God. She lives for her dream and fights to live it. She even lands the best deal (or so she thinks!) with a feeling that a good job in a so called esteemed giant MNC would solve all her problems and she would live happily ever after, only to realize that the real nightmare starts from day one. The newbie becomes poignant, strong and gawky all at same time with day to day life. So, she launches into her new life – swimming in sales figures, whimsical roommates and above all, her demanding boss for whom the only mantra for successful girl in the never-ending competitive corporate world is to keep her boss “happy” and everything else would follow instantly.She almost loses her conscience in order to protect and preserve her strength in the rat race. She withers and rejuvenates every day as she battles with the urge to be the star performer, her only aim is to prove that she is not a dumb bumpkin. The constant grasp of myriad things continues where she feels that the life is teaching her a lesson in the form of practical euphemism. Shuffling between insecure love, the lady on the fire and in being a minion, she discovers herself in this phenomenal life. The battle with her destiny rages on. The tryst with her own swaying doomed luck takes her travelling down a path she never intended to venture.Everything begins just as she calls it a day!A bagpiper, suave and intimidating, comes with a thrust, the only one who can save them all, the one who can drastically change their lives, the one who is the messiah, but only if he chooses to. He could turn around the fate but this is not unconditional! It demands a price! Will he help her? Will he rescue the fateful company? Will he be her savior? Will she be tired and succumb to the never ending gruesome life or will she find permanent elixir?All’s well that ends well, isn’t it?",
  "genres": [
    "Chick Lit"
  ],
  "author": "Nisha Arppit",
  "average_rating": "3.89",
  "url": "https://www.goodreads.com/book/show/10872261-trapped-wings-open-sky-still-i-want-to-fly"
}