{
  "title": "Summon Toren",
  "description": "Remember the Archangels’ mission? Satan has found a loophole in the rules that govern his battle against Good. The Archangel Uriel sends twelve Warrior Archangels to Earth on a mission to even the odds.Each Archangel has one month to find a couple, unite them, and use their union’s power to create the Holy Warriors needed to defend the world against Satan’s unholy creations.But the mission isn’t so simple when inheriting Humanity comes with challenges beyond the Angel’s training, and every milestone in the couple’s relationship effects the triumvirate’s strength.Kassern and Dorn have finished forming their triumvirates—oh wait, back up a minute—make that quadumvirates. Kassern had some difficulty dealing with his new human appetites and ended up taking a wife. Commander Uriel has determined Kassern’s indiscretion upset the entire power balance. The only solution is for all the archangels to find wives.And now it’s Toren’s turn. But the enemy is farther ahead than they anticipated, so the archangels must accomplish the unthinkable in half the time.The formula: find his couple, unite them, then join with his own selected wife. But true to his mercurial nature, Toren does things his own way. In this instance, reverse.With his sights set on a lady rancher, he has his hands full studying to be a cowboy and hog-tying demons before he ever gets a hold of his human couple. Once he does, he’s saddled with a Rodeo Queen that thinks all men are from the devil and an arrogant foreign soldier that seems determined to prove her right. All that’s left is to get them to fall in love without killing each other before all hell breaks loose.When Toren shows up at his prospective wife's ranch mid-emergency, he makes his own path to forge his quadumvirate but nothing works as it should. Battling demons, insane horses and mystical cowboys does little to prepare him for making love to a bitter woman resigned to a life alone. He could never have imagined two people as messed up as his human couple—a brainy beauty queen running from human traffickers and a desperate soldier seeking revenge on a brutal illegal arms dealer. How can Toren bind his quadumvirate and overcome demons while he's stuck dealing with his humans' issues and his own ignorance?  He better pray for a miracle.",
  "genres": [
    "Paranormal",
    "Angels",
    "Romance",
    "Fantasy",
    "Erotica"
  ],
  "author": "Kenra Daniels",
  "average_rating": "4.49",
  "url": "https://www.goodreads.com/book/show/18048528-summon-toren"
}