{
  "title": "The Eternal Nazi: From Mauthausen to Cairo, the Relentless Pursuit of SS Doctor Aribert Heim",
  "description": "From the New York Times reporters who first uncovered S.S. officer Aribert Heim’s secret life in Egypt comes the never-before-told story of the most hunted Nazi war criminal in the world.Dr. Aribert Heim worked at the Mauthausen concentration camp for only a few months in 1941 but left a devastating mark. According to the testimony of survivors, Heim euthanized patients with injections of gasoline into their hearts. He performed surgeries on otherwise healthy people. Some recalled prisoners' skulls set out on his desk to display perfect sets of teeth. Yet in the chaos of the postwar period, Heim was able to slip away from his dark past and establish himself as a reputable doctor and family man in the resort town of Baden-Baden. His story might have ended there, but for certain rare Germans who were unwilling to let Nazi war criminals go unpunished, among them a police investigator named Alfred Aedtner. After Heim fled on a tip that he was about to be arrested, Aedtner turned finding him into an overriding obsession. His quest took him across Europe and across decades, and into a close alliance with legendary Nazi hunter Simon Wiesenthal. The hunt for Heim became a powerful symbol of Germany's evolving attitude toward the sins of its past, which finally crested in a desire to see justice done at almost any cost. As late as 2009, the mystery of Heim’s disappearance remained unsolved. Now, in The Eternal Nazi, Nicholas Kulish and Souad Mekhennet reveal for the first time how Aribert Heim evaded capture--living in a working-class neighborhood of Cairo, praying in Arabic, beloved by an adopted Muslim family--while inspiring a manhunt that outlived him by many years. It is a brilliant feat of historical detection that illuminates a nation’s dramatic reckoning with the crimes of the Holocaust.",
  "genres": [
    "History",
    "Nonfiction",
    "World War II",
    "Holocaust",
    "Biography",
    "True Crime",
    "War"
  ],
  "author": "Nicholas Kulish",
  "average_rating": "3.70",
  "url": "https://www.goodreads.com/book/show/18050100-the-eternal-nazi"
}