{
  "title": "The Best of All Possible Worlds",
  "description": "Karen Lord’s debut novel, the multiple-award-winning Redemption in Indigo, announced the appearance of a major new talent—a strong, brilliantly innovative voice fusing Caribbean storytelling traditions and speculative fiction with subversive wit and incisive intellect. Compared by critics to such heavyweights as Nalo Hopkinson, China Miéville, and Ursula K. Le Guin, Lord does indeed belong in such select company—yet, like them, she boldly blazes her own trail. Now Lord returns with a second novel that exceeds the promise of her first. The Best of All Possible Worlds is a stunning science fiction epic that is also a beautifully wrought, deeply moving love story. A proud and reserved alien society finds its homeland destroyed in an unprovoked act of aggression, and the survivors have no choice but to reach out to the indigenous humanoids of their adopted world, to whom they are distantly related. They wish to preserve their cherished way of life but come to discover that in order to preserve their culture, they may have to change it forever. Now a man and a woman from these two clashing societies must work together to save this vanishing race—and end up uncovering ancient mysteries with far-reaching ramifications. As their mission hangs in the balance, this unlikely team—one cool and cerebral, the other fiery and impulsive—just may find in each other their own destinies... and a force that transcends all.Praise for The Best of All Possible Worlds\n \n “If you want to see science fiction doing something new and fascinating in 2013, then you shouldn't sleep on Best of All Possible Worlds.”—io9   “A vivid, detailed science fiction story with all the trappings of a quality romance, Lord’s sophomore novel is not to be missed.”—RT Book Reviews  “A rewarding, touching and often funny exploration of the forms and functions of human culture.”—SFX   “Multiple award-winner Lord’s latest is rewarding science fiction for emotional grown-ups.”—Mysterious Galaxy   “The Best of All Possible Worlds... poses an interesting question: What parts of you do you fight to preserve when everything you know suddenly changes?”—Associated Press",
  "genres": [
    "Science Fiction",
    "Fiction",
    "Romance",
    "Fantasy",
    "Aliens",
    "Science Fiction Fantasy",
    "Speculative Fiction"
  ],
  "author": "Karen Lord",
  "average_rating": "3.61",
  "url": "https://www.goodreads.com/book/show/18050081-the-best-of-all-possible-worlds"
}