{
  "title": "Hangman",
  "description": "New York Times bestselling author Stephan Talty’s acclaimed fiction debut, Black Irish, won him comparisons to such thriller masters as Jo Nesbø, Karin Slaughter, and Tana French. Now, his chilling new novel brings back intrepid heroine Absalom Kearney, a driven police detective with a haunted past, trying to make a difference in a troubled town. Hangman, Hangman, what do you see? Four little girls, as cute as can be. The eerie schoolyard chant still sends ripples of horror through North Buffalo. Not so long ago, serial killer Marcus Flynn preyed upon the community’s teenaged daughters—until he was cornered and shot in the head. But Flynn lived, carrying to prison the nickname “Hangman,” along with the secret of his last victim’s fate. Homicide cop Abbie Kearney wasn’t around during Hangman’s reign of terror. She hadn’t yet come home to wear her dad’s old badge in the tough Irish American stronghold known as “the County.” Abbie had never experienced firsthand the horror of Hangman. Until now. Hangman, Hangman, where do they go? Down on the ground, where the daffodils grow. A corrections officer lies dead, a prison van stands empty . . . and somewhere out there, the monster who condemned innocents to death at the end of a rope watches and waits to strike again. Abbie leads a desperate manhunt through a city driven to its knees by fear, matching wits with a predator as brilliant as he is elusive. But as more victims are claimed, a rising tide of secrecy, paranoia, and politics forces her to realize that stepping beyond the law may be the only way to find justice. Because with each passing hour, the stakes grow higher—and Hangman’s noose gets tighter.Praise for Hangman “An expertly judged dose of adrenaline.” — Kirkus Reviews “Stick with this one; it delivers.” — Booklist “Detective Abbie Kearney is back in this explosive thriller featuring not only a brutal serial killer, but also complex characters. . . . Plot twists will keep readers guessing right up until the grand finale.” — RT Book Reviews “[Stephan Talty has] a writerly knack for constructing compulsively readable narratives that can be consumed with considerable velocity and contentment. With flying colors, the fellow passes the ‘what happens next’ test.” — The Buffalo News",
  "genres": [
    "Mystery",
    "Thriller",
    "Fiction",
    "Suspense",
    "Mystery Thriller",
    "Crime",
    "Audiobook"
  ],
  "author": "Stephan Talty",
  "average_rating": "3.82",
  "url": "https://www.goodreads.com/book/show/18050076-hangman"
}