{
  "title": "Slices",
  "description": "An imagined disease spreads across a city. A fading horror movie star crafts his replacement. Two thieves wait for rescue at the end of the world. Human monsters are put to their final tests. Time stands still in fairy circles, loops in on itself for a runaway child, and can be rewritten in the pages of a book. Fifteen unforgettable stories to be read in the dark from dark urban fantasy author Michael Montoure.\" ... Montoure's spare, striking prose outlines characters in deliciously twisted predicaments .... \" -- Seattle WeeklyStories SEASON - His mother had always been a hypochondriac, but now a city has fallen ill with herONE LAST SUNSET - She wanted a vampire to promise her immortality, but it's nothing like it seemsREMAKE - A horror movie idol confronts the man who will play his most famous roleREST AREAS - A deadline, a suitcase full of cash, a stolen car -- and something in the trunkDADDY'S GIRLS - Children will come when the time is right, and not beforeLIFE STORY - When the pages of your life are laid out before you, what changes can you make?ONLY MONSTERS - A young boy, an old woman, and tales of the most frightening monster of allLULLABY FOR TWO VOICES - Her perfect child, or his dark twin -- one will be reclaimedORPHEUS - The worst part of Hell is not knowing you're thereWATCH THE COIN - A secret pact, a successful heist, and a fairy circleLOST BOY - A young boy runs away to a fairytale woods, only to find he's not alonePUPPETS - The man who bought the doll from him will ruin his career, if he can’t find it before it kills againTHE THIRTEENTH BOY - All the papers say the man behind the serial murders is a monster, but the monsters think otherwiseCOUNTERCLOCKWISE - An imaginary time machine, a tragic childhood secret; a man who can see into \"dead time\" sees a chance to make things right",
  "genres": [
    "Horror",
    "Short Stories",
    "Fiction",
    "Vampires",
    "Mystery"
  ],
  "author": "Michael Montoure",
  "average_rating": "4.10",
  "url": "https://www.goodreads.com/book/show/10103304-slices"
}