{
  "title": "Unsavory Elements: Stories of Foreigners on the Loose in China",
  "description": "Unsavory Elements is an unprecedented anthology of 28 new, original, true stories from some of the most celebrated foreign writers that have lived in modern China. Westerners are flocking to China in increasing numbers to chase their dreams even as Chinese emigrants seek their own dreams abroad, and life as an outsider in China has many sides to it - weird, fascinating and appalling... Edited by Tom Carter, this anthology falls under the genre of travel writing, yet travel is just the beginning of the adventure here.MEDIA REVIEWS\"Great vignettes from world class writers...a celebration of the outsider's experience in China, in all of its juiciness and fetid rancour.\" --Time Out Shanghai\"Excellent. Concise and truthful.\" --South China Morning Post\"Although other anthologies have featured outstanding journalism about China by Western writers, Carter's collection is the first to focus on the wide-ranging experiences of foreigners living in China.\" --China Daily\"The authors, mostly experienced writers who have traveled widely in China, offer tales beyond those of the usual laowai experience.\" --Shanghai Daily\"The majority of stories are individual gems and an enjoyably diverse range of issues are found in the book.\" --Time Out Hong Kong\"The moral of this collection appears to be that though almost everything has changed, one basic thing - the allure of China to a certain kind of Westerner - remains curiously consistent.\" --Taipei Times\"Funny, poignant, and wry...the outcome is a depth and variety about the expat experience and life in China that is almost unsurpassed.\" --Asian Review of Books\"Fast-moving romps through a rapidly-changing changing society.\" --Caixin\"An eminently dip-into-able, informative and enjoyable collection.\" --That's Shanghai\"One might be tempted to classify it as a travel book of sorts; what is being traversed and recollected throughout is not the lay of the land, but rather, the contours of confusion, excitement and isolation that every China expat has, at one point, had to clamber across and conquer.\" --The Beijinger\"A surprisingly refreshing, instead of rehashing, collection of essays, written by professionals, instead of amateurs...at times hilarious, at times beautiful, but always relatable...\" --China.Org\"(Editor) Tom Carter has pulled together an impressive cast of writers, established and amateur alike.\" --Beijing Cream\"If there is an overarching message to take from the book, it is that holy !@#$ China changes quickly.\" --Shanghaiist\"The vignettes lead the reader through a variety of emotions; some will tug at your heartstrings, others will leave you chuckling in understanding, and a few will really make you think.\" --Shanghai City Weekend\"Presents a more realistic China.\" --Li Jihong for Shanghai Review of Books\"As a Chinese writer with a certain cynicism, I did not expect to find anything truly surprising. But surprised I was, and my own stereotypical presumptions stand corrected.\" --Xujun Eberlein for Los Angeles Review of Books\"The result is a highly readable, often humorous, and at times brilliant book that is unerringly direct: the authors gathered together here do not shy away from troublesome issues.\" --Asian Correspondent\"The title dis-serves them...the range, humor and insights in this book place it among the best of its kind.\" --Asia Sentinel",
  "genres": [
    "China",
    "Travel",
    "Nonfiction",
    "Anthologies",
    "Asia",
    "Anthropology",
    "Essays"
  ],
  "author": "Tom  Carter",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/18051654-unsavory-elements"
}