{
  "title": "Wish You Happy Forever: What China's Orphans Taught Me About Moving Mountains",
  "description": "Wish You Happy Forever chronicles Half the Sky founder Jenny Bowen's personal and professional journey to transform Chinese orphanages—and the lives of the neglected girls who live in them—from a state of quiet despair to one of vibrant promise.After reading an article about the thousands of baby girls languishing in Chinese orphanages, Bowen and her husband adopted a little girl from China and brought her home to Los Angeles, not out of a need to build a family but rather a commitment to save one child. A year later, as she watched her new daughter play in the grass with her friends, thriving in an environment where she knew she was loved, Bowen was overcome with a desire to help the children that she could not bring home. That very day she created Half the Sky Foundation, an organization conceived to bring love into the life of every orphan in China and one that has actually managed to fulfill its promise.In Wish You Happy Forever , a fish out of water tale like no other, Bowen relates her struggle to bring the concept of \"child nurture and responsive care\" to bemused Chinese bureaucrats and how she's actually succeeding. Five years after Half the Sky's first orphanage program opened, government officials began to mention child welfare and nurturing care in public speeches. And, in 2011, at China's Great Hall of the People, Half the Sky and its government partners celebrated the launch of The Rainbow Program, a groundbreaking initiative to change the face of orphan care by training every child welfare worker in the country. Thanks to Bowen's relentless perseverance through heartbreak and a dose of humor, Half the Sky's goal to bring love the lives of forgotten children comes ever closer.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Adoption",
    "China",
    "Biography",
    "Asia",
    "Book Club"
  ],
  "author": "Jenny Bowen",
  "average_rating": "4.20",
  "url": "https://www.goodreads.com/book/show/18052901-wish-you-happy-forever"
}