{
  "title": "All That Is Solid Melts Into Air",
  "description": "Under a crimson dawn sky, Artyom Telvatnikov stands in a field of cows, his fingertips glistening with warm blood that streams from their ears.It is April 1986, and ten miles away, above the Chernobyl Nuclear Power Plant, clusters of sparks fill the air, inflaming the final years of the Soviet Union, inciting its citizens to actions of brutality, mystery and terrible beauty. Grigory, a surgeon working in the wake of the disaster, in a place where all natural order has been distorted, is forced to question everything he has known. In Moscow, his estranged wife, Maria, a former dissident, struggles to free herself from the constraints imposed upon her by the state. Her nephew Yevgeni is a nine-year-old piano prodigy whose sense of rhythm is rapidly eroding.In All That Is Solid Melts into Air, Darragh McKeon blends an array of these and other characters into a strikingly visceral portrait of a place and a people in the midst of terrifying change.Praise for All That is Solid Melts into Air“This daring and ambitious novel blends historical epic and love story with a detailed and moving description of the Chernobyl disaster and the fall of the Soviet Union. Darragh McKeon handles the struggles of his characters with care and compassion and creates a book rich with resonance far beyond its historical moment.” —Colm Tóibín“Brilliantly imagined in its harrowing account of the Chernobyl disaster and exhilarating in its sweep, All That is Solid Melts Into Air is a debut to rattle all the windows and open up the ventricles of the heart. McKeon creates a thrilling appearance of ease, while he delves deep and forges new territory for the contemporary novel. The book is daring, exhilarating, generous and beautifully written. History is rendered here as a rising choir of contradictory demands. McKeon probes the forgotten corners of human experience and makes them properly valuable. Throughout it all, he writes with an ear for the quiet captivations of the human heart. All That is Solid Melts into Air marks the beginning of a truly significant career. I cannot say it loud enough. McKeon is here to stay.” —Colum McCann“Darragh McKeon has crafted a quietly monumental portrait of Soviet particulars and human universals. The confidence, insight, and above all deep feeling mark All That is Solid Melts into Air as an astounding debut.” —Charles Foran",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Russia",
    "Historical",
    "Book Club",
    "Literary Fiction",
    "Novels"
  ],
  "author": "Darragh McKeon",
  "average_rating": "3.86",
  "url": "https://www.goodreads.com/book/show/18053329-all-that-is-solid-melts-into-air"
}