{
  "title": "Boy in the Ivy: The Inner Child of a Buried Man",
  "description": "In 2009, T McKinley’s brother committed suicide, and his first question to himself was why he hadn’t done the same. In this moving and poignant memoir, McKinley takes the reader back through the events that led to a lifelong struggle with depression, shame, and inadequacy. Beginning with his own conception and birth and continuing through his parents' divorce and the fragmentation of his family, McKinley traces the origins and evolution of his deep-seated belief that everyone would have been better off if he had never existed at all. In this way, McKinley blamed, rejected, and buried his inner child, setting himself up for a lifetime of disconnection and depression. Years later, McKinley married, had two children, and soon saw that he was repeating the same toxic patterns that defined his own childhood. His feelings of hopelessness continued to increase until the family bought a fixer-upper house in suburban Virginia. As they sifted through the rubble of the dysfunctional family that had come before, McKinley was brought face-to-face with the pain that had buried him for far too long. He began to realize his own value to his family and reconnect with his own childhood—and the innocent child he had once been—in a more compassionate and loving way. He realized he was not broken, but that he did need to ask for help. Ultimately, through this experience, McKinley was able to find the hope that his brother never could. McKinley approaches difficult subjects with insight and humor, in a direct and disarming way. Readers are invited to approach their own issues with shame and depression with compassion instead of fear, and to confront their own patterns of disconnection and isolation with hope instead of powerlessness. McKinley had contemplated suicide often, but he learned that sometimes the greatest strength comes from admitting you need help. T. McKinley has an undergraduate degree in religious studies and a master’s degree in folklore. He has worked a variety of jobs in his life, including short-order cook, towel boy at a YMCA, sperm donor, bartender, and professional cartoonist, and he spent six years working as a stand-up comic in Los Angeles. For the past eighteen years, he has taught English and theater in a variety of private middle and high schools. He is a suicide survivor who is happily married with two children.",
  "genres": [
    "Psychology"
  ],
  "author": "T. McKinley",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/18055732-boy-in-the-ivy"
}