{
  "title": "The Power of Being Articulate",
  "description": "Start with this Your professional, financial, and personal success depends to a great extent on your ability to articulate. People who are more adept with using words -- the Articulates -- are more successful financially and socially. Their incomes are higher, they live better, and they are happier in their relationships. In short, articulate individuals, families, organizations, and countries -- those that can think and communicate most clearly and quickly -- rule the world. This book is about how the Articulates rise above the rest -- and how you can become an Articulate and join their ranks. This book for all of you who want to be more successful in any or all parts of your lives... Who want to understand more fully the precise connections between your skills with the language and being fulfilled... And who are willing to practice the simple habits of CLOWT and the Elite Eleven that make it all possible. The Power of Being Articulate will appeal to managers who want their organizations to be more competitive, teachers at high school and college levels who want their students to get higher grades and a leg up on life, communications consultants who want to add credibility to their convictions that understanding each other is critical to our very being and functioning, government officials who are concerned with education, and anyone who wants to add understanding and empathy to their relationships of all types. This book is founded on one premise that appears simple at first blush, but on closer examination isn t so simple at that articulation leads to wealth and happiness. Thoughtful readers will ask if the premise is indeed fact. It is and that declaration is based on three types of evidence. Statistical, or just examining the numbers that are published by the Johnson O Connor Research Foundation. These statistics are based on studies that go back to the 1930s and are verified by others in the field. Their conclusions are so clear-cut that they are startling, indisputable, and supported by empirical evidence. Empirical , or just looking around at the folks in the corner offices and in happy homes. They re almost always attentive listeners, careful writers, and articulate speakers. In short, they have a good handle on the language, and they know its power to persuade and inform. For you who think that \"looking around\" isn t scientific, empiricism, by definition, is labeled by some of our deepest and most respected philosophers as the source of all knowledge by simple observation. Perhaps empiricism is the most reliable evidence of all that this book s premise is fact. Anecdotal , or just listening to practitioners, seven of whom are profiled in this book. They all point to articulation as the one skill that separates them from the pack of Also-Rans -- those folks who are stuck in dead-end jobs and shallow relationships, complain relentlessly about their fate, and cannot or will not understand the underlying reasons. In essence, Articulates know that, other skills being equal, articulation is the tie-breaker in the race for wealth and happiness.",
  "genres": [],
  "author": "Pete Geissler",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/18060334-the-power-of-being-articulate"
}