{
  "title": "The Best Of Creative Computing, Vol. 2",
  "description": "The Best of Creative Computing: Volume 2 contains more than 150 articlespublished in Creative Computing magazine in 1977. It contains an amazing collection of material of interest to technology historians, retrocomputing hobbyists, and programmers.These articles were written at a time when home computers were only becoming reality for the first time, when electronic calculators were still an expensive novelty, and when computers were only beginning to be used in business.Highlights include:*Technology - Present and Future Televisionism Manifesto No. 1 by Phil Smith Videodiscs - The Ultimate Computer Input Device? by Alfred M. Bork The $2.98 Computer Library by Arthur Luehrmann*Languages and Programming Theory Simulated Strategies of Game Playing by Dr. S. Reisman The Computer \"Glass Box\" - Teaching with A Programming Language by Howard A. Peelle *Artificial and Extraterrestrial Intelligence Can Computers Think? by David H. Ahl The Cosmic Subway Line by Isaac Asimov*Literacy, Philosophy, Opinion Computer Literacy Quiz The Government Dinosaur by Charles Winn The Magic Of Electronic Funds Transfer by David H. Ahl*Computers in Education Computing At The University of Texas Computers In Secondary Schools-1975 Computer Fair by Wes Thomas Tips for Buying a Pocket Calculator by Peter Weaver*ResourcesCompleat Computer Catalogue Star Trek Lives! by David H. Ahl MITS World Altair Computer Convention by Andrea Lewis, Robert Prati *Programming Techniques Heapsort by Geoffrey Chase A Comparison of Sorts by John P. Grillo *Computer GamesLearning with Computer Games by David H. Ahl Wumpus 2 by Gregory Yob War 3 by Mike Forman, M.E. Lyon, Brian West Dr. Z Condot by Chuck Lund, Peter Olivieri LEM by Bill Cotter *HardwareBuilding a MITS Altair 8800Odyssey Video Games by David H. Ahl Hewlett-Packard HP-25 Calculator by James Blodgett Hints on Buying a Used Teletype by David H. Ahl Hewlett-Packard 9815A Programmable Calculator by David Ettel Tektronix 4051 Graphics System by Stephen B. Gray *ReviewsReviews of 34 Books on BASICThe Sun Never Sets On IBM: The Culture And Folklore Of IBM World TradeThe Assault on Privacy: Computers, Data Banks, and Dossiers The Moon Is A Harsh MistressSpace: 1999",
  "genres": [
    "Nonfiction"
  ],
  "author": "David H. Ahl",
  "average_rating": "4.69",
  "url": "https://www.goodreads.com/book/show/1806138.The_Best_Of_Creative_Computing_Vol_2"
}