{
  "title": "A Manopla de Karasthan",
  "description": "Na imensidão cósmica existe um mundo, Allaryia, de grandes heróis e vilões infames, de seres de uma beleza indescritível e criaturas maléficas de uma fealdade atroz, nações poderosas e impérios tirânicos. Depois de muitas eras que alternaram entre a paz e a discórdia, encontramos neste primeiro volume das Crónicas de Allaryia, um tempo de aparente tranquilidade, de uma calma inquietante, semelhante ao silêncio que antecede a tempestade. Algures, numa câmara escura, subterrânea, algo se move, tentando libertar-se de anos de cativeiro, algo monstruoso, inumano, sedento de sangue e dor. O povo de Allaryia perdeu o seu campeão – Aezrel Thoryn, provavelmente morto numa batalha contra o Flagelo, a força das trevas, em Asmodeon – e mais do que nunca precisa de protecção. Aewyre Thoryn, o filho mais novo do saudoso rei, pega em Ancalach, a espada do seu pai, decide descobrir o que realmente lhe aconteceu e parte a caminho de Asmodeon. O que o jovem guerreiro não podia prever era que a sua demanda pessoal se iria transformar, à medida que os encontros se vão sucedendo, na demanda de um grupo particularmente singular, que reunirá a mais estranha e inesperada mistura de seres - Allumno, um mago, Lhiannah, a bela princesa arinnir, Worick, um thuragar, Quenestil, um eahan, Babaki, um antroleo, Taislin, um burrik, Slayra, uma eahanna negra e o próprio Aewyre. O ritmo a que se sucedem as aventuras é absolutamente alucinante, a cada passo surgem perigos mais tenebrosos, seres aterradores que esperam, ocultos nas sombras, o melhor momento para atacar e roubar a tão desejada Ancalach… Mas os laços de amizade que unem o grupo estão cada vez mais fortes e, juntos, sentem-se capazes de enfrentar qualquer inimigo.",
  "genres": [
    "Fantasy",
    "High Fantasy",
    "Portuguese Literature",
    "Fiction",
    "Adventure",
    "Epic Fantasy",
    "Romance"
  ],
  "author": "Filipe Faria",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/1806507.A_Manopla_de_Karasthan"
}