{
  "title": "Clean Slate",
  "description": "Written in the tradition of Robert B. Parker's Spenser and Raymond Chandler's Philip Marlowe, the Jim Knighthorse series introduces a new hard-hitting, wise-cracking hero with a modern twist.Private investigator Jim Knighthorse returns in book 4 of the series when he's hired to find out if Freddie Calgary, a popular movie and TV star, really overdosed and died two years ago, or if he is still alive. The investigation turns into a big road trip as Jim follows the clues to L.A., Sedona, and San Antonio. There is plenty of action and danger as the dark side of Hollywood spills its blood, secrets and scandal over three cities.**Acclaim for the novels of J.R. Rain**\"Gripping, adventurous, and romantic - J.R. Rain's The Lost Ark is a breakneck thriller that traces the thread of history from Biblical stories to current-day headlines. Be prepared to lose sleep!\"-JAMES ROLLINS, international bestselling author of The Eye of God and Altar of Eden\"I enjoyed this immensely. The protagonist, Samantha Moon, is a female vampire with a husband and children. Those predate her condition; six years ago she was attacked by a vampire and rendered into one. Now she's trying to carry on with family and private eye business, and she's a feisty, skilled person, so is doing mostly okay. It is not a horror story; she buys animal blood to eat and doesn't generally prey on humans. But her husband has an increasing problem with her coldness - not of spirit, but of body. 'You sicken me and scare the hell out of me,' he tells her. 'And when I touch you it's all I can do to not gag.' She replies, 'Words every wife wants to hear.' I love this! What makes it special are her character and nature.\"-PIERS ANTHONY, New York Times bestselling author of A Spell for Chameleon and On A Pale Horse\"Dark Horse is one of the best books I've read in a long time! A great classic detective story with a modern twist. Unique and interesting characters (I think I'm half in love with Jim Knighthorse now!), a great plot that kept me guessing until the end, and some of the funniest lines I've read anywhere.\"-GEMMA HALLIDAY, author of Deadly Cool and Play Dead",
  "genres": [
    "Mystery",
    "Paranormal",
    "Fiction",
    "Detective",
    "Audiobook",
    "Contemporary",
    "Mystery Thriller"
  ],
  "author": "J.R. Rain",
  "average_rating": "4.25",
  "url": "https://www.goodreads.com/book/show/18068284-clean-slate"
}