{
  "title": "God's Traitors: Terror & Faith in Elizabethan England",
  "description": "A true story of plots, priest-holes and persecution and one family's battle to save Catholicism in Reformation England.  Elizabeth I criminalised Catholicism in England. For refusing to attend Anglican services her subjects faced crippling fines and imprisonment. For giving refuge to outlawed priests -- the essential conduits to God's grace -- they risked death. Almost two hundred Catholics were executed in Elizabeth's reign and hundreds more wasted away in prison. They were beleaguered on the one hand by a Papacy that branded Elizabeth a heretic and sanctioned her deposition and on the other by a government that saw itself fighting a war on terror and deployed every weapon in its arsenal, including torture, to combat the threat. With every invasion scare and attempt on Elizabeth's life, the danger for England's Catholics grew. God's Traitors explores this agonising conflict of loyalty from the perspective of one Catholic family, the Vauxes of Harrowden Hall. To follow the Vaux story -- from staunch loyalty to passive resistance to increasing activism -- is to see, in microcosm, the pressures and painful choices that confronted the Catholic community of Reformation England. Theirs in an enthralling tale of plots, priest-holes and persecution plated out in a world of shadows people by spies and agents provocateurs. They lived in a state of siege, under constant surveillance. The petty squabbles, unsuitable marriages, love and laughter of family life were punctuated by dawn raids, sudden arrests and clandestine meetings. Above all, this is a timeless and timely story of human courage and frailty, repression and reaction and the power of faith against the sternest of odds.",
  "genres": [
    "History",
    "Nonfiction",
    "Tudor Period",
    "Religion",
    "British Literature",
    "Historical",
    "Biography"
  ],
  "author": "Jessie Childs",
  "average_rating": "3.92",
  "url": "https://www.goodreads.com/book/show/18070670-god-s-traitors"
}