{
  "title": "Beta: Project Avatar",
  "description": "This is an alternate cover image for ISBN 10: 0985418206 and ISBN 13:9780985418205When a powerful virtual agent makes its way out of the lab, the military will stop at nothing to get it back. Hays hacks into our greatest fears of technology while simultaneously tempting us with the phenomenal capabilities of twenty-first-century electronics. This smart, topical, furious-paced thriller thrusts world-class cryptographer Dee Lockwood against an array of rogue, sociopathic assassins intent on stealing a defunded military software application and igniting a Third Gulf War. Lockwood is on her way to a secret NSA conference when a vicious hijacking leaves her friend in a coma--but not before he has installed the last copy of BETA on her laptop and smartphone. When Lockwood overcomes her fear and provides the impetus for her fellow passengers to regain control of the aircraft, she imagines the terrifying ordeal is over. But it's only the beginning. BETA is actually \"Project Avatar,\" a secret military software project that, after losing Congressional funding, was smuggled out of the Pentagon into the seemingly innocuous consumer-grade software application that wound up on Dee's laptop and smartphone. Lockwood finds herself the target of UMBRA Special Forces commandos and the hijackers, who team up and try to kill her for the precious code. Lockwood enlists the support of her technical-genius friend Abe, as well as John, the handsome and mysterious former MI-6 agent. Mere steps ahead of the deadly commandos, Lockwood's investigations lead her on a breathless flight from the clandestine NSA conference in the Arizona desert to an illicit financial operation headquartered in the Cayman Islands--via the historic streets of Geneva, the ancient royal palaces and gardens of Bangalore, and the jungle trails above Rio. Dee's worst fears are confirmed when she discovers BETA's true provenance and brings to light Operation Hydra, a shocking policy coup to initiate a Third Gulf War. With the countdown to Operation Hydra under way, Lockwood jets to the Caymans and joins forces with John to expose the rogue plot before all hell breaks loose. This action-filled, intelligent and thought-provoking novel is a thrill-a-minute adventure from its opening pages to the stunning conclusion.",
  "genres": [
    "Fiction",
    "Science Fiction",
    "Action"
  ],
  "author": "A.M.D. Hays",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/18071159-beta"
}