{
  "title": "Blood. On the Rocks.",
  "description": "No longer publishedNote \"Blood. On the Rocks.\" is a free online serial novel, updated on Saturdays. Wordcount as of August 2013: @ 76,306.______________________--- A vampire walks into a bar... ---Tekkeitsertok has the name of a god, but his life is far from celestial. Living in a small town in northern Alaska, he works two jobs to support his family of seven - him and his six dogs. As a gay man, he doesn’t have many opportunities for dating in a place like New Petersburg, but his whole life is about to spiral out of control when a vampire enters the bar he works in. It is the first vampire to visit the town since the creatures’ existence had been announced by the government, and he causes problems from the moment he sets foot in the bar.The mysterious Sergey is set on making Tekke believe they are bound by destiny, but Tekke is having none of that, since he is all about the logical and rational in life. Then again, in a time when caribou have sharp teeth and ravens grow antlers, maybe it’s time to stop clinging to logic and embrace the strange and irrational?If trying to date a vampire wasn’t enough of a problem, New Petersburg is being torn apart by forces no one can recognize. As reluctant as Tekke is, he might just hold the key to saving thousands of lives, including one that he holds increasingly dear. But can you save the life of someone who is already dead?Genre: homoerotic contemporary fantasyThemes (possible SPOILERS): vampires, shape-shifters, adult virgin, enemies to lovers, rebirth, Siberia, Alaska, hunting, mutation, inspired by Inuit mythology, mythical creatures, monsters, shamanism, kept lovers, violence, mutilation, murder, blood magic, Gods walking the Earth, military, deception, dreams, friendship, extrasensory perception, emotional trauma, homophobia, despair, abandonmentErotic content: explicit m/m sexual scenes (including: first time, dubious consent, cheating)",
  "genres": [
    "M M Romance",
    "Fantasy",
    "Vampires",
    "Shapeshifters",
    "Paranormal",
    "M M Paranormal"
  ],
  "author": "K.A. Merikan",
  "average_rating": "3.44",
  "url": "https://www.goodreads.com/book/show/18073089-blood-on-the-rocks"
}