{
  "title": "Rocky Road",
  "description": "Nancy Anne “Ancy” Robertson has her heart set on her dream promotion—and the chance it will give her to finally live her life on her terms and help the kids who need help the most. But she could lose her job altogether if her career-annihilating secret comes out: her fiancé is also her physical therapy patient. She needs to get him off her patient list, but he sets off a series of one credulity-challenging disaster after the next, and she’s the only one on staff who’s qualified to treat his injuries. Maybe some people would walk away, but he volunteers building houses for people who can’t afford them, and that fact melts Ancy’s heart. Some days, though, he’s seriously challenging her ability to see her world through rose-colored glasses.And her flamboyant wedding planner can’t follow instructions at all. Ancy’s simple, elegant ceremony might turn out to be the most expensive wedding known to mankind.But when another qualified PT joins the staff, her world is set to turn rosy again.Except the new PT is Steve, her ex-fiancé. And he’s shooting for her promotion.Working side by side with him, Ancy discovers she isn’t nearly as over Steve as she thought she was.On top of dealing with her job troubles, the absurdities of her love life, and not one but three interfering mothers, each with an alarming secret of her own, Ancy’s efforts to keep from literally losing her autistic brother—who’s her inspiration but has a penchant for wandering off at the most inconvenient moments—grow to comedic proportions.With her career prospects plummeting alongside her hilariously doomed love life, Ancy starts to wonder whether the rings in her life are more trouble than they’re worth. After all, she’s facing a few too many: the fake kind, the stolen kind, the sticky wax kind that belongs under a toilet… and maybe, just maybe, the kind meant to make a girl say I do.",
  "genres": [
    "Romance"
  ],
  "author": "Susan Lohrer",
  "average_rating": "3.81",
  "url": "https://www.goodreads.com/book/show/18074222-rocky-road"
}