{
  "title": "Print Areas: Book History in India",
  "description": "In recent years, the growth of History of the Book as a major, multi-disciplinary area of investigation has energised traditional disciplines such as history and literary studies in new and unforeseen ways. History of the Book looks at literature as it is embodied in its technological products—mainly those of the print industry, but also manuscripts, engravings, and electronic texts. It studies the various personnel associated with the making of books: not just authors, but also printers, publishers, illustrators, booksellers, and of course, readers. In so doing it has restored a measure of historicism and objectivity to literary studies, by insisting on a rigorous engagement with the records and what they tell us about modes of production, transmission and distribution of books.Despite being a country with a long, rich and complex book culture, India does not have a comprehensive history of its books. Print Areas is the first attempt to write such a history and brings together the work of leading contemporary historians of the book in India. This pioneering volume features essays looking at some of the most fascinating examples of India’s encounter with the book. The choice of the essays also reveals the range of possible approaches to the study of books. There are histories of major publishing houses such as Macmillan and Oxford University Press as well of the first edition of a single book of nonsense verse; perspectives are offered on Benares as a centre of publishing, the role played by print in shaping Maharashtra politics and the cultural impact of popular books in Bengal. These essays will be of interest not just to the historian or literary scholar but also to those interested in questions of tradition and modernity in colonial and postcolonial India.",
  "genres": [],
  "author": "Abhijit Gupta",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/18075147-print-areas"
}