{
  "title": "Ha'ven's Song",
  "description": "Ha’ven Ha’darra is the Crown Prince for the Curizans, an advanced species known for their technology. They may not have the power to shift like the Valdier or the Sarafin but they have hidden powers of their own that they guard. Not even his best friends, Creon Reykill of the Valdier or Vox d’Rojah of the Sarafin, are aware of the powers he holds within his deadly frame.Ha’ven is happy to help out his Valdier friend when he calls. There are only two things that satisfy the restlessness inside him – a good fight and an even better evening with a hot, willing female. He has no desire to settle down like his two friends have. He enjoys having his freedom and the wide sample of females at his disposal. All of that changes when he catches a glimpse of the delicate beauty who looks through him as if he doesn’t even exist. His blood calls to her, his magic aches to meld with hers, but she blocks his every advance.Emma Watson’s life was perfect. Her love for music and dance let her escape the overwhelming shyness that she suffered from all her life. When she is invited to travel with a group to promote music and dance for children in South America, she believes it is the perfect chance to discover who she can really be. Everything changes when she is kidnapped by a powerful drug lord. Beaten and forced to watch the torture of other women, she withdrawals into the world she feels safest – the one inside herself.When she is rescued by creatures not of this world, they heal her physical wounds but cannot touch the ones deep inside her. She has given up on ever returning to her world and has little hope for the future. That is why she does not understand why one aggravating male suddenly won’t leave her alone. She wants nothing to do with men! They cause nothing but heartache and pain. She had been on the receiving end of their fists to know that! Why would she want one that could crush her with one hand?No woman has ever turned Ha’ven Ha’darra down and he isn’t about to accept his mate doing it. He will show her that not all men are the same, even if he has to kidnap her and take her to his world to do it. He plans to show her the power she has hidden deep inside her and open her heart to the love he has in his.Now, he just has a few extra problems to overcome. Her Valdier protectors have given him six months to change her mind about wanting to return to them, a traitor is trying to kill them both, and they have crashed on a remote moon. Can he unlock her magic in time to save their love or will the traitor, determined to kill them, destroy her before he can?",
  "genres": [
    "Aliens",
    "Science Fiction",
    "Romance",
    "Science Fiction Romance",
    "Paranormal",
    "Fantasy",
    "Paranormal Romance"
  ],
  "author": "S.E. Smith",
  "average_rating": "4.15",
  "url": "https://www.goodreads.com/book/show/18075916-ha-ven-s-song"
}