{
  "title": "Jaguin's Love",
  "description": "Best-seller de la liste USA Today !Une femme humaine qui se remet après avoir subi une violence extrême et un mâle extraterrestre ont enfin retrouvé l’espoir. Dans cette histoire d’amour torride et de réconfort, que faudra-t-il pour se libérer du passé ?Jaguin est l’un des meilleurs traqueurs de Valdier. À ce jour, il n’y a qu’une seule chose qu’il n’est pas parvenu à trouver : son âme sœur. Cet échec les ronge, son dragon et lui. Même son symbiote ressent ce gouffre alors que les siècles s’écoulent lentement sans que ne s’estompe le vide qui les ronge. Lorsque les seigneurs de Valdier trouvent leurs âmes sœurs sur une planète lointaine, la découverte d’une espèce compatible avec la leur apporte de l’espoir aux guerriers de Valdier où les femelles sont rares et où il est presque impossible de trouver une âme sœur.Sara Wilson est une botaniste qui ne vit que pour son amour des plantes et leur potentiel médicinal. Elle est certaine d’être sur le point de faire une découverte majeure quand elle est kidnappée par le chef d’un cartel qui n’a qu’une idée en tête : se venger.Après des recherches infructueuses pour trouver sa compagne, Jaguin accepte une dernière tâche, celle de garder Carmen, la compagne du seigneur Creon, lors d’une mission visant à obtenir justice contre l’homme qui a assassiné son mari. Il trouve alors son âme sœur dont la vie ne tient plus qu’à un fil.Sara n’est plus sur Terre, mais la terreur continue de la tourmenter. Elle a besoin de temps pour redécouvrir qui elle est et si c’est une vie qu’elle peut accepter. L’amour de Jaguin peut-il guérir ses cicatrices intérieures ou son âme sœur croira-t-elle qu’elle a échangé un monstre contre un autre ?Auteur de renommée internationale, S.E. Smith propose une nouvelle histoire d’action pleine de romance et d’aventure. Débordant de l’humour qui la caractérise, de paysages éclatants et de personnages attachants, il est certain que ce livre deviendra un nouveau favori des fans !",
  "genres": [
    "Aliens",
    "Dragons",
    "Romance",
    "Science Fiction",
    "Paranormal",
    "Shapeshifters",
    "Paranormal Romance"
  ],
  "author": "S.E. Smith",
  "average_rating": "4.21",
  "url": "https://www.goodreads.com/book/show/18075903-jaguin-s-love"
}