{
  "title": "Operation Date Escape",
  "description": "Since her divorce two years before, Kelsie Collins has been determined to guard her heart and steer clear of seemingly ‘perfect’ men. An easy task considering the kind of men her matchmaking mother and her best friend, Nanci, keeps setting her up with. She allows them to set her up, knowing their hearts are in the right place and that there is no risk of her letting any man close enough to hurt her again. Her growing experience in ways to slip out of those ‘dates from hell’ prompts her to start writing a bad date survival guide. One aptly titled - OPERATION: DATE ESCAPE. And it’s during one of those escapes that sexier than sin firefighter Cole Maxwell comes to her rescue. Cole isn’t sure what to think when the sexy redhead he’s just ‘rescued’ from a bad date informs him that he’s too ‘perfect’ to date. That’s a first. He’s had relationships end because the women couldn’t handle the risks that go along with his chosen profession, but never because he’s too perfect.When his crew gets called out to rescue someone who is stuck in a tree, Cole finds himself once again coming to Kelsie’s rescue. This time he’s not about to let her get away without agreeing to give him a chance, even holding her high heels hostage to make it happen. She finally gives in and things heat up between them like a 3-alarm fire. But there’s more than passion between them and Cole sets out to prove to Kelsie that he’s nowhere near ‘perfect’, but he is the ‘perfect’ man for her. Can he get past the wall she’s built up around her heart? Or will he end up being just another chapter in her book of men she ran from?*Operation: Date Escape was a Romance Writers of America Golden Heart finalist as well as a finalist in the American Title III Competition put on by Romantic Times and Dorchester Publishing.*",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Chick Lit",
    "Contemporary",
    "Amazon",
    "Romantic Comedy",
    "Humor"
  ],
  "author": "Lindsey Brookes",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/18076365-operation-date-escape"
}