{
  "title": "Zorro #1: Scars!: Scars!",
  "description": "\"Scars!\" is a Zorro adventure, a graphic novel featuring fierce battles with deadly foes and intense romance with a mysterious beauty, all set against the savage landscape of the untamed wilds of the Old West.Zorro seeks to find safe haven for Eulalia Bandini, a woman who dared defied the powerful Capitan Monasterio to save Zorro. But no matter how far north Zorro and Eulalia ride, Monasterio and his men are not far behind. Yet Zorro still stops to save Theirry and Amelie Besson, a middle-ages mapmaker and his wife, from the clutches of the cadaverous Ripklaw and his master, Lucifer Trapp!Discover the shocking reason why Trapp wants Besson dead; see the romantic tension increase between Zorro and Eulalia; see Zorro battling all along the breath-taking yet deadly beauty of Yellowstone. It all builds to Zorro's climatic battle to the death with Ripklaw on an ice bridge, while an earthquake threatens to kill everyone!Ages 8 to 12.The Hardy Boys get caught in a perfect storm! Something's fishy when Frank and Joe go undercover aboard \"the Silver Lining,\" an old fishing boat, to find out why teen crew members keep mysteriously vanishing. The number of suspects suddenly dwindles when one of the crew turns up dead! This is unquestionably the perfect Hardy Boys graphic novel to read at the beach! Ages 8 to 12.Papercutz is the exciting new graphic novel publisher that's building a huge following among the next generation of comics fans. Even the most reluctant readers are becoming addicted to the Papercutz approach of giving classic characters a modern makeover! Each Papercutz graphic novel features comics stories drawn in the style of the popular Japanese comics known as manga, and beautifully rendered with state of the art color. While educators rave about the high quality of the Papercutz writing and artwork, readers 8 and up are simply enjoying the great adventures found in each fun-filled volume. Be sure to check out other Papercutz titles such as Nancy Drew, Totally Spies, and The Hardy Boys.",
  "genres": [
    "Graphic Novels"
  ],
  "author": "Don McGregor",
  "average_rating": "3.10",
  "url": "https://www.goodreads.com/book/show/108795.Zorro_1"
}