{
  "title": "Hidden Pasts",
  "description": "When the Truth and the Past are no longer hidden their Passion is freedJamie, Valerio and Scot continue their story in the second book in the Hidden Series, Hidden Pasts. Read the story from the beginning in Hidden Truths.Nineteen year old Valerio Capelli has succeeded in his childhood dream of achieving the highest level he can in Moto GP, he is the current world champion and now it seems the whole world is interested in his life. He lives under a microscope and his new relationship with the very beautiful, very openly gay Jamie Burton is beginning to draw attention. Valerio can't even come out to his childhood friends, so sharing his sexuality with the world makes him hide his love and who he truly is.To be denied and hidden hurts Jamie in a way he never voices to Valerio, but inside the dream of Valerio accepting him is becoming nothing but a dream. If only they had just his closeted homosexuality to deal with perhaps things would be easier.Jamie has never had to consider anyone else’s feelings; he's never shared his life or emotions with anyone. Understanding the temperamental, melodramatic ways of his new Italian boyfriend is a work in progress. There's so much for them both to learn, their relationship is still tenderly hanging on by a thread but both are willing to fight to keep it alive. Valerio’s past experiences with sex have held them both back and despite the frustration Jamie feels he's willing to wait until Valerio is ready to take the next step. Holding back is difficult especially when his hot ex Scot is still so willing to give Jamie the sex he's not able to have with Valerio.Scot, Jamie and Valerio’s lives become more entwined than ever when Scot falls for Valerio’s beautiful friend and ex, Rafael. The two couples are forced together when all they need is space. When the nightmare of Valerio’s past comes back to haunt him and only Scot can help him become free, all four find themselves in a close knit group, where emotions run high and hidden pasts become seen more clearly.The past is mixing with the present, all three men have to struggle to cope with their own problems and live through each other’s in a way that breaks all three of them apart. The fog is lifting and the blackness is brightening but what's waits for them on the other side?",
  "genres": [
    "M M Romance",
    "Sports",
    "Contemporary",
    "Romance",
    "Mental Illness",
    "Abuse"
  ],
  "author": "Nicole Colville",
  "average_rating": "4.18",
  "url": "https://www.goodreads.com/book/show/18078436-hidden-pasts"
}