{
  "title": "A Murder in Auschwitz",
  "description": "An SS officer is found standing over the body of a comrade, a smoking pistol still in his hand, a murder in a place of murders.His pleas of innocence force a court martial and he knows that there is only one man in the camp capable of defending him; a Jewish prisoner called Manfred Meyer.Manfred Meyer is forced to build a defence for him in his court martial. Drawing on his years of experience as a criminal lawyer in Berlin, Meyer must unravel the deceit and interpret the lies that infect the concentration camp and work to have him found not guilty.Following Meyer and his family through their lives in Berlin, the Nazi rise to power and their inevitable arrest and incarceration in Auschwitz, Meyer will do almost anything to see his wife and children. Almost anything.Can his abilities as a lawyer interpret the facts of this seemingly impossible case? As a Jew, should he even defend an SS officer? And is he actually guilty of this crime?But the officer must be found innocent if Meyer is to see his family again.This story follows Manfred Meyer, from his beginnings as a lawyer in 1930s Berlin after being taken under the wing of the city's most capable defence lawyer in the most prestigious law firm in Germany, Bauer & Bauer.Meyer's confidence and experience build as his cases become more complex and more difficult to defend. His success is widespread and he, his wife Klara and their twin daughters live a comfortable life in the capital.But Germany is changing. The Nazi Party has come to power and Meyer's Jewish heritage has become a crime. Life becomes more and more difficult until even in spite of Meyer's connections he is forced to leave his position as Bauer & Bauer's pre-eminent lawyer.Then, one night, the inevitable knock at the door heralds the long train journey to the east and the death camps of Poland for Meyer, his wife and his children.Split from his family on arrival, Meyer does what he can to survive in a place designed for death. He stays alive with help from the other inmates he has befriended, helping each other through the long days of hard labour, his only wish being that he could see his family again. A forlorn hope until circumstance throws a real chance his way.",
  "genres": [
    "Historical Fiction",
    "Mystery",
    "Historical",
    "World War II",
    "Thriller",
    "Holocaust"
  ],
  "author": "J.C. Stephenson",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/18078484-a-murder-in-auschwitz"
}