{
  "title": "Showtime: Magic, Kareem, Riley, and the Los Angeles Lakers Dynasty of the 1980s",
  "description": "The New York Times bestselling author of Sweetness delivers the first all-encompassing account of the 1980s Los Angeles Lakers, one of professional sports’ most-revered—and dominant—dynasties.   The Los Angeles Lakers of the 1980s personified the flamboyance and excess of the decade over which they reigned. Beginning with the arrival of Earvin \"Magic\" Johnson as the number-one overall pick of the 1979 draft, the Lakers played basketball with gusto and pizzazz, unleashing their famed \"Showtime\" run-and-gun style on a league unprepared for their speed and ferocity—and became the most captivating show in sports and, arguably, in all-around American entertainment. The Lakers’ roster overflowed with exciting all-star-caliber players, including center Kareem Abdul-Jabbar, and they were led by the incomparable Pat Riley, known for his slicked-back hair, his Armani suits, and his arrogant strut. Hollywood’s biggest celebrities lined the court and gorgeous women flocked to the arena. Best of all, the team was a winner. Between 1980 and 1991, the Lakers played in an unmatched nine NBA championship series, capturing five of them. Bestselling sportswriter Jeff Pearlman draws from almost three hundred interviews to take the first full measure of the Lakers’ epic Showtime era. A dazzling account of one of America’s greatest sports sagas, Showtime is packed with indelible characters, vicious rivalries, and jaw-dropping, behind-the-scenes stories of the players’ decadent Hollywood lifestyles.  From the Showtime era’s remarkable rise to its tragic end—marked by Magic Johnson’s 1991 announcement that he had contracted HIV—Showtime is a gripping narrative of sports, celebrity, and 1980s-style excess.",
  "genres": [
    "Sports",
    "Basketball",
    "Nonfiction",
    "History",
    "Biography",
    "Audiobook",
    "Pop Culture"
  ],
  "author": "Jeff Pearlman",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/18079520-showtime"
}