{
  "title": "The Big Tiny: A Built-It-Myself Memoir",
  "description": "Dee William’s life changed in an instant, with a near-death experience in the aisle of her local grocery store. Diagnosed with a heart condition at age forty-one, she was all too suddenly reminded that life is short, time is precious, and she wanted to be spending hers with the people and things she truly loved. That included the beautiful sprawling house in the Pacific Northwest she had painstakingly restored—but, increasingly, it did not include the mortgage payments, constant repairs, and general time-suck of home ownership. A new sense of clarity began to take hold: Just what was all this stuff for? Multiple extra rooms, a kitchen stocked with rarely used appliances, were things that couldn’t compare with the financial freedom and the ultimate luxury—time—that would come with downsizing.             Deciding to build an eighty-four-square-foot house—on her own, from the ground up—was just the beginning of building a new life. Williams can now list everything she owns on one sheet of paper, her monthly housekeeping bills amount to about eight dollars, and it takes her approximately ten minutes to clean the entire house. It’s left her with more time to spend with family and friends, and given her freedom to head out for adventure at a moment’s notice, or watch the clouds and sunset while drinking a beer on her (yes, tiny) front porch.             The lessons Williams learned from her “aha” moment post-trauma apply to all of us, every day, regardless of whether or not we decide to discard all our worldly belongings. Part how-to, part personal memoir, The Big Tiny is an utterly seductive meditation on the benefits of slowing down, scaling back, and appreciating the truly important things in life.",
  "genres": [
    "Nonfiction",
    "Memoir",
    "Biography",
    "Audiobook",
    "Biography Memoir",
    "Autobiography",
    "Sustainability"
  ],
  "author": "Dee  Williams",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/18079552-the-big-tiny"
}