{
  "title": "Joy, Inc.: How We Built a Workplace People Love",
  "description": "The moment you walk into Menlo Innovations, you can sense the atmosphere full of energy, playfulness, enthusiasm, and maybe even . . . joy. As a package-delivery person once remarked, “I don’t know what you do, but whatever it is, I want to work here.”Every year, thousands of visitors come from around the world to visit Menlo Innovations, a small software company in Ann Arbor, Michigan. They make the trek not to learn about technology but to witness a radically different approach to company culture.CEO and “Chief Storyteller” Rich Sheridan removed the fear and ambiguity that typically make a workplace miserable. His own experience in the software industry taught him that, for many, work was marked by long hours and mismanaged projects with low-quality results. There had to be a better way.With joy as the explicit goal, Sheridan and his team changed everything about how the company was run. They established a shared belief system that supports working in pairs and embraces making mistakes, all while fostering dignity for the team.The results blew away all expectations. Menlo has won numerous growth awards and was named an Inc. magazine “audacious small company.” It has tripled its physical office three times and produced products that dominate markets for its clients.Joy, Inc. offers an inside look at how Sheridan and Menlo created a joyful culture, and shows how any organization can follow their methods for a more passionate team and sustainable, profitable results. Sheridan also shows how to run smarter meetings and build cultural training into your hiring process.Joy, Inc. offers an inspirational blueprint for readers in any field who want a committed, energizing atmosphere at work—leading to sustainable business results.",
  "genres": [
    "Business",
    "Leadership",
    "Nonfiction",
    "Management",
    "Cultural",
    "Buisness",
    "Self Help"
  ],
  "author": "Richard Sheridan",
  "average_rating": "4.08",
  "url": "https://www.goodreads.com/book/show/18079560-joy-inc"
}