{
  "title": "The Oh She Glows Cookbook: Over 100 Vegan Recipes to Glow from the Inside Out",
  "description": "The New York Times bestseller from the founder of Oh She Glows  \"Angela Liddon knows that great cooks depend on fresh ingredients. You'll crave every recipe in this awesome cookbook!\"—Isa Chandra Moskowitz, author of Isa Does It\"So many things I want to make! This is a book you'll want on the shelf.\"—Sara Forte, author of The Sprouted KitchenA self-trained chef and food photographer, Angela Liddon has spent years perfecting the art of plant-based cooking, creating inventive and delicious recipes that have brought her devoted fans from all over the world. After struggling with an eating disorder for a decade, Angela vowed to change her diet — and her life — once and for all. She traded the low-calorie, processed food she'd been living on for whole, nutrient-packed vegetables, fruits, nuts, whole grains, and more. The result? Her energy soared, she healed her relationship with food, and she got her glow back, both inside and out. Eager to share her realization that the food we put into our bodies has a huge impact on how we look and feel each day, Angela started a blog, ohsheglows.com, which is now an Internet sensation and one of the most popular vegan recipe blogs on the web.This is Angela's long-awaited debut cookbook, with a trasure trove of more than 100 moutherwatering, wholesome recipes — from revamped classics that even meat-eaters will love, to fresh and inventive dishes — all packed with flavor. The Oh She Glows Cookbook also includes many allergy-friendly recipes — with more than 90 gluten-free recipes — and many recipes free of soy, nuts, sugar, and grains, too!Whether you are a vegan, \"vegan-curious,\" or you simply want to eat delicious food that just happens to be healthy, too, this cookbook is a must-have for anyone who longs to eat well, feel great, and simply glow!",
  "genres": [
    "Cookbooks",
    "Cooking",
    "Food",
    "Nonfiction",
    "Vegan",
    "Health",
    "Reference"
  ],
  "author": "Angela  Liddon",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/18079651-the-oh-she-glows-cookbook"
}