{
  "title": "Pound Foolish: Exposing the Dark Side of the Personal Finance Industry",
  "description": "If you’ve ever bought a personal finance book, watched a TV show about stock picking, listened to a radio show about getting out of debt, or attended a seminar to help you plan for your retirement, you’ve probably heard some version of these quotes: “What’s keeping you from being rich? In most cases, it is simply a lack of belief.” —SUZE ORMAN, The Courage to Be Rich“Are you latte-ing away your financial future?” —DAVID BACH, Smart Women Finish Rich“I know you’re capable of picking winning stocks and holding on to them.” —JIM CRAMER, Mad Money They’re common refrains among personal finance gurus. There’s just one problem: those and many simi­lar statements are false. For the past few decades, Americans have spent billions of dollars on personal finance products. As salaries have stagnated and companies have cut back on benefits, we’ve taken matters into our own hands, embracing the can-do attitude that if we’re smart enough, we can overcome even daunting financial obstacles. But that’s not true. In this meticulously reported and shocking book, journalist and former financial columnist Helaine Olen goes behind the curtain of the personal finance industry to expose the myths, contradictions, and outright lies it has perpetuated. She shows how an industry that started as a response to the Great Depression morphed into a behemoth that thrives by selling us products and services that offer little if any help. Olen calls out some of the biggest names in the business, revealing how even the most respected gurus have engaged in dubious, even deceitful, prac­tices—from accepting payments from banks and corporations in exchange for promoting certain prod­ucts to blaming the victims of economic catastrophe for their own financial misfortune. Pound Foolish also disproves many myths about spending and saving, including:Small pleasures can bankrupt you: Gurus popular­ized the idea that cutting out lattes and other small expenditures could make us millionaires. But reduc­ing our caffeine consumption will not offset our biggest expenses: housing, education, health care, and retirement. Disciplined investing will make you rich: Gurus also love to show how steady investing can turn modest savings into a huge nest egg at retirement. But these calculations assume a healthy market and a lifetime without any setbacks—two conditions that have no connection to the real world. Women need extra help managing money: Product pushers often target women, whose alleged financial ignorance supposedly leaves them especially at risk. In reality, women and men are both terrible at han­dling finances. Financial literacy classes will prevent future eco­nomic crises: Experts like to claim mandatory sessions on personal finance in school will cure many of our money ills. Not only is there little evidence this is true, the entire movement is largely funded and promoted by the financial services sector. Weaving together original reporting, interviews with experts, and studies from disciplines ranging from behavioral economics to retirement planning,Pound Foolish is a compassionate and compelling book that will change the way we think and talk about our money.",
  "genres": [
    "Nonfiction",
    "Finance",
    "Economics",
    "Personal Finance",
    "Business",
    "Money",
    "Politics"
  ],
  "author": "Helaine Olen",
  "average_rating": "3.68",
  "url": "https://www.goodreads.com/book/show/18079686-pound-foolish"
}