{
  "title": "Love & War: Twenty Years, Three Presidents, Two Daughters and One Louisiana Home",
  "description": "For twenty years, James Carville and Mary Matalin have held the mantle of the nation’s most politically opposed, ideologically mismatched, and intensely opinionated couple. In this follow-up to their groundbreaking All’s Fair: Love, War, and Running for President, Carville and Matalin take a look at how they—and America—have changed in the last two decades. If nothing else, this new collaboration proves that after twenty years of marriage they can still manage to agree on a few things.Love & War traces, in their two distinct voices, James and Mary’s story from the end of the 1992 presidential campaign—where he managed Bill Clinton’s electoral triumph while she suffered defeat as George H. W. Bush’s key strategist—till now. Mary focuses on issues of family, faith, and foreign enemies and offers insights from her kitchen table as well as the White House Cabinet Room, while James’s concentration is politics and love—the triumphant and troubled Clinton era, George W. Bush’s complicated presidency, the election of Barack Obama, the rise of the corrosive partisanship that dominates political life in Washington today, and the overriding abiding romance he holds for his native Louisiana and his wife and children. Together, the Carville-Matalins reflect on raising two daughters in the pressure cooker of the nation’s capital, and their momentous 2008 decision to leave D.C. and move their family to New Orleans. Post-Katrina, James and Mary’s efforts to rebuild and promote that city have become a central part of their lives—and a poignant metaphor for moving the nation forward.A fascinating look at the last two decades in American politics and an intimate, quick-witted primer on grown-up relationships and values, Love & War provides unprecedented insight into one of our nation’s most intriguing and powerful couples. With their natural charm and sharp intelligence, Carville and Matalin have written undoubtedly the most spirited memoir of the year.",
  "genres": [
    "Nonfiction",
    "Politics",
    "Memoir",
    "Biography",
    "Biography Memoir",
    "Audiobook",
    "Adult"
  ],
  "author": "Mary Matalin",
  "average_rating": "3.90",
  "url": "https://www.goodreads.com/book/show/18079687-love-war"
}