{
  "title": "Careless People: Murder, Mayhem, and the Invention of The Great Gatsby",
  "description": "Tracing the genesis of a masterpiece, a Fitzgerald scholar follows the novelist as he begins work on The Great Gatsby.   The autumn of 1922 found F. Scott Fitzgerald at the height of his fame, days from turning twenty-six years old, and returning to New York for the publication of his fourth book, Tales of the Jazz Age. A spokesman for America’s carefree younger generation, Fitzgerald found a home in the glamorous and reckless streets of New York. Here, in the final incredible months of 1922, Scott and Zelda Fitzgerald drank and quarreled and partied amid financial scandals, literary milestones, car crashes, and celebrity disgraces. Yet the Fitzgeralds’ triumphant return to New York coincided with another event: the discovery of a brutal double murder in nearby New Jersey, a crime made all the more horrible by the farce of a police investigation—which failed to accomplish anything beyond generating enormous publicity for the newfound celebrity participants. Proclaimed the \"crime of the decade\" even as its proceedings dragged on for years, the Mills-Hall murder has been wholly forgotten today. But the enormous impact of this bizarre crime can still be felt in The Great Gatsby, a novel Fitzgerald began planning that autumn of 1922 and whose plot he ultimately set within that fateful year.Careless People is a unique literary investigation: a gripping double narrative that combines a forensic search for clues to an unsolved crime and a quest for the roots of America’s best loved novel. Overturning much of the received wisdom of the period, Careless People blends biography and history with lost newspaper accounts, letters, and newly discovered archival materials. With great wit and insight, acclaimed scholar of American literature Sarah Churchwell reconstructs the events of that pivotal autumn, revealing in the process new ways of thinking about Fitzgerald’s masterpiece. Interweaving the biographical story of the Fitzgeralds with the unfolding investigation into the murder of Hall and Mills, Careless People is a thrilling combination of literary history and murder mystery, a mesmerizing journey into the dark heart of Jazz Age America.",
  "genres": [
    "Nonfiction",
    "History",
    "Biography",
    "True Crime",
    "Books About Books",
    "Crime",
    "American History"
  ],
  "author": "Sarah Churchwell",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/18079759-careless-people"
}