{
  "title": "The Buckle Bunnies Series Volume One",
  "description": "RIDE OF HER LIFEBarrel rider Daisy Hollins has run into bronc riders Sawyer Jones and Beau Monroe quite a few times on the rodeo circuit. She’s flirted with them, but things have never gone any further than that. However, when she runs into the two hot cowboys in the hotel bar at the Rodeo Finals in Las Vegas, there’s a different vibe in the air. When the flirting starts this time, it doesn't stop, and Daisy goes upstairs with both of them for a completely different kind of rodeo ride.TEAM ROPINGDallas O'Shea can't help but notice the two hot rodeo riders who walk into her bar. Steer ropers Mack Carter and Ked Everett have set their sights on her, too, regardless of the fact that she's going to be mixing drinks all night. When closing time comes around, both men are still there. She can't choose between the two cowboys, so she tells them she won't sleep with either of them unless she sleeps with both of them. They agree - on one condition. Afterward, Dallas has to honestly tell them who was better in bed. Two hunky cowboys, each motivated to please her like she's never been pleased before? How can a woman lose in a situation like this? For Dallas, it's going to be a night like she's never had, and for Mack and Ked, the night ends with the cowboys getting a chance to demonstrate two of their greatest talents - roping and riding.Yeehaw!RIDE 'EM HARDWhen Shawna Barton's best friend and barrel racer Britt Miles comes to town, she can't wait to have a girls' night out. The two haven't seen each other in years and the usually shy, reserved Shawna loves hearing about her friend's exploits, especially her most recent sexual encounter with handsome bull rider Clay Winters. Things take a sexy turn after they run into the man himself a little while later. Before Shawna knows it, she forgets about her inhibitions and is out there bumping and grinding on the dance floor with Britt and Clay. The night gets even more interesting when Clay suggests they take their little threesome back to his place for the kind of ride only a cowboy knows how to give a girl - or in this case, two of them!Author’s Note: THE BUCKLE BUNNIES SERIES is a collection of the complete sexy stories about hot, hunky rodeo riders and the women who can't get enough of them. It contains ménage situations, erotic spankings, roping and riding!",
  "genres": [
    "Contemporary"
  ],
  "author": "Paige Tyler",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/18079961-the-buckle-bunnies-series-volume-one"
}