{
  "title": "Ready",
  "description": "Lucy Monroe's books have hit national bestseller lists in both the US and England. Her highly charged, sensual stories touch on the realities of life while giving the reader a fantasy story not easily forgotten. In Ready, she delights a whole legion of fans with three ex-Army rangers who make Chuck Norris look like a wimp and one introverted writer who is about to enter into the most explosive affair of her life. As a writer, Lise Barton is used to coming up with wild scenarios for her characters, but the one that's playing out for her right now is no fiction--it's frighteningly real. Someone is stalking her, someone who knows where she lives and what she does. Someone who has even threatened her family--her brother, his wife, and their precious baby girl. Lise isn't about to let someone hurt them, so she packs up and leaves Texas for the anonymity of Seattle. And then the threats start again. Joshua Watt's mission is simple: Go to Seattle and bring Lise home for Thanksgiving or he'll never hear the end of it from his sister. It's not like \"Aunt Lise\" to stay away from their adorable niece, and Joshua's pretty sure he's the reason for it. He's spent months trying to forget the taste of her lips, the feel of her soft hair in his fingers. Yeah, okay, he wants her--badly--but family comes first. But the minute he sees the fear in Lise's eyes, his survival instincts kick in. The former Army Ranger isn't about to let some creep terrorize an innocent woman--not on his watch. He's going to do what it takes to protect Lise and try to keep his personal feelings out of it. Because if there's one thing he's learned, it's that sex and work don't mix. Not ever. So far.",
  "genres": [
    "Romance",
    "Romantic Suspense",
    "Contemporary Romance",
    "Contemporary",
    "Suspense",
    "Military Fiction",
    "Adult"
  ],
  "author": "Lucy Monroe",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/180802.Ready"
}