{
  "title": "Whispered Secrets of the South: Montevallo, Alabama",
  "description": "Lions, and crooks, and ghosts, oh my! Far from an exotic movie set location, Montevallo is a quaint college town in the heart of Alabama. You won’t believe the stories from its rural past. Of course, you shouldn’t believe everything you hear anyway. Some tales are charming, some surreal, and others border on the absurd. Still, you wonder…no one could make this stuff up. Jean Michelle’s daughter is a student at the University of Montevallo. During parent visits, Jean Michelle stumbles upon a gateway into the past on the University of Montevallo’s campus. She travels through time to discover if the rumors are true. Only, the characters of the past believe she’s Sally, someone they already know.She journeys through Cherokee Indian territory with the infamous Red Eagle and sneaks a glimpse of Reynolds Hall’s makeshift Civil War hospital.A wedding feast turns into a disaster at the King Mansion when an uninvited ghost cuts in during a dance. But this may be Jean Michelle’s only chance to investigate where Mr. King buried his treasure from the Yankees. Jean Michelle experiences College Night firsthand and must choose a side. The nation’s oldest homecoming tradition is directed behind the scenes by a ghost who likes surprises. Will it be a PV or a GV3? She even knocks on Condie’s door and meets the former Alabama College’s most famous resident. No one can forget the girl on fire, especially her face. Jean Michelle returns to the beautiful campus quad where she started her quest. But the familiar Eclipse cat winks as if something is amiss. She has seen that cat somewhere before. Imagine her surprise when the past catches up with her. Numerous sightings of the historical characters are spotted in the present at Montevallo’s American Village. The only legend missing in action is Sasquatch, although he was recently spotted in nearby Chilton County. History literally comes alive on the University of Montevallo’s campus. Ghosts of the past linger and appear when least expected. Perhaps there’s more to this geographical center of Alabama than just purple spirit or golden pride. Should Jean Michelle reveal the secrets whispered to her from the past? Two can keep a secret if one of them is dead. Benjamin Franklin first spoke these wise words, but he is dead. Which reminds me, Montevallo should be added to your list of places to see before you die. Montevallo, Alabama’s Whispered Secrets of the South is the first in a series of books which unravel the untold secrets of small Southern towns. From church bells, train rails, calaboose jails to ghost tales, this book reeks of wisteria, sweet tea, hospitality, and swinging porch doors. Although the stories are fictional, they are riddled with real-life histories and mysteries. You can decide which is which. Note: The cat’s name has been changed to protect his identity.",
  "genres": [],
  "author": "Shelly Van Meter Miller",
  "average_rating": "3.29",
  "url": "https://www.goodreads.com/book/show/18081133-whispered-secrets-of-the-south"
}