{
  "title": "Of the World",
  "description": "Of the World is the second book of the groundbreaking coming-of-age trilogy If Where You’re Going Isn’t Home, the story of a boy growing up Mormon in America with a dream to play jazz trumpet. It follows Journey, the first book of the trilogy, and the recipient of a coveted ForeWord Clarion Five Star Review.At sixteen, licensed to drive, armed with his trumpet and a talented band, Shake Tauffler begins to slip the harness of his home and neighborhood to test himself in the raw world of the streets and nightclubs of Salt Lake and its outlying towns. His threatened parents intensify their attacks on his emerging sexual and moral consciousness. Jazz and its negro heroes still define him, but his church takes off its gloves to teach him that in God’s eyes negroes are anything but heroes. The Huck Finn days of Journey are over; this is the rebel Shake, conflicted, torn, haunted by the faceless mystery of never being good enough and a hunger he can’t name, roaming the night alone or with his hoodlum pals, looking for refuge in hot cars, chance girls, violence, the cry of his trumpet, the faces of the American night.In Of the World, the Shake we met in Journey takes on tougher obstacles, extends his reach, becomes streetwise, and continues to meet the senseless forces of his life openly, with courage, wit, defiance, joy, and wonder. He joins the Army and becomes a tanker. He embraces the freedom from his past, the simplicity and sense of life in the real world, and the chance to define himself from scratch among his fellow soldiers. But his past rears up when he falls in love and has to face the ruthless racial dogma his faith has tried to breed in him. He returns home, a man and a hero, to a family and church who are quick to remind him who and where he is. A mission when he turns nineteen lies just ahead. The road of the life he built is ending. One last defiant self-affirming act takes him across the American desert to close it down his way.As the promised continuation of the first book, Of the World is for readers who enjoy losing themselves in a big American story. It is alive with scenes that weave the lives of his family, his band, his church buddies, and his hoodlum pals into a rich, kaleidoscopic, constantly moving narrative. The reach of its settings takes in Salt Lake and its outskirts towns, the secret holy places of the Mormon Church, the landscapes of Nevada, California, Las Vegas, Kentucky, the Mojave Desert.",
  "genres": [],
  "author": "Max Zimmer",
  "average_rating": "4.92",
  "url": "https://www.goodreads.com/book/show/18081621-of-the-world"
}