{
  "title": "Alone with Other People",
  "description": "\"What Gabby Bess captures with her words is the beauty of a fragile time & place. In this collection, she evokes what it means to be young, to be a woman, to have both feet firmly planted both in this world & the virtual. She asks fascinating questions like, 'Is anyone moved by the plainness of raw skin anymore?' She makes you trust she's the necessary answers with intelligence & confidence. In this book, she builds an identity for herself, tears it down & builds herself anew. It's breathtaking to behold.\"--Roxane Gay, author of An Untamed State & Bad Feminist“The poems & prose pieces in this smart & complex collection illuminate the shape of a new, 21st century webcam feminism—one that questions its own ambitions, knows the shape of pornstar mouths & doubts the sanctity of individuality when pitted against the existential. Gabby writes with radical uncertainty about illusions of control, the limits of identity & what it means to still want to kiss another human amidst the screenshots. This is a book that invents its own female gaze & then, like a bad bitch, breaks the lens.”--Melissa Broder, author of Meat Heart“Gabby Bess’s Alone with Other People orchestrates an impressive catalog of young human want with a uncompromising style. In the span between its 1st phrase The sex can be rough & its last sentence, Panic, the reader forward thru a virtual rolodex of self-inquisition shaped by boredom, horror, aspiration, fear for future, wonder, lust. There’s a lot of intense light coming off this book full of screens & suns & large black dots.”--Blake Butler, author of Sky Saw“Don’t take me for crazy when I say that the verse “Hahaha, am I alone here?” is the one that best sums up Gabby’s incredible debut book, because it’s true. Thru each & every page that makes up Alone with Other People, the author manages to head out into the world with a sane, witty & protesting laugh. A laugh about the strength of woman, of youth, of poetry. When Gabby says hahaha, it also starts to unravel before our very eyes a series of texts that first & foremost find beauty in the mundane, followed by the universality of intimacy, & lastly (& most importantly): the sensation that with this book, we will never, ever feel lonely again.”--Luna Miguel, author of Bluebird & Other Tattoos“Of-the-moment, brilliant & triumphantly sad, Illuminati Girl Gang leader Gabby Bess’s debut Alone with Other People is a post-feminist, hyper selfconscious teen swansong of the Internet age. The line between girl body & Macbook is collapsed in these vignettes that riff from blog posts, text messages & tumblr memes, & what emerges is a “modern tragic figure who would sacrifice herself for whatever.”--Kate Durbin, author of E! Entertainment“Alone with Other People deftly deals with relationships in a highly mediated age–one that twists our perceptions of self & others. Gabby shows us how we can be simultaneously complicit in this culture but still have the desire to fight against it.”--Ann Hirsch, performance artist",
  "genres": [
    "Poetry",
    "Short Stories",
    "Fiction",
    "Adult",
    "Literature",
    "21st Century",
    "Feminism"
  ],
  "author": "Gabby Bess",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/18085335-alone-with-other-people"
}