{
  "title": "The Hotel on Place Vendome: Life, Death, and Betrayal at the Hotel Ritz in Paris",
  "description": "Set against the backdrop of the Nazi occupation of World War II, the captivating history of Paris's world-famous Hôtel Ritz-a breathtaking tale of glamour, opulence, and celebrity; dangerous liaisons, espionage, and resistance-from the New York Times bestselling author of The Widow Clicquot and The Secret of Chanel No. 5Established in 1898 in the heart of Paris on Place Vendôme, the Hôtel Ritz instantly became an icon of the city frequented by film stars and celebrity writers, American heiresses and risqué flappers, politicians, playboys, and princes. When France fell to the Germans in June 1940, it was the only luxury hotel of its kind allowed in the occupied city by order of Adolf Hitler.Tilar J. Mazzeo traces the history of this cultural landmark from its opening in fin de siècle Paris. At its center, The Hotel on Place Vendôme is an extraordinary chronicle of life at the Ritz during wartime, when the Hôtel was simultaneously headquarters to the highest-ranking German officers, such as Reichsmarshal Hermann Göring, and home to exclusive patrons, including Coco Chanel. Mazzeo takes us into the grand palace's suites, bars, dining rooms, and wine cellars, revealing a hotbed of illicit affairs and deadly intrigue, as well as stunning acts of defiance and treachery, where refugees were hidden in secret rooms, a Jewish bartender passed coded messages for the German resistance, and Wehrmacht officers plotted to assassinate the Führer. Yet, as she makes clear, not everyone at the Ritz in the spring of 1940 would survive to the war's end.Rich in detail, illustrated with black-and-white photos, The Hotel on Place Vendôme is a remarkable look at this extraordinary place and the people and events that made it legend; the crucible where the future of post-war France-and all of post-war Europe-was transformed.",
  "genres": [
    "History",
    "Nonfiction",
    "France",
    "World War II",
    "War",
    "Historical",
    "Book Club"
  ],
  "author": "Tilar J. Mazzeo",
  "average_rating": "3.59",
  "url": "https://www.goodreads.com/book/show/18089902-the-hotel-on-place-vendome"
}