{
  "title": "100 Days of Real Food: How We Did It, What We Learned, and 100 Easy, Wholesome Recipes Your Family Will Love",
  "description": "Simple, family-friendly recipes and practical advice to help you ditch processed food and eat better every day!Thanks to Michael Pollan's In Defense of Food, Lisa Leake was given the wake-up call of her life when she realized that many of the foods she was feeding her family were actually \"foodlike substances.\" So she, her husband, and their two young girls completely overhauled their diets by pledging to go 100 days without eating highly processed or refined foods—a challenge she opened to readers on her blog. What she thought would be a short-term experiment turned out to have a huge impact on her personally. After wading through their fair share of challenges, experiencing unexpected improvements in health, and gaining a preference for fresh, wholesome meals, the Leakes happily adopted their commitment to real food as their \"new normal.\"Now Lisa shares her family's story, offering insights and cost-conscious recipes everyone can use to enjoy wholesome natural food prepared with easily found ingredients such as whole grains, fruits and vegetables, seafood, locally raised meats, whole-milk dairy products, nuts, natural sweeteners, and more.Filled with step-by-step instructions, this hands-on cookbook and guide includes:Advice for navigating the grocery store and making smart real food purchases Tips for reading ingredient labels 100 quick-and-easy recipes for such favorites as Homemade Chicken Nuggets, Whole Wheat Pasta with Kale Pesto Cream Sauce, Cheesy Broccoli Casserole, The Best Pulled Pork in the Slow Cooker, and Cinnamon-Glazed Popcorn Meal plans and suggestions for kid-pleasing school lunches, parties, and snacks A 10-day mini-starter program, and much more.100 Days of Real Food offers all the support, encouragement, and guidance you'll need to make these incredibly important and timely life changes.",
  "genres": [
    "Cookbooks",
    "Food",
    "Nonfiction",
    "Cooking",
    "Health",
    "Nutrition",
    "Parenting"
  ],
  "author": "Lisa Leake",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/18090093-100-days-of-real-food"
}