{
  "title": "Dark Invasion 1915: Germany's Secret War & the Hunt for the First Terrorist Cell in America",
  "description": "What happens when German spies collaborate to unleash a campaign of terror upon America at the start of World War I?In the summer of 1914, New York Police Department captain Tom Tunney is preoccupied by Manhattan's raging gang rivalries and has little idea that, halfway around the world, a much more ominous threat to the city is brewing. As Germany teeters on the brink of war, its ambassador to the United States is given instructions to find and finance a team of undercover saboteurs who can bring America to its knees before it has a chance to enter the conflict on the side of the Allies.At the page-turning pace of a spy thriller, Dark Invasion tells the remarkable true story of Tunney and his pivotal role in discovering, and delivering to justice, a ruthless ring of German terrorists determined to annihilate the United States. Overwhelmed and undermatched, Tunney's small squad of cops was the David to Germany's Goliath, the operatives of which included military officers, a germ warfare expert, a gifted Harvard professor, a bomb technician, and a document forger. As explosions leveled munitions plants and destroyed cargo ships, particularly in and around New York City, pan- icked officials talked about rogue activists and anarchists—but it was Tunney who suspected that these incidents were part of something bigger and became determined to bring down the culprits.Through meticulous research, Blum deftly reconstructs an enthralling, vividly detailed saga of subterfuge and bravery. Enhanced by more than fifty images sourced from global archives, his gritty, energetic narrative follows the German spies—with Tunney hot on their heels—from the streets, harbors, and warehouses of New York City to the genteel quads of Harvard, the grand estates of industry tycoons, and the steps of the U.S. Capitol. The New York Police Department's breathtaking efforts to unravel the extent of the German plot and close in on its perpetrators are revealed in this riveting account of America's first encounter with a national security threat unlike any other—the threat of terrorism—that is more relevant now than ever.",
  "genres": [
    "History",
    "Nonfiction",
    "World War I",
    "Espionage",
    "American History",
    "Germany",
    "War"
  ],
  "author": "Howard Blum",
  "average_rating": "4.06",
  "url": "https://www.goodreads.com/book/show/18090209-dark-invasion-1915"
}