{
  "title": "Shadow Over Babylon",
  "description": "The assassination plot is the brainchild of the most powerful men in government. It is manned by the most savagely skilled death team money can buy. It is armed with the most advanced weapons and technological systems on earth. It is assembled behind the backs of its own and its allies' intelligence agencies. And it is perfectly calculated to bypass the defenses of its target - President Saddam Hussein. A high-ranking government minister conceives the plan for reasons of state the public must never know. Roger Asher, a flamboyant and shady global financier, takes it over. Sir Peter Dartington, a construction magnate in need of mammoth government contracts, is enlisted to bankroll it. And Ed Howard, a maverick who runs his own super-security organization, accepts the contract and meticulously mobilizes an awesome arsenal and international attack team while working out, in daring detail, a course of action that gives new meaning to this mission impossible. Each step is intricately and ingeniously engineered to from the Highlands of Scotland, where a young deer stalker with a secret motive for murder is recruited for his incredible shooting talent, to the oval office in Washington, where powerful forces are set in motion to derail the plan...from research centers in England, where invaluable esoteric information is gathered, to the plains of Texas, where an American pilot comes aboard...from the Saudi Arabian desert, where a deadly border must somehow be breached, to the most forbidden territory inside Iraq itself...from the most icy and callous conspiratorial minds to the most elemental qualities of courage and endurance. And as the countdown begins on this terrifying master plot to change the course of history, an assassin moves step by step, danger by danger, heartbeat by heartbeat, to the moment when Saddam Hussein moves into the gun sights, and a finger tightens on a trigger.",
  "genres": [
    "Fiction",
    "Thriller",
    "Novels",
    "Action"
  ],
  "author": "david-mason",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/1809317.Shadow_Over_Babylon"
}