{
  "title": "The Oxford Book of Science Fiction Stories",
  "description": "In \"Swarm,\" Bruce Stirling takes the reader inside the Nest, a vast honeycomb of caverns within an asteroid orbiting Betelgeuse, peopled by hundreds of thousands of large, insectlike aliens, including eight-legged, furred workers the size of Great Danes, and horse-sized warriors with heavy,fanged heads. In \"The Screwfly Solution,\" Raccoona Sheldon creates a world much like modern America, except that something--an insect virus, a mass religious delusion, or an alien--is infecting men worldwide, converting their sexual drive into homicidal rage against women. And J.G. Ballard in\"Billennium\" portrays the end result of unchecked population growth, a claustrophobic city of 30 million people, where by law the unmarried must live in cubicles four meters square. These three tales, though strikingly different, have one thing in common--each evokes a world that is uniquely theauthor's own. Indeed, to read any science fiction writer is to enter into another world. It may be a world far off in space or time, or it may be right here, right now, but with a twist--an invention, or event, or visitor--that suddenly changes everything.In The Oxford Book of Science Fiction Stories , Tom Shippey has brought together thirty classic science fiction tales, each of which offers a unique vision, an altered reality, a universe all its own. Here are some of the great names in science fiction--H.G. Wells, Arthur C. Clarke, FrederikPohl, Brian Aldiss, Ursula K. Le Guin, Thomas Disch, Bruce Sterling, William Gibson, and David Brin. To give readers a sense of how the genre's range, vitality, and literary quality evolved over time, Shippey has organized these stories chronologically. Readers can sample H.G. Well's 1903 story \"TheLand Ironclads\" (which predicted the stalemate of trench warfare and the invention of the tank), Jack Williamson's \"The Metal Man,\" a rarely anthologized gem written in 1928, Clifford D. Simak's 1940s classic, \"Desertion,\" set on \"the howling maelstrom that was Jupiter,\" Frederik Pohl's 1955 \"TheTunnel Under the World\" (with its gripping first line, \"On the morning of June 15th, Guy Burckhardt woke up screaming out of a dream\"), right up to the current crop of writers, such as cyberpunks Bruce Sterling and William Gibson, whose 1982 story \"Burning Chrome\" foreshadows the idea of virtualreality, and David Brin's \"Piecework,\" written in 1990. In addition, Shippey provides an informative introduction, examining the history of the genre, it major themes, and its literary techniques.Here then is a galaxy of classic science fiction tales, written by the stars of the genre. Anyone with a serious interest in science fiction--and everyone who has entertained a curiosity about the genre--will find this volume enthralling.",
  "genres": [
    "Science Fiction",
    "Short Stories",
    "Fiction",
    "Anthologies",
    "Science Fiction Fantasy",
    "Reference",
    "Short Story Collection"
  ],
  "author": "Tom Shippey",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/1809584.The_Oxford_Book_of_Science_Fiction_Stories"
}