{
  "title": "The Forgotten Man",
  "description": "Elvis Cole is back...With his acclaimed bestsellers, Hostage (a New York Times Notable Book) and Demolition Angel, Robert Crais drew raves for his unstoppable pacing, edgy characterizations, and cinematic prose. Now, in The Last Detective, Crais returns to his signature character, Los Angeles private investigator Elvis Cole, in a masterful page-turner that probes the meaning of family and the burdens of the past.Los Angeles, 3:58 A.M.: Elvis Cole receives the phone call he's been waiting for since childhood. Responding to a gunshot, the LAPD has found an injured man in an alleyway. He has told the officer on the scene that he is looking for his son, Elvis Cole. Minutes later, the man is dead.Haunted throughout his life by a lack of knowledge about his father, Elvis turns to the one person who can help him navigate the minefield of his past - his longtime partner and confidant, Joe Pike. Together with hard-edged LAPD detective Carol Starkey (who is harboring her own growing feelings for Cole), they launch a feverish search for the dead man's identity. Elvis, meanwhile, struggles between wanting to believe he's found his father at last and allowing his suspicions to hold him back. With each long-buried clue they unearth, a frightening picture begins to emerge about who the dead man might have been - and the terrible secret he's been guarding. At the same time, Elvis has no way of knowing he has awakened a sleeping monster. The further he goes in his investigation, the closer he draws to a merciless killer who is violently connected to the unidentified man's past. This psychopath believes Cole is hunting him, and he goes on the attack to find Elvis before Elvis can find him.",
  "genres": [
    "Mystery",
    "Fiction",
    "Crime",
    "Thriller",
    "Detective",
    "Mystery Thriller",
    "Suspense"
  ],
  "author": "Robert Crais",
  "average_rating": "4.17",
  "url": "https://www.goodreads.com/book/show/180993.The_Forgotten_Man"
}