{
  "title": "The Zombie Chapters Volume I",
  "description": "Earth is bombarded by a meteorite storm large enough to envelope the globe. Cities are devastated, satellites are knocked from the sky, and fires rage unchecked all over the world. In the midst of this apocalypse, a small country town, an Antarctic research station, and a group of stranded airline passengers struggle to survive, even as a new horror rises from the ashes…Welcome to Serial Fiction—with Zombies! The Zombie Chapters is a new, bi-weekly, serial, and a fresh take on the zombie genre. Its focus is on deep character development and the exploration of truly unique settings and situations. Read along as the serial’s main characters attempt to understand, and cope with, the sudden shattering of their world, and a deadly virus that turns mankind against itself by animating the corpses of the fallen!In Volume I, we meet four of the main characters as they fight to survive an otherworldly meteorite shower. Brad Thomas, a business development consultant, is in a commercial airliner when he first notices the green-tailed meteorites outside of his window. The next twenty minutes of his life are filled with unmitigated horror as he and his fellow passengers wait helplessly for the impact that will kill them all… Ramsey Claybourne, a military-trained virologist, tries to prepare a small country hospital for the worst, until the hospital itself is struck… Handicapped ten year old Emmy, and her huge, mentally-challenged brother Carter, stare in wonder at the beautiful display in the sky above them. When the “magical” meteorites turn deadly, however, Emmy must rely on her brother’s mobility, and might, to save her… Piotr Sayan and his girlfriend Maria, a brilliant Russian meteorite expert, are just starting their day when Mirnyy Station, Russia’s largest Antarctic base, is rocked by the devastation of the meteorite bombardment…",
  "genres": [
    "Zombies",
    "Short Stories"
  ],
  "author": "Daniel Fite",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/18096987-the-zombie-chapters-volume-i"
}