{
  "title": "In a House of Dreams and Glass: Becoming a Psychiatrist",
  "description": "When Robert Klitzman and his fellow psychiatric residents began their training at a large city hospital, they were not prepared for what they would face over the next three years. Learning by trial and error, they struggled to help patients overcome depression, banish paranoias, and escape inner demons. In a House of Dreams and Glass recounts in dramatic detail the true story of a young psychiatrist's grueling training.In fascinating stories we see Klitzman as he battles the inexact nature of the \"science\" of psychiatry, conflicting advice from the doctors serving as his supervisors, and the patients themselves. The young residents must come to grips with the realities of the profession they have chosen. They are treated by the staff doctors much as if they were patients, undergoing psychotherapy and being tested. Patients infiltrate the residents' lives. Trainees are caught between their patients, the staff, and the more senior hospital physicians as they literally attempt to learn psychiatry by practicing it.The suicide of a patient, grueling nights in the emergency room, the stress of treating demanding patients, the minefield of hospital politics, and the despair at treatment that fails - all are portrayed with sensitivity and at times even humor. From the slick, glitzy promotional campaigns of drug companies to the squalor of a homeless shelter, Klitzman shows the excesses that characterize his field.Even as it illustrates the controversies and questions of psychiatry, ultimately In a House of Dreams and Glass is the story of a young doctor struggling to help patients in the face of sometimes harsh hospital bureaucracy, an overworked hospital staff and doctors, and the patients' own mental demons.",
  "genres": [
    "Psychiatry",
    "Medical",
    "Psychology",
    "Memoir",
    "Nonfiction"
  ],
  "author": "Robert Klitzman",
  "average_rating": "3.79",
  "url": "https://www.goodreads.com/book/show/1088550.In_a_House_of_Dreams_and_Glass"
}