{
  "title": "The Red Shoes",
  "description": "Alternate cover edition - ISBN13: 9781936833429.John Stewart Wynne's The Red Shoes is a contemporary gay version of the classic Hans Christian Andersen fairy tale set in Manhattan. The narrator, John Laith, lives across the street from the Episcopal Seminary in Chelsea. Within its hushed chapel and welcoming gardens he finds solace, mourning the untimely death of his partner Frank and trying to recover from that loss. An active participant in a Twelve Step grief recovery group, he has a loving, supportive network of friends. Yet he feels something is missing, an ability to put his sorrow aside and once again feel the full force of life, its promise of excitement and abandon. Strangely enough, that opportunity presents itself in the form of a present given to him—a pair of shiny red shoes—by a handsome eighteen-year-old modern dancer named Jared who arrived in the citynine months earlier fresh from the country. But Jared failed to make his mark in the city as an artist—the red shoes didn’t help him win auditions but spun him out of control into a series of casual affairs culminating in a sexual assault on Gay Pride Day. Narrator John Laith helps Jared recover after that assault and gets him on a bus back home. Jared has nothing to offer Laith by way of thanks except his red shoes.Laith now possesses the sparkling red shoes. Or perhaps they possess him—propelling him on a perilous journey through both the affluent and seedy sides of a vividly brought to life Manhattan at the turn of the millennium.An innocent in a sinister underworld, Laith tries to survive his newfound ties to unpredictable and chillingly unforgettable characters. There’s Crewe James, a multi-millionaire living with his imperious wife and daughter in a Gothic castle-like Central Park West penthouse, who has unsavory secrets and a possibly dark agenda for Laith ... Silvio, a taciturn Brooklyn cop with a propensity for rough sex ... Baily, a drug-fueled bouncer in a Euro-trash Chelsea nightclub owned by his boss Maxo, who works the front bar yet oversees some business in the backroom as well ... And Maxo’s absinthe-addicted, ethereally beautiful “lady,” Patrizia, a kindred spirit to John Laith who tries to become a protective fairy godmother to him.Laith inexplicably cannot escape his fascination with exploring the dark side. Is it because of the terrible magical powers of those red shoes given to him by the young dancer? Or is it because of some hidden desire within himself? As Laith collides with these mysterious characters and immerses himself in their obsessive lives, he finds he still can’t quite let go of his lost love. His poignant preoccupations with loss, danger and safety continue to loom in and out of focus in the surreal fog of his escalating drug use and increasing periods of sexual oblivion. Eventually Laith must confront his own downward spiral. A riveting battle between the sacred and the profane is at war inside him—and in the end there comes a shocking moment of realization where he must finally choose between them.",
  "genres": [
    "M M Romance",
    "LGBT"
  ],
  "author": "John Stewart Wynne",
  "average_rating": "3.71",
  "url": "https://www.goodreads.com/book/show/18104453-the-red-shoes"
}