{
  "title": "Alicia's Possession",
  "description": "NEW  A sensual romantic suspense thriller!Haunted by a traumatic accident and her husband's betrayal, Alicia believes she can never trust again. Now she must surrender her will to Mason if she wants to solve the mystery behind the bizarre events terrorizing her. Are they the work of the paranormal, her own paranoia, or something far more sinister?After recovering from a freak car crash that put her in a coma for two months and left her with depression and no memory of the accident, wealthy socialite Alicia Pageant becomes convinced there is a connection between the seemingly mysterious disappearance of her neighbor and a series of bizarre occurrences inside her own house; but everyone, including the detective investigating the neighbor's disappearance, thinks the woman's head injury has left her unable to distinguish reality from fantasy.When Detective Mason Crawley is called out to investigate this \"suspicious incident,\" Alicia's palpable sadness and vulnerability awaken his instinct to protect her and lead her out of her depression and into the light, but will he push her too far too fast?A mystery tied up with a thrilling and sexy romantic suspense...As her story begins to unravel, each new piece of information only deepens the mystery and creates more questions than it answers. He begins to wonder if he is falling in love with a woman who is a witness to a cleverly-concealed crime, dangerously delusional, or a murderer.\"A great story. It's got everything - sex, crime, cops, more sex, a twisted mystery, knot tying, and a superb denouement.\"  -Chuck Hustmyre, screenwriter and bestselling author of The Axman of New OrleansThis romantic suspense thriller also contains light bondage and mild elements of Dominance and submission. If you are offended by BDSM, please do not buy this book.New releases available in both Kindle and paperback books.",
  "genres": [
    "BDSM",
    "Romance",
    "Mystery",
    "Suspense",
    "Contemporary"
  ],
  "author": "Colette L. Saucier",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/18104345-alicia-s-possession"
}