{
  "title": "Could a \"Heat Death\" be Necessary for Life?",
  "description": "We have met the \"heat death\" of the universe in progress, and it is... us?  EXCERPT \"Organic cells form, reproduce, and die within complex organisms that are born, reproduce, and die, within species and civilizations that eventually result in new species and civilizations or simply carry on until they become extinct. All because stars are born, die, and are replaced, some former and current stars facilitating habitable planets and life.\"  The heat death is the current dominant theory about a proposed final state for the universe. Trillions of years from now, it is believed by many scientists, entropy will be an all pervasive condition in a kind of cosmic mortality where no viable energy will be available anymore for the formation of stars and planets and life. In contrast with the claim of Creationists that the progression in nature toward disorder means that the existence of life must be an intentional act, yet a thing that may show nature to be slanted toward life, I have noticed that many processes that would be defined as entropy are necessary for our existence.  While reading the work of Stephen Hawking, among others, I first began to wrestle with this line of thought in the mid-2000s, and only recently learned of a change taking place in text books with regard to the second law of thermodynamics. Although there is a connection between entropy and disorder in some respects, it is no longer being defined as a tendency toward disorder but is described in terms of energy dispersal.  My questioning of common perceptions of the second law began in earnest when I learned about \"the arrow of time.\" The arrow referred to is a directional arrow, time being a one way street in direct relation to entropy. A glass can fall off a table and shatter on the floor but will never reform up on the table like a film run in reverse. I was scratching my head about entropy as a tendency toward disorder when I applied time's arrow to such processes as the formation of fertile soil from death and decay; programmed cell death, which prevents cancer, and the harvesting and processing of plants and animals for food, as well as digestion. Then there are things like the periodic table of elements, and even evolution, itself, in relation to time's arrow, and the second law.  As the late Dr. Carl Sagan famously said \"We are star stuff.\" How might this relate to the theoretical heat death? All of these issues are addressed in the title essay in this book, and there are several poems pondering aspects of science and/or spirituality, often from a Panentheist perspective, one of which appeared in Philosophy Now Magazine. https://www.createspace.com/4324969",
  "genres": [],
  "author": "Kane S. Latranz",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/18106138-could-a-heat-death-be-necessary-for-life"
}