{
  "title": "Underwater Panther",
  "description": "\"an intimate, emotionally powerful story about a community and the coming-of-age of a particular young man within it.\" - Amazon Vine Reviewer, as part of Amazon Breakthrough Novel Award\"strong evocation of a setting and a culture that is uncommon in contemporary fantasy.\" - Amazon Vine Reviewer, as part of Amazon Breakthrough Novel Award\"the setting is appealing and richly evoked, the protagonist is likable, and the scenario is intriguing.\" - Amazon Vine Reviewer, as part of Amazon Breakthrough Novel AwardDuring Whippoorwill Moon, the sun lay gently over the land and the people eagerly left their longhouses to weave quillwork and to sculpt their earthenware in the warm light. However, despite the welcoming earth and lengthening days, the people were troubled. A threat loomed in the forests surrounding their town. The trees tossed about ominously and river pools bubbled where they should only mirror the moon’s perfection. Storehouses were dwindling, fishermen were coming home with empty baskets, and for the first time since entering the sixth world, the farmers were clearing new fields. Poor harvests of the past few seasons had forced them onto new ground. And they were finding peculiar artifacts in the soil.Little Owl was content to fish and amuse himself by collecting the shells of freshwater mussels, but a long-held mystery about the end of the last age and their deliverance into the present seemed ready to unfold before his eyes. Change was imminent for the people and so Owl's great-uncle sensed the need to respect the signs. It was time for his nephew to find his totem. And so, after days of fasting and ceremonial purification, Owl begins a perilous journey through forests overrun with the enemy of his people. Far from home, he gains tantalizing clues about their deliverance into the present world. But the truth surrounding the end of the last age remains shrouded in mystery. Owl must know more. He presses on, to an ancient village, the subject of his imaginings for as long as he can remember. The people of the fifth world had abandoned the old town. It was a place to avoid, a place where lingering ghosts and bad spirits were thought to dwell. As Owl unravels the mystery, the situation grows ever more dangerous.",
  "genres": [],
  "author": "Jonathan   Cook",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/18106202-underwater-panther"
}