{
  "title": "A Whole World of Trouble: A Novel",
  "description": "In the tradition of Fannie Flagg, veteran storyteller Helen Chappell, acclaimed author of Giving Up the Ghost, presents a wry, funny, and poignant novel about two sisters, their dead mother, and a Chesapeake Bay town where anything can happen and frequently does.Sometimes you have to go home again, even if you know the trip is going to be one from hell. When Carrie points her van in the direction of Oysterback, Maryland, her old hometown, she does it only because she has no choice. Her momma, the indomitable Audrey, has done the she's died. And it wasn't a neat little Oysterback death either. No, it happened in Florida and involved an alligator. But, then again, there was nothing conventional about Audrey, even in life. The same could be said for her daughter Carrie -- single, perpetually searching, and professionally adrift, she has become an expert at yard sales, sifting through the detritus of other folks' lives, then reselling it to shops that sell antiques and assorted \"collectibles.\" Her sister, Earlene, considers Carrie a junk collector, but then Earlene has devoted her life to being conventional. Married with two boys, she has remained in Oysterback where she and her husband run the View 'n' Chew, a combination video store-sandwich shop. Momma had lived by the notion that a woman is incomplete without a man and spent the years following her husband's death trying to be as complete as humanly possible -- in the process working her way through a whole parade of men. As best Carrie can figure, her momma's last two flames were Alonzo Deaver, the town's resident miscreant and a current resident of the state penitentiary, and Jack Shepherd, a college professor on the run from failure and boredom. Both had been granted carte blanche to crash at Momma's house whenever the occasion should arise (be it Alonzo's planned escape from prison or Jack's escape from his ratty little boat). Once back in Oysterback, Carrie finds herself unwittingly caught up in a family drama of epic proportions -- including Earlene's resentment (which leads to a classic -- and very messy -- confrontation), a now-married ex-boyfriend's attempt to rekindle an old flame, her own attraction to Professor Jack, and a roiling stew of anger and grief over Momma's poorly timed passing. For while Carrie never expected to go home again, she naively believed it always would be there. A Whole World of Trouble is a delightfully authentic comedy of Southern manners and an antic, frequently hilarious, pointed, and moving novel by a writer who knows the people and the world she writes about.",
  "genres": [
    "Fiction"
  ],
  "author": "Helen Chappell",
  "average_rating": "3.19",
  "url": "https://www.goodreads.com/book/show/101049.A_Whole_World_of_Trouble"
}