{
  "title": "Unfettered Spirit:  Spiritual Gifts for the New Great Awakening",
  "description": "All too frequently studies of the gifts of the Spirit consist largely of answering two questions: “What are the gifts?” and “Which ones do I have?” In many cases studies go on to a third question: “How can I get more?” In response, institutional churches and theologically and intellectually respectable Christians often tend to avoid the work of the Holy Spirit in the church entirely. It's much easier to simply close the doors and windows than it is to deal with the wind (John 3:8). After all, they've seen the wind blow out the candles, disarrange the altar vestments, and send a chill through the congregants.Author, pastor, and church historian Bob Cornwall has experienced all of this for himself. He has seen traditional churches and worship. He has seen Pentecostal worship. He has led congregations in difficult times. For more than 30 years, he has studied, practiced, prayed, and lived the work of the Holy Spirit in the church.The result is Unfettered Spirit: Spiritual Gifts for the New Great Awakening. Here he avoids both the errors of replacing the freedom of the Spirit with human whim and of trying to tame or confine the Spirit that will not be fettered.He asks: “Do you truly believe that God is present in the world? And, do you believe that God is working through us to break down the walls that divide us from God, from each other, and from the world? And if you do, do you believe that you have been gifted and empowered to participate in this ministry that takes down the walls of egoism, suspicion, greed, self-interest, and hatred?”If you can say “yes” to these questions, jump right in! This is the book for you. If you are hesitant, or if the idea of the Holy Spirit working unfettered in your congregation and community frightens you, read the first four chapters carefully as Bob lays the theological foundation. You may find your “maybe” or even your “no” turned into a “yes.”Whether you are a Pentecostal, an evangelical, a mainliner, a progressive, or any other label you might find for yourself or your church, you will profit from reading this book.",
  "genres": [
    "Christian"
  ],
  "author": "Robert D. Cornwall",
  "average_rating": "4.50",
  "url": "https://www.goodreads.com/book/show/18108582-unfettered-spirit"
}