{
  "title": "Saving Amy",
  "description": "When a cure for cancer is discovered, the scientist who discovered it doesn't get the Nobel Prize. Instead, he gets a death sentence issued by his government.  Adam Yates suffers from Asperger's syndrome, a mild form of autism. But, in the vein of some autistic people, he has his gifts. When he discovers a cure for a particularly difficult type of breast cancer, he's kidnapped, drugged, and tortured by his captors.  What they want: his journals describing how cancer growth can be arrested. His captors don't want this information for their own gain or for the good of the human population. They want it for something far more sinister.  When Adam escapes his captors, he flees through the woods where he stumbles upon Regan Riley's campsite. Regan is a forensic scientist who worked for the State of Illinois crime labs. Burnt out and looking for a change, she heads downstate to view property coming up for auction that just might prove to be the perfect place for her own private lab. When Regan and Adam cross paths, the valuable information he guards will put Regan in harm's way.  Within minutes of their encounter, Regan recognizes that Adam is different. He flicks his fingers in front of his face and has difficulty making eye contact. Then he tells her his secret: someone is after his research work. They tortured him for days to acquire it but he refused to tell them. Or did he? He tilted his head toward Regan, and his gaze locked with hers. \"It was for my mom and others like her, but ... oh my God, maybe I told them.\" \"Told them what?\" asked Regan, kneeling beside him. He whispered so softly Regan could scarcely hear him. \"About Amy.\" He paused and shivered again. \"About saving Amy.\"  Uncomprehending, Regan goes to call for help when a shot rings out and Adam is killed. Help arrives in the form of the local county sheriff. His name is Drew Yates, and he's the normal twin brother of Adam Yates. Drew and Regan join forces to find out who's behind the murder of Adam and how the words Saving Amy are the key to unraveling a deadly government secret that may just cost them their lives.",
  "genres": [],
  "author": "Chris Lawrence",
  "average_rating": "4.00",
  "url": "https://www.goodreads.com/book/show/18108770-saving-amy"
}