{
  "title": "Wicked Firsts",
  "description": "Six New York Times and USA Today Bestselling authors bring you six all-new contemporary and super sexy suspense stories of first loves, first attractions, first temptations, first times and first obsessions.First Exposure by Elisabeth NaughtonA film that could make her career. A weekend that will change her life…When actress Avery Scott’s assistant goes missing researching a role for Avery at an exclusive adults-only resort, Avery finds herself with only one choice: travel to the resort herself and look for clues. She hires an elite operative from Aegis Security to accompany her. She just doesn’t expect to get former undercover FBI agent Cade Blackwell—the man who ripped out her teenage heart twelve years before. One weekend at the sexiest resort in the world with the only man she’s ever loved will expose her to more than just a kinky new lifestyle. It’ll expose her to numerous wicked firsts that will test every ounce of her self-control. And if she’s not careful, she could lose her heart—and her life—in the process.First Rapture by Alexandra IvyMadison Philips has only one reason to return to Las Vegas: Luc Angeli. The tall, dark bad boy took her virginity on her eighteenth birthday and then walked away, now she’s back, and ready for revenge. Luc Angeli spent his youth trying to earn the approval of his philandering father. Now he’s his own man, but there’s still something missing from his life. He doesn’t know what it is until he catches sight of Madison across a balcony. Suddenly he knows this woman is what he’s been searching for, and this time he’s not walking away.First Taste of Darkness by Cynthia EdenHot sex. No regrets. Jess Delaney has spent her life playing the role of the good-girl. On a trip to Vegas, she decides to walk on the wild side when she meets mysterious Blake Landon. Rich, powerful, and carrying plenty of secrets, Blake is unlike any man she has ever met before. But as the passion burns between them, danger waits in the darkness…a danger that may just claim Jess’s life…First Ink by Laura WrightRush... Women in his bed, celebs and rockers in his chair, life is pretty freaking swell. Then she walks back into it again. Not for pleasure, but for pain. For Ink. A bleeding heart to match the one she left him with five years ago.Addison... She can’t forget him or the pain she caused him. All she has is a hope for redemption. But it’ll only work if he lets her inside his exclusive world, under his famous artist’s needle and into his bed—once again.First Surrender by Katie ReusHe’s dangerous, sexy, and everything she wants. And he’s about to make his claim…Hayden, the dangerously sexy, tattooed ex-SEAL is one of the best friends Sierra has ever had—and the main star in her wildest fantasies. But he doesn’t see her that way. And she’d die of embarrassment if he found out she was still a virgin.Hayden’s struggled to keep his attraction to the beautiful, dark haired casino chef a secret. But when an attacker targets Sierra, Hayden’s protective instincts go into overdrive. With the attraction between them burning out of control, he’ll do whatever it takes to protect her and make her his.First Temptation by Joan SwanCounterterrorist agent Taft Walker is up for the challenge of posing as an adult store owner with a new female undercover partner who is also a sex-toy virgin. At least until he sees the real woman beneath her tough façade.Border Patrol Agent Zoe Brooks is ready to get off the front lines. She’s willing to tolerate a swaggering partner like Taft for a new opportunity. But she’s not prepared for the way he understands her deepest, sexiest desires.",
  "genres": [
    "Romance",
    "Anthologies",
    "Erotica",
    "Romantic Suspense",
    "Contemporary Romance",
    "Contemporary",
    "Erotic Romance"
  ],
  "author": "Elisabeth Naughton",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/18108879-wicked-firsts"
}