{
  "title": "Suspiciously Obedient",
  "description": "AFTER A BILLION PEOPLE WATCH YOU MAKE LOVE, WHERE DO YOU HIDE?A fake persona with very real emotions...As \"Matt Jones,\" CEO playboy Michael Bournham has just stumbled into his wildest dream and worst nightmare while playing a middle-management employee role for a reality television stunt. Getting caught making love with his administrative assistant, Lydia Charles, on camera let unscrupulous Hollywood producers blackmail him before launching the video on YouTube. Fired from his job and ridiculed on social media, Mike needs to hit \"reboot\" on his life. Hiding Lydia away in Iceland with a made-up job, he sends his best friend Jeremy to watch over her. Meanwhile, he disguises himself once more and booked a cabin at Lydia's family's campground in Maine, to immerse himself in her world.A best friend with deeper intentions...After more than a decade of world travel and hedonistic fun, dot-com millionaire Jeremy wants more out of his friendship with Mike, but more than that – he wants Lydia. Struck by her beauty and essence, he follows Mike's order and obeys, courting her with a friendship that quickly becomes a deeper bond, charged by Lydia's fantasies about him – and Mike. Unable to resist, he becomes her confidante and bedmate, helping her to come to grips with her impulsive decisions and to find her way back home to Maine.A woman torn by desire...Lydia accepts the move to Iceland to become the Director of Communications for European Operations not realizing it's a sham position Michael Bournham created to help hide her from the firestorm of the viral sex tape. Living in a new country should be fun, but side glances and whispers from her new Icelandic employees dig at her. Ignored by her new boss at Bournham Industries, Lydia's disenchantment with her bold move is softened only by Jeremy's appearance. Wild and loose, he fills a void in her life – and soon fills her bed.When she decides there's no place like home, the new couple embarks for her family's campground – and Jeremy's suspicious obedience will be revealed.",
  "genres": [
    "Romance",
    "Erotica",
    "Contemporary Romance",
    "BDSM",
    "Erotic Romance",
    "Fiction",
    "Contemporary"
  ],
  "author": "Julia Kent",
  "average_rating": "3.96",
  "url": "https://www.goodreads.com/book/show/18110538-suspiciously-obedient"
}