{
  "title": "The Gift",
  "description": "When Celia, a Princeton scholarship student, sees an advertisement in the university newspaper for an egg donor, she immediately decides to respond. An aspiring writer, Celia is eager to pursue new experiences, but her precarious financial circumstances are also a concern. Raised by her father in a dying South Carolina mill town, Celia worries that she does not belong in the affluent Ivy League environment. She has watched her father drift into alcoholism and welfare since the local mill shut down, and she fears that at some point she may need all her resources to save him.Elise, a freelance editor who has left full-time work to focus all her energies on her fertility quest, is impressed by Celia’s eloquent response to the advertisement and decides to select her as the donor. Still struggling with the an eating disorder, Elise spends much of her time in therapy agonizing over her past, most notably her involvement with a charismatic Nigerian author named Eric Babu. Elise’s husband Peter, a graduate student in Near East Studies still trying to begin his dissertation after six years in graduate school, is ambivalent about his wife’s headstrong determination to use whatever means possible to have a child. Embarrassed by his own privilege, Peter has never been able to move beyond his heyday as a Peace Corps volunteer in Morocco fifteen years before, the only time in his life when he felt any sense of purpose or direction. Under pressure from Elise to finish school so that they can begin their “adult” lives, Peter becomes even more anxious when his impulsive spouse quits her job and decides to befriend her donor.Shifting among the perspectives of the three main characters, The Gift draws attention to the muddy moral questions raised by modern reproductive technologies as well as the drastic lengths to which Americans are willing to go to engineer their genetic offspring.",
  "genres": [
    "Fiction",
    "Chick Lit"
  ],
  "author": "Rachel Newcomb",
  "average_rating": "3.25",
  "url": "https://www.goodreads.com/book/show/18110829-the-gift"
}