{
  "title": "All Things Considered",
  "description": "Gilbert Keith Chesterton (1874-1936) was an English writer, philosopher, lay theologian, and literary and art critic. As an author he created the fictional priest-detective Father Brown, and produced several notable works on apologetics including Oethodoxy (1908) and The Everlasting Man (1925). He routinely referred to himself as an 'orthodox' Christian, and came to identify this position more and more with Catholicisim, eventually converting to Catholicism from High Church Anglicanism. He was born in Kensington, educated at St Paul's School, and later attended the Slade School of Art, a department of University College London, to become an illustrator. He also took classes in literature at UCL but did not complete a degree in either subject. His first positions were within publishing houses, during which time he also became a freelance art and literary critic, and in 1902 the Daily News gave him a weekly opinion column, followed in 1905 by a weekly column in the London Illustrated News for which he continued to write for the next 30 years. In 1901 he married Frances Blogg who played a large role in his career as amanuensis and personal manager. Throughout the course of his career Chesterton wrote around 80 books, several hundred poems, some 200 short stories, 4,000 essays, and several plays. His writings consistently displayed wit and a sense of humour, and he would often employ paradox while making serious comments on the world, politics, economics, philosophy, theology, and many other topics. All Things Considered (1908) is a collection of 34 essays, the first of several books comprised of essays that had previously appeared as columns in the Illustrated London News. The contents of this collection are quintessential Chesterton, covering subjects from poetry to patriotism, anonymity to impartiality, from demagogues to mystagogues, from science to religion, from phonetic spelling to running after one's hat.",
  "genres": [
    "Nonfiction",
    "Essays",
    "Christian",
    "Classics",
    "Philosophy",
    "Religion",
    "Politics"
  ],
  "author": "G.K. Chesterton",
  "average_rating": "4.02",
  "url": "https://www.goodreads.com/book/show/181110.All_Things_Considered"
}