{
  "title": "Evenings and Weekends",
  "description": "For fans of Sally Rooney and Torrey Peters, a taut and profoundly moving debut that follows a cast of intricately linked characters during a heatwave in London as simmering tensions and secrets come to a head over one life-changing weekend.London, 2019. It’s the hottest June on record, and a whale is stuck in the Thames River. In the streets of the city, four old acquaintances want more from life than they’ve been given. On the summer solstice, the longest day of the year, their paths will intersect at a party that will change their lives forever…Maggie, a once-hopeful artist turned waitress, is pregnant and preparing to move back to her hometown with her boyfriend and father-to-be Ed, leaving the city she loves and the life she imagined for herself.Ed, coasting through life as a barely competent bike courier, is ready for a new start with Maggie and their baby, if only to finally leave behind his secret past of hooking up with strange men in train station bathrooms—and his secret past with Maggie’s best friend, Phil.Phil, who sleepwalks through his office job and lives for the weekends, is on the brink of achieving his first real relationship with his roommate Keith. The two live in an illegal warehouse commune with other quirky creatives and idealists—the site of the party to end all parties.As the temperature continues to climb, Maggie, Ed, and Phil will have to confront their shared pasts, current desires, and limits of their future lives together before the weekend is over. Strikingly heartfelt, sexually charged, and disarmingly comic, Oisín McKenna’s addictive, page-turning debut is a mesmerizing dive into the soul of a city and a critical look at the political, emotional, and financial hurdles facing young adults trying to build lives there and often living for their evenings and weekends.",
  "genres": [
    "Fiction",
    "Contemporary",
    "Literary Fiction",
    "Queer",
    "LGBT",
    "Audiobook",
    "Book Club"
  ],
  "author": "Oisín McKenna",
  "average_rating": "3.80",
  "url": "https://www.goodreads.com/book/show/181109993-evenings-and-weekends"
}