{
  "title": "Hell Put to Shame: The 1921 Murder Farm Massacre and the Horror of America's Second Slavery",
  "description": "From the acclaimed New York Times bestselling author of Chesapeake Requiem comes a gripping new work of narrative nonfiction telling the forgotten story of the mass killing of eleven Black farmhands on a Georgia plantation in the spring of 1921—a crime that exposed for the nation the existence of “peonage,” a form of slavery that gained prominence across the American South after the Civil War.On a Sunday morning in the spring of 1921, a small boy made a grim discovery as he played on a riverbank in the cotton country of rural Georgia: the bodies of two drowned men, bound together with wire and chain and weighted with a hundred-pound sack of rocks. Within days a third body turned up in another nearby river, and in the weeks that followed, eight others. And with them a deeper horror: all eleven had been kept in virtual slavery before their deaths. In fact, as America was shocked to learn, the dead were among thousands of Black men enslaved throughout the South in conditions nearly as dire as those before the Civil War.Hell Put to Shame tells the forgotten story of that mass killing and of the revelations about peonage, or debt slavery, that it placed before a public self-satisfied that involuntary servitude had ended at Appomattox more than fifty years before.By turns police procedural, courtroom drama, and political exposé, Hell Put to Shame also reintroduces readers to three Americans who spearheaded the prosecution of John S. Williams, the wealthy plantation owner behind the murders, at a time when white people rarely faced punishment for violence against their Black neighbors. The remarkable polymath James Weldon Johnson, newly appointed the first Black leader of the National Association for the Advancement of Colored People, marshaled the organization into a full-on war against peonage. Johnson’s lieutenant, Walter F. White, a light-skinned, fair-haired, blue-eyed Black man, conducted undercover work at the scene of lynchings and other Jim Crow atrocities, helping to throw a light on such violence and to hasten its end. And Georgia governor Hugh M. Dorsey won the statehouse as a hero of white supremacists—then redeemed himself in spectacular fashion with the “Murder Farm” affair.The result is a story that remains fresh and relevant a century later, as the nation continues to wrestle with seemingly intractable challenges in matters of race and justice. And the 1921 case at its heart argues that the forces that so roil society today have been with us for generations.",
  "genres": [
    "Nonfiction",
    "True Crime",
    "History",
    "Crime",
    "Race",
    "Audiobook",
    "American History"
  ],
  "author": "Earl Swift",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/181109944-hell-put-to-shame"
}