{
  "title": "The Hathaways Complete Series",
  "description": "Here together for the first time in a convenient ebook bundle, the five books from The Hathaways series by New York Times bestselling author Lisa  Mine Til Midnight, Seduce Me at Sunrise, Tempt Me at Twilight, Married by Morning, and Love in the Afternoon.Mine Till MidnightWhen an unexpected inheritance elevates her family to the ranks of the aristocracy, Amelia Hathaway discovers that tending to her younger sisters and wayward brother was easy compared to navigating the intricacies of the ton. Even more the attraction she feels for the tall, dark, and dangerously handsome Cam Rohan.Seduce Me at SunriseKev Merripen has longed for the beautiful, well-bred Winnifred Hathaway ever since her family rescued him from the brink of death when he was just a boy. But this handsome Gypsy is a man of mysterious origins—and he fears that the darkness of his past could crush delicate, luminous Win. So Kev refuses to submit to temptation…and before long Win is torn from him by a devastating twist of fate.Tempt Me at TwilightPoppy Hathaway loves her unconventional family, though she longs for normalcy. Then fate leads to a meeting with Harry Rutledge, an enigmatic hotel owner and inventor with wealth, power, and a dangerous hidden life. When their flirtation compromises her own reputation, Poppy shocks everyone by accepting his proposal—only to find that her new husband offers his passion, but not his trust.Married by MorningFor two years, Catherine Marks has been a paid companion to the Hathaway sisters—a pleasant position, with one caveat. Her charges' older brother, Leo Hathaway, is thoroughly exasperating. Cat can hardly believe that their constant arguing could mask a mutual attraction. But when one quarrel ends in a sudden kiss, Cat is shocked at her powerful response—and even more so when Leo proposes a dangerous liaison.Love in the AfternoonAs a lover of animals and nature, Beatrix Hathaway has always been more comfortable outdoors than in the ballroom. Even though she participated in the London season in the past, the classic beauty and free-spirited Beatrix has never been swept away or seriously courted…and she has resigned herself to the fate of never finding love. Has the time come for the most unconventional of the Hathaway sisters to settle for an ordinary man—just to avoid spinsterhood?",
  "genres": [
    "Romance",
    "Historical Romance",
    "Historical",
    "Regency",
    "Historical Fiction",
    "Anthologies",
    "Adult"
  ],
  "author": "Lisa Kleypas",
  "average_rating": "4.63",
  "url": "https://www.goodreads.com/book/show/18111194-the-hathaways-complete-series"
}