{
  "title": "Trouble",
  "description": "NEW YORK TIMES and USA TODAY BESTSELLING AUTHOR, ELLE CASEY, brings readers TROUBLE, the final installment in the New Adult Romance Series, REBEL WHEELS.Alissa Benson used to have plans. Big ones. Important ones. But all those plans went down the drain on her twenty-first birthday, and now she's just trying to pick up the pieces and manage the fallout. Sure, there are people wanting to help. But they're pushy and suffocating and none of them can say more than ten words without cussing. And then of course there's Colin. As if life isn't complicated enough. He's the guy who couldn't stand to even look at her last week but now seems to keep popping up every time she turns around. She'd like to say she can't stand the sight of him, but that would be a lie. It doesn't matter, though. Life is too complicated for dreaming about guys like him. Alissa has a baby almost due, no job, no money, and there's nothing she hates more than being a burden. But when her past moves into her present, threatening to take away her very last shred of dignity, she's forced to reconsider everything she ever thought she knew about the world and herself.\nRebel Wheels Series Reading Order\nRebel Wheels: Book 1 (Rebel)Rebel Wheels: Book 2 (Hellion)Rebel Wheels: Book 3 (Trouble)Content Warning: Contains sexy adult situations, creative foul language, and some mild violence. May not be appropriate for younger readers.About this series: Normally this is the spot where I write what inspired the story or the series you see above, and usually it’s a tale about a person I knew or heard about, or a dream I had … but this time, nope. Not at all. This entire series was inspired by the cover model on Rebel, Book 1 in the Rebel Wheels series. I saw his photos on a website, and a little voice inside my head said, “Ooo la laaaa,” and the story just came to me from there. I know. Man candy. What can I say? I’m addicted.",
  "genres": [
    "Romance",
    "New Adult",
    "Contemporary Romance",
    "Humor",
    "Contemporary",
    "Adult",
    "Abuse"
  ],
  "author": "Elle Casey",
  "average_rating": "4.16",
  "url": "https://www.goodreads.com/book/show/18111607-trouble"
}