{
  "title": "Monday Mourning",
  "description": "Internationally acclaimed forensic anthropologist and New York Times bestselling author Kathy Reichs explores the Stockholm syndrome—the psychology of a captive submitting to the ideology of a captor—in this mesmerizing new thriller.Temperance Brennan, forensic anthropologist for both North Carolina and Quebec, has come from Charlotte to Montreal during the bleak days of December to testify as an expert witness at a murder trial.She should be going over her notes, but instead she’s digging in the basement of a pizza parlor. Not fun. Freezing cold. Crawling rats. And now, the skeletonized remains of three young women. How did they get there? When did they die?Homicide detective Luc Claudel, never Tempe’s greatest fan, believes the bones are historic. Not his case, not his concern. The pizza parlor owner found nineteenth-century buttons in the cellar with the skeletons. Claudel takes them as an indicator of the bones’ antiquity.But something doesn’t make sense. Tempe examines the bones in her lab and establishes approximate age with Carbon-14. Further study of tooth enamel tells her where the women were born. If she’s right, Claudel has three recent murders on his hands. Definitely his case.Detective Andrew Ryan, meanwhile, is acting mysteriously. What are those private phone calls he takes in the other room, and why does he suddenly disappear just when Tempe is beginning to hope he might be a permanent part of her life? Looks like more lonely nights for Tempe and Birdie, her cat.As Tempe searches for answers in both her personal and professional lives, she finds herself drawn deep into a web of evil from which there may be no escape. Women have disappeared, never to return...Tempe may be next.With its powerful mix of nail-biting suspense and cutting-edge forensic science, Monday Mourning is the best yet from this superbly gifted, megastar author who, as New York Newsday says, is “the real thing.”",
  "genres": [
    "Mystery",
    "Crime",
    "Fiction",
    "Thriller",
    "Mystery Thriller",
    "Suspense",
    "Audiobook"
  ],
  "author": "Kathy Reichs",
  "average_rating": "4.04",
  "url": "https://www.goodreads.com/book/show/181116.Monday_Mourning"
}