{
  "title": "Dorothy Parker: What Fresh Hell Is This?",
  "description": "\"I was just a little Jewish girl trying to be cute.\" So Dorothy Parker described herself at the end of her life. That self-deprecating comment sums up her flamboyant life with remarkable understatement.Before the age of thirty-five, Dorothy Parker was known as the wittiest woman in America. Her most casual remarks were repeated and printed. In fact, there was scarcely a bon mot of the day that was not attributed to her. She lived with hedonistic flair: luncheons at the Algonquin Round Table with George S. Kaufman, Alexander Woolcott, and Franklin P. Adams; evenings at the theater and later a tour of the fashionable speakeasies and brothels with Robert Benchley; weekends at the Long Island house parties that Fitzgeralds would memorialize in The Great Gatsby; vacations in France with Sara and Gerald Murphy. During the Depression, she and her husband were earning $5200 a week in Hollywood, where her friends and fellow writers included Lillian Hellman, S. J. Perelman, Nathanael West, and William Faulkner. Her commitment to left-wing politics added high drama to her life during the 1930s and later during the McCarthy period.Superficially, at least, she seemed to have everything worth having and to know everyone worth knowing. Yet behind the wisecracks, the dazzling wordplay, and the whirlwind of high living was a wealth of private sadness: two broken marriages and a succession of lacerating love affairs, a string of suicide attempts and abortions, heavy debts, and even heavier drinking. The rage behind her wit had indeed turned in on her. She became a victim of her own neuroses, not unlike her friend Zelda Fitzgerald.Dorothy Parker: What Fresh Hell Is This? is the definitive biography of a uniquely colorful woman and a glittering portrait of her times. This is an enthralling, authoritative, and entertaining study of an extremely complex woman who was at the epicenter of an electrifying age.",
  "genres": [
    "Biography",
    "Nonfiction",
    "History",
    "Biography Memoir",
    "Poetry",
    "Womens",
    "Feminism"
  ],
  "author": "Marion Meade",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/181120.Dorothy_Parker"
}