{
  "title": "Crime & Punishment: in and Around the Cotswold Hills",
  "description": "Crime and Punishment in and about the Cotswold Hillshttp://www.youtube.com/watch?v=XaEiZW... video link This fully illustrated colour book written by Cotswold publisher Nicholas Reardon shows the reader in Photographs and Sketches old time punishments such as stocks, whipping posts and lock-ups along with stories of murdered Kings and Court Jesters, Highwaymen and War Crimes committed long ago, when the Cotswold hills were not so peaceful. Having lived in the Cotswolds all my life, and with a keen interest in history, I would like to share my love of this area with you by pointing out some of the hidden features to be found in this unique part of the English countryside. Over the years my father, the well-known Cotswold artist Peter Reardon, had drawn a number of little sketches showing stocks, whipping posts and old town lock-ups. These illustrated the historic types of punishment served up to those who broke the law in and around these lovely and now peaceful hills. I was pleasantly surprised to discover that even after so many years these objects that my father had drawn were still in existence; they had been well looked after and could be viewed by anyone interested in this type of unusual history. Using the drawings as a starting point I photographed these objects to show how they look today. Then, along with a short description plus directions of how to find them, I produced the book you are now holding. Whilst reading this book you may notice that one of my personal interests is Gargoyles and I have scattered a few of my favourites throughout its pages. The Cotswolds contain a treasure trove of history: its grand stately homes and castles; the far older stone circles and ancient burial mounds; all in all, any visitor will be able to find something to delight them in these rolling hills. Nicholas Reardon",
  "genres": [],
  "author": "Nicholas Reardon",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/18112459-crime-punishment"
}