{
  "title": "Sacrifice of the Raven",
  "description": "When Ari Lake, guardian to his brother the Keeper of the Union, and a Labrador Retriever in his ani-shift form, wakes from his less than favorable rescue from the Gothi, he soon learns that he is still, to a certain extent, being held captive. This time, however, it is by different captors and for solely different reasons—there is something that they wish for him to see. When his eyes are opened to the revelation of yet another enemy threat rising up to come against his brother, and a potential traitor is revealed under inadvertent conditions, heartbreak automatically ensues. Afterwards, in the shadow of a waning moon, carrying the knowledge that Asher is falling in love, all too quickly, with Elle Ison, Ari sets out to do the one thing he was born to do, and that is to protect his brother anyway he can, even when that means the possibility of sacrificing himself in order to keep Asher alive. Asher Lake, a wolf in his ani-shift form and Keeper to the body of ani-shifts known as the Union, knows one thing; he wants Elle Ison to be more than just a sealed contract. After learning of potential dangers in the woods of Brokenridge, he sets out to find Elle and his brother Nixon, who have run off in search of answers that could end the Raven’s curse on Asher’s life—a cruse which states that if he falls in love he will die. When he finds Elle, it’s all he can do to convince her how he feels. But time and peace are items that the Lakes know little about. Soon after, not only does he suffer severe physical pain along with the heart wrenching agony of betrayal, he leads his brothers, the Circle, and the Blackbirds into battle against the Gothi. All the while hoping that Elle will accept the fact that he was chosen specifically because the Elder’s and Grant knew that he would always, gladly and wholeheartedly, sacrifice himself for the ones he loves.",
  "genres": [],
  "author": "Shawn Reilly",
  "average_rating": "4.74",
  "url": "https://www.goodreads.com/book/show/18113080-sacrifice-of-the-raven"
}