{
  "title": "HIDDEN MICKEY ADVENTURES 2: Peter and the Missing Mansion",
  "description": "HIDDEN MICKEY ADVENTURES 2Peter and the Missing MansionVolume 2 in a series of action-adventure mysteries about Walt Disney and Disneyland written for Adults, Teens, & Tweens (age 9 & up).Flesch-Kincaid Grade 4.3 - Flesch Reading Ease 84.5THINGS SEEM FAMILIAR—BUT SOMETHING IS HORRIBLY WRONGAlone and scared, Peter finds himself in the distant past and in front of a hauntingly-familiar mansion.PETER’S VISIT TAKES A DEADLY TURNAs Peter gets to know the inhabitants of this mansion, people aren’t as he thought. The man he thought was an innocent victim is now an adversary. Is there more to the story than he ever imagined?CAN WOLF AND LANCE RESCUE PETER IN TIME?Stairways to nowhere and hidden passageways, lit only by candles, might lead Lance to his son. Can he trust the one who might not be as she seems? Is the Disney legend just a story—or is it the truth?ONE FALSE STEP ALTERS THE DISNEYLAND WE ALL KNOWOn their return, the three travelers find they are the only ones who realize something has gone wrong at Disneyland. It is up to them to protect Walt Disney’s legacy.CAN THEY FIND OUT WHAT’S WRONG—AND CORRECT IT?Next book in the series... 'HIDDEN MICKEY ADVENTURES 3: The Mermaid's Tale'Another \"E-Ticket\" ride through Disney's history.Want more 'E-Ticket' adventures? Next time you visit the Disney Parks you can now participate in Quests like Adam & Lance by bringing with you a copy of HIDDEN MICKEY ADVENTURES: in Disneyland - HIDDEN MICKEY ADVENTURES: in Disney California Adventure, and for our east coast Fans: HIDDEN MICKEY ADVENTURES: in WDW Magic Kingdom (or download it to your mobile device).HIDDEN MICKEY Adventures are always TOP SELLERS at Disney's D23 Expo., the Los Angeles Times Festival of Books, and Tucson Festival of Books.",
  "genres": [],
  "author": "Nancy Temple Rodrigue",
  "average_rating": "4.38",
  "url": "https://www.goodreads.com/book/show/18113475-hidden-mickey-adventures-2"
}