{
  "title": "Extreme Medicine: How Exploration Transformed Medicine in the Twentieth Century",
  "description": "Little more than one hundred years ago, maps of the world still boasted white space: places where no human had ever trod. Within a few short decades the most hostile of the world’s environments had all been conquered. Likewise, in the twentieth century, medicine transformed human life. Doctors took what was routinely fatal and made it survivable. As modernity brought us ever more into different kinds of extremis, doctors pushed the bounds of medical advances and human endurance. Extreme exploration challenged the body in ways that only the vanguard of science could answer. Doctors, scientists, and explorers all share a defining trait: they push on in the face of grim odds. Because of their extreme exploration we not only understand our physiology better; we have also made enormous strides in the science of healing.Drawing on his own experience as an anesthesiologist, intensive care expert, and NASA adviser, Dr. Kevin Fong examines how cuttingedge medicine pushes the envelope of human survival by studying the human body’s response when tested by physical extremes. Extreme Medicine explores different limits of endurance and the lens each offers on one of the systems of the body. The challenges of Arctic exploration created opportunities for breakthroughs in open heart surgery; battlefield doctors pioneered techniques for skin grafts, heart surgery, and trauma care; underwater and outer space exploration have revolutionized our understanding of breathing, gravity, and much more. Avant-garde medicine is fundamentally changing our ideas about the nature of life and death.Through astonishing accounts of extraordinary events and pioneering medicine, Fong illustrates the sheer audacity of medical practice at extreme limits, where human life is balanced on a knife’s edge. Extreme Medicine is a gripping debut about the science of healing, but also about exploration in its broadest sense—and about how, by probing the very limits of our biology, we may ultimately return with a better appreciation of how our bodies work, of what life is, and what it means to be human.",
  "genres": [
    "Nonfiction",
    "Science",
    "Medicine",
    "Medical",
    "History",
    "Health",
    "Audiobook"
  ],
  "author": "Kevin Fong",
  "average_rating": "3.91",
  "url": "https://www.goodreads.com/book/show/18114051-extreme-medicine"
}