{
  "title": "Five Came Back: A Story of Hollywood and the Second World War",
  "description": "In Pictures at a Revolution, Mark Harris turned the story of the five movies nominated for Best Picture in 1967 into a landmark work of cultural history, a book about the transformation of an art form and the larger social shift it signified. In Five Came Back, he achieves something larger and even more remarkable, giving us the untold story of how Hollywood changed World War II, and how World War II changed Hollywood, through the prism of five film directors caught up in the war: John Ford, William Wyler, John Huston, Frank Capra, and George Stevens. It was the best of times and the worst of times for Hollywood before the war. The box office was booming, and the studios’ control of talent and distribution was as airtight as could be hoped. But the industry’s relationship with Washington was decidedly uneasy—hearings and investigations into allegations of corruption and racketeering were multiplying, and hanging in the air was the insinuation that the business was too foreign, too Jewish, too un-American” in its values and causes. Could an industry this powerful in shaping America’s mind-set really be left in the hands of this crew? Following Pearl Harbor, Hollywood had the chance to prove its critics wrong and did so with vigor, turning its talents and its business over to the war effort to an unprecedented extent. No industry professionals played a bigger role in the war than America’s most legendary directors: Ford, Wyler, Huston, Capra, and Stevens. Between them they were on the scene of almost every major moment of America’s war, and in every branch of service—army, navy, and air force; Atlantic and Pacific; from Midway to North Africa; from Normandy to the fall of Paris and the liberation of the Nazi death camps; to the shaping of the message out of Washington, D.C. As it did for so many others, World War II divided the lives of these men into before and after, to an extent that has not been adequately understood. In a larger sense—even less well understood—the war divided the history of Hollywood into before and after as well. Harris reckons with that transformation on a human level—through five unforgettable lives—and on the level of the industry and the country as a whole. Like these five men, Hollywood too, and indeed all of America, came back from the war having grown up more than a little.",
  "genres": [
    "History",
    "Nonfiction",
    "Film",
    "World War II",
    "Media Tie In",
    "Biography",
    "War"
  ],
  "author": "Mark  Harris",
  "average_rating": "4.12",
  "url": "https://www.goodreads.com/book/show/18114047-five-came-back"
}