{
  "title": "Games Creatures Play",
  "description": "Includes a brand-new story featuring Sookie Stackhouse and Manfred Bernardo ALL-NEW TALES OF UNUSUAL ATHLETICS BY JAN BURKE * DANA CAMERON * ADAM-TROY CASTRO * BRENDAN DuBOIS * CHARLAINE HARRIS * TONI L. P. KELNER * CAITLIN KITTREDGE * WILLIAM KENT KRUEGER * ELLEN KUSHNER * MERCEDES LACKEY * JOE R. LANSDALE * LAURA LIPPMAN * SEANAN McGUIRE * BRANDON SANDERSON * SCOTT SIGLER Welcome to the wide world of paranormal pastimes, where striking out might strike you dead. Editors Charlaine Harris and Toni L. P. Kelner are your announcers for this all-new story collection of the most peculiar plays ever made…   Sports fans live and die by their teams’ successes and failures—though not literally. But these fourteen authors have written spirited—in more ways than one—new tales of killer competitions that would make even the most die-hard players ask to be benched.   In #1 New York Times bestselling author Charlaine Harris’s “The Blue Hereafter,” Manfred Bernardo learns about softball from a certain blond barmaid in Louisiana.   Life-and-death stakes make the competition get serious in New York Times bestseller William Kent Krueger’s “Hide and Seek.”  New York Times bestselling author Mercedes Lackey’s “False Knight on the Road” features a high-stakes drag race on a foggy mountain road between a clever young bootlegger and a mysterious stranger.   In New York Times bestselling author Laura Lippman’s “Ice,” a young girl learns the true story behind a bit of neighborhood folklore.  New York Times bestseller Seanan McGuire presents “Jammed,” in which a chimera loose during the Roller Derby makes it anyone’s guess as to who will still be skating by the time the buzzer sounds.   In #1 New York Times bestselling author Brandon Sanderson’s “Dreamer,” a game of cops and robbers is a new challenge when the players are able to switch bodies at will.   And New York Times bestselling author Scott Sigler follows ghost stomper Hunter Hunterson as he investigates a haunted, never-ending baseball game in “The Case of the Haunted Safeway.”   These and eight more supernatural sporting stories are guaranteed to have you rooting for the home team…or else…Introduction BY CHARLAINE HARRIS AND TONI L. P. KELNERIN THE BLUE HEREAFTER BY CHARLAINE HARRISHIDE AND SEEK BY WILLIAM KENT KRUEGERSTEPPING INTO THE DEAD ZONE BY JAN BURKEDEAD ON THE BONES BY JOE R. LANSDALETHE DEVIL WENT DOWN TO BOSTON BY CAITLIN KITTREDGEON THE PLAYING FIELDS OF BLOOD BY BRENDAN DUBOISTHE GOD’S GAMES BY DANA CAMERONTHE CASE OF THE HAUNTED SAFEWAY BY SCOTT SIGLERPRISE DE FER BY ELLEN KUSHNERDREAMER BY BRANDON SANDERSONFALSE KNIGHT ON THE ROAD BY MERCEDES LACKEYJAMMED BY SEANAN MCGUIREHIDE AND SHRIEK BY ADAM-TROY CASTROICE BY LAURA LIPPMANBELL, BOOK, AND CANDLEPIN BY TONI L. P. KELNER",
  "genres": [
    "Fantasy",
    "Urban Fantasy",
    "Short Stories",
    "Anthologies",
    "Paranormal",
    "Fiction",
    "Supernatural"
  ],
  "author": "Charlaine Harris",
  "average_rating": "3.53",
  "url": "https://www.goodreads.com/book/show/18114043-games-creatures-play"
}