{
  "title": "Hitler's Angel",
  "description": "A young American doctoral student, Annie Pohlmann, comes to Munich in 1972 to do research for her dissertation. She is interviewing Fritz Stecher, a former detective inspector in the Kriminalpolizei about a 1929 investigation that was seminal in the development of modern police procedures. Stecher says too much attention has been paid to that investigation and insists on discussing the 1931 purported suicide of Geli Raubal, the teenage niece and alleged lover of Adolf Hitler. Through a series of flashbacks, Stecher relates the tale of his attempted investigation, which is opposed by forces outside the police from the beginning. When Stecher first arrives at the scene, the body has already been removed by some of Hitler's minions, including Rudolf Hess. The doctor who would normally perform the autopsy says he has never seen the body. Stecher's superior officer gives him the mission of finding out the truth but then sends Stecher on leave, because he can't investigate fully in an official capacity. Foiled at almost every turn by various members and supporters of the National German Socialist Workers' Party (NSDAP, or Nazis), Stecher nonetheless persists with his inquiry. The historical information woven into the story is interesting and gives a good summary of politics in early 1930s Germany for those who are unacquainted with the period. Rusch's writing, especially the dialogue, impressively conveys the aura of mistrust, dread, and intimidation surrounding people at all levels who were not members of the NSDAP. This is a fascinating exploration of the psyche of the main character and the pressures brought to bear on him as he investigates a crime that might have changed the course of history. This novel, which is based on an actual historical incident, is a departure from the author's usual science fiction and fantasy, but it marks a stunning debut in the mystery field. Sue Reider",
  "genres": [
    "Historical Fiction",
    "Crime",
    "World War II",
    "Historical",
    "Germany"
  ],
  "author": "Kris Rusch",
  "average_rating": "3.42",
  "url": "https://www.goodreads.com/book/show/1088975.Hitler_s_Angel"
}