{
  "title": "Chop Chop",
  "description": "An outrageously funny and original debut set in the fast-paced and treacherous world of a restaurant kitchen Fresh out of the university with big dreams, our narrator is determined to escape his past and lead the literary life in London. But soon he is two months behind on rent for his depressing Camden Town bed-sit and forced to take a job doing grunt work in the kitchen of The Swan, a formerly grand restaurant that has lost its luster. Mockingly called “Monocle” by his boisterous co-workers for a useless English lit degree, he is suddenly thrust into the unbelievably brutal, chaotic world of professional cooking and surrounded by a motley cast of co-workers for which no fancy education could have prepared him. There’s the lovably dim pastry chef Dibden, who takes all kinds of grief for his “girly” specialty; combative Ramilov, who spends a fair bit of time locked in the walk-in freezer for pissing people off; Racist Dave, about whom the less said the better; Camp Charles, the officious head waiter; and Harmony, the only woman in a world of raunchy, immature, drug- and rage-fueled men. But worst of all, there’s Bob, the sadistic head chef, who runs the kitchen with an iron fist and a taste for cruelty that surprises and terrifies even these most hardened of characters.  Once initiated and begrudgingly accepted, Monocle enters into a strange camaraderie with his fellow chefs, one based largely on the speed and ingenuity of their insults. In an atmosphere that is more akin to a zoo—or a maximum security prison—than a kitchen he feels oddly at home. But soon an altogether darker tale unfolds as Monocle and his co-workers devise a plot to overthrow Bob and Monocle’s dead-beat father (who has been kicked out of the family home) shows up at his door. Not only does his dad insist on sleeping on the floor of Monocle’s apartment; he starts hanging out at The Swan’s dissolute bar in the evenings. As the plan to oust Bob clicks into motion and the presence of his father causes Monocle to revisit lingering questions from his unhappy childhood, Chop Chop accelerates toward its blackly hilarious, thrilling, and ruthless conclusion.",
  "genres": [
    "Fiction",
    "Food",
    "Contemporary",
    "Humor",
    "Adult Fiction",
    "Foodie",
    "Literary Fiction"
  ],
  "author": "Simon Wroe",
  "average_rating": "3.41",
  "url": "https://www.goodreads.com/book/show/18114220-chop-chop"
}