{
  "title": "Be the Monkey: A Conversation About the New World of Publishing",
  "description": "Sure, the advent of digital books is the most significant development in publishing since Gutenberg. But what does digital mean really, for agents, publishers, and most of all, for authors? What will the industry look like tomorrow, and what should authors be doing to properly position themselves today?Examining the history and mechanics of the publishing industry as it exists today, the way the digital revolution reflects recent events in Egypt and the Maghreb, and a completely inappropriate YouTube video featuring a randy monkey and an unlucky frog, bestselling authors (and friends) J.A. Konrath and Barry Eisler show in this 35,000 word online discussion that digital isn't just the future, it's right now. Konrath, a pioneer in self-publishing, is now making over a half-million dollars a year through his self-published books, and Eisler just turned down a half-million dollar deal from one of the Big 6 NYC publishers to self-publish his latest novel. To find out why and what it all means for you, read on.Please feel free to repost all or any portion of this discussion with attribution and a link back to the authors. About the authorsJoe Konrath is the author of more than twenty novels and hundreds of short stories, written under the names J.A. Konrath (the Lt. Jacqueline \"Jack\" Daniels series), Jack Kilborn (Afraid, Trapped, Endurance, Draculas), and Joe Kimball (Timecaster.) Joe has a lot of names, apparently. He began self-publishing on Kindle in April, 2009. As of March, 2011, he's sold over 200,000 ebooks. On his blog, A Newbie's Guide to Publishing, he has chronicled his writing journey.Barry Eisler spent three years in a covert position with the CIA's Directorate of Operations, then worked as a technology lawyer and startup executive in Silicon Valley and Japan, earning his black belt at the Kodokan International Judo Center along the way. Eisler's bestselling thrillers have won the Barry Award and the Gumshoe Award for Best Thriller of the Year, have been included in numerous \"Best Of\" lists, and have been translated into nearly twenty languages. The first book in Eisler's John Rain series, Rain Fall, is now a minor motion picture (kidding, it’s reasonably major) starring Gary Oldman. Eisler lives in the San Francisco Bay Area and, when he's not writing novels, blogs about torture, civil liberties, and the rule of law. You can find out more on his website, friend him on Facebook, and follow him on Twitter. He was also in the movie Freakonomics, which he forgot to tell Joe.",
  "genres": [
    "Nonfiction",
    "Writing",
    "How To"
  ],
  "author": "Barry Eisler",
  "average_rating": "4.13",
  "url": "https://www.goodreads.com/book/show/10890413-be-the-monkey"
}