{
  "title": "Revolutionary Ideas: An Intellectual History of the French Revolution from The Rights of Man to Robespierre",
  "description": "How the Radical Enlightenment inspired and shaped the French RevolutionHistorians of the French Revolution used to take for granted what was also obvious to its contemporary observers--that the Revolution was caused by the radical ideas of the Enlightenment. Yet in recent decades scholars have argued that the Revolution was brought about by social forces, politics, economics, or culture--almost anything but abstract notions like liberty or equality. In Revolutionary Ideas, one of the world's leading historians of the Enlightenment restores the Revolution's intellectual history to its rightful central role. Drawing widely on primary sources, Jonathan Israel shows how the Revolution was set in motion by radical eighteenth-century doctrines, how these ideas divided revolutionary leaders into vehemently opposed ideological blocs, and how these clashes drove the turning points of the Revolution.Revolutionary Ideas demonstrates that the Revolution was really three different revolutions vying for supremacy--a conflict between constitutional monarchists such as Lafayette who advocated moderate Enlightenment ideas; democratic republicans allied to Tom Paine who fought for Radical Enlightenment ideas; and authoritarian populists, such as Robespierre, who violently rejected key Enlightenment ideas and should ultimately be seen as Counter-Enlightenment figures. The book tells how the fierce rivalry between these groups shaped the course of the Revolution, from the Declaration of Rights, through liberal monarchism and democratic republicanism, to the Terror and the Post-Thermidor reaction.In this compelling account, the French Revolution stands once again as a culmination of the emancipatory and democratic ideals of the Enlightenment. That it ended in the Terror represented a betrayal of those ideas--not their fulfillment.",
  "genres": [
    "History",
    "Philosophy",
    "French Revolution",
    "France",
    "Nonfiction",
    "European History",
    "Politics"
  ],
  "author": "Jonathan I. Israel",
  "average_rating": "3.93",
  "url": "https://www.goodreads.com/book/show/18118675-revolutionary-ideas"
}