{
  "title": "The Architect Of Law",
  "description": "Two men. One a wealthy corporate lawyer from Los Angeles to whom success has come easy. The other a former homeless child from the streets of Rio aching for the big money. Both are reaching for something impossible, something that has always eluded them.For ascending law firm associate Randal DeVergeres, success had come without much effort. He is riding high on a free-running global economy that has reordered the world. He had attended the right schools, cultivated the right contacts, made the right investments…he just assumed it would never end. But now, his life has become confused and he is no longer driven by his inner purpose. He cares little for the world where nations find themselves loosing control over their own destinies. He is preoccupied with expensive cars, trouble with women and mingling with the moneyed and successful.At the same time another man grew up living on the streets of Rio desperate for a better lifey, one of the estimated 40-million homeless children in South America. With inhuman strength, he had just barely clawed his way out of the nihilistic poverty surrounding him, but it put him under the thumb of an enigmatic patriarch. He knows life is precarious for men born without shirts. Now they find themselves in the middle of the Brazilian gold rush up the Amazon in a floating gold town namedBoca de Lobo. Cut off from civilization, the lawyer is suddenly confronted with the brutal nature of law and his own failures deep in the rainforest. When these two desperate lives cross in a lawless town on the Amazon during the greatest gold rush in history, neither will ever be the same again. Both are reaching for something impossible, something that has always eluded them. Pursued by dreams in the booming gold fields of the Amazon they will find it.",
  "genres": [],
  "author": "Michael Jeffery Blair",
  "average_rating": "5.00",
  "url": "https://www.goodreads.com/book/show/18119809-the-architect-of-law"
}