{
  "title": "Tesla: The Wizard of Electricity",
  "description": "Nikola Tesla was an eccentric genius who out-Edisoned Edison and out-Marconied Marconi. Born of modest means in what is now Croatia and later becoming a naturalized American citizen, Tesla’s inventions include the alternating current (AC) that powers our homes today, radio, wireless transmission, X-rays, and the electrifying Tesla coil. He even worked on development of direct energy weapons (death rays) and vertical takeoff and landing (VTOL) aircraft. During his lifetime Tesla moved first to Paris, then to New York, and after a period of time in Colorado Springs back to New York City where he maintained two laboratories. Along the way he worked for Edison, then became his biggest rival, and formed friendships with such divergent personalities as George Westinghouse, Mark Twain, a pigeon, all while reflecting on a childhood cat. His idiosyncrasies included an obsession with numbers divisible by three, ardent gambling, and a near-pathological fear of germs. He rarely slept more than a few hours at a time, often going days without rest. While generally soft-spoken, he could be a consummate showman, often insisting that his Tesla coil be present while he lectured, seemingly shooting lightning bolts as he spoke. In the end he died alone and nearly penniless, having ceded perhaps billions of dollars in royalties to his friend George Westinghouse. This illustrated book takes us through Tesla’s life, his experiments and contributions to science, and brings us into his complex mind. Through ample use of his writings and interviews with the societies and inventors clubs that honor his name, we explore Tesla’s methods and discoveries, personality quirks, and his legacy for the modern world – both scientific and popular culture.",
  "genres": [
    "Nonfiction",
    "Biography",
    "Science",
    "History",
    "Technology"
  ],
  "author": "David J. Kent",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/18126213-tesla"
}