{
  "title": "The Meat Market Series Boxed Set",
  "description": "*****Set Includes*****Midnight Special-Book OneMidnight Chase-Book TwoMidnight Surrender-Book ThreeMidnight Special - Paranormal Erotic Romance Novelette: Approximately 11,500 WordsNightclubs weren't Taryn Holbrook's usual scene, especially cliché hotspots like the Meat Market in Las Vegas. Against her better judgment, Taryn gets a little tipsy and finds herself at the mercy of Marcus, a gorgeous, domineering stranger who seemingly saves her from being manhandled by a handsy, drunk bar patron. When she wakes up half-naked in a strange hotel room with nearly no recollection of the night before, she begins to wonder whether she's been rescued or simply thrown to the wolves. Midnight Chase - Paranormal Erotic Romance Novelette: Approximately 10,000 WordsTaryn Holbrook has lost yet another battle of the wills. After being forced to stay in Las Vegas by the brooding, domineering F.B.I. agent, Special Agent Marcus Ryan, she begins to slowly realize that nothing in this world is what it seems. There is a whole other world of supernatural beings out there that include werewolves. Will Taryn succumb to the demands of Agent Ryan and find what she's been missing all her life, or will she decide to escape, leaving all possibilities of true love behind? Midnight Surrender - Paranormal Erotic Romance Novelette: Approximately 10,000 WordsWhat do you do when a ridiculously rich, handsome, super-werewolf/F.B.I. agent stalks, kidnaps, and tantalizes every one of your deepest, darkest sexual desires? Well, you marry him and breed with him of course! Poor Taryn no longer knows up from down when Special Agent Marcus Ryan sweeps in and captures her heart. She must decide whether she can play the role of the doting wife or whether she needs to come to her senses before it becomes too late.WARNING: These novelettes are intended for mature audiences (18+) and contain sexually explicit content.",
  "genres": [],
  "author": "Baylee Crush",
  "average_rating": "4.33",
  "url": "https://www.goodreads.com/book/show/18126287-the-meat-market-series-boxed-set"
}