{
  "title": "Hail Mary Full of Secrets",
  "description": "From the counterculture of the 1960s to the early part of the twenty-first century, Catholic matriarch Mary Ann Von Guten and her family are rocked by a series of scandals that threaten to tear their family apart. An intergenerational family tale of secrets, lies, and scandals in a large Catholic family, Nancy Kaufman’s debut explores the power of memories and the misfortunes that shape and divide a family. Mary Ann Von Guten is living a lie. So, in fact, is everyone in her family. Outside the walls of her home, however, no one would ever know it. To them she is a typical woman of her the submissive, dutiful wife and doting mother of seven children under the protective shroud of Catholicism. But Mary Ann has secrets, secrets too terrible to tell but too powerful to keep hidden forever… Stricken with the usual angst that comes with parenting times seven, her job is that much more difficult as she is raising her children during the turbulent era of the 1960s and 70s. Her son Mark falls victim to a priest with a proclivity for seminary students and spirals into alcoholism. Recovered, he learns that he is a father and struggles to gain custody only to be wrongly accused of molesting his daughter and sent to prison. One of Mary Ann’s daughters turns up dead, another elopes, a third goes to boarding school to hide her pregnancy, and Mary Ann’s husband dies of a heart attack—leaving her nothing. Beneath this roiling sea lay powerful secrets that are slowly tearing Mary Ann’s family apart, while ironically carrying within them the power to heal. An intriguing tale of heartache and scandal hidden beneath the veil of Catholicism, Kaufman delivers a powerful tale of the secrets families hide and the lengths they go to protect them. Brimming with the authenticity of experience and the deft touch of a master storyteller, Hail Mary Full of Secrets is a riveting narrative that examines the role of truth, the disruptive force of family, and the ultimate healing of secrets revealed.",
  "genres": [],
  "author": "Nancy Kaufman",
  "average_rating": "4.43",
  "url": "https://www.goodreads.com/book/show/18127385-hail-mary-full-of-secrets"
}