{
  "title": "Surviving Raine",
  "description": "\"There’s a moment when it comes to amazing books... where you realize that the book you’re reading completely and irrevocably owns you... [Surviving Raine] has that moment.\" - Ash the Book Snob As the captain of a schooner catering to the elite on the Caribbean Seas, Sebastian Stark does his best to avoid any human encounters. Interacting with people isn’t his thing, and he prefers the company of a bottle of vodka, a shot glass, and maybe a whore. There’s no doubt he’s hiding from a checkered past, but he does well keeping everything to himself… …until the night his schooner capsizes, and he’s stuck on a life raft with one of the passengers. Raine’s young, she’s cute, and Bastian would probably be into her if he wasn’t suffering from alcohol withdrawal. As the days pass, DTs, starvation, and dehydration become the norm. Even the most closed person starts to open up when he thinks he’s going to die, but when she realizes their traumatic pasts are connected, it’s no longer the elements that have Bastian concerned. He has no idea how he’s going to Survive Raine. \"Shay Savage's website almost cockily proclaims that she writes \"Fiction with Teeth\". HA! Nothing cocky about the truth, my friends. I guarantee, that is maybe the *only* accurate way to sum up the dark, unsettling, exciting, unapologetic, fascinating, shocking, frank, graphic, primal, crude, sexy, at times horrific, consistently compelling experience that is Surviving Raine!!\" -Elizabeth (Sweptawaybyromance.com) There are moments in Surviving Raine that will make you laugh, make you cry, and make your heart (and other parts) clench. This is one you will definitely want to put on your TBR list! -Kassie and Lauren (fics2flicks.com)",
  "genres": [
    "New Adult",
    "Romance",
    "Survival",
    "Erotica",
    "Contemporary",
    "Dark Romance",
    "Abuse"
  ],
  "author": "Shay Savage",
  "average_rating": "4.01",
  "url": "https://www.goodreads.com/book/show/18127958-surviving-raine"
}