{
  "title": "You Get Full Credit For Being Alive",
  "description": "Dear Author,First I didn’t see the body through all the rain and darkness but when I drew near I saw him. Thought he was dead with all the blood. But he wasn’t and I considered for a moment to end the job because really… it would have been a mercy kill. He wouldn’t survive those injuries and even if he did he would be a vegetable. I mean… look at that head wound!But something in the way he was dumped on the back of my property in his ripped police uniform and the word FAG scrawled on his chest made me help him.So now I’m here. His guardian angel, kind of ironic considering what I did in the past. I watch over his recovery, standing in the shadows where no one can see me. The docs don’t think he will ever walk or speak again. The massive head trauma caused too much damage but I think he has a strong will. I saw his eyes. There is still life and reason in him. And I will help him to get back on his feet and will wait for the day when he thanks me with his own voice. As soon as he’s strong enough I’ll bring him home with me where he can heal because he has no one else.And after that? I’m going after those fuckers who tried to off him. Because they know he is still alive…Photo Description: In the center of the photo is a dark-haired man sitting, head down, with his arms around his knees. Behind him is another man, blond and muscular, with his arms wrapped completely around the other man’s body. Their faces are hidden, but the impression is one of protectiveness and affection.This story was written as a part of the M/M Romance Group's \"Love Has No Boundaries\" event. Group members were asked to write a story prompt inspired by a photo of their choice. Authors of the group selected a photo and prompt that spoke to them and wrote a short story.",
  "genres": [
    "M M Romance",
    "Contemporary",
    "Romance",
    "Disability",
    "Short Stories",
    "Crime",
    "Novella"
  ],
  "author": "Cari Z.",
  "average_rating": "4.03",
  "url": "https://www.goodreads.com/book/show/18129160-you-get-full-credit-for-being-alive"
}