{
  "title": "Investigative Medium - the Awakening",
  "description": "Investigative Medium- the Awakening has mystery, murder, suspense, and a passionately romantic love story set in a time that history forgot.This is the story of a completely ordinary wife and mother, who woke up one morning suddenly psychic. Who knew Laine Crosby, former marketing executive at The Weather Channel, had the gift of being an Investigative Medium? Not even Laine, that is, until she moved from Atlanta to the property of an eighteenth century Maryland plantation and woke up talking to a former slave buried in her backyard! Investigative Medium - the Awakening, examines the gift that was thrust upon Laine who was at first surprised, and then upset, and over time and through experience, embracing of this new way of life. Laine’s husband, Chris, twins Annie and Caleb, and even her Jack Russell terrier “Steve” have peripheral ghostly involvement, so it is a family affair, although at first an unsettling one.Along Laine’s journey, she meets an unlikely friend, the spirit of Jannette, once nanny to the children on the plantation where she lives. Laine becomes Jannette's voice, bringing her back from the antebellum South to tell the incredible story of her life as a slave, and a tender romance is revealed. Interwoven with Laine’s personal story, are the first hand accounts of former slaves Jannette and Bill, and others.Laine finds similarities in her own life and Jannette's, and with Jannette's friendship, Laine begins her journey down a path of self discovery. Once Laine accepts her gift, it is her mother who, from beyond the grave, helps Laine find a way to surrender, and at long last give up on the life she dreamed of having, in order to have the life she was meant to live. Investigative Medium - the Awakening is first in the Investigative Medium series, a preface to future books about Laine's adventures with law enforcement, historians and archaeologists. It is a fast read and an uplifting and hopeful book for anyone who has lost a loved one. But, put on your seat belts; It's a thriller along the way!Now available as an ebook on Amazon, B&N, and Smashwords. Paperback available July 2013 (ISBN 978-1-940261-00-3)on LaineCrosby.com among other stores.",
  "genres": [],
  "author": "Laine Crosby",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/18130064-investigative-medium---the-awakening"
}