{
  "title": "True Love",
  "description": "Jude Deveraux, the New York Times bestselling author of unforgettable romance, returns with a breathtaking first book in a fantastic new series—the Nantucket Brides trilogy. Set on the magical Massachusetts island, True Love introduces characters from a new generation of Montgomery-Taggerts, the beloved family from Deveraux’s classic novels.Just as Alix Madsen is finishing up architectural school, Adelaide Kingsley dies and wills her, for one year, the use of a charming nineteenth-century Nantucket house. The elderly woman’s relationship to the Madsen family is a mystery to the spirited Alix—fresh from a romantic breakup—but for reasons of her own Alix accepts the quirky bequest, in part because it gives her time to plan her best friend’s storybook wedding.But unseen forces move behind the scenes, creaking Kingsley House’s ancient floorboards. It seems that Adelaide Kingsley had a rather specific task for Alix: to solve the strange disappearance of one of the Kingsley women, Valentina, more than two hundred years ago. If that wasn’t troubling enough, Alix must deal with the arrogant (and extremely good-looking) architect Jared Montgomery, who is living in the property’s guesthouse.Unbeknown to Alix, Jared has been charged with looking after her while she lives on the island—an easy task for him, considering the undeniable chemistry between the two. But Jared harbors secrets of his own, which, if revealed, may drive a wedge between the pair.With a glorious Nantucket wedding on the horizon, sparks fly, and the ghosts of the past begin to reveal themselves—some of them literally. Finding their lives inextricably entwined with the turbulent fortunes of their ancestors, Alix and Jared discover that only by righting the wrongs of the past can they hope to be together.",
  "genres": [
    "Romance",
    "Contemporary",
    "Contemporary Romance",
    "Paranormal",
    "Fiction",
    "Audiobook",
    "Mystery"
  ],
  "author": "Jude Deveraux",
  "average_rating": "3.97",
  "url": "https://www.goodreads.com/book/show/18129956-true-love"
}