{
  "title": "Eye Spy",
  "description": "The greatest eye surgeon of his age, Dr. Amadeus Kaine is fêted by royalty, dictators, Hollywood, and the international jetset. An epicurean of sophistication and dark obsessions, he’s devoted his life to locating the perfect food.While treating one of Central Asia’s most depraved despots, Kaine is given a little pie to eat – a delicacy reserved for guests of the president. It’s the most delicious thing that’s ever passed the surgeon’s lips, and one that has seemingly miraculous effects. All of a sudden, Kaine finds that his bald patch is growing over with thick black hair, and that his body is healing itself from the inside out. But, best of all, he realizes that his mental faculties are stimulated in ways he never believed possible. He can write books in a few hours, learn languages in a matter of days, and effortlessly solve problems from world hunger to global warming.The drawback is that the dictator’s little pies are prepared with human eyes, taken from convicts working in the opal mines. Horrified that he’s unwittingly become a cannibal, Amadeus Kaine can’t think of anything but getting his hands on some more of the illicit specialty.Obsessed in particular by green eyes, he begins hunting for victims to satisfy his wayward craving. While perfecting his method, he learns to appreciate the subtleties in taste. As he does so, a terrible affliction strikes – Occulosis.An eye disease that has jumped the species gap from industrialized poultry farming, the virus rips through society, robbing the masses of their sight. The only man who can save the world is the inimitable Dr. Kaine, who is himself on the run.One of the strangest tales of obsession, mania and intrigue ever told, EYE SPY will quite literally change the way you see the world.",
  "genres": [
    "Fiction",
    "Science Fiction",
    "Horror"
  ],
  "author": "Tahir Shah",
  "average_rating": "4.27",
  "url": "https://www.goodreads.com/book/show/18130246-eye-spy"
}