{
  "title": "Quell'attimo di felicità",
  "description": "Nicco è giovane, ironico, spiritoso, perfino profondo.C'è solo un piccolo problema: la sua ragazza, Alessia, l'ha lasciato dicendogli soltanto \"Mi dispiace\". Per lui questo è impossibile da accettare: un anno di fidanzamento stupendo, allegro, intenso cancellato senza nessuna spiegazione.Per fortuna che c'è Ciccio, ex compagno di scuola ai tempi del liceo un po' boro, molto simpatico e pieno di energie, che trascina Nicco per feste, aperitivi e cene. Ciccio non l'ammazza niente e nessuno. Da un anno ama due fidanzate in contemporanea, lavora con internet e smercia musica e film illegalmente. E fa tutto come se fosse la cosa più normale del mondo. È uno che si arrangia, ma lo fa alla grande. Non si fa nessun problema a cavalcare le occasioni che la vita gli serve su un piatto d'argento.Nicco no. Nicco si fa un sacco di problemi ed è azzoppato da molti rimpianti. Da quando suo padre non c'è più si colpevolizza per tutte le volte che non gli ha detto ti voglio bene.E si dà dello scemo per tutte le volte che sentiva di amare Alessia, senza mai trovare le parole per dirglielo.Una sera in cui Roma è \"friccicarella\" arrivano nella sua ammaccata esistenza due turiste americane. Ciccio e Nicco le arpionano come solo gli italiani sanno fare. L'estate, la bellezza e la voglia di vivere un sogno si impossessano delle giornate dei quattro ragazzi con la vita in tasca e il vento nei capelli, offrendo a tutti i protagonisti una chance di felicità. Riuscirà Nicco a fare entrare la straniera nel suo cuore? Darà finalmente voce a questo nuovo sentimento? Sarà capace di chiudersi il passato alle spalle e godersi questo presente, anche se dovesse durare solo un attimo?Federico Moccia, lo scrittore che ha reinventato il romanzo d'amore con Tre metri sopra il cielo e Scusa ma ti chiamo amore, racconta di quel momento in cui troviamo il coraggio per dire \"Ti amo\" illuminando il mondo con l'abbagliante fuoco di quell'attimo di felicità.",
  "genres": [
    "Romance",
    "Contemporary Romance",
    "Contemporary"
  ],
  "author": "Federico Moccia",
  "average_rating": "3.10",
  "url": "https://www.goodreads.com/book/show/18130788-quell-attimo-di-felicit"
}