{
  "title": "Faceless",
  "description": "A pretty teenage girl is found dead in the woods, her face horribly mutilated. A few days later, a second girl, also strikingly beautiful, is attacked in a similar fashion.Who would do such a brutal thing—and why?Is there some sort of psychopathic monster lurking out there, preying upon vulnerable females? Or were the victims targeted for some reason by someone they knew?It’s up to two of Fallsburg’s finest, Detective Jean Whitley and her new partner, Marty Keal, to find out who’s responsible for the grisly crimes.When she starts digging up clues, Jean is startled to learn that the crime has hit uncomfortably close to home. The victims—and many of the potential suspects—are classmates of Jean’s fourteen-year-old daughter, Bethany.To make matters worse, Bethany’s behavior has drastically changed. Jean’s sweet, loving child has become a sullen, secretive stranger.How much does Bethany really know about the victims—and the crimes that have taken place? Did Bethany’s hunky new heartthrob have anything to do with the crimes? And why does the mounting evidence keep pointing to a popular parish priest?Dawn Kopman Whidden’s newest book, Faceless, returns readers to the town of Fallsburg, New York, as seen through the eyes of Detective Jean Whitley, two years after the events of Whidden’s previous book, A Child is Torn.Suddenly deprived of her longtime police detective mentor and friend, Jean is forced to take the lead in this latest investigation, while breaking in a new partner.As they dig deeper into the case, Jean encounters threats to her career, her family relationships, and possibly even to her own daughter’s life.Through it all, Jean and Marty must unravel a multi-layered mystery and put a face on the unseen villain, before anyone else ends up dead…and faceless.",
  "genres": [
    "Mystery",
    "Audiobook",
    "Psychological Thriller",
    "Thriller",
    "Detective",
    "Crime"
  ],
  "author": "Dawn Kopman Whidden",
  "average_rating": "4.41",
  "url": "https://www.goodreads.com/book/show/18130714-faceless"
}