{
  "title": "Big Bad Alpha",
  "description": "As the Ashland Pack series continues into the second book...Despite helping to defeat the dark wizard Magnus McPherson from taking over all the werewolf packs, vampire clans, and Twister Council, and rescuing his sister, Adrianna, The Trinity, instead of feeling triumphant, Mace McDonald, Alpha, is restless, irritable, and starting to be quite unpleasant even with his family and friends.Mace recognizes the changes in himself but for the life of him, he doesn't know what the problem is. Or does he? He plays it off as pressure from the influx of new members to his pack along with members from the vampire clan and Twisters Council. Plus, the stress from an unknown evil that is still plaguing the town. Yeah, that’s his story and he is sticking to it, but the people close to him feel it is something else and decide that maybe he needs a little shove in the right direction.After Lexy Redden and her parents' petition to the become members of the Ashland Pack is accepted, they move into town to start a new life. Lexy is thrilled. She is a powerful witch in her own right, but life hasn't been easy. She finally feels she has been given the opportunity to make a life for herself, instead of depending on others. Reece Phillips and his sister, Star move to Ashland with great hopes of finding a place to call home. It has been a long road for Reece since he has been on his own for quite a while, but he is now responsible for his sister, after the death of their parents. Once without a pack to call his own, in Ashland, he finds new, honest friends, and when he is appointed Beta of the pack he is determined to do well considering he is the new wolf in a developed pack with powerful leaders. Can he find a place for himself and give his sister a chance to thrive within a pack again? Or will he be the lone wolf again, never finding his true place?Sparks fly when Mace and Lexy meet but both fight the mating pull until it becomes impossible when Mace introduces his new Beta Reece Phillips. Mace can't explain why he feels connected to Lexy, but also feels a strong pull to Reece. He soon realizes they are a triad, and sets about getting to know his mates.When Lexi's newfound freedom is challenged, and her past troubles catch up with her, does she run as per her usual response? Or does she stay, stand her ground, and hope that in the end she is still alive to enjoy her newfound freedom and happiness?The Ashland Pack faces many changes along with evil, and the added strain of added members. Follow their story as you read how separate groups come together to start building a defense against an evil that is coming, but they have yet to find out what the evil is or whom? How do you prepare when you don't know what you are facing? This book is intended for 18+ readers. Sexually explicit content. Contain a ménage [MFM] romantic relationship..",
  "genres": [
    "Menage",
    "Shapeshifters",
    "Paranormal",
    "M F M",
    "Paranormal Romance",
    "Witches",
    "Werewolves"
  ],
  "author": "Bryce Evans",
  "average_rating": "4.30",
  "url": "https://www.goodreads.com/book/show/18130805-big-bad-alpha"
}