{
  "title": "Love Conquers All",
  "description": "The first book in the Number One Bestseling Science Fiction Series . This series is Space Opera at its finest. All seven books in the series have been number one bestsellers at Amazon's Science Fiction Series. The following review describes the series review is Love Conquers All I was amazed at Saxon's beautiful re-creation of some of the best Golden Age SF. There just wasn't enough of it written. Modern authors usually don't or won’t get into the spirit of a good Space Opera. Saxon has real heroes (smart ones, great space battles, grand alien empires and bad guys you can love). He has it all. The characters are pure types. They are also powerful. What really made this book great was the marvelous style. His pacing and scene cutting remind me of E.R. Burroughs. Sharp! Fast paced and quick, the battle scenes remind me of Drake. I am so grateful to read a book that is not dripping PC (sorry PC police!). A true blast from the past, I cannot wait to read the rest of the series. I only wish more authors had the ability and courage to write like this. E.E Smith would be proud.A young boy born with unique psychic abilities.An ancient alien artifact he accidently discovers.Now Earth is targeted for total annihilation by 50,000 warships.In this epic story, Saxon Andrew takes us into the future and the lives of human and nonhuman characters, some we can easily relate to, and others who are a bit different. Along with a hearty dose of battles and spaceships, this is a story that offers humor and a tale of enduring love against the backdrop of galactic war on a grand scale. The following is an excerpt from the Dorg sat in his command chair on board the Alliance Flagship War Weapon and watched as his fleet was destroying the humans’ ships. He heard his bridge crew cheering but he couldn’t help thinking, “This is too easy. This fleet couldn’t have defeated our ships at the Human Colony World.” Then he said, “Communications, put a picture of one of those human ships that was just destroyed on my display.” A picture of a small ship suddenly appeared on his console. He looked at it for a minute and then pulled up a picture of the small human ship that had killed two heavy cruisers. He put it next to the ship that had just been destroyed; they looked nothing alike. His internal alarms went off at full blast; he stood and yelled, “Order the fleet back into formation!” His crew stopped cheering and looked at him like he was crazy. “Do it now; we’re being set up for a trap!” His crew hesitated, looking at each other for just a moment, and then started issuing orders, but that small hesitation proved fatal; the human fleet ripped into the Alliance ships like a tsunami.",
  "genres": [
    "Science Fiction",
    "Military Fiction",
    "Space Opera",
    "Fiction",
    "Audiobook",
    "Amazon",
    "Fantasy"
  ],
  "author": "Saxon Andrew",
  "average_rating": "3.99",
  "url": "https://www.goodreads.com/book/show/10892155-love-conquers-all"
}