{
  "title": "Knock Love Out",
  "description": "LILLA KING: 30-something married marketing execLILLA KING is a good wife. She cooks, cleans and has dinner waiting when her husband gets home. But there's something missing. Something Lilla desperately craves, needs. And the one man who's supposed to provide it is completely and utterly clueless. But Lilla knows it's just a matter of time before things change. Before she finds what she desires. The one thing standing in her way? Her marriage. A trip to the grocery store leaves Lilla unable to keep her fantasies at bay. One look at the beautiful man working in the produce section has her sneaking out of the house and lying to her husband. One smile from him has her buying push-up bras and dancing stupidly in the aisles. One kiss makes her question what true love is. One night with CASH VALENTINE reveals she isn't the only one hiding secret desires.What if the love you've always wanted, dreamed possible, and craved was right there for the taking? What if you could have everything you've always wanted, if only you didn't belong to another?CASH VALENTINE: 24-year-old artist and grocery store clerk\"I want to knock her love out. I want to pull it from her chest while it’s beating fervently and be slapped for doing so. To play. To rumble. Truth and lies. Ugly sin and the prettiest fucking thing I have ever seen.\" --Cash24-year-old CASH VALENTINE has always followed his heart. A free spirit and an artist, Cash passes the time working in his father's grocery store. When not goofing off with his friends at work, he's getting grief from his dad for being irresponsible. But Cash knows it's only a matter of time before something changes. And then one day, Cash's world shifts, and he can't get the woman he met in the check-out lane out of his head. What started as flirtatious conversation with a muse, turns quickly into stolen moments with the love of his life. But what happens when the love of your life belongs to another man? And what if that man owns everything your family has worked for? What would you risk for true love?KNOCK LOVE OUT is a new adult crossover that will leave you wanting more. Told from both Lilla and Cash's points of view, readers will learn first-hand what it's like coming of age, falling madly in love and doing so with another man's wife, while watching the heartbreaking erosion of Lilla's marriage as she runs into the arms of another.",
  "genres": [
    "Romance",
    "New Adult",
    "Fan Fiction",
    "Contemporary Romance",
    "Contemporary"
  ],
  "author": "Pella Grace",
  "average_rating": "3.60",
  "url": "https://www.goodreads.com/book/show/18131156-knock-love-out"
}