{
  "title": "The Devil's Tattoo",
  "description": "**NO LONGER AVAILABLE** \nThe Highway to Hell or the Stairway to Heaven?\nZoe Granger picked up her first guitar the day her heart was smashed into a billion pieces. It was a way to keep her mind off her inevitable downward spiral, but music soon became her escape. She's been burned too many times to tell and is just happy to coast through life, never putting herself out there. That's until her best friend Dee suggests they start a band and suddenly she finds herself not just a part of it, but fronting the whole outfit.They call themselves The Devil's Tattoo and when they release their debut EP, it rockets to the top of the charts and it's like an overnight fairytale. Contracts, photo shoots, royalties and interviews are heaped onto the shy Zoe and it's like she's finally found her place. Then comes the phone call that changes everything. They've been asked to co-headline a tour with one of the hottest bands of the moment, The Stabs and Zoe will never be the same again.Will Strickland is one fourth of the hottest indie rock band to ever grace the airwaves. He's the bass player in The Stabs, hot as hell and could have his pick of any girl that flings herself at him. But he's only got eyes for Zoe and she has no idea why he'd bother. She's got one hell of a trust issue and an attitude to boot and Will seems to be the one who wants to tame her, but is he game enough?The Devil's Tattoo and The Stabs go on the road and it's either going to be a highway to hell or a stairway to heaven. Only time will tell who will come out on top and Zoe's determined to do it without getting her heart broken… again.The Devil's Tattoo is a rock'n'roll romance set in Australia. It's a story about two people learning to love again through the one thing they know best, music. It has a dose of drama, some colourful language, a HEA and some sex scenes. It's a stand alone novel within a series. It's recommended for readers 18 and up.",
  "genres": [
    "Romance",
    "New Adult",
    "Music",
    "Contemporary Romance",
    "Contemporary",
    "Musicians",
    "Abuse"
  ],
  "author": "Nicole R. Taylor",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/18131223-the-devil-s-tattoo"
}