{
  "title": "Nolan Trilogy: Box Set",
  "description": "What happens when you fall in love with your best friend's father... in the 1950s... the perfect \"innocent\" backdrop for this wicked coming-of-age romance trilogy!--------- FROM NEW YORK TIMES BESTSELLING & AWARD WINNING AUTHOR SELENA KITT --------- \"It's like Flowers in the Attic meets Eyes Wide Shut...\" \"Lead us not into temptation...\" ~Matthew 6:13 NOLAN TRILOGY COMPLETE SET This series has over 100 Amazon Reviews and an average 4.5 rating! Fans say, \"This is the BEST trilogy I ever read!\" TEMPTATION CONFESSION GRACE This edgy, page-turning saga isn't just a trilogy, it's an enthralling reading experience, a non-stop roller coaster ride of emotion that will keep you on the edge of your seat, giving you cliffhanger after cliffhanger until the final, jaw-dropping climax. The mystery and secrets revealed in this new Selena Kitt Classic will have you praying for forgiveness before it's all over, but in the end, will restore your faith in the triumph of the human spirit and the overwhelming power of love. TEMPTATION What happens when you fall in love with your best friend's father? Leah is a good, Catholic girl, and she and Erica have been best friends since their first communion. Sure, Erica's father is handsome and charming, but Leah spends so much time at the Nolan's--just Erica and her famous, photographer father now, since Erica's mother died--that she's practically part of the family. Both girls have led privileged, sheltered lives and are on the \"good girl\" track at St. Mary Magdalene's Preparatory College, Leah pursuing her love of dance and Erica sating her endless curiosity as editor of the newspaper. Neither of them could have ever imagined that one fateful discovery will not only push the boundaries of their strict, repressive upbringing, but the bonds of their friendship as well. Leah certainly never could have imagined finding herself torn between her best friend and her best friend's father. Sure, Leah's mother had always talked about Mr. Nolan as \"a catch,\" but Leah herself had never thought of him as anything other than just Erica's dad--until the girls discover something darkly erotic under Mr. Nolan's bed, a deep, shameful secret that will not only lead them into temptation, but will deliver them into a far greater revelation than any of them could ever have imagined. If you read the original Under Mr. Nolan's Bed, you will find this retelling a richer experience with deeper secrets to reveal. CONFESSION The shocking discovery best friends Leah and Erica have made under Mr. Nolan's bed has them down the wicked path of temptation, both girls veering far from the narrow path dictated by their strict Catholic upbringing, and their sexual transgressions have had unintended consequences. Erica finds her life turned upside down when Leah falls for Erica's father, but just as Erica is beginning to accept their love for each other, Leah disappears. Bewildered and abandoned, Erica and Mr. Nolan are faced with sadness and confusion at their loss, but while Mr. Nolan spirals into mourning, Erica is determined to find her friend. Erica can't possibly know why Leah has vanished, but when she enlists the help of Father Michael, her search and the real reason for Leah's disappearance intersect to uncover a multitude of shocking confessions and a secret that will shake not only the foundation of their faith, but the entire institution of the Catholic Church itself. GRACE Childhood friends Leah and Erica have been sacrificial lambs at the altar of a scandalous corruption within the Catholic Church, violated by those who have, in their lust for power, turned the sacred profane. The mystery of Leah's disappearance results in a long-awaited reunion, but it is tainted by both their loss of innocence and a deep, unfathomable sorrow, which only leads to more secrets.",
  "genres": [
    "Erotica",
    "Romance",
    "BDSM",
    "Dark",
    "Adult",
    "Menage",
    "New Adult"
  ],
  "author": "Selena Kitt",
  "average_rating": "3.98",
  "url": "https://www.goodreads.com/book/show/18133213-nolan-trilogy"
}