{
  "title": "Spread Your Wings - a Collection of Princess and Dragon Stories",
  "description": "Featuring stories written by professional children’s authors from around the world, this collection of Princess and Dragon stories will inspire and delight both you and your child. Adventures, mysteries, magic, love and more await in this exciting collection. Designed to be read aloud to children of all ages, these stories will teach and instill a love of reading - the most important aspect in developing literacy - as well as create many magical moments spent together in each others arms for story time.Join the action in this collection of 31 original princess and dragon stories - one for every day of the month!Authored by knowonder! publishingCreated by Phillip ChippingContributions by Laird Long, Ann Burnett, Jonathan Kemmerer-Scovner, Rolli, Amanda Hill, Cynthia Reeg, Anne E. Johnson, Debra Friedland Katz, Holly Stacey, Carolyn Findlay Davis, Tracey Glasspool, Kai Strand, Christine Marie Alemshah, Joy Newbold, Savannah Hendricks, Julie Sandpiper, Nancy Julien Kopp, Jennifer Moore, G.R. LeBlanc, Laura Thomas, Lance O. Redding, Bryan Hansen, Jill Tinker, David Turnbull, Shari L. Klase, Shari L. Klase, Elizabeth Glann, Rosemary Gemmell, Suzanne Purvis.Editor-in-chief Kathy Sattem Rygg Volume: 5A collection of 31 fun and original stories from knowonder! Never run out of short, fun stories again.Great for bedtime, story time, or just ANY time!Share the joy of story time with your child as often as you like (we recommend daily) and \"know the wonder\" of their imagination, as well as the love and joy you experience together.Stories in this volume include:1. Spread Your Wings2. The Princess Who Would Not Eat3. The Hedge Dragon4. The Dragon Tree5. Max's Rainbow6. The Dragon Artist's Tale7. A Dragon in the Ice Cream8. Princess Phoebe Finds a Job9. The Ice Dragon10. Spencer the Unique, Exceptional, Very Special Dragon11. Magnificent Maude12. Kell13. Princess Pavlova and Duffy Dinosaur14. Kingdom of the Dragons15. Ayden and Emma16. Tinky's Wish17. There's a Dragon in the Library18. Royal Wishes19. Dragon's First Flight20. The Fiery Princess21. The Lonely Dragon22. Princess Fluffy and the Castle Cloud23. Danny Dragon and the Lost Laugh24. A Dragon on the High Hill25. Dragon's Play26. The Golden Hamster27. Finding the Perfect Job for a Dragon28. Princess Poppy and the Little Dragon29. A Royally Rotten Red Day30. Blithe and Mirth: A Jolly Tale31. Loralee's LizardKnowonder Publishing brings you the fifth book in a series that provides you with a new story for every single day of every single month! That's right. A new story, every single day.Enjoy hours of reading fun with your child. Explore new worlds, go on adventures together, learn new words and concepts and more! These stories will not only give you and your child a wonderful opportunity to spend time together, they will also lay the foundation for your child to become a successful reader, student and grown-up.Reading to, and with, your children each day is the most important thing you can do for them, both socially and economically. Studies show that literacy is the foundation of all learning. And nothing gets children more interested in reading than having new content every day.So jump on in and read a story every day with/to your child, starting today!",
  "genres": [],
  "author": "Laird Long",
  "average_rating": "4.40",
  "url": "https://www.goodreads.com/book/show/18133239-spread-your-wings---a-collection-of-princess-and-dragon-stories"
}