{
  "title": "Beautiful Illusions",
  "description": "\"Fan-freaking-tastic book. Ryan is more screwed up than Christian Grey, Gideon Cross, Tony Rawlings, etc....I loved this book, there was a TON I could relate to in this book, even right down to Iris being in the legal industry and Ryan and Iris were SCORCHING hot together.\" - RomFan Reviews Over 150,000 readers have discovered the Gallagher Family steamy romances. Here is the book that started it all...What is this beautiful man doing in my law office? He certainly isn't here for me. I'm just an average woman, struggling with running a two-bit law office. You've probably heard that attorneys all drive new Beemers and live in million dollar condos, right? Well, I'm decidedly not that kind of attorney. I'm more of the beater car, forget to pick up mail, always run late so that other attorneys hate me type of attorneyIn other words, I don't exactly have my s***t together.What is this beautiful man doing in my law office?Oh, right, I've already asked that question. But it's worth asking again.Imagine my embarrassment when he tells me that we've slept together. And my shock when he tells me that he wants it to happen again.Am I being punk'd? Nope, that show hasn't been on for over a decade.I mean, he's the most beautiful man I've ever seen. And a gazillionaire.Seriously, what is this beautiful man doing in my office?I soon find out. And I also find out that looks and wealth are deceiving. Because this guy is screwed in the head and has gone through things that nobody should ever have to even contemplateAnd he sucks me in, too. Which ends up with my life being threatened.But I'll gladly take the hit, because he's not just beautiful. He's good.This is a 100,000 word Cinderella story that ends with a HEA, eventually. But there are lots of twists and turns getting there. Which is all the fun!★★★★★I loved this book. I had a very hard time putting it down. I stayed up late to just continue to read the book. I normally read vampire novels. But there was something in this book that changed that for me. I even read the 50 shades of grey series. This book series is loads better. I fell in love with the characters...I would love to give it more than 5 stars. I would to give a thousand stars!!!! It is a must read. Kindle Reader★★★★★I wasn't sure i would like this book but thought i would at the very least attempt to read the first half and go from there . Once I started reading it , I could hardly out it down ! I read this all night and morning until I finished it, cute story! I bought the next two and can't wait to dig in. Great writing Kindle Reader★★★★★I was intrigued from the beginning to the end. Every time I expected \"a happily ever after\" something else would happen. These characters are completely believable and except for the extreme wealth we may all know someone like them. Kindle Reader★★★★★ I could not put this down it is so good I mean GREAT. REALLY great book to read, thanks for a wonderful book...........Kindle Reader★★★★★This book is a gritty, everyday, insecure, everyday life of two people finding their way to each other. I cried more times in this book...\"",
  "genres": [
    "Romance",
    "Erotica",
    "Fiction",
    "Contemporary Romance",
    "Amazon",
    "M F Romance",
    "Erotic Romance"
  ],
  "author": "Annie Jocoby",
  "average_rating": "3.43",
  "url": "https://www.goodreads.com/book/show/18133569-beautiful-illusions"
}