{
  "title": "Mordred and the King",
  "description": "It is the sixth century. The classical world is dying, rapidly being replaced by the world of the Christians.Prince Mordred is the son of Morgan le Fay, the witch-queen devotee of the Great Goddess, who rules Wales. Morgan and her fellow cultists have for years nurtured a plan to regain control of England, the Christian country ruled by Morgan’s brother, King Arthur, and to destroy everything Arthur has built. And Mordred is key to their scheme. But he has plans of his own.On a hunting trip to the border of Wales, Arthur and his party lose their way and end up in Morgan’s realm. Visiting her castle, Arthur is glimpsed by young Mordred, who falls instantly, hopelessly in love with him. In no time Mordred begins to plan to escape from his mother and join Arthur in England.But before he can act, his mother carries him off on an odyssey that crosses the breadth of Europe. Everywhere they witness signs of their dying civilization. Finally they arrive at ancient Colchis, center of the Goddess’ cult, where Mordred encounters a mystical age-old evil that changes him forever.Newly empowered by his experience, Mordred escapes from his mother and makes his way across the continent, to England and Arthur. Arthur welcomes him warmly to Camelot, and a tender, loving relationship soon blossoms between them. But there is opposition to their love. Mordred is Morgan le Fay’s son, after all, which raises suspicions that he is a spy or an assassin in waiting.Arthur is compelled to go to war against his estranged wife Guinevere, who is in France with her lover Lancelot. While he is off making war, Morgan appears at Camelot to make one last bid to recruit Mordred back to her side, urging him to kill Arthur and seize the throne of England. But Mordred rebuffs her still again. So Morgan musters her forces and prepares for all-out war against Arthur and his Christian knights. And its final outcome is anyone’s guess.Rich in historical detail and epic in its chronicle of the worlds of Arthur, including those of his romantic and sexual desires, Mordred and the King is a sweeping journey through a retelling of the ancient legend.",
  "genres": [
    "Fantasy",
    "Historical",
    "LGBT",
    "M M Romance",
    "Historical Fiction"
  ],
  "author": "John Michael Curlovich",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/18134119-mordred-and-the-king"
}