{
  "title": "For The Sub",
  "description": "FROM INTERNATIONAL BESTSELLING EROTIC ROMANCE AUTHOR SIERRA CARTWRIGHT‘Even Racier Than Fifty Shades’ ~ Mail Online‘Whenever I think that Sierra Cartwright has out done herself with a previous book, she proves me wrong time and time again. Thank you Ms. Cartwright for being talentedly blessed.’ ~ Blackraven's Reviews/p>Book five in the Mastered series.His heart wasn't in it... Dom Niles Malloy has locked his favourite flogger in a drawer and has all-but left the lifestyle, but then Brandy Hess shatters his solitude and shakes up his life, challenging him to fully live again.What you see isn't what you get...Though he was once a respected and well-known Dom, Niles Malloy rarely attends functions at the Den, and he has no interest in ever having another permanent relationship. He satisfies his occasional desire for kink by playing with subs who have no expectations.Professional sub Brandy Hess has known Master Niles for years, and when he invites her to play with him, she accepts. But she's unprepared for the reaction she has to his intense brand of play. In their shared, emotionally intimate moments she sees the weariness in his features, and she has a dangerous and compelling urge to know him better.Experience has taught her to never again settle for less than a man's complete commitment, yet when she runs into him outside their normal setting, neither can deny the potent and pulsing attraction. He's much, much deeper than she imagined, and she soon realises he's everything she wants and doesn't need in a man.As she surrenders to him a second time, Brandy wonders if she's lost her sense of self-preservation. She's attracted to an enigma, a man with an edge, someone as remote as he is demanding, and her life will never be the same...",
  "genres": [
    "BDSM",
    "Romance",
    "Erotica",
    "Erotic Romance",
    "Contemporary Romance",
    "Contemporary",
    "M F Romance"
  ],
  "author": "Sierra Cartwright",
  "average_rating": "4.19",
  "url": "https://www.goodreads.com/book/show/18134480-for-the-sub"
}