{
  "title": "Untamed",
  "description": "Life has a way of facing us down when we least expect it. Moments that become overtaken in milliseconds by shifting winds, instincts, impulses or subconscious desires that can blindside us without warning. The measure of life can be the way we ride these changes, weather these storms and extricate ourselves from the wreckage. As we do this, we will notice, not everyone makes it through intact, or makes it through at all, for that matter. The debris piles up in the soul, the scars last forever. This is a collection of stories that plunge the senses deep into the tactile memories of those moments and give the undiluted vision of the wilderness inside the last acts of desperate hearts and pathological minds. There is a touching grace that is woven in between the chaos and order of the story as it unravels in each vignette. Sometimes it is only a slender thread that traipses off into the pathos, but it is there throughout in the voice of the humanity as it is besmirched, battered and bruised, but never is driven into a complete submission. Jack Grisham spins these tales from the heart, even from the point where it has been bruised or torn asunder, straight out into the universe as a primal cry of a wild beast let loose on wanton rampage. The words are compacted into dangerous bludgeons in one voice, then lilts into sorrowful songs of stoic suffering in another. The poignant melodrama that unfolds in each story is crafted as artistically as stone arch on a rocky point that juts out into the stormiest of seas. All the while it wears the cool skin of a survivalist creature that defies any cliché pantomime of trite language or colorless imagery. This skin is worn as wild adornment in rugged demeanor as it struts into dangerous territory where instincts rule the animalistic urges and self-control is a bargain that begs to get struck. This collection of streetwise encounters is an esoteric submergence in a world gone mad, taken to its limits, then taken a bit further down the road for a ride that will send some chills up the spine of the most jaded cynic, yet give relief to the most beaten down souls in search of redemption. Jack Grisham creates a perspective that can easily be identified with, but seldom gets the opportunity to have a voice of its own, especially so clear and distinct a voice as it is given here, in line after line, all throughout every narrative, from every angle. The stories in this collection come punctuated with the edgily artful illustrations of Scott Aicher. Each piece gives dimension and representation to the story and helps to make the book into a moving visual experience that conquers the senses by setting them free to envision this world that is outlined in the story, but accentuated in the artwork as well. The result is a tandem realization of the wordsmith and the graphic design into a singular vein of trajectory that helps launch the mind of the reader full tilt into the cosmos and back. Scott Aicher has definitively captured the essence of the writer’s intentions and has connected them in a way that makes for some vivid projections that illuminate what even the blind dog can’t see.",
  "genres": [],
  "author": "Jack Grisham",
  "average_rating": "4.14",
  "url": "https://www.goodreads.com/book/show/18134935-untamed"
}