{
  "title": "The Dickens Mirror",
  "description": "Critically acclaimed author of The Ashes Trilogy, Ilsa J. Bick takes her new Dark Passages series to an alternative Victorian London where Emma Lindsay continues to wade through blurred realities now that she has lost everything: her way, her reality, her friends. In this London, Emma will find alternative versions of her friends from the White Space and even Arthur Conan Doyle.Emma Lindsay finds herself with nowhere to go, no place to call home. Her friends are dead. Eric, the perfect boy she wrote into being, and his brother, Casey, are lost to the Dark Passages. With no way of knowing where she belongs, she commands the cynosure, a beacon and lens that allows for safe passage between the Many Worlds, to put her where she might find her friends—find Eric—again. What she never anticipated was waking up in the body of Little Lizzie, all grown up—or that, in this alternative London, Elizabeth McDermott is mad. In this London, Tony and Rima are “rats,” teens who gather the dead to be used for fuel. Their friend, Bode, is an attendant at Bedlam, where Elizabeth has been committed after being rescued by Arthur Conan Doyle, a drug-addicted constable. Tormented by the voices of all the many characters based on her, all Elizabeth wants is to get rid of the pieces under her skin once and for all. While professing to treat Elizabeth, her physician, Dr. Kramer, has actually drugged her to allow Emma—who’s blinked to this London before—to emerge as the dominant personality…because Kramer has plans. Elizabeth is the key to finding and accessing the Dickens Mirror. But Elizabeth is dying, and if Emma can’t find a way out, everyone as they exist in this London, as well as the twelve-year-old version of herself and the shadows—what remains of Eric, Casey, and Rima that she pulled with her from the Dark Passages—will die with her.",
  "genres": [
    "Fantasy",
    "Young Adult",
    "Horror",
    "Science Fiction",
    "Mystery",
    "Horror Thriller"
  ],
  "author": "Ilsa J. Bick",
  "average_rating": "3.52",
  "url": "https://www.goodreads.com/book/show/18135513-the-dickens-mirror"
}