{
  "title": "Viking Warrior",
  "description": "In 9th century Denmark, a child born to a slave is also a slave, and the property of his mother’s master. Halfdan, the son of an Irish noblewoman and the Danish chieftain who captured and enslaved her, has grown up a slave in his own father’s household. But the Norns, the weavers of the fates of all men, have different plans for him--although rarely do they give a gift without exacting a price. A cruel twist of fate both frees Halfdan and robs him of the mother he loves, setting him upon the path to a new destiny. But a brutal act of treachery and murder upends Halfdan’s new life, sending him on the run with ruthless hunters hot on his trail.The Strongbow Saga, an epic tale of one man’s unstoppable quest for justice and vengeance told across five volumes (the fifth and final installment to be released in 2016), follows Halfdan’s quest for justice and vengeance in a vividly drawn story which immerses the reader in the Viking world, and carries them from the Scandinavian homelands to France, Russia, England, and Ireland, through dangerous journeys and fierce battles, through love lost and found.The story’s setting is not the Viking world you might think you know. The result of almost twenty years of in-depth research, the Strongbow Saga not only weaves a fast-paced story filled with action and emotion, but also paints a detailed and historically accurate picture of the Vikings, revealing a highly developed culture in which honor was valued more than life itself, a society which was based on a strong belief in the sanctity of the law and the right to individual freedom, which had an impact on western history and culture which is seldom understood or appreciated today.",
  "genres": [
    "Historical Fiction",
    "Young Adult",
    "Fantasy",
    "Fiction",
    "Historical",
    "Adventure",
    "Medieval"
  ],
  "author": "Judson Roberts",
  "average_rating": "4.05",
  "url": "https://www.goodreads.com/book/show/10105716-viking-warrior"
}