{
  "title": "Hoe duur was de suiker",
  "description": "Filmeditie - In de historische roman Hoe duur was de suiker? vertelt Cynthia Mc Leod over de bloeitijd van de suikercultuur in de periode 1765-1779, tevens de tijd waarin de Boni-oorlogen plaatsvinden. De plantage-eigenaren leven in voortdurende vrees voor de aanvallen die marrons onder leiding van Boni uitvoeren op de plantages. Tegen dit decor beschrijft Cynthia Mc Leod in meeslepende stijl het leven van Elza en Sarith, dochters uit een Joodse plantersfamilie en hun slaven.In de onrechtvaardige slavenmaatschappij die de kolonie Suriname is, ervaren meesters en slaven dat de suiker duur wordt betaald.Regisseur Jean van de Velde schreef het scenario van de film Hoe duur was de suiker? geproduceerd door Paul Voorthuysen, vanaf september 2013 te zien in de bioscopen met in de hoofrollen Gaite Jansen als Sarith en Yootha Wong-Loi-Sing als haar lijfslavin Mini-Mini en begin 2014 als 4-delige tv-serie bij de VARA. Dit is de eerste druk van de filmeditie van Hoe duur was de suiker? Het boek bevat 10 foto's (stills) uit de film en de filmposter op de cover van het boek waarvan eerder 23 drukken verschenen, in een totale oplage van 125.000 exemplaren verkocht in Nederland en Suriname.Schrijfster Cynthia Mc Leod werd in 1936 op 4 oktober geboren in Paramaribo als dochter van onderwijzer (en naderhand minister, minister-president, gouverneur en president) Johan Ferrier. Ze schreef naast Hoe duur was de suiker? nog vier andere historische romans die merendeels het thema slavernij hebben, alle verschenen bij uitgeverij Conserve.Thea Detiger in De Telegraaf: 'Verhaal van onschatbare waarde. Geschiedenis van Suriname een bestseller.'Pieter Steinz in NRC Handelsblad over Hoe duur was de suiker?: 'De populairste roman uit de Nederlands-Surinaamse literatuur is nog altijd Hoe duur was de suiker? De roman werd gekocht door een op de vijftig Surinamers en liet tienduizenden kennismaken met een vaak vergeten geschiedenis: het reilen en zeilen van Jodensavanne.'",
  "genres": [
    "Historical Fiction",
    "Fiction",
    "Historical",
    "Dutch Literature",
    "Literature",
    "The World",
    "Novels"
  ],
  "author": "Cynthia McLeod",
  "average_rating": "3.74",
  "url": "https://www.goodreads.com/book/show/18136660-hoe-duur-was-de-suiker"
}