{
  "title": "My Mr. Manny",
  "description": "This ultimate HEA is the perfect cure for a book hangover! So, if you're a bit emotionally exhausted, but still need something to read, this is the book for you. Mia Balducci misses her childhood days and yearns for the big, Italian family that she left behind in small town Massachusetts. At the tender age of sixteen, Mia moves with her bachelor father to Los Angeles, but no matter how many years pass, it never becomes home to her. The years spent living with her father aren’t easy, especially since she can’t stop thinking about what she once had. Her enrollment in the University of Southern California promises to bring exciting changes to her life, but Mia winds up with big problems instead. When she runs into an old friend from her old hometown of Winthrop, she gets swept up in nostalgia, and she soon loses herself in a quickly-progressing romance. When the fantasy falls apart, she is left to raise her precious little girl, Lucia, on her own. The demands of Mia’s work schedule and Lucia’s needs increase, and their lives become increasingly hectic. It is soon clear to Mia that she needs help. Luckily, her life-saving cousin saves the day and brings the mother and daughter a male nanny – their new “manny.”After losing his high-pressure job on Wall Street, Dominic Roberts wants to follow his dreams to have a family. He’s already one fiancée down, and there are no likely prospects for another. In order to find the family he so desperately wants, he finds himself getting into the manny business. Since he is fully qualified to provide child care and is eager to leave New York City behind, his sister-in-law is able to land him a job in California working for his first client – the beautiful and intriguing Mia Balducci.Will Lucia like the new man in her mother's life? Will Mia? And will this new trio discover the happily ever after they all so desperately seek?",
  "genres": [
    "Romance"
  ],
  "author": "Jennifer Garcia",
  "average_rating": "3.88",
  "url": "https://www.goodreads.com/book/show/18137057-my-mr-manny"
}