{
  "title": "Allegiance",
  "description": "Allegiance, Book 5 in the Surviving the Zombie Apocalypse series, picks up two days after “A Pound of Flesh: Surviving the Zombie Apocalypse” left off.Outbreak – Day 1. Like a fragile house of cards in a hurricane, Presidents, Premiers, entire governments and their ruling bodies disappeared instantly. Some had ensconced themselves in deep underground bunkers or remained holed up in fortified strongholds, but history would tell that most had been swallowed up by the dead - never to be heard from again.Infection rates skyrocketed in the United States’ largest cities the first days of the outbreak, as the rapacious dead delivered the Omega virus with emotionless efficiency. During the ensuing days, the rest of the country and the world shared the same fate as Omega spread exponentially from within the mega population centers, pulsing into the countryside, a rotten, shambling diaspora. It had taken 3.7 billion years for man to evolve from a universal common ancestor – to stop dragging his collective knuckles - finally to emerge the dominant species, complete with shiny new iPads, Smartphones, worldwide non-stop air travel, and all manner of high tech war machines. Yet it had taken one microscopic man-made virus only three days to deliver mankind, on its collective knees, to the doorstep of extinction.WARNING - SPOILERS AHEADOutbreak - Day 15. With an estimated ninety-nine percent of the United States’ population having already succumbed to the rapidly spreading Omega virus, and countries and cities worldwide teeming with the dead, the struggle to survive the zombie apocalypse continues unabated in the high desert of Colorado.Having just returned from a hastily thrown together secret mission that saw Robert Christian—the self-proclaimed President of his “New America”—snatched from his mountain redoubt and delivered kicking and screaming to the justice awaiting him at Schriever Air Force Base, Cade Grayson, father, husband, and Delta Force operator is horrified to learn that during his absence the base had been compromised, putting his family in harm’s way.Its inhabitants still reeling from Pug’s act of terror, and recently rocked by an undead outbreak inside the wire, Schriever no longer seems an island of safety surrounded by a sea of dead, but more like a shadowy prison, danger lurking within its walls.So, with the Z-infested cities of Denver and Aurora to the north and a hundred thousand flesh eaters inhabiting Pueblo to the south, and all hope of a cure for Omega dwindling faster than the world’s population, Cade uses a mandated two-day stand down to fully weigh out his options.With each passing day, he finds himself warming to Brook’s stance that they pull up stakes and put the acres of squat buildings and fenced-in concrete in their rearview mirror for good.With his allegiance walking a tightrope between family and flag, will Cade appease Brook and move the family to Logan Winter’s compound outside of Eden, Utah? Or will he lobby her to allow the family to stay at on Schriever, so that his Delta Team—still recovering from the recent loss of soft-spoken Sergeant Darwin Maddox and the Unit’s longtime commander General Mike Desantos—will not find themselves undermanned and outgunned should another important mission crop up?Or will the talented Mister Murphy—of Murphy’s Law fame—throw a monkey wrench into the equation and alter the best laid plans of mice and men?",
  "genres": [
    "Zombies",
    "Horror",
    "Apocalyptic",
    "Post Apocalyptic",
    "Dystopia"
  ],
  "author": "Shawn Chesser",
  "average_rating": "4.35",
  "url": "https://www.goodreads.com/book/show/18137198-allegiance"
}