{
  "title": "The Unwashed Dead",
  "description": "The few law-abiding citizens left alive, living in Breakspear Gardens, have locked their doors and shut the curtains on this Friday night. They dare not venture out after the sun goes down. The druggies, drunks and feral kids rule the streets in the roughest housing project in northern England. A place where anything can be had at a low price. The Neighborhood you never want to live in.Tonight, the streets were quiet. Headaches, nausea and sickness are targeting criminals and residents alike. The untainted soon discovered the horror of their plight as their friends, family and neighbors began to die. And, be reborn!A small group of desperate survivors battle their way through hordes of blood-crazed zombies, trying to reach help just beyond the boundary. Only to find soldiers at every exit, shooting anything that moved.Can this dwindling group of terrified survivors avoid their recently dead friends, family and neighbours? They need to find another way out and fast, before the authorities’ weapons vaporise the area, transforming Breakspear into Hell on Earth!WARNING – CONTAINS GRAPHIC VIOLENCE AND STRONG LANGUAGE.Praise for The Unwashed DeadFor me, five stars aren't enough. Why? Because Woodhead's tale makes the kind of social commentary that made Romero king. Highly recommended - Dave Jeffery. Author of Necropolis Rising.He creates a very subtle aura of dread and menace that explodes across the page when the zombie carnage hits full throttle – Chip Fehd – Buyzombie.comTightly written and fast paced, this creepy read is filled with wit, humor and tension – Christopher Beck. Author of Lonesome NightThis is good-value, home-grown zombie fiction - something fans have been screaming out for – Sean T Page. Author of The Official Zombie handbook (UK)This story is the first book in the Zombie Armageddon series and continues with Walking with Zombies.19 March 2013.A new version has been uploaded that included two bonus chapters from the next stories in hte series - Walking with Zombies.",
  "genres": [
    "Zombies",
    "Horror",
    "Fiction",
    "Suspense",
    "Paranormal"
  ],
  "author": "Ian Woodhead",
  "average_rating": "3.65",
  "url": "https://www.goodreads.com/book/show/10894176-the-unwashed-dead"
}