{
  "title": "Ocean Alley Adventures",
  "description": "ASIN B00DLLCR60 moved to the most recent editionThis set has the first three books in the Jolie Gentil Cozy Mystery Series, set in the fictional Ocean Alley, NJ. Fiction you can share with your mom.The Jolie Gentil mystery series debuted in October 2011 with Appraisal for Murder, followed by Rekindling Motives and When the Carny Comes to Town. Jolie is a real estate appraiser in a New Jersey Beach town and her flexible schedule seems to allow plenty of time for trouble. With a name that translates to \"pretty nice\" (thanks to her French Canadian dad), she's used to teasing, and her embezzler ex-husband taught her more about trouble than she ever expected. But stumbling across dead bodies in the middle of the work day? That's a new one. As she reconnects with old friend and walks Aunt Madge's prune-eating dogs, Jolie tries to stay one step ahead of murder.Appraisal for MurderJolie moves to Great Aunt Madge’s B&B at the Jersey shore, taking her cat Jazz, and joining Madge's pair of prune-eating dogs. Jolie does not view this as a retreat from her embezzling ex-husband, just a smart change. She had no idea her life was about to get even more complicated.Jolie finds work as a real estate appraiser, but a low-life named Joe Pedone demands that Jolie repay her husband’s gambling debts and she runs into Michael Riordan, her high school crush. She's not sure which one is more trouble. Jolie appraises his mother's house and finds his mother dead in bed. Soon the mundane work of appraising real estate and dodging suggestions to attend the ten-year high school reunion is mixed with calls from reporters, scary suggestions from Pedone, and requests that she help the local busybody with First Presbyterian's social services work. Jolie balances her fear of Pedone, belief that Michael is innocent, and sometimes uneasy friendship with long-ago friend Scoobie. Her list of murder suspects includes Michael's soon-to-be-ex wife and a couple other beneficiaries of Mrs. Riordan's will. Those suspicions don't include Scoobie, but he makes it to the police department's list. Jolie wants to prove both friends innocent. But will Pedone's plans leave her alive to find the truth?Rekindling MotivesWhen Jolie gets tapped for some appraisal work at her 10th high school reunion she does not expect to find the skeleton of Richard Tillotson in an antique attic wardrobe in the vacant house. He vanished just after his sister married his business partner in 1929. Jolie sees a link to the Tillotson-Fisher family's Prohibition era business and works with friends Scoobie and Ramona to gather clues from old photo albums and ledgers. The albums lead to Mary Doris Milner, Richard's girlfriend, who has fond memories of him and is certain of who murdered him. But, she couldn't prove it then and her suspect is long dead, too.The present day murder of Mary Doris tells Jolie and Scoobie they are on the right track. Did the secret she kept all these years finally kill her? Mary Doris' death means Jolie won't stop until she finds her killer, whether that leads to a culprit in Richard's decades-old murder or not. Between running the food pantry at Christmas and escaping a burning building, Jolie and Scoobie hope to figure out who the modern killer is before someone else gets hurt. The trail may be cold, but the humor is hot throughout.When the Carny Comes to TownThough she never liked the idea of sitting on the plank above the dunk tank for the food pantry's carnival fundraiser, Jolie never dreamed what Scoobie saw that day would leave him battling for his life. Scoobie's ex-con mother shows up and there's a murder to add to the mix. Soon Jolie is doing more than appraising real estate. Even that is complicated by home burglars. She grudgingly seeks help from her nemesis, reporter George Winters, and tries to stay ahead of a kidnapper and murderer so she can take charge of her world again. Can she keep her friends safe? Can Scoobie recover to plan another silly fundraiser?",
  "genres": [
    "Mystery",
    "Cozy Mystery",
    "Amazon",
    "Fiction"
  ],
  "author": "Elaine Orr",
  "average_rating": "4.39",
  "url": "https://www.goodreads.com/book/show/18138158-ocean-alley-adventures"
}