{
  "title": "The Last Day",
  "description": "The Barnes & Noble Review: Christmas Eve, 1999. A comet, satellite, or perhaps the finger of God, rends the night sky above Israel and rains fiery destruction on a top-secret military research facility in the Negev. Only one mute and naked survivor struggles from the ruins in the aftermath of the explosion, then vanishes into the desert unnoticed. Drawn by the rumor of a Jordanian SCUD attack, a World News Network team producing a Millennium Eve special in Jerusalem races to the scene and stumbles upon the story of their lives, involving veteran reporter Jonathan Feldman and his cameraman Breck Hunter in perhaps the greatest story ever told. Throughout the final year of the century, messianic sects have descended upon the great religious centers of Rome, Jerusalem, and Salt Lake City to await the coming of the millennium, convinced that the Last Days are at hand. Now, in the fulfillment of prophesy, at the stroke of midnight, New Year's Eve, a beautiful and mysterious young woman appears on the steps of the ancient Israelite Temple of the Messiah just as a violent earthquake rocks Jerusalem and sets off aftershocks felt even in the Vatican. By a stroke of purest luck, WNN has it all on videotape. As a world audience primed for spectacle clamors for more, Feldman and Hunter follow the elusive figure as she appears throughout \"Apocalypse Central,\" proclaiming a new gospel of the apotheosis to Christian, Muslim, and Jew alike. Overnight, Jeza, as she calls herself, has become a worldwide phenomenon, occasioning a summit meeting of the world's religious leaders and spawning a brisk trade in T-shirts,ashtrays, and other novelties bearing her image. But despite reports of miracles, fulfillment of biblical prophecy, and even the announcement of an 11th commandment \"Thou shall honor woman as thy equal; and thou shall cherish her in unity with thy fellow man\", the question remains: Is Jeza imitating or emulating Christ? Is she messiah, antichrist, or something even more sinister; a biotech experiment gone tragically wrong? Deftly incorporating subplots that include Vatican conspiracies, IDF assassination squads, cutting-edge scientific speculation, and the doomsday prophesy of the Last Secret of Fatima, Glenn Kleier's The Last Day cleverly exploits the growing fascination with the millennium and eschatology, provoking impassioned questions about our most cherished beliefs; and delivering a suspenseful thriller of the highest order.",
  "genres": [
    "Fiction",
    "Thriller",
    "Science Fiction",
    "Religion",
    "Mystery",
    "Mystery Thriller",
    "Adventure"
  ],
  "author": "Glenn Kleier",
  "average_rating": "4.07",
  "url": "https://www.goodreads.com/book/show/1813844.The_Last_Day"
}