{
  "title": "Selkies' Skins",
  "description": "Selkies are Scottish seal people, and are considered magical shapeshifting creatures, able to interbreed with humans. Spoken of in many old stories, the females are said to make caring wives, and the men to be charming and good lovers. If their skin is captured, they will remain on land, though more is heard about women being captured than the men. If they find their stolen skin, they will return to the sea and any mate or family therein, though remaining nearby to watch over their land-children.What happens though, if a Selkie never manages to reclaim her skin before her death, and so remains with her children? What happens if her family is a magical one, and her subspecies had been created by the cooperation of sister water goddesses? Let's add in that the fisherman who captured her possessed magic of his own. Further, what if the drive to return to the sea remains strong in the offspring of these two, and as servants of these goddesses, provide their care despite being disliked and untrusted by both full blooded Selkies and humans when found out.We come then to modern times. First a fishing family, favored then by fortune and Marsali's magic, the Makay clan grew to a merchant family that went on grand voyages for the good of the Magical Community. Few now remain, and those are now waterwitches, primarily interested in tending duties set by deities that few believe actually exist, and the health of the waters both locally and planet wide.Kirsty has little choice in her fate, only how it will manifest. There are tests to pass, a place that she may have to occupy prematurely if her visions prove true, and a need to earn her sealskin to be complete. Will Etain return safe to port, and will Kirsty survive her training and test?Originally this was intended to be one book, but may end up becoming a series. The first book is planned to go to print and ebook in late December of 2013 or early January 2014. There will be separate covers for the separate editions (regular ebook, print, and illuminated edition). Currently it is being serialized as a webnovel, although readers can expect slight changes and likely expansions in the print and ebook versions.The webnovel is available for sampling at http://teresagarciaserials.weebly.com... but be warned that scenes may be either added or deleted for the print/ebook. An official sample will be uploaded here once the manuscript is through a second pass of editing rounds.Current editor: Faith Lindgren-Brown (and we all hope that we don't lose her during the writing process)Ebook Cover: Teresa Garcia and Athena Garcia (current cover is a concept cover)Print Cover: Samantha BuckleyIlluminated Edition Cover: Marantha D. Jenelle",
  "genres": [
    "Fiction",
    "Fantasy"
  ],
  "author": "Teresa Garcia",
  "average_rating": "3.63",
  "url": "https://www.goodreads.com/book/show/18138542-selkies-skins"
}