{
  "title": "The Consequential Element",
  "description": "DANIELLE MONTGOMERY thinks she’s living her life on her last nerve. But, she’s soon to realize just how strong that nerve really is.Eighteen years earlier, Danielle survived a rebel raid on an African village that had taken her mother’s life and left Danni a captive and a prize awarded to the young man who led the assault. Obasanji - the same man who turned her heart to stone and stole her soul.Now, thirty-two year old Danielle is doing her best to blend into the cityscape of Boston, where she struggles to lead a normal yet rigid life. Nothing or no one gets into her tight, little world. No one that is, except for Sarah Everett, her one and only friend, and Roland Dupre, her last surviving relative and renowned archaeologist.Day after day she deals with the lingering effects of Post Traumatic Stress Disorder. Lingering, Sarah says Danielle’s deepest desire for revenge is consuming her. It beckons from her dreams, haunts her waking hours, and festers in her empty soul. Sarah says a lot, but Danielle doesn’t hear her words over the beating drums of hatred in her heart.And then a letter written in her uncle’s hand arrives; along with it, an encrypted notebook, and a small piece of a map. The letter speaks of a fantastic discovery that he’s made deep within the Congo. One that will change the fate of the troubled United States from China’s imminent attack: a rare earth element known as Promethium, the missing element needed for the completion of Viper 6 – an unprecedented stealth missile that will secure the position of world leader for the United States. Shortly after the notebook’s arrival, Danielle finds herself interrogated and then followed by the C.I.A. General Sao, a Chinese commander stationed in Africa to mine for rare earths, enlists the aid of Major Colonel Obasanji, the current Congo rebel leader of the Lord’s Resistance Army, to track down Roland Dupre and his new discovery at all costs.With the C.I.A. on her tail, Danielle uses the disappearance of her uncle as the perfect excuse for her to return to Africa. To save him, yes, but more importantly, she may get the chance for the revenge she’s dreamed of all these many years; even at the cost of her life.Enter KAYDEN MOREAU, a mercenary hired by her uncle, and he takes his job seriously. He was hired to protect her, and that’s what he’s going to do, until he makes a near fatal mistake. He’s in love with her.Danielle finds herself leading him and a small team of men on a voyage into the harsh, remote corners of the Congo; a journey where she makes a phenomenal discovery of her own.She finds Obasanji and prepares his fate, but to her horror she learns that he’s the only man alive who can help her find her uncle and the cave where the element was discovered - and he has a price. Now, she is forced to make a choice: will she meet his demands, or is her desire for revenge more than she can bear?Danielle must endure through car chases, shootouts, kidnapping, and treasure hunting, only to be taken, once again, as a prisoner of Obasanji.",
  "genres": [],
  "author": "Dee Ann Waite",
  "average_rating": "4.32",
  "url": "https://www.goodreads.com/book/show/18139006-the-consequential-element"
}