{
  "title": "The Tree: A Natural History of What Trees Are, How They Live & Why They Matter",
  "description": "There are redwoods in California that were ancient by the time Columbus first landed, and pines still alive that germinated around the time humans invented writing. There are Douglas firs as tall as skyscrapers, and a banyan tree in Calcutta as big as a football field.From the tallest to the smallest, trees inspire wonder in all of us, and in The Tree, Colin Tudge travels around the world—throughout the United States, the Costa Rican rain forest, Panama and Brazil, India, New Zealand, China, and most of Europe—bringing to life stories and facts about the trees around us: how they grow old, how they eat and reproduce, how they talk to one another (and they do), and why they came to exist in the first place. He considers the pitfalls of being tall; the things that trees produce, from nuts and rubber to wood; and even the complicated debt that we as humans owe them.Tudge takes us to the Amazon in flood, when the water is deep enough to submerge the forest entirely and fish feed on fruit while river dolphins race through the canopy. He explains the “memory” of a tree: how those that have been shaken by wind grow thicker and sturdier, while those attacked by pests grow smaller leaves the following year; and reveals how it is that the same trees found in the United States are also native to China (but not Europe).From tiny saplings to centuries-old redwoods and desert palms, from the backyards of the American heartland to the rain forests of the Amazon and the bamboo forests, Colin Tudge takes the reader on a journey through history and illuminates our ever-present but often ignored companions. A blend of history, science, philosophy, and environmentalism, The Tree is an engaging and elegant look at the life of the tree and what modern research tells us about their future.",
  "genres": [
    "Nonfiction",
    "Nature",
    "Science",
    "Natural History",
    "Biology",
    "History",
    "Plants"
  ],
  "author": "Colin Tudge",
  "average_rating": "3.95",
  "url": "https://www.goodreads.com/book/show/181395.The_Tree"
}