{
  "title": "Summer of Love: A Time Travel",
  "description": "The classic time travel to 1967. Summer of Love is up as The Summer of Love Serials in seven affordable installments for all readers worldwide! Start at Summer of Love, Serial 1: Celebration of the Summer Solstice.The year is 1967 and something new is sweeping across America: good vibes, bad vibes, psychedelic music, psychedelic drugs, anti-war protests, racial tension, free love, bikers, dropouts, flower children. An age of innocence, a time of danger. The Summer of Love.San Francisco is the Summer of Love, where runaway flower children flock to join the hip elite and squares cruise the streets to view the human zoo.Lost in these strange and wondrous days, fourteen-year-old Susan Bell, alias Starbright, has run away from the straight suburbs of Cleveland to find her troubled best friend. Her path will cross with Chiron Cat’s Eye in Draco, a strange and beautiful young man who has journeyed farther than she could ever imagine.With the help of Ruby A. Maverick, a feisty half-black, half-white hip merchant, Susan and Chi discover a love that spans five centuries. But can they save the world from demons threatening to destroy all space and time?A Philip K. Dick Award Finalist. A San Francisco Chronicle Recommended Book. Nineteen Five-star Amazon reviews. From the author of The Gilded Age, A Time Travel (a New York Times Notable Book and New York Public Library Recommended Book), The Garden of Abracadabra, Volume 1 of the Abracadabra Series, and Celestial Girl (A Lily Modjeska Mystery) Books 1—4.On US Kindle http://www.amazon.com/dp/B00AA85YN0On Canada Kindle http://www.amazon.ca/dp/B00AA85YN0On UK Kindle http://www.amazon.co.uk/dp/B00AA85YN0On Nook http://www.barnesandnoble.com/w/summe...On all other readers http://smashwords.com/b/327561",
  "genres": [
    "Science Fiction",
    "Time Travel",
    "Fiction",
    "Historical Fiction",
    "Fantasy",
    "Young Adult",
    "Music"
  ],
  "author": "Lisa Mason",
  "average_rating": "3.94",
  "url": "https://www.goodreads.com/book/show/18139350-summer-of-love"
}