{
  "title": "Render Unto Rome: The Secret Life of Money in the Catholic Church",
  "description": "AN INVESTIGATION OF EPIC FINANCIAL INTRIGUE, RENDER UNTO ROME EXPOSES THE SECRECY AND DECEIT THAT RUN COUNTER TO THE VALUES OF THE CATHOLIC CHURCH.The Sunday collection in every Catholic church throughout the world is as familiar a part of the Mass as the homily and even Communion. There is no doubt that historically the Catholic Church has been one of the great engines of charity in history. But once a dollar is dropped in that basket, where does it go? How are weekly cash contributions that can amount to tens of thousands of dollars accounted for? Where does the money go when a diocese sells a church property for tens of millions of dollars? And what happens when hundreds of millions of dollars are turned over to officials at the highest ranks, no questions asked, for their discretionary use? The Roman Catholic Church is the largest organization in the world. The Vatican has never revealed its net worth, but the value of its works of art, great churches, property in Rome, and stocks held through its bank easily run into the tens of billions. Yet the Holy See as a sovereign state covers a mere 108 acres and has a small annual budget of about $280 million.No major book has examined the church’s financial underpinnings and practices with such journalistic force. Today the church bears scrutiny by virtue of the vast amounts of money (nearly $2 billion in the United States alone) paid out to victims of clergy abuse. Amid mounting diocesan bankruptcies, bishops have been selling off whole pieces of the infrastructure—churches, schools, commercial properties—while the nephew of one of the Vatican’s most powerful cardinals engaged in a lucrative scheme to profiteer off the enormous downsizing of American church wealth.",
  "genres": [
    "Religion",
    "Nonfiction",
    "History",
    "Economics",
    "Money",
    "Crime",
    "Audiobook"
  ],
  "author": "Jason Berry",
  "average_rating": "3.56",
  "url": "https://www.goodreads.com/book/show/10000761-render-unto-rome"
}