{
  "title": "Magical Elements of the Periodic Table Presented Alphabetically by the Metal Horn Unicorns",
  "description": "In this unique alphabet book, members of the Metal Horn Unicorn Tribe present 26 Magical Elements of the Periodic Table in alphabetical order.  Each member of the tribe has a metal horn and hooves. They also have magical powers based on the properties of their metals. Alumna starts out the book by introducing the very necessary metal, aluminum, on her element page. Dr. Zinko rounds out the alphabet by presenting facts and other fun information about the metal, zinc, on his element page.  Other members of the Metal Horn Tribe from Unimaise, plus some of their magical elemental friends, will give some great insight into the properties of 23 additional pure metals from the periodic table.  There is one special unicorn in the book whose horn and hooves are an alloy created by combining copper and zinc. Cornum, the Brass Horned unicorn will reveal some interesting things about that metal. While not all elements in the Periodic Table are represented by letters of the alphabet, some in this book, are introduced by alternate designations.  For instance, Tungsten is also known as Wolfram so “W” is used as the entry for that alphabetical letter in this book.  The letter “W” is also used as the atomic symbol for tungsten in all periodic tables. Each element page in this book contains terms that might not be completely familiar.  Refer to the definitions in the back of the book to get a clear understanding of each meaning.  There is also a fun unicorn themed Periodic Table at the back of the book.  The Metal Horn unicorns from Unimaise and their other techno-magical unicorn friends are the perfect group to introduce you to metals and other elements in the Periodic Table.  Hopefully the Magical Elements of this periodic table book will spark an interest in the magical and real world properties of all the metals and other elements known today.  You may be surprised at how prominently they feature in our every day lives.",
  "genres": [
    "Science",
    "Childrens"
  ],
  "author": "Sybrina Durant",
  "average_rating": "4.48",
  "url": "https://www.goodreads.com/book/show/100022768-magical-elements-of-the-periodic-table-presented-alphabetically-by-the-m"
}