{
  "title": "Last Mission",
  "description": "When the NOAA survey vessel discovered a wrecked Second World War German submarine on the sea floor of the Gulf of Mexico, its sudden appearance was accounted for by the undersea earthquake of September 2006. Explaining how it came to be there in the first place was far more difficult. Still more baffling than the how was the why? And its cargo... the RV Thomas Harvey ran for its life. In the final days of WW II, there were many last gasp schemes to postpone the inevitable end of the Third Reich; most would have been doomed to failure had they ever been more than gloomy after-dinner speculations in smoked-filled lounges. There were schemes, too, to build a Fourth Reich in South America, some of these were a little more credible. Having already resigned himself to inevitable defeat, Reichsleiter Bormann was deeply into the planning of one of the latter. Even as the Allies were marching on Berlin and bombing it to dust, he briefed the officer he had selected to lay the ground work for a Fourth Reich to rise from the ashes of the old. But Bormann was not the only one with a scheme, the Fuhrer, still recovering from the assassination attempt, proposed a final undertaking, a last mission to snatch victory from the jaws of defeat. Hitler's scheme was brilliant: a psychological coup that would break apart the Alliance against Germany. Bormann saw that the resources he had earmarked for his own intrigue might serve equally well for the Fuhrer's; in fact they were complementary, one a back-up for the other. They would need an aircraft, an American bomber... The planning had been meticulous, fifth columnists in America rallied to the orders coming from Berlin. Here, in the United States? The means and the target were as unbelievable as they were breathtaking; to imagine how the Americans had laboured so hard in building their own downfall.",
  "genres": [],
  "author": "Jack Everett",
  "average_rating": "4.67",
  "url": "https://www.goodreads.com/book/show/10004121-last-mission"
}