{
  "title": "Just David",
  "description": "Eleanor Porter wrote this wonderful novel two years after the runaway success of her book Pollyanna. Though also a bestseller at the time, Just David has rarely been reprinted since its release in 1916. We felt a story this good shouldn’t be so hard to find, so we decided to put it back in print last year. Now it’s in a longer-lasting hardcover.It is the story of David, a charming little boy of 10 who is suddenly transplanted from a world of music (he plays the violin) in the mountains with his father, to the provincialism of a workaday small town. But even more, it is the story of how David transplants his own character, courage and happiness into the lives of the people he meets, and wins their love and respect. Here’s what we say in the preface to the new edition:Just David is a quiet, unassuming children’s novel about an orphaned young boy with a mysterious past. David, not the typical boy found in most stories of his day, is a mixture of simplicity and complexity whose disarming innocence has a profound effect on the people he encounters. Unlike the “good bad boy” often encountered in children’s literature, David is a “good good” boy. He is not in any way “goody-goody” in the moralistic sense, but simply and purely good. David’s goodness is not a mysterious quality that defies logic and imagination, but rather a quality cultivated in him by the intentional efforts of a wise and loving father. During David’s formative years, his father secluded him from the influences of the outside world, creating a private world in the mountains filled with simple pleasures, purposeful study, and beautiful music. David’s touching story is well within the scope of the imagination, and David’s endearing innocence, engaging personality, and natural character are unforgettable.Just David struck a resonant chord in our family for several reasons. First, David’s life affirms the biblical principle expressed in the proverb, “He who walks with the wise grows wise, but a companion of fools suffers harm”. David walked with his father and became wise. Also, his story reminds us of the importance of creating the right “appetite” early in our children’s lives. David’s love of music, nature and beauty were intentionally cultivated in him by his father. Finally, there is a refreshing balance in David’s life and character that provides a literary model to emulate, especially for the more artistically-inclined boy often overlooked in literature. David is artistic, yet he knows when to be realistic. He is slight of stature, yet able to handily defend himself when necessary. He is trained and mannerly, yet he is also manly. He is sensitive, yet sensible. Whatever limitations he discovers, he meets them with strength of character.This is truly one of those books that everyone in your family will like, and will likely want to hear or read more than once. We’re on our fourth reading! It has even inspired us to have Just David days for our children when we focus on the beautiful and lovely things God has given us to enjoy. Just David is just great. Includes family discussion questions at the end of the book.--Whole Heart Ministries",
  "genres": [
    "Classics",
    "Fiction",
    "Childrens",
    "Historical Fiction",
    "School",
    "Young Adult",
    "Middle Grade"
  ],
  "author": "Eleanor H. Porter",
  "average_rating": "4.22",
  "url": "https://www.goodreads.com/book/show/1000752.Just_David"
}