{
  "title": "\"They Say\": Ida B. Wells and the Reconstruction of Race",
  "description": "Between 1880 and 1930, Southern mobs hanged, burned, and otherwise tortured to death at least 3,300 African Americans. And yet the rest of the nation largely ignored the horror of lynching or took it for granted, until a young schoolteacher from Tennessee raised her voice. Her name was Ida B.Wells.In \"They Say,\" historian James West Davidson recounts the first thirty years of this passionate woman's life--as well as the story of the great struggle over the meaning of race in post-emancipation America. Davidson captures the breathtaking, often chaotic changes that swept the South as Wellsgrew up in Holly Springs, the spread of education among the free blacks, the rise of political activism, the bitter struggles for equality in the face of entrenched social custom. As Wells came of age she moved to bustling Memphis, eager to worship at the city's many churches (black andwhite), to take elocution lessons and perform Shakespeare at evening soirées, to court and spark with the young men taken by her beauty. But Wells' quest for fulfillment was thwarted as whites increasingly used race as a barrier separating African Americans from mainstream America. Davidson tracesthe crosscurrents of these cultural conflicts through Ida Wells' forceful personality. When a conductor threw her off a train for not retreating to the segregated car, she sued the railroad--and won. When she protested conditions in the segregated Memphis schools, she was fired--and took upfull-time journalism. And in 1892, when an explosive lynching rocked Memphis, she embarked full-blown on the career for which she is now remembered, as an outspoken writer and lecturer against lynching.Richly researched and deftly written, \"They Say\" offers a gripping portrait of the young Ida B. Wells, shedding light not only on how one black American defined her own aspirations and her people's freedom, but also on the changing meaning of race in America.",
  "genres": [
    "Nonfiction",
    "History",
    "Biography",
    "Race",
    "Social Justice",
    "Feminism",
    "Historical"
  ],
  "author": "James West Davidson",
  "average_rating": "3.75",
  "url": "https://www.goodreads.com/book/show/1000832._They_Say_"
}